{"organizations": [], "uuid": "c5503a133e74be6a61757c4a078d11d10f09e0ca", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3274488/images/o-OBAMA-IRAN-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/mj-rosenberg/netanyahu-the-israel-lobb_b_7951238.html", "country": "US", "title": "Netanyahu and the Israel Lobby's War on Obama Are Undermining American Jews | MJ Rosenberg", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Netanyahu and the Israel Lobby's War on Obama Are Undermining American Jews | MJ Rosenberg", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-07T01:36:00.000+03:00", "replies_count": 0, "uuid": "c5503a133e74be6a61757c4a078d11d10f09e0ca"}, "author": "MJ Rosenberg", "url": "http://www.huffingtonpost.com/mj-rosenberg/netanyahu-the-israel-lobb_b_7951238.html", "ord_in_thread": 0, "title": "Netanyahu and the Israel Lobby's War on Obama Are Undermining American Jews | MJ Rosenberg", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama's speech yesterday, defending the Iran agreement against charges made by the Israeli government and its lobby in the United States (along with the lobby's wholly owned subsidiaries in Congress) was, for me, the worst moment yet in my long history with the lobby in general and the American Israel Public Affairs Committee (AIPAC) in particular.\nI saw something I never expected to see, something that appalled and offended me more than anything the lobby has done before. I saw the President of the United States brought to the point where he felt it necessary to give a major foreign policy address defending his foreign policy against Netanyahu and AIPAC.\nEvery charge Obama felt the need to rebut was a charge made by Netanyahu or the lobby. Obama himself conceded that when he noted that Israel is the only country in the world that opposes the Iran agreement. He should have noted that AIPAC (and its satellite organizations) constitute the only lobby operating in Washington that opposes the agreement because that is the case too.\nIn fact, Israel, the lobby, and their cutouts (like the neocons in the media) constitute the entire opposition. One top Senate aide put it to me like this: \"If Netanyahu said he could live with the deal, not a single Democrat would oppose it. Not one.\"\nThe Republicans are a different story. They oppose the agreement because they oppose diplomacy in general and, more to the point, oppose all Obama initiatives. Unlike the Democrats who oppose the deal, they aren't hypocrites who support diplomacy except when it comes to Israel. The Republicans are being true to who they are. But ultimately they don't matter because they alone cannot stop the agreement. They don't have the numbers.\nNetanyahu and AIPAC need Democrats to kill the deal and, for that, they are making the case that no matter whether the agreement is good for America, it is bad for Israel. It is also no matter that the Israeli security establishment agrees with Obama . It's Netanyahu who is calling the shots for AIPAC not Israeli generals. Nor do the views of American Jews matter. They support the agreement although it is not Jewish voters that AIPAC relies on to persuade Congress to defeat the deal: it is billionaires and multimillionaires who fund Congressional campaigns.\nThey are throwing all their weight at New York's Senator Chuck Schumer right now, the Big Enchilada among Jews in Congress and also one who says that he is the State of Israel's divinely appointed guardian. Apparently, if Schumer announces against the agreement, he will take enough Democratic senators with him to defeat the deal. The opposite is also true.\nThis whole situation makes me sick. In fact, it almost makes me ashamed to be an American Jew, knowing that this war against President Obama is organized and led by American Jews who are choosing the interests of Israel (as Netanyahu sees them) over the national interests of the United States and the American people. What a way to treat the safest and most secure home Jews have ever had: spitting in its face in the person of our president.\nI have a long history with AIPAC but, nonetheless, its behavior this time surprises even me.\nI worked at AIPAC back in the 1970's and 1980's. My first stint was in 1973-1975 when I volunteered to help out during and following the Yom Kippur War. From 1982 through 1986, I was a senior staffer there, editing its publications and serving as personal assistant to AIPAC's then executive director, Thomas Dine.\nI left AIPAC on good terms with the organization. Right or wrong, I did not leave over policy disagreements. My views on Israel did not change for another 14 years, changes that were a result of the policies of the Israeli government following the collapse of the Oslo Accords not of anything AIPAC did or didn't do.\nNow, however, I consider AIPAC to be a clear and present danger to American Jews. When AIPAC, allied with and taking orders from Israel, goes to war with the United States government in the name of American Jews, it undermines our standing as Americans. When Democratic House leaders like Nita Lowey and Steve Israel break with the president who is the leader of their party because Israel tells them to, it undermines our standing as Americans. When Chuck Schumer makes his statement declaring his opposition to or even support for (it's possible) the Iran deal while invoking Israel Israel, Israel , it undermines our standing as Americans. And when President Obama invites Jewish Members of Congress to the White House to assure them, not as US legislators but as Jewish legislators, that his policy choice is best for Israel, that too undermines our standing as American Jews.\nWe are not foreigners who happen to live in America while our hearts reside elsewhere. We are Americans, unhyphenated Americans. The lobby's war against our president--a president Jews overwhelmingly voted for twice, by the way--jeopardizes every one of us. but even more or children and grandchildren.\nIn fact, it is the lobby (and the prime minister it serves) that constitute the greatest threat we face. What a tragic irony when Israel, established to makes us safer, endangers us all.\nFollow MJ Rosenberg on Twitter: www.twitter.com/mjayrosenberg\nMore: Aipac Iran Israel Netanyahu Iran Deal Barack Obama", "external_links": ["http://www.politico.com/blogs/bensmith/0410/Schumer_Obamas_Counterproductive_Israel_policy_has_to_stop.html", "http://www.twitter.com/mjayrosenberg", "http://www.jta.org/2015/08/04/news-opinion/politics/3-top-house-democrats-oppose-iran-nuclear-deal", "http://bigstory.ap.org/article/e3b294929f4d446499e25a6983267bd1/obama-notes-israel-only-country-opposing-iran-nuke-deal", "http://www.nytimes.com/2015/08/06/us/politics/obama-urges-critics-of-iran-deal-to-ignore-drumbeat-of-war.html?_r=0", "http://thinkprogress.org/world/2015/07/23/3683546/former-israeli-security-heads-support-iran-deal/", "http://www.jewishjournal.com/iransurvey"], "published": "2015-08-07T01:36:00.000+03:00", "crawled": "2015-08-07T01:25:26.772+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}