{"organizations": [], "uuid": "54d5dac732609edb136322b0d5fb4544ff46ca57", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/alice-oleary-randall/medical-marijuana-arrests_b_7988210.html", "country": "US", "title": "Medical Marijuana Arrests: When Will It End? | Alice O'Leary Randall", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Medical Marijuana Arrests: When Will It End? | Alice O'Leary Randall", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-17T22:46:00.000+03:00", "replies_count": 0, "uuid": "54d5dac732609edb136322b0d5fb4544ff46ca57"}, "author": "Alice O'Leary Randall", "url": "http://www.huffingtonpost.com/alice-oleary-randall/medical-marijuana-arrests_b_7988210.html", "ord_in_thread": 0, "title": "Medical Marijuana Arrests: When Will It End? | Alice O'Leary Randall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Some people try to forget the day they were arrested for marijuana possession but, with the hindsight of four decades, I can say it was one of the best things that ever happened to us.\nIt was August 24, 1975 and my husband, Robert C. Randall, and I were living a rather ordinary life, just eight blocks from the U.S. Capitol in Washington, D.C. in a neighborhood that could kindly be referred to as \"pre-gentrification.\" The Metropolitan Police executed the warrant, ransacked our house and removed six marijuana plants from our sun deck. It was, of course, traumatic and life-changing.\nBut 15 months later we had parleyed our arrest into a case of historic proportions and launched the medical marijuana movement in the U.S. My late husband had glaucoma and accidentally discovered that marijuana lowered the pressures that build in the eye and starve the optic nerve. In 1975, the medical use of cannabis was barely known. In fact, we were certain that we were the only ones to have discovered this phenomena so we kept quiet and did what any sane person would do -- we broke the law to help save Robert's sight.\nThe fateful events leading to the arrest and trial are not easily compressed in the space of this article but anyone with an interest can read our books Marijuana Rx: The Patients' Fight for Medicinal Pot and Medical Marijuana in America: Memoir of a Pioneer . Our case was the first to use the concept of medical necessity as a defense and Robert's success in acquiring legal access to federal supplies of marijuana in November 1976 made him the first and only medical marijuana patient in the nation! Today Robert is acknowledged as the father of the medical marijuana movement .\nFour decades later there have been tremendous strides. Medical cannabis seems to be constantly in the news and there are 23 states that allow residents to legally use cannabis for medical purposes. Another 17 allow the use CBD oil, a non-psychoactive cannabinoid. Public survey polls show strong support for legal, safe access to cannabis for medical purposes. Last year the U.S. Congress enacted legislation that \"blocked the DOJ from using funds to target state-legal medical marijuana operations.\"\nWhy, then, are people still getting arrested for medically using marijuana?\nDon't believe that is true? Here are just a few cases: Kris Lewandowski , a U.S. Marine vet who served three tours, was using cannabis to help treat his PTSD. He was arrested at his Oklahoma home and faces possible life in prison for marijuana cultivation. In Washington the \"Kettle Five\" is a family that was legally growing marijuana for medical purposes under state law but was arrested by federal officials. In Nevada a 65-year-old man was acquitted for growing 68 plants that he used to help treat his arthritis. Although the amount exceeded the state limit (Nevada is a legal medical cannabis state), jurors took just an hour to acquit the patient. In Minnesota , a son returned home from his residence in Colorado to visit his dying father and was arrested for possessing marijuana prescribed by a Colorado physician. Ben Hallgren, a victim of irritable bowel syndrome, had cannabis edibles with him and was arrested in June 2014 despite the fact that Minnesota had passed a medical cannabis law just a few weeks before. The law, prosecutors said, did not take effect until 2015. The list could go on and doesn't include discriminatory situations such as medical cannabis patients denied federally-subsidized public housing because federal law does not recognize marijuana's medical utility. Or parents who have had their children removed because their medical cannabis, authorized by one state agency, constitutes \"endangerment\" to another state agency.\nThis chaos is likely to continue because medical cannabis laws are a confusing jumble of well-intentioned legislation designed to circumvent federal law that is a pathetic relic of an era America should aggressively put behind her. The first federal laws prohibiting marijuana, from the 1930s, were blatantly racist in their design and application. The latest incarnation, the Controlled Substances Act of 1970, is not much better, codifying the mistakes of the past with an arbitrary scheduling of marijuana in Schedule I, a decision that renders marijuana in the same league as heroin with respect to its danger. This scheduling arrangement has been repeatedly cited as incorrect beginning with the Presidential Commission headed by Gov. William Shafer in 1972 and more recently by the new chief of the Drug Enforcement Administration, Chuck Rosenberg , who acknowledged on August 5, 2015 that \"heroin is clearly more dangerous than marijuana.\"\nThe New York Times recently editorialized that \"Congress and the Obama administration remain far too timid about the need for change.\" The column went further:\nInstead of standing by as change sweeps the country, federal lawmakers should be more actively debating and changing the nation's absurd marijuana policies, policies that have ruined millions of lives and wasted billions of dollars.\nRobert and I were so fortunate. Yes, we were arrested for marijuana but our lives were not ruined. There are too many Americans who cannot say the same. In 1976, when asked how it felt to be the only American allowed to legally use marijuana for medical purposes, Robert's reply was, \"I feel like the only one to make the lifeboat.\" Thankfully that is no longer the case but the cries of drowning souls are still with us. How long will we tolerate this lack of federal action?\nFollow Alice O'Leary Randall on Twitter: www.twitter.com/alicesrq\nMore: Marijuana Marijuana This Blogger's Books and Other Items from... Medical Marijuana in America: Memoir of a Pioneer\nby Alice O'Leary-Randall Marijuana Rx: The Patients' Fight for Medicinal Pot\nby Robert C. Randall, Alice M. O'Leary", "external_links": ["http://www.amazon.com/exec/obidos/ASIN/1560251662", "http://www.hngn.com/articles/116784/20150806/new-dea-head-admits-heroin-clearly-more-dangerous-marijuana.htm", "https://en.wikipedia.org/wiki/National_Commission_on_Marihuana_and_Drug_Abuse", "http://www.americanglaucomasociety.net/patients/position_statements/marijuana_glaucoma", "http://www.amazon.com/exec/obidos/ASIN/1496170601", "http://www.twitter.com/alicesrq", "https://en.wikipedia.org/wiki/Robert_Randall_(advocate)", "http://www.inforum.com/news/3633873-colorado-resident-faces-medical-marijuana-charges-minnesota-after-traveling-home-see", "http://www.indiebound.org/?aff=HuffingtonPost", "http://ecx.images-amazon.com/images/I/518WJXCK83L._SL160_.jpg", "http://www.amazon.com/", "http://medicalmarijuana.procon.org/view.additional-resource.php?resourceID=149", "http://www.nytimes.com/2015/08/09/opinion/sunday/congress-and-obama-have-been-too-timid-on-marijuana-reform.html?action=click&pgtype=Homepage&module=opinion-c-col-left-region&region=opinion-c-col-left-region&WT.nav=opinion-c-col-left-region&_r=0", "http://ecx.images-amazon.com/images/I/51UJHm0%2BdHL._SL160_.jpg", "http://www.reviewjournal.com/news/pot-news/jury-acquits-medical-marijuana-patient-felony-charges", "http://www.naturalnews.com/050580_PTSD_veteran_cannabis_medical_marijuana.html"], "published": "2015-08-17T22:46:00.000+03:00", "crawled": "2015-08-18T01:07:14.399+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}