{"organizations": [], "uuid": "12e4267a0f06f4c09a3a5cc9bbc226f8820e6ddf", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/rubiosoap.png", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/presidential-races/251370-rubio-trump-immigration-proposal-has-no-chance-of-passing", "country": "US", "title": "Rubio: Trump immigration plan has no chance in Congress", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Rubio: Trump immigration plan has no chance in Congress", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-18T20:16:00.000+03:00", "replies_count": 0, "uuid": "12e4267a0f06f4c09a3a5cc9bbc226f8820e6ddf"}, "author": "csegal@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/251370-rubio-trump-immigration-proposal-has-no-chance-of-passing", "ord_in_thread": 0, "title": "Rubio: Trump immigration plan has no chance in Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 18, 2015, 01:16 pm Rubio: Trump immigration plan has no chance in Congress By Ben Kamisar \nSen. Marco Rubio cast aside Donald Trump’s recent immigration plan during an appearance at the Iowa State Fair Tuesday and challenged whether it would pass Congress. \n“I haven’t read his plan; from what I’ve seen from press reports, there are a couple of ideas he shares with multiple people,” the Florida senator told reporters after a speech at the fair about the plan Trump released Sunday. \n“But most are really not something that I think has a chance to pass through Congress.” ADVERTISEMENT Rubio, the son of Cuban immigrants, has been more moderate than most of his GOP presidential rivals and was a sponsor of the 2013 immigration reform bill that included a pathway to citizenship.\nTrump’s immigration policy paper slammed that compromise bill — which he called the “Schumer-Rubio immigration bill — as a “giveaway to the corporate patrons who run both parties.” \nThe real estate magnate, who is soaring in the GOP polls, also proposed to end birthright citizenship for children born of parents in America illegally. \nRubio’s comments followed a rain-soaked speech at the fair Tuesday where the senator spoke for just eight minutes and didn’t take questions from the crowd because of the weather. \n“I’m going to cut it a little shorter than normal because they say another band is coming through and I don’t want anyone to get wet,” he said. \n“But probably too late for that.” \nWhile he spoke for less than half of his 20-minute allotment and left to meet voters instead of taking questions in the pouring rain, a substantial throng of attendees with ponchos and umbrellas assembled to listen to his speech. \nHis modified stump speech cast a forward-looking view at the country, promising that the next century could be better than the past one. He touted ideas to modernize America’s economy and higher education, as well as shore up national defense. \n“What we are called upon to do not is ensure that the American dream doesn’t just survive, but it reaches more people and changes more lives than ever before,” he said. \n“We are called not to just keep America special and great, but keep it greater than it’s ever been.” \nRubio’s appearance at the Des Moines Register’s presidential soapbox marked his first appearance in the Hawkeye State since the state’s voters declared him the winner of the Aug. 6 Fox News GOP debate, according to a recent Suffolk University poll. \nWhile that poll found him in third place with 10 percent of Iowans, a CNN poll of Iowans just a few days later found him tied for seventh with 5 percent. \nThe Associated Press notes that he hadn’t been in Iowa for a full month before his most recent return, leading some Republicans to question why he hasn’t visited more often. \nAfter he left the stage to meet with fairgoers, Rubio bumped into Iowa Gov. Terry Branstad (R). While the governor remained shy on any official endorsement, he said that he could see himself supporting Rubio. \n“He’s a good friend, he came to my birthday party. I’m trying to be a good host for everyone who comes,” he said. \n“I’m really impressed, I think he’s a rising star in the Republican ranks and we are really appreciative of him coming.” \nThis story was updated at 4:27 p.m. Tags:", "external_links": [], "published": "2015-08-18T20:16:00.000+03:00", "crawled": "2015-08-19T06:50:02.947+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}