{"organizations": [], "uuid": "dc186f09c09df9edad66d0c8510cd8173751ef7a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/davidlarryobama_080815getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/in-the-know/in-the-know/250660-comedian-larry-david-joins-obama-for-golf", "country": "", "title": "Comedian Larry David joins Obama for golf | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Comedian Larry David joins Obama for golf | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-08T22:25:00.000+03:00", "replies_count": 0, "uuid": "dc186f09c09df9edad66d0c8510cd8173751ef7a"}, "author": "", "url": "http://thehill.com/blogs/in-the-know/in-the-know/250660-comedian-larry-david-joins-obama-for-golf", "ord_in_thread": 0, "title": "Comedian Larry David joins Obama for golf | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 08, 2015, 02:56 pm Comedian Larry David joins Obama for golf Getty Images Compared to comedian Larry David’s golf game, President Obama must be feeling prett-ay, prett-ay, prett-ay good. While golfing with the president at the Farm Neck Golf Club near Martha’s Vinyard, Mass., the “Curb Your Enthusiasm” creator and “Seinfeld” co-creator apparently found himself stuck in a sand trap near the first hole. ADVERTISEMENT David swung in an attempt to get the ball back onto the green, according to a White House pool report, and let out a loud yelp in frustration when a flurry of sand flew through the air and the golf ball moved no closer to the hole. Many plotlines in the “Curb Your Enthusiasm” – in which David also stars – surround golfing. Also on the course with the president were David Wolf, the former chairman of UBS Investment Bank, and Cyrus Walker, the cousin of senior aide Valarie Jarrett – both of whom have been frequent White House golf partners. Obama is in Martha’s Vineyard on vacation, a common spot for the First Family during the summer. “His schedule has been especially demanding in the last several weeks,” press secretary Josh Earnest told reporters Friday, referring in part to the most recent rounds of negotiations with Iran. “I think he would also be quick to tell you that the last several weeks have been especially rewarding for him.” He is scheduled to return to Washington on Aug. 23. Tags: ", "external_links": [], "published": "2015-08-08T22:25:00.000+03:00", "crawled": "2015-08-08T22:25:16.975+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}