{"organizations": [], "uuid": "897f2abf0cdde7c2ecdf2df597343a4a6e0dc1c6", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/immigration_getty_2014.jpg", "site_section": "http://altwire.utne.com/rss/r_immigration", "section_title": "Utne Altwire: immigration", "url": "http://thehill.com/blogs/pundits-blog/immigration/250729-accepting-the-complexity-of-immigration-policy", "country": "US", "title": "Accepting the complexity of immigration policy", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Accepting the complexity of immigration policy", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-11T17:07:00.000+03:00", "replies_count": 0, "uuid": "897f2abf0cdde7c2ecdf2df597343a4a6e0dc1c6"}, "author": "TheHill", "url": "http://thehill.com/blogs/pundits-blog/immigration/250729-accepting-the-complexity-of-immigration-policy", "ord_in_thread": 0, "title": "Accepting the complexity of immigration policy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 11, 2015, 06:00 am Accepting the complexity of immigration policy By Ingrid Schroeder, contributor Getty Images \nThis year marks the 50th anniversary of the Immigration and Nationality Act of 1965, which was a critical milestone in shaping our immigration system as it exists today. For more than a decade, there have been debates in Congress about modernizing the system to meet current realities and challenges. Yet, despite these efforts, federal immigration reform is no closer to enactment. ADVERTISEMENT The immigration debate is relevant not only at the national level and in California, Texas and other border states. Over the past 25 years, the immigrant population has increased and spread across the country. Because of these changing demographics, immigration policy is now relevant to all 50 states, and understanding the local experience can inform a badly needed fact-based discussion about federal policies.\nIn 1990, the foreign-born population was 19.8 million, or 7.9 percent , of U.S. residents, with nearly three out of four immigrants (73 percent) living in California, Florida, Illinois, New Jersey, New York or Texas. By 2012, however, immigrants made up approximately 13 percent of the overall population, approaching the historical high set around the start of the 20th century. \nStates as varied as Nevada, North Carolina and Washington have experienced large growth in their foreign-born populations, and a close look at the local level shows an even more dramatic picture. Between 1990 and 2012 , 87 percent of U.S. counties experienced an increase in the immigrant share of their adult populations, while about 20 percent saw declines in their U.S.-born populations. \nBecause of these demographic shifts, federal actions on immigration policy reverberate in state capitals across the country, as well as in numerous city halls and county offices. For example, in 2012, the president created an initiative to allow certain young people to avoid deportation for a specific amount of time if they were brought to this country as children. State and local governments found themselves playing major roles in implementing the program, including outreach, documentation, education and protection from fraudulent legal service providers, often at their own initiative and cost. Although the president announced expansion of the program in November 2014, it faces a challenge in federal court and has not been implemented. \nOther changes the president announced in 2014 are moving forward, four of which will require the federal government and states to work together in new ways: The federal government is collaborating with state and local governments to launch a campaign to provide information on U.S. citizenship and the naturalization process. According to the latest available estimates from the Department of Homeland Security's Office of Immigration Statistics, approximately 8.8 million legal permanent residents are eligible for naturalization . The White House Task Force on New Americans issued a report in April outlining how the federal government will work with state and local officials to identify best practices for integrating immigrants into communities and to consider how to expand and replicate them. The federal government is consulting with state and local business and labor leaders, public officials, and others to develop recommendations to streamline and improve the legal immigration system. State and local law enforcement agencies will continue to share information about arrestees with federal immigration officials, but as of January, the federal government's immigration enforcement priorities are directing enforcement officers to focus their efforts on those who pose threats to national security and public safety, as well as individuals convicted of crimes, including some misdemeanors. \nEven as these changes are being rolled out, states have taken additional action on their own. As of July, 20 states have made the federal voluntary E-Verify system, which confirms employees' authorization to work in the U.S., mandatory for all or some employers. Ten states and the District of Columbia currently issue driver's licenses (or alternative driving documents) to unauthorized immigrants. At least four states have created integration offices to coordinate the state's immigration activities and promote economic development and naturalization, and others have cracked down on fraudulent immigration legal service providers. To an extent not seen in decades, states are playing a key role in immigration policy, which has traditionally been seen as a federal issue. \nAs Congress and the Obama administration discuss how they might change the immigration system at the federal level, we all need to consider the implications of shifting demographics and the variety of actions state and local governments are taking. Now is the time to seize the opportunity for a full discussion about how federal, state and local governments all play a role in immigration policy. \nSchroeder directs fiscal federalism initiatives at the Pew Charitable Trusts in Washington. Tags:", "external_links": [], "published": "2015-08-11T17:07:00.000+03:00", "crawled": "2015-08-11T19:05:58.288+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}