{"organizations": [], "uuid": "4cfc39a202f6da1ac8ad4040b9df4feaac71e012", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabillclinton.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/251187-obama-bumps-into-bill-clinton-on-golf-course", "country": "US", "title": "Obama bumps into Bill Clinton on golf course", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama bumps into Bill Clinton on golf course", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-15T01:34:00.000+03:00", "replies_count": 0, "uuid": "4cfc39a202f6da1ac8ad4040b9df4feaac71e012"}, "author": "Mark Hensch", "url": "http://thehill.com/blogs/blog-briefing-room/news/251187-obama-bumps-into-bill-clinton-on-golf-course", "ord_in_thread": 0, "title": "Obama bumps into Bill Clinton on golf course", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 14, 2015, 06:34 pm Obama bumps into Bill Clinton on golf course By Mark Hensch Getty Images President Obama had a chance encounter with former President Bill Clinton on Friday, according to pool reports. The current and former presidents crossed paths at Farm Neck Golf Club in Oak Bluffs, Mass. ADVERTISEMENT The surprise meeting comes as Democrat Hillary Clinton, Bill Clinton’s wife, seeks their party’s presidential nomination next year. Obama was hitting the links Friday for his fourth round of golf since arriving on Martha’s Vineyard a week before for a family vacation. He teed off Friday with a trio of basketball stars: Reigning NBA Most Valuable Player Stephen Curry, his father Dell Curry and former NBA All-Star Ray Allen. The first family has repeatedly traveled to Martha’s Vineyard since Obama first entered the Oval Office in 2009. The president is still working during his break, reportedly calling lawmakers and pressuring them over his nuclear deal with Iran. Tags: Past: 1 day Dems near Clinton panic mode “I’m not sure they completely understand the credibility they are losing,... Turmoil mounts surrounding Clinton... Team Clinton blasts criticism as \"misinformation\" and \"nonsense.\" Carson: Planned Parenthood in... Carson said the organization's founder \"was not particularly enamored with... Seven GOP candidates who could... Of the crowded 2016 GOP primary field, who will be the first to head for... Carson on Clinton email server: '... GOP presidential candidate Ben Carson said on Wednesday that Democrat... Report: Al Gore insiders chatting... Gore started to trend on Twitter after reports of the talks emerged. Cruz wants immigration details on... Cruz and Sessions are probing the \"nexus between terrorism and our... Black lawmakers back disruptions... “They really are speaking to the issues,\" Rep. Sheila Jackson Lee (D-Texas... Outsiders take over GOP Conservatives are thrilled with the developments. Airline to weigh passengers before... Passengers will have to step on the scale before they step on their... Clinton mocked for emoji tweet Clinton asks how student loans make followers feel in \"3 emojis or less.\" Celebs line up for, against Donald... Rosie O’Donnell is not a fan. Obama shares his summer reading... The president's most notable selection is Between The World and Me by Ta-... Trump defends Planned Parenthood Republican presidential front-runner Donald Trump defended Planned... Oath Keepers descend on Ferguson An official called the presence of the heavily armed men \"both unnecessary... Navy shuffles up aircraft carrier... The \"three-carrier swap\" leaves the Asia-Pacific region without a forward-... Mexico won't pay for Trump's... \"It's 100 percent they're going to pay,\" Trump claimed in an interview. Trump: China 'just destroying us'... \"China has gotten rich off us,” Trump said in Michigan. Ex-adviser: Trump a 'great... “Trump has the size and boldness to be the leader we need,” Roger Stone... Fiorina: Trump, Obama both hit... Fiorina argued that both men employ inflammatory rhetoric against their... 'Regular guy' style costs Walker... Walker has seen his standing in Iowa slip away to Donald Trump.", "external_links": [], "published": "2015-08-15T01:34:00.000+03:00", "crawled": "2015-08-15T01:40:02.186+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}