{"organizations": [], "uuid": "0334f56ededaadc1d2c5c41e13a9d068014cc68c", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/250888-obama-cant-rush-south-sudan-peace-process", "country": "", "title": "Obama can't rush South Sudan peace process | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama can't rush South Sudan peace process | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-13T18:00:00.000+03:00", "replies_count": 0, "uuid": "0334f56ededaadc1d2c5c41e13a9d068014cc68c"}, "author": "", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/250888-obama-cant-rush-south-sudan-peace-process", "ord_in_thread": 0, "title": "Obama can't rush South Sudan peace process | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 13, 2015, 10:00 am Obama can't rush South Sudan peace process By Andrew F. Quinlan \nDuring President Obama’s trip to Africa two weeks ago, he had tough words for South Sudan, the world’s youngest nation that now is beset by civil war. “We don’t have time to wait,” Obama warned, and threatened sanctions against both sides if a peace deal is not signed by August 17. \nFrustrations, understandably, run high – and not least among the South Sudanese themselves. But stick-waving by Obama and other outsiders is likely to do more harm than good. ADVERTISEMENT South Sudan became an independent nation in 2011 as the result of a referendum guaranteed during a 2005 peace agreement ending decades of civil war in Sudan. Its successful creation was a hallmark of President Bush’s under-appreciated Africa policy, and the Obama team was quick to take credit for it as well. \nBut peace did not last. After South Sudan’s President Salva Kiir sacked his supposedly power-hungry Vice President, Riek Machar, the latter took up arms. Now thousands lie dead and some 2 million have been forced from their homes, and internationally brokered peace negotiations are sticky. \nThe President should not lose sight of the fact that his administration inherited an effort that began well before his time in office, and that resolving the civil war in Sudan was a lengthy process full of detours and setbacks. It didn't begin in 2009 when Obama took office, but he seems to be operating under the false assumption that his administration alone was responsible for getting South Sudan off the ground, and that he can simply snap his fingers and similarly put an end to its internal strife. \nA new Center for Freedom & Prosperity paper explains why the President's lack of perspective is likely to harm the peace process. The negotiations that led to South Sudan's creation provide important lessons for today's participants, but they are lessons that have largely gone unheeded. In particular, the chief mediator of the 2005 agreement spent much of his time keeping outside forces with their own political interests from overwhelming the process, while also building trust with the various participants and ensuring they had the necessary capacity to negotiate complicated political and financial issues. That simply can't happen overnight. \nThe aggressive, threatening style being used by Obama, as well as IGAD and its supporters, can be useful in certain circumstances. As the paper acknowledges, researchers find it can make short-term resolution more likely by forcing participants to the table. But both sides in South Sudan are already at the table. And the same research also shows that aggressive efforts to produce short-term gains like ending armed conflict do not necessarily promote lasting peace. \nThere's also good reason to question whether the proposal as it currently exists will serve the interests of lasting peace. For starters, the proposed agreement undermines democracy by forcing the different parties to operate during a transitional period as effective equals, despite the fact that Kiir was overwhelmingly elected president of the Southern Sudan Autonomous Region shortly before it became independent. Its proposal to give the rebel groups 53 percent control in the oil-rich conflict-areas further undermines democracy at the local levels and no doubt will lead to renewed conflict down the road. And then there’s the message received by any other petulant faction with a gun and a grievance: political power comes from war, not peace. \nThese issues can nevertheless be resolved. Both sides have demonstrated a willingness to meet and discuss resolution of the ongoing conflict. But arbitrary deadlines from absentee outsiders aren’t helpful, and peace – lasting peace – cannot be forced. \nObama’s legacy may not have time to wait. But sometimes waiting is the best option, even if it means peace is achieved too late for Team Obama to take credit. \nQuinlan is the cofounder and president of the Center for Freedom and Prosperity (@cfandp). ", "external_links": [], "published": "2015-08-13T18:00:00.000+03:00", "crawled": "2015-08-13T18:00:38.505+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}