{"organizations": [], "uuid": "e801d0078cbf03f51ea0bcbe1256f968a2051e3c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d36bd81d00002f001451de.jpeg", "site_section": "http://www.huffingtonpost.com//feeds/verticals/green/index.xml", "section_title": "Green - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-administration-releases-new-rules-for-methane-emissions_55d36b6ee4b055a6dab199e4", "country": "US", "title": "Obama Administration Releases New Rules For Methane Emissions", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Releases New Rules For Methane Emissions", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-18T21:34:00.000+03:00", "replies_count": 0, "uuid": "e801d0078cbf03f51ea0bcbe1256f968a2051e3c"}, "author": "Kate Sheppard", "url": "http://www.huffingtonpost.com/entry/obama-administration-releases-new-rules-for-methane-emissions_55d36b6ee4b055a6dab199e4", "ord_in_thread": 0, "title": "Obama Administration Releases New Rules For Methane Emissions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Administration Releases New Rules For Methane Emissions New proposals would build on administration's plan for addressing planet-warming greenhouse gas emissions. Kate Sheppard Senior reporter/Environment and energy editor, The Huffington Post Posted: 08/18/2015 02:34 PM EDT ASSOCIATED PRESS \nWASHINGTON -- The Obama administration on Tuesday proposed new standards limiting methane emissions from oil and gas drilling operations, a significant contributor to climate change. \nThe Environmental Protection Agency released four separate proposals that aim to reduce emissions that escape from oil wells, as well as natural gas processing and storage facilities. The methane proposal would cut releases from drill sites and infrastructure 20 to 30 percent nationally in the next 10 years, the agency said. \nThe agency described the standards as a \"flexible approach\" to reducing a major contributor to climate change, and said the reduction would be the equivalent of cutting 9 million metric tons of carbon dioxide. \nThe proposals, said Janet McCabe, acting assistant administrator for EPA's Office of Air and Radiation, \"clearly recognize that domestic natural gas production provides abundant clean energy,\" but also that \"this valuable resource must be developed responsibly and safely.\" \nThe proposed rules build on standards the EPA released in 2012 that required natural gas drilling sites to reduce emissions of volatile organic compounds , or VOCs, which can contribute to the formation of ground-level ozone. They expand the rules to include methane emissions from new sites, and also require new hydraulically fracked oil-drilling wells -- which often also contain natural gas reserves -- to reduce emissions. And they expand the types of facilities covered by the rules to include new and modified infrastructure such as compressors and pumping stations. \nIn January, the Obama administration first announced an overall target for cutting methane emissions up to 45 percent from 2012 levels by 2025, as part of its larger plan to address the heat-trapping emissions that cause climate change. Methane accounts for about 10 percent of all U.S. greenhouse gas emissions, but is about 25 times more potent than carbon dioxide . The EPA estimates that its proposed methane cuts would equate to up to 9 million metric tons of carbon. \nThe EPA said it, along with other agencies, is looking at a variety of options for meeting the additional methane reductions outlined in the Obama plan. \nEnvironmental groups said rules for new oil and gas operations are a good start, but want the administration to start setting requirements for existing drilling operations, which would help get the country closer to the 45 percent goal. \"Curbing the oil and gas industry’s rampant methane pollution problem is the next biggest thing the White House can do to fight climate change after addressing carbon pollution from power plants,\" said Meleah Geertsma, senior attorney at the Natural Resources Defense Council, in a statement. “Meaningful progress in combating this potent climate pollutant will require an industry-wide cleanup -- from infrastructure new and old, nationwide. We are hopeful today's announcement is just the beginning.\" \nBut the oil and gas industry argued that the proposal is \"redundant\" because the 2012 rules on VOCs are already reducing methane emissions at natural gas drilling sites and the industry has taken a number of voluntary actions that have reduced methane emissions . Howard Feldman, the senior director of regulatory and scientific affairs at the American Petroleum Institute, called the proposal \"an additional burden on the industry\" in a call with reporters Tuesday. \n\"This is not the time to jeopardize the shale revolution in America,\" said Feldman. \nThere will be a 60-day public comment period on the new proposals.", "external_links": [], "published": "2015-08-18T21:34:00.000+03:00", "crawled": "2015-08-18T22:11:41.239+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}