{"organizations": [], "uuid": "6a8a53fcc0953839daf9d4eb95505849fdbec5d4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/spotify_ekdaniel08142015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/27/feed", "section_title": "The Hill: Technology Policy", "url": "http://thehill.com/policy/technology/251159-spotify-welcomes-obama-playlist-as-it-seeks-to-boost-its-profile", "country": "US", "title": "Spotify welcomes Obama playlist as it seeks to boost its profile", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Spotify welcomes Obama playlist as it seeks to boost its profile", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-14T21:55:00.000+03:00", "replies_count": 0, "uuid": "6a8a53fcc0953839daf9d4eb95505849fdbec5d4"}, "author": "tlejeune@thehill.com (Mario Trujillo)", "url": "http://thehill.com/policy/technology/251159-spotify-welcomes-obama-playlist-as-it-seeks-to-boost-its-profile", "ord_in_thread": 0, "title": "Spotify welcomes Obama playlist as it seeks to boost its profile", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spotify welcomes Obama playlist as it seeks to boost its profile Getty Images By Mario Trujillo - 08/14/15 02:55 PM EDT \nSpotify has aimed in recent months to increase its footprint in Washington, and on Friday it got some free publicity in the form of a presidential shout-out. \nThe White House announced it joined the service, with President Obama curating a pair of summer playlists that included songs by The Temptations, Bob Dylan, Justin Timberlake, Beyoncé, Mos Def and others. ADVERTISEMENT The administration framed the move as part of the its shift to expand its social media presence and connect with people through non-traditional platforms.\nIn a blog, Spotify announced it was “excited to welcome” the White House to the service. But a spokesman declined to offer further details on how the announcement came about. \nThe seven-year-old company, which boasts about 75 million active users and 20 million subscribers, made its first official foray into Washington earlier this year, when it registered its first four lobbying firms in April. \nIt has spent $300,000 since then, lobbying in Congress and at the agency level on issues that include “licensing, copyright, intellectual property, and related issues in the music and technology industries” as policy makers mull the future of copyright law and the music publishing industry. \nThe lobbying firms representing Spotify are the Gibson Group, Peck Madigan Jones, Forbes-Tate and Baker & Hostetler. \nThe company offers free and paid premium music streaming, and is reportedly is valued at more than $8 billion, competing with other streaming services like Pandora and Apple Music. Share on Twitter Get TheHill's free daily Technology email \nFrom Hillicon Valley Team the overnight email is a round-up of the day's top technology stories delivered every weekday morning.", "external_links": [], "published": "2015-08-14T21:55:00.000+03:00", "crawled": "2015-08-15T00:57:08.063+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}