{"organizations": [], "uuid": "d896daa0cfa4ab89271de1ee029aad28dc4676f4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d69b461400002e002e38e8.jpeg", "site_section": "http://www.huffingtonpost.com//feeds/verticals/politics/index.xml", "section_title": "Politics - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-iran-deal-gains-democrats-support-ahead-of-vote_55d699fee4b020c386de3f2c", "country": "US", "title": "Obama Iran Deal Gains Democrats Support Ahead Of Vote", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Iran Deal Gains Democrats Support Ahead Of Vote", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-21T06:48:00.000+03:00", "replies_count": 0, "uuid": "d896daa0cfa4ab89271de1ee029aad28dc4676f4"}, "author": "Andrew Hart", "url": "http://www.huffingtonpost.com/entry/obama-iran-deal-gains-democrats-support-ahead-of-vote_55d699fee4b020c386de3f2c", "ord_in_thread": 0, "title": "Obama Iran Deal Gains Democrats Support Ahead Of Vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Obama's Iran Deal Gains Democrats' Support Ahead Of Vote It is looking like Obama will have enough Democrats supporitng the deal to beat those Republicans' opposition. Posted: 08/20/2015 11:48 PM EDT | Edited: 1 hour ago CreditPool via Getty Images Congressional backing for Obama's nuclear with Iran has gained support from key lawmakers, making it increasingly it will come to pass. \nWASHINGTON (AP) — President Barack Obama's nuclear deal with Iran is picking up crucial support from swing-state Senate Democrats despite Republican opposition heightened by revelations of a secret side-agreement between Iran and the U.N. agency that inspects nuclear facilities. \nOn Thursday, Sen. Claire McCaskill, D-Mo., became the latest to declare her backing, saying in a statement, \"This deal isn't perfect and no one trusts Iran, but it has become clear to me that the world is united behind this agreement with the exception of the government of Israel.\" \nMcCaskill's announcement followed a similar declaration a day earlier from Sen. Joe Donnelly, D-Ind., who said, \"I am willing to give this agreement the opportunity to succeed.\" Astrid Riecken via Getty Images Sen. Claire McCaskill (D-Mo) has announced support Obama's Iran d \nTheir support brings to 26 the number of Senate Democrats who've come out in favor of the agreement aimed at dismantling Iran's nuclear program in exchange for billions in sanctions relief. Supporters now include 10 of the 12 members on the Democratic side of the Senate Armed Services Committee. \nWith majority Republicans unanimously opposed, Obama needs 34 Senate Democrats to sustain his veto of a resolution disapproving the deal. The disapproval measure may pass next month. With only two Senate Democrats opposed so far that number is increasingly looking within reach, and supporters could even potentially secure the 41 votes that would block the resolution from passing in the first place. \nThe dynamic is similar in the House, where Minority Leader Nancy Pelosi told The Associated Press this week that Democrats will back up Obama if he's forced to veto a disapproval resolution. \"We will sustain the veto,\" she said. Doing so would require 146 Democrats. The number of publicly declared supporters neared 60 Thursday as Reps. Mike Honda of California and Rosa DeLauro of Connecticut came out in favor, with DeLauro declaring, \"The best option for preventing Iran from developing a nuclear weapon is to support the agreement.\" \nThe White House on Thursday released a letter sent by Obama to New York Rep. Jerrold Nadler, addressing some undecided Democrats' concerns. In the letter, dated Wednesday, Obama wrote, \"Should Iran seek to dash toward a nuclear weapon, all of the options available to the United States — including the military option — will remain available.\" \nObama also wrote that the U.S. \"will maintain powerful sanctions targeting Iran's support for such groups as Hezbollah, its destabilizing role in Yemen, its backing of the Assad regime, its missile program and its human rights abuses at home.\" \nCARLOS BARRIA via Getty Images British Foreign Secretary Philip Hammond (2nd R), US Secretary of State John Kerry (R) and European Union High Representative for Foreign Affairs and Security Policy Federica Mogherini (L) talk to Iranian Foreign Minister Mohammad Javad Zarif as they prepare to announce a nuclear deal, capping more than a decade of on-off negotiations with an agreement that could potentially transform the Middle East. \nThe momentum for the deal signed last month by the U.S., Iran and five other world powers comes despite GOP anger over a report by The Associated Press on a previously undisclosed side deal between Iran and the U.N.'s International Atomic Energy Agency. That side agreement would allow Tehran to use its own inspectors to investigate a site it has been accused of using to develop nuclear arms at least a decade ago. \nThe side deal relates to attempts to verify past military activity at a site long suspected of hosting nuclear arms work — not the nuclear activity going forward that is the thrust of the overall agreement. But Republicans pointed to it as more evidence that negotiators unwisely agreed to rely on assurances from Iran rather than verifiable inspections. \n\"It is clear Iran out-negotiated the United States and other world powers and pushed the IAEA to commit to an incredibly unorthodox inspections process that will set a terrible precedent for the future,\" said Sen. Bob Corker, R-Tenn., chairman of the Senate Foreign Relations Committee. \nBut the director general of the IAEA, Yukiya Amano, defended the agreement the agency reached with Iran concerning the Parchin military site. He said he was disturbed that the AP report \"suggested\" that the IAEA has given responsibility for nuclear inspections to Iran. \nWhile noting the side deal is confidential, he said, \"I can state that the arrangements are technically sound and consistent with our long-established practices. They do not compromise our safeguards standards in any way.\" \nReflecting the strong feelings on all sides of the issue, lobbying by outside groups intensified Thursday. The liberal group Americans United for Change announced plans for a $500,000 ad campaign supporting the deal in a half-dozen cities with large Jewish populations, and prominent Jewish supporters took out a full-page ad in The New York Times to try to counter Israeli opposition. On the other side, Citizens for a Nuclear Free Iran, which is backed by the American Israel Public Affairs Committee and others, announced the latest phase in a promised $20 million ad campaign against the deal. ", "external_links": [], "published": "2015-08-21T06:48:00.000+03:00", "crawled": "2015-08-21T09:22:33.914+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}