{"organizations": [], "uuid": "0a847fe131467f44fefd2ae2daf8c2a03128db37", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/1138/feed", "section_title": "Foreign Policy", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/250219-on-africa-obama-and-king-mohammed-vi-are-birds-of-a", "country": "US", "title": "On Africa, Obama and King Mohammed VI are birds of a feather", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "On Africa, Obama and King Mohammed VI are birds of a feather", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-05T21:00:00.000+03:00", "replies_count": 0, "uuid": "0a847fe131467f44fefd2ae2daf8c2a03128db37"}, "author": "jpicard@thehill.com (Edward M. Gabriel)", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/250219-on-africa-obama-and-king-mohammed-vi-are-birds-of-a", "ord_in_thread": 0, "title": "On Africa, Obama and King Mohammed VI are birds of a feather", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 05, 2015, 02:00 pm On Africa, Obama and King Mohammed VI are birds of a feather By Edward M. Gabriel \nLast week—almost exactly a year since convening his inaugural U.S.-Africa Leaders Summit here in Washington, DC—President Obama took to the podium at the African Union’s headquarters in Addis Ababa, Ethiopia and delivered remarks “to the people of Africa”—“one of the fastest-growing regions in the world.” Citing the continent’s “historic gains in health,” burgeoning middle class, “hundreds of millions of mobile phones, surging access to the Internet,” and the millions that “have been lifted from extreme poverty,” the president renewed his call for “the world to change its approach to Africa.” \n“So many Africans have told me, we don’t want just aid, we want trade that fuels progress,” he said. “We don’t want patrons, we want partners who help us build our own capacity to grow. We don’t want the indignity of dependence, we want to make our own choices and determine our own future.” ADVERTISEMENT In hearing his remarks, I remembered hearing those words before, albeit in a different context. \nIn a speech delivered on the occasion of the first Moroccan-Ivoirian Economic Forum held in February 2014 in Abidjan, Morocco’s King Mohammed VI announced, “… Africa is a great continent. It therefore has to take its destiny in its own hands…. \n“Our continent does not need assistance,” he went on, “so much as mutually profitable partnerships. Africa needs human and social development projects much more than it needs humanitarian aid.” \nThe overlap is striking, and indeed ever since serving as U.S. ambassador to Morocco more than fifteen years ago, I’ve marveled at our two countries’ common values and interests—how two countries separated by an ocean, distinct in our language, religion, and demographics, could share so much. Yet this has proven to be true time and time again. And when it comes to our Africa policy, the visions of Obama and King Mohammed VI could not be more in sync. \nObama spoke to African Union members about expanding women’s rights, good governance, the fight against extremism, and “how the most urgent task facing Africa today and for decades ahead is to create opportunity for this next generation.” \nUnder King Mohammed VI’s leadership, Morocco has been tackling these issues for the past two decades – with the most progressive family law of any Muslim country; billion-dollar national plans to reduce poverty, improve education, and provide electricity and potable water to its most impoverished citizens; a vibrant civil society; and a multidimensional approach to countering violent extremism. \nMorocco is actively engaged in sharing its know-how with other African countries. Morocco’s National Office of Electricity has provided technical assistance to generate electricity in Chad, Gambia, Libya, Mauritania, Niger, Senegal, Sierra Leone; and the National Office of Potable Water has helped Cameroon and Mauritania provide drinking water to its citizens. \nMorocco is one of the top African investors in the continent, having invested more than $1 billion since 2009, and has bilateral trade agreements with 17 African countries. \nCurrently, 16,000 students from other African countries are enrolled in Moroccan universities – half of them on scholarship. Morocco also offers management training to many Central and West African governments to help in the development of effective civil services. \nAnd hundreds of African students – men and women – are now receiving training at the new Mohammed VI Institute for the Training of Imams, Morchidines, and Morchidates in how to spread the values of Morocco’s moderate Islam. In addition, last month, the Mohammed VI Foundation for African Oulema was launched to support African theologians, scholars, and institutions in promoting religious tolerance and moderation. \nSecretary of State John Kerry has acknowledged the importance Morocco’s “essential leadership role” in helping its African neighbors deal with the extremism that troubles the region “at a moment where Africa needs this spiritual support to face terrorism based on these values, the values of tolerance.” And the Millennium Challenge Corporation recognizes the contribution Morocco can make to economic development on the continent: in April, the MCC signed a memorandum of understanding with Morocco to “facilitate sharing the lessons of Morocco’s development experience with other parts of Sub-Saharan Africa, and serve as an important catalyst for South-South cooperation.” \nBest of all, the King is ready to work with us. As he said in Abidjan in 2014, “Africa should forge further fruitful partnerships with the many developed countries that show a constant interest in and sincere commitment to economic progress and human development in Africa, while being actively involved in them.” \nIn other words, as Obama looks to help African countries find strategies to promote security, economic development, and stability, he has a willing and able partner in King Mohammed and Morocco. \nGabriel, former U.S. ambassador to Morocco, advises the Kingdom of Morocco.", "external_links": [], "published": "2015-08-05T21:00:00.000+03:00", "crawled": "2015-08-06T00:05:45.073+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}