{"organizations": [], "uuid": "422920adba93b365f23e69504c32c9ba18e3ec71", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/kasichjohn_082812getty.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/251488-kasich-under-fire-from-anti-abortion-group", "country": "US", "title": "Kasich takes heat from anti-abortion group", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Kasich takes heat from anti-abortion group", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-19T21:45:00.000+03:00", "replies_count": 0, "uuid": "422920adba93b365f23e69504c32c9ba18e3ec71"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/251488-kasich-under-fire-from-anti-abortion-group", "ord_in_thread": 0, "title": "Kasich takes heat from anti-abortion group", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kasich takes heat from anti-abortion group Getty Images By Sarah Ferris - 08/19/15 02:45 PM EDT \nA leading anti-abortion group is hitting Gov. John Kasich (Ohio) after the presidential contender called for his Republican counterparts to focus on other issues on the campaign trail. \nThe Susan B. Anthony List released a statement Wednesday urging Kasich to watch the series of undercover videos targeting Planned Parenthood for its fetal tissue donation program. \nThe latest video, which was released Wednesday , claimed that some tissue had been obtained from fetuses with beating hearts. ADVERTISEMENT “We are encouraging all presidential candidates to remain firm on this issue,” spokeswoman Mallory Quigley wrote in a statement, specifically calling out Kasich.\n“This week Gov. Kasich said Republicans focus “too much” on the issue of abortion. We ask him to watch the series of Center for Medical Progress videos and reconsider that position.” \nKasich’s remarks came Sunday in an interview with CNN’s “State of the Union.” \n\"I think (abortion) is an important issue, but I think there's many other issues that are really critical. Early childhood. Infant mortality. The environment. Education,\" Kasich said. \"I think we focus too much on just one issue, and now that the issue of gay marriage is kind of off the table, we're kind of down to one social issue.\" \nKasich is already under fire from anti-abortion groups in his state for declining to defund Ohio's branch of Planned Parenthood, though he has denounced the group's practices as “abhorrent.\" \nNearly all GOP presidential candidates have condemned Planned Parenthood for allegations that it has profited from its fetal tissue donation and that its doctors have coordinated abortions to specifically reap the tissue. \nBillionaire businessman Donald Trump is the only Republican candidate who has come to the organization’s defense, stressing the importance of its other women’s health services. \nPlanned Parenthood has strongly denied the claims made in the videos, arguing that the footage is heavily edited and used its staff members’ comments grossly out of context. Tags:", "external_links": [], "published": "2015-08-19T21:45:00.000+03:00", "crawled": "2015-08-20T02:31:00.179+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}