{"organizations": [], "uuid": "b912202471e581c91968d6ccfdd658c26733bd65", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1950836/images/o-HIDDEN-AMERICAN-FLAG-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/blog.xml", "section_title": "Latino Voices Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/casar-vargas/i-have-a-dreamthat-latino_b_7991016.html", "country": "US", "title": "I Have a Dream -- That Latinos Are Seen Beyond the Prism of Immigration | César Vargas", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 5, "title_full": "I Have a Dream -- That Latinos Are Seen Beyond the Prism of Immigration | César Vargas", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-17T22:14:00.000+03:00", "replies_count": 4, "uuid": "0b0be9065645ed80bb976b2cc074e82850fdf823"}, "author": "César Vargas", "url": "http://www.huffingtonpost.com/casar-vargas/i-have-a-dreamthat-latino_b_7991016.html#post-0", "ord_in_thread": 0, "title": "I Have a Dream -- That Latinos Are Seen Beyond the Prism of Immigration | César Vargas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I like how Latino experts (I'm not going to put it in quotation marks) are upset with the establishment, the media, and politicians because they're always framing the Latino identity through the immigration lens even though Latinos are more than just immigrants.\nImmigration is important, but it in order of concerns, it comes in fourth: education, economy, health care, and then immigration. Which is fair enough if they mention it -- while some of them even know that framing us as the perpetual \"other\" alienates a good amount of second and subsequent generations (and some who have been part of this country since before this country came to be). But what grinds all my gears is that within the same breath they talk about Latinidad as this perpetual otherness even though they despise it.\nI mean, I've never encountered so many brutos, ciegos, sordomudos, testarudos. Coño, gente. Break away from the damn chains you hate so much. Stop embracing them and stop putting them on your own children. For the love of God, don't let Hollywood or politicians come only through the immigration door, either. It's self-defeating. We've become so accustomed to mediocrity that even our so-called intelligentsia eats it up like it was the last piece of Dominican cake on earth. Revolt. Rebel. Superemosnos. It's 2015. You're no longer the \"other.\" You're part of this country. Act like it. Don't let so-called Latino experts, Hollywood, the media and politicians hijack our identity for their own self-serving purposes. Let's emancipate ourselves from those shackles. It starts with you.\nWe have to keep fighting for our undocumented people and I say it's as important as everything else here for me (and it should be for everyone else) but we also must concern ourselves with the education of our children, jobs that pay a living wage, police brutality, the prison industry, our health care... We must be included in every conversation. Not just called when they need our votes or to fill a damn quota. Pisses me off.\nI want to see Latino economists getting lauded on Salon. I want to hear Latino political experts talking about more than immigration on morning shows. I want to see Latino actors playing superheroes in sci-fi/fantasy movies. I want to read fiction books from Latinos that have nothing to do with Latinidad or struggle porn/memoirs and have the New York Times do write-ups about it. I want to see my people as heroes and not the perpetual victims the status quo along with our ethnic and poverty pimps make us out to be.\nYes, some of us are immigrants, but we are more than just immigrants because there's no such thing as just immigrants. We dream, we create, we accomplish. We are who we say we are. Not what anyone labels us as.\nFollow César Vargas on Twitter: www.twitter.com/CesarVargas365\nMore: Latinos & Hispanics Latino Politics Latino Entertainment Latino Politics Latino Artists", "external_links": ["http://www.twitter.com/CesarVargas365"], "published": "2015-08-17T22:14:00.000+03:00", "crawled": "2015-08-19T09:25:13.484+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}