{"organizations": [], "uuid": "4cfedc6814c0147310d5cb569f9444d164d23d21", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/plannedparenthood_081915youtube_0.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/251651-video-by-anti-abortion-group-used-photo-of-stillborn-baby-not-aborted-fetus", "country": "US", "title": "Anti-abortion video showed stillborn baby — not fetus", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Anti-abortion video showed stillborn baby — not fetus", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-21T18:42:00.000+03:00", "replies_count": 0, "uuid": "4cfedc6814c0147310d5cb569f9444d164d23d21"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/251651-video-by-anti-abortion-group-used-photo-of-stillborn-baby-not-aborted-fetus", "ord_in_thread": 0, "title": "Anti-abortion video showed stillborn baby — not fetus", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Anti-abortion video showed stillborn baby — not fetus By Sarah Ferris - 08/21/15 11:42 AM EDT The anti-abortion-rights group targeting Planned Parenthood is acknowledging that its most recent video used an image of a stillborn baby that was made to look like an aborted fetus. The Center for Medical Progress posted a new link on its video late Thursday, adding that one of the images was actually a baby named Walter Fretz, born prematurely at 19 weeks. ADVERTISEMENT Planned Parenthood is seizing on the clarification, arguing that it is new proof the videos are deceptively edited in an attempt to take down the organization. “This fraudulent smear campaign is falling apart on closer inspection,” said Eric Ferrero, vice president for communications at Planned Parenthood Federation of America. “These anti-abortion extremists apparently violated multiple laws to perpetrate this fraud. They weren’t documenting wrongdoing — they set out to create wrongdoing and catch it on tape, and when they couldn’t even do that, they edited videos to try to mislead and deceive the public.” The image is shown during an interview with an ex-employee of one of Planned Parenthood’s partners, who claims that her colleague witnessed a fetus with a beating heart during an abortion. The photo was actually of the stillborn son of a woman who claimed it in a Facebook post Friday, according to a release by Planned Parenthood. The photo had been published with permission by The Guardian last year. \nCiting the woman’s Facebook post, Planned Parenthood said the photo was used by the Center for Medical Progress “without her permission [and that] she believes it is an illegal use of the image.” David Daleiden, the founder of Center for Medical Progress, argued that the citation was present \"from the very beginning.\" \"We never claimed that was an image of an aborted baby. It's just an illustration of what a baby looks like at the end of the 2nd trimester,\" he wrote in a statement. \"It's interesting that Planned Parenthood and their allies assumed so quickly that's what was happening – are they just grasping at straws, or are their consciences also starting to get to them?\"", "external_links": [], "published": "2015-08-21T18:42:00.000+03:00", "crawled": "2015-08-22T02:10:16.786+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}