{"organizations": [], "uuid": "ef26feea27e6f0bcd11e07963aa52f1ad67de46e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/kerryjohn_072815getty.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/blogs/blog-briefing-room/250539-obama-allies-slam-schumer-on-iran-opposition", "country": "US", "title": "Obama allies slam Schumer on Iran opposition", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama allies slam Schumer on Iran opposition", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-07T15:56:00.000+03:00", "replies_count": 0, "uuid": "ef26feea27e6f0bcd11e07963aa52f1ad67de46e"}, "author": "Jordan Fabian", "url": "http://thehill.com/blogs/blog-briefing-room/250539-obama-allies-slam-schumer-on-iran-opposition", "ord_in_thread": 0, "title": "Obama allies slam Schumer on Iran opposition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 07, 2015, 08:56 am Obama allies slam Schumer on Iran opposition By Jordan Fabian Getty Images \nCurrent and former White House officials pounced on Sen. Chuck Schumer (D-N.Y.) after his opposition to the nuclear deal with Iran was made public, implying it might become an obstacle to his serving as the next Senate Democratic leader.Secretary of State John Kerry said Friday he \"profoundly disagrees” with the decision from Schumer and and the top Democrat on the House Foreign Affairs Committee, Eliot Engel (D-N.Y.) to oppose the nuclear accord with Iran , according to the Associated Press . ADVERTISEMENT Kerry, the chief U.S. negotiator on the deal, said the facts don't back up their arguments.\"I obviously profoundly disagree with the judgements made,\" Kerry said while in Vietnam.Kerry said restrictions on Iran's nuclear program, including 25 years of tracking their uranium supply makes it \"physically impossible to build a bomb.\"\"It's a question of eliminating options in a realistic way,\" he added. \"I would respectfully suggest that rejection is not a policy for the future, it does not offer any alternative.\"The secretary of said, who served with Schumer in the Senate, called him a friend. But he added that rejecting the deal \"will lead people to put pressure on military action since the United States would have walked away from the diplomatic solution.\"Kerry's comments are the first public comments from a top Obama official since Schumer and Engel announced they would vote against the agreement.Their opposition is a serious blow to the Obama administration, which has been gaining momentum in building support for the Iran deal among Senate Democrats. Schumer, who is likely to become the next Senate Democratic leader, argued the deal does not effectively cut off Iran's path to a nuclear weapon because it does not provide for \"anywhere, anytime\" inspections. He said there is a great risk Iran could use billions of dollars in sanctions relief to \"pursue its nefarious goals.\"The White House has yet to comment directly on Schumer's decision, but a trio of former Obama advisers ripped him on Twitter. Former senior adviser Dan Pfeiffer suggested the New York senator's decision could make it difficult for him to lead Democrats in the Senate: Senator Schumer siding with the GOP against Obama, Clinton, and most Democrats will make it hard for him to lead the Dems in '16 — Dan Pfeiffer (@danpfeiffer) August 7, 2015 Former campaign spokesman Ben LaBolt and ex-speechwriter Jon Favreau also jumped in: Chuck Schumer, who said it was a mistake to pass Obamacare, now comes out again the Iran Deal. This is our next Senate leader? — Jon Favreau (@jonfavs) August 7, 2015 Schumer's stance could be especially damaging for the White House, which has been aggressively lobbying Democrats to back the deal. Facing almost unanimous opposition from Republicans, Obama needs enough Democratic support to sustain a veto of a resolution to kill the deal. The White House has expressed confidence it has enough support in the House, but the vote count looks closer in the Senate. Schumer and Engel, who are both Jewish, have also faced heavy pressure from pro-Israel groups to oppose the deal. Tags:", "external_links": [], "published": "2015-08-07T15:56:00.000+03:00", "crawled": "2015-08-07T16:06:52.335+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}