{"organizations": [], "uuid": "0100560091b944fcc22637ae6965d2b5ca812887", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/menendezrobert_081815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/251598-obama-pushes-back-on-menendez-in-his-hometown-newspaper", "country": "US", "title": "Obama pushes back on Sen. Menendez in his hometown newspaper", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama pushes back on Sen. Menendez in his hometown newspaper", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-20T22:53:00.000+03:00", "replies_count": 0, "uuid": "0100560091b944fcc22637ae6965d2b5ca812887"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/251598-obama-pushes-back-on-menendez-in-his-hometown-newspaper", "ord_in_thread": 0, "title": "Obama pushes back on Sen. Menendez in his hometown newspaper", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 20, 2015, 03:53 pm Obama pushes back on Sen. Menendez in his hometown newspaper By Jordan Fabian \nPresident Obama is pushing back against Sen. Bob Menendez (D-N.J.), who defied the White House by opposing the nuclear deal with Iran. In an op-ed published in the New Jersey senator’s hometown newspaper, Obama urged Congress to back the agreement and dismissed critics who are calling for the U.S. to go back to the negotiating table to extract more concessions from Tehran. ADVERTISEMENT “This deal prevents Iran from gaining a nuclear weapon,” Obama wrote in The Star-Ledger . “We have the opportunity to make the world safer for our children — without resorting to war. That's an opportunity that Congress should seize by supporting this deal.”Menendez on Tuesday became the second Senate Democrat to buck Obama on the Iran deal. He said he would vote against the agreement, arguing it fails to permanently cut off Iran’s path to a nuclear weapon. Though expected, Menendez’s announcement came as a blow to the Obama administration’s effort to rally support for the deal ahead of a vote in Congress in September. Menendez, a senior member of the Senate Foreign Relations Committee, made a lengthy speech attacking the Obama administration’s case for the deal, giving ammunition to Republican critics of the agreement. Obama in his op-ed rejected the argument from Sen. Charles Schumer (D-N.Y.), Menendez and other opponents of the deal that the U.S. could reopen the negotiations.“The idea that we can get a better deal by talking tough or squeezing Iran into submission with more sanctions is simply not realistic,” he wrote. “The international unity we spent years building — the unity that brought Iran to the negotiating table — would be destroyed if this deal is rejected.”The White House has blunted opponents’ momentum by picking up support for the Iran deal from Sens. Claire McCaskill (Mo.) and Joe Donnelly (Ind.), two red-state Democrats who face reelection in 2018. Twenty-six Senate Democrats now back the Iran agreement, just eight short of the 34 Obama would need to sustain a presidential veto of a resolution rejecting the deal. New Jersey’s other senator, Cory Booker (D), has not yet announced his position. Two New Jersey House Democrats have also come out against the deal: Reps. Albio Sires and Donald Norcross. Groups for and against the Iran deal are working furiously to sway undecided Democrats. Even though he is on vacation, the president has reportedly been calling members of Congress during their August recess to discuss the agreement. Obama also placed the same op-ed this week in the Dallas Morning News , a paper that is in the home state of Sen. Ted Cruz, one of the fiercest Republican critics of the deal. Cruz is running for president.", "external_links": [], "published": "2015-08-20T22:53:00.000+03:00", "crawled": "2015-08-21T06:15:26.334+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}