{"organizations": [], "uuid": "aa43103f5a9f7f0959714ae55804521f2b3c1dec", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3321044/images/o-MARCO-RUBIO-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/christopher-lamb/mark-rubio_b_8007026.html", "country": "US", "title": "Marco Rubio is Anti-Abortion, Not Pro-Life | Christopher Lamb", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 10, "title_full": "Marco Rubio is Anti-Abortion, Not Pro-Life | Christopher Lamb", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-20T00:20:00.000+03:00", "replies_count": 9, "uuid": "c1482a03d6ed7b097eb8d202f4b1cd73e0d31a73"}, "author": "Christopher Lamb", "url": "http://www.huffingtonpost.com/christopher-lamb/mark-rubio_b_8007026.html#post-0", "ord_in_thread": 0, "title": "Marco Rubio is Anti-Abortion, Not Pro-Life | Christopher Lamb", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP presidential candidate Marco Rubio opposes abortion without exception . If elected, he vows to end abortions in all circumstances, including rape, incest and endangerment to the mother.\n\"I'm pro-life. It's as simple as that,\" Rubio says .\nTo Rubio, all lives are sacred -- until the baby is born, and then he or she is on their own.\nHe is anti-abortion, but he is not pro-life.\nHe supports torture and the death penalty. He voted against reauthorizing the Violence against Women Act and the Employment Non-Discrimination Act. He voted to bar the Environmental Protection Agency from regulating greenhouse gases.\nIf he was pro-life, wouldn't he oppose corporate polluters who release toxins into the air that annually sicken or kill hundreds of thousands of people in this country, including a disproportionate number of children and the elderly?\nRubio says the Bible tells him that life is sacred. But it doesn't say that only unborn lives are sacred. The Bible instructs us to protect the most vulnerable among us.\nMatthew 25:40 tells us: \"And he will answer, 'I tell you the truth, when you refused to help the least of these my brothers and sisters, you were refusing to help me.' \"\nRubio cheapens the Bible's power by citing \"Scripture for his own purpose,\" as Shakespeare put it, and ignoring the hundreds of passages that tell us that we should cherish all lives.\nAll the leading GOP candidates for president identify themselves as \"pro-life.\" Most accept abortions for rape incest, and/or the life of the mother. Only Rubio and Scott Walker allow no exceptions. If only their compassion for the unborn equaled their compassion for their fellow human beings.\nIf you believe that life begins at conception and ends at birth, you are not pro-life, and to characteristic yourself in such a way is to engage in an Orwellian fantasy.\nIf you are in a position to help the needy and the suffering, or the least of those among us, and you do nothing, you are not pro-life.\nIf Rubio and other GOP presidential candidates were really pro-life, they would support universal health care, affordable housing, free lunch programs, benefits for war veterans, racial and gender equality, and equal justice for all.\nThey would support Social Security, Medicare, parental leave, affordable education, care for the mentally ill and elderly, protecting the environment, and an end to torture and capital punishment.\nWe need to change our definition of pro-life.\nFollow Christopher Lamb on Twitter: www.twitter.com/16campaignbites\nMore: Politics Pro Life Abortion Marco Rubio Democrats GOP Elections 2016 Compassion", "external_links": ["http://www.latimes.com/nation/politics/la-na-rubio-abortion-20150807-story.html", "http://biblehub.com/matthew/25-45.htm", "http://ontheissues.org/Marco_Rubio.htm", "http://rhrealitycheck.org/article/2015/02/27/cpac-2016-hopefuls-stick-rote-remarks-abortion/", "http://newsoffice.mit.edu/2013/study-air-pollution-causes-200000-early-deaths-each-year-in-the-us-0829", "http://www.ontheissues.org/Senate/Marco_Rubio.htm#Energy_+_Oil", "http://www.twitter.com/16campaignbites", "http://www.salon.com/2015/06/17/gops_torture_caucus_the_presidential_hopefuls_who_want_to_return_to_george_w_bushs_worst_war_on_terror_excesses/"], "published": "2015-08-20T00:20:00.000+03:00", "crawled": "2015-08-20T11:33:32.467+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}