{"organizations": [], "uuid": "bbf9de4f0d2b9bb9b29be637383b695279d3eead", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/120719165053-joe-arpaio-large-169.jpg", "site_section": "http://altwire.utne.com/rss/r_immigration", "section_title": "Utne Altwire: immigration", "url": "http://edition.cnn.com/2015/08/14/politics/judge-dismisses-joe-arpaio-immigration-case/", "country": "US", "title": "Judge drops Joe Arpaio immigration case", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Judge drops Joe Arpaio immigration case", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-14T21:05:00.000+03:00", "replies_count": 0, "uuid": "bbf9de4f0d2b9bb9b29be637383b695279d3eead"}, "author": "CNN", "url": "http://edition.cnn.com/2015/08/14/politics/judge-dismisses-joe-arpaio-immigration-case/", "ord_in_thread": 0, "title": "Judge drops Joe Arpaio immigration case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Appeals court drops Joe Arpaio immigration case By Ariane de Vogue , CNN Supreme Court Reporter Updated 1805 GMT (0105 HKT) August 14, 2015 Maricopa County Sheriff Joe Arpaio speaks with a reporter outside city jail in this May 3, 2010. (CNN) A federal appeals court Friday dismissed a case brought by Arizona Sheriff Joe Arpaio challenging President Barack Obama's contentious executive actions on immigration. The U.S. Court of Appeals for the District of Columbia affirmed a lower court opinion and concluded that Arpaio did not have the legal right — or standing — to bring the challenge. \"We conclude that Sheriff Arpaio has failed to allege an injury that is both fairly traceable to the deferred action policies and redressable by enjoining them, as our standing precedents require, \" wrote Judge Nina Pillard, an Obama appointee. Friday's opinion comes as the Obama administration awaits a potentially more serious ruling from another appeals court based in New Orleans. That challenge, in the Fifth Circuit Court of Appeals, is brought by Texas and 25 other states. Last February, a district court judge in Texas temporarily blocked the programs from going forward. \"We've been waiting for today's decision and it is a sharp rebuke to Sheriff Arpaio's challenge to the executive actions on deportations,\" said David Leopold, the former president of the American Immigration Lawyers Association, who supports the President's actions. \"All eyes are now on the Fifth circuit and we are hoping that they too, do the right thing and dismiss the meritless case,\" he said. The President unveiled the new policies to great fanfare in November. As part of the roll out, the administration established a process—called Deferred Action for Parents of Americans and Lawful Permanent Residents (DAPA) — to enable approximately 4.3 million otherwise removable undocumented immigrants to be eligible for work authorization and associated benefits. The executive actions also expanded the Deferred Action of Childhood Arrivals (DACA) -- a program that allows non citizens who were brought here as children to apply for work authorization and protection from deportation for three years. Arpaio, the sheriff of Maricopa County, has taken a strong and at times incendiary stance against illegal immigration. He recently settled a lawsuit with the Department of Justice concerning allegations of discrimination and the unlawful detention of Hispanics. Arpaio brought the immigration suit in part because he argued that the President's policies would inhibit his ability to perform his job. In Court papers, Larry Klayman, Arpaio's lawyer, argued that the sheriff's offices would be burdened by increased workload and financial pressure and the county would face an increased influx of undocumented immigrants. The government contended that Arpaio didn't have legal standing to bring the suit. On Friday, Pillard wrote, \"The Sheriff's Office's expenditures of resources on criminal investigation, apprehension and incarceration of criminals are indeed concrete,\" but she said he lacks standing to challenge the programs \"because any effects of the challenged policies on the county's crime rate are unduly speculative.\" Pillard was joined by judge Sri Srinivasan who is also an Obama appointee. Judge Janice Rogers Brown, who was nominated by President George W. Bush, concurred in the opinion but wrote separately to emphasize that the ruling only applied to Arpaio's standing, and not to whether the programs are \"categorically shielded from suit.\" She noted that the Texas case is still pending.", "external_links": [], "published": "2015-08-14T21:05:00.000+03:00", "crawled": "2015-08-14T22:12:05.156+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}