{"organizations": [], "uuid": "adae43f4ab886aa84fd01c487172a45bb05565d2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3304198/images/o-CARERS-ACT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/michael-collins/federal-marijuana-bill_b_7989252.html", "country": "US", "title": "Momentum Continues to Build for Historic Federal Medical Marijuana Bill | Michael Collins", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Momentum Continues to Build for Historic Federal Medical Marijuana Bill | Michael Collins", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-14T22:12:00.000+03:00", "replies_count": 0, "uuid": "adae43f4ab886aa84fd01c487172a45bb05565d2"}, "author": "Michael Collins", "url": "http://www.huffingtonpost.com/michael-collins/federal-marijuana-bill_b_7989252.html", "ord_in_thread": 0, "title": "Momentum Continues to Build for Historic Federal Medical Marijuana Bill | Michael Collins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's been five months since the historic medical marijuana bill -- the CARERS Act -- was introduced in the Senate, and as Congress enjoys its summer recess, it's a good time to reflect on where the bill is positioned as we head into the second part of the year.\nThe legislation was introduced in March by Sens. Booker, Paul and Gillibrand, and received huge media attention, including a lead editorial in the New York Times in support of the bill, the day after it was introduced.\nThe advocacy groups in Washington, D.C. pushing CARERS have spent much of a very successful summer building support for the bill by advocating for the passage of three Senate appropriations amendments that mirror provisions of CARERS. These spending amendments would take effect for one year only, so they are less impactful than the legislative changes we would see through the passage of CARERS, but nonetheless they allowed us to test the waters on support for major provisions of the bill.\nThe key takeaway from these votes is that the Senate is ready to debate medical marijuana, and a majority would approve the CARERS Act if it was brought to the floor for a vote.\nThe adoption by the Senate of three amendments that are almost identical to provisions in the CARERS Act was a welcome development, not least because every amendment garnered bipartisan support. Perhaps the most important part of CARERS is the section that allows states to set their own medical marijuana policies.\nThe amendment mirroring this provision passed the Senate Appropriations Committee 21-9, with seven Republicans supporting. The size of the victory demonstrates that, contrary to what some may have said, the Senate is ready to tackle full medical marijuana. Another amendment allowing veterans access to medical marijuana passed 18-12, and an amendment allowing marijuana businesses to access banking services passed 16-14.\nWe've also seen Executive action reflective of reforms included in CARERS. The Obama Administration recently removed a large research barrier -- the PHS Review -- that CARERS sought to eliminate.\nSenators Grassley and Feinstein, whose buy-in is important for CARERS to progress, have gone from being opponents of medical marijuana to holding a recent hearing on the issue, and drafting a Time magazine op-ed on the need for more research and access to certain types of medical marijuana. Sen. Feinstein also secured language in a separate funding bill calling for more research and recognizing \"the potential therapeutic benefits that marijuana and its components may bring to patients with serious medical conditions, including seizures, multiple sclerosis, Parkinson's disease, Alzheimer's, substance use disorders, and neuropathic and cancer pain.\" Sen. Grassley is a crucial player in this process, given that he chairs the Judiciary Committee, through which CARERS must pass.\nThe bill itself has a lot of momentum behind it -- 15 cosponsors , including 12 Democrats, two Republicans and one independent. The recent addition of Chuck Schumer -- the likely future head of the Senate Democrats and a key Judiciary member -- was another boost. And the bill continues to be regularly praised in the media, including in last Sunday's New York Times editorial .\nThe next few months will see advocates turn their attention to translating the Republican support for appropriations amendments into cosponsorship for CARERS -- something we need your help with. Advocates will also continue our dialogue with Senator Grassley and push for a Judiciary Committee hearing and vote on CARERS, which would clearly pass the Senate if allowed to move forward. Let's hope the next five months are as successful as the last five.\nClick here to contact your Senator and ask him/her to sponsor the CARERS ACT.\nMichael Collins is a policy manager for the Drug Policy Alliance .\nThis piece first appeared on the Drug Policy Alliance Blog: http://www.drugpolicy.org/ blog/momentum-continues-build- historic-federal-medical- marijuana-bill\nMore: Marijuana Marijuana Federal Marijuana Bill", "external_links": ["http://www.politico.com/magazine/story/2015/07/dea-marijuana-120674.html#.VczKjX0eqy0", "http://www.drugpolicy.org/sites/default/files/DPA_Fact_Sheet_CARERS_Act_Aug2015.pdf", "http://www.drugpolicy.org/news/2015/07/new-yorks-senator-schumer-throws-weight-behind-federal-medical-marijuana-legislation", "http://www.washingtonpost.com/news/wonkblog/wp/2015/06/22/the-obama-administration-just-made-medical-marijuana-research-easier/", "http://www.drugpolicy.org/news/2015/07/senate-appropriations-committee-allows-marijuana-legalization-move-forward-nations-capi", "http://www.drugpolicy.org/", "http://www.washingtonpost.com/blogs/govbeat/wp/2015/03/09/whats-in-the-historic-medical-marijuana-bill-being-unveiled-on-tuesday/", "http://time.com/3958768/medical-marijuana-research/", "http://www.drugpolicy.org/blog/momentum-continues-build-historic-federal-medical-marijuana-bill", "https://secure2.convio.net/dpa/site/Advocacy?cmd=display&page=UserAction&id=1323", "http://www.nytimes.com/2015/08/09/opinion/sunday/congress-and-obama-have-been-too-timid-on-marijuana-reform.html?smid=nytcore-iphone-share&smprod=nytcore-iphone&_r=0&referrer=", "http://www.nytimes.com/2015/03/11/opinion/a-sensible-bill-on-medical-marijuana.html", "https://www.congress.gov/bill/114th-congress/senate-bill/683/cosponsors", "http://www.drugpolicy.org/news/2015/06/senate-appropriations-committee-votes-prevent-dea-undermining-state-medical-marijuana-l", "http://files.iowamedicalmarijuana.org/petition/Chuck-Grassley-marijuana-statement-PDF.pdf", "https://www.congress.gov/congressional-report/114th-congress/senate-report/74/1", "http://www.grassley.senate.gov/news/news-releases/grassley-statement-drug-caucus-hearing-cannabidiol-barriers-research-and", "http://www.drugpolicy.org/about-us/staff-and-board/staff/michael-collins-policy-manager"], "published": "2015-08-14T22:12:00.000+03:00", "crawled": "2015-08-14T22:40:56.641+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}