{"organizations": [], "uuid": "831c951d7d7b1d786d08c4f4d96af5f96263a9bf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55bbb5e91d000030001437c0.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/weird-news/news.xml", "section_title": "Weird News News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/lawmakers-call-for-investigation-into-dojs-continued-crackdown-of-medical-marijuana_55bba4f4e4b0d4f33a0296ab", "country": "US", "title": "Lawmakers Call For Investigation Into DOJ's Continued Crackdown On Medical Marijuana", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Lawmakers Call For Investigation Into DOJ's Continued Crackdown On Medical Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T23:47:00.000+03:00", "replies_count": 0, "uuid": "831c951d7d7b1d786d08c4f4d96af5f96263a9bf"}, "author": "Matt Ferner", "url": "http://www.huffingtonpost.com/entry/lawmakers-call-for-investigation-into-dojs-continued-crackdown-of-medical-marijuana_55bba4f4e4b0d4f33a0296ab", "ord_in_thread": 0, "title": "Lawmakers Call For Investigation Into DOJ's Continued Crackdown On Medical Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lawmakers Call For Investigation Into DOJ's Continued Crackdown On Medical Marijuana The Justice Department may be in violation of the law, congressmen say. Matt Ferner National Reporter, The Huffington Post Posted: 07/31/2015 04:47 PM EDT FREDERIC J. BROWN via Getty Images \nTwo congressmen behind a federal provision protecting state-legal medical marijuana operations are seeking an investigation into the Department of Justice's continued crackdown on medical marijuana patients and providers, saying the DOJ may be in violation of federal law. \n\"We request that you immediately investigate the Department's expenditure of funds to continue prosecuting these cases, which we believe are in direct violation of the prohibition on such expenditures established by Rohrabacher-Farr,\" reads the letter , addressed to DOJ Inspector General Michael Horowitz from Reps. Sam Farr (D-Calif.) and Dana Rohrabacher (R-Calif.). \nRohrabacher and Farr's amendment, which blocks the Justice Department from using funds to undermine state-legal medical marijuana programs, found support in Congress and ultimately made it into the final federal spending bill signed into law by President Barack Obama in December . As the marijuana provision is part of an annual funding bill that will expire, the lawmakers introduced an identical version again in June, which was reauthorized by the House of Representatives. \nDespite last year's provision becoming law, \"the Department has continued to pursue and prosecute individuals and businesses for involvement with medical marijuana in states where it is legal despite the clear direction in the law to forswear such activities,\" the lawmakers wrote Thursday. \nDOJ spokesman Patrick Rodenbush laid out the department's justification for doing so earlier this year, telling the Los Angeles Times that the marijuana protections only stop the department from \"impeding the ability of states to carry out their medical marijuana laws,\" and that the DOJ didn't \"expect that the amendment will impact our ability to prosecute private individuals or private entities who are violating the Controlled Substances Act.” \nBut in Thursday's letter, the congressmen blast Rodenbush's position on the matter. \n\"Mr. Rodenbush's interpretation is clearly a stretch,\" the letter reads. \"The implementation of state law is carried out by individuals and businesses as the state authorizes them to do. For DOJ to argue otherwise is a tortuous twisting of the text ... and common sense.\" \nAny DOJ official who interprets their provision differently is \"doing so knowingly and willfully, without regard for the facts,\" the congressmen argue, adding that the continued use of federal funds to prevent individuals or businesses who are compliant with their state laws is \"clearly a violation\" of their provision. \nAlthough the DOJ has slowed its crackdown on medical marijuana recently, it continues to target some dispensaries and patients. \nEarlier this year, Farr and Rohrabacher, along with Rep. Barbara Lee (D-Calif.), wrote a letter publicly condemning the DOJ for trying to shutter the Oakland, California-based Harborside Health Center -- widely considered to be the largest and one of the most well-respected medical marijuana dispensaries in the nation. \nIn Washington state last year, the DOJ went after a family of medical marijuana patients who have maintained they were growing more than 70 medical marijuana plants for their own personal medical use near their rural home in Kettle Falls. \nCiting these and other cases in their letter, Rohrabacher and Farr argue the DOJ has overstepped its bounds \"spending dollars it does not have the legal authority to spend.\" \nA spokesman for the DOJ inspector general's office acknowledged that the letter was received and said that the office will respond to the congressmen after reviewing it. DOJ spokesman Rodenbush declined a Huffington Post request for comment. \nTo date, 23 states have legalized marijuana for medical purposes, and an additional 17 have legalized limited medical use of nonpsychoactive cannabis extracts, which are often used to treat children with severe epilepsy. Four states and the District of Columbia have legalized recreational marijuana. \nUnder the Obama administration, the Drug Enforcement Administration and several U.S. attorneys have raided marijuana dispensaries and sent people to prison, even though they complied with state laws. According to a 2013 report released by advocacy group Americans for Safe Access, the Obama administration has spent nearly $80 million each year -- more than $200,000 per day -- cracking down on medical marijuana. \nMeanwhile, the American public overwhelmingly support the use of medical marijuana: A 2014 CBS News poll found 86 percent of Americans believe doctors should be able to prescribe marijuana to their patients. \nDespite the public's support and congressional amendment's protections, the federal government continues to classify the plant among the most \"dangerous\" substances, alongside heroin and LSD, with \"no currently accepted medical use.\" \nRead the full letter below: \nAlso on HuffPost:", "external_links": [], "published": "2015-07-31T23:47:00.000+03:00", "crawled": "2015-08-01T00:04:40.098+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}