{"organizations": ["ISIS", "Fox News Facebook", "Twitter"], "uuid": "94cbced01700da31ee9e30abd0a934e17c428185", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/090914/0/0/090914_ssr_burns_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2014/09/10/mr-obama-dont-let-your-own-psychology-interfere-with-message-send-isis.html", "country": "", "title": "Mr. Obama, don't let your own psychology interfere with message you send ISIS | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mr. Obama, don't let your own psychology interfere with message you send ISIS | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "94cbced01700da31ee9e30abd0a934e17c428185"}, "author": "", "url": "http://www.foxnews.com/opinion/2014/09/10/mr-obama-dont-let-your-own-psychology-interfere-with-message-send-isis.html", "ord_in_thread": 0, "title": "Mr. Obama, don't let your own psychology interfere with message you send ISIS | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nMr. President, I know this consult is uninvited. But, Wednesday you will address the nation about the threat ISIS poses to the world. \nYou must not let your own psychology interfere with the message you send to our mortal enemies. \nI believe you feel ambivalent about the decency of America. But if you let that ambivalence be known by ISIS, they will be emboldened. \n[pullquote] \nIt is natural for a group intent on the destruction of the United States to feel strengthened in their resolve if they intuit that the president of the United States shares any grave misgivings about whether we are a force for good in the world, or evil. \nYou have voiced such misgivings. You must stop. \nI know that many in my profession and in yours would consider offering my perspectives to be inappropriate, given that you have not been, and more likely than not will never choose to be, one of my clients. However, with much of the world in conflict and many thousands dying, I hope you will consider my insights. \nSometimes, Mr. President, a whole culture can focus its unresolved issues on one man. In this case, your election to the presidency was fueled, at least in part, by America being traumatized by the horrors of 9/11 and questioning (wrongly) whether something in the character of the nation was to blame for such carnage – whether we had “brought it on ourselves.” \nYour profound ambivalence about the decency of this country was a perfect match for the self-doubt brewing in its people, and you used your office to further that self-doubt, even tipping it toward self-loathing. \nYou went to Europe to apologize publicly for the wrongs done by America. You needed lots of coaxing to renounce the Rev. Jeremiah Wright, who led your church and had baptized your children and who had also loudly condemned this nation. \nIn 2008, as your campaign for president gathered steam, your wife confessed that she had never felt pride in our nation before it considered electing you, her husband, to lead it. \nAnd you reminded American businessmen that they should never feel pride in having built anything themselves, because their businesses were really the result of the communal efforts of folks who did things like building and paving the roads on which employees then drove to the workplace. \nAs you look around the world, if it was not your conscious intention to contribute to fanning the flames of hatred toward the United States (and only you can know this), please consider whether you have unconsciously done so. \nAn American embassy was overrun in Benghazi, and a U.S. ambassador and three other public servants were murdered. Some say your administration instructed no one to lend a hand to prevent it. \nAmerican journalists have been beheaded, and you went golfing. \nA military movement (ISIS) has taken over parts of two countries and commandeered untold weapons, all while swearing to destroy America, and you have been vacationing and fundraising. America’s staunch ally, Israel, has been fighting an existential threat from terrorists, and you have withheld needed support. \nWhen you hold the highest office in America, Mr. President, our enemies will feel emboldened to act upon their antipathy toward us if they intuit that you, too, harbor hatred toward this nation – even if it’s just parts of it. And your policies, behavior and demeanor do suggest that. \nPlease know that as Americans and people all over the world listen to your speech about ISIS, they will be listening—both consciously and at a deeply unconscious level—for further clues that you, like they, think that the United States deserves an ISIS terror attack. \nYou must go to great lengths to convince our adversaries that you are unapologetically, wholeheartedly with us--the people of the United States. You should tell the men and women of ISIS that, if they doubt it, they should look to the skies as bombs fall upon them and picture your face on the wings of the planes delivering those bombs. \nIf you now understand that a less powerful America means less freedom around the world, if you now understand that a less powerful America means more powerful fanatical extremists around the world, then take bold action and use bold words to show it. \nYou will need to go a long distance to convince our mortal enemies that you see them as mortal enemies, too. I pray that you will. \nDr. Keith Ablow is a psychiatrist and member of the Fox News Medical A-Team. ", "external_links": [], "published": "2015-08-05T03:00:00.000+03:00", "crawled": "2015-08-06T12:23:08.653+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}