{"organizations": [], "uuid": "a613dc4a5454abf1cc752bd3235beb5fe31b6920", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c3b9511700006e00566d20.jpeg?cache=i8RGvPQLSA", "site_section": "http://www.huffingtonpost.com/tag/420/feed", "section_title": "420 on Huffington Post", "url": "http://www.huffingtonpost.com/entry/state-marijuana-laws_55c3a74de4b0d9b743db4985?ncid=txtlnkusaolp00000595&kvcommref=mostpopular", "country": "US", "title": "State Lawmakers Want Feds To Respect Their Marijuana Laws", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "State Lawmakers Want Feds To Respect Their Marijuana Laws", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T19:38:00.000+03:00", "replies_count": 0, "uuid": "a613dc4a5454abf1cc752bd3235beb5fe31b6920"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/state-marijuana-laws_55c3a74de4b0d9b743db4985?ncid=txtlnkusaolp00000595&kvcommref=mostpopular", "ord_in_thread": 0, "title": "State Lawmakers Want Feds To Respect Their Marijuana Laws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "State Lawmakers Want Feds To Respect Their Marijuana Laws “State lawmakers just sent a message to Congress that could not be any clearer.\"   08/06/2015 04:38 PM EDT | Edited: 3 hours ago traffic_analyzer via Getty Images \nState lawmakers agree: The federal government should not interfere with states that set their own marijuana laws. \nThe National Conference of State Legislatures, a nongovernment organization composed of state lawmakers and their staffs, passed a resolution Thursday urging the federal government to amend the Controlled Substances Act and other federal laws \"to explicitly allow states to set their own marijuana and hemp policies without federal interference\" and to refrain from undermining state marijuana and hemp laws. \nAdditionally, the resolution acknowledges that lawmakers in different states will have differing views on how to treat the plant, but the NCSL members agree that \"states and localities should be able to set whatever marijuana and hemp policies work best to improve the public safety, health, and economic development of their communities.\" \nThe passage of the resolution represents a strong statement from state lawmakers. It was passed on voice vote by a majority of participating lawmakers from 75 percent of the states represented at the conference. Mick Bullock, director of public affairs for the NCSL, told The Huffington Post that 49 member jurisdictions were represented during the vote. Member jurisdictions include all states, the District of Columbia and U.S. territories. \nEarlier in the week, the resolution passed a committee vote unanimously, 21-0. \nMarijuana policy reformers praised the passage of the resolution. \n“State lawmakers just sent a message to Congress that could not be any clearer,” Karen O’Keefe, director of state policies for the Marijuana Policy Project, said in a statement. \nTom Angell, chairman of Marijuana Majority, shared similar sentiments and added that while the Obama administration has been helpful in accommodating states that want to forge their own policies regarding marijuana, \"overarching federal prohibition laws still stand in the way of full and effective implementation.\" \nTo date, 23 states, as well as the District of Columbia, have legalized medical marijuana, while 17 others have legalized the limited medical use of cannabis extracts, frequently used to treat debilitating seizures. Four states and D.C. have legalized recreational marijuana. (The District still bans retail sales.) \nBut marijuana, be it medical or recreational, remains prohibited under federal law, and states rely on Department of Justice guidance urging federal prosecutors to refrain from targeting state-legal marijuana operations. \nWhile federal prosecutions of medical marijuana patients and providers have slowed more recently, the Drug Enforcement Administration and several U.S. attorneys under the Obama administration have raided marijuana dispensaries and sent people to prison, even though they complied with state laws. According to a 2013 report released by advocacy group Americans for Safe Access, the federal government has spent almost $80 million each year -- more than $200,000 per day -- cracking down on medical marijuana. \nA majority of Americans appear to be on the side of the NCSL resolution. Multiple recent polls have found most Americans support the legalization of recreational and medical marijuana. And a report from centrist think tank Third Way found that a majority of Americans want each state to be allowed to decide its own marijuana laws without federal interference. It also found that most Americans would support a new federal law that would make those marijuana-legal states a \"safe haven\" from federal laws against cannabis, allowing them to act outside federal policies on the substance. \nRead the full resolution below: \nAlso on HuffPost: Top 50 Most Influential Marijuana Users of", "external_links": [], "published": "2015-08-06T19:38:00.000+03:00", "crawled": "2015-08-07T03:15:41.695+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}