{"organizations": [], "uuid": "487b7871e330698a1156edde7de6fdf16e81c060", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/080315_anr_Mckelway_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/08/03/obama-announces-power-plant-regulations/", "country": "US", "title": "Obama announces power plant regulations, GOP lawmakers vow fight", "performance_score": 4, "site": "foxnews.com", "participants_count": 24, "title_full": "Obama announces power plant regulations, GOP lawmakers vow fight | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T03:00:00.000+03:00", "replies_count": 31, "uuid": "1ec783075c94c2ede2f186453bd97a5d3ba78f47"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/08/03/obama-announces-power-plant-regulations/#post-0", "ord_in_thread": 0, "title": "Obama announces power plant regulations, GOP lawmakers vow fight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nWASHINGTON – President Obama on Monday announced new regulations on power-plant carbon emissions that will have a dramatic impact on how Americans make, store and use energy.\nThe president, speaking at the White House, touted the plan as a necessary step to combat global warming, even as the coal industry gears up to challenge the controversial regulations in court and Republicans prepare to fight them in Congress.\n\"There is such a thing as being too late when it comes to climate change,\" Obama said.\nThe plan calls for a 32 percent emissions cut by 2030, as compared with 2005 levels. The goals are even steeper than previously expected.\nBut already, the plan faces tough resistance. The Murray Energy Corporation, a coal mining company, announced Monday it would sue, and more than a dozen states and other companies were expected to take similar action. Senate Majority Leader Mitch McConnell, a Kentucky Republican, vowed to use legislation to thwart the president.\n\"President Obama will deliver another blow to the economy and the middle class,\" McConnell said on the Senate floor.\nHouse Speaker John Boehner, who had previously described the draft plan as \"nuts,\" called the final plan rolled out Monday \"an expensive, arrogant insult to Americans who are struggling to make ends meet.\"\nSome of the changes Obama announced go further in cutting the heat-trapping gases blamed for global warming, Other changes include delaying implementation and eliminating certain options that states could use to show they're cutting emissions.\n\"Time is not on our side here,\" the president said.\nRepublicans in Congress say they will fight the changes, and industry officials have expressed hesitation over the plan's cost and ambitious timetable.\nSen. Jim Inhofe, R-Okla., arguably the Senate's most vocal climate change skeptic, called the new rules \"unachievable without great economic pain\" and said it was a \"burden President Obama thinks the American people should bear for the sake of his legacy.\"\nObama announced the move as part of a broader push by his administration to position the United States as a global leader tackling climate change.\nThe new regulations on greenhouse gases are been the latest blow to the coal industry by the administration. Companies like Walter Energy and Alpha Natural Resources, one of the nation's largest coal producers, have seen their market value virtually wiped out since Obama became president in 2009.\nAlpha, which operates about 60 coal mines in Virginia, West Virginia, Kentucky, Wyoming and Pennsylvania, filed for Chapter 11 bankruptcy protection Monday, two weeks after its rival Walter Energy.\nAlpha is the fourth large coal producer to file for bankruptcy protection in the past two years.\nMurray Energy Corp., the largest privately held coal mining company in the country, announced Monday it was filing five federal lawsuits to fight the new rule changes. The company plans to file a lawsuit against each of the three individual regulations the EPA revealed Monday. It also plans file a lawsuit against the entire regulatory package. The company will also appeal a lawsuit it lost in June that challenged one of the then-unfinished regulations.\nThe rule would require a 32 percent cut in power-plant carbon dioxide emissions by 2030 from 2005 levels, an increase from the 30 percent target proposed last year.\nEPA Administrator Gina McCarthy said Sunday the rule would result in an estimated annual cost of $8.4 billion by 2030 and have total benefits, including public-health benefits, of $34 billion to $54 billion per year by then.\nThe new EPA rules rolled out Monday are key to Obama's legacy, and come despite the Supreme Court recently challenging EPA mercury rules.\nIn November, Obama rolled out an aggressive climate deal with China, and has made a climate change a top priority when meeting with world leaders. He's also expected to discuss it next month when Pope Francis visits.\nThe Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Inevitable no more? Clinton march to party nod disrupted 2 White House mulling intervention in massive judgment against Palestinians in terror case 3 Obama announces power plant regulations, GOP lawmakers vow fight 4 DNC head still can’t explain difference between Democrats, socialists 5 Graham camp blasts Washington Post ‘hit job’ on Air Force record See all Trends Advertisement", "external_links": [], "published": "2015-08-03T03:00:00.000+03:00", "crawled": "2015-08-03T22:52:25.572+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}