{"organizations": [], "uuid": "dcc17d5f2d3d8a2fe2a3434e1519ae4120486690", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2012/12/26/us/michelle-obama---fast-facts/index.html", "country": "", "title": "Michelle Obama Fast Facts - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Michelle Obama Fast Facts - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "dcc17d5f2d3d8a2fe2a3434e1519ae4120486690"}, "author": "", "url": "http://www.cnn.com/2012/12/26/us/michelle-obama---fast-facts/index.html", "ord_in_thread": 0, "title": "Michelle Obama Fast Facts - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Michelle Obama Fast Facts Updated 1732 GMT (0032 HKT) August 20, 2015 JUST WATCHED Here's a look at the life of Michelle Obama, wife of 44th U.S. President Barack Obama . Personal: Birth date: January 17, 1964 Birth place: Chicago, Illinois Birth name: Michelle LaVaughn Robinson Father: Fraser Robinson, water filtration worker Mother: Marian (Shields) Robinson Marriage: Barack Obama, Jr. (October 3, 1992-present) Children: Sasha, June 7, 2001; Malia, July 4, 1998 Education: Princeton University, B.A., 1985; Harvard University, J.D., 1988 Religion: Christian Other Facts: Graduated magna cum laude with a sociology degree from Princeton. Met Barack Obama when she was assigned to be his mentor at Sidley & Austin, a Chicago law firm. Her father suffered from and eventually died of multiple sclerosis. Timeline: 1988-1991 - Associate attorney at Sidley & Austin in Chicago. 1991-1992 - Assistant to Chicago Mayor Richard Daley. 1992-1993 - Assistant Commissioner of Planning and Development. 1993-1996 - Founding executive director of Public Allies Chicago. 1996-2002 - Associate Dean of Student Services for University of Chicago and director of the University Community Service Center. 2002-2005 - Executive Director for Community Affairs for University of Chicago Hospitals. 2005-2007 - Member of the board of Tree House Foods, a food supplier for Wal-Mart stores. 2005-January 2009 - Executive Vice President of Community and External Affairs for UC Hospitals. January 20, 2009 - Becomes the First Lady of the United States . April 2009 - \"Michelle Obama in her Own Words\" is published. February 2009 - Appears on the March cover of Vogue magazine. February 9, 2010 - Launches national campaign, \"Let's Move!,\" to reduce childhood obesity. June 20, 2011 - Travels to Africa for a week to focus on youth leadership, education, health and wellness. June 21, 2011 - Visits former president of South Africa Nelson Mandela at his home. May 29, 2012 - \"American Grown: The Story of the White House Kitchen Garden and Gardens Across America\" is published. February 24, 2013 - Michelle Obama presents the Academy Award for best picture at the Oscars. March 13, 2013 - Along with other high profile celebrities and politicians, Michelle Obama's financial information is hacked and posted online. Her student loan information and credit report are posted. March 14, 2013 - Is on the cover of April's edition of Vogue. This is the second time she has appeared on the cover. 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – First lady Michelle Obama, who turns 50 on Friday, January 17, catches the American public's attention whenever she sports a new look. Hide Caption 1 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – People took notice when Obama decided to ditch her bangs last year. She explained the decision to Parade magazine in August: \"You know, it's hard to make speeches with hair in your face!\" Hide Caption 2 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – For the Inauguration Night balls in 2013, Obama wore a ruby-colored chiffon and velvet gown by Jason Wu, the same designer who made her 2009 inaugural dress. Known for her continuous support of emerging designers, the first lady essentially made the Taiwanese-born designer a household name in 2009 by wearing his dress. Hide Caption 3 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – For Inauguration Day, the first lady mixed \"high\" and \"low\" fashion with a belt from J. Crew, coat and dress by Thom Browne, Reed Krakoff boots and necklace by Cathy Waterman, the White House said. After the festivities, the outfit and accompanying accessories were to go to the National Archives. Hide Caption 4 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – Obama is known for her loyalty to designers and brands from a variety of price points, often wearing the same items on multiple occasions. At the president's swearing-in ceremony on January 20, 2013, she debuted a dress by Reed Krakoff, whose jackets and gowns she has worn before. Krakoff, the creative director of Coach, started his own label in 2010, style blog Mrs. O noted . Hide Caption 5 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – On her 49th birthday in 2013, Obama's office tweeted images of the first lady with new bangs. Here she meets with inaugural \"citizen\" co-chairman David Hall. Hide Caption 6 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – The public's obsession with Obama's sartorial choices began with the Narciso Rodriguez sheath she wore when her family took the stage at Chicago's Grant Park after her husband's victory in the 2008 presidential election. Some lauded the choice as an eye-catching statement; others called it an eyesore. Hide Caption 7 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – Public opinion was equally divided on the lemongrass shift by Cuban-American designer Isabel Toledo that the first lady wore to her husband's swearing-in on January 20, 2009. Hide Caption 8 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – Greater public consensus surrounded the ball gown Obama wore on inauguration night in 2009. The dress put designer Jason Wu on the map and solidified the first lady's reputation as having a keen eye for emerging talent. Hide Caption 9 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – Obama has been known to wear dresses from mass retailer Talbots and accessorize them with signature pieces such as this sweater from Dear Cashmere and a belt by Sonia Rykiel, worn in July 2009, according to style blog Mrs. O . Hide Caption 10 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – Obama has worn this Target dress on multiple occasions since being photographed in it as she stepped off Air Force One with daughter Sasha on August 15, 2009, according to style blog Mrs. O. Hide Caption 11 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – Obama transitioned from a daytime meeting with Mexico's first lady to an awards ceremony on February 25, 2010, wearing the same Jason Wu dress , according to style blog Mrs. O. Hide Caption 12 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – At the annual Clinton Global Initiative in September 2010, the first lady played up her passion for prints with a Moschino Cheap & Chic multipatterned chemise that featured hothouse flowers on top and a digital print on the bottom, fashion consultant Mikki Taylor noted. Hide Caption 13 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – Obama highlighted the talents of Indian-born American designer Naeem Khan in this scarlet hued gown with matte crushed sequins and abstract wind-blown roses on scarlet tulle at the 2010 Kennedy Center Honors, according to Taylor. Hide Caption 14 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – The first lady made an entrance at the 2011 Medal of Honor ceremony in a brocade dress by Barbara Tfank that she has worn on multiple occasions since, including a recent appearance on the \"Today\" show, Taylor said. Hide Caption 15 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – The first lady worked her signature elegance at the Congressional Black Caucus' Annual Phoenix Awards in 2011, pairing a floor length, double-face paillette fishtail skirt by Michael Kors with a black top and a Peter Soronen corset belt, Taylor said. Hide Caption 16 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – The first lady wore a Vera Wang gown to the Kennedy Center Honors at the Kennedy Center in Washington on December 4, 2011. Hide Caption 17 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – For lunch with Parklawn Elementary School students in Alexandria, Virginia, Obama wore an argyle sweater from J. Crew, Taylor said. The sweater has made multiple appearances since her January 2012 visit to talk about the USDA's new nutrition standards for school lunches. Hide Caption 18 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – Obama showed her right to bare arms in a Zac Posen sheath at a state dinner in honor of British Prime Minister David Cameron on March 14, 2012, at the White House. Hide Caption 19 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – Obama wore another gown by Indian-American designer Naeem Khan at the White House Correspondents Dinner in April 2012 in Washington, Taylor noted. Hide Caption 20 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – The first lady worked the crowd at the 2012 Democratic National Convention in Charlotte, North Carolina, in a Tracy Reese sheath with pink suede pumps by J.Crew, according to Taylor. Hide Caption 21 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – At the final 2012 presidential debate in Boca Raton, Florida, Obama donned the same Thom Browne fog gray dress with black lace overlay that she wore at the DNC, reworked this time with a black belt and a stone brooch, Taylor noted. Hide Caption 22 of 23 23 photos: Photos: Michelle Obama's style Michelle Obama's evolving style – Obama greeted the audience at the Kennedy Center Honors in December in a striking gold lame gown by Michael Kors, according to Taylor. Hide Caption <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from US ", "external_links": [], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-21T02:04:12.258+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}