{"organizations": ["Fox News"], "uuid": "07f64452bb7ec66c2d165271294018296adb510f", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Immigration%20services.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/02/feds-action-taken-to-fix-wrongly-awarded-work-permits-under-immigration/", "country": "", "title": "Feds: Action taken to fix work permits wrongly awarded under executive immigration action | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Feds: Action taken to fix work permits wrongly awarded under executive immigration action | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T18:30:00.000+03:00", "replies_count": 0, "uuid": "07f64452bb7ec66c2d165271294018296adb510f"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/02/feds-action-taken-to-fix-wrongly-awarded-work-permits-under-immigration/", "ord_in_thread": 0, "title": "Feds: Action taken to fix work permits wrongly awarded under executive immigration action | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Feds: Action taken to fix work permits wrongly awarded under executive immigration action Published August 02, 2015 Fox News Latino 2013 Getty Images \nHOUSTON (AP) – Problems have been fixed that led to about 2,100 work permits being mistakenly awarded under President Barack Obama's executive immigration action after a federal judge in Texas had put the plan on hold, the Justice Department said in newly filed court documents. \nFederal officials had been ordered by U.S. District Judge Andrew Hanen to offer a detailed explanation of how the permits were wrongly given out in May after Hanen put Obama's immigration plan on hold Feb. 16 at the request of a coalition of 26 states, led by Texas, that sued to stop the proposed action. \nHanen, based in Brownsville, had threatened to hold Homeland Security Secretary Jeh Johnson and other top immigration enforcement officials in contempt of court if the problems weren't fixed. \nIn court documents filed late Friday night, Justice Department attorneys said the federal government now complies with Hanen's preliminary injunction that suspended the Obama plan, which proposed expanding a program that young immigrants from deportation if they were brought to the U.S. illegally as children and adding another that extends deportation protections to parents of U.S. citizens and permanent residents who have been in the country for some years. \nIn a 52-page document, federal attorneys said the three-year work authorizations had either been converted to two years or rescinded altogether in cases where those given the authorization failed to return them as required. \nFederal authorities said that officials worked to recover an additional 500 three-year work permits that had been issued prior to the judge's injunction but were returned as undeliverable and mistakenly mailed again after the injunction was issued. U.S. Citizenship and Immigration Services dispatched dozens of representatives to contact those who were issued the permits, agency director Leon Rodriguez said in a statement filed among the court documents. \nSaying they had \"remedied the situation\" that prompted Hanen to threaten contempt citations, the federal attorneys asked that Hanen cancel an Aug. 19 hearing he scheduled to have federal officials explain how the problems were corrected. The judge had previously said he would cancel the hearing if he was satisfied federal officials had fixed the problems. \nIt was not immediately known if Hanen still planned to hold the hearing. If he does, federal attorneys ask that he excuse all but Rodriguez from appearing. \nHanen has previously criticized the federal government's actions in the lawsuit, saying it had been \"misleading\" after officials revealed that more than 108,000 people had already received three-year reprieves from deportation as well as work permits when the judge had believed that no action would be taken before he issued a ruling. \nJustice Department attorneys apologized for any confusion but insisted the reprieves were granted under a 2012 program that wasn't affected by the injunction. \nObama said in November when putting forth the executive order that lack of action by Congress forced him to make sweeping changes to immigration rules on his own. The coalition of states argues Obama's action is unconstitutional. \nA ruling on an appeal of Hanen's injunction is pending from the 5th U.S. Circuit Court of Appeals in New Orleans, which heard arguments in the case on July 10. \nAlong with Texas, the states seeking to block Obama's action are: Alabama, Arizona, Arkansas, Florida, Georgia, Idaho, Indiana, Kansas, Louisiana, Maine, Michigan, Mississippi, Montana, Nebraska, Nevada, North Carolina, North Dakota, Ohio, Oklahoma, South Carolina, South Dakota, Tennessee, Utah, West Virginia and Wisconsin. \nLike us on Facebook ", "external_links": [], "published": "2015-08-02T18:30:00.000+03:00", "crawled": "2015-08-02T18:30:31.203+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}