{"organizations": [], "uuid": "4b0f5d01f2fd4429f162b5b6eb3e83e9824376a7", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/jonathan-greenblatt/headshot.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/jonathan-greenblatt/when-hateful-speech-leads_b_8022966.html", "country": "", "title": "When Hateful Speech Leads to Hate Crimes: Taking Bigotry Out of the Immigration Debate | Jonathan Greenblatt", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "When Hateful Speech Leads to Hate Crimes: Taking Bigotry Out of the Immigration Debate | Jonathan Greenblatt", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "4b0f5d01f2fd4429f162b5b6eb3e83e9824376a7"}, "author": "", "url": "http://www.huffingtonpost.com/jonathan-greenblatt/when-hateful-speech-leads_b_8022966.html", "ord_in_thread": 0, "title": "When Hateful Speech Leads to Hate Crimes: Taking Bigotry Out of the Immigration Debate | Jonathan Greenblatt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jonathan Greenblatt"], "text": "stumble \nWhen police arrived at the scene in Boston, they found a Latino man shaking on the ground, his face apparently soaked in urine, with a broken nose. His arms and chest had been beaten. One of the two brothers arrested and charged with the hate crime reportedly told police, \"Donald Trump was right--all these illegals need to be deported.\" \nThe victim, a homeless man, was apparently sleeping outside of a subway station in Dorchester when the perpetrators attacked. His only offense was being in the wrong place at the wrong time. The brothers attacked him for who he was--simply because he was Latino. \nIn recent weeks anti-immigrant--and by extension anti-Latino--rhetoric has reached a fever pitch. Immigrants have been smeared as \"killers\" and \"rapists.\" They have been accused of bringing drugs and crime. A radio talk show host in Iowa has called for enslavement of undocumented immigrants if they do not leave within 60 days. There have been calls to repeal the 14th Amendment's guarantee of citizenship to people born in the United States, with allegations that people come here to have so-called \"anchor babies.\" And the terms \"illegal aliens\" and \"illegals\"-- which many mainstream news sources wisely rejected years ago because they dehumanize and stigmatize people--have resurged. \nThe words used on the campaign trail, on the floors of Congress, in the news, and in all our living rooms have consequences. They directly impact our ability to sustain a society that ensures dignity and equality for all. Bigoted rhetoric and words laced with prejudice are building blocks for the pyramid of hate . \nBiased behaviors build on one another, becoming ever more threatening and dangerous towards the top. At the base is bias, which includes stereotyping and insensitive remarks. It sets the foundation for a second, more complex and more damaging layer: individual acts of prejudice, including bullying, slurs, and dehumanization. Next is discrimination, which in turn supports bias-motivated violence, including hate crimes like the tragic one in Boston. And in the most extreme cases if left unchecked, the top of the pyramid of hate is genocide. \nJust like a pyramid, the lower levels support the upper levels. Bias, prejudice and discrimination--particularly touted by those with a loud megaphone and cheering crowd--all contribute to an atmosphere that enables hate crimes and other hate-fueled violence. The most recent hate crime in Boston is just one of too many. In fact, there is a hate crime roughly every 90 minutes in the United States today. That is why last week ADL announced a new initiative, #50StatesAgainstHate , to strengthen hate crimes laws around the country and safeguard communities vulnerable to hate-fueled attacks. We are working with a broad coalition of partners to get the ball rolling. \nLaws alone, however, cannot cure the disease of hate. To do that, we need to change the conversation. We would not suggest that any one person's words caused this tragedy - the perpetrators did that; but the rhetorical excesses by so many over the past few weeks give rise to a climate in which prejudice, discrimination, and hate-fueled violence can take root. Reasonable people can differ about how we should fix our broken immigration system, but stereotypes, slurs, smears and insults have no place in the debate. \nImmigrants have been a frequent target of hate, and unfortunately, prejudice and violence are not new. Many of our ancestors faced similar prejudice when they came to the United States. In the 1800s, the attacks were against Irish and German immigrants. Next was a wave of anti-Chinese sentiment culminating with the Chinese Exclusion Act in 1882. Then the hatred turned on the Jews, highlighted by the lynching of Leo Frank in 1915. Then came bigotry against Japanese immigrants and people of Japanese dissent, which led to the shameful internment of more than 110,000 people during World War II. Today, anti-immigrant bigotry largely focuses on Latinos. The targets have changed, but the messages of hate remain largely the same. It is long past time for that to end. \nADL, as a 501(c)(3), does not support or oppose candidates for elective office, but we have a simple message for all policymakers and candidates: There is no place for hate in the immigration debate. There is nothing patriotic or admirable about hatred and hate-fueled violence. The only acceptable response to hate crimes is unequivocal, strong condemnation. And the same is true for the bias, prejudice, and bigoted speech that have recently permeated the immigration conversation. \nFollow Jonathan Greenblatt on Twitter: www.twitter.com/@JGreenblattADL More: ", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-22T00:38:20.897+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}