{"organizations": ["United States Navy", "Facebook", "Fox News Obama", "Twitter"], "uuid": "02a2eeb41016b477a04333ac77f4d99a24c33085", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/Turkey%20US%20Syria_Cham640360.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/08/03/obama-approves-using-us-air-power-to-defend-us-backed-syrian-forces/", "country": "", "title": "Obama approves using US air power to defend Pentagon-trained Syria rebel forces | Fox News", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama approves using US air power to defend Pentagon-trained Syria rebel forces | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T09:08:00.000+03:00", "replies_count": 0, "uuid": "02a2eeb41016b477a04333ac77f4d99a24c33085"}, "author": "", "url": "http://www.foxnews.com/politics/2015/08/03/obama-approves-using-us-air-power-to-defend-us-backed-syrian-forces/", "ord_in_thread": 0, "title": "Obama approves using US air power to defend Pentagon-trained Syria rebel forces | Fox News", "locations": ["US", "Incirlik Air Base", "Syria", "Turkey", "Adana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gurel", "Obama"], "text": "Obama approves using US air power to defend Pentagon-trained Syria rebel forces Published August 03, 2015 Facebook 0 Twitter 0 livefyre Email Print July 31, 2015: A United States Navy airplane takes off from the Incirlik Air Base on the outskirts of the city of Adana, southern Turkey. (AP Photo/Emrah Gurel) \nPresident Obama has approved using American air power to defend U.S-backed rebels in Syria from attacks by President Bashar al-Assad's forces or Islamist groups, increasing the chances of direct conflict between Washington and Damascus. \nUnder new rules of engagement proposed by the Pentagon and approved by the White House last week, forces trained and equipped by the Pentagon would receive cover from U.S. aircraft. Only about 60 rebels have graduated from the U.S-led training program. The new rules were first reported Sunday by the Wall Street Journal . \nThe Pentagon has downplayed the possibility of conflict between U.S. aircraft and Syrian government forces, saying that the Pentagon-backed fighters were committed to fighting the Islamic State terror group (ISIS). \n\"We view the Syrian forces trained and equipped by the Department of Defense as partners in the counter-ISIL effort,\" Pentagon spokesman Capt. Jeff Davis told Fox News, using another acronym for ISIS. \"These forces are being provided with a wide range of Coalition support in their mission to counter-ISIL, which includes defensive fires support to protect them.\" \nThe Journal reported that the new rules were first applied on Friday, when a compound used by the Pentagon-trained force came under attack by the Nusra Front, another rebel group with ties to Al Qaeda. \n\"We won't get into the specifics of our rules of engagement, but have said all along that we would take the steps necessary to ensure that these forces could successfully carry out their mission,\" Davis said. \"We demonstrated our resolve in this respect on Friday‎.\" \nMultiple defense officials tell Fox News that any supporting air strikes will be carried out by unmanned drones flying out of Incirlik Air Force Base in Turkey, to avoid the risk of American pilots being shot down by Syrian government planes or anti-aircraft weaponry. The Journal also reported that the Pentagon is only authorized to carry out offensive air operations when the force comes up against ISIS, and the fighters on the ground have been specifically instructed not to carry out attacks against Assad's forces. \nU.S. officials tell the paper that the Assad regime has so far heeded warnings not to interfere in the U.S.-led campaign against ISIS, which has included airstrikes in support of Kurdish and other Arab forces. That commitment, as well as recent battlefield setbacks for Assad's forces, raises hopes among Pentagon officials that the Syrian leader will not risk a confrontation with the U.S. by attacking the force. \nThe Journal also reported that the rules of engagement do not apply to U.S.-backed rebels in southern Syria, which include CIA-backed units whose primary focus is overthrowing Assad. The Pentagon-backed force is currently located somewhere in northern Syria. \n\"For offensive operations, it’s ISIS only. But if attacked, we’ll defend them against anyone who’s attacking them,\" a senior military official told the Journal. \"We’re not looking to engage the regime, but we’ve made a commitment to help defend these people.\" \nThe Pentagon had set a goal of training and arming 3,000 so-called moderate rebels by the end of this year. However, the process of finding fighters who oppose ISIS and have no ties to other Islamist groups has slowed the process. ", "external_links": [], "published": "2015-08-03T09:08:00.000+03:00", "crawled": "2015-08-03T09:08:20.103+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}