{"organizations": [], "uuid": "a67b6554d3881146358412c63bf47d16a309db6c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/shelbyrichard_050715gn.jpg", "site_section": "http://thehill.com/taxonomy/term/20/feed#", "section_title": "The Hill: All Business & Lobbying", "url": "http://thehill.com/business-a-lobbying/249812-dems-press-republican-to-move-obama-nominees", "country": "US", "title": "Dems press Republican to move Obama nominees", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Dems press Republican to move Obama nominees", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T21:05:00.000+03:00", "replies_count": 0, "uuid": "a67b6554d3881146358412c63bf47d16a309db6c"}, "author": "iswanson@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/business-a-lobbying/249812-dems-press-republican-to-move-obama-nominees", "ord_in_thread": 0, "title": "Dems press Republican to move Obama nominees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dems press Republican to move Obama nominees Greg Nash By Kevin Cirilli - 07/30/15 02:05 PM EDT \nDemocrats on the Senate Banking Committee are pushing Chairman Richard Shelby (R-Ala.) to act on President Obama’s nominations. \nEach of the panel’s 10 Democrats signed a letter circulated by Sen. Sherrod Brown (D-Ohio), the panel's ranking member, urging Shelby to move the nominations. ADVERTISEMENT “The Committee has not held a single nomination hearing; not one nomination has come before the committee in executive session; and no nominees have been discharged for the Senate's consideration,” the Democrats wrote in the letter, obtained by The Hill.\nThe Banking Committee has received 11 nominations including for positions on the board of the Export-Import Bank, Federal Reserve Board, Department of Treasury and U.S. Mint. \nA representative for Shelby could not immediately be reached for comment.According to the letter, the Banking panel is the only committee in the Senate that has yet this year to hold a hearing on nominees. \nThat's compared to three nomination hearings by August 2007, when President George W. Bush was in office and Democrats held the Senate, the letter said. The Senate had confirmed more than a dozen nominees by that point in that Congress, it said. \nThe full list of pending nominations for the Banking panel include Allan Landon to be a member of the Board of Governors of the Federal Reserve System; Therese McMillan to be federal transit administrator; Jay Neal Lerner to be inspector general at the Federal Deposit Insurance Corporation; John E. Mendez to be a director at the Securities Investor Protection Corporation; Leslie E. Bains to be a director at the Securities Investor Protection Corporation; Adewale Adeyemo to be an assistant secretary of the Treasury; Amias Moore Gerety to be an assistant secretary of the Treasury; Adam Szubin to be undersecretary for terrorism and financial crimes; Patricia M. Loui-Schmicker to be a member of the board of directors of the Export-Import Bank; Kathryn Dominguez to be a member of the Federal Reserve Board; and Matthew Rhett Jeppson to be the director of the U.S. Mint. \nSzbuin is scheduled for a nomination hearing on Sept. 10, the committee announced earlier this week. There are no other nomination hearings currently scheduled. \n1 day Fifth Planned Parenthood video... An official also discusses altering abortion procedures to meet specific... Bush drops 40 pounds on Paleo diet Bush talked about his weight loss in an interview at an Iowa Dairy Queen. Trump: Harvard students '... Trump fell victim to an elaborate prank by a group of Harvard students. Field set for first GOP debate Rick Perry fails to make the top 10, officially announced by Fox late... Senate GOP thwarted in effort to... Two Democrats voted to move forward with the bill, which stalled in a 53-... Kelly Osbourne makes racial remark... \"If you kick every Latino out ... then who is going to be cleaning your... Harvard Lampoon tricks Trump with... A fake endorsement called Trump \"the most formidable and competitive\" GOP... Iran denies link between... A website alleged that Javad Zarif’s son was the best man at Vanessa Kerry... Trump: Shut down government over... Trump called for the tactic to cut off the group's funding in the wake of... Trump's leaked phone number... Callers to Trump's number are told about his website and Twitter account. Poll: Clinton's favorability takes... Clinton is viewed unfavorably by 48 percent; favorably by 37 percent. Capitol Police: Staffer arrested... Rep. Duncan Hunter says his staffer is \"a hero\" and the incident must be... Judge extends block on videos from... A hearing is set for Aug. 27. Obama celebrated birthday at Rose'... The president and his guests reportedly skipped the line on their way in. McConnell's vow: No more... The Senate majority leader pledges to begin talks \"at some point.\" Three lines of attack against... Opponents are looking to all three branches of government to block the... Gawker publishes Trump phone number “Mr. Trump has several numbers so this is not an issue,” a campaign source... Juan Williams: GOP's anger turns... OPINION | Republicans who feed the resentments of the base imperil GOP... Congress holds hearing on... Why would anyone take seriously such a biased hearing on the BDS movement? Biden challenge to Clinton would... The biggest challenge would be finding a niche — and a reason for his... GOP lawmaker diagnosed with... Rep. Curbelo says last few weeks have been trying for family. Fifth Planned Parenthood video to... The videos have led to a defunding fight over Planned Parenthood. Two undocumented immigrants... VIDEO | The outcry was loud Monday night in Huntington Park, Calif. Carson: Black Lives Matter... Carson also discussed illegal immigration in an NBC interview.", "external_links": [], "published": "2015-07-30T21:05:00.000+03:00", "crawled": "2015-08-06T16:45:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}