{"organizations": [], "uuid": "002c7ee67e746d65d2c53ed3b5796e6e5d60ebd5", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150807154418-chuck-schumer-barack-obama-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/08/10/opinions/louis-schumer-iran-deal/index.html", "country": "US", "title": "Schumer's careful break with Obama on Iran deal CNN.com", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Schumer's careful break with Obama on Iran deal - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "002c7ee67e746d65d2c53ed3b5796e6e5d60ebd5"}, "author": "Errol Louis", "url": "http://www.cnn.com/2015/08/10/opinions/louis-schumer-iran-deal/index.html", "ord_in_thread": 0, "title": "Schumer's careful break with Obama on Iran deal CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Errol Louis: Sen. Chuck Schumer disagreed with Iran deal but didn't burn bridges to White House He says Schumer was wise not to stir up opposition among other Democratic senators Errol Louis is the host of \"Inside City Hall,\" a nightly political show on NY1, a New York all-news channel. The opinions expressed in this commentary are solely those of the author.\n(CNN) Even if you don't agree with Sen. Chuck Schumer's decision to oppose President Barack Obama's proposed nuclear non-proliferation deal with Iran, you have to admire his skill at carefully walking through a political minefield without surrendering his power, his principles or his political future.\nOn a pending vote that puts at stake everything Schumer cares about -- American national security, the safety of Israel and the power and prestige of the Democratic Party -- the senior senator from New York decided not to play it safe.\nErrol Louis \"When it comes to the non-nuclear aspects of the deal, I think there is a strong case that we are better off without an agreement than with one,\" Schumer said in an official statement that grudgingly praised the nuclear containment provision of the proposed deal while expressing concern that lifting sanctions on Iran will give the regime billions of dollars to foment global terrorism.\n\"Restrictions should have been put in place limiting how Iran could use its new resources,\" Schumer said.\nBy partly praising and partly condemning the deal, Schumer showed himself to be thoughtful -- no one doubts whether this well-known policy wonk personally read through every page of the thick diplomatic document -- and muted in his criticism of the White House's main goal of slowing and containing Iran's nuclear program.\nThe careful criticism extends to Schumer's timing. Curbing his famous skill at maximizing press coverage (\"the most dangerous place is between him and a camera,\" ex-Sen. Bob Dole once quipped , Schumer's quiet release of his opposition signaled he will not be rounding up votes to block the deal. In fact, Schumer took the unusual step of canceling a scheduled public appearance the day after his statement's release.\nJUST WATCHED Obama loses support from key Democrat on Iran deal Replay More Videos ... MUST WATCH\nObama loses support from key Democrat on Iran deal 02:05 PLAY VIDEO And hours before Schumer's statement came word that his fellow Democrat and junior New York senator, Kirsten Gillibrand, is supporting Obama's Iran proposal. Presumably, if Schumer were planning an all-out opposition campaign, he'd start by convincing his fellow New Yorker. The fact he didn't speaks volumes.\nAll the maneuvering leaves Schumer in an enviable position. Opposing the deal honors his history as a politician with deep roots in pro-Israel politics: Back in his years as a congressman, Schumer once represented the most heavily Jewish congressional district in America, where many of his donors and longtime supporters still live.\nBut by muting his objections, Schumer keeps a measure of peace with the White House. Obama has promised to veto a rejection of his plan, and overriding a veto would require an estimated 15 Democratic senators to abandon the President. Schumer's vote makes only two definite Democratic \"no\" votes , and his apparent intention not to pressure his fellow senators suggests he is willing to allow the deal to go through.\nBy quietly enabling Obama to push the Iran deal -- a major part of his presidential legacy -- Schumer has secured and protected his reputation as a subtle and savvy operator in the corridors of power. That's exactly why his fellow senators respect him -- and it's a tribute to Schumer's political skills that his break with the White House won't doom his relationship with Obama, won't sink the deal and won't halt his all-but-certain elevation to Democratic conference leader in the Senate.\nFollow @CNNOpinion Join us on Facebook.com/CNNOpinion.\nRead CNNOpinion's Flipboard magazine.", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150807154418-chuck-schumer-barack-obama-full-169.jpg", "https://www.washingtonpost.com/news/reliable-source/wp/2015/04/01/chuck-schumer-and-that-most-dangerous-place-joke/", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "https://twitter.com/CNNOpinion", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505111801-errol-louis-profile-small-169.jpg", "http://www.schumer.senate.gov/newsroom/press-releases/my-position-on-the-iran-deal", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505111801-errol-louis-profile-exlarge-169.jpg", "https://flipboard.com/section/voices-baPbmr", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505111801-errol-louis-profile-super-169.jpg", "http://errollouis.tumblr.com/", "http://www.facebook.com/CNNOpinion", "http://i2.cdn.turner.com/cnnnext/dam/assets/150807154418-chuck-schumer-barack-obama-small-11.jpg", "http://www.washingtonpost.com/news/post-politics/wp/2015/08/07/why-schumer-isnt-actually-going-to-kill-the-iran-deal/", "http://www.ny1.com/nyc/all-boroughs/politics/2015/08/7/schumer-cancels-scheduled-public-appearance-one-day-after-stating-opposition-to-iran-deal.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150807154418-chuck-schumer-barack-obama-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150807154418-chuck-schumer-barack-obama-super-169.jpg", "http://www.ny1.com/nyc/all-boroughs/politics/inside-city-hall.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150807154418-chuck-schumer-barack-obama-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505111801-errol-louis-profile-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505111801-errol-louis-profile-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150807154418-chuck-schumer-barack-obama-large-169.jpg", "http://www.washingtontimes.com/news/2015/aug/5/obama-iran-vote-most-important-intl-debate-since-i/?page=all", "http://i2.cdn.turner.com/cnnnext/dam/assets/150807154418-chuck-schumer-barack-obama-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505111801-errol-louis-profile-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505111801-errol-louis-profile-medium-plus-169.jpg"], "published": "2015-08-10T03:00:00.000+03:00", "crawled": "2015-08-10T16:20:58.691+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}