{"organizations": [], "uuid": "42b320458acc381b5f8acb048202b0f87bc4a1c6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1049657/images/o-ABORTION-RATES-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/birth-control/feed", "section_title": "Birth Control on Huffington Post", "url": "http://www.huffingtonpost.com/christine-horner/mike-huckabee-you-want-ab_b_7922606.html", "country": "US", "title": "Christine Horner: Mike Huckabee, You Want Abortion to Go Away? Then Let's Work Together -- Here's How", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Christine Horner: Mike Huckabee, You Want Abortion to Go Away? Then Let's Work Together -- Here's How", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T21:35:00.000+03:00", "replies_count": 0, "uuid": "42b320458acc381b5f8acb048202b0f87bc4a1c6"}, "author": "Christine Horner", "url": "http://www.huffingtonpost.com/christine-horner/mike-huckabee-you-want-ab_b_7922606.html", "ord_in_thread": 0, "title": "Christine Horner: Mike Huckabee, You Want Abortion to Go Away? Then Let's Work Together -- Here's How", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nWe humans have an abortion problem. The morality of abortion is unresolvable because the miracle of life doesn't apply to just the one in the womb, it extends to all life. In other words, if the crux of the issue is preserving the sanctity of life, that must include protecting the lives of those already here. More on that in a moment . . . \nThe challenge with morality itself is how we define it continually draws new lines in the sand based on philosophical, religious, scientific, technological, etc. thought processes that continue to advance over time as we become more intelligent. \nThough our human rights record is still pretty dismal, most of the world is more civilized than we were even a hundred years ago. Believe it or not, morality is improving as we demand new protections for human life, animals and even the planet. It's been a struggle, but we are slowly maturing. \nHuman consciousness varies widely throughout the world, even within our own hometowns. The bottom line is the less developed humans are, the more closed minded, exclusive and violent. Conversely, as we evolve, greater is our receptivity to change, inclusiveness and non-violence. If expanding consciousness causes strife between generations, cultural differences make it even more pronounced. You can see why it is so challenging for us to agree on just about anything. The good news is there is one line in the sand that never shifts. \nSustainability . \nWomen had to fight for their reproductive rights because of the lack of support, and worse -- hardship, poverty, familial and societal ostracizing -- even death -- all qualifying as non-sustainability. Women came together to support themselves by demanding bodily rights as an act of self-preservation, which is sustainability -- and a human right. \nLet's examine the ways and means we've been attempting to solve our abortion problem. Notice how they reflect differing levels of consciousness. \nMr. Huckabee, please ask yourself: Will reversing Roe vs. Wade end abortion? \nWill sending out the federal troops and the FBI end abortion? \nWill publicly shaming women and medical personnel end abortion? \nWill blockading, picketing or restricting access to abortion clinics prevent abortion? \nWill excluding birth control in health care benefits end abortion? \nWill making birth control difficult to access end abortion? Will teaching abstention only in place of other birth control options end abortion? \nSustainability is the trump card that transcends continually evolving philosophies, ignorance, cultural differences -- and critics. It champions life, seeking to serve the highest good for the greatest number. \nInstead of fighting among each other, let us work together toward achieving the same goal. If we can solve this one, we can solve anything. We really do want the same thing -- to end abortion. \nIllegalizing abortion and making contraception difficult to obtain are perfect examples of when an ideal is predominantly positive -- protecting life -- but the approach is predominantly negative, dooming it to failure. \nLet's swap out misguided intentions for effective problem solving by enacting policy and legislation changes that will: Expand education for women (and men) about their bodies in and out of abstention. Make birth control and counseling even more widely available. End the shaming women for being sexual beings and pregnancy. \nWe already have conclusive evidence that free birth control reduces abortion. Access to contraception is not going to make the world suddenly more immoral (or less) than it already is. Fast-tracking a cut in funding to Planned Parenthood as a whole without due diligence is another knee-jerk reaction \nTurning to studies again, we see that Millennials (Gen Y) and the TransGeneration (Gen Z) are the most educated generations to date. Trending are more conservative views toward sex as today's youth begin to make more informed and personalized choices. \nHuman evolution means that the techniques used to sustain life evolve, too. Women aren't going to suddenly stop having children. It means children brought into the world out of loving choice will have the greatest chance to not only survive, but thrive. \nIf we want to work together to end abortion, the most sustainable and effective way is by providing unrestricted support so that we can advance much more quickly toward ending the war, creating a world where abortion is an outdated and unnecessary practice. This is morality in a higher form. \nFollow Christine Horner on Twitter: www.twitter.com/authorhornerc More:", "external_links": [], "published": "2015-08-03T21:35:00.000+03:00", "crawled": "2015-08-04T03:01:39.948+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}