{"organizations": ["Facebook", "Twitter"], "uuid": "9ceffaa080e7a536c62c0ba32417071a2e7ed8c0", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Health/0/0/marijuana2.jpg", "site_section": "http://feeds.foxnews.com/foxnews/health?format=xml", "section_title": "FOX News", "url": "http://www.foxnews.com/health/2015/08/04/study-finds-no-link-between-teen-marijuana-use-mental-health-issues/", "country": "US", "title": "Study finds no link between teen marijuana use, mental health issues", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Study finds no link between teen marijuana use, mental health issues", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T16:37:00.000+03:00", "replies_count": 0, "uuid": "9ceffaa080e7a536c62c0ba32417071a2e7ed8c0"}, "author": "", "url": "http://www.foxnews.com/health/2015/08/04/study-finds-no-link-between-teen-marijuana-use-mental-health-issues/", "ord_in_thread": 0, "title": "Study finds no link between teen marijuana use, mental health issues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Study finds no link between teen marijuana use, mental health issues Published August 04, 2015 Facebook 0 Twitter 0 livefyre Email Print (REUTERS/Alejandro Acosta) \nA new study reports that chronic marijuana use in teenage boys does not appear to be linked to later physical or mental health issues such as depression, psychotic symptoms or asthma. The study, published by the American Physiological Association, did not include teenage girls. \nResearchers from the University of Pittsburgh Medical Center and Rutgers University compiled data by tracking 408 males from adolescence into their mid-30s. The participants were placed into four groups based on their reported marijuana use: low or non-users, early chronic users, participants who only smoked during adolescence, and those who began using marijuana late in their teens and continued through adulthood. Early chronic users reported higher marijuana use, which increased in their teens to a peak of more than 200 days per year on average when they were 22 years old, the news release said. \nThe study was an offshoot of the Pittsburg Youth Study, which tracked 14-year-old male students in Pittsburgh public schools in the late 1980s, according to a news release. Participants were surveyed annually or semiannually, and a follow up survey was conducted in 2009-2010 when the volunteers were 36 years old. \nBased on the results of prior studies, authors expected to find a link between teen marijuana use and the later development of psychotic symptoms, cancer, asthma or respiratory problems but found none, according to a news release. \n“What we found was a little surprising,” lead researcher Jordan Bechtold, a psychology research fellow at the University of Pittsburgh Medical Center, said in the release. “There were no differences in any of the mental or physical health outcomes that we measured regardless of the amount of frequency of marijuana used during adolescence.” \nResearchers also found on link between teen marijuana use and lifetime depression, anxiety, allegories, headaches or high blood pressure. The team also controlled for other factors that could have influenced results such as cigarette smoking, other illicit drug use, and access to health insurance. \n“We wanted to help inform the debate about legalization of marijuana, but it’s a very complicated issue and one study should not be taken in isolation,” Bechtold said, according to the news release. Advertisement", "external_links": [], "published": "2015-08-04T16:37:00.000+03:00", "crawled": "2015-08-04T17:09:10.793+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}