{"organizations": [], "uuid": "25c598db9371aef3730a8125a3433401fee4d305", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/religion/index.xml", "section_title": "Religion - The Huffington Post", "url": "http://www.huffingtonpost.com/andy-watts/catching-abortions-before_b_7984936.html", "country": "US", "title": "Catching Abortions Before They Happen?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Catching Abortions Before They Happen?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T00:21:00.000+03:00", "replies_count": 0, "uuid": "25c598db9371aef3730a8125a3433401fee4d305"}, "author": "Andy Watts", "url": "http://www.huffingtonpost.com/andy-watts/catching-abortions-before_b_7984936.html", "ord_in_thread": 0, "title": "Catching Abortions Before They Happen?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nI'm an avid baseball fan who learned to love the sport in the 1970's. That is, before sabermetrics and the scientific valuation of players to teams came on the scene. It was also before free agency and the rise of the fan as 'consumer.' What's done is done, and we now speak about baseball in terms like WAR--Wins Above Replacement. WAR is a category in sabermetric statistical analysis that determines the number of wins a player brings to a team in comparison to another player. Team management and execs can now project, within a good degree of accuracy, a team's wins and losses through the data-driven analysis of players. So what has this to do with abortion? Let me explain. I also learned in the 1970's that baseball can be a metaphor for sexual activity, at least from a male perspective as far as I knew. What if this kind of metrics had been available to me as a 'tween? I might have had a different puberty. \nYet, using this kind of projection science in the realm of human sexual behavior might not be too far off. For instance, concerning abortion, it's plausible that the metrics of probability might be used to predict more than which women are more at risk for post-abortion stress syndrome, or which pregnancies have a higher possibility for spontaneous abortion or miscarriage. \nStatistics might be used not only to describe the demographics of women who have abortions more often (see Guttmacher.org ) but also to identify which particular group of women will most be likely to have an abortion at a specific moment in their futures. \nThis kind of tracking could arguably be the first move in preventive, and subsequently pre-emptive anti-abortion enforcement, particularly in states where the legal status of abortion has been significantly narrowed, like Kansas and Missouri. Collaborators in risk assessment, tracking, and sting operations could include the courts, the police, insurance representatives, companies, and private firms. \nWhile all this seems too close to the science fiction book and movie, Minority Report , some of the necessary pieces for this kind of law enforcement are in place. Preventive criminal justice already exists. \nIn fact, FiveThirtyEight eerily references Minority Report in its August 4th article, \" Should Prison Sentences Be Based on Crimes That Haven't Been Committed Yet ?\" It highlights the fact that almost all states turn to social and psychological metrics in some form to adjudicate criminal cases, from awarding parole and setting bail. It's a way to reduce recidivism and therefore crime. \nBut Pennsylvania, it reports, will inaugurate a new age for risk assessment in criminal justice. It will begin using a number of social and demographic data to determine the probability of criminal activity as an aid to sentencing. This includes information concerning the behaviors of the individual being sentenced and other individuals of comparable demographics. \nThe authors ask, \"Is it fair to look at the behavior of a group when deciding the fate of an individual?\" As a partial answer they reference Eric Holder's warning that basing sentencing decisions on static factors and immutable characteristics such as education level, socioeconomic background, or neighborhood, prosecutors and judges may exacerbate unwarranted and unjust disparities. \nWhile I haven't found a report of risk assessment being used in the way I have suggested it could be used, many Christians will go to great lengths to end abortions, including homicide. Moral interest groups are active in many state legislatures pushing for laws that will achieve that end. One of the many legal implications of \"personhood\" legislation, for example, is the criminalizing of abortion except in exceptional situations. Could it be that anti-abortion faith-based groups will support risk assessment protocols in law enforcement to stop abortion crime before it occurs, if indeed abortion is comprehensively criminalized? What would this look like? \nWhat worries me is that many Christians shortsightedly, and often exclusively, connect abortion to sexual immorality. Recently, one of my respected peers argued aspects of this attitude in a well-written and insightful article . The research on abortion, however, finds that abortion is an outcome produced by clusters of social, political, psychological, physiological, moral and behavioral factors. \nIn this prolific \"ends justify the means\" society--a Wins Above Replacement society--we might soon see the day when a no-tolerance moral stance on abortion justifies commensurate legislation, which then justifies commensurate law enforcement, which then justifies commensurate prosecution and sentencing. \nWhile my Christian faith leads me to view abortion through the lenses of sadness, indignity, compassion, anger, hospitality, and generosity, I am equally disturbed by the willingness of Christians to so easily trade one moral value for another. We happily seem to believe that the answer to abortion lies in restricting moral freedom. We limit access, funding, support, and protection to many women (and some men) making hard choices. \nHopefully we will avoid charging in the future some bodies with the pre-crime of abortion. Jesus might help us do that if we follow his lead in his approach to the woman caught in adultery. Like him, we might refuse to let the power of one group (the patriarchs) determine the fate of an individual (the woman). In John he turns the question, \"Where is the sin here?\" on its head, dismantling the crime and the penalty at the same time. More:", "external_links": [], "published": "2015-08-15T00:21:00.000+03:00", "crawled": "2015-08-15T00:48:15.376+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}