{"organizations": ["The Huffington Post"], "uuid": "4f6688108efd710abfcb8392eedbadf2a3fd7845", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c38f801700006e00566c58.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-erdogan-isis-kurds_55c38f07e4b0923c12bbdb7f", "country": "", "title": "Obama To Turks: Don't Use The War On ISIS To Bomb The Kurds", "performance_score": 10, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama To Turks: Don't Use The War On ISIS To Bomb The Kurds", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T00:15:00.000+03:00", "replies_count": 0, "uuid": "4f6688108efd710abfcb8392eedbadf2a3fd7845"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-erdogan-isis-kurds_55c38f07e4b0923c12bbdb7f", "ord_in_thread": 0, "title": "Obama To Turks: Don't Use The War On ISIS To Bomb The Kurds", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan Grim", "Obama"], "text": "Obama To Turks: Don't Use The War On ISIS To Bomb The Kurds \"We have to stay focused.\" Ryan Grim Washington bureau chief for The Huffington Post Posted: 08/06/2015 04:06 PM EDT | Edited: 45 minutes ago \nWASHINGTON -- The White House has warned the Turkish government that the war against the Islamic State in Syria must be “carefully bound” so as not to go on the offensive against Kurdish fighters, President Barack Obama said Wednesday. \nThe Kurds have been effective allies of the U.S. as the only fighters to claim major and sustained victories against the Islamic State militant group. But Turkish President Recep Tayyip Erdogan, a hard-line nationalist, considers Kurds in both Turkey and Syria to be enemies of the state. \nMore importantly, Erdogan has suffered a political setback at the hands of the People's Democratic Party, a Kurdish-Turkish alliance that won 80 seats in recent parliamentary elections. Going to war against the Kurds could be a way for Erdogan to split the opposition coalition. \nThe Huffington Post asked Obama if he was concerned that Erdogan would use the campaign against the Islamic State as an excuse to target the PKK -- the Kurdish separatist movement that has allied fighters in Syria. \n“Well, we’ve discussed with the Turks our strong view that ISIL” -- the name the White House uses for the Islamic State -- “poses the largest threat to the region and we have to stay focused, [and our view] that to the extent the PKK engages in attacks against Turkish targets, it is legitimate for the Turks to try to defend themselves,” he said. “But the agreement that we are working on is carefully bound around: How do we close off that border to foreign fighters entering into Syria? And everything we do will be based on that issue.” \nObama was speaking on the record to a group of 10 reporters at the White House, discussing the Iran nuclear deal and Middle East policy more broadly. \nThe PKK has been waging a separatist campaign in Turkey for decades, although in recent years it has taken part in various peace processes. In Syria, a PKK-affiliated group known as the YPG captured global attention in January with its hard-line stand against a relentless Islamic State assault on the Syrian town of Kobani, which borders Turkey. Turkish tanks and troops looked on as Islamic State fighters besieged the town over several weeks, with observers predicting its imminent fall. One key assault even appeared to have come from across the Turkish border, suggesting that Erdogan was quite content to see the Kurds routed. This perception significantly dented peace talks. \nTurkey eventually allowed a handful of Iraqi Kurdish fighters to reinforce the stragglers in Kobani. As the YPG held out, the U.S. began assisting with airstrikes. Gradually, the YPG pushed the Islamic State out of Kobani and the surrounding area. This was not just a tactical setback -- it was also a propaganda loss. The Islamic State's image of invincibility and fearsomeness was eroded, especially by the many photos and videos that surfaced of female Kurdish fighters on the front line. \nWhen Turkey began launching strikes against the Islamic State last week, it also took the opportunity to pound away at Kurdish warehouses and positions as far away as northern Iraq. \nAlthough the PKK is on the U.S. Department of State terror list, its YPG affiliate isn't. YPG has continued to post victories in Syria and has established a functioning government of sorts based on a communitarian ideology. ", "external_links": [], "published": "2015-08-07T00:15:00.000+03:00", "crawled": "2015-08-07T00:15:30.544+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}