{"organizations": [], "uuid": "2ffc961200c261b36ec72e577f0aebd287affa0b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55be35c91d000030001438c6.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/donald-trump-no-black-presidents-obama_55be34c3e4b06363d5a27ec4", "country": "", "title": "Donald Trump: No Black Presidents For A While Because Of Obama", "performance_score": 5, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Donald Trump: No Black Presidents For A While Because Of Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T20:20:00.000+03:00", "replies_count": 0, "uuid": "2ffc961200c261b36ec72e577f0aebd287affa0b"}, "author": "", "url": "http://www.huffingtonpost.com/entry/donald-trump-no-black-presidents-obama_55be34c3e4b06363d5a27ec4", "ord_in_thread": 0, "title": "Donald Trump: No Black Presidents For A While Because Of Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama Trump", "Obama Donald Trump", "Ryan J. Reilly", "Donald Trump"], "text": "Donald Trump: No Black Presidents For A While Because Of Obama Trump thinks he'll win the black vote, too. Ryan J. Reilly Justice Reporter, The Huffington Post Posted: 08/02/2015 12:18 PM EDT \nWASHINGTON -- Donald Trump thinks the United States will not see another black president for some time because Barack Obama has \"set a very poor standard,\" the billionaire businessman, entertainer and Republican presidential candidate told ABC News on Sunday . Trump -- who has questioned whether Obama was born in the United States and was once sued by the Justice Department because the management of his apartment complexes allegedly discriminated against black tenants -- also thinks he'll win the black vote. \nTrump responded to a question on the show about a tweet he sent last year saying America would not see another black president for generations because of how poorly he thought Obama had done. \n\"He has done nothing for African Americans. You look at what's gone on with their income levels. You look at what's gone on with their youth. I thought that he would be a great cheerleader for this country. I thought he'd do a fabulous job for the African American citizens of this country. He has done nothing,\" Trump said. \n\"They have problems now in terms of unemployment numbers, look at their unemployment numbers. And you have -- here you have a black president who's done very poorly for the African Americans of this country,\" Trump said. \"I think that I will win the African American vote and I think I will win the Hispanic vote.\" \nTrump also distanced himself from his past praise of some of his current opponents, basically acknowledging he only said nice things about them in the past because he needed good relationships with politicians for business purposes. \nTrump also would not rule out a third-party run for office, saying only that he wouldn't run as an independent if he was treated fairly by the Republican party. ", "external_links": [], "published": "2015-08-02T20:20:00.000+03:00", "crawled": "2015-08-02T20:20:55.442+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}