{"organizations": [], "uuid": "652c447787f06bcd7f58f9319c19fffa3342be34", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55ccdb16170000b700567727.jpeg", "site_section": "http://www.huffingtonpost.com/tag/alaska/feed", "section_title": "Alaska on Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-visit-alaska_55ccda64e4b064d5910ac8e6?kvcommref=mostpopular", "country": "US", "title": "Obama To Visit Alaska, But Enviros Cry Foul Over Arctic Drilling", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama To Visit Alaska, But Enviros Cry Foul Over Arctic Drilling", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T17:53:00.000+03:00", "replies_count": 0, "uuid": "652c447787f06bcd7f58f9319c19fffa3342be34"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/obama-visit-alaska_55ccda64e4b064d5910ac8e6?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Obama To Visit Alaska, But Enviros Cry Foul Over Arctic Drilling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Obama To Visit Alaska, But Enviros Cry Foul Over Arctic Drilling Environmentalists say drilling for oil in the Arctic while pledging to save it is \"deeply hypocritical.\" Kate Sheppard Senior reporter/Environment and energy editor, The Huffington Post Posted: 08/13/2015 02:53 PM EDT | Edited: 2 hours ago President Barack Obama speaks about his Clean Power Plan on Aug. 3, 2015. | Credit: Andrew Harnik/Associated Press \nWASHINGTON -- President Barack Obama is traveling to Alaska later this month to visit the front lines of climate change, which he called \"one of the greatest challenges we face this century\" in a video posted Thursday . \nThe effects of climate change in Alaska are \"our wake up call,\" the president said. \n\"In Alaska, glaciers are melting. The hunting, fishing, upon which generations have depended for their way of life and for their jobs, are being threatened. Storm surges once held at bay now endanger entire villages,\" Obama continued. \"As Alaskan permafrost melts, some homes are even sinking into the ground. The state's God-given natural treasures are at risk.\" \nObama will be in the state from August 31 through September 3. The White House said he will meet with Alaskans experiencing climate change's impacts, and will seek to bring national and global attention the issue. \nWhile environmental groups welcome Obama's visit to the Arctic -- the first by a sitting president -- they also point out that the administration has approved permits allowing Shell to drill for oil in the region, even as the president decries the effects of climate change, which is largely driven by the burning of fossil fuels. \nShell received permission to move forward with exploratory drilling , but needs to modify some of its plans before drilling can begin. \nGreenpeace USA and Oil Change International released a new report Wednesday condemning drilling in the region . \"Announcing a tour of Alaska to highlight climate change would be deeply hypocritical if the President would then turn around and give Shell final approval to drill in the Arctic tomorrow,\" Greenpeace spokesman Travis Nichols told The Huffington Post in an email. \nThe prospect of drilling in the Arctic while promoting the need to protect it is \"like shooting rhinos to save them,\" said Ben Schreiber, climate and energy program director at Friends of the Earth.", "external_links": [], "published": "2015-08-13T17:53:00.000+03:00", "crawled": "2015-08-14T00:18:05.623+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}