{"organizations": [], "uuid": "b8096a005fb7cb39ffee129c81be28b39468c360", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaclimate071415.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/energy-environment/249973-obama-turns-to-climate-change", "country": "", "title": "Obama turns to climate change | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama turns to climate change | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T13:50:00.000+03:00", "replies_count": 0, "uuid": "b8096a005fb7cb39ffee129c81be28b39468c360"}, "author": "", "url": "http://thehill.com/policy/energy-environment/249973-obama-turns-to-climate-change", "ord_in_thread": 0, "title": "Obama turns to climate change | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jordan Fabian", "Tim Cama", "Obama"], "text": "Obama turns to climate change By Jordan Fabian and Tim Cama - 08/02/15 06:00 AM EDT \nPresident Obama is looking to cement his legacy on climate change. \nHis administration will finalize sweeping new regulations on power plants on Monday, which is sure to spark a fight with Republicans in Congress. \nIn a video released early Sunday, Obama called the plan \"the biggest, most important step we've ever taken to combat climate change.\" BREAKING: On Monday, @POTUS will release his #CleanPowerPlan —the biggest step we've ever taken to #ActOnClimate . https://t.co/BU1PF0wjUK — The White House (@WhiteHouse) August 2, 2015 \nObama is also pushing to complete a major international agreement on greenhouse gas emissions in Paris later this year. \nTo underscore his focus on climate change, Obama plans to travel to Las Vegas on Aug. 24 to keynote the National Clean Energy Summit, an event founded by Senate Minority Leader Harry Reid (D-Nev.). \nThe president will go to Alaska at the end of the month to speak at a conference on how global warming is affecting the Arctic. \nTop Obama advisers call climate the number-one issue remaining on his plate in a second term that has featured sweeping executive actions to open relations with Cuba and to secure a nuclear deal with Iran. \n“There’s not a more important and pressing issue on the president’s agenda than climate,” White House chief of staff Denis McDonough said in a speech this week. \nBut Obama's achievements rest on fragile ground. Many of his executive actions on climate could be undone depending on which party wins the White House in 2016. \nA major climate victory has eluded Obama, who famously said in 2008 his presidency could be “the moment when the rise of the oceans began to slow and our planet began to heal.” \nA 2009 global climate summit in Copenhagen is widely regarded as a failure. Congress failed to pass a cap-and-trade bill to tax carbon emissions early in his presidency. \nMeasures addressing climate change have been dead on arrival as Republicans, many of whom question whether climate change is man made, have taken control of the House and Senate. \nStymied by Congress, the president frequently used his executive power to craft measures like new fuel efficiency standards for cars and trucks and improvements to the federal government’s own buildings and vehicle fleets. \nBut the Environmental Protection Agency’s (EPA) forthcoming clean power rule is the cornerstone of the president’s climate agenda. \nThe rule will put in place the first-ever caps on carbon emissions from power plants, an effort to force companies to use cleaner sources of energy. \nIts impact is huge: power plants account for 40 percent of the United States’ carbon emissions, the most of any sector of the economy. \n\"Power plants are the single biggest source of harmful carbon pollution that contributes to climate change,\" Obama said. \"But until now, there have been no federal limits to the amount of that pollution those plants can dump into the air. Think about that.\" \nThe rules would seek to cut the power sector’s carbon output by 30 percent by 2030. And McDonough said Wednesday the rule “will be stronger in many ways than the proposed rule put forward by EPA.” \nEnvironmentalists call it the biggest step any president has taken to tackle climate change. \n“It’s going to be remembered for a very long time,” added Carol Browner, who served as President Clinton’s EPA administrator and later as Obama’s climate czar. “We are going to feel the positive impacts of this rule for a very long time to come.” \nBut to conservatives, the climate rules cement a different kind of legacy for Obama. \n“If this ends up shuttering a lot of coal-fired power plants and comes under questionable legality, I see it as something that reduces the quality of life for Americans, that poses a threat to the economy and could pose a threat to the reliability of the national power grid, as well as constitutional separation of powers,” said Nick Loris, a fellow at the Heritage Foundation. \nRepublicans are pledging to fight the rule tooth and nail, in Congress and the courts. \nSenate Majority Leader Mitch McConnell (R), whose home state of Kentucky is a major coal producer, is urging states not to comply with the new mandate. \nThe Obama administration has threatened to veto any legislation that guts its climate regulations. \n“When it comes to clean power plant, let me say this: we will not back down,” McDonough said. “We will veto ideological riders to stop this plan or undercut our bedrock environmental laws. And we will move forward on behalf of the American people with the vision set forward by the president.” \nLacking the votes to override a presidential veto, the GOP is most likely to succeed in battling the rule through the courts, where both sides have won recent victories in cases related to Obama climate regulations. \nObama administration officials and their allies anticipate a tough fight, but are confident the rule will withstand both threats. \n“The final rollout of the Clean Power Plan will have polluters throwing everything they can at the EPA and the White House, because they know the deck is stacked against them legally,” said Joanne Spalding, an attorney with the Sierra Club. \nThe White House is expected to mount a vigorous public defense of the rule. \n“We’re going to be on offense on this,” said Dan Utech, an adviser to Obama on energy and climate issues. \nEven if they survive those threats, many Republican presidential candidates have spoken out against the rules and if elected, could take steps to roll them back. \nWisconsin Gov. Scott Walker has gone as far as saying he would strip the EPA of most of its regulatory power. \nBeating back efforts to derail the rule is also critical to the United Nations climate negotiations set to conclude in Paris in December, green groups say. \nEnsuring the EPA rule goes into effect will give the United States its strongest negotiating position going into the talks. It will show for the first time the country is serious about following strict limits on greenhouse gas emissions. \n“The United States is the lynchpin of a serious global effort,” said David Doniger, clean air director for the Natural Resources Defense Council. “If the U.S. is in, you can make it work. And the Clean Power Plan is the lynchpin of a serious U.S. effort.” \nDespite Obama’s second term climate push, not all green activists believe Obama will be remembered fondly when it comes to protecting the environment. \nThe administration has come under fire for allowing Royal Dutch Shell to drill exploratory oil wells in the Arctic. Al Gore, who has previously praised Obama on climate issues, called the plan “insane.” \nGreen groups are closely watching whether Obama allows the Keystone XL oil pipeline to be completed, a project they staunchly oppose. \nThe White House also faces the challenge of raising public awareness of the climate issue, which most Americans do not view as a top priority. \nClimate change ranked second lowest on a list of top concerns in the U.S., with just 42 percent of Americans saying they are very concerned about the issue, according to a recent Pew Research Center poll . Tags: ", "external_links": [], "published": "2015-08-02T13:50:00.000+03:00", "crawled": "2015-08-02T13:50:33.690+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}