{"organizations": [], "uuid": "42cea57cee74065ac7332d6a7cf023d7c4f846e4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c25c1d1400002e002e20da.jpeg?cache=MxJdWpzWqL", "site_section": "http://www.huffingtonpost.com/tag/wall-street/feed", "section_title": "Wall Street on Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-administration-rails-against-gop-bill-to-deregulate-wall-street_55c25b70e4b0f7f0bebb5e56?kvcommref=mostpopular", "country": "US", "title": "Obama Administration Rails Against GOP Bill To Deregulate Wall Street", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Rails Against GOP Bill To Deregulate Wall Street", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T19:35:00.000+03:00", "replies_count": 0, "uuid": "42cea57cee74065ac7332d6a7cf023d7c4f846e4"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/obama-administration-rails-against-gop-bill-to-deregulate-wall-street_55c25b70e4b0f7f0bebb5e56?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Obama Administration Rails Against GOP Bill To Deregulate Wall Street", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Administration Rails Against GOP Bill To Deregulate Wall Street Obama's budget director plants a flag against bank-friendly funding plan. Zach Carter Senior Political Economy Reporter, The Huffington Post Posted: 08/05/2015 04:35 PM EDT | Edited: 9 minutes ago Alex Wong via Getty Images \nWASHINGTON -- The Obama administration on Wednesday came out swinging against a bill that would hold funding for bank regulators hostage by tying it to the rollback of key financial rules and consumer protections. \nWhat's left of their funding, that is. In addition to attaching a grab-bag of bank deregulation to agency budgets, the Republican-backed bill would also make deep cuts to tax evasion enforcement at the Internal Revenue Service, and lock in budget cuts from sequestration at agencies overseeing risky Wall Street trading. The bill would also undermine the Federal Communications Commission's new net neutrality rules. \n\"The inclusion of these provisions threatens to undermine an orderly appropriations process,\" Office of Management and Budget Director Shaun Donovan warned in a letter to Senate Appropriations Chairman Thad Cochran (R-Miss.). \nDonovan's letter reflects this year's more proactive Obama administration response to GOP budgeting, aimed at fighting off ideological riders and deep funding cuts. Last year, Republicans successfully embedded a subsidy for Wall Street derivatives trading into a budget deal the president signed into law. By sending early letters offering detailed objections to GOP plans, the White House hopes to steer final government funding negotiations in a direction more favorable to Democratic priorities, according to an administration official. \nThose priorities include preserving oversight over big banks and risky trading, according to Wednesday's letter. The Republican-backed legislation includes a slate of bank deregulatory policies authored by Senate Banking Committee Chairman Richard Shelby (R-Ala.) that would lift capital requirements and other rules imposed on big banks with up to $500 billion in assets. Bank of New York Mellon, PNC Financial Services and other firms whose operations are measured in 12 digits would be exempt from the too-big-to-fail standards. \n\"We have a number of serious concerns about this legislation, which would underfund ... important investments and includes highly problematic ideological riders,\" Donovan wrote. \nUnder the GOP bill, the Consumer Financial Protection Bureau, whose budget is currently provided by the Federal Reserve rather than Congress, would be subjected to the annual appropriations process, giving Republicans the opportunity to cut the agency's funding. The Fed itself, meanwhile, would face additional hurdles in implementing financial stability rules. \nDonovan's critique provided special attention, however, to IRS cuts, which he said were short-sighted and self-defeating. The GOP bill would slash IRS funding by $470 million compared to the current year, about $2.4 billion below President Barack Obama's proposal. By slashing enforcement funding for agents who pursue tax cheats and collect outstanding debts, the Republican plan would slash tax revenues and deepen the federal budget deficit. Compared to the president's proposal, the GOP plan would miss out on $11 billion in tax receipts in its firsts year alone, according to OMB figures. The Congressional Budget Office has also calculated significant losses from tax collection due to weakened IRS enforcement. \nThe financial services bill is just one of several GOP budgeting bills moving through both chambers of Congress. Republicans themselves have been divided over what to do with the government funding process. In July, GOP leaders pulled a spending bill from the floor after an intraparty meltdown over language to remove the Confederate flag from federal cemeteries. \nAs a result, the White House isn't holding its breath on piecemeal government funding projects. It expects final talks to fund the federal government to be wrapped into a single major bill negotiated between congressional leaders from both parties and the administration. That package, of course, will not be without its own problems. Conservative activists are currently pushing the GOP to attach a rider defunding Planned Parenthood to any final budget bill. Failing to pass a funding bill by the end of September will result in a government shutdown. \nRead the full letter here .", "external_links": [], "published": "2015-08-05T19:35:00.000+03:00", "crawled": "2015-08-06T00:04:38.845+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}