{"organizations": ["Facebook", "Fox News Obama", "Twitter"], "uuid": "435bf8b75d17ff7082edba5b8220fdc8d2e782c8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/0802%20emissions%20cuts.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/08/02/obama-set-to-announce-steeper-emissions-cuts-from-us-power-plants/", "country": "", "title": "Obama set to announce steeper emissions cuts from US power plants | Fox News", "performance_score": 9, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama set to announce steeper emissions cuts from US power plants | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T11:29:00.000+03:00", "replies_count": 0, "uuid": "435bf8b75d17ff7082edba5b8220fdc8d2e782c8"}, "author": "", "url": "http://www.foxnews.com/politics/2015/08/02/obama-set-to-announce-steeper-emissions-cuts-from-us-power-plants/", "ord_in_thread": 0, "title": "Obama set to announce steeper emissions cuts from US power plants | Fox News", "locations": ["US", "Merrimack Station", "Bow", "N.H."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama set to announce steeper emissions cuts from US power plants Published August 02, 2015 Facebook 0 Twitter 0 livefyre Email Print Jan. 20, 2015: A plume of steam billows from the coal-fired Merrimack Station in Bow, N.H. (AP) \nPresident Barack Obama will impose steeper cuts on greenhouse gas emissions from power plants across the country than previously expected, senior administration officials said Sunday, in what the president called the most significant step the U.S. has ever taken to fight global warming. \nThe Obama administration is expected to finalize the rule at a White House event on Monday, a year after proposing unprecedented carbon dioxide limits. Obama, in a video posted on Facebook, said the limits were backed up by decades of data and facts showing that without tough action, the world will face more extreme weather and escalating health problems like asthma. \n\"Climate change is not a problem for another generation,\" Obama said. \"Not anymore.\" \nInitially, Obama had mandated a 30 percent nationwide cut in carbon dioxide emission by 2030, compared to 2005 levels. The final version, which follows extensive consultations with environmental groups and the energy industry, will require a 32 percent cut instead, according to White House officials. \nOpponents said they would sue the government immediately. The also planned to ask the courts to put the rule on hold while legal challenges play out. \nThe steeper version also gives states an additional two years to comply, officials said, yielding to complaints that the original deadline was too soon. The new deadline is set for 2022. States will also have until 2018 instead of 2017 to submit their plans for how they intend to meet their targets. \nThe focus on renewables marks a significant shift from the earlier proposal that sought to accelerate the ongoing shift from coal-fired power to natural gas, which emits less carbon dioxide. The final version aims to keep the share of natural gas in the nation’s power mix the same as it is now. \nThe stricter limits included the final plan were certain to incense energy industry advocates who had already balked at the more lenient limits in the proposed plan. However, the Obama administration said its tweaks would cut energy costs and address concerns about power grid reliability. \nThe Obama administration previously predicted emissions limits will cost up to $8.8 billion annually by 2030, though it says those costs will be far outweighed by health savings from fewer asthma attacks and other benefits. The actual price is unknown until states decide how they’ll reach their targets, but the administration has projected the rule would raise electricity prices about 4.9 percent by 2020 and prompt coal-fired power plants to close. \nIn the works for years, the power plant rule forms the cornerstone of Obama's plan to curb U.S. emissions and keep global temperatures from climbing, and its success is pivotal to the legacy Obama hopes to leave on climate change. Never before has the U.S. sought to restrict carbon dioxide from existing power plants. \nBy clamping down on power plant emissions, Obama is also working to increase his leverage and credibility with other nations whose commitments he's seeking for a global climate treaty to be finalized later this year in Paris. As its contribution to that treaty, the U.S. has pledged to cut overall emissions 26 percent to 28 percent by 2025, compared to 2005. Other major polluting nations have also stepped up including China, which pledged to halt its growth in emissions by 2030 despite an economy that's still growing. \nPower plants account for at least one-third of all emissions of carbon dioxide and other heat-trapping gases blamed for global warming in the U.S. Obama’s rule assigns customized targets for each state, then leaves it up to the state to determine how to meet their targets. \nMore than a dozen states have already made plans to fight the rule, even before it was revealed. Senate Majority Leader Mitch McConnell of Kentucky has urged some Republican governors to refuse to comply, setting up a confrontation with the EPA, which by law can force its own plan on states that fail to submit implementation plans. \nYet in those states, power companies and local utilities have started preparing to meet those targets. New, more efficient plants are replacing older ones have already pushed emissions down nearly 13 percent since 2005. \nIn Congress, lawmakers have sought to use legislation to stop Obama's regulation, and McConnell has tried previously to use an obscure, rarely successful maneuver under the Congressional Review Act to allow Congress to vote it down. \nThe more serious threat to Obama's rule will likely come in the courts. The Electric Reliability Coordinating Council, which represents energy companies, said 20 to 30 states were poised to join with industry in suing over the rule. \nThe Obama administration has a mixed track record in fending off legal challenges to its climate rules. Earlier this year, a federal appeals court ruled against 15 states and a coal company that tried to block the power plant rule before it was finalized. The Supreme Court has also affirmed Obama's authority to regulate pollution crossing state lines and to use the decades-old Clean Air Act to reduce greenhouse gases — the legal underpinning for the power plant rule. \nBut the high court in June ruled against his mercury emissions limits, arguing the EPA failed to properly account for costs. Federal courts have also forced Obama to redo other clean air standards that industry groups complained were too onerous. \nWith the end of Obama's presidency drawing nearer, his climate efforts have become increasingly entangled in the next presidential election. The power plant rule won't go into effect until long after Obama leaves office, putting its implementation in the hands of his successor. Among other Republican critics, 2016 candidate and Wisconsin Gov. Scott Walker has said he would drastically scale down the EPA if elected and shift most of its duties to state regulators. \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-08-02T11:29:00.000+03:00", "crawled": "2015-08-02T11:30:10.400+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}