{"organizations": ["Facebook", "Fox News Marijuana", "Twitter"], "uuid": "08d5b1038d5fc096ab996e2499ccb5eb1125d9d6", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/MARIJUANA830.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2015/08/30/marijuana-bars-budtender-growing-trend-at-weddings/", "country": "", "title": "Marijuana bars, budtender growing trend at weddings | Fox News", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "Marijuana bars, budtender growing trend at weddings | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T18:20:00.000+03:00", "replies_count": 0, "uuid": "08d5b1038d5fc096ab996e2499ccb5eb1125d9d6"}, "author": "", "url": "http://www.foxnews.com/us/2015/08/30/marijuana-bars-budtender-growing-trend-at-weddings/", "ord_in_thread": 0, "title": "Marijuana bars, budtender growing trend at weddings | Fox News", "locations": ["Minn", "Minnesota", "Cottage Grove"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marijuana bars, budtender growing trend at weddings Published August 30, 2015 Facebook 0 Twitter 0 livefyre Email Print In this June 17, 2015 photo, marijuana plants grow at LifeLine Labs in Cottage Grove, Minn. The state is starting to move towards a decision that could drastically alter the landscape of Minnesota's new medical marijuana program: Should it allow people suffering intractable pain to buy medical marijuana? (AP Photo/Jim Mone) \nThese newlyweds are going to pot. \nJohn Elledge and Whitney Alexander’s wedding earlier this month in Oregon featured a smoke tent – complete with 13 different strains of marijuana that guests could sample with the help of a budtender. \nThe groom, who works as a professional marijuana grower in California, said guests at the August 8 nuptials were thrilled by the couple’s version of an “open bar,” according to a Tribune Media report . \n“The oldest person in the tent was an 81-year-old woman who hadn’t smoked weed since the ‘60s. She loved it,” said Elledge. \nElledge and Alexander are part of a growing trend that replaces a toast with a toke. \nAccording to The New York Times, the recent Colorado wedding of Lauren Meisels and Bradley Melshenker included gift bags for guests that included a pre-rolled joint, a lighter and cannabis-infused lip balm. \n“The oldest person in the tent was an 81-year-old woman . . .\" \n- John Elledge \nMarijuana buds and leaves adorned table centerpieces, the bride’s bouquet and the groom’s boutonniere, the paper reported. \nAt Get High Getaways, a bed and breakfast in Denver, smoking pot is “not only permitted but encouraged,” Dale Dyke, who runs the place with his wife, Chastity Osborn, told The New York Times. \nOregon and Colorado are two of four states (the others are Washington state and Alaska) that allow recreational pot use, with 20 states allowing its use for medical purposes. \nStill, not everyone is high on the idea. Penni Ervin, a wedding planner in Crested Butte, Colo., told The Times she was upset when asked about working on weddings that included a marijuana theme. “We’re talking about highly professional people, and I just don’t see CEOs getting stoned,” she said. “It’s a family event with grandma and grandpa,” adding, “and you don’t want them to get shocked.” ", "external_links": [], "published": "2015-08-30T18:20:00.000+03:00", "crawled": "2015-08-30T18:20:07.064+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}