{"organizations": [], "uuid": "92c85a62c9bab4c1824a7c34eab760a12c28d221", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/08/01/EM02195272/3656375/noattachmentgif-3656375_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1261309", "country": "", "title": "Kenya-a hub for regional Peace and Security-Obama tells the World - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Kenya-a hub for regional Peace and Security-Obama tells the World - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "92c85a62c9bab4c1824a7c34eab760a12c28d221"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1261309", "ord_in_thread": 0, "title": "Kenya-a hub for regional Peace and Security-Obama tells the World - CNN iReport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Security-Obama"], "text": "\nCNN PRODUCER NOTE \nKenya-a hub for regional Peace and Security-Obama tells the World Kenya “is on the move”, President Obama told the world when he visited Kenya in July 2015-the country of his father’s birth. While speaking in Nairobi Kenya when he visited Kenya for the Global Entrepreneurship Summit (GES), President Obama made it clear to the whole World that peace and security in Kenya will only come from a coherent, corruption free and entrepreneurship mentality and not war and killing innocent people. President Obama reawakened Kenya’s hope to becoming a regional hub to peace and security. This message came at a time when Kenya was viewed by the Western media as a “hotbed of terror” where terrorists dine and wine with ordinary citizen. The western media portrays Kenya as a breeding hub for violent extremists. The coming of Obama who slept and woke up in the Kenya soil should only be interpreted as “western’s worldview” towards Africa. Many believe that Africa is a dark world, cursed by God and destined to perish. This is far from the truth. The Obama’s speeches that were televised live by all major media houses in the World will postulates hope to bring about good tidings in Kenya. Truth be told: Terrorism is a global war and not localized in Kenya. The entire world has been bedeviled by violent extremists and Africa isn’t an exemption. Indeed, the principle driver of his visit to Kenya was to increase security partnership in a region, though threatened by terrorism, has a massive resilience towards the same. The world should know that Africa is the future of the World peace and security irrespective of any challenges experienced today. President Obama indeed reignited Kenyan’s enchanted efforts to fighting and countering violent extremists. He actually promised to strength our surveillance and humanitarian systems so as Kenya can combat terrorism. Obama poured praises to Kenya for picking up the broken pieces of post election violence and building a cohesive bond. Speaking in Nairobi ata a joint conference with Kenyan President Uhuru Kenyatta, Obama reiterated that there has been extensive counterterrorism coordination between the United States of America (USA) and our country Kenya, primarily when dealing with al-shabab in the region. Obama poured praises to Kenyans because of their resiliencies. He said in part, “Kenya has systematically reduced the territory that al-shabab controls, and have also been able to decrease their effective controls within Somalia and consequently weakened their networks operating in Africa”. He however warned that the problem isn’t solved and aruta continua! TAGS: ", "external_links": [], "published": "2015-08-01T03:00:00.000+03:00", "crawled": "2015-08-02T02:37:51.713+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}