{"organizations": ["Senate Judiciary Committee", "Republican", "Post", "Washington Post"], "uuid": "17ab5032d1abe1b6ae131c83be904611c2ca1b7b", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150811084058-donald-trump-debate-file-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/08/14/politics/donald-trump-immigration-tax-policy-papers/index.html?eref=rss_politics", "country": "US", "title": "Trump says he'll release details on immigration, tax code plans", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Trump says he'll release details on immigration, tax code plans", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T03:34:00.000+03:00", "replies_count": 0, "uuid": "17ab5032d1abe1b6ae131c83be904611c2ca1b7b"}, "author": "", "url": "http://edition.cnn.com/2015/08/14/politics/donald-trump-immigration-tax-policy-papers/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Trump says he'll release details on immigration, tax code plans", "locations": ["New Hampshire", "Mexico", "U.S.", "Washington", "Kentucky", "Hampton", "Alabama"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul", "Donald Trump", "Trump", "Obama", "Jeff Sessions"], "text": "Trump: 'Rand Paul is using people of Kentucky' 02:56 Story highlights Trump said he has \"some of the most brilliant people in the country working on tax\" Trump also said he has some \"amazing people\" working on immigration Washington (CNN) Donald Trump said Friday he will release more detailed policy proposals on immigration and reforming the U.S. tax code next month. Trump told reporters in Hampton, New Hampshire, that he has \"some of the most brilliant people in the country working on tax, which I'm involved in very much because I understand the system very well. Probably better than anybody that's ever run for office, if you want to know the truth, because I am part of the system.\" As for immigration, Trump also said he has some \"amazing people\" working on the issue, and that he would release the proposals over the next two or three weeks. \"Probably some time over September,\" he said. The Washington Post first reported Friday that Trump was planning on releasing details of the plans ahead of the next Republican debate on Sept. 16, including his oft-repeated pledge to build a wall between the U.S. and Mexico. \"If you look back, everybody, most of the Democrats, they desperately wanted the wall built. They liked the concept of a wall,\" Trump told the Post. \"But they couldn't get it built. You know one of the reasons they couldn't build it? The environmental impact statements. They couldn't get through because of the environment. Well, that's what I'm the king of -- I can get things built for half-cost, for one-fourth cost, and it'll be better.\" Trump said he collaborated with Alabama Sen. Jeff Sessions on the immigration policy paper. Sessions, chairman of the Senate Judiciary Committee's subcommittee on immigration, is popular with tea party conservatives for his hard stances on securing the U.S.-Mexico border. \"I like him,\" Trump said of Sessions. \"Tough guy. I like that. We have a similar thought process.\" Trump's tax policy will focus on keeping companies from fleeing the U.S. to do business because of high tax rates and penalties, the Post reported. \"There is $2.5 trillion of money outside the country that they want to bring back but they don't want to pay a 35% tax. You wouldn't do it. So, they go out to get it and move the company out,\" he said. \"Inversion is a huge subject and Obama has done nothing about it. Republicans and Democrats can't get it done.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-08-15T03:34:00.000+03:00", "crawled": "2015-08-15T04:08:07.084+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}