{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "e2c2c3056a3d48699ca17a2b5210513063ef9220", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/070214/0/0/070214_SR_Immigration_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2014/07/08/immigration-crisis-playing-chicken-with-childrens-lives.html", "country": "", "title": "Immigration crisis: Playing chicken with children’s lives | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration crisis: Playing chicken with children’s lives | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "e2c2c3056a3d48699ca17a2b5210513063ef9220"}, "author": "", "url": "http://www.foxnews.com/opinion/2014/07/08/immigration-crisis-playing-chicken-with-childrens-lives.html", "ord_in_thread": 0, "title": "Immigration crisis: Playing chicken with children’s lives | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nToday we face a moral and political crisis on our borders, where the well-being and even the lives of innocent children are endangered, along with the principles of national sovereignty and public order. \nWhat we need is a truly comprehensive immigration reform, one that answers this national challenge at every level: political, moral, economic, and psychological. \nResponses across the political spectrum have been at best bumbling, and at worst profoundly cynical. Unless citizens of principle step up with real solutions that recognize human dignity while insisting on the right of Americans to set their own democratically chosen laws, we will see this crisis transform into a catastrophe -- both for the children caught up in the backwash immigration policy, and for our great country. \nWhat we need is a truly comprehensive immigration reform, one that answers this national challenge at every level: political, moral, economic, and psychological. \nThere are many layers to the border crisis, as there in every human situation. The worst regimes of the hundred bloody years since August 1914 were those that embraced the lie that just one layer matters, or is even finally real. \nMillions of human beings were exterminated by governments that claimed that only race, or only economic class, grants a person his human dignity. Around the world today, millions are menaced by radical theocrats who only grant respect to people who share their religion. \nResponses to the current crisis of unaccompanied minor children being dumped at the U.S. borders by their parents have been likewise cruelly selective. \nMany on the left have focused narrowly on the fact that these children are innocent and in need -- which they surely are. \nOn the right, some fixate on the fact that these children are being used as pawns to break our country’s laws -- which is also true. \nPartisans of an immigration amnesty point to these most sympathetic of illegal aliens as near-perfect icons of a system they consider tragically broken -- which it is. Opponents answer that foreign parents have foisted this crisis upon us, which open-borders activists are crassly using to blackmail good-hearted Americans into rushing to grant an unconditional amnesty—as they are. \nThe situation is so monstrous and manipulative that it has spawned conspiracy theories, suggestions that the Obama administration colluded with Mexico to organize this influx, in a kind of \"Wag the Dog\" operation, to force the hand of Congress before the next elections flood its halls with more conservatives. Like most conspiracy theories, that sounds a little too neat to be true. \nWhat is true is that thousands of helpless immigrant children now haunt emergency shelters throughout the American Southwest -- having been lured here by rumors of an imminent amnesty. And their presence is being used to promote just such an amnesty. \nThat goes far to proving the point of many amnesty opponents: That without a firm lockdown of the U.S. border, any path to citizenship that is granted to current resident illegal immigrants will serve as a powerful magnet to millions more. \nIn other words, there is nothing “one-time” about the amnesty proposals currently stalled in Congress; as our borders currently stand, with our lax laws that let employers get away with exploiting illegal workers, with our broken system for identifying people who overstay visas, any amnesty we passed would in fact amount to welcome mat for millions more immigrants who wished to enter America. \nMillions of newly legalized workers, now protected by workplace laws and entitled to health insurance, would be promptly replaced by millions more illegal immigrants, who hoped for another amnesty down the road. \nSuch an outcome would suit the most callous of Americans: those who profit from the status quo, who prefer that millions of immigrants remain in the shadow economy, where their labor can be extracted without the protection of workplace safety laws -- and their illnesses can be treated in public emergency rooms, at taxpayers’ expense. \nReplacing today’s illegal aliens with tomorrow’s would equally harm millions of already beleaguered American workers, whose opportunities have shriveled as our employers outsourced every low-skill job that wasn’t nailed down. \nThe already hard-pressed middle class would be faced with the additional costs of millions more poor, less-educated immigrants whose children would require bilingual programs in public schools. And America’s laws and sovereignty would take yet another hit, as demands mounted for yet another “path to citizenship.” The sad story writes itself. \nThere is a better way. We must answer the current crisis with sincere efforts at humanitarian help, and a firm commitment to return these children to their native countries and their families. \nOnly an absolute certainty that a hazardous journey to America would be completely futile will turn off the magnet that is drawing parents to abandon their children across our border. \nIf we do anything less, we are essentially offering free advertising to the ruthless coyotes (human traffickers) who promise parents that they will safely deliver their children on U.S. soil -- but in fact, put their lives in danger. \nThe long-term dysfunction of America’s immigration system does need to be fixed. Everyone knows that the U.S. will never deport 11 million people. Even the angriest conservative in the most hard-pressed border state accepts this fact. \nNor will the grim tactic of encouraging “self-deportation” favored by Mitt Romney solve this problem; promising to make the lives illegal immigrants even uglier and more unpleasant in the hope that they will leave is not just morally dubious. It is politically suicidal. \nAmericans want to be welcoming, and millions of us have friends who came here illegally, whom they do not wish to harass through punitive laws. \nWhat we need is a truly comprehensive immigration reform, one that answers this national challenge at every level: political, moral, economic, and psychological. \nWe must start by securing our borders, completing a border fence with Mexico that also walls off dangerous stretches of land, preventing would-be migrants from dying in the desert. \nWe must make mandatory the system of E-Verify, which allows employers to check in just a few minutes whether an applicant lives here legally and has the right to work. \nAnd we must implement an effective system for locating people who overstay their visas. \nThen, and only then, we should implement a pathway to citizenship for otherwise law-abiding illegal immigrants. \nTo do so any sooner invites an endless series of dangerous trips through the desert for millions more would-be immigrants, and leaves our country’s sovereignty prone in the dust, like a mud-covered welcome mat. \nJason Scott Jones and John Zmirak are co-authors of the upcoming book \" The Race to Save Our Century \" (Crossroad, August 2014). ", "external_links": [], "published": "2015-08-13T03:00:00.000+03:00", "crawled": "2015-08-14T04:14:59.899+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}