{"organizations": [], "uuid": "93794d7e51b2e2a4776bdbc716123c020f1bce38", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55dbed5a1400002e002e3e18.jpeg", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/entry/washington-colorado-marijuana-taxes_55d6133be4b07addcb45e65d?kvcommref=mostpopular", "country": "US", "title": "Pioneer Pot States Have Collected More Than $200 Million In Marijuana Taxes", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Pioneer Pot States Have Collected More Than $200 Million In Marijuana Taxes", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T20:32:00.000+03:00", "replies_count": 0, "uuid": "93794d7e51b2e2a4776bdbc716123c020f1bce38"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/washington-colorado-marijuana-taxes_55d6133be4b07addcb45e65d?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Pioneer Pot States Have Collected More Than $200 Million In Marijuana Taxes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pioneer Pot States Have Collected More Than $200 Million In Marijuana Taxes \"It turns out government can be pretty good at this.\" Matt Ferner National Reporter, The Huffington Post Posted: 08/26/2015 05:32 PM EDT | Edited: 4 hours ago Craig F. Walker via Getty Images \nThe first two states to legalize recreational marijuana have collectively raked in at least $200 million in marijuana tax revenue, according to the latest tax data -- and they're putting those dollars to good use. \nIn Colorado, after about a year and a half of legal recreational marijuana sales, the state has collected more than $117 million in excise taxes from both the recreational and medical marijuana markets, according to the most recent data from the Colorado Department of Revenue. \nWashington state got a slower start. Its retail shops didn't begin selling recreational marijuana until July of last year, but they are keeping pace with Colorado's. About $83 million in excise taxes have already been collected in the year since sales first began, according to the most recent tax data from the Washington State Liquor and Cannabis Board. \nAnd the total haul for both states is several million higher if all additional revenue from marijuana -- such as sales taxes, jurisdictional taxes, fees and licensing costs -- is included. \nThat marijuana revenue is, of course, just a drop in the bucket of the states' respective multi-billion dollar annual budgets, but it's real revenue nonetheless, revenue that helps pay for the very regulation that supports the legal marijuana market. \n\"Our philosophy has been that marijuana pays its own way,\" J. Skyler McKinley, deputy director of Colorado Gov. John Hickenlooper's (D) Office of Marijuana Coordination, told the Huffington Post. \"Every dime we bring in from legalization is dedicated to the cost of legalization. That's regulatory framework first, then public education campaigns about safe and responsible use and then prevention and treatment programs.\" \nBut the tax revenue from legal marijuana won't solve a state's budget problems all by itself, he added. \n\"The big lesson we tell other states is you probably shouldn't legalize marijuana if you want to make money -- that's not why you do it,\" McKinley said. \"You do it because you think that a regulated marketplace might be safer than an unregulated marketplace or you believe that the war on drugs didn't work.\" \nJaime Smith, deputy communications director for Washington Gov. Jay Inslee (D), echoed those sentiments. \n\"The legalization initiative was not driven by a desire for a revenue, but it has provided a small assist for our state budget,\" Smith said. \"When you’re looking for billions of dollars, tens of millions doesn’t solve the problem but it certainly doesn’t hurt.\" \nThose taxes and fees don't just support the regulation of marijuana: both states have flagged some of the revenue for public schools and expansive research. \nIn Colorado, a significant portion of marijuana tax revenue is designated for public schools in the state. For the 2014-2015 fiscal year, $23.9 million has been generated for the Building Excellent Schools Today (BEST) grant program, said Kevin Huber, regional program manager for the office of capital construction in the state's Education Department. \nIn addition to marijuana excise taxes, additional funding for BEST is provided from state lottery spillover proceeds and interest, as well as the state land trust -- all of which is put into a single fund and dispersed via grants to needy districts and schools. This year was the first time the state utilized the marijuana tax revenue as part of the total grants, which were awarded starting in May. \nColorado also funded about $8 million in marijuana research using revenue generated from various marijuana fees, putting it towards eight different studies investigating the medical promise of cannabis. \nIn Washington, a portion of the state's collected marijuana taxes and fees also goes to schools, via the state's general fund, but some of the most novel allocation of those dollars is toward research into the short- and long-term effects of the state's reformed marijuana policy, with multiple state agencies participating in that research. \nOne of the most ambitious research projects is from the state's own public policy research arm -- the Washington State Institute for Public Policy (WSIPP) -- which is conducting a broad cost-benefit analysis of the legalization of recreational marijuana. \nThe preliminary report from WSIPP will be released Sept. 1, Adam Darnell, senior research associate and the lead researcher on the report, told HuffPost. This first report will be limited, largely detailing the overall research plan for the full study with some information on how implementation of the law, the marijuana supply system, licensing and sales have progressed so far in the state. \nBecause Washington state's program was slower to come online than Colorado's, there's a delay in data sources, Darnell said. \"Some of these effects, to actually resolve at the population level, take a little time to unfold,\" he said. \nBut the full scope of the project is exceedingly comprehensive. Reports are due Sept. 1 in 2017, 2022 and 2032, examining the effects of legalization on public health, safety, youth use, criminal justice, jobs creation, revenue and much more. It's a research goal so impressively lengthy and broad that the Brookings Institute called it \"nearly unprecedented.\" \nColorado was the first state in the nation and the first government in the world to establish a regulated marijuana marketplace -- a profound shift in drug policy, to be sure, one that some lawmakers and law enforcers in the state thought would not roll out as successfully as it has . Along with Washington state, Oregon, Alaska and Washington, D.C., now also have legalized recreational marijuana (D.C. continues to ban sales). Still, it remains illegal under federal law. \nNow more than a year after sales first began in Colorado and Washington, perhaps the most profound shift of all is the normalcy in which marijuana policy, and the revenue it generates, is seen by state government. \nMcKinley said that Colorado officials look at marijuana the same way they look at any other commodity market in Colorado -- just another place where the state gets some revenue, but doesn't stake its whole budget on it. \n\"This was a lot less vexing than we once thought it would be,\" McKinley said, repeating what his boss said about regulating the drug earlier this year . \"It turns out government can be pretty good at this.\"  27 Reasons Why The U.S. Shouldn't Lead The War On Drugs of", "external_links": [], "published": "2015-08-26T20:32:00.000+03:00", "crawled": "2015-08-27T05:34:33.076+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}