{"organizations": [], "uuid": "6df81e88d36342095d4d727975c9ae5944fb527e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55bbc2b217000026005663c1.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/mike-huckabee-troops-abortion_55bbc20ee4b06363d5a22323", "country": "", "title": "Mike Huckabee Won't Rule Out Using Federal Troops To Stop Abortions", "performance_score": 10, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Mike Huckabee Won't Rule Out Using Federal Troops To Stop Abortions", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T01:41:00.000+03:00", "replies_count": 0, "uuid": "6df81e88d36342095d4d727975c9ae5944fb527e"}, "author": "", "url": "http://www.huffingtonpost.com/entry/mike-huckabee-troops-abortion_55bbc20ee4b06363d5a22323", "ord_in_thread": 0, "title": "Mike Huckabee Won't Rule Out Using Federal Troops To Stop Abortions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Huckabee", "Amanda Terkel"], "text": "Mike Huckabee Won't Rule Out Using Federal Troops To Stop Abortions \"I will not pretend there is nothing we can do to stop this.\" Amanda Terkel Senior Political Reporter, The Huffington Post Posted: 07/31/2015 03:01 PM EDT | Edited: 2 hours ago ASSOCIATED PRESS \nGOP presidential candidate Mike Huckabee is open to the idea of using federal troops and the FBI to stop women from having abortions. \n\"I will not pretend there is nothing we can do to stop this ,\" Huckabee, the former governor of Arkansas and an outspoken social conservative, said Thursday at a campaign stop in Jefferson, Iowa. \nHuckabee addressed abortion again at his next stop in Rockwell City, Iowa, where a reporter asked him whether stopping abortion would mean using federal troops or the FBI. \n\"We'll see if I get to be president,\" Huckabee said, according to the Topeka Capital-Journal. \n\"All American citizens should be protected,\" he added. \nOn Twitter, journalist Matt Taibbi said he had asked Huckabee the abortion question. Iowa, I just asked Huckabee if that meant he would send the FBI or the National Guard to close down abortion clinics. He said: — Matt Taibbi (@mtaibbi) July 30, 2015 \"We'll see when I'm president.\" — Matt Taibbi (@mtaibbi) July 30, 2015 \nThe Huckabee campaign did not immediately return a request for more comment on what deploying troops or using the FBI to stop women from having abortions would look like. \nHuckabee has long spoken out against abortion, and last year, he suggested that the issue was worse than the Holocaust . \n\"If you felt something incredibly powerful at Auschwitz and Birkenau over the 11 million killed worldwide and the 1.5 million killed on those grounds, cannot we feel something extraordinary about 55 million murdered in our own country in the wombs of their mothers?\" he asked. \nThis piece was updated with Taibbi's tweets. Want more updates from Amanda? Sign up for her newsletter, Piping Hot Truth. \nEnter your email address: ", "external_links": [], "published": "2015-08-01T01:41:00.000+03:00", "crawled": "2015-08-01T01:41:17.485+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}