{"organizations": [], "uuid": "0f1e3af995f4b19508b056676143d1647cde88d4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamadinner_080415getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/250266-obama-celebrates-birthday-at-roses-luxury", "country": "US", "title": "Obama celebrates birthday at Rose's Luxury", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama celebrates birthday at Rose's Luxury", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:01:00.000+03:00", "replies_count": 0, "uuid": "0f1e3af995f4b19508b056676143d1647cde88d4"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/250266-obama-celebrates-birthday-at-roses-luxury", "ord_in_thread": 0, "title": "Obama celebrates birthday at Rose's Luxury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama celebrates birthday at Rose's Luxury By Jordan Fabian - 08/04/15 08:01 PM EDT President Obama celebrated his birthday Tuesday at Rose’s Luxury, one of Washington, D.C.'s hottest restaurants. Guests routinely wait in long lines to snag a table at the small-plates eatery, which does not take reservations. But the president and his guests reportedly skipped the line on their way in. ADVERTISEMENT Joining Obama to celebrate his 54th birthday are first lady Michelle Obama, who was spotted wearing a knee-length black and white dress, his half-sister Maya Soetoro-Ng and her husband Konrad, his niece Leslie Robinson and senior adviser Valerie Jarrett. There’s no word yet on what the president ordered. But Rose’s Luxury, which was named best new restaurant in America last year by Bon Appetit magazine, is known for its pork and litchi salad. The first lady dined at the restaurant in February , when she was also able to snag a table without waiting in line. Obama kicked off his birthday celebration last weekend with a round of golf and a weekend at Camp David with old friends. The Obamas plan to leave on Friday for their annual vacation at Martha’s Vineyard, Mass. Tags: Past: 1 day Bush drops 40 pounds on Paleo diet Bush talked about his weight loss in an interview at an Iowa Dairy Queen. Trump: Harvard students '... Trump fell victim to an elaborate prank by a group of Harvard students. Juan Williams: GOP's anger turns... OPINION | Republicans who feed the resentments of the base imperil GOP... Trump widens lead in new poll The billionaire businessman leads Jeb Bush 26 percent to 12 percent. Rand Paul attributes Trump's rise... \"We're going to come back to our senses and look for someone serious,\"... Trump builds his political machine He is taking aggressive steps in Iowa and New Hampshire. Kasich makes quick rise in polls Ohio Gov. John Kasich entered the GOP race late but has already made... Sanders disagrees with Clinton on... Sanders said he was surprised by Clinton's reluctance to state a position... Senate GOP thwarted in effort to... Two Democrats voted to move forward with the bill, which stalled in a 53-... GOP field gets ready to rumble The top 10 candidates are preparing to face off in the long-awaited Fox... Sanders: 'No question' I can beat... The longshot presidential candidate said he is forcing Hillary to \"respond... Trump sees double-digit surge in... Trump leads the GOP field in a new Wall Street Journal/NBC News poll. Signs of division in the GOP on... Some Republicans are questioning the strategy of using budget... Harvard Lampoon tricks Trump with... A fake endorsement called Trump \"the most formidable and competitive\" GOP... Cruz cooks bacon with a machine gun The presidential candidate shows off the method in a new video. Gawker publishes Trump phone number “Mr. Trump has several numbers so this is not an issue,” a campaign source... Jindal cuts off state Medicaid... The presidential candidate cited the recent controversial videos. Carson: Black Lives Matter... Carson also discussed illegal immigration in an NBC interview. Dem senator backs defunding... Manchin is the first Senate Democrat to back the legislation. Trump: GOP challengers 'viciously... \"They attacked me first and I hit them back,\" he said Sunday. Iran denies link between... A website alleged that Javad Zarif’s son was the best man at Vanessa Kerry... Poll: ObamaCare enrollees less... Cost is the most common problem cited by people who are enrolled.", "external_links": [], "published": "2015-08-05T03:01:00.000+03:00", "crawled": "2015-08-05T03:11:10.931+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}