{"organizations": ["Fox News Planned Parenthood", "Facebook", "Director of Research for Planned Parenthood Gulf Coast", "Twitter"], "uuid": "13007c307a946a8450ac95d90b2edd357895f38d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/PP8415.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2015/08/04/planned-parenthood-official-docs-alter-abortion-procedures-price-structure/", "country": "", "title": "Planned Parenthood official: Docs alter abortion procedures, price structure | Fox News", "performance_score": 10, "site": "foxnews.com", "participants_count": 0, "title_full": "Planned Parenthood official: Docs alter abortion procedures, price structure | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T19:15:00.000+03:00", "replies_count": 0, "uuid": "13007c307a946a8450ac95d90b2edd357895f38d"}, "author": "", "url": "http://www.foxnews.com/us/2015/08/04/planned-parenthood-official-docs-alter-abortion-procedures-price-structure/", "ord_in_thread": 0, "title": "Planned Parenthood official: Docs alter abortion procedures, price structure | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Melissa Farrell"], "text": "Planned Parenthood official: Docs alter abortion procedures, price structure Published August 04, 2015 Facebook 0 Twitter 0 livefyre Email Print Melissa Farrell, the Director of Research for Planned Parenthood Gulf Coast, is featured in the latest release by an anti-abortion group. (Center for Medical Progress) \nA Planned Parenthood official admits abortion procedures – and prices - are adjusted to accommodate specific fetal tissue requests, including “intact fetal cadavers,” in the fifth and latest undercover video released Tuesday by a pro-life group targeting the nonprofit. \nIn the nearly 16-minute, edited video released by Center for Medical Progress, a woman identified as Melissa Farrell, director of research for Planned Parenthood Gulf Coast, discusses pricing for specimens - ranging from intact fetuses to tissue and organs - for outside tissue procurement companies. \n“Yeah, and so if we alter our process, and we are able to obtain intact fetal cadavers, then we can make it part of the budget, that any dissections are this, and splitting the specimens into different shipments is this,” Farrell said. “I mean it’s all just a matter of line items.” \n\"If we alter our process, and we are able to obtain intact fetal cadavers, then we can make it part of the budget\" \n- Melissa Farrell, Planned Parenthood official \nAltering abortion procedures to procure fetal tissue, delivering intact fetuses and selling fetal tissue for profit are all against federal law. \nGRAPHIC CONTENT: Click to see latest undercover Planned Parenthood video \nPlanned Parenthood has denied breaking any laws and has said payments discussed in the videos relates to reimbursement costs for procuring the tissue – which is legal. \nHowever, Farrell tells undercover investigators from the Center multiple times that abortion doctors can change a procedure in order to procure intact specimens. \n“And you know, when it matters, you know in the cases of when it’s mattered, you know, physicians also need an intact specimen, they can make it happen,” said Farrell, noting that some of the clinic’s doctors have research projects of their own for which they’re collecting specimens. \n“So they do it in a way that they get the best specimens,” Farrell said. “So I know it can happen.” \nCMP has been the target of two restraining orders by federal judges banning them from releasing some of their recordings. The orders, however, have so far been limited to videos made at meetings of the National Abortion Federation and those dealing with a tissue procurement company, StemExpress. \nTuesday’s release, purely reliant on video taken inside a Planned Parenthood clinic, would not seem to violate either order. \nAt the end of the video, CMP investigators film a segment in what they say is the abortion clinic’s pathological laboratory. Farrell and two unidentified Planned Parenthood workers demonstrate the “quality” of fetal body parts, including intact arms, legs, lungs, intestines and eyeballs. \nThe CMP investigators ask to see any intact specimens, but one of the unidentified female workers begins laughing. \n“We had a really long day and they’re all mixed up together in a bag,” she says. \nThe “Just a Matter of Line Items” video is the fifth release from CMP. Like the first four, it contains undercover video of Planned Parenthood officials and associates. \nThe videos have brought investigations of Planned Parenthood's policies on aborted fetuses by three Republican-led congressional committees and three states. \nThe Senate failed Monday evening to advance a Republican-led measure to halt federal aid to Planned Parenthood. The vote to bring debate on the bill was 53-46, shy of the 60 votes needed to move on. Advertisement ", "external_links": [], "published": "2015-08-04T19:15:00.000+03:00", "crawled": "2015-08-04T19:15:27.922+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}