{"organizations": [], "uuid": "74c24ff69585a7272c9e3e1b4f87e49f368048d7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama1_080315getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/250733-obama-iran-could-get-a-bomb-in-a-matter-of-months-as-deal-expires", "country": "US", "title": "Obama: Iran could get a bomb in a 'matter of months' when deal ends", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Iran could get a bomb in a 'matter of months' when deal ends", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T19:57:00.000+03:00", "replies_count": 0, "uuid": "74c24ff69585a7272c9e3e1b4f87e49f368048d7"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/250733-obama-iran-could-get-a-bomb-in-a-matter-of-months-as-deal-expires", "ord_in_thread": 0, "title": "Obama: Iran could get a bomb in a 'matter of months' when deal ends", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Iran could get a bomb in a 'matter of months' when deal ends Getty Images By Jordan Fabian - 08/10/15 12:57 PM EDT \nPresident Obama defended his landmark nuclear deal with Iran, but conceded the time it takes Tehran to acquire a nuclear weapon would shrink to “a matter of months” as the agreement expires. \nObama sought to push back against critics who argue the deal should be abandoned because it does not permanently cut off Iran’s path to a nuclear weapon. Critics say some of the strictest limits on Iran's nuclear program go away after 15 years. \nAsked by NPR’s Steve Inskeep what Iran’s “breakout time” will be 15 years from now, Obama said “it shrinks back down to roughly where it is now ... which is a matter of months .” But Obama said that was no reason to reject the 15 years of limits on Iran's program under the deal. ADVERTISEMENT Breakout time is the amount of time it would take for Iran to amass enough highly enriched uranium to construct a nuclear weapon.\nUnder the deal, Iran was granted relief from international sanctions in exchange for accepting limits on its nuclear program that extends Tehran’s breakout time to one year. \nThe president was clarifying comments he made on NPR in April, when he said Iran could rush to build a bomb with “near zero” time for other countries to stop it once the toughest restrictions expired. \nIsraeli Prime Minister Benjamin Netanyahu and other critics seized on the comments, and administration spokesmen were forced to do damage control. \nThe president is making an aggressive effort to quell criticism of the deal ahead of a congressional vote, which is expected next month. \nThe president would not tell NPR exactly how long it would take for Iran to acquire a weapon as the deal sunsets, explaining “theoretical breakout times don't match up with practical breakout times.” \n“You don't just get one nuclear weapon,” he said. “You have to, you know, test, weaponize, miniaturize, mount on top of missiles, you know, it's a complicated piece of business.” \nBut he rejected opponents’ arguments that it is a good reason to toss out the agreement, arguing that required inspections will allow the U.S. and its international partners to permanently track Iran’s nuclear activity, making it easier to detect suspicious behavior down the road. \n“We will know when they are doing it in such a way that we can respond,” Obama said. “But this argument that's been made also doesn't make sense. \n\"If in fact the breakout times now are a few months, and we're able to push that breakout time out to a year so that we have more time and space to see whether or not Iran is cheating on an agreement, kicking out inspectors, going for a nuclear weapon; if the breakout time is extended for 15 years and then it goes back to where it is right now, why is that a bad deal?”", "external_links": [], "published": "2015-08-10T19:57:00.000+03:00", "crawled": "2015-08-10T20:55:48.895+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}