{"organizations": [], "uuid": "791aeb910b40e989cce92928a5097e4eae352128", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/082515_fff_2016_640.jpg", "site_section": "http://www.foxnews.com/politics/", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/08/25/obama-poised-to-play-kingmaker-in-joe-hillary-duel/", "country": "US", "title": "Obama poised to play kingmaker in Joe-Hillary duel", "performance_score": 0, "site": "foxnews.com", "participants_count": 14, "title_full": "Obama poised to play kingmaker in Joe-Hillary duel | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 13, "uuid": "8d2999ff4f7c1047465b90a150818d2285b3957b"}, "author": "Chris Stirewalt", "url": "http://www.foxnews.com/politics/2015/08/25/obama-poised-to-play-kingmaker-in-joe-hillary-duel/#post-0", "ord_in_thread": 0, "title": "Obama poised to play kingmaker in Joe-Hillary duel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Chris Stirewalt\nPublished August 25,\n**Want FOX News First in your inbox every day? Sign up here. **\nBuzz Cut:\n• Obama poised to play kingmaker in Joe-Hillary duel\n• Portman pulls ahead, Toomey thumps, Florida a jump ball\n• Hispanic voters harsh on Trump\n• Perilous Perry\n• Trippin’ and rippin’\nOBAMA POISED TO PLAY KINGMAKER IN JOE-HILLARY DUEL\nWhen White House Press Secretary Josh Earnest told Brother Bill Hemmer earlier this month that “the president certainly believes that a spirited contest would be in the best interests of our party, and in the best interest of our country” it was seen as a tacit encouragement to Vice President Joe Biden .\nBut the lines this week sound almost like a solicitation: “I think you could make the case that there is probably no one in American politics today who has a better understanding of exactly what is required to mount a successful national presidential campaign.” Whoa, dude.\nWith Jeff Zeleny reporting that President Obama has “given his blessing” for a Biden run, the crazy summer is poised to get crazier still.\nWhat Obama does with his network and his endorsement remains an open question.\nBut the seeming effort to goad Hillary Clinton by praising Biden as she reaches lower and lower ebbs in her struggling campaign looks like, at the very least, a passive-aggressive swipe against an old rival.\nIf the president is true to his word and stays neutral in such a fight it sets him up as the most powerful man in the party, yet again.\nRemember, the sooner Clinton has the nomination locked up, the sooner Obama becomes a doubly lame duck. But if he can have two candidates auditioning for his support, staying on his left side and, most importantly, not distancing themselves from him it adds new relevancy to an increasingly marginal administration.\nThat’s all upside, even if Hillary wins. If Biden wins, it’s not just a third Obama term in the rhetorical sense. It’s the real thing. We’ve read about his late-night dinner parties pondering his post-election life among the rich and famous. But maybe he aims to play an unlikely kingmaker on his way out the door.\nBiden could take the heat off Obama - “Biden getting in would be the best gift to President Obama and his legacy, because that would mean that he … wouldn’t have to defend Hillary Clinton every week. They could say, ‘You know what? We’re staying out of this. You can call the FBI. Call the campaign. Call Biden. Call Hillary Clinton. We’re focused on the president being the president of the United States.” – Noted smart person Dana Perino on “The Five.”\nPatriarchy, man - WSJ: “[Vice President Joe Biden] is now leaning more toward running than he was earlier in the summer, though he is still weeks from a decision…But following the loss of Beau Biden in May, the elder Biden is concerned about whether his relatives could handle a bid for the presidency and its time demands on the family patriarch. Advisers know that only the vice president can make the judgment about the readiness of his family.”\nFirewall: Hillary cuts deal with state parties - NYT : “Hillary Rodham Clinton’s campaign has gotten commitments from four Democratic state parties, including the one in crucial proving ground of New Hampshire, to enter into joint fundraising agreements to begin raising money now, while the nominating battle is underway. … In addition to New Hampshire, the three other state parties that have already signed agreements with the Clinton campaign are in Virginia, Mississippi and Wisconsin, according to two people briefed on the issue, who weren’t authorized to speak publicly. …. But others expressed reservations about the appearances – and realities – of engaging in such a practice before the party selects a nominee.”\nPORTMAN PULLS AHEAD, TOOMEY THUMPS, FLORIDA A JUMP BALL\nAfter trailing former Democratic Gov. Ted Strickland by 6 points in a June poll from Quinnipiac University, Ohio Republican Sen. Rob Portman is up 3 points this month in his re-election bid. Quinnipiac also surveyed the Senate races in Pennsylvania and Florida. In Pennsylvania, Democratic frontrunner Joe Sestak saw his deficit in the race to unseat Republican incumbent Sen. Pat Toomey nearly double to now stand at 15 points. In Florida’s chaotic contest, with relatively little-known candidates in both parties scrambling for the chance to vie for the seat Sen. Marco Rubio is vacating, it is anyone’s guess. Only one candidate, Rep. Alan Grayson , D-Fla., could muster name identification above 30 percent and voter sentiment toward him was negative by a margin of more than two-to-one. Get full results here .\nWITH YOUR SECOND CUP OF COFFEE…\nIt is true that we are all held together by an invisible thread…well, not a thread exactly, but a force called “dark matter.” Once thought to be a crazy theory, Swiss astronomer Fritz Zwicky , argued the universe was made of something other than atoms, the latest theory in the early-1930s. But Zwicky’s research led him to believe that something out there had to have strong enough gravitational pull to hold all of the universe’s matter together aside from atoms. He called this “dark matter.” The theory was forgotten until the 1970s when astronomers looked at it again after discovering that other galaxies were not spinning the right way. The BBC took a look at dark matter and how its discovery and enduring mysteries shaped our understanding of the universe.\nGot a TIP from the RIGHT or the LEFT ? Email FoxNewsFirst@FOXNEWS.COM\nPOLL CHECK\nReal Clear Politics Averages\nObama Job Approval: Approve – 44.2 percent//Disapprove – 52.0 percent\nDirections of Country: Right Direction – 28.6 percent//Wrong Track – 63.2 percent\nHISPANIC VOTERS HARSH ON TRUMP\nGallup : “U.S. Hispanics are still getting to know most of the Republican contenders for president. At this point in the campaign, less than half have formed an opinion of any Republican candidate except Donald Trump and Jeb Bush . Partly because of this, Hispanics’ views of most GOP candidates range from mildly positive to mildly negative. The sole exception is Trump, whose favorable rating with Hispanics is deeply negative. Gallup began tracking the images of all the major announced candidates for president nightly in early July. Since then, 14% of the roughly 650 Hispanics interviewed have said they view Trump favorably, while 65% have viewed him unfavorably, yielding a net favorable score of -51.”\nOh, baby - Texas Tribune: “Speaking with reporters inside a Mexican restaurant, Bush grew visibly irritated when pressed about the term ‘anchor babies’…He clarified — in English and Spanish — that his original use of the phrase had more to do with ‘organized efforts taking advantage’ of birthright citizenship, not necessarily by Latinos seeking to live in the United States. ‘Frankly, it's more related to Asian people coming into our country,’ Bush said, instantly setting off another round of Democratic outrage.”\n[ Whoa… - Daily Caller : “While it is difficult to get exact numbers on the amount of Chinese coming to deliver birth in the US, it is estimated there were 60,000 of these Chinese anchor babies in 2014.”]\nJeb’s gets vets - Fox News’ Serafin Gomez reports that Jeb Bush is set to receive the endorsements of 75 military veterans. The announcement will be the highlight of Bush’s event today in Colorado and, “The endorsements constitute the largest group of military veteran supporters for any candidate in the 2016 election, according to the Bush campaign.”\nWalker says Obama should cancel Chinese president’s visit - Gov. Scott Walker , R-Wisc., said that President Obama should cancel Chinese President Xi Jinping ’s visit to Washington next month. Walker said in a statement , “Rather than honoring Chinese President Xi Jinping with an official state visit next month, President Obama should focus on holding China accountable over its increasing attempts to undermine U.S. interests.”\n[A top Walker donor, Anthony Scaramucci , met with Donald Trump Monday over Trump’s comments bashing hedge funds, reports WSJ. Scaramucci, the head of SkyBridge Capital, says he’s loyal to Walker and the meeting was only to get Trump to back off.]\nCarson takes on #BlackLivesMatter - Discussing his USA Today op-ed , Ben Carson talks about the #BlackLivesMatter movement. Talking to Fox News’ Megyn Kelly Carson says, “I’ve had many black Democrats come up to me recently and say, you make so much sense. I’m a Democrat but I’m voting for you…Myself and a number of my Republican colleagues are very interested in putting together mechanisms that allow people to climb out of dependency and to become strong parts of the fabric of America.” Watch here.\nKasich’s tricky Wall Street balancing act - With buzzing about Wall Street hitting 2016 the NYT takes a look at John Kasich ’s image strategy. Kasich’s touts his father and grandfather’s working-class background, but the former Lehman Brothers investment banker doesn’t exactly have the same story. Kasich claims he embraces all facets of his background, and isn’t afraid to discuss his lucrative ventures, but what about when rival campaigns start discussing it for him?\n[ Lotts of support - Columbus Dispatch: “Longtime U.S. Senate leader Trent Lott of Mississippi is endorsing Ohio Gov. John Kasich for president.]\nCruz feels the love in S.C. - WashEx’s Byron York went to Rep. Jeff Duncan ’s BBQ in Anderson, S.C. where conservative favorites Ben Carson , Gov. Scott Walker and Sen. Ted Cruz all showed to stand pork shoulder to pork shoulder. All were warmly received, but York says Cruz was the clear favorite.\n[Cruz headlines the Tuscaloosa County Lincoln-Reagan dinner in Alabama.]\nPERILOUS PERRY\nAugust has not been kind to Rick Perry . The former Texas governor’s cash poor campaign, which two weeks ago announced it could not pay staffers, took a severe hit as Perry’s Iowa chairman, prominent conservative and talk radio host Sam Clovis , announced he was abandoning Perry. Trying to brighten darkening clouds, Perry campaign spokesperson Lucy Nashed told Fox News the campaign has started putting some people in Iowa and South Carolina back on the payroll. But lackluster fundraising and low polling numbers have left Perry stuck in the basement – hardly inspirational for new donors. Clovis is reportedly entertaining offers from rival campaigns.\n[The Daily Beast looks at how the PACs backing Perry are keeping the campaign on life support.]\nSOUND OFF: READERS REACT TO 2016 GOP POWER INDEX\n“The fact of the matter is that Trump is far, far ahead of your personal favorite (Jeb) and Jeb is the furthest back of the top 10…and you keep putting him first in your power index. Your little cute game of trying to influence people to vote for Jeb because he’s #1 in your poll will not work.” – Rebecca Walker\n“I would nominate Donald Trump today - even though there are others I really like, for instance Marco Rubio, I feel Donald Trump has the ability to be tough and lead the country in this day of many crises.” – Yolanda Peterson\n“From someone looking to win in 2016, I support a Bush (FL)-Kasich (OH) ticket. Two governors with strong records of achievement in two strategic states; strong organization and fund raising; and who would appeal across the political spectrum to not only Republicans, but to independents and conservative Democrats.” – Mike Walsh\n“I am quite pleased to see Senator Ted Cruz eek his way up to the #2 position and #1 among true Conservatives… I think that Cruz may be one of the only candidates that Donald Trump would be pleased…which would head off a third party candidacy.” – Mark Lenox\nTRIPPIN’ AND RIPPIN’\nThe Guardian : “A 12-year-old Taiwanese boy lived out a slapstick nightmare at the weekend when he tripped at a museum and broke his fall with a painting, smashing a hole in it. Exhibition organisers said the painting was a 350-year-old Paolo Porpora oil on canvas work called Flowers, valued at $1.5m. Footage released by the organisers of the Face of Leonardo: Images of a Genius exhibition in Taipei shows the boy – in shorts, trainers, a blue Puma T-shirt and holding a drink – walk past the still life, catching his foot and stumbling over. He looks up at the canvas, shown later to have a fist-sized gash at the bottom, and freezes, looking around at other people in the room. … [The] exhibition organiser, Sun Chi-hsuan , said the boy was very nervous but should not be blamed and the painting, part of a private collection, was insured.”\n[ Ain’t no party like a manatee party - Reacting to Monday’s kicker about a pile of amorous sea cows, Fox News First reader Karen Morrow offered this: “My husband and I had the same experience one Sunday years ago when we counted 15 manatees by our boathouse dock on the Hillsborough River, 10 minutes from downtown Tampa. They seem to be enjoying themselves!” ]\nChris Stirewalt is digital politics editor for Fox News. Want FOX News First in your inbox every day? Sign up here.\nChris Stirewalt joined Fox News Channel (FNC) in July of 2010 and serves as digital politics editor based in Washington, D.C. Additionally, he authors the daily \"Fox News First” political news note and hosts “Power Play,” a feature video series, on FoxNews.com. Stirewalt makes frequent appearances on the network, including \"The Kelly File,\" \"Special Report with Bret Baier,\" and \"Fox News Sunday with Chris Wallace.” He also provides expert political analysis for Fox News coverage of state, congressional and presidential elections.", "external_links": ["https://www.texastribune.org/2015/08/24/mcallen-bush-faces-immigration-questions/", "http://www.wsj.com/articles/a-top-walker-fundraiser-meets-with-trump-1440450463", "http://www.nationaljournal.com/2016-elections/rick-perry-ted-cruz-fundraising-20150813", "http://www.thedailybeast.com/articles/2015/08/25/super-pacs-have-brought-rick-perry-back-to-life.html", "http://www.nytimes.com/2015/08/25/us/politics/john-kasich-balances-his-blue-collar-roots-and-ties-to-wall-street.html?_r=0", "http://www.washingtonexaminer.com/south-carolina-gop-fest-they-liked-them-all-but-they-loved-ted/article/2570770", "http://www.sun-sentinel.com/local/broward/fort-lauderdale/fl-manatees-fort-lauderdale-beach-0821-20150821-story.html", "http://www.bbc.com/earth/story/20150824-what-is-the-universe-made-of", "http://www.washingtonpost.com/news/post-politics/wp/2015/08/10/rick-perry-stops-paying-his-south-carolina-staff-as-fundraising-dries-up/", "http://www.quinnipiac.edu/news-and-events/quinnipiac-university-poll/2016-presidential-swing-state-polls/release-detail?ReleaseID=2273", "http://www.washingtonpost.com/news/post-politics/wp/2015/08/24/rick-perrys-iowa-chairman-quits-time-to-move-on/", "https://www.scottwalker.com/news/gov-walker-cancel-chinese-presidents-state-visit-us", "http://www.dispatch.com/content/blogs/the-daily-briefing/2015/08/25082015---lott-endorses-kasich.html", "http://www.gallup.com/poll/184814/hispanics-frown-trump-not-rest-gop-field.aspx", "http://www.theguardian.com/world/2015/aug/25/boy-trips-in-museum-and-punches-hole-through-million-dollar-painting", "http://bigstory.ap.org/article/165dd42f0f06411aa1a87fe477d3d9fa/perrys-iowa-chairman-has-left-lagging-campaign", "http://www.washingtonpost.com/politics/family-issues-weigh-heaviest-on-biden-as-he-considers-a-2016-campaign/2015/08/24/3b755870-4aa5-11e5-846d-02792f854297_story.html", "http://www.youtube.com/watch?v=zz_7Q-yxLF4#action=share", "http://www.cnn.com/2015/08/24/politics/joe-biden-obama-blessing-2016/index.html", "http://www.usatoday.com/story/opinion/2015/08/24/blacklivesmatter-sanders-clinton-anger-column/32055507/", "http://dailycaller.com/2015/08/24/jeb-bush-isnt-wrong-when-claiming-asians-are-majority-of-anchor-babies/#ixzz3jpRzrwNL", "http://www.nytimes.com/politics/first-draft/2015/08/25/hillary-clinton-to-raise-money-with-state-parties-amid-nominating-fight/"], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-25T21:01:38.695+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}