{"organizations": [], "uuid": "232a87ed438fefa7d6faa2e2abf10df0b8f03a57", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55dcdba31d00002f00145db2.jpeg?cache=PNVdWvN3Kk", "site_section": "http://www.huffingtonpost.com/tag/jeb-bush/feed", "section_title": "Jeb Bush on Huffington Post", "url": "http://www.huffingtonpost.com/entry/2016-contenders-immigration-forum-iowa_55dcc551e4b0a40aa3ac811d?kvcommref=mostpopular", "country": "US", "title": "Nearly Every Presidential Candidate Is Skipping An Immigration Forum In Iowa This Weekend", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Nearly Every Presidential Candidate Is Skipping An Immigration Forum In Iowa This Weekend", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T20:31:00.000+03:00", "replies_count": 0, "uuid": "232a87ed438fefa7d6faa2e2abf10df0b8f03a57"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/2016-contenders-immigration-forum-iowa_55dcc551e4b0a40aa3ac811d?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Nearly Every Presidential Candidate Is Skipping An Immigration Forum In Iowa This Weekend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nearly Every Presidential Candidate Is Skipping An Immigration Forum In Iowa This Weekend An organizer says it's \"sending a message that's not a positive one.\" Elise Foley Immigration & Politics Reporter, The Huffington Post Posted: 08/25/2015 05:31 PM EDT Credit: Associated Press Sen. Bernie Sanders (I-Vt.) is one of the sixteen presidential candidates who turned down an invitation to the upcoming Unite Iowa on Immigration forum. \nWASHINGTON -- Residents of the critical campaign state of Iowa will gather Saturday to talk about the pivotal issue of immigration. But only two presidential candidates are planning to join. \nFormer Maryland Gov. Martin O'Malley and former Rhode Island Gov. Lincoln Chafee, both contenders for the Democratic nomination, are the only candidates from either party set to attend the Unite Iowa on Immigration forum in Storm Lake, Iowa. \nThe event was organized by a group of Latino- and immigrant-focused organizations along with the student senate at Buena Vista University, where it will be held. The College Republicans and College Democrats both signed on as sponsors, and panelists include people from both parties. The event was inspired by #UniteIowa, a series of articles by Des Moines Register columnist Kyle Munson, who sought to use the columns to get Iowans talking about immigration in a less contentious way . Munson will moderate Saturday's forum. \nAlthough the event is meant to be nonpartisan, organizers said they invited a total of 18 presidential candidates from both parties. Sixteen campaigns turned them down, including those of the two leading Democratic contenders, former Secretary of State Hillary Clinton and Sen. Bernie Sanders (I-Vt.). No Republicans agreed to attend. \nThat was disappointing to Joe Henry, president of the Iowa branch of the League of United Latin American Citizens, one of the event's sponsors. \n\"We're glad that two of the candidates are attending; we wish that more would have,\" Henry said on a call with reporters Tuesday. \"And by the others not attending, that's sending a message that's not a positive one.\" \nImmigration has become a major campaign issue in recent weeks, thanks in part to the candidacy of Donald Trump. The business mogul and reality TV star has made bombastic comments about Mexican immigrants, promised to deport all undocumented people and argued that U.S. citizens born to unauthorized mothers aren't actually Americans. Other Republicans have joined in to question birthright citizenship for U.S.-born children of undocumented immigrants, and some have even agreed with Trump that mass deportation is the way to go. \nWhile Clinton has been critical of Trump and other GOP candidates on immigration, the O'Malley campaign said other Democrats' decision not to attend the forum showed they weren't doing enough on the issue. O'Malley has made immigration one of his top campaign issues, emphasizing it as a point of contrast between himself and Clinton. \n\"Democrats should not cede the immigration debate to Donald Trump, but that's exactly what they do when they skip critical forums like the first-ever UNITE Iowa immigration forum,\" O'Malley spokeswoman Gabi Domenzain said in a statement. \"If anything, it shows that Democrats are all words, no action when it comes to immigration.\" \nClinton spokeswoman Xochitl Hinojosa said the candidate is unable to attend the forum, but \"looks forward to continuing a conversation with voters in Iowa and across the country about the importance of fixing our broken immigration system.\" \nMost of the other campaigns did not respond to a request for comment. A spokeswoman for Sen. Ted Cruz (R-Texas) said he will be in New Hampshire this weekend, and a spokeswoman for Sen. Rand Paul (R-Ky.) said he will be on a six-day tour through Alaska, Washington, Idaho, Utah and Wyoming. Emily Benavides, a spokeswoman for former Florida Gov. Jeb Bush (R), reiterated her candidate's support for comprehensive immigration reform but said he had not been invited to the forum in time. \"While a casual email invitation was received from LULAC late last week,\" she said, \"no formal invitation was ever received from Unite Iowa. Governor Bush will not be in Iowa this weekend and will not be able to attend on such short notice. He regrets not being able to attend their event on Saturday and hopes to be involved in the future.\" \nOrganizers downplayed the need to have candidates in attendance, although they said they would welcome more. Munson told reporters on Tuesday's call that the event was designed \"to be a meaningful event, regardless of candidate participation,\" but added that the organizers were \"hoping as many candidates as possible would get involved to talk about this.\" \nHe suggested that candidates might have had other priorities or events, or might not want to talk about immigration in that particular forum. \n\"Who knows? Many campaigns, Clinton included, declined,\" Munson said. \"That's fine.\" \n\"For my own part,\" he added, \"I'm happy just to bring all of these Iowans together on the same day to kind of focus on this issue. To me, that's a success.\"", "external_links": [], "published": "2015-08-25T20:31:00.000+03:00", "crawled": "2015-08-26T01:33:50.315+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}