{"organizations": [], "uuid": "0ca5c3b4bf8d299ebfb9adbc84a9add5b962cbad", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55dd0952170000b70056895d.jpeg", "site_section": "http://www.huffingtonpost.com/tag/drug-war/feed", "section_title": "Drug War on Huffington Post", "url": "http://www.huffingtonpost.com/entry/most-influential-marijuana-users_55dcd9aae4b0a40aa3ac95e3?ncid=txtlnkusaolp00000592&kvcommref=mostpopular", "country": "US", "title": "These Influential Marijuana Users Defy The Stoner Stereotype", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "These Influential Marijuana Users Defy The Stoner Stereotype", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T10:00:00.000+03:00", "replies_count": 0, "uuid": "0ca5c3b4bf8d299ebfb9adbc84a9add5b962cbad"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/most-influential-marijuana-users_55dcd9aae4b0a40aa3ac95e3?ncid=txtlnkusaolp00000592&kvcommref=mostpopular", "ord_in_thread": 0, "title": "These Influential Marijuana Users Defy The Stoner Stereotype", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "These Influential Marijuana Users Defy The Stoner Stereotype \"Times have changed, and so have public attitudes toward marijuana.”   08/26/2015 07:00 AM EDT | Edited: 1 hour ago ASSOCIATED PRESS \nNow that nearly one out of every two Americans admits to having tried marijuana at some point in their lives, more than half of all states have moved away from draconian prohibition-style marijuana policies and the legal marijuana industry's savvy entrepreneurs are running businesses that are generating billions in sales (and millions in taxes ), the \"stoner\" stereotypes of the past seem more obsolete than ever before. \nTo help quash those myths for good, the advocacy group Marijuana Policy Project has released its annual list of the top 50 most influential Americans who have used marijuana. The people who appear on it -- and their soaring success -- just might surprise you. \n“We hope this list will make people question some of the anti-marijuana propaganda they’ve been hearing for so long,” Mason Tvert, communications director for MPP, said in a statement. “Millions of adults enjoy consuming marijuana for many of the same reasons that adults enjoy consuming alcohol. The only thing that makes marijuana consumers more likely to become ‘losers’ are the legal penalties they face just for using it.” \nMPP's list contains politicians like President Barack Obama and eight of the 2016 presidential hopefuls. According to MPP, only six candidates out of the more than two dozen making a run for the White House have said they never used marijuana. The others have either made it clear they have tried the substance, or have suggested that they may have at some point in their lives. \n“Fewer than one-third are willing and able to admit they never used marijuana,” Tvert said. “Times have changed, and so have public attitudes toward marijuana.” \nMPP's list also contains a Supreme Court justice, governors, entertainers, entrepreneurs and sports stars. \nMPP says that it used a similar set of metrics that Out Magazine used to produce its \"Power 50\" list of LGBT Americans, including \"power to influence cultural and social attitudes, political clout, individual wealth, and a person’s media profile.” Individuals on MPP's list do not need to currently consume marijuana, and they do not have to support reform of marijuana policy. They simply need to be a currently living U.S. citizen who has consumed marijuana at least once in his or her life. The information about consumption, according to MPP, must come from the person's \"own account or that of a legitimate source.\" \nCheck out some of our favorites from MPP's list below, and go here to see all 50. Maureen Dowd ASSOCIATED PRESS", "external_links": [], "published": "2015-08-26T10:00:00.000+03:00", "crawled": "2015-08-26T22:29:41.669+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}