{"organizations": ["Death For Black People Ben Carson Says Abortions Are Main Cause Of Death For Black People The Republican"], "uuid": "08ec5b8ef1d2db4a8a042ac24a4d0e9cece849cc", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55cdf99e1d00006e00144d13.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/ben-carson-abortion_55cdf1afe4b07addcb42a449", "country": "", "title": "Ben Carson Says Abortions Are Main Cause Of Death For Black People", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Ben Carson Says Abortions Are Main Cause Of Death For Black People", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T19:21:00.000+03:00", "replies_count": 0, "uuid": "08ec5b8ef1d2db4a8a042ac24a4d0e9cece849cc"}, "author": "", "url": "http://www.huffingtonpost.com/entry/ben-carson-abortion_55cdf1afe4b07addcb42a449", "ord_in_thread": 0, "title": "Ben Carson Says Abortions Are Main Cause Of Death For Black People", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ben Carson"], "text": "Ben Carson Says Abortions Are Main Cause Of Death For Black People The Republican presidential candidate has accused Planned Parenthood of population control. Amber Ferguson Associate Politics Video Editor, The Huffington Post Posted: 08/14/2015 11:54 AM EDT | Edited: 08/14/2015 12:52 PM EDT \nRepublican presidential candidate and neurosurgeon Ben Carson claimed Thursday that “the number one cause of death for black people is abortion,” and stood by comments he made in August that the founder of Planned Parenthood, Margaret Sanger, wanted to eliminate black people. \nDuring an appearance on Fox News' “The O’Reilly Factor,” Carson said Sanger wrote about eugenics and she “was not enamored of black people.” \n“I encourage people to go and read about Margaret Sanger and go and read about the beginnings of this organization so that you know what you’re dealing with,” Carson said. \nWhen talking about the number of abortions happening in black communities, Carson said, \"I wonder if maybe some people might at some point become concerned about that and ask, 'Why is that happening?'\" \nCarson has recently made several comments reflecting his opposition to Planned Parenthood. Appearing on Fox News' “Your World with Neil Cavuto” on Wednesday, Carson said , “One of the reasons you find most of their clinics in black neighborhoods is so that you can find ways to control that population.” \nAccording to the Centers for Disease Control and Prevention, the leading causes of death for African-Americans are heart disease, cancer and stroke. Abortions are not listed in the report. \n\"The CDC would not list abortion at all, because legally the fetus is not considered a life. Therefore, there would be no listed death,\" Carson's campaign said in a statement. \nCarson also addressed reports that he used aborted fetal tissue for research during his medical career. He dismissed the allegations, saying, “All pathology departments will have a whole array of tissues, from day one of conception until 99 years old. ... Just because they get the fetal tissue does it mean they should throw it out? Of course they don't. That's how science is advanced.\" \nWatch the video above. ", "external_links": [], "published": "2015-08-14T19:21:00.000+03:00", "crawled": "2015-08-15T14:04:20.283+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}