{"organizations": [], "uuid": "00faeefea7365c47062f382bf87c3e0b02dcb396", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_080515gn4.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/250332-obama-links-republicans-to-iranians-chanting-death-to-america", "country": "US", "title": "Obama links Republicans to Iranians chanting 'death to America'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama links Republicans to Iranians chanting 'death to America'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T21:01:00.000+03:00", "replies_count": 0, "uuid": "00faeefea7365c47062f382bf87c3e0b02dcb396"}, "author": "kballuck@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/policy/international/250332-obama-links-republicans-to-iranians-chanting-death-to-america", "ord_in_thread": 0, "title": "Obama links Republicans to Iranians chanting 'death to America'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama links Republicans to Iranians chanting 'death to America' Greg Nash By Jesse Byrnes - 08/05/15 02:01 PM EDT \nPresident Obama on Wednesday linked congressional Republicans opposed to his nuclear deal with Tehran to Iranian hardliners who chant \"death to America,\" suggesting both want to torpedo the accord. \nInsisting America takes certain \"offensive\" and \"incendiary\" remarks emanating from parts of Iran seriously, Obama said the U.S. \"should not act impulsively in response to taunts.\" \n“Just because Iranian hardliners chant ‘death to America’ does not mean that that’s what all Iranians believe,” Obama said to applause during his speech at American University. \n“In fact, it’s those hardliners who are most comfortable with the status quo. It’s those hardliners chanting ‘death to America’ who have been most opposed to the deal. They are making a common cause with the Republican caucus,\" Obama said. \nMany Americans have remained skeptical about the Iran deal and have pointed to the spattering of anti-American chants as evidence the U.S. shouldn't be engaged with Tehran. \nSecretary of State John Kerry, a top negotiator for the deal on behalf of the U.S., said last month that he had told his Iranian counterparts the chants were \"not helpful\" and \"pretty stupid.\" \nObama's speech Wednesday is part of a full-court effort on the part of his administration to win over skeptical Democrats to support the deal amid a 60-day congressional review period. \nThe president compared a vote on the Iran deal as the most consequential since lawmakers voted to authorize the Iraq War over a decade ago, casting the vote as a decision between the deal and war. Tags: 1 day Fifth Planned Parenthood video... An official also discusses altering abortion procedures to meet specific... Bush drops 40 pounds on Paleo diet Bush talked about his weight loss in an interview at an Iowa Dairy Queen. Trump: Harvard students '... Trump fell victim to an elaborate prank by a group of Harvard students. Field set for first GOP debate Rick Perry fails to make the top 10, officially announced by Fox late... Senate GOP thwarted in effort to... Two Democrats voted to move forward with the bill, which stalled in a 53-... Kelly Osbourne makes racial remark... \"If you kick every Latino out ... then who is going to be cleaning your... Harvard Lampoon tricks Trump with... A fake endorsement called Trump \"the most formidable and competitive\" GOP... Iran denies link between... A website alleged that Javad Zarif’s son was the best man at Vanessa Kerry... Trump: Shut down government over... Trump called for the tactic to cut off the group's funding in the wake of... Trump's leaked phone number... Callers to Trump's number are told about his website and Twitter account. Poll: Clinton's favorability takes... Clinton is viewed unfavorably by 48 percent; favorably by 37 percent. Capitol Police: Staffer arrested... Rep. Duncan Hunter says his staffer is \"a hero\" and the incident must be... Judge extends block on videos from... A hearing is set for Aug. 27. Obama celebrated birthday at Rose'... The president and his guests reportedly skipped the line on their way in. McConnell's vow: No more... The Senate majority leader pledges to begin talks \"at some point.\" Three lines of attack against... Opponents are looking to all three branches of government to block the... Gawker publishes Trump phone number “Mr. Trump has several numbers so this is not an issue,” a campaign source... Juan Williams: GOP's anger turns... OPINION | Republicans who feed the resentments of the base imperil GOP... Congress holds hearing on... Why would anyone take seriously such a biased hearing on the BDS movement? Biden challenge to Clinton would... The biggest challenge would be finding a niche — and a reason for his... GOP lawmaker diagnosed with... Rep. Curbelo says last few weeks have been trying for family. Fifth Planned Parenthood video to... The videos have led to a defunding fight over Planned Parenthood. Two undocumented immigrants... VIDEO | The outcry was loud Monday night in Huntington Park, Calif. Carson: Black Lives Matter... Carson also discussed illegal immigration in an NBC interview.", "external_links": [], "published": "2015-08-05T21:01:00.000+03:00", "crawled": "2015-08-06T00:53:51.097+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}