{"organizations": [], "uuid": "e1530417161132accc5c4abee65f7e4b04fe8e58", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55dd205e1d00002f00145e35.jpeg", "site_section": "http://www.huffingtonpost.com/tag/koch-brothers/feed", "section_title": "Koch Brothers on Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-koch-brothers-harry-reid_55dd1f7be4b04ae49704f4e8?ncid=txtlnkusaolp00000618&kvcommref=mostpopular", "country": "US", "title": "Charles Koch: Obama Attack Was A 'Farewell Gesture To Help Harry Reid'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Charles Koch: Obama Attack Was A 'Farewell Gesture To Help Harry Reid'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T01:33:00.000+03:00", "replies_count": 0, "uuid": "e1530417161132accc5c4abee65f7e4b04fe8e58"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/obama-koch-brothers-harry-reid_55dd1f7be4b04ae49704f4e8?ncid=txtlnkusaolp00000618&kvcommref=mostpopular", "ord_in_thread": 0, "title": "Charles Koch: Obama Attack Was A 'Farewell Gesture To Help Harry Reid'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Charles Koch: Obama Attack Was A 'Farewell Gesture To Help Harry Reid' Obama singled out the Koch brothers for obstructing state-level efforts to set new renewable energy standards and promote clean energy. Marina Fang Associate Politics Editor, The Huffington Post Posted: 08/25/2015 10:33 PM EDT Credit: AP Photo/Andrew Harnik President Barack Obama and Senate Minority Leader Harry Reid (D-Nev.) \nBillionaire industrialist Charles Koch said Tuesday that President Barack Obama's harsh words for him and his brother David were personally motivated and a means of appeasing Senate Minority Leader Harry Reid (D-Nev.), a noted opponent of the influential conservative donors. \n“I was absolutely flabbergasted that he could say so many things about us that were the opposite of the truth,” Koch told Politico . “I was really dumbfounded. And I know he was there with Harry Reid. So we expect that with Harry Reid, but I didn’t expect that from the president. The only thing I can think of is he was there with Harry Reid, and it was kind of a farewell gesture to help Harry Reid. I can think of no other reason to single us out in his remarks in his efforts to promote his favorite forms of energy.” \nOn Monday, Obama singled out the Koch brothers for obstructing state-level efforts to set new renewable energy standards and promote clean energy. \n“You start seeing massive lobbying efforts backed by fossil fuel interests or conservative think tanks, or the Koch brothers pushing for new laws to roll back renewable energy standards or prevent new clean energy businesses from succeeding -- that’s a problem,” he said in a speech at the National Clean Energy Summit in Las Vegas. Credit: The Washington Post via Getty Images Charles Koch \nAs part of their massive empire, the Koch brothers own energy companies, and they've lobbied for tax breaks to favor them. They have also spent millions to push back against energy regulations, and the Koch-funded American Legislative Exchange Council has introduced several state-level bills to override renewable energy standards. \nIn his speech, Obama also went after Republicans in general for preventing progress on renewable energy. \n“Now is not the time to pull back from these investments. Many Republicans want to take from these successful clean energy programs,” he said. “That’s not the American way, that’s not progress, that’s not innovation. That’s trying to protect the old ways of doing business and standing in the way of the future.”", "external_links": [], "published": "2015-08-26T01:33:00.000+03:00", "crawled": "2015-08-26T08:09:33.005+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}