{"organizations": [], "uuid": "0c1a221550841eddca4cc82b5fcca61fbdb73ba2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55ca62f51700006e005673c1.jpeg", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/entry/marijuana-edibles-may-have-to-ditch-the-candy-label-in-colorado_55ca621ae4b0f73b20baf6dc?kvcommref=mostpopular", "country": "US", "title": "Marijuana Edibles May Have To Ditch The 'Candy' Label In Colorado", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Marijuana Edibles May Have To Ditch The 'Candy' Label In Colorado", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T20:07:00.000+03:00", "replies_count": 0, "uuid": "0c1a221550841eddca4cc82b5fcca61fbdb73ba2"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/marijuana-edibles-may-have-to-ditch-the-candy-label-in-colorado_55ca621ae4b0f73b20baf6dc?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Marijuana Edibles May Have To Ditch The 'Candy' Label In Colorado", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marijuana Edibles May Have To Ditch The 'Candy' Label In Colorado Under new rules, edibles would be labeled with a big stop sign. Posted: 08/11/2015 05:07 PM EDT | Edited: 2 hours ago ASSOCIATED PRESS DENVER (AP) -- Edible marijuana products in Colorado may soon come labeled with a red stop sign, according to a draft of new rules released Wednesday by state marijuana regulators. The state may also ban the word \"candy\" from edible pot products, even if they're sweets such as suckers or gummy chews. The new pot symbol - an octagon stop-sign shape with the letters \"THC\" to indicate marijuana's psychoactive ingredient - would have to be on individual edible items, not just labels. Liquid marijuana products would be limited to single-serve packaging - defined aa 10 milligrams of THC. Regulators rejected an earlier proposal to mark edible pot with a weed-leaf symbol after a parents' group complained the symbol would simply attract children, not dissuade them from eating the products. The proposed rules were released as the Colorado Marijuana Enforcement Division works on new guidelines for edible marijuana, which can be baked into cookies or brownies or added to a dizzying array of items from sodas, to pasta sauces, to granolas. The agency tried and failed last year to implement a requirement that edible marijuana have a distinct look when outside of its packaging, a requirement passed by state lawmakers last year amid concerns that some people were accidentally eating food infused with marijuana. The state already banned pot manufacturers from using cartoon characters on packaging or making \"look-alike\" products such as candies designed to mimic common foods. But the state has seen sporadic reports of people unknowingly eating pot. Perhaps most famous was a man hospitalized after unknowingly eating pot-infused chocolate at the 2014 Denver County Fair. The new edible pot rules face a public hearing before final adoption. Marijuana regulators in Colorado have until January to implement a 2014 law requiring edible marijuana to have a distinct look when outside its packaging. The law was passed after reports of people accidentally eating foods infused with marijuana. The agency tried but failed to come up with those rules last year after several meetings with pot manufacturers. The manufacturers complained that the law - which requires edible to be \"stamped, shaped, colored or otherwise marked\" that it is not for consumption by children - would be unwieldy when it comes to liquid products or anything besides hard candies or cookies. In response, the state Health Department last year suggested banning all edible marijuana except for lozenges or other items that could be easily stamped. The proposal was quickly withdrawn after the industry and consumers complained. The sponsor of the law requiring a distinct look for edible pot called the stop-sign symbol and the \"candy\" label ban said they are appropriate steps to address concerns that pot candies can tempt kids who don't know it's a product that intoxicate them. \"I don't think that items that aren't attractive to kids like granola and salad dressing need to be held to the same high standard of marking, stamping, or coloring,\" said Rep. Jonathan Singer, D-Longmont. \"I'd like to see hard and fast rules for items that are attractive to kids and exceptions for others.\" Edible marijuana makers didn't immediately reject the proposed rules - though they stressed that they believe that childproof packaging and clear labels are sufficient to keep kids out of edible pot, and that once out of the package, the manufacturers should not be responsible for how they're stored. One cookie maker said she'd rather see the \"THC\" label in a circle, not a stop-sign shape. \"A stop sign sends the message that THC is bad. That says, `Stay away,' \" said Julie Berliner, CEO of Sweet Grass Kitchen, which makes marijuana-infused cookies. Colorado dispensaries last year launched a \"First Time 5\" campaign of posters to encourage new users to take a 5 milligram half-dose of marijuana to make sure they don't overdo it. A marijuana advocacy group has taken out billboards and magazine ads with the tagline \"Start Low, Go Slow.\"  Top 50 Most Influential Marijuana Users of", "external_links": [], "published": "2015-08-11T20:07:00.000+03:00", "crawled": "2015-08-12T02:56:16.883+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}