{"organizations": ["Republican", "Fox News Latino Fox News Latino BIRCH RUN"], "uuid": "e312f10983485c7233f7e1362a4e8e239182d665", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Donald%20Trump%20FNLATINO%201.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/opinion/2015/08/19/opinion-donald-trump-policy-on-immigration-part-one/", "country": "", "title": "Opinion: Donald Trump's lying and cheating about immigration | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Opinion: Donald Trump's lying and cheating about immigration | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "e312f10983485c7233f7e1362a4e8e239182d665"}, "author": "", "url": "http://latino.foxnews.com/latino/opinion/2015/08/19/opinion-donald-trump-policy-on-immigration-part-one/", "ord_in_thread": 0, "title": "Opinion: Donald Trump's lying and cheating about immigration | Fox News Latino", "locations": ["Birch Run", "Saginaw", "Michigan", "Genesee"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bill", "Trump", "Donald Trump"], "text": "Fox News Latino BIRCH RUN, MI - AUGUST 11: Republican presidential candidate Donald Trump speaks at a press conference before delivering the keynote address at the Genesee and Saginaw Republican Party Lincoln Day Event August 11, 2015 in Birch Run, Michigan. This is Trump's first campaign event since his Republican debate last week. (Photo by Bill Pugliano/Getty Images) 2015 Getty Images \nDonald Trump is simply not a serious candidate for president. \nThis is manifested by his parroting Alabama Senator Jeff Sessions on the vaunted Trump immigration plan Trump recently released. Sessions comes from Alabama, and he reflects the long-standing low information view of the modern integrated world best represented by former Gov. George Wallace, the racist official who stood at the door of the University of Alabama 50 years ago chanting, “ Segregation today, segregation tomorrow, segregation forever! ” Then he stood aside while U.S. Army troops integrated the university. \nOn the subject of Mexicans, Sessions is today’s George Wallace. \nTrump played the hate-Mexicans plank of his campaign in his original announcement on June 16. Without mentioning “illegal aliens” he declared that Mexico was sending its worst people here illegally to avoid paying for them and their transgressions. He stated simply “Mexicans” with the qualification that “some Mexicans” were “nice people.” \nTrump has tried to mollify his hate-Mexicans words with declarations that he loves the Mexican people and Mexico. Rumors abound that his 30-year-old daughter, Ivanka, tried to counsel him to lay off, but he continues and stamps his campaign with a 1,900-word position paper that smacks of Alabama’s historical Ku Klux Klan. \nSome Americans agree with him; some don’t. \nHere's a simple-minded statement from Trump's proposal: “U.S. taxpayers have been asked to pick up hundreds of billions in health-care costs, housing costs, education costs, welfare costs, etc. Indeed, the annual cost of free tax credits alone paid to illegal immigrants quadrupled to $4.2 billion in 2011. The effects on job-seekers have also been disastrous, and black Americans have been particularly harmed.” \nNow the facts: \"Illegals\" are not eligible for any of the programs he claims drain the U.S. Treasury. As for tax fraud, far more is committed by U.S. citizens than ever imagined by people in the country illegally. Blacks have been unemployed in far greater numbers than whites since 1865 – not because of Mexicans coming to work in the U.S. \nTrump: “The impact in terms of crime has been tragic. In recent weeks, the headlines have been covered with cases of criminals who crossed our border illegally only to go on to commit horrific crimes against Americans. Most recently, an illegal immigrant from Mexico, with a long arrest record, is charged with breaking into a 64 year-old women’s home, crushing her skull and eye sockets with a hammer, raping her and murdering her. The police chief in Santa Maria says the 'blood trail' leads straight to Washington.” \nPartially true, but did the crime occur because the perpetrator was here illegally? Are the thousands of black murder victims killed by fellow blacks, being that they are black, victim or perpetrator? That is Trump logic. \nTrump: “In 2011, the Government Accountability Office found that there were a shocking 3 million arrests attached to the incarcerated alien population, including tens of thousands of violent beatings, rapes and murders.” \nPartially true but hiding a horrific lie: Many of these arrestees were charged with multiple counts, like spitting on the street, driving without a license or being intoxicated. And how many of those arrested were actually convicted of the crimes they were charged with? \nIf there had been three million “convictions,” more than the 6 percent – the actual figure – of all \"illegals\" would be in prison. And most of them (85 percent) because of crimes having to do with property, drug offenses and immigration violations, not crimes of violence that Trump lies about. \nTrump: “Meanwhile, Mexico continues to make billions on not only our bad trade deals but also relies heavily on the billions of dollars in remittances sent from illegal immigrants in the United States back to Mexico ($22 billion in 2013 alone).” \nFalse and foolish. There are no bad trade deals with Mexico. There is the North American Free Trade Agreement (NAFTA) that in 21 years has produced millions of jobs in the U.S., while there might be a loss of a fraction of those millions of jobs over the same 21 years. \nThe Wilson Center says 6 million Americans work in trade with Mexico. Mexico is the largest trading partner with Texas (400,000 jobs) as it is with California (690,000 jobs). The U.S. Chamber of Commerce's estimate is even higher: They say there are 14 million Americans working in trade with Mexico. \nAs far as remittances, aren’t they dollars earned in the marketplace, and after taxes and Social Security have been deducted? We know that Trump favors confiscation of private property (he supports the Supreme Court's controversial decision about the eminent domain Kelo v. City of New London case), but now he hints that he would confiscate money earned on the job by Mexicans. Theft, thievery – is that what Trump lives by? \nIn this first analysis installment of the Trump immigration plan we find that he lies about crime, states that he would steal millions of dollars from working people, violate the rights of “persons” that the Supreme Court has said are entitled to the same rights as Americans – “equal protection” and “due process.” \nRaoul Lowery Contreras is a political consultant. He was formerly with the New American News Service of the New York Times Syndicate. \nFollow us on twitter.com/foxnewslatino ", "external_links": [], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-20T13:27:37.871+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}