{"organizations": [], "uuid": "03e57f2df40e5c8e9739b159e744f75d86cb00e9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c3a2851700006e00566cbe.jpeg?cache=HGAjgSIBzh", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/mitch-mcconnell-scolds-obama-on-iran-rhetoric_55c3a13ae4b0f1cbf1e41c2f", "country": "", "title": "Mitch McConnell Scolds Obama To Tone Down Iran Rhetoric", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Mitch McConnell Scolds Obama To Tone Down Iran Rhetoric", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T22:41:00.000+03:00", "replies_count": 0, "uuid": "03e57f2df40e5c8e9739b159e744f75d86cb00e9"}, "author": "", "url": "http://www.huffingtonpost.com/entry/mitch-mcconnell-scolds-obama-on-iran-rhetoric_55c3a13ae4b0f1cbf1e41c2f", "ord_in_thread": 0, "title": "Mitch McConnell Scolds Obama To Tone Down Iran Rhetoric", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mitch McConnell", "Michael McAuliff"], "text": "Mitch McConnell Scolds Obama To Tone Down Iran Rhetoric The majority leader promises his Republicans will be respectful while debating the nuclear deal. Michael McAuliff Senior Congressional Reporter, The Huffington Post Posted: 08/06/2015 02:27 PM EDT | Edited: 1 hour ago \nWASHINGTON -- Senate Majority Leader Mitch McConnell (R-Ky.) did not take kindly to being compared by President Barack Obama to Iranians who shout “death to America,” and scolded the commander in chief Thursday for treating the Iran nuclear deal like a political campaign. \nIn a speech laying out his reasons for cutting the deal, Obama said Wednesday that a superpower like the United States cannot respond impulsively and be pushed toward war by the sort of inflammatory rhetoric that comes from Iranian hard-liners. He suggested that Republicans who hurl their own brand of rhetorical firebombs are actually aligned with Iranians who are yelling slogans in the streets. \n“Just because Iranian hard-liners chant ‘death to America’ does not mean that's what all Iranians believe,” Obama said. “It's those hard-liners chanting ‘death to America’ who have been most opposed to the deal. They are making a common cause with the Republican caucus.” \nMcConnell, speaking at a final news conference before Congress’ August recess, said Republicans have “legitimate concerns over the Iran nuclear agreement” that they will discuss respectfully in September when Congress votes on the agreement. \n“What is not helpful is rhetoric like the president has been using,” McConnell said. \n“The president strikes me at least so far as treating this like a political campaign,” McConnell said. “Demonize your opponents, gin up the base, get the Democrats all angry, and rally around the president.” \nMcConnell also said repeatedly that Obama should rein in such talk. \n“Rather than this kind of crass political rhetoric, we ought to treat this issue with the dignity it deserves,” he said. \n“I wish he would tone down the rhetoric, and let’s talk about the facts,” McConnell said. \nCongress does not return from its break until after Labor Day, which falls on Sept. 7. The Iranian deal has to be voted on by Sept. 17. \nMichael McAuliff covers Congress and politics for The Huffington Post. Talk to him on Facebook . ", "external_links": [], "published": "2015-08-06T22:41:00.000+03:00", "crawled": "2015-08-06T22:41:13.663+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}