{"organizations": [], "uuid": "1922d35edde5bd82d2c6c56ff50e24e44baa1479", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c3b7a314000077002e232b.jpeg?cache=3ROXHRyWbK", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-gop-support-voting-rights_55c3ac57e4b0f1cbf1e42811", "country": "", "title": "Obama Calls Out GOP For Backing Voting Rights In Theory, But Not In Practice", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Calls Out GOP For Backing Voting Rights In Theory, But Not In Practice", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T01:41:00.000+03:00", "replies_count": 0, "uuid": "1922d35edde5bd82d2c6c56ff50e24e44baa1479"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-gop-support-voting-rights_55c3ac57e4b0f1cbf1e42811", "ord_in_thread": 0, "title": "Obama Calls Out GOP For Backing Voting Rights In Theory, But Not In Practice", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "John Lewis", "Samantha Lachman", "Carolyn Kaster/ASSOCIATED", "Obama"], "text": "Obama Calls Out GOP For Backing Voting Rights In Theory, But Not In Practice He also mocked the idea that voter impersonation fraud is actually a thing that happens. Samantha Lachman Staff Reporter, The Huffington Post Posted: 08/06/2015 04:31 PM EDT | Edited: 2 hours ago President Barack Obama listens as Rep. John Lewis, D-Ga. speaks in the South Court Auditorium in the Eisenhower Executive Office Building on the White House complex in Washington, Thursday, Aug. 6, 2015, on the 50th anniversary of the Voting Rights Act. | Carolyn Kaster/ASSOCIATED PRESS \nWASHINGTON -- At a White House event to commemorate the 50th anniversary of the Voting Rights Act , President Barack Obama criticized Republican-backed attempts to restrict access to the ballot. \nA wave of state legislatures have passed laws requiring government-issued photo identification to vote and cutting back early voting, with the rationale that such policies protect against fraud, Obama noted. But evidence of such fraud is scarce. GOP-controlled legislatures have been more easily able to pass restrictive laws since the Supreme Court gutted the most effective section of the VRA in 2013, which required states with a history of discrimination to first clear any changes to their election laws with the federal government. \n\"On the ground, there are still too many ways in which people are discouraged from voting,\" Obama said. \"State legislatures have instituted procedures and practices that, although on the surface may appear neutral, have the effect of discouraging people from voting, may have a disproportionate effect on certain kinds of folks voting. And, if in fact those practices, those trends, those tendencies, are allowed to continue unanswered, then over time, the hard-won battles of 50 years ago erode, and our democracy erodes,\" he continued. \"And that means that the decisions that are made in the corridors of power all across this country begin to reflect the interests of the few instead of the interests of the many.\" \nObama was joined at the event by Rep. John Lewis (D-Ga.), who was nearly beaten to death by Alabama state troopers when, as a leader of the Student Nonviolent Coordinating Committee, he participated in the historic march from Selma to the state capital in Montgomery in March 1965. Americans were horrified by the brutality the marchers faced, so much so that President Lyndon Johnson was able to push Congress to pass the Voting Rights Act, with bipartisan support, on Aug. 6, 1965. \nAt the commemoration of Selma's 50th anniversary this spring, the president called on the Republican congress members in attendance to take up a bill to restore the gutted sections of the VRA. Those bills haven't gotten out of committee , as GOP legislative leaders say that minorities are voting at adequate levels and that the VRA has served its purpose . \nObama urged lawmakers on Thursday to take up the issue once again. \n\"I said when I was in Selma that we’re glad you’re here, members of Congress, but we’ll be even more glad, we’ll be in an even more celebratory mood, if you go back to Washington and reaffirm America’s commitment to what was fought for here at this bridge,\" Obama said. \"Now, so far, that hasn’t happened. John Lewis is right to do it. There’s legislation pending. There are people of goodwill on both sides of the aisle who are prepared to move it, but it keeps on slipping as a priority.\" \nOn Thursday, the Republican National Committee released a statement that celebrated the VRA without calling for its restoration . \nAnd as states fight in court to protect their strict photo ID laws -- cases in Texas and in North Carolina are ongoing -- Obama said that while the idea of a voter ID law may sound reasonable, in practice such laws, which Republicans say prevent fraud, are more likely to disenfranchise seniors, low-income people, minorities and younger voters. \n\"It doesn’t actually address a real problem, because there are almost no instances of people going to vote in somebody else’s name,\" Obama said. \"It turns out it’s just not a common crime ... almost nobody wakes up and says, 'I’m going to go vote in someone else’s name,' it doesn’t happen. So the only reason to pass this law, despite the reasonableness of how it sounds, is to make it harder for folks to vote.\" \nAttorney General Loretta Lynch suggested at the event that those restricting voting rights today are cut from the same cloth as those who supported poll taxes and other discriminatory measures decades ago. \n\"It is the lesson of every generation that the price of freedom is constant vigilance, because opponents of free and fair access to the voting booth have neither retreated nor surrendered,\" Lynch said. \"Since the very beginning and at every step, organized opposition has worked to set us back -- to take advantage of apathy, discord and disarray, and to restrict the rights that are due to all Americans: the right to representation; the right to access the franchise; the right to have a say -- and therefore a stake -- in the direction of this country; and the right, underlying all others, to be viewed as a full and equal citizen.\" \n\"The forces of obstruction are as old as the rights they have fought to deny,\" she said. \nTo encourage more Americans to become involved in the political process, the administration has designated Sept. 22 as \"National Voter Registration Day,\" Obama announced. Too many people are content to complain about the government, he said, rather than showing up at the polls or mailing in a ballot to fix it. \n\"This isn’t always a popular thing to say in front of progressive groups, everybody’s fired up, and rightly so, but the reason that the voting rate in the last midterm election was 30-something percent is not attributable to a photo ID law,\" he explained. \"The fact of the matter is that far more people disenfranchise themselves than any law does, by not participating. By not getting involved. So yes, we have to be vigilant in pushing back against laws that seek to disenfranchise people ... there are all kinds of battles we have to fight. But we miss the forest for the trees if we don’t recognize that huge chunks of us -- citizens -- just give away our power.\" ", "external_links": [], "published": "2015-08-07T01:41:00.000+03:00", "crawled": "2015-08-07T01:41:14.664+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}