{"organizations": ["Colorado Department of Public Health and Environment"], "uuid": "40f12627a90231b1e1203c06bd1684d068095f87", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150407113439-high-profits-plans-00000614-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_health", "section_title": "CNN.com - Health", "url": "http://edition.cnn.com/2015/05/06/living/feat-marijuana-talking-to-kids-post-legalization/index.html?eref=rss_health", "country": "US", "title": "Talking to kids about legal marijuana", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Talking to kids about legal marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T15:53:00.000+03:00", "replies_count": 0, "uuid": "40f12627a90231b1e1203c06bd1684d068095f87"}, "author": "", "url": "http://edition.cnn.com/2015/05/06/living/feat-marijuana-talking-to-kids-post-legalization/index.html?eref=rss_health", "ord_in_thread": 0, "title": "Talking to kids about legal marijuana", "locations": ["California", "Colorado", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tatro", "Morrison", "Wolk", "Kelly Wallace", "Obama", "Nick Tatro"], "text": "MUST WATCH Obama: Dad was absent; I got high 05:53 In Colorado, where unlimited recreational use of marijuana was legalized in January 2014, policy makers are so far not seeing a jump in the overall teen use rate or a dropin the age at which teens start using marijuana, according to Wolk of the Colorado Department of Public Health and Environment. Wolk said his agency did a \"check-in\" this past fall with a small sample of teens who participate in a risk behavior survey the state conducts every two years. While the findings are not statistically significant, Wolk predicts the trend will continue if \"we're doing our job correctly.\" He makes the comparison to sexual activity and birth control, and how it has been shown that making birth control more widely available does not lead to kids becoming more sexually active. His major concern is keeping tabs on the messaging, branding and marketing of marijuana, especially of edibles, to make sure the products aren't enticing to kids. \"I'm not singling marijuana out,\" said Wolk. \"I'm asking for the same treatment for recreational marijuana use that we would ask for other recreational substances that are legal yet potentially harmful to kids,\" he said, referring to alcohol, tobacco and e-cigarettes. Changing perceptions I wondered if we do come to a point in the near future where weed shops are just as common across the country as bars, whether parents will be as comfortable with their kids using marijuana as young adults as they would be with them drinking a glass of wine or a beer occasionally. \"You know, that's not what I would wish for my kids by any means,\" said Morrison, the Florida mom of two . But as her kids negotiate the \"real world\" and are exposed to alcohol and marijuana, moderation is the most important thing, she said. \"Just like with alcohol, if you find yourself using alcohol every day and especially throughout the day, multiple times a day, then that can create big problems in your life, but if it's something that you do socially or occasionally then that is moderation.\" Related: Study: Kids who sip more likely to drink Nick Tatro, who runs a medicinal cannabis business in California called Green Beauties , thinks language, such as removing \"getting high\" from conversations, can help change perceptions. Not every user gets high, he pointed out. \"They're doing it for a little bit of relaxation or a little bit of focus or a little bit of pain management or they're doing it because they sleep better or their stomach digests food better,\" Tatro said. He continued, \"I think it really works against our cause in the industry if we're promoting getting high.\" Tatro also said how people act when they take or administer cannabis (he also doesn't like to use the word marijuana) can play a role in determining if the public will one day have the same acceptance of adults using marijuana -- in places where it's legal -- as they do with people drinking alcohol. \"People make their own decisions based on what they observe so they've got to observe people behaving like normal human beings. That's what they need to see.\" What do you think is the best way to talk to your kids about marijuana? Share your thoughts with Kelly Wallace on Twitter or CNN Living on Facebook . <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div>", "external_links": [], "published": "2015-08-11T15:53:00.000+03:00", "crawled": "2015-08-11T16:17:21.237+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}