{"organizations": [], "uuid": "bd8b27235d34f6129d4ce6ffd222df3f73bd2a04", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/21/politics/obama-iran-nuclear-deal-op-ed/index.html", "country": "", "title": "Obama pens op-ed on Iran - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama pens op-ed on Iran - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T15:53:00.000+03:00", "replies_count": 0, "uuid": "bd8b27235d34f6129d4ce6ffd222df3f73bd2a04"}, "author": "", "url": "http://www.cnn.com/2015/08/21/politics/obama-iran-nuclear-deal-op-ed/index.html", "ord_in_thread": 0, "title": "Obama pens op-ed on Iran - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama pens op-ed on Iran By Tal Kopan , CNN Updated 1334 GMT (2034 HKT) August 21, 2015 US President Barack Obama delivers remarks on the nuclear deal reached with Iran at American University in Washington, DC, August 5, 2015. In 1963 US President John F. Kennedy traveled the short distance from the White House to American University to muster support for diplomatic engagement with nuclear foe the Soviet Union. On Wednesday, at the same spot, President Obama will echo Kennedy's entreaty, arguing for a nuclear deal with Iran -- a country described by his predecessor as part of an \"axis of evil.\" Story highlights The op-ed ran in the home state of a high-ranking Democrat who came out with a fiery critique of the president's deal. Obama has been on vacation in Martha's Vineyard for most of the month but has continued lobbying on the deal. (CNN) President Barack Obama is continuing his August outreach on the Iran nuclear deal ahead of a scheduled September vote in Washington, penning an op-ed that ran in newspapers across the country plugging the deal. Invoking the leadership of former President John F. Kennedy during the Cold War, Obama's op-ed stressed his argument that walking away from the deal would amount to risking war. \"Here's my bottom line: If we are committed to preventing Iran from obtaining a nuclear weapon, the choice we ultimately face is between a diplomatic solution and what would likely become another war in the Middle East in the near future,\" Obama wrote. The piece ran in approximately 30 newspapers around the country -- but the link circulated by the White House sent readers to The Star-Ledger in New Jersey. That is the home state of Sen. Robert Menendez, a high-ranking Democrat who this week came out with a fiery critique of the president's deal. Menendez became the second Democrat in the Senate to say he would vote against the deal -- but Obama picked up three Senate Democrats' support on Thursday, bringing the total to 23. He'll need 34 Senate Democrats to sustain a presidential veto on any congressional disapproval of the deal, assuming all Republicans vote against him. RELATED: Iran deal whip list The president has been on vacation in Martha's Vineyard for most of the month, with members of Congress in their home districts for recess. But that has not slowed the lobbying on the deal, with lawmakers making their positions clear and the president continuing his outreach ahead of September. Also Thursday, Obama sent a letter to Rep. Jerry Nadler, a New York Democrat, defending the deal and urging him to support it. Meanwhile, a report that Iranians would have a role in inspections of a sensitive Iran military facility on Thursday also fueled the flames of critics of the deal. ", "external_links": [], "published": "2015-08-21T15:53:00.000+03:00", "crawled": "2015-08-21T15:53:49.041+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}