{"organizations": [], "uuid": "10da37bd3b8cd155332044b119a21182282ddc98", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/bernie-sanders/feed", "section_title": "Bernie Sanders on Huffington Post", "url": "http://www.huffingtonpost.com/herb-silverman/is-president-obama-a-chri_b_7939400.html", "country": "US", "title": "Herb Silverman: Is President Obama a Christian, and Does It Matter?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Herb Silverman: Is President Obama a Christian, and Does It Matter?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T19:33:00.000+03:00", "replies_count": 0, "uuid": "10da37bd3b8cd155332044b119a21182282ddc98"}, "author": "Herb Silverman", "url": "http://www.huffingtonpost.com/herb-silverman/is-president-obama-a-chri_b_7939400.html", "ord_in_thread": 0, "title": "Herb Silverman: Is President Obama a Christian, and Does It Matter?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nMy answer about whether President Obama is a Christian would be the same as that of Republican presidential candidate Scott Walker: \" I don't know .\" That's also the answer I'd give about whether Scott Walker is a Christian. But Walker's uncertainty about Obama is different from mine. \nWalker said he wasn't sure because he hadn't talked to Obama about whether he is a follower of Christ. Since Walker is unconvinced by Obama saying he's a Christian, I wonder what it would take to convince Walker. \nHere are some Christian biblical recommendations that Walker would surely not require of a Christian Obama: Acts 2:44 Let all be divided, each according to his need. Matthew 19:21 To be perfect, sell your possessions and give it to the poor. Mark 10:25 It is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God. Acts 2:44 : All the believers were united and shared everything with one another. Matthew 5:42 When someone asks you for something, give it to him. When someone wants to borrow something, lend it to him. \nChristians who call President Obama a socialist apparently don't view Jesus as a socialist. But even an acknowledged socialist like Bernie Sanders isn't as socialistic as Jesus. \nAlso, since God must have established Obama as president, Christians should agree with whatever he says, raise enough taxes to pay for all his programs, and assure that church and state remain separate: Romans 13:1 Let all be subject to the governing authorities because God has established the authorities that exist. Matthew 22:21 Render to Caesar that which is Caesar's and to God that which is God's. \nHave I taken biblical passages out of context? Perhaps. But who gets to decide context? Some Christians would deny that Obama is a Christian by quoting other biblical passages. For instance, Obama accepts the latest scientific advances, even if they conflict with the Bible. Scott Walker, on the other hand, won't say whether he accepts evolution . \nWe should note that there are biblical reasons to repeal Obamacare and substitute cheaper alternatives: James 5:15 Prayer offered in faith will make the sick person well. Mark 16:18 Believers are not harmed by taking up poisonous snakes. Matthew 5:29-30 If thy right eye offend thee, pluck it out; if thy right hand offend thee, cut it off. \nBiblical healthcare has yet another budget-cutting advantage. We would no longer have to worry about the long-term solvency of Social Security. By following biblical science, few would live long enough to collect from a resulting Social Security surplus. \nWhether religious or not, people don't want their leaders to be hypocrites. So I wish more Christian politicians would follow this advice from Jesus: Matthew 6:5-6 When you pray, be not like the hypocrites who love to pray standing in their synagogues and in the corners of the streets, that they may be seen of men. When you pray, enter the closet, shut the door and pray to your father in secret. \nWhile deciding if President Obama is a Christian, Scott Walker might take the same approach as President George W. Bush when he first met Russian President Vladimir Putin. Bush said: \"I looked the man in the eye. I found him to be very straightforward and trustworthy. We had a very good dialogue. I was able to get a sense of his soul.\" But I prefer what Vice-President Joe Biden said to Putin: \"I'm looking into your eyes, and I don't think you have a soul.\" Apparently, Putin thought Biden is more realistic than Bush because he smiled at Biden's remark and said, \"We understand one another.\" \nScott Walker and others like him probably think Christianity is more about belief than behavior. Most Christians believe that Jesus died on the cross for our sins, rose from the dead, will be returning to Earth, and will send people to heaven or hell depending on whether or not they believe this resurrection story. \nDoes President Obama believe this story? I'm probably even more skeptical than Scott Walker. It's easy to say what you believe when it's not possible for your belief to be verified. I can take professions of faith at face value or hypothesize that they are making a political calculation when they publicly embrace Christianity. Barack Obama had an atheist father and was raised by a secular humanist mother whose values he embraced. He was once an agnostic and became a Christian when he ran for public office. \nHaving said all the above, the most important question for me is why any of this matters. In a country that prides itself in having freedom of religion and conscience, I wish we would judge our candidates on their political positions and not on their professed religious beliefs. I'm happy to hear reasonable arguments for or against any positions, but please don't try to convince me with God talk. Next year we will be electing a President of the United States who will be Commander-in-Chief, not Pastor-in-Chief. I hope she or he will back up decisions with good secular arguments, not faith-based beliefs. \nWhat I find most interesting about our current presidential primaries is that the most surprisingly successful candidates in each party, Donald Trump and Bernie Sanders, also appear to be the least religious. Donald Trump might be an atheist because he hasn't acknowledged a power higher than himself. On the other hand, he might think of himself as a god. Bernie Sanders is Jewish, but never talks about religion. If he actually were religious, he would perhaps be the only Jewish socialist in the country who believes in God. \nOne of my favorite political quotes comes from Jamie Raskin, a law professor who testified at a Maryland State Senate hearing in 2006 about gay marriage. At the end of his testimony, Republican State Senator Nancy Jacobs said: \"Mr. Raskin, my Bible says marriage is only between a man and a woman. What do you have to say about that?\" Raskin replied : \"Senator, when you took your oath of office, you placed your hand on the Bible and swore to uphold the Constitution. You did not place your hand on the Constitution and swear to uphold the Bible.\" (Note: Raskin is now a candidate for U.S. Congress in Maryland and has received the endorsement of the Freethought Equality Fund PAC . I'm a member of its Board of Directors.) More:", "external_links": [], "published": "2015-08-07T19:33:00.000+03:00", "crawled": "2015-08-08T01:09:58.117+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}