{"organizations": [], "uuid": "bb5fe432c1877e9478fdda0f7e3b1075a993e96d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d656701700006e00568214.jpeg", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/entry/advocates-say-marijuana-legalization-in-arizona-could-generate-40-million-a-year-for-schools_55d62f66e4b07addcb460f1e?kvcommref=mostpopular", "country": "US", "title": "Advocates Say Marijuana Legalization In Arizona Could Generate $40 Million A Year For Schools", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Advocates Say Marijuana Legalization In Arizona Could Generate $40 Million A Year For Schools", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T22:46:00.000+03:00", "replies_count": 0, "uuid": "bb5fe432c1877e9478fdda0f7e3b1075a993e96d"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/advocates-say-marijuana-legalization-in-arizona-could-generate-40-million-a-year-for-schools_55d62f66e4b07addcb460f1e?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Advocates Say Marijuana Legalization In Arizona Could Generate $40 Million A Year For Schools", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Advocates Say Marijuana Legalization In Arizona Could Generate $40 Million A Year For Schools Still, the Democratic and Republican parties in the state could not be more divided on the issue. Matt Ferner National Reporter, The Huffington Post Posted: 08/20/2015 07:46 PM EDT Bloomberg via Getty Images \nThe backers of a proposed 2016 Arizona ballot initiative that would legalize, regulate and tax marijuana similarly to alcohol in the state estimate that if the measure makes it on the ballot and is passed, it could raise more than $40 million a year for schools. \n\"Marijuana should be sold by businesses that pay taxes and follow laws, not by cartels and criminals that evade them,” J.P. Holyoak, chairman of the Campaign to Regulate Marijuana Like Alcohol, said in a press statement. Holyoak as well as other supporters of recreational legalization announced the possible tax boost for the state during a Wednesday press conference at the state capitol. \nAdvocates in the state are currently collecting signatures in order for the measure to qualify for the November 2016 state ballot. So far, the campaign says it has gathered roughly 60,000 signatures since its petition drive began in May. \nSimilar to Colorado’s recreational marijuana legalization and regulatory framework, the Regulation and Taxation of Marijuana Act would allow Arizona adults 21 and older to be in possession of up to 1 ounce of marijuana and grow up to six plants for personal use in their homes. The measure would also allow for retail marijuana shops to sell the substance to adults and would enact a 15 percent excise tax on those sales. \nThe revenue generated from that special excise tax would go to fund the implementation and enforcement of state regulations, but 40 percent of that tax revenue would go to education, including the funding of full-day kindergarten programs. \nHolyoak’s group says that would add up to $40 million in tax revenue for the Department of Education annually, and at the press conference called that number “very conservative.” Their revenue estimate is based on marijuana sales figures in Colorado, adjusted for state population and consumption rates gathered from federal data on marijuana use. \nColorado was the first state in the nation and government in the world to regulate recreational marijuana, and there were many unknowns when it did so. One of those unknown factors was its own marijuana tax revenue estimates, which fell short of expectations in the first year of sales. The state initially forecast that around $70 million would be collected from recreational marijuana, but only about $44 million came in during the first year of sales. The state has since adjusted tax estimates downward. \nArizona has not yet conducted its own revenue estimate, according to the Arizona Republic . \nThe leaders of the state Republican and Democratic parties could not be more divided on the issue. \n“This was a pathetic display -- this marijuana cartel is trying to recruit Arizona’s educators by pledging a share of the future profits from the marijuana industry,” Robert Graham, chairman of the Arizona Republican Party, said in a statement following the press conference. \n“The promises of benefits from recreational marijuana are as fake as the check they showed at their press conference today,” Graham added, in reference to a symbolic, jumbo-sized $40 million check that Holyoak presented to the state at the conference. \nAlexis Tameron, chair for the state Democratic Party, blasted Graham’s characterization and voiced full-throated support for legalization in the state. \n“I’m not surprised the Arizona Republican Party finds itself yet again on the wrong side of history, nor am I surprised they’re opposing something that would generate so much money for our schools,” Tameron said to The Huffington Post. “Do you know that it is currently easier to obtain marijuana in Arizona’s high schools than alcohol? I’m pretty sure drug dealers and their cartel bosses don’t ask for I.D., yet well-regulated and well-run businesses that sell alcohol do. Regulating marijuana like alcohol will eventually dry up the black market, making it harder for kids to obtain it.” \nA majority of voters in the state appear to feel similarly to Tameron about the plant. A June survey of adult heads of household in the state found that 53 percent support legalizing the possession of small amounts of marijuana for personal use. \nIf Arizona’s marijuana measure makes it onto the ballot and passes, adults in the state would join those in Colorado, Washington, Oregon, Alaska and the District of Columbia, all of which have similar recreational marijuana laws (D.C. continues to ban sales). Twenty-three states, including Arizona, have also legalized marijuana for medical purposes. \nStill, the federal government continues to ban marijuana, classifying it as as one of the “most dangerous” drugs, alongside heroin and LSD.  Top 50 Most Influential Marijuana Users of", "external_links": [], "published": "2015-08-20T22:46:00.000+03:00", "crawled": "2015-08-21T05:48:24.740+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}