{"organizations": [], "uuid": "08ff65e489940f8e3d6b5c2bf8b7154c048f8b2c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55cd3e181400002e002e2e3a.jpeg", "site_section": "http://www.huffingtonpost.com/tag/war-on-terror/feed", "section_title": "War on Terror on Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-guantanamo-bay_55cd3dbce4b0ab468d9ce9d4?kvcommref=mostpopular", "country": "US", "title": "Guantanamo Detainees' Lawyers Are Skeptical That Obama Will Close The Prison", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Guantanamo Detainees' Lawyers Are Skeptical That Obama Will Close The Prison", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T00:09:00.000+03:00", "replies_count": 0, "uuid": "08ff65e489940f8e3d6b5c2bf8b7154c048f8b2c"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/obama-guantanamo-bay_55cd3dbce4b0ab468d9ce9d4?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Guantanamo Detainees' Lawyers Are Skeptical That Obama Will Close The Prison", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Guantanamo Detainees' Lawyers Are Skeptical That Obama Will Close The Prison \"There is this profound dissonance between what the administration is saying about its desire to close Guantanamo and what is it actually doing.\" By David Rohde Posted: 08/13/2015 09:09 PM EDT \nWASHINGTON, Aug 13 (Reuters) - Before midnight on Friday, President Barack Obama's Justice Department is due to either block or accept a legal request to free a Guantanamo Bay prisoner who weighs 74 pounds (33.5 kg) after an eight-year hunger strike. \nLawyers for the detainee, Tariq Ba Odah, say the way the department decides will be the clearest indication yet of how serious Obama is about closing the detention center before he leaves office in January 2017. \nThey accuse the president of being unwilling to use all his executive powers to empty the camp and are skeptical of his commitment. \n\"There is this profound dissonance between what the administration is saying about its desire to close Guantanamo and what is it actually doing,\" said Omar Farah, the detainee's lawyer. \"And it's the administration's actions that actually count.\" \nThe 36-year-old Yemeni detainee has been force-fed by nasal tube since he stopped eating solid food in 2007. His weight loss over the last 18 months have raised fears among his lawyers that he could die of starvation. Pentagon officials said he is receiving proper care. \nU.S. intelligence and military officials cleared him for release five years ago from the Guantanamo detention center, where 116 men are imprisoned on a U.S. Navy base 14 years after the Sept. 11, 2001 attacks. ASSOCIATED PRESS \nOfficials from the Defense Department, which administers the center, are calling on government lawyers to oppose a habeas corpus petition Ba Odah's lawyers filed in June requesting his release on health grounds. \nPentagon officials say transferring him could create an incentive for future hunger strikes, according to senior U.S. officials. The State Department supports his release. \nLawyers for Ba Odah, who was captured by the Pakistani Army along the Afghan border and was accused of receiving weapons training in order to fight with the Taliban, say Obama could instruct government lawyers not to oppose the habeas petition on Friday. There are as many as a half dozen other habeas petitions that the government could choose not to contest, they said. \nIn December 2013, the Justice Department stood on the sidelines when a habeas corpus petition for an ill Sudanese prisoner at Guantanamo was filed, clearing the way for a judge to order his release. \nFriday's court filing is expected to show whether the White House, which has promised to send Congress a plan shortly to close the internationally condemned facility completely, will side with the Pentagon or the State Department in the dispute. Alex Wong via Getty Images \nOBAMA AND EXECUTIVE POWERS \nLawyers for detainees and legal experts say the case is one of several examples of the president not using executive powers that could speed the transfer of 52 men cleared for release. U.S. government officials said last week that a dozen foreign countries have agreed to accept nearly half of the men. \n\"I think the president is not doing anywhere near what he could be doing at this point,\" said David Glazier, a professor at Loyola Law School in Los Angeles who follows Guantanamo cases. \nA senior administration official dismissed the criticism saying the resident's \"entire national security team is working together to fulfill the president's steadfast commitment to closing the Guantanamo detention facility.\" \nThe Ba Odah case shows how the president could reduce the ranks of detainees through court-ordered releases, according to lawyers for detainees. Such releases avoid a Congressionally-mandated requirement that the Secretary of Defense personally sign a waiver approving each transfer. \nThe signed waiver requirement, and intense opposition to releases from top military commanders, resulted in successive defense secretaries being slow to transfer detainees cleared for release. \nLawyers for detainees accused the administration of hypocrisy when government lawyers recently argued that the U.S. war in Afghanistan justified holding another Guantanamo detainee cleared for release. President Obama, they pointed out, has repeatedly declared that the U.S. war in Afghanistan is over. \nLegal experts say the president could order a Periodic Review Board to determine more quickly whether a detainee's release poses a risk. Since Obama created the board four years ago, it has reviewed the cases of only 19 prisoners. Another 50 detainees await being vetted under the process. \nGlazier said reviews have actually slowed since former President George W. Bush's second term, when they were often conducted annually. \nJoseph Margulies, a Cornell University law professor who also represents a detainee, said he believed the administration's actions reflect a decision by Obama that closing Guantanamo is not as important as other goals. \n\"I just think he is not willing to expend political capital to do it,\" he said. \"It's not nearly as important to him as the Iran deal.\" (Reporting by David Rohde; Additional reporting by Matt Spetalnick and Julia Edwards; Editing by David Storey and Alan Crosby)", "external_links": [], "published": "2015-08-14T00:09:00.000+03:00", "crawled": "2015-08-14T08:19:52.758+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}