{"organizations": [], "uuid": "820497d9c982a59309bb6ff784582f2630783dc7", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150816193502-trump-immigration-plan-serfaty-lkl-00001920-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_us.rss", "section_title": "CNN.com - U.S.", "url": "http://edition.cnn.com/2015/08/17/opinions/reyes-trump-immigration/index.html", "country": "US", "title": "Donald Trump's clueless immigration plan - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Donald Trump's clueless immigration plan - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T00:52:00.000+03:00", "replies_count": 0, "uuid": "820497d9c982a59309bb6ff784582f2630783dc7"}, "author": "Raul A. Reyes", "url": "http://edition.cnn.com/2015/08/17/opinions/reyes-trump-immigration/index.html", "ord_in_thread": 0, "title": "Donald Trump's clueless immigration plan - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Raul Reyes: Donald Trump's immigration plan isn't workable and would damage the economy Plan to deport undocumented immigrants, end birthright citizenship is callous, divisive, he says Raul A. Reyes is an attorney and member of the USA Today board of contributors. Follow him on Twitter @RaulAReyes . The opinions expressed in this commentary are solely those of the author.\n(CNN) They have got to go. That about sums up the immigration ideas laid out by Donald Trump on Sunday's \"Meet the Press,\" and in an accompanying 1,900-word policy paper . After making opposition to illegal immigration a cornerstone of his circus-like presidential campaign, The Donald has finally ventured into specifics with an immigration policy plan centered on increased border security and immigration enforcement.\nWhile it is a good sign that Trump has ventured into actual policy proposals, his ideas are impractical at best and at worst inhumane. His ideas veer far to the right of the American mainstream. Far from stabilizing our economy, his plans could well stunt our economic growth.\nRaul Reyes Consider: Trump wants to build a wall all across our southern border with Mexico. To those for whom fighting illegal immigration is a top priority, this might sound like a smart, common-sense plan. But this line of thinking ignores reality. The border is more secure than it has been in years; an analysis this year by The Washington Post found that illegal crossings along the Mexican border were at their lowest level in two decades.\nCNN Interactive: 2016 election candidates\nMeanwhile, our country's population of undocumented immigrants has dropped by about 1 million over the last several years, according to the Pew Research Center. We don't need that wall; what we do need is smarter immigration enforcement.\nTrump says that his administration would force the Mexican government to pay for this wall. With all due respect, such an idea is laughable. A spokesman for Mexican President Enrique Peña Nieto, when told of Trump's plan to have Mexico foot the bill for a wall between our two countries, told Bloomberg News , \"It reflects an enormous ignorance for what Mexico represents, and also the irresponsibility of the candidate who's saying it.\" He's right on both counts.\nJUST WATCHED Donald Trump outlines his immigration plan Replay More Videos ... MUST WATCH\nDonald Trump outlines his immigration plan 01:43 To force Mexico to pay for this wall, Trump says he would impose import tariffs for its construction. Imagine how disruptive it would be if \"President Trump\" were to enter into an all-out economic battle with one of our top three trade partners , whose imports to the U.S. in 2014 totalled $294 billion.\nThe most troubling part of Trump's immigration plan is that he has, in effect, endorsed mass deportations of the undocumented. \"We're going to keep the families together, but they have to go,\" he said on \"Meet the Press.\" Think about what this would mean: Our undocumented population is estimated at about 11 million , roughly equivalent to the population of Ohio.\nThink of the tremendous economic upheaval, human suffering and community destabilization that would occur if our government were to round up and remove 11 million people. Such an idea is staggering in its lack of compassion, especially since a reported 62% of the undocumented have lived here for at least a decade, most as productive members of their American communities.\nThe costs of mass deportations would be, to use a favorite Trump term, \"huge.\" The conservative American Action Forum has estimated that deporting all of our undocumented immigrants would cost between $400 billion and $600 billion, and would take about 20 years. Under such a scenario, real gross domestic product would fall by nearly $1.6 trillion.\n21 photos: Donald Trump in the public eye 21 photos: Donald Trump in the public eye Business mogul Donald Trump announces his candidacy for the U.S. presidency at Trump Tower on Tuesday, June 16, 2015, in New York City. Hide Caption 1 of 21 21 photos: Donald Trump in the public eye Donald Trump attends golf legend Jack Nicklaus' Congressional Gold Medal ceremony on March 24, 2015, in the U.S. Capitol Rotunda. Trump announced on March 18 that he had launched a presidential exploratory committee. Hide Caption 2 of 21 21 photos: Donald Trump in the public eye Trump speaks to guests at the Iowa Freedom Summit on January 24, 2015, in Des Moines, Iowa. Hide Caption 3 of 21 21 photos: Donald Trump in the public eye As chairman and president of the Trump Organization and the founder of Trump Entertainment Resorts, Trump speaks during day two of the Republican Leadership Conference on May 30, 2014, in New Orleans. Hide Caption 4 of 21 21 photos: Donald Trump in the public eye Former U.S. vice presidential candidate and Alaska Gov. Sarah Palin and Trump walk toward a limousine after leaving Trump Tower, at 56th Street and Fifth Avenue, on May 31, 2011, in New York City. Hide Caption 5 of 21 21 photos: Donald Trump in the public eye Trump looks out the window of his limousine after visiting Newick's Lobster House on April 27, 2011, in Dover, New Hampshire. Hide Caption 6 of 21 21 photos: Donald Trump in the public eye Trump speaks to the media at Pease International Tradeport on April 27, 2011, in Portsmouth, New Hampshire. Hide Caption 7 of 21 21 photos: Donald Trump in the public eye Trump speaks to a crowd at the Palm Beach County Tax Day Tea Party on April 16, 2011, at Sanborn Square in Boca Raton, Florida. Hide Caption 8 of 21 21 photos: Donald Trump in the public eye Trump and his wife, Melania, attend the Michael Kors Spring 2011 fashion show during Mercedes-Benz Fashion Week at The Theater at Lincoln Center on September 15, 2010, in New York City. Hide Caption 9 of 21 21 photos: Donald Trump in the public eye Trump kisses Miss Universe 2009 Stefania Fernandez as they arrive at the 2010 Miss Universe Pageant at the Mandalay Bay Events Center on August 23, 2010, in Las Vegas. Hide Caption 10 of 21 21 photos: Donald Trump in the public eye Trump and his children Eric (second from left), Ivanka and Donald Jr. attend the ribbon-cutting ceremony for Trump SoHo New York at Trump SoHo on April 9, 2010, in New York City. Hide Caption 11 of 21 21 photos: Donald Trump in the public eye Trump, his daughter Ivanka, wife Melania and son Barron attend the \"The Trump Card: Playing to Win in Work and Life\" book launch celebration at Trump Tower on October 14, 2009, in New York City. Hide Caption 12 of 21 21 photos: Donald Trump in the public eye Trump and professional tennis player Serena Williams attend the Gucci cocktail party for the Foundation For the Advancement of Women Now at Gucci Fifth Avenue on September 16, 2009, in New York City. Hide Caption 13 of 21 21 photos: Donald Trump in the public eye Trump and his wife, Melania, left, attend the launch of Trump International Hotel and Tower Dubai with model Heidi Klum on June 23, 2008, at the Park Avenue Plaza in New York City. Hide Caption 14 of 21 21 photos: Donald Trump in the public eye Trump attends the debut of a Lego replica of the Trump International Hotel & Tower Dubai on June 23, 2008, at Central Park in New York City. Hide Caption 15 of 21 21 photos: Donald Trump in the public eye Trump attends the announcement of a partnership with Affliction Entertainment on June 5, 2008, at Trump Tower in New York City. Hide Caption 16 of 21 21 photos: Donald Trump in the public eye Trump attends the Donald Trump Friars Club Roast Luncheon at the New York Hilton on October 15, 2004, in New York City. Hide Caption 17 of 21 21 photos: Donald Trump in the public eye Trump poses with the new Donald Trump 12-inch talking doll on September 29, 2004, at the Toys 'R' Us store in New York City. Hide Caption 18 of 21 21 photos: Donald Trump in the public eye Trump arrives at \"The Apprentice\" casting call in Trump Tower on July 30, 2004, in New York City. Hide Caption 19 of 21 21 photos: Donald Trump in the public eye Trump dips Marla Maples after the couple married in a private ceremony amid tight security at the Plaza Hotel on December 20, 1993, following a six-year courtship. Hide Caption 20 of 21 21 photos: Donald Trump in the public eye Trump and his wife, Ivana, arrive at a social engagement on December 4, 1989, in New York. Hide Caption 21 of 21 For all Trump's lip service about \"keeping families together,\" what about the U.S.-born children who live with undocumented parents? In 2008, the National Council of La Raza estimated that three-quarters of children with at least one undocumented parent were U.S.-born citizens. Would these kids be sent back to countries that are foreign to them, places where they might not speak the language?\nEven worse, Trump has called for an end to birthright citizenship, saying it \"remains the biggest magnet for illegal immigration.\" There is little to no analytical evidence to support this notion. The overwhelming majority of undocumented immigrants come to this country to work and provide for their families. Besides, birthright citizenship has been established by the 14th Amendment to the Constitution and upheld by the U.S. Supreme Court as far back as the Wong Kim Ark case in 1898.\nThere are many other similarly flawed ideas in Trump's immigration plan. Any first-year economics student could tell him that that his proposal to \"pause\" the issuing of all green cards would have a negative impact on our technology and business sectors by turning off the inflow of qualified, legal workers.\nJUST WATCHED Fact-checking Donald Trump's numbers Replay More Videos ... MUST WATCH\nFact-checking Donald Trump's numbers 09:49 Trump wants increased border security and enforcement, although the United States currently spends more on immigration enforcement ($18 billion) than all other areas of federal law enforcement combined. Trump's immigration policy seems centered on the myth that undocumented immigrants take jobs from Americans. In fact, researchers have found that undocumented immigrants constitute a net benefit to our economy , based on their contributions to Social Security, taxes and work in the agricultural and service sectors.\nSure, illegal immigration is important to voters. Yet most Americans remain in support of a pathway to citizenship for the undocumented, one that would entail background checks, fines and a waiting period. A recent Gallup poll found that 65% of Americans favor a path to citizenship for the undocumented, while 19% favor sending them back to their home countries. So despite all the attention he is getting on the immigration issue, Trump is way out of step with most Americans.\nTrump's immigration plan would be a disaster for our country, our economy and our values. His ideas are a lot like his new political persona: callous, divisive and lacking in substance.\nCorrection: An earlier version of this commentary gave an incorrect figure for the value of Mexico's imports to the U.S.\nFollow @CNNOpinion Join us on Facebook.com/CNNOpinion.\nRead CNNOpinion's Flipboard magazine.", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150401134817-donald-trump-gallery-5-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135836-donald-trump-gallery-14-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816122125-04-trump-iowa-fair-0815-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140717-donald-trump-gallery-20-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140030-donald-trump-gallery-16-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816193502-trump-immigration-plan-serfaty-lkl-00001509-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135040-donald-trump-gallery-8-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135722-donald-trump-gallery-13-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140622-donald-trump-gallery-19-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140523-donald-trump-gallery-18-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135924-donald-trump-gallery-15-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505105146-raul-reyes-profile-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134252-donald-trump-gallery-1-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140158-donald-trump-gallery-17-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134817-donald-trump-gallery-5-medium-plus-169.jpg", "http://www.pewhispanic.org/2014/09/03/as-growth-stalls-unauthorized-immigrant-population-becomes-more-settled/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135250-donald-trump-gallery-10-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816122125-04-trump-iowa-fair-0815-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140622-donald-trump-gallery-19-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135722-donald-trump-gallery-13-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150629062326-donald-trump-june-16-2015-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134817-donald-trump-gallery-5-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135439-donald-trump-gallery-12-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135439-donald-trump-gallery-12-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140523-donald-trump-gallery-18-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135204-donald-trump-gallery-9-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134817-donald-trump-gallery-5-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135346-donald-trump-gallery-11-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505105146-raul-reyes-profile-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140523-donald-trump-gallery-18-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135204-donald-trump-gallery-9-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135040-donald-trump-gallery-8-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134429-donald-trump-gallery-2-medium-plus-169.jpg", "http://www.theguardian.com/us-news/2015/aug/16/donald-trump-says-illegal-immigrants-have-to-go-in-nbc-interview", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135722-donald-trump-gallery-13-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140158-donald-trump-gallery-17-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505105146-raul-reyes-profile-medium-plus-169.jpg", "http://www.migrationpolicy.org/news/us-spends-more-immigration-enforcement-fbi-dea-secret-service-all-other-federal-criminal-law", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134700-donald-trump-gallery-4-small-11.jpg", "https://www.donaldjtrump.com/positions/immigration-reform", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816193502-trump-immigration-plan-serfaty-lkl-00001509-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135040-donald-trump-gallery-8-medium-plus-169.jpg", "http://www.scpr.org/blogs/multiamerican/2011/01/19/7987/who-was-wong-kim-ark/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134429-donald-trump-gallery-2-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134858-donald-trump-gallery-6-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134252-donald-trump-gallery-1-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816122125-04-trump-iowa-fair-0815-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134946-donald-trump-gallery-7-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134252-donald-trump-gallery-1-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140717-donald-trump-gallery-20-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140622-donald-trump-gallery-19-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505105146-raul-reyes-profile-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140717-donald-trump-gallery-20-large-169.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135250-donald-trump-gallery-10-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134817-donald-trump-gallery-5-small-11.jpg", "https://twitter.com/CNNOpinion", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134817-donald-trump-gallery-5-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134429-donald-trump-gallery-2-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135346-donald-trump-gallery-11-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134858-donald-trump-gallery-6-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140030-donald-trump-gallery-16-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134429-donald-trump-gallery-2-super-169.jpg", "https://flipboard.com/section/voices-baPbmr", "http://i2.cdn.turner.com/cnnnext/dam/assets/150629062326-donald-trump-june-16-2015-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134612-donald-trump-gallery-3-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505105146-raul-reyes-profile-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816193502-trump-immigration-plan-serfaty-lkl-00001509-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140717-donald-trump-gallery-20-exlarge-169.jpg", "http://www.facebook.com/CNNOpinion", "http://i2.cdn.turner.com/cnnnext/dam/assets/150629062326-donald-trump-june-16-2015-exlarge-169.jpg", "http://www.washingtonpost.com/politics/flow-of-illegal-immigration-slows-as-us-mexico-border-dynamics-evolve/2015/05/27/c5caf02c-006b-11e5-833c-a2de05b6b2a4_story.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134252-donald-trump-gallery-1-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135924-donald-trump-gallery-15-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150629062326-donald-trump-june-16-2015-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816193502-trump-immigration-plan-serfaty-lkl-00001509-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134700-donald-trump-gallery-4-small-169.jpg", "http://thehill.com/blogs/congress-blog/foreign-policy/203984-illegal-immigrants-benefit-the-us-economy", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135439-donald-trump-gallery-12-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135722-donald-trump-gallery-13-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135722-donald-trump-gallery-13-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135346-donald-trump-gallery-11-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134858-donald-trump-gallery-6-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134429-donald-trump-gallery-2-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134946-donald-trump-gallery-7-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140622-donald-trump-gallery-19-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140523-donald-trump-gallery-18-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816193502-trump-immigration-plan-serfaty-lkl-00001509-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134612-donald-trump-gallery-3-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135250-donald-trump-gallery-10-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135250-donald-trump-gallery-10-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140030-donald-trump-gallery-16-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816122125-04-trump-iowa-fair-0815-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134946-donald-trump-gallery-7-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134429-donald-trump-gallery-2-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134612-donald-trump-gallery-3-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135924-donald-trump-gallery-15-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135722-donald-trump-gallery-13-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135924-donald-trump-gallery-15-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135836-donald-trump-gallery-14-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135346-donald-trump-gallery-11-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135836-donald-trump-gallery-14-full-169.jpg", "http://object.cato.org/sites/cato.org/files/pubs/pdf/irb_august2010.pdf", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140523-donald-trump-gallery-18-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140030-donald-trump-gallery-16-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816193502-trump-immigration-plan-serfaty-lkl-00001509-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135250-donald-trump-gallery-10-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134700-donald-trump-gallery-4-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135439-donald-trump-gallery-12-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140717-donald-trump-gallery-20-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140158-donald-trump-gallery-17-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816193502-trump-immigration-plan-serfaty-lkl-00001509-small-169.jpg", "http://www.pewresearch.org/fact-tank/2015/07/22/unauthorized-immigrant-population-stable-for-half-a-decade/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134429-donald-trump-gallery-2-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135924-donald-trump-gallery-15-small-11.jpg", "http://www.census.gov/foreign-trade/statistics/highlights/top/top1506yr.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134252-donald-trump-gallery-1-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135439-donald-trump-gallery-12-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135439-donald-trump-gallery-12-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134946-donald-trump-gallery-7-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505105146-raul-reyes-profile-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134612-donald-trump-gallery-3-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135836-donald-trump-gallery-14-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140158-donald-trump-gallery-17-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816122125-04-trump-iowa-fair-0815-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134612-donald-trump-gallery-3-small-169.jpg", "https://twitter.com/raulareyes", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135250-donald-trump-gallery-10-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140523-donald-trump-gallery-18-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135204-donald-trump-gallery-9-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140158-donald-trump-gallery-17-large-169.jpg", "http://www.nclr.org/images/uploads/publications/MixedStatusFamiliesHealthCoverage_ByNumbers_FINAL.pdf", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134858-donald-trump-gallery-6-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135204-donald-trump-gallery-9-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134858-donald-trump-gallery-6-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150629062326-donald-trump-june-16-2015-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134858-donald-trump-gallery-6-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134700-donald-trump-gallery-4-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140622-donald-trump-gallery-19-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816122125-04-trump-iowa-fair-0815-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135924-donald-trump-gallery-15-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150629062326-donald-trump-june-16-2015-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134612-donald-trump-gallery-3-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150629062326-donald-trump-june-16-2015-small-11.jpg", "http://www.gallup.com/poll/184577/favor-path-citizenship-illegal-immigrants.aspx?utm_source=Politics&utm_medium=newsfeed&utm_campaign=tiles", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140717-donald-trump-gallery-20-full-169.jpg", "http://www.theatlantic.com/politics/archive/2015/03/the-conservative-case-against-enforcing-immigration-laws/387004/", "https://news.vice.com/article/unauthorized-immigrants-paid-100-billion-into-social-security-over-last-decade", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135204-donald-trump-gallery-9-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140622-donald-trump-gallery-19-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134252-donald-trump-gallery-1-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135040-donald-trump-gallery-8-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135924-donald-trump-gallery-15-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150505105146-raul-reyes-profile-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135346-donald-trump-gallery-11-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135346-donald-trump-gallery-11-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135040-donald-trump-gallery-8-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140030-donald-trump-gallery-16-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140158-donald-trump-gallery-17-exlarge-169.jpg", "http://abcnews.go.com/Politics/donald-trump-unveils-immigration-plan-calls-end-birthright/story?id=33114832", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134700-donald-trump-gallery-4-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135040-donald-trump-gallery-8-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140717-donald-trump-gallery-20-small-11.jpg", "https://www.bloomberg.com/politics/articles/2015-08-13/sorry-donald-trump-mexico-says-it-will-not-pay-for-wall-on-border", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135836-donald-trump-gallery-14-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135722-donald-trump-gallery-13-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150816122125-04-trump-iowa-fair-0815-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135836-donald-trump-gallery-14-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134252-donald-trump-gallery-1-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134946-donald-trump-gallery-7-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135204-donald-trump-gallery-9-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134700-donald-trump-gallery-4-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135836-donald-trump-gallery-14-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134612-donald-trump-gallery-3-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140030-donald-trump-gallery-16-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135040-donald-trump-gallery-8-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140158-donald-trump-gallery-17-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134946-donald-trump-gallery-7-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134817-donald-trump-gallery-5-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135250-donald-trump-gallery-10-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140622-donald-trump-gallery-19-small-169.jpg", "http://quickfacts.census.gov/qfd/states/39000.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134858-donald-trump-gallery-6-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140523-donald-trump-gallery-18-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135204-donald-trump-gallery-9-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401140030-donald-trump-gallery-16-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135346-donald-trump-gallery-11-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401135439-donald-trump-gallery-12-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134700-donald-trump-gallery-4-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150401134946-donald-trump-gallery-7-large-169.jpg"], "published": "2015-08-19T00:52:00.000+03:00", "crawled": "2015-08-18T20:45:56.760+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}