{"organizations": [], "uuid": "54af9eb05d4c6ad82bcac130c76be1623f844775", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c260991700006e00566af7.jpeg", "site_section": "http://www.huffingtonpost.com/tag/420/feed", "section_title": "420 on Huffington Post", "url": "http://www.huffingtonpost.com/entry/dea-chief-marijuana-heroin-danger_55c25079e4b0f7f0bebb4ef5?ncid=txtlnkusaolp00000592&kvcommref=mostpopular", "country": "US", "title": "New DEA Chief: 'Heroin Is Clearly More Dangerous Than Marijuana'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "New DEA Chief: 'Heroin Is Clearly More Dangerous Than Marijuana'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T19:49:00.000+03:00", "replies_count": 0, "uuid": "54af9eb05d4c6ad82bcac130c76be1623f844775"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/dea-chief-marijuana-heroin-danger_55c25079e4b0f7f0bebb4ef5?ncid=txtlnkusaolp00000592&kvcommref=mostpopular", "ord_in_thread": 0, "title": "New DEA Chief: 'Heroin Is Clearly More Dangerous Than Marijuana'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New DEA Chief: 'Heroin Is Clearly More Dangerous Than Marijuana' Last week, he said weed \"probably\" didn't pose as great a health risk as heroin.   08/05/2015 04:49 PM EDT | Edited: 08/05/2015 05:22 PM EDT ASSOCIATED PRESS \nThe new Drug Enforcement Administration chief has finally made it clear: Marijuana is safer than heroin. \nDEA head Chuck Rosenberg told reporters Wednesday morning at the administration's headquarters that \"heroin is clearly more dangerous than marijuana,\" clarifying a less definitive statement he made last week , when he said marijuana is \"probably not\" as dangerous as heroin. Rosenberg said cannabis is still \"harmful and dangerous,\" but that his original remarks should have been clearer. \nCameras were not allowed at the press briefing, but DEA spokesman Joseph Moses confirmed Rosenberg's remarks to The Huffington Post. \nThe statement lines up with the science that has long been clear on the plant being one of the least dangerous recreationally used drugs. And while Rosenberg's comments may initially seem benign, they represent a significant shift in the point of view of an agency that continues to classify marijuana as one of the \"most dangerous\" drugs, alongside heroin and LSD. \nThey also represent a departure from the former head of the drug agency, Michele Leonhart, who resigned earlier this year amid allegations that DEA agents participated in \"sex parties\" with prostitutes in Colombia. She refused to acknowledge that marijuana might not be as unhealthy as harder drugs like heroin and crack. \nFour states and the District of Columbia have now legalized recreational marijuana, and 23 states have legalized the drug for medical purposes. Activists and lawmakers in favor of marijuana policy reform have held out hope that Rosenberg would lead the DEA away from its heavy-handed, marijuana prohibition-focused past. Instead, they've championed a pragmatic approach to monitoring and enforcing the drug that falls in line with the public's support for its legalization , as well as congressional support for states that have relaxed their marijuana laws. \nUnder the Controlled Substances Act, the U.S. has five categories for drugs and drug ingredients. Schedule I is reserved for drugs the DEA considers to have the highest potential for abuse and no medical value. Marijuana has been classified as Schedule I for decades. \nRosenberg has said he still wants the DEA to enforce current marijuana laws, but that the agency should focus on \"the biggest and most important cases there are,\" and that the heads of DEA bureaus around the nation should also concentrate on \"the most important cases in their jurisdictions.\" Typically, he said, that's \"heroin, opioids, meth and cocaine, in roughly that order, and marijuana tends to come in at the back of the pack.\" \nAdvocates for marijuana policy reform offered praise -- and jeers -- for Rosenberg's new, clearer remarks. \n\"It’s sort of remarkable that a DEA chief simply saying heroin is more dangerous than marijuana could actually make news,\" Ethan Nadelmann told HuffPost. Nadelmann is executive director Drug Policy Alliance, one of the world's largest public policy organizations seeking the reform of marijuana laws. \n\"I guess that’s a reflection of how out of touch his predecessor was -- that she couldn’t bring herself to simply state the obvious,\" Nadelmann said. \nDan Riffle, director of federal policies for Marijuana Policy Project, said it's great the DEA can finally acknowledge \"what any rational person has known for years\" and joked about how common-sense Rosenberg's statement really is. \n\"In other news, the sky is blue,\" Riffle said. \nAlso on HuffPost:", "external_links": [], "published": "2015-08-05T19:49:00.000+03:00", "crawled": "2015-08-06T16:07:06.364+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}