{"organizations": [], "uuid": "1aabe2171c504afd7107f50c308084721c9a341d", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150826063212-jorge-ramos-donald-trump-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_topstories.rss", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/08/26/media/univision-jorge-ramos-donald-trump/index.html", "country": "US", "title": "Univision's Jorge Ramos: It is my 'right' to quiz Trump on immigration 26,", "performance_score": 1, "site": "cnn.com", "participants_count": 5, "title_full": "Univision's Jorge Ramos: It is my 'right' to quiz Trump on immigration - Aug. 26, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T15:21:00.000+03:00", "replies_count": 4, "uuid": "de3e150f2865b16e22831292e288fe3e4efb08f8"}, "author": "Brian Stelter", "url": "http://money.cnn.com/2015/08/26/media/univision-jorge-ramos-donald-trump/index.html#post-0", "ord_in_thread": 0, "title": "Univision's Jorge Ramos: It is my 'right' to quiz Trump on immigration 26,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump security boots Jorge Ramos, then lets him back in Jorge Ramos says Donald Trump's event on Tuesday was \"the first time in my life, anywhere in the world, in which I have been escorted out of a press conference.\" The Univision anchorman's testy Q&A with Trump has the political and media worlds buzzing. Perhaps both men benefited -- Ramos by getting to challenge Trump in front of millions of viewers, Trump by getting to appear gracious by letting the reporter back in, then tough by responding to the rapid-fire questions.\nSome Trump supporters and conservative commentators say the candidate should have left Ramos outside, since the journalist stood up and starting asking questions without being called on.\nTrump said on Wednesday's \"Today\" show that Ramos \"was totally out of line last night\" and was \"ranting and raving like a madman.\"\nBut Ramos says it's his \"right\" as a \"U.S. citizen, as an immigrant, and as a journalist\" to ask Trump about the candidate's controversial immigration proposals.\nSpeaking on CNN's \"New Day,\" Ramos said he stood up to ask about Trump's deportation plan.\n\"The one who is out of line is Donald Trump,\" Ramos said.\nTrump has fostered hatred and division, \"and we have to call him out on that,\" he added.\nA stunt - and a substantive moment of journalism\nRamos is often said to be the most famous Spanish-language news anchor in the United States. He had been trying to get an interview with Trump for months.\nSo he decided to travel to Iowa for Trump's Tuesday evening rally there. He expected fireworks -- but not to be told to \"go back to Univision.\"\nYes, it was a stunt -- but it was also a substantive moment of journalism.\nTrump, Ramos said afterward, \"did not want to be specific on what he wanted to do with 11 million undocumented migrants.\"\nRamos is simultaneously an anchorman for Hispanic America and an advocate for Hispanic America.\nJournalists ask questions/\nLos periodistas hacen preguntas\n— JORGE RAMOS (@jorgeramosnews) August 26, 2015\nHe has been described as the \"Anderson Cooper of Spanish-language news\" and even the \"Hispanic Walter Cronkite.\"\nMillions of viewers watch his Spanish-language newscasts every weeknight. He also has a weekly show in English on the Fusion cable channel.\nRamos's point-of-view style of journalism is certainly polarizing -- hailed by some, criticized by others.\nHe has publicly assailed Trump's rhetoric on immigration and called the candidate's plan unworkable and \"absurd.\"\nSo not surprisingly, there were a wide variety of reactions to the press conference. Condemnations of Trump competed with headlines like this one from the conservative site National Review: \"Donald Trump Was Right to Kick Jorge Ramos Out Of His Press Conference.\"\nSome viewers called Ramos biased and accused him of grandstanding.\nBut the anchorman's fans like his uncompromising advocacy.\nRamos: 'I thought it was my ... right to ask a question\nWhen Ramos woke up Wednesday morning, he tweeted that \"no human being is illegal\" and that \"journalists ask questions.\"\nHe was supported by some prominent media figures, including the National Association of Hispanic Journalists, which said in a statement that \"Ramos was simply trying to hold a candidate for president accountable for statements he made about a very important topic to the American people.\"\nRamos described the incident this way: \"After two or three questions I thought it was my turn and my right to ask a question.\"\nRamos said Trump then \"motioned\" for security to remove him. But Trump says security made the decision to eject Ramos.\nIt was important to Ramos that he not sit down during the encounter. He was allowed back inside the room about ten minutes later.\nThat's when the two men had a long, sometimes tense back-and-forth about Trump's deportation plans for undocumented aliens and his call for an end to birthright citizenship.\nThe encounter ended with Trump saying, \"You and I, we'll talk.\"\nAfterward, a spokesman for Ramos said, \"We'd love for Mr. Trump to sit down for an in-depth interview with Jorge to talk about the specifics of his proposals. We think his thoughts on the topic of immigration are important to Jorge's viewers on Fusion and Univision.\"\nRelated: Univision dumps Trump cancels Miss USA pageant\nThe Future of Media, a customized magazine\n 7:21 AM ET", "external_links": ["http://i2.cdn.turner.com/money/dam/assets/150826063212-jorge-ramos-donald-trump-780x439.jpg", "http://i2.cdn.turner.com/money/dam/assets/150825213352-donald-trump-jorge-ramos-press-conferece-full-00052101-1024x576.jpg", "http://cnn.it/1mIIkkI", "https://twitter.com/jorgeramosnews/status/636480020400222208"], "published": "2015-08-26T15:21:00.000+03:00", "crawled": "2015-08-26T22:08:15.079+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}