{"organizations": [], "uuid": "af6972a9e84f4dde1200dfb32a57ba1c697f8e47", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55cd2bca1400002e002e2e33.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/index.xml", "section_title": "WorldPost - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/11-year-old-paraguay-rape-victim-gives-birth-after-denied-aobrtion_55cd2b6de4b0ab468d9ce235", "country": "US", "title": "11-Year-Old Paraguay Rape Victim Gives Birth After Denied Abortion", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "11-Year-Old Paraguay Rape Victim Gives Birth After Denied Abortion", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T02:49:00.000+03:00", "replies_count": 0, "uuid": "af6972a9e84f4dde1200dfb32a57ba1c697f8e47"}, "author": "Andrew Hart", "url": "http://www.huffingtonpost.com/entry/11-year-old-paraguay-rape-victim-gives-birth-after-denied-aobrtion_55cd2b6de4b0ab468d9ce235", "ord_in_thread": 0, "title": "11-Year-Old Paraguay Rape Victim Gives Birth After Denied Abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email 11-Year-Old Paraguay Rape Victim Gives Birth After Denied Abortion The girl was allegedly raped and impregnated by her stepfather when she was 10, but her government denied her an abortion. Posted: 08/13/2015 07:49 PM EDT | Edited: 25 minutes ago 13-year-old girl holds her one-month-old baby at a shelter for troubled children in Ciudad del Este, Paraguay. Another pregnant girl, age 11, gave birth on Thursday, Aug. 13, 2015, after Paraguay's government denied her an abortion. The girl was allegedly raped and impregnated by her stepfather when she was 10. | ASSOCIATED PRESS \nASUNCION, Paraguay (AP) — An 11-year-old girl who was denied an abortion after being raped gave birth Thursday, the culmination of a case that put a spotlight on child rape in this poor South American nation and drew criticism from human rights groups. \nElizabeth Torales, a lawyer for the girl's mother, told The Associated Press that the minor gave birth to a baby girl via cesarean in a Red Cross hospital in Asuncion, Paraguay's capital. She said reported there were no complications and both the mother and baby were resting. \n\"The baby doesn't yet have a name,\" said Torales, who added that her client and the girl's grandmother had requested custody of the infant. \nHospital director Mario Villalba told reporters outside the hospital that the birth took about 35 minutes. She said the girl would remain in the hospital for three or four days, \"like any other patient who has had a cesarean.\" She said the minor was currently accompanied by her grandmother, but declined to give more details. \nThe girl was allegedly raped and impregnated by her stepfather when she was 10. The stepfather has been arrested and is awaiting trial. The girl's mother has been charged with negligence. \nThe mother requested an abortion for her daughter, but the government refused to allow it, drawing praise from religious groups but criticism from many human rights organizations, including U.N. officials. Paraguay bans abortion except when a mother's life is in danger. At the time, the girl was five months pregnant and local health officials said she appeared to be in fine health. \nIn a statement Thursday, Amnesty International said it was glad the girl came through the birth all right, but said the fact that \"she did not die does not excuse the human rights violations she suffered at the hands of the Paraguayan authorities.\" \nWhile the case did spark some discussion about abortion in deeply socially conservative Paraguay, the focus of several protests was on better protecting children from abuse. \nAbout 600 girls age 14 or under become pregnant each year in this country of 6.8 million people, according to local health statistics. Many people have called for stiffer penalties for abusers and the funding of education programs to help parents and authorities better spot signs of abuse. \nNorma Benitez, spokeswoman for the Latin American Women's Commission, said her group would now push the government to provide a safe environment for the girl that includes both her mother and grandmother. \n\"The Paraguayan state must fulfil its role of protecting children by providing a home and a dignified life\" for this family, she said. \nThe Roman Catholic Church has wide influence in the country and was at the forefront of calls not to allow an abortion. Mariano Mercado, spokesman for the Paraguayan Episcopal Conference, reaffirmed the church's position Thursday but didn't talk about the girl's case. \n\"Human life is sacred and should be respected and protected from the moment of conception until death,\" he said. \nCarlos Gilizzola, a physician who holds a seat in the Senate, said he that for four years he has been pushing legislation to increase sex education funding. \n\"The majority of Christian churches, led by the Catholic Church, campaigned in 2012 to make sure the bill wasn't even taken up in committee,\" he said. \nIn July, Pope Francis spent three days in Paraguay. He met with officials, toured a slum outside Asuncion and celebrated two Masses. While activists had hoped to bring up the case of the pregnant girl, Francis did not speak about it or focus on abortion in any of his speeches.", "external_links": [], "published": "2015-08-14T02:49:00.000+03:00", "crawled": "2015-08-14T03:51:38.537+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}