{"organizations": ["Congress", "Reuters", "Facebook", "Twitter"], "uuid": "2bfcfacb08b882ef4bdd167f488d43f16d649488", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/grassley_dojpaper_split.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/08/04/igs-to-ask-lawmakers-to-remove-restrictions-that-limit-their-ability-to-uncover/", "country": "", "title": "Gov't watchdogs urge Congress to reverse Obama administration IG crackdown | Fox News", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Gov't watchdogs urge Congress to reverse Obama administration IG crackdown | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T23:08:00.000+03:00", "replies_count": 0, "uuid": "2bfcfacb08b882ef4bdd167f488d43f16d649488"}, "author": "", "url": "http://www.foxnews.com/politics/2015/08/04/igs-to-ask-lawmakers-to-remove-restrictions-that-limit-their-ability-to-uncover/", "ord_in_thread": 0, "title": "Gov't watchdogs urge Congress to reverse Obama administration IG crackdown | Fox News", "locations": ["R-Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Charles Grassley", "Obama"], "text": "Gov't watchdogs urge Congress to reverse Obama administration IG crackdown Published August 04, 2015 Facebook 0 Twitter 0 livefyre Email Print At left, Sen. Charles Grassley, R-Iowa. (Reuters) \nWASHINGTON – Nearly six-dozen watchdog agencies are asking Congress to step in after the Obama administration clamped down on access to government records they say are vital for their investigations into waste, fraud and abuse. \nThe Council of the Inspectors General on Integrity and Efficiency sent an Aug. 3 letter to congressional leaders ahead of a hearing scheduled for Thursday where they will ask lawmakers to pass legislation reversing a controversial decision made July 20 by the Department of Justice’s Office of Legal Counsel. The OLC is now requiring investigators to get permission to review sensitive documents from the very agencies they are monitoring. \nThis decision, the letter said, \"represents a serious threat to the independent authority\" of all inspectors general. \nIGs are assigned to audit and conduct internal reviews of federal agencies, and recently have been responsible for investigating the IRS targeting scandal, TSA security gaps, personal email use at the State Department and other issues. \nThe council represents about 70 IG offices across the government, including for the Federal Communications Commission, the National Security Agency and the Consumer Financial Protection Bureau. While the July 20 ruling applies to the DOJ, some are worried it will prompt other departments to set similar restrictions. \nDOJ spokeswoman Emily Pierce countered the claims, saying the ruling still allows investigators to get sensitive information. More on this... Oversight Committee holds hearing on Inspectors General \n\"The Department has long held the position that the Inspector General should have access to all the information it needs to perform its essential oversight function,\" she said in a statement. \"Consistent with this view, Department leadership has implemented procedures to ensure that the Inspector General receives sensitive law enforcement information in a timely manner. Additionally, the Department is committed to working with Congress and the Inspector General on legislation to address any gaps in the law that may hamper the Inspector General's ability to access such information in a timely manner.\" \nThe 68-page memo makes clear, though, that access IG investigators had in the past involving credit information as well as sensitive grand jury testimony could hinge going forward on whether the department allows it. \nOn Capitol Hill, Sens. Chuck Grassley, R-Iowa, and Ron Johnson, R-Wisc., as well as Reps. Bob Goodlatte, R-Va., and John Conyers, D-Mich., said the DOJ rule is a clear violation of the Inspector General Act of 1978. \nGrassley accused the DOJ of already denying and delaying IG access related to the notorious “Operation Fast and Furious” scandal as well as “sex parties” involving Drug Enforcement Administration agents. \nIn the Aug. 3 letter sent to lawmakers, the inspectors general asked Congress to pass a new law that would “unambiguously state and provide what we in the Inspector General community have long understood – that no law or provision restricting access to information applies to Inspectors General unless the law or provision expressly so states.” \n“Without timely and unfettered access to all necessary information, Inspectors General cannot ensure that all government programs and operations are subjected to exacting and independent scrutiny,” the letter said. “Refusing, restricting, or delaying an Inspector General’s independent access may lead to incomplete, inaccurate, or significantly delayed findings and recommendations, which in turn may prevent the agency from promptly correcting serious problems and pursuing recoveries that benefit taxpayers, and deprive Congress of timely information regarding the agency’s activities.” \nThe letter goes on to say the restrictions could “impede or otherwise inhibit investigations and prosecutions” related to agency operations. \nThe backlash from the July 20 ruling was almost immediate – with the harshest criticism coming from DOJ Inspector General Michael Horowitz himself. \n“I strongly disagree with the OLC opinion,” Horowitz said in a statement following the ruling. “Congress meant what it said when it authorized Inspectors General to independently access ‘all’ documents necessary to conduct effective oversight. … Without such access, our office’s ability to conduct its work will be significantly impaired.” \nHorowitz, who chairs the Council of Inspectors General on Integrity and Efficiency, said the new rules might actually increase cases of fraud, waste and abuse. \nThe inspectors general of the Internal Revenue Service, U.S. Capitol Police and the Government Printing Office did not sign the letter. Most IGs did. Advertisement ", "external_links": [], "published": "2015-08-04T23:08:00.000+03:00", "crawled": "2015-08-04T23:08:57.163+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}