{"organizations": [], "uuid": "979b1b250fa4e688228e6352fb94fb8f8a8e1418", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150630172237-jeb-bush-june-29-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/08/03/politics/jeb-bush-immigration-policy-2016/index.html", "country": "US", "title": "Jeb Bush immigration policy: How he'd secure the border", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Jeb Bush immigration policy: How he'd secure the border - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "979b1b250fa4e688228e6352fb94fb8f8a8e1418"}, "author": "Ashley Killough", "url": "http://www.cnn.com/2015/08/03/politics/jeb-bush-immigration-policy-2016/index.html", "ord_in_thread": 0, "title": "Jeb Bush immigration policy: How he'd secure the border", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Jeb Bush used Medium on Monday to outline his plans for immigration He listed six proposal including cracking down on sanctuary cities and deporting immigrants who've overstayed their visas (CNN) Cracking down on sanctuary cities, deporting immigrants who've overstayed their visas and installing more bases at the border would be key elements to Jeb Bush's immigration policy if elected president, the former Florida governor wrote Monday in a Medium post .\nBush, who's made immigration a key focus of his White House bid, outlined six proposals to enhance border security and enforce immigration law, arguing that all six would receive \"bipartisan support in Congress.\"\nSanctuary cities, which ignore federal requests to detain people found to be in the country illegally, have gained renewed attention after a San Francisco woman was killed last month allegedly by an undocumented immigrant who had been repeatedly deported .\nRELATED: Suspect tells TV station he killed San Francisco woman\nBush called for withholding federal law enforcement funds for such cities and \"make sure we detain and deport illegal immigrants who are serious criminals.\"\nHe also supported identifying and deporting immigrants who have overstayed their visas and proposed creating a biometric exit system that would help officials locate such individuals in the future.\nPutting more patrol bases on the border where they can be stationed for days at a time, rather than being situated farther inland, would also help, he wrote, and suggested more investment in high-tech surveillance mechanisms like drones, advanced sensors and radar— some of which is already being used at the border.\nBush argued that improving existing roads that border agents use would improve the situation, adding that \"new roads are needed on the border to secure access to remote and rugged terrain to interdict smugglers.\"\nBorder patrol agents should have easier access to federal lands that sit on the border, he wrote.\n\"Currently, agents have to navigate byzantine environmental rules and regulations to access federal lands,\" he said. \"Removing these restrictions would help untie the hands of our agents to patrol every inch of the border.\"\nBush is one of the few Republican candidates willing to call for a path to legal status for many of the 11 million undocumented immigrants in the country. He's spent the past few months explaining his position on the campaign trail, facing questions from voters who've heard about his view that falls largely outside of the conservative base.\nWhile he previously supported a path to citizenship, Bush now proposes going as far \"legal status\" only.\n\"That's where we land to get it done,\" Bush told reporters last week in Orlando, talking about immigration reform.\nFollow @CNNpolitics", "external_links": ["https://medium.com/@JebBush/securing-the-border-and-enforcing-our-immigration-laws-fec3803b6821", "https://twitter.com/CNNpolitics"], "published": "2015-08-03T03:00:00.000+03:00", "crawled": "2015-08-03T18:26:56.581+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}