{"organizations": [], "uuid": "88cacf390fb560b4666c20ee81fd463ac48728d1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3258872/images/o-CLIMATE-CHANGE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/energy/feed", "section_title": "Energy on Huffington Post", "url": "http://www.huffingtonpost.com/betsy-rosenberg/potus-and-climate-change-four-steps-forward-one-step-back-but-still-missing-a-key-step_b_8050652.html", "country": "US", "title": "Betsy Rosenberg: Why Obama Is Still Missing A Key Step When It Comes To Climate Change", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Betsy Rosenberg: Why Obama Is Still Missing A Key Step When It Comes To Climate Change", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T19:23:00.000+03:00", "replies_count": 0, "uuid": "88cacf390fb560b4666c20ee81fd463ac48728d1"}, "author": "Betsy Rosenberg", "url": "http://www.huffingtonpost.com/betsy-rosenberg/potus-and-climate-change-four-steps-forward-one-step-back-but-still-missing-a-key-step_b_8050652.html", "ord_in_thread": 0, "title": "Betsy Rosenberg: Why Obama Is Still Missing A Key Step When It Comes To Climate Change", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nBarack Obama is about to leave on a historic journey that could affect Americans for generations to come - he'll become the first sitting American President to visit the Arctic to observe Alaska's rapidly melting glaciers. This trip, coming on the heels of Obama's historic clean energy plan is groundbreaking. Also poignant as it will coincide with the ten-year anniversary of Hurricane Katrina which signaled the arrival of climate change on U.S. shores-- whether Louisiana Governor Bobby Jindal wants the president to talk about it in New Orleans or not. \nOn August 13th, our Commander-in-Chief took time out from his vacation to announce the Arctic trip, declaring, \"What's happening in Alaska isn't just a preview of what will happen to the rest of us if we don't take action. It's our wake-up call -- the alarm bells are ringing. And as long as I'm President, America will lead the world to meet this threat before it's too late.\" \nThe Obama administration's Council on Environmental Quality even hosted a panel discussion on August 20th about what's being done on college campuses to educate youth about the climate crisis. This is a step in a very positive direction. However the president can't get an \"A\" in my book until his administration does something to address the eco-education gap among adults. \nThis week President Obama addressed the Clean Energy Summit in Las Vegas. He sounded like a true advocate in declaring, \"Solar isn't just for the green crowd anymore--it's for the green eyeshade crowd, too!\" in praising recent cost reductions for renewable energy. \nHowever, Obama's decision, announced last week, to grant Shell Oil the rights to drill in the Arctic seemed to fly in the face of his earlier news and left climate activists scratching their heads. Is the Obama administration trying to pull a fast one --a Shell game-- or what? That's not yet clear, and the timing is particularly puzzling since his drilling decision so closely precedes the fact-finding, glacier-gazing trip to Alaska. \nGiven the latest data showing Greenland's glaciers melting at a dizzying rate of three feet per hour, this journey comes none too soon. Not to mention that July was the hottest month EVER recorded and 2015 is set to melt records. \nYet the green light given to Shell, especially after the oil giant botched its first attempts to drill in the pristine region, seems oddly timed. What is clear is it's too soon to uncork the champagne in celebration. Better keep it on ice until after Obama sees the melting icebergs, drills down, and connects some more green dots. \nI put some bubbly in the fridge to chill after the President's August 3rd Clean Power Plan announcement. Comments like \"...no challenge poses a greater threat to our future and future generations than a changing climate,\" \"There is such a thing as being too late when it comes to climate change,\" and \"We only get one home, one planet,\" and \"There's no plan B\" showed that Obama understands the importance of this crisis, and also its immediacy. \nWhat rocked my world most about Obama's announcement was that CNN carried it live. Millions around the country and world got the full impact in real time - similar to the Pope's pivotal encyclical on climate change. Getting the mainstream news to report on growing threats from a changing climate and other eco-existential challenges is paramount. It's been a commitment of mine for more than a decade to bring this to fruition. \nAs a former CBS Radio reporter and anchor who left breaking news to cover our breaking planet and emerging eco-evolution as an independent radio host/producer, I can attest to the fact that there is zero programming on any commercial broadcast network - radio OR television - that covers these critical environmental changes. \nI call this astonishing media void the \"glaring green gap\" and have been trying to fill it for more than a decade. After producing and hosting more than 2,500 shows on the former Air America network (left of center) between 2004-2007 and later independently on the internet, archived at www.thegreenfront.com and www.ecotalkradio.com, I have experienced first hand how much there is to learn and report on, both in terms of challenges...and solutions. \nThere are at least \"50 Shades of Green\" both in range of topics (from garbage to GMO's to global warming) and \"E\"-list guests. Eco-leaders like Al Gore, Robert Kennedy Jr., Van Jones, climate scientists including Dr. Jim Hansen and Dr. Katherine Hayhoe, writers Francis Moore Lappe and Elizabeth Kolbert, and Senators John Kerry, Barbara Boxer, Bernie Sanders have all been interviewed on my programs, but they represent just a tip of the melting iceberg when it comes to credible and compelling voices for our embattled environment. Passionate experts on these topics must be heard by the masses in order to broaden our understanding, widen the conversation and prompt restorative action. \nIt's worth noting that not one of the questioners or candidates in the August 6 Fox News Channel \"prime-time\" GOP presidential debate mentioned the climate crisis, energy or the environment, other than Jeb Bush taking a jab at opponents to the Keystone pipeline. And just ahead of the President's visit to New Orleans Thursday Louisiana Governor Bobby Jindal warned against linking Katrina to climate change. \nKeep in mind that Jeb Bush's low-lying State of Florida is predicted to be the first U.S. casualty of rising sea levels. No one who watched the debate heard any discussion about the need to scale back our carbon emissions to 350 parts per million. \nJust imagine how many millions would get a critical education and quick wake-up call on our shared eco-reality if the TLC network replaced its cancelled hit reality show \"19 Kids and Counting\" with a program called \"400 Parts Per Million and Rising.\" Now that might get America to wake up and smell the carbon! \nFollow Betsy Rosenberg on Twitter: www.twitter.com/greenfront More:", "external_links": [], "published": "2015-08-28T19:23:00.000+03:00", "crawled": "2015-08-29T06:23:31.086+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}