{"organizations": ["Fox News Latino", "Fox News"], "uuid": "b9a66905c0d4d7c3b20e967c364be767d2f073c0", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/GOP%202016%20Bush%20Telemun_Garc.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/02/in-first-spanish-language-interview-bush-fielded-questions-on-foreign-policy/", "country": "", "title": "In first Spanish-language interview, Jeb Bush promises to make immigration a top priority | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "In first Spanish-language interview, Jeb Bush promises to make immigration a top priority | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T06:40:00.000+03:00", "replies_count": 0, "uuid": "b9a66905c0d4d7c3b20e967c364be767d2f073c0"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/02/in-first-spanish-language-interview-bush-fielded-questions-on-foreign-policy/", "ord_in_thread": 0, "title": "In first Spanish-language interview, Jeb Bush promises to make immigration a top priority | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush"], "text": "In first Spanish-language interview, Jeb Bush promises to make immigration a top priority Published August 02, 2015 Fox News Latino \nMIAMI (AP) – In his first Spanish-language television network interview since launching his 2016 presidential campaign, Republican presidential candidate Jeb Bush fielded questions ranging from the upcoming presidential debate to Donald Trump, from Latin American foreign policy to his favorite music, and whether he had ever experienced discrimination. \nBush shared the experience his son George P. Bush, who is now 39, had when he and his Hispanic teammates traveled north to Ocala, Florida, to play in a baseball game. \n\"George, he's dark-skinned, and they spoke horrible things about those from Miami,\" Bush recalled, without offering details. \"I had to explain ... that people who hate are not the majority, and we must accept them and move forward.\" \nThe interview with Telemundo's \"Enfoque con Jose Diaz-Balart\" (\"In focus with Jose Diaz-Balart\") airs Sunday at noon EDT. Telemundo provided a translated transcript of the interview to The Associated Press. \nBush, who is fluent in Spanish and speaks the language at home with his Mexican wife, Columba, has been busy this week courting minority voters. \nOn Friday, he spoke to hundreds attending the National Urban League in Fort Lauderdale and last Monday was in central Florida at a luncheon with a diverse group of pastors and other religious leaders, many of whom were Puerto Rican. \nWhen asked in the Telemundo interview about billionaire Republican rival Donald Trump, who several national polls show is leading the GOP presidential race, Bush said \"I'm not too concerned about that.\" \nHe said he planned to focus on his record as Florida governor at Thursday's Republican debate in Cleveland, the first of the 2016 presidential campaign. As governor, he said, he cut taxes, reformed education and grew the Florida economy. \nPressed by Diaz-Balart about immigration reform, Bush promised he would make the issue a top priority if elected president. \n\"To arrive here legally has to be easier than to arrive here illegally,\" said Bush. Like other Republicans, he wants to see U.S. borders secured before allowing the country's estimated 11 million immigrants in the U.S. illegally to obtain legal status. \"I know we can do it,\" he said. \nBush said immigrants in the country illegally would have to pay \"a small fine\" and learn English to remain in the country as legal residents, and would not be eligible for government benefits. \nOn foreign affairs, Bush was critical of President Barack Obama's new Cuba policy, wants the U.S. to be more active in its support of dissidents in Cuba and Venezuela, and said Congress must act to help Puerto Rico deal with its debt crisis. \n\"We should assist as much as we can,\" Bush said of Puerto Rico. \nAs for his favorite music, Bush said he loved country, Christian, rap and Latin. He said he became a recent fan of Pitbull, the wildly popular bilingual rapper from Miami (\"I listen to his music\") and has been a longtime fan of Michael W. Smith, a Grammy-winning Christian music star (\"Got a great voice\"). \nLike us on Facebook ", "external_links": [], "published": "2015-08-03T06:40:00.000+03:00", "crawled": "2015-08-03T06:40:30.236+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}