{"organizations": [], "uuid": "797dbfc7cd73e069b2df6baadf8d1a05ccd1a1b5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d08b05170000b7005679bc.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-could-act-on-iran-deal-without-congressional-approval_55d08aa2e4b07addcb4334d0", "country": "", "title": "Obama Could Act On Iran Deal Without Congressional Approval", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Could Act On Iran Deal Without Congressional Approval", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T19:41:00.000+03:00", "replies_count": 0, "uuid": "797dbfc7cd73e069b2df6baadf8d1a05ccd1a1b5"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-could-act-on-iran-deal-without-congressional-approval_55d08aa2e4b07addcb4334d0", "ord_in_thread": 0, "title": "Obama Could Act On Iran Deal Without Congressional Approval", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["DEB RIECHMANN"], "text": "Obama Could Act On Iran Deal Without Congressional Approval By DEB RIECHMANN Posted: 08/16/2015 09:15 AM EDT | Edited: 3 hours ago \n\n\n\nThe September vote on the Iran nuclear deal is billed as a titanic standoff between President Barack Obama and Congress. Yet even if lawmakers reject the agreement, it's not game-over for the White House. \nA congressional vote of disapproval would not prevent Obama from acting on his own to start putting the accord in place. While he probably would take some heavy criticism, this course would let him add the foreign policy breakthrough to his second-term list of accomplishments. \nObama doesn't need a congressional OK to give Iran most of the billions of dollars in relief from economic sanctions that it would get under the agreement, as long as Tehran honors its commitments to curb its nuclear program — at least for now. \n\"A resolution to disapprove the Iran agreement may have substantial political reverberations, but limited practical impact,\" says Robert Satloff, executive director of the Washington Institute for Near East Policy. \"It would not override President Obama's authority to enter into the agreement.\" \nLawmakers on their summer break are deciding how to vote. A look at the current state of play: \n___ \nWHAT WILL HAPPEN IN SEPTEMBER? \nWith Republicans controlling both chambers of Congress, the House and Senate are expected to turn down the deal. \nObama has pledged to veto such a resolution of disapproval, so the question has turned to whether Congress could muster the votes to override him, in what would be a stinging, bipartisan vote of no-confidence against the president. And Obama would forfeit the authority he now enjoys to waive sanctions that Congress has imposed. \nBut Democrats and Republicans have predicted that his expected veto will be sustained — that opponents lack the votes to one-up Obama. More than half of the Senate Democrats and Independents of the 34 needed to sustain a veto are backing the deal. There is one notable defection so far — New York's Chuck Schumer, the No. 3 Democrat in the Senate and the party leader-in-waiting. \nIn the House, more than 45 Democrats have expressed support. Democratic leader Nancy Pelosi of California has spoken confidently about rounding up the votes to save the deal. Ten House Democrats have announced their opposition. \n___ \nWHAT CAN OBAMA DO ON HIS OWN? \nThe president could suspend some U.S. sanctions. He could issue new orders to permit financial transactions that otherwise are banned now. On the financial sector, Obama could use executive orders to remove certain Iranians and entities, including nearly two dozen Iranian banks, from U.S. lists, meaning they no longer would be subject to economic penalties. \nOnly Congress can terminate legislative sanctions, and they're some of the toughest, aimed at Iran's energy sector, central bank and essential parts of its economy. Still, experts say Obama, on his own, can neutralize the effect of some of those sanctions, too, and work with the Europeans on softening others. \n\"Obama can give most of the sanctions relief under the agreement through executive order,\" said Mark Dubowitz, a leading sanctions proponent with the Washington-based Foundation for Defense of Democracies. \nIf Obama and the Europeans erase the Iranian banks from the sanctions list, those institutions would regain access to the global financial system. \n___ \nWHAT ARE SOME OF THE QUESTIONS BEING DISCUSSED IN CONGRESS? \nThe September votes won't be the final word. \nOne looming question is whether Congress should try to reauthorize the Iran Sanctions Act, which authorizes many of the congressional sanctions. \nSens. Bob Menendez, D-N.J., and Mark Kirk, R-Ill., have introduced legislation to renew it. Menendez says that if administration is serious about reimposing sanctions if Iran cheats, there has to be something to \"snap back to.\" \nIran could interpret a U.S. move to reauthorize the law as a breach of the nuclear agreement. Administration officials won't say whether it is or isn't, only that it's premature to address it. \nShould Congress push for a different deal? The administration says renegotiating the agreement is a nonstarter. \nIn a webcast, Energy Secretary Ernest Moniz told members of the Jewish Federations across North America and the Jewish Council of Public Affairs that trying to renegotiate the deal was \"about the riskiest strategy\" he could imagine. \"I just don't think that's a credible Plan B.\" \nSchumer and others opponents think the administration should go back to the bargaining table. \nOver history, Congress has rejected outright or demanded changes to more than 200 treaties and international agreements, including 80 that were multilateral. \n", "external_links": [], "published": "2015-08-16T19:41:00.000+03:00", "crawled": "2015-08-16T19:41:31.216+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}