{"organizations": [], "uuid": "27e1e029a7e95df3e10fa0f46bd08570f36dc8f2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c11b3914000077002e1f18.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/news.xml", "section_title": "WorldPost News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-netanyahu-iran-nuclear-deal_55c11a39e4b0a50ad0aacf85", "country": "US", "title": "Obama, Netanyahu Make Dueling Appeals To American Jews", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama, Netanyahu Make Dueling Appeals To American Jews", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T23:09:00.000+03:00", "replies_count": 0, "uuid": "27e1e029a7e95df3e10fa0f46bd08570f36dc8f2"}, "author": "Eline Gordts", "url": "http://www.huffingtonpost.com/entry/obama-netanyahu-iran-nuclear-deal_55c11a39e4b0a50ad0aacf85", "ord_in_thread": 0, "title": "Obama, Netanyahu Make Dueling Appeals To American Jews", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama, Netanyahu Make Dueling Appeals To American Jews Both leaders sought support for their positions on the Iran nuclear deal. Posted: 08/04/2015 04:09 PM EDT Israeli Prime Minister Netanyahu listens as President Barack Obama speaks in the Oval Office. | Credit: Pablo Martinez Monsivais/Associated Press \nWASHINGTON (AP) — President Barack Obama and Israeli Prime Minister Benjamin Netanyahu were making dueling appeals to the American Jewish community Tuesday as they sought to rally support for their opposing positions on the Iranian nuclear deal. \nNetanyahu made his case in a live webcast with more than 10,000 participants, according to the U.S. Jewish groups that organized the event. The prime minister railed against the agreement to curb Iran's nuclear program in exchange for billions of dollars in sanctions relief, calling it a \"bad deal\" that leaves Tehran on the brink of a bomb. \n\"The nuclear deal with Iran doesn't block Iran's path to the bomb,\" he said. \"It actually paves Iran's path to the bomb.\" \nNetanyahu, one of the fiercest critics of the nuclear accord, also disputed Obama's assertion that opponents of the diplomatic deal favor war. He called that assertion \"utterly false,\" saying Israel wants peace, not war. \nObama was to hold a private meeting at the White House later Tuesday with Jewish leaders — some who support the deal, some who oppose it, and others whose organizations are undecided. \nThe direct appeals from Obama and Netanyahu come amid an intense lobbying campaign on Capitol Hill, where lawmakers plan to vote on the nuclear deal next month. The vote will be one of Congress' most significant national security decisions in recent years. \nThe White House is preparing for the likelihood that lawmakers will vote against the deal and is focusing its lobbying efforts on getting enough Democrats to sustain a veto. Only one chamber of Congress is needed to sustain a veto. \nObama spokesman Josh Earnest said Monday that the White House is confident it can sustain a veto \"at least in the House.\" \nThe president got a boost in the Senate Tuesday with Sen. Barbara Boxer of California and Sen. Tim Kaine of Virginia — both members of the Senate Foreign Relations Committee — announcing their support for the deal. \nObama also planned to give a speech Wednesday outlining what he sees as the strengths of the nuclear deal. \nAlso on HuffPost:", "external_links": [], "published": "2015-08-04T23:09:00.000+03:00", "crawled": "2015-08-04T23:37:50.368+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}