{"organizations": [], "uuid": "faca854a9453c521635acb0593f0a307d1ef010d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama1_080315getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/250542-obama-doubles-down-on-comparing-gop-to-iranian-hardliners", "country": "US", "title": "Obama defends comparing GOP to Iranian hardliners", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama defends comparing GOP to Iranian hardliners", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T16:06:00.000+03:00", "replies_count": 0, "uuid": "faca854a9453c521635acb0593f0a307d1ef010d"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/250542-obama-doubles-down-on-comparing-gop-to-iranian-hardliners", "ord_in_thread": 0, "title": "Obama defends comparing GOP to Iranian hardliners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama defends comparing GOP to Iranian hardliners Getty Images By Jordan Fabian - 08/07/15 09:06 AM EDT \nPresident Obama is doubling down on his comparison of Republicans with Iranian hardliners who oppose the Iran nuclear deal. \n\"What I said is absolutely true, factually,\" Obama told CNN's Fareed Zakaria in an interview that will air Sunday. \n\"The truth of the matter is, inside of Iran, the people most opposed to the deal are the Revolutionary Guard, the Quds Force, hardliners who are implacably opposed to any cooperation with the international community,\" Obama added. \nThe president inflamed his critics with his tough tone in a major speech on Wednesday defending the Iran deal. ADVERTISEMENT Obama linked congressional Republicans opposed to the deal with Iranian hardliners who chant “death to America,” saying they are “making a common cause with the Republican caucus.”\nLawmakers will vote in September on a resolution to approve or disapprove of the deal. With almost every Republican in Congress, Obama is making a hard sell to Democrats to uphold a veto of a measure killing the deal. \nSenate Majority Leader Mitch McConnell (R-Ky.) dismissed Obama's claim that the only alternative to the deal is war as an \"absurd argument.\" \n\"That's never been the alternative,\" he said. \"It's either this deal or a better deal, or more sanctions, and I think that's been a huge mistake on his part.\" \nRepublicans' reluctance to consider the deal is the same stance taken by hard-liners in Iran, Obama told CNN. \n\"The reason that Mitch McConnell and the rest of the folks in his caucus who opposed this jumped out and opposed this before they even read it, before it was even posted, is reflective of a ideological commitment not to get a deal done,\" Obama said. \n\"In that sense they do have much more in common with the hardliners who are much more satisfied with the status quo.\"", "external_links": [], "published": "2015-08-07T16:06:00.000+03:00", "crawled": "2015-08-07T16:30:31.100+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}