{"organizations": [], "uuid": "0f15a0b7a84e3ee4780ae2854fb0cd3d277c6713", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/stokeslouis.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/251462-obama-mourns-passing-of-former-rep-louis-stokes", "country": "US", "title": "Obama mourns passing of former Rep. Louis Stokes", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama mourns passing of former Rep. Louis Stokes", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T20:16:00.000+03:00", "replies_count": 0, "uuid": "0f15a0b7a84e3ee4780ae2854fb0cd3d277c6713"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/251462-obama-mourns-passing-of-former-rep-louis-stokes", "ord_in_thread": 0, "title": "Obama mourns passing of former Rep. Louis Stokes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama mourns passing of former Rep. Louis Stokes By Jordan Fabian - 08/19/15 01:16 PM EDT President Obama on Wednesday mourned the passing of former Rep. Louis Stokes, the first black congressman elected from Ohio. “Lou leaves behind an indelible legacy in the countless generations of young leaders that he inspired, and he will be sorely missed,” the president said in a statement. ADVERTISEMENT Stokes died at his home Tuesday at the age of 90, one month after announcing he had been diagnosed with brain and lung cancer, The Associated Press reported . Stokes’s wife, Jay, was at his side when he passed away. The Ohio Democrat was a founding member of the Congressional Black Caucus. He rose to prominence leading a congressional committee that investigated the assassinations of former President John F. Kennedy and civil rights leader Martin Luther King Jr. He formed a powerful alliance with his younger brother, Carl, who was the first black mayor elected in a major U.S. city when he was elected mayor of Cleveland in 1968. “Lou believed deeply in fairness and the idea that every American should have the same opportunity to succeed,” Obama said. “Growing up in Depression-era Cleveland with his mother and brother Carl, Lou triumphed over hardship to become a passionate voice for those less fortunate.” Past: 1 day Clinton pulls plug on testy... Clinton joked when asked if she had wiped her server of information. Clinton probe tests FBI chief James Comey is being thrust into the spotlight amid the controversy over... Surging Ben Carson looks to peel... Ben Carson has his sights set on Donald Trump. Trump strengthens lead atop GOP... Trump, who saw his favorability tick upward in new poll, leads on several... WATCH: Rubio hits kid in face with... Sen. Marco Rubio (R-Fla.) may have attended college on a football... Iowa State Fair attendees pick... Donald Trump led Republicans and the butter cow came in third for fair... White House appoints first openly... Raffi Freedman-Gurspan will serve in the White House Office of... Hackers release stolen... The website geared toward people looking to cheat on their spouses was... Juan Williams: Tea Party could... OPINION: Hard-line conservatives are putting centrist Republican senators... Josh Groban sings Donald Trump's... Josh “Voice of an Angel” Groban was on \"Jimmy Kimmel Live\" Monday night. Some Clinton server data may be... The FBI \"will try to figure what's there, how it got there and who put it... Walker unveils plan to replace... Walker would rely on states to decide which healthcare reforms to... Bald first lady? Michelle Obama’s... The first lady's appearance on the TV quiz show had fans scratching their... Sanders: Media should stop... Sanders said the media should focus on more \"serious\" issues. Clinton tells Black Lives Matter... Clinton is seen in a new video advising activists to define their agenda. The man behind Ben Carson While not part of the campaign, Armstrong Williams is nonetheless a steady... Sharpton calls for black churches... Sharpton is launching his push backing President Obama’s pact with Tehran...", "external_links": [], "published": "2015-08-19T20:16:00.000+03:00", "crawled": "2015-08-19T20:26:34.090+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}