{"organizations": [], "uuid": "668cc7b89a54bfbfbfc19089e5c41ed07b5248a3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c235511700006e00566a80.png", "site_section": "http://www.huffingtonpost.com/tag/medical-marijuana/feed", "section_title": "Medical Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/entry/video-cops-marijuana-candy_55d4d630e4b0ab468d9f7f2a?kvcommref=mostpopular", "country": "US", "title": "Judge Says Video Allegedly Showing Cops Eating Marijuana Candy Can Be Used As Evidence", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Judge Says Video Allegedly Showing Cops Eating Marijuana Candy Can Be Used As Evidence", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T21:54:00.000+03:00", "replies_count": 0, "uuid": "668cc7b89a54bfbfbfc19089e5c41ed07b5248a3"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/video-cops-marijuana-candy_55d4d630e4b0ab468d9f7f2a?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Judge Says Video Allegedly Showing Cops Eating Marijuana Candy Can Be Used As Evidence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Judge Says Video Allegedly Showing Cops Eating Marijuana Candy Can Be Used As Evidence An internal investigation of three California police officers can use security camera footage from a dispensary raid. Matt Ferner National Reporter, The Huffington Post Posted: 08/19/2015 06:54 PM EDT \nLOS ANGELES -- An Orange County Superior Court judge ruled Wednesday that a controversial surveillance video allegedly showing three police officers eating marijuana-infused candy and mocking a disabled woman during a May dispensary raid can be used in an internal investigation by the Santa Ana Police Department. \nThe unidentified officers and their union, the Santa Ana Police Officers Association, filed a temporary restraining order earlier this month to block the video from being used in an ongoing internal investigation of the officers' conduct during the raid. The police argued their privacy was violated when surveillance cameras recorded them inside Sky High Holistic medical marijuana dispensary after they thought they had disabled all of them. \nSuperior Court Judge Ronald Bauer rejected that notion on Wednesday, the Orange County Register first reported, saying that the officers had \"no objectively reasonable expectation\" that their actions and words during the raid would not be observed. \n\"[The officers] should not expect privacy in their on-duty performance of an official function at a marijuana dispensary,\" Bauer ruled. \"They have made no claim that their work required secrecy or that it would be impeded by public view.\" \nMatthew Pappas, the dispensary's attorney, said the ruling is a critical victory for holding police and public officials accountable for their actions. \n\"This ruling shows that the court had the courage to say 'no' to a very powerful police officer union and stand up for the rights of people when bad things like this happen,\" Pappas told The Huffington Post. \nPappas released edited footage of the May 27 raid in June that was published by various local news outlets. The edited video, which can be seen above, shows officers busting down the door and ordering everyone to the ground at gunpoint. \nThe footage, according to Pappas, shows police unsuccessfully disabling the shop's surveillance cameras, which go on to record the officers playing darts, eating something -- which he argues is marijuana-infused food -- and making a joke about an amputee who uses a wheelchair. \n\"Did you punch that one-legged old Benita?\" one police officer asks. \n\"I was about to kick her in her fucking nub,\" a female officer replies, to laughter. \nCorey Glave, the attorney representing the officers and their union, argued that the video was edited to distort the officers' behavior during the raid. He previously told HuffPost that at least one officer voluntarily took and passed a drug test, the results of which were provided to the SAPD. \nPappas denied the video was doctored. The full video is more than 12 hours long, he said, so he released edited versions with subtitles to show what officers were allegedly saying. The entire video has been made available to the police department and that they have seen the full, unaltered version, Pappas added. \nSky High Holistic has filed a multi-million dollar lawsuit against the police department, alleging that the officers used excessive force during the raid. The dispensary is also seeking the return of its property seized during the raid -- which includes marijuana, cannabis-infused edibles and thousands of dollars in cash. A hearing regarding the return of the seized property is scheduled for Friday. \nGlave and SAPD did not immediately respond to request for comment following the judge's ruling. \nAlso On HuffPost: 27 Reasons Why U.S. Shouldn't Lead The War On Drugs of", "external_links": [], "published": "2015-08-19T21:54:00.000+03:00", "crawled": "2015-08-20T07:32:12.291+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}