{"organizations": [], "uuid": "a1a3e8a3dffe4a952c07688da2f2de572f82c9d6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d744451d00002f0014579f.jpeg", "site_section": "http://www.huffingtonpost.com/tag/healthy-living-health-news/feed", "section_title": "Healthy Living Health News on Huffington Post", "url": "http://www.huffingtonpost.com/entry/unsafe-abortions-developing-world-texas_55d4ef95e4b055a6dab2c84e?kvcommref=mostpopular", "country": "US", "title": "Here's What An Unsafe Abortion Environment Does To Women's Health", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Here's What An Unsafe Abortion Environment Does To Women's Health", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T14:37:00.000+03:00", "replies_count": 0, "uuid": "a1a3e8a3dffe4a952c07688da2f2de572f82c9d6"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/unsafe-abortions-developing-world-texas_55d4ef95e4b055a6dab2c84e?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Here's What An Unsafe Abortion Environment Does To Women's Health", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here's What An Unsafe Abortion Environment Does To Women's Health In case you, or Texas, needed a reminder. Erin Schumaker Healthy Living Editor, The Huffington Post Posted: 08/21/2015 11:37 AM EDT | Edited: 50 minutes ago \nEvery year, 7 million women in the developing world are treated for complications from unsafe pregnancy termination. These complications can include heavy bleeding, infection and sepsis, as well as more severe conditions, such as lacerations or uterine perforation, that can put a woman's life at risk. \nUnsafe abortions account for between 8 and 15 percent of maternal deaths in developing countries , making them the leading cause of maternal mortality, according to a new report. \n\"It's a big health issue for women in most countries in the developing world,\" said Susheela Singh, vice president for research at the Guttmacher Institute and the lead author of the report, which was just published in BJOG: An International Journal of Obstetrics & Gynecology. Tom Williams A group from Texas display their flags during a rally on the Mall for the March for Life anti-abortion demonstration. \nSingh and her fellow researchers hope the United Nations will consider their study, and the issue of unsafe abortion, when it meets to agree on global public health goals. Because unsafe abortion is a sensitive and often stigmatized public health topic, it's often sidelined at global meetings where countries have to come to an agreement on health -- and where countries frequently opt in favor of recognizing easier aspects of women's health, such as maternal care. \nBut anti-abortion activists in the United States ( we're looking at you, Texas ) could stand to take a few pointers from the new study, too. As the BJOG report shows, lack of access to abortion clinics doesn't result in fewer abortions -- it results in unsafe abortions. This is what an unsafe abortion looks like in 2015: There are several types of unsafe abortions According to Singh, unsafe pregnancy terminations are either performed by individuals without formal training or are procedures that take place in unhygienic facilities. Some women try to perform self-abortions by taking strong substances or drugs, or by inserting foreign objects into their bodies in an effort to terminate their pregnancy. Such unsafe practices can have grave health consequences. \"Even what we would normally think of as a safe procedure, like a manual vacuum aspiration or a D&C, depending on if the person has training, it could be it's not done safely,\" she said. \nThe availability of medical abortion , or using medication to terminate an early pregnancy, is one important improvement of the last decade over the kinds of methods women were using in the past. Still, women aren't getting the correct information on how to use the medication. This is in part because pharmacists don't always know the correct protocols for the drugs themselves, according to a small study of pharmacy workers in Bangladesh , published in the International Journal of Gynecology & Obstetrics in 2014. The rate of unsafe abortions in the developing world is likely two or three times higher than the rate of treatment. Unsafe abortion rates vary greatly The study used health data and previous research from 26 countries to calculate the number of women who sought health care treatment from unsafe abortions in 2012. Since the data doesn't include women who didn't have complications from their unsafe abortions, 7 million should be considered a minimum estimate of unsafe abortions occurring in the developing world. Among the 26 developing countries in the study, Pakistan had the highest rate of treatments for unsafe abortions (14.6 per 1,000 women ages 25 to 44) and Brazil had the lowest rate (2.4). In reality, the rate of unsafe abortions in the developing world is likely two or three times higher than the rate of treatment, according to Singh. What Texas can learn from Pakistan Abortion clinics have been closing rapidly in Texas , according to the New York Times. In 2015 the state had only 17 abortion clinics, down from 41 in 2012, meaning the average Texas county is now 111 miles from the closest clinic. Meanwhile, legislation in Mississippi and North Dakota , among other U.S. states, is also aim reducing abortion access. If the BJOG study, and Pakistan in particular, is any evidence, the belief of some lawmakers that limiting women's access to abortion clinics will decrease the number of abortions is unfounded. \"When women want to end a pregnancy they find a way,\" Singh said. \"One lesson from this study is that even in countries with very restrictive laws, women are still seeking abortions. The problem is, it’s more likely to be unsafe.\"", "external_links": [], "published": "2015-08-21T14:37:00.000+03:00", "crawled": "2015-08-21T20:00:00.063+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}