{"organizations": [], "uuid": "5a7b1c1573413b744ae0e718c56deddc1facfd36", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/politics/", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/08/28/obama-expects-better-us-israel-ties-after-iran-deal-in-place/", "country": "US", "title": "Obama expects better US-Israel ties after Iran deal in place", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama expects better US-Israel ties after Iran deal in place | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "5a7b1c1573413b744ae0e718c56deddc1facfd36"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/08/28/obama-expects-better-us-israel-ties-after-iran-deal-in-place/", "ord_in_thread": 0, "title": "Obama expects better US-Israel ties after Iran deal in place", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 28, 2015 Associated Press Email Print President Barack Obama on Friday compared tensions between the U.S. and Israel over the Iranian nuclear deal to a family feud and said he expects improvements in ties between the longtime allies to come quickly after the accord is implemented.\n\"Like all families, sometimes there are going to be disagreements,\" Obama said in a webcast with Jewish Americans. \"And sometimes people get angrier about disagreements in families than with folks that aren't family.\"\nThe president also encouraged skeptics of the agreement to \"overcome the emotions\" that have infused the debate and evaluate the accord based on facts.\n\"I would suggest that in terms of the tone of this debate everybody keep in mind that we're all pro-Israel,\" he said. \"We have to make sure that we don't impugn people's motives.\"\nThe president's comments came as momentum for the Iran accord grows on Capitol Hill, where lawmakers will vote next month on a resolution to disapprove of the deal. Sen. Tom Carper, D-Del., on Friday became the 30th senator to announce support for the deal, calling it a good deal for America and allies including Israel.\nIf Senate Democrats can amass 41 votes in favor of the agreement, they could block passage of the disapproval resolution. If that doesn't happen and the GOP-led Senate votes to disapprove of the deal, Obama has vowed to veto it. Democrats then would need 34 votes -- four more than they have now -- to prevent a congressional override of the presidential veto.\nIsrael Prime Minister Benjamin Netanyahu, one of the fiercest critics of the nuclear agreement, participated in an event hosted by the same Jewish organizations earlier this month. While Obama and Netanyahu have never had a warm relationship, the U.S. president's pursuit of diplomacy with Iran has deeply strained ties between the leaders.\nObama has said once the nuclear accord is implemented, he expects \"pretty quick\" improvements in U.S.-Israeli relations. He called for resuming talks with Israel over ways to boost its security, discussions Israeli officials say they don't want to have now because they would imply acceptance of the nuclear accord.\nThe U.S. negotiated alongside Britain, France, Germany, Russia and China for nearly two years before finalizing a landmark accord to curb Iran's nuclear program.", "external_links": ["http://www.ap.org/"], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-29T04:09:02.174+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}