{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "0c6742bf2d099c91483e9f548f9216fda775c5db", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/100814/0/0/100814_sr_hof_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2014/10/09/ebola-outbreak-why-obama-is-allowing-ebolaphobia-to-spread.html", "country": "", "title": "Ebola outbreak: Why Obama is allowing Ebolaphobia to spread | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Ebola outbreak: Why Obama is allowing Ebolaphobia to spread | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "0c6742bf2d099c91483e9f548f9216fda775c5db"}, "author": "", "url": "http://www.foxnews.com/opinion/2014/10/09/ebola-outbreak-why-obama-is-allowing-ebolaphobia-to-spread.html", "ord_in_thread": 0, "title": "Ebola outbreak: Why Obama is allowing Ebolaphobia to spread | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nWith the death of Thomas Eric Duncan, news of a second possible case of Ebola in the Dallas area (that of Sgt. Michael Monning) and worries that dogs and other animals could transmit Ebola, fears of a deadly epidemic in the United States are bound to accelerate. The reality is that multiple deaths from Ebola are likely in America, but the psychological toll is already far outpacing the physical one. \nAdults admit to anxiety about whether the illness could strike many more people here, and children have confided to me that they are terrified of Ebola. And what is being said is only the obvious part of the psychological virus (call it \"Ebolophobia\") that is spreading; I would venture that millions of people are already unconsciously spending mental energy to suppress their worries that the disease could infect them or those they love. \nPart of the preventive health strategy to help contain this psychological virus should be a reliable flow of information and bold policy from the Obama administration and the Centers for Disease Control and Prevention. But, already, their response lacks the necessary element of steady stewardship. And that’s because of President Obama’s continuing reticence to put America first. \n[pullquote] \nHere’s an example: A travel ban on countries like Liberia, where Ebola is epidemic, makes sense as a technique to keep the virus from accelerating here. \nSuch a travel ban would go some distance to stem the tide of Ebolophobia, too. It would symbolize our country’s intention to shore up its defenses against the illness. But President Obama is very sensitive to being defined in any way by the borders of this country. I think he sees himself as a citizen of the world and sees Americans as having infected others with our deadly economic policies for a long time, thereby inflicting untold suffering on developing nations. To now lead the way to America insulating itself from a scourge sweeping the very countries he seems to think we have preyed upon could, of course, strike him (if only unconsciously) as profoundly unfair. \nI believe the president may literally believe we should suffer along with less fortunate nations. And if he does, that is a very dangerous psychological stance from which to confront Ebola. \nLet me say this plainly, as a psychiatrist who has studied this president only from a distance: In order for President Obama to keep thinking of himself as the leader of the world — and not just the free world — it may be that our boundaries must remain porous, allowing illegal immigrants and, potentially, even diseases to flow through them. \nThe correct stance against Ebola is a medical-military one that replicates fighting a war in which the enemy has already come ashore and attacked a city — in this case, Dallas. \nThe borders should be sealed to travelers who have visited nations affected by Ebola in the last 30 days. \nThe surgeon general and a special assistant surgeon general for Ebola defense should be dispensing daily information about public health initiatives and medical research initiatives being undertaken to contain and combat the illness. \nA special national fundraising drive should be launched to pour money into virology labs to jumpstart research into an Ebola cure and a vaccine. And those exposed to Ebola who have not contracted the illness should be studied epidemiologically to discover anything they have in common — including having been vaccinated against any other virus (in case, for example, that vaccine might confer partial immunity against Ebola). \nThe toll of having a president who seems to see America as having no particular manifest destiny may be seen in the spread of ISIS abroad. And it could be seen, God forbid, in not mounting a sufficient immune defense here at home, to Ebola. Saying so, even at the risk of offending some or many, is the first step (here taken) to make it not so. \nDr. Keith Ablow is a psychiatrist and member of the Fox News Medical A-Team. ", "external_links": [], "published": "2015-08-05T03:00:00.000+03:00", "crawled": "2015-08-06T12:23:14.313+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}