{"organizations": ["U.S. Chamber of Commerce", "Green Bay Packers NFL", "General Mitchell International Airport", "Waukesha Victory Center", "National Rifle Association Leadership", "Jefferson School", "Conservative Political Action Conference", "Tampa Bay Times Forum", "House Oversight and Government Reform Committee", "GOP", "NBC", "National Governors Association", "Iowa Freedom Summit", "Milwaukee Brewers", "Sikh Religious Society", "Republican Jewish Coalition", "Sikh Temple"], "uuid": "8ecc5e577e8cf2bcc1c9bb875ef6d8df18a38419", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150820200320-scott-walker-derry-new-hampshire-house-party-large-169.jpg", "site_section": "http://www.businessinsider.com/moneygame/thehive.rss", "section_title": "The Hive", "url": "http://edition.cnn.com/2015/08/30/politics/scott-walker-northern-border-immigration-2016/index.html", "country": "US", "title": "http://www.cnn.com/2015/08/30/politics/scott-walker-northern-border-immigration-2016/index.html", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "http://www.cnn.com/2015/08/30/politics/scott-walker-northern-border-immigration-2016/index.html", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T21:52:00.000+03:00", "replies_count": 0, "uuid": "8ecc5e577e8cf2bcc1c9bb875ef6d8df18a38419"}, "author": "", "url": "http://edition.cnn.com/2015/08/30/politics/scott-walker-northern-border-immigration-2016/index.html", "ord_in_thread": 0, "title": "http://www.cnn.com/2015/08/30/politics/scott-walker-northern-border-immigration-2016/index.html", "locations": ["United States", "Missouri", "Madison", "Tampa", "Capitol Hill", "Milwaukee", "Wauwatosa", "Venetian Las Vegas", "Waukesha", "Los Angeles International Airport", "Iowa", "Florida", "D.C.", "New Hampshire", "Maryland", "Louisiana", "Wisconsin", "Washington", "West Allis", "Green Bay", "Brookfield", "St. Louis", "Des Moines", "Mexico", "U.S.", "Canada", "Austin Straubel International Airport", "Beijing", "National Harbor"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Trump", "Donald Trump", "Barack Obama", "Terry Branstad", "Mark Miller", "Bruce Rastetter", "Mary Burke", "Walker", "Liz Hourican", "Obama", "Bobby Jindal", "Tighe Barry", "Medea Benjamin", "Scott Walker"], "text": "Scott Walker says it's \"legitimate\" to discuss a U.S.-Canada border wall Most Republican rhetoric has focused on the U.S.-Mexico border Washington (CNN) It's not just the southern border: Wisconsin Gov. Scott Walker says it's \"legitimate\" to discuss building a wall separating the United States from Canada, as well. The Republican presidential contender said the idea of a northern border has come up while he has campaigned in New Hampshire. In an interview for NBC's \"Meet the Press\" available online, Walker said his tough talk to securing the borders and enforcing U.S. laws extends to the 5,525-mile Canadian border as well. It's a shift from most campaign-trail rhetoric, which has focused on the United States' border with Mexico, where millions undocumented immigrants have entered the country. 21 photos: Scott Walker's career 21 photos: Scott Walker's career Wisconsin Governor Scott Walker fields questions from Bruce Rastetter at the Iowa Agriculture Summit on March 7, 2015 in Des Moines, Iowa. Hide Caption 1 of 21 21 photos: Scott Walker's career Walker speaks at the annual Conservative Political Action Conference at National Harbor, Maryland, outside Washington, D.C. on February 26, 2015. Hide Caption 2 of 21 21 photos: Scott Walker's career Walker speaks to guests at the Iowa Freedom Summit on January 24, 2015, in Des Moines, Iowa. Hide Caption 3 of 21 21 photos: Scott Walker's career Walker speaks at his election night party November 4, 2014, in West Allis, Wisconsin. Walker defeated the Democratic challenger Mary Burke. Hide Caption 4 of 21 21 photos: Scott Walker's career Walker shakes hands with Democrat challenger Mary Burke before facing off in a debate at the WMVS-TV studios October, 17, 2014, in Milwaukee, Wisconsin. Hide Caption 5 of 21 21 photos: Scott Walker's career Walker has a scarf put on his head during a special service at the Sikh Religious Society of Wisconsin for the victims of the shooting at the Sikh Temple of Wisconsin the previous day, on August 6, 2012, in Brookfield, Wisconsin. Hide Caption 6 of 21 21 photos: Scott Walker's career Walker speaks during the Republican Jewish Coalition spring leadership meeting at The Venetian Las Vegas on March 29, 2014. Hide Caption 7 of 21 21 photos: Scott Walker's career Scott Walker (left) shakes hands with Chinese President Xi Jinping (center) before a meeting as Iowa Governor Terry Branstad (right) looks on at the Great Hall of the People in Beijing on April 15, 2013. Hide Caption 8 of 21 21 photos: Scott Walker's career Walker poses with a woman during the Republican National Convention at the Tampa Bay Times Forum on August 28, 2012, in Tampa, Florida. Hide Caption 9 of 21 21 photos: Scott Walker's career Walker prepares to cast his ballot at Jefferson School to vote in the gubernatorial recall election June 5, 2012, in Wauwatosa, Wisconsin. Hide Caption 10 of 21 21 photos: Scott Walker's career Walker (right) listens to Louisiana Gov. Bobby Jindal speak as they campaign at the Waukesha Victory Center on May 24, 2012, in Waukesha, Wisconsin. Hide Caption 21 photos: Scott Walker's career Walker addresses the National Rifle Association Leadership Forum April 13, 2012, in St. Louis, Missouri. Hide Caption 12 of 21 21 photos: Scott Walker's career Walker stands on the North Lawn of the White House before making remarks to the news media after a meeting of the National Governors Association with President Barack Obama on February 27, 2012. Hide Caption 13 of 21 21 photos: Scott Walker's career President Barack Obama receives a Milwaukee Brewers baseball jersey from Walker (left) as he disembarks from Air Force One upon arrival at General Mitchell International Airport in Milwaukee, Wisconsin, February 15, 2012. Hide Caption 14 of 21 21 photos: Scott Walker's career Walker listens during the 2011 Governors Summit of U.S. Chamber of Commerce June 20, 2011, in Washington, D.C. Hide Caption 15 of 21 21 photos: Scott Walker's career Members of Code Pink (left to right) Medea Benjamin, Liz Hourican and Tighe Barry, hold signs to protest as Walker (center) takes his seat during a hearing before the House Oversight and Government Reform Committee April 14, 2011, on Capitol Hill in Washington, D.C. Hide Caption 16 of 21 21 photos: Scott Walker's career Walker holds a letter from democratic State Sen. Mark Miller, one of the fourteen Wisconsin state senators who fled the state over two weeks ago, during a press conference on March 7, 2011, in Madison, Wisconsin. Hide Caption 17 of 21 21 photos: Scott Walker's career Walker holds up a 'Wisconsin is open for business' bumper sticker as he speaks during a ceremonial bill signing outside his office at the Wisconsin State Capitol on March 11, 2011, in Madison, Wisconsin. Hide Caption 18 of 21 21 photos: Scott Walker's career Walker delivers his budget address to a joint session of the legislature at the capitol March 1, 2011 in Madison, Wisconsin. Hide Caption 19 of 21 21 photos: Scott Walker's career Walker speaks at a news conference inside the Wisconsin State Capitol February 21, 2011, in Madison, Wisconsin. Hide Caption 20 of 21 21 photos: Scott Walker's career President Obama receives a Green Bay Packers NFL football team jersey with 'Obama #1' written on it from Walker (left) at Austin Straubel International Airport in Green Bay, Wisconsin, on January 26, 2011. Hide Caption 21 of 21 \"Some people have asked us about that in New Hampshire,\" Walker said. \"They raised some very legitimate concerns, including some law enforcement folks that brought that up to me at one of our town hall meetings about a week and a half ago. So that is a legitimate issue for us to look at.\" Terrorist attacks have been plotted in Canada -- including the so-called \"Millennium plot,\" a foiled 2000 plan in which an Algerian national planned to cross into the United States from Canada and bomb the Los Angeles International Airport. Walker has focused his immigration remarks on enforcing U.S. laws already on the books in recent weeks. He ran into trouble two weeks ago after GOP front-runner Donald Trump proposed repealing the Fourteenth Amendment's mandate that children born in the United States automatically become citizens, regardless of their parents' legal status. Walker first said he favored Trump's idea of repealing birthright citizenship. He backed off that stance days later, telling a reporter that he hasn't taken a position. And then last Sunday, he said that he isn't advocating any changes to laws on the books -- including the Fourteenth Amendment. Despite taking three different positions in the course of a week, Walker insisted Sunday on NBC, his stance has been consistent. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> Race to the White House More from Politics", "external_links": [], "published": "2015-08-30T21:52:00.000+03:00", "crawled": "2015-08-31T01:01:29.829+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}