{"organizations": [], "uuid": "6b7f9f50317aeb30a5f84242c24db144cb247fde", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/08/04/barack-obama.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/08/04/globos-baile-y-donaciones-feliz-cumpleanos-barack-obama", "country": "", "title": "Globos, baile y donaciones: ¡Feliz cumpleaños, Barack Obama!", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Globos, baile y donaciones: ¡Feliz cumpleaños, Barack Obama!", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T18:42:00.000+03:00", "replies_count": 0, "uuid": "6b7f9f50317aeb30a5f84242c24db144cb247fde"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/08/04/globos-baile-y-donaciones-feliz-cumpleanos-barack-obama", "ord_in_thread": 0, "title": "Globos, baile y donaciones: ¡Feliz cumpleaños, Barack Obama!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Globos, baile y donaciones: ¡Feliz cumpleaños, Barack Obama! El presidente número 44 de Estados Unidos celebra su cumpleaños número 54 y hay algunas maneras en las que puedes felicitarlo Martes, 04 de agosto de 2015 a las 10:40 El mandatario estadounidense cumple 54 años este 4 de agosto (Getty Images/ Archivo). Lo más importante Barack Obama celebra este martes sus 54 años Quienes quieran felicitarlo pueden enviarle un tuit o firmar una tarjeta El presidente ruso, Vladimir Putin, ya lo felicitó Temas relacionados Obama hace un video para BuzzFeed... porque #YOLO \n(CNNMéxico) — Barack Obama está de fiesta. \nEste martes 4 de agosto el presidente de Estados Unidos cumple 54 años y ya hay varias formas para celebrar la fecha con él, aunque sea a distancia. \nFiesta de globos \nEntra a la cuenta de Twitter @BarackObama y te recibirán…¡un montón de globos! \nAsí, la cuenta institucional del mandatario hace uso de una de las últimas funciones de Twitter, pues al ingresar la fecha de tu cumpleaños a tu cuenta, los globos se desplegarán ese día. \nUn baile 'a la Obama' \nLa cuenta del presidente estadounidense invita a enviar un tuit a Obama utilizando el hashtag #44Turns54. El cumpleañero es el presidente número 44 de la historia de su país, y de acuerdo con este gif, el más bailador. \nCelebrate President Obama's birthday by wishing him a happy 54th: http://t.co/pHqzMNujF7 #44Turns54 pic.twitter.com/IqnRnAraM8 — Barack Obama (@BarackObama) agosto 3, 2015 \nFirma una postal \nSi quieres ser parte de una enorme tarjeta de felicitación, esta es tu opción. En la página barackobama.com serás recibido por el sonriente mandatario utilizando un gorro de cumpleaños. \nAllí podrás firmar la tarjeta de cumpleaños que el movimiento Organizing for Action (OFA), una organización sin fines de lucro que aboga por la igualdad y los derechos sociales como el acceso a la salud, a un mejor planeta o a leyes que protejan a los inmigrantes, enviará a Obama. \nUna vez que firmas, serás invitado a realizar una donación para \"ayudar a financiar las raíces de la organización en comunidades en todo el país\". \nLlámalo o mándale un telegrama (si eres un jefe de Estado) \nSi tienes su número, llámalo. \nO mándale un telegrama como lo hizo su homólogo ruso Vladimir Putin, de acuerdo a un comunicado del Kremlin. \nPutin, de 62 años, envió el correspondiente telegrama de felicitación, aunque, debido a la diferencia horaria, Obama lo recibirá dentro de unas horas, precisó Dmitri Peskov, portavoz del Kremlin. \nCon información de EFE. Encuentra este artículo con: barack obama, cumpleaños, 54, 44, twitter, globos, vladimir putin Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"6a504b1b0c534e93b27df4f8f932ba0a\", \"time\": \"2015-08-04T15:42:11.844Z\" } Video ", "external_links": [], "published": "2015-08-04T18:42:00.000+03:00", "crawled": "2015-08-04T18:42:15.436+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}