{"organizations": [], "uuid": "6003593915234c74c222ccba9ec60deca5bbd60a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c372af1700006e00566be8.jpeg?cache=loR0Afg5VH", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/news.xml", "section_title": "Women News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/watch-this-comedian-skewer-anti-abortion-logic_55c366d8e4b0f1cbf1e3d322", "country": "US", "title": "Watch This Comedian Skewer Anti-Abortion Logic", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Watch This Comedian Skewer Anti-Abortion Logic", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T19:22:00.000+03:00", "replies_count": 0, "uuid": "6003593915234c74c222ccba9ec60deca5bbd60a"}, "author": "Alanna Vagianos", "url": "http://www.huffingtonpost.com/entry/watch-this-comedian-skewer-anti-abortion-logic_55c366d8e4b0f1cbf1e3d322", "ord_in_thread": 0, "title": "Watch This Comedian Skewer Anti-Abortion Logic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Watch This Comedian Skewer Anti-Abortion Logic Cameron Esposito for president. Alanna Vagianos Associate Editor, Voices, The Huffington Post Posted: 08/06/2015 12:22 PM EDT Gina Ferazzi via Getty Images In the midst of the recent Planned Parenthood controversy , Cameron Esposito has some feelings on the matter -- some very strong feelings. The comedian recently took the stage to explain why Planned Parenthood is absolutely vital to everyone, not only women. Using a standup performance to drop some knowledge, Esposito explained that abortions only make up 3 percent of what Planned Parenthood does . The other 97 percent includes breast exams, sex education, HIV testing and many more important health services . The fact that anti-abortion supporters are trying to defund Planned Parenthood because it offers abortion services is \"insanity\" Esposito said. \"Women deserve access to abortion services. We f**king do because we’re not incubators.\" She explains that when we give women the right to choose we actually help stop the vicious cycle of poverty . “If you don’t want to pay for health care for people that live in poverty, then you should help women who live in poverty to not have children that they are not able to provide for,\" Esposito says. \"That is how you personally will not have to pay that bill.” \"If you are pro-life you should be pro-women’s lives,\" she says. \"The women that already exist and aren’t piles of cells.\" Esposito finished on a strong (and hilarious) note: “If you are a guy and you are against Planned Parenthood and you sleep with women -- I hope to god it is infrequently.” ﻿Also on HuffPost: 150 Funny Women - Past And Present of", "external_links": [], "published": "2015-08-06T19:22:00.000+03:00", "crawled": "2015-08-06T19:29:36.901+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}