{"organizations": [], "uuid": "d511c29b4858c0432f914d9bef7c1c9e6f855b76", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/barackobama2.jpg", "site_section": "http://thehill.com/taxonomy/term/28/feed#", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/250114-gop-leaders-hammer-new-obama-climate-rule", "country": "US", "title": "GOP leaders hammer new Obama climate rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP leaders hammer new Obama climate rule", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T21:44:00.000+03:00", "replies_count": 0, "uuid": "d511c29b4858c0432f914d9bef7c1c9e6f855b76"}, "author": "dhenry@thehill.com (Devin Henry)", "url": "http://thehill.com/policy/energy-environment/250114-gop-leaders-hammer-new-obama-climate-rule", "ord_in_thread": 0, "title": "GOP leaders hammer new Obama climate rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP leaders hammer new Obama climate rule By Devin Henry - 08/03/15 02:44 PM EDT \nPresident Obama’s new power plant emissions rules are “another blow to the economy and the middle class,” and “regressive regulations that are set to harm struggling workers and families,” Senate Majority Leader Mitch McConnell (R-Ky.) said on Monday. \nMcConnell, a long-time foe of the Obama administration’s Clean Power Plan rule for power plants, questioned the legality of the rule in a floor speech and said the rule wouldn’t help the environment because companies will move jobs in the energy sector to countries with poor environmental records, like India and China. ADVERTISEMENT “The administration is now trying to impose these deeply regressive regulations — regulations that may be illegal, that won’t meaningfully impact a global environment, and that are likely to harm middle- and lower-class Americans the most — all done by executive fiat,” McConnell said on the Senate floor.\n“It represents a triumph of blind ideology over sound policy and honest compassion.” \nMcConnell's state relies heavily on the coal industry, which is expected to be hampered by the regulations. He's one of the Senate’s leading critics of the rule, and in March encouraged the nation’s governors to ignore the regulations and wait for a court ruling on the plan's legality instead. \nThe Obama administration began rolling out the the final version of the Clean Power Plan, which looks to cut carbon emissions from the power sector 32 percent below 2005 levels by 2030, on Sunday night. Environmental groups have cheered the rule but officials in the energy sector — and trade groups representing the coal and natural gas industries — have been skeptical and even hostile to it. \nMcConnell said lawmakers could consider a handful of ways to undo the rule, such as policy riders to appropriations bills or a resolution disapproving of the rule under the Congressional Review Act. Republican senators have rallied around a bill from Sen. Shelley Moore Capito (R-W.Va.) to block the rule, and a Senate committee will hold a hearing on the legislation later this week. \n“I am not going to sit by while the White House takes aim at the lifeblood or our state’s economy,” he said. “I’m going to do everything I can to fight them.” \nSpeaker John Boehner (R-Ohio) echoed that in a separate statement on Monday, promising to stop what he called a “national energy tax” in the House. \n“I believe this final plan is an expensive, arrogant insult to Americans who are struggling to make ends meet,” Boehner said. \n“For more than a year, Americans have told President Obama and his administration that they cannot afford his new national energy tax. Instead of listening to families and job creators, the Administration has ignored their concerns and the law and finalized a plan that is even worse than we expected.” \nThe House has passed two bills related to the Clean Power Plan this year, including one in June giving states the chance to refuse compliance with the rule until legal challenges to it are exhausted. Obama is certain to veto any legislation that takes aim at the regulations. Tags:", "external_links": [], "published": "2015-08-03T21:44:00.000+03:00", "crawled": "2015-08-04T01:50:07.056+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}