{"organizations": [], "uuid": "4d11a9d01508f339080efc3570fbbf4e0dfa1b2d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/us/2015/08/20/teen-grandpa-die-in-fire-caused-by-discarded-marijuana-pipe/", "country": "US", "title": "Teen, grandpa die in fire caused by discarded marijuana pipe", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Teen, grandpa die in fire caused by discarded marijuana pipe | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "4d11a9d01508f339080efc3570fbbf4e0dfa1b2d"}, "author": "Associated Press", "url": "http://www.foxnews.com/us/2015/08/20/teen-grandpa-die-in-fire-caused-by-discarded-marijuana-pipe/", "ord_in_thread": 0, "title": "Teen, grandpa die in fire caused by discarded marijuana pipe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   livefyre Email Print ALTOONA, Pa. –   A 15-year-old boy and his disabled Vietnam veteran grandfather have been killed in an apartment fire caused by a marijuana pipe the man had been smoking, authorities said.\nAutomatic alarms summoned fire crews at about 3:30 a.m. Wednesday to the high-rise apartment in Altoona, but Sheldon Bare, 69, and his visiting grandson, Ryan Bare, died at a hospital. Their deaths have been ruled accidental.\nRyan was found in the apartment's bedroom, while the marijuana pipe was found near the living room couch, Altoona police Lt. Jeffrey Pratt said. The couch and other contents of the room were engulfed in flames when firefighters arrived, Altoona Fire Chief Tim Hileman said.\nBare's apartment was on the top floor of an 11-story building run by the Altoona Housing Authority for elderly and disabled residents.\nBare's sister, Holly Spatafora, told The Altoona Mirror that the Department of Veterans Affairs declared her brother 100 percent disabled about 25 years after he served three tours in Vietnam.\nShe and her sister, Linda Scalice, said Bare returned from the war moody, reclusive and anti-social with a quick temper, likely from post-traumatic stress disorder.\n\"The man that came home was no longer my brother,\" Spatafora said. \"He was just never happy again.\"\nBare was twice divorced, with two children from each wife. He worked in a steel mill before the war but never steadily thereafter, Spatafora said.\nAlthough Bare lived alone, \"a lot of people looked after him,\" and he was especially close to his four grandchildren, Spatafora said.\n\"He was one of the walking wounded,\" Spatafora said.", "external_links": [], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-20T19:47:44.293+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}