{"organizations": [], "uuid": "280ba2a19d94eebe8c7dc5bc271ff617697396ec", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150715085208-01-planned-parenthood-file-large-169.jpg", "site_section": "http://us.cnn.com/", "section_title": "Breaking News, U.S., World, Weather, Entertainment &amp; Video News - CNN.com", "url": "http://www.cnn.com/2015/08/04/politics/planned-parenthood-fifth-video-houston/index.html", "country": "US", "title": "Anti-abortion group releases video following Senate bill failure - CNNPolitics.com", "performance_score": 5, "site": "cnn.com", "participants_count": 1, "title_full": "Anti-abortion group releases video following Senate bill failure - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "280ba2a19d94eebe8c7dc5bc271ff617697396ec"}, "author": "Eugene Scott", "url": "http://www.cnn.com/2015/08/04/politics/planned-parenthood-fifth-video-houston/index.html", "ord_in_thread": 0, "title": "Anti-abortion group releases video following Senate bill failure - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights The latest undercover video features operatives attempting to buy intact fetal organs The video's release comes one day after a vote to pull federal funding from Planned Parenthood failed in the Senate Washington (CNN) The anti-abortion group that has accused Planned Parenthood of illegally selling organs and tissue from aborted fetuses released a new video Tuesday, a day after the Senate blocked a bill that would have defunded the organization .\nThe latest undercover video, which is clearly edited, features operatives for The Center for Medical Progress posing as employees of a fetal tissue procurement company attempting to buy intact fetal organs from a Planned Parenthood branch in Houston. In the clip, Melissa Farrell, director of research for Planned Parenthood Gulf Coast, discusses the relationship between altering abortion procedures to get the most intact organs possible and costs.\nAnti-abortion group releases fourth Planned Parenthood video\n\"If we alter our process and we're able to obtain intact fetal cadavers, it's all a matter of line items,\" she said in the video.\nFarrell, who said in the video that she is responsible for diversifying Planned Parenthood's revenue streams, also said the group works with multiple academics and researchers studying fetuses looking for intact organs -- and sometimes complete cadavers.\nJUST WATCHED What's next in Planned Parenthood fight? Replay More Videos ... MUST WATCH\nWhat's next in Planned Parenthood fight? 05:57 PLAY VIDEO \"It's something that we can look at exploring: How we can make that happen so we have the highest chance,\" she's heard saying in the video. \"It will probably also require a little bit of input from the doctors. Doctors are the ones asking, directly doing that.\"\nThird Planned Parenthood video released as Senate Republicans seek to end funding\nSome abortion doctors are researchers themselves and perform abortions in a way that allows them to get the most intact organs for their own research, Farrell said.\n\"If we alter our process and we are able to obtain intact fetal cadavers, then we can make it part of the budget,\" she said. \"I mean that's -- it's all just a matter of line items.\"\nAlso in the latest clip, Abby Johnson, the former clinic director of Planned Parenthood Gulf Coast, said her Planned Parenthood branch made about $120,000 a month selling aborted fetus tissue and organs. Johnson also made the claim to the Texas Senate last week.\nPlanned Parenthood has denied that it sells organs and tissue from aborted fetuses and said all figures discussed in previous videos are connected to the costs of shipping and handling.\nIn a statement Tuesday afternoon, Dawn Laguens, Planned Parenthood's executive vice president, said the video was edited out of context.\nSecond Planned Parenthood video surfaces showing alleged selling of fetal tissue\n\"The latest tape has at least 20 substantial and unexplained edits. Previous tapes released by this extremist group were heavily edited in order to distort what the people on the tapes actually said,\" she said. \"These videos are intended to shock and deceive the public. For example, one video was edited to make it look like a doctor said she would \"sell\" fetal tissue for a profit -- when in fact, she said the exact opposite, 10 separate times, and nearly all instances were edited out of the tape.\"\nThe Center for Medical Progress has released four heavily edited videos over the last month as well as several clips that the California group says are unedited.\nAt least two courts have issued restraining orders against The Center for Medical Progress, ordering them not to release the videos out of concern that they were illegally recorded and that the lives of the individuals featured in the videos could be harmed.\nLaguens on Tuesday slammed efforts to defund the women's health organization as \"political games\" that are \"intended to score political points.\"\n\"What we're seeing here are attacks on people's ability to get health care. We're seeing attacks that are intended, in their end analysis, to get rid of safe, legal abortion in this country and destroy Planned Parenthood, who stands up for the reproductive health rights and freedom of women and all people in this country,\" she told Alisyn Camerota on CNN's \"New Day.\"\nJUST WATCHED Planned Parenthood vote fails Replay More Videos ... MUST WATCH\nPlanned Parenthood vote fails 02:09 PLAY VIDEO But David Daleiden, the founder and leader of The Center for Medical Progress, stood by his group's disclosures on Tuesday, telling CNN's Camerota that Planned Parenthood illegally uses partial-birth abortions \"to harvest higher quality fetal organs for sale.\"\nRepublicans on Capitol Hill are now seeking to tie federal funding for Planned Parenthood to a government spending bill that is up for a vote this fall after Monday's failed effort in the Senate to bar all federal funds for the group. Planned Parenthood receives more than $500 million in federal funding, though none of the money can be spent legally toward abortion services.\nBut the controversy surrounding Planned Parenthood has turned into a rallying cry for many 2016 Republican presidential candidates who have called for Congress to pull federal funding for the organization. Hillary Clinton and other Democrats, meanwhile, have defended the group .\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/131213195414-capitol-hill-generic-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150804090955-daleiden-defends-making-planned-parenthood-videos-intvw-camerota-newday-00025115-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/131213195414-capitol-hill-generic-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150804090955-daleiden-defends-making-planned-parenthood-videos-intvw-camerota-newday-00025115-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/131213195414-capitol-hill-generic-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150804090955-daleiden-defends-making-planned-parenthood-videos-intvw-camerota-newday-00025115-medium-plus-169.jpg", "http://www.centerformedicalprogress.org/2015/08/698/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150804090955-daleiden-defends-making-planned-parenthood-videos-intvw-camerota-newday-00025115-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150804090955-daleiden-defends-making-planned-parenthood-videos-intvw-camerota-newday-00025115-small-11.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150804090955-daleiden-defends-making-planned-parenthood-videos-intvw-camerota-newday-00025115-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/131213195414-capitol-hill-generic-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150804090955-daleiden-defends-making-planned-parenthood-videos-intvw-camerota-newday-00025115-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/131213195414-capitol-hill-generic-hp-video.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-08-04T03:00:00.000+03:00", "crawled": "2015-08-04T23:35:15.686+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}