{"organizations": [], "uuid": "61a93924b0cd36776147195cfb18cecb1c406b72", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/debate_trump_080615.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/opinion/2015/08/21/rick-sanchez-facts-about-immigration-trump-donald-trump/", "country": "IL", "title": "Rick Sanchez: The facts about immigration trump Donald Trump", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Rick Sanchez: The facts about immigration trump Donald Trump | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "61a93924b0cd36776147195cfb18cecb1c406b72"}, "author": "Rick Sanchez", "url": "http://latino.foxnews.com/latino/opinion/2015/08/21/rick-sanchez-facts-about-immigration-trump-donald-trump/", "ord_in_thread": 0, "title": "Rick Sanchez: The facts about immigration trump Donald Trump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Rick Sanchez \n  Fox News Latino Donald Trump: 'We need to keep illegals out' Donald Trump visits the border Marco Rubio reacts to the opening of U.S. embassy in Cuba When Donald Trump suggested all Latino immigrants are rapists, and the border was a war zone, the media and most of his opponents did nothing more than feign shock. They’re shocked, shocked! \nShock is nice, but facts are better. Yes, facts ! According to FBI crime statistics, white non-Hispanics by far lead the nation in violent rapes, 53 percent. Up next, black non-Hispanics at 31 percent. Shouldn’t we know that? Isn’t that better than shock?\nOh, and the border? According to FBI Uniform Crime Reports, homicide and violent crime rates for U.S. cities within 100 miles of the border are below the national average and even below their states' averages. Meanwhile El Paso – the city Trump chose to make his stand against Mexico – has the lowest homicide rate of all U.S. cities with populations of more than 500,000.\nSo Trump was wrong; however, most Americans will continue to believe he was right. The truth remains relatively unreported when compared to Trump’s bravado, and stories about him “being unafraid to speak his mind,” even if his mind is as jumbled with jingoisms as that of your obnoxious uncle at a backyard barbeque.\nNow along comes Trump with yet another headline-grabbing, xenophobic declaration. He wants to deport American citizens. “They got to go,” he told Meet the Press’s Chuck Todd. The ‘they’ Trump is referring to aren’t Italian-Americans or Irish-Americans born in the United States to foreign parents. He is referring to Latino-Americans. \nMost politicians disguise their contempt for minorities; Trump doesn’t bother with such niceties. His is not a dog whistle; it’s a bullhorn. \nHere is a man running for president screaming – for all the world to hear – that the U.S. Constitution means nothing to him, that he has no problem violating the 14th amendment, at least when it comes to children born to Hispanic parents. Let’s be clear, what he is saying is that people born in America are not Americans. Why? It’s because Donald Trump says so, and because it’s the easiest form of bullying from a man espousing the most un-American points of view in decades. \nAs Americans, we embrace the words of Emma Lazarus: “Give me your tired, your poor, your huddled masses yearning to breathe free.” \nTrump would not only scratch those immortal words written in bronze off the Statue of Liberty’s pedestal, he would also tell children to get the hell out. Unfortunately, in many circles and for reasons even they don’t understand, Trump’s bravado is welcomed and even applauded. It is after all, a cheap applause line – one that sadly cheapens us all.\nSo while most of us whose names end in ‘ez’ remain stupefied by the nonchalance of Trump’s utterance, we are equally stunned by the media’s inability or desire to challenge him. During this past week, questions have been raised about how Trump’s military knowledge comes from watching the guys he hears talking about ISIS on cable news, and about whether or not women will vote for him. Yet, compared to those, his comments about Latinos have received only a fragment of the coverage.\nSo again, we are left alone to turn to the facts—facts that few reporters seem to have on hand to refute Trump’s threat to get rid of young Latinos. \nThe average age of Latinos born in the United States is 19 compared to 42 for white non-Latinos. Economists call that “the future,” because without the Latino workforce and buying power our economy would greatly suffer. Even a cursory examination shows that when it comes to undocumented immigrants, the labor participation rate among Latinos is staggering. While they represent only 3.7 percent of the U.S. population, they make up 5.2 percent of the workforce. Freeloaders? Hmm!\nFact is, young Latinos will fight in our wars, contribute immeasurably to our labor force and pay for our retirements. So much so, that an estimated $13 billion a year is collected in social security taxes from undocumented immigrants, according to the Social Security Administration. That’s more than $100 billion collected over the past decade, which doesn’t include the hundreds of billions more collected in sales and property taxes.\nAnd there’s this: According to a recent Wall-Street Journal report, immigrants started new companies or became self-employed at nearly two times the rate of native-born Americans, even though they made up only 12.9 percent of the U.S. population. Latino new business creators specifically climbed to 22.1 percent in 2014 from 20.4 percent a year earlier, while making up only 17.1 percent of the U.S. population.\nThese are facts. Facts that trump jingoisms and cheap applause lines—facts that, to any reasonable person, trump Donald Trump. \n\nRick Sanchez is a contributor for Fox News Latino. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-21T18:52:13.831+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}