{"organizations": [], "uuid": "fbd8b31de4a539de1383343586877303856a684a", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/08/20/WE01233425/3668884/Coverjpg-3668884_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1265006", "country": "", "title": "Open letter to Donald Trump on his immigration plan. - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Open letter to Donald Trump on his immigration plan. - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "fbd8b31de4a539de1383343586877303856a684a"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1265006", "ord_in_thread": 0, "title": "Open letter to Donald Trump on his immigration plan. - CNN iReport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump"], "text": "Open letter to Donald Trump on his immigration plan. By DRBoycott | Posted 46 minutes ago \nDear Mr Trump, We have reviewed with interest your newly proposed immigration plan. We think that with a few adjustments it could be a workable solution to the many woes of illegal immigration problems in the United States. Besides the extraordinary logistical apparatus needed to execute your plan, such a plan would create economic turmoil , since Mexico is the third largest trading partner of the US and the Mexican undocumented population living in the States is estimated at almost 6 millions. We believe that focusing on Mexico at this stage is too much too soon. Repealing the 14th amendment and denying US citizenship to the children of illegal immigrants would be a strong yet mostly nominal gesture in the near to short term and would only bear fruit several generations from now. Removing current illegal immigrants is a step in the right direction to enforce current immigration laws but what about all the \"anchor\" babies born in the US? Should they be separated from their parents? How would you humanely keep families together? A retroactive provision enabling the stripping of US citizenship from children of illegal immigrants is the only workable solution. It would have to be added to the new slate of immigration laws generated by repealing the 14th amendment for this to work in practice. For that matter there is a model being developed and the perfect test population comes attached as an added bonus. The 14th amendment was adopted in 1868 in order to integrate former slaves in American society after the civil war and while the letter of the law grants citizenship to all persons born on US soil, it can be argued that the spirit of the law did not extend citizenship to children of illegal immigrants. This argument allows the flexibility required to mandate reviewing the citizenship eligibility status of multiple generations of immigrants. That retroactive immigration policy model is currently being implemented in the Dominican Republic with the \"in transit\" exception to the jus soli clause of the Dominican Constitution serving as the loophole. May we suggest the Dominican undocumented population living in Puerto Rico as a small but manageable test population? We have outlined below the many benefits such an approach would offer your presidential campaign and potentially your presidential terms. We say terms because it would probably take at least two terms to repeal the 14th amendment then to enact and enforce laws aimed at reviewing the immigration status of illegals and their descendants and deporting the ones who do not qualify. By the end of the second term however, you would be able to take on the Mexican illegal immigration with a proven model, operational experience and legal precedent in your arsenal. Here are the benefits of our suggested plan of focusing your immigration reforms efforts on the Dominicans living in Puerto Rico first: 1) No long term economic drawbacks. The trade benefits derived from the Dominican Republic are minuscule compared to other US partners and specifically Mexico therefore economically it would not be too much trouble to focus on swiftly deporting Dominicans from Puerto Rico. It also helps that most removal operations would take place off the mainland away from bleeding heart liberals who would certainly oppose such actions on the grounds of human rights. 2) An operationally manageable number of deportations. The Dominican population in Puerto Rico, the second largest immigrant population there, is numbered in the hundreds of thousands. A large portion of these Dominicans are illegals and the US citizens of Dominican descent are themselves mostly from undocumented parents. A few tens of thousands maybe up to a hundred thousand is a small number of deportations in comparison to the estimated tens of millions of immigrants living on US soil your plan would have to eventually address but it is manageable. No big government apparatus needed which also preserves your standing with many of your small government conservative supporters. 3) Constitutionally permissible for Dominicans. By the virtue of article 18 paragraph 4 of the Dominican constitution any person born of one Dominican parent anywhere in the world is Dominican. That would effectively shut down any attempts at calling the deportees stateless: Dominicans [feminine] and Dominicans [masculine] are: 4. Those born abroad, of Dominican father or mother, notwithstanding having acquired, by place of birth, a different nationality from that of their parents. 4) Token resistance from the Dominican Republic Government if not outright support. The Dominican Republic Government has shown itself to be a strong proponent of the sovereignty of its nation and has so far been rebuffing attempts by the OAS, UN and other human rights agencies as well as foreign governments at intervening in what they call their internal immigration reform process which also retroactively strips Dominicans of Haitian descent of their citizenship. This state of affairs implies that: a) The Dominican Republic should be seen as a pioneer in the retroactive immigration reforms policies and the implementation of their reforms should be closely watched. b) The Dominican Republic should also be seen as a partner in the repatriation of their nationals from Puerto Rico as they would certainly understand the procedures required to purge the US of illegals. c) No formal complaint from the Dominican Republic Government to the OAS or UN would gather much ground considering their own rebuke of said organizations, and the legal doctrine of \"dirty hands\" again making their nationals a perfect experimental population. A complaint from The Dominican Republic would also constitute an informal repudiation of their own policies which makes it a highly unlikely event. d) The retroactive immigration reforms enacted in the Dominican Republic will create plenty of demand for labor once they have successfully purged their countries of illegals Dominicans of Haitian descent. As a shrewd business man we believe that you could even charge the Dominican Republic a portion of the repatriation and even educational costs of the former US citizens of Dominican descent as the country would certainly benefit from the new influx of talent and skills from the Dominicans arriving from Puerto Rico. e) Self-deportations of Dominicans from Puerto Rico, as has been evidenced in the Dominican Republic own experiment with it's retroactive immigration reforms, would also be an ancillary benefit with zero cost to the American taxpayer and could be touted as a sign of success of your policies. 5) Dominicans living in the Dominican Republic who also support their Government immigration reform policies specifically Law 168-13, and even the Dominican Government itself would also welcome back their brothers and sisters as vindication that the retroactive immigration laws they are championing now were fair and just from outset as they are being applied to their countrymen as well. They might even be proud to see the policies they are pioneering now on their share of the small island of Hispanola being adopted by the most powerful nation in the world. By virtue of the fact that the Dominican government would be less likely than any other government to seriously object to denationalization laws, Dominican nationals and their descendants residing in Puerto Rico would constitute the perfect test population to introduce the immigration reforms with and giving you plenty of latitude to establish the legal precedent necessary to tackle other illegal immigrant groups. Thank you for considering our proposal, The staff of Facebook.com/DRBoycott Injustice anywhere is injustice everywhere. P.S.: Please ignore the name of our organization and our motto as you might conclude that this letter is a futile attempt at sarcasm in the hopes of bringing light to the plight of Dominicans of Haitian descent in the Dominican Republic. TAGS: ", "external_links": [], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-20T22:22:44.350+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}