{"organizations": [], "uuid": "9b5620535ecc130d6b449ae819af685066047afa", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/national-security/250362-white-house-aide-tapped-for-iaea-slot", "country": "US", "title": "Obama nominates aide for IAEA position as Iran oversight looms", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama nominates aide for IAEA position as Iran oversight looms", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T23:52:00.000+03:00", "replies_count": 0, "uuid": "9b5620535ecc130d6b449ae819af685066047afa"}, "author": "Julian Hattem", "url": "http://thehill.com/policy/national-security/250362-white-house-aide-tapped-for-iaea-slot", "ord_in_thread": 0, "title": "Obama nominates aide for IAEA position as Iran oversight looms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama nominates aide for IAEA position as Iran oversight looms By Julian Hattem - 08/05/15 04:52 PM EDT \nPresident Obama has nominated a top White House aide to be the U.S. ambassador to the International Atomic Energy Agency, at a time when the nuclear organization is stepping into the spotlight as the chief enforcer of the nuclear deal with Iran. \nLaura Holgate has spent the last six years as the National Security Council’s senior director for weapons of mass destruction, terrorism and threat reduction. ADVERTISEMENT If confirmed by the Senate, she would be tasked with leading the U.S. efforts at the IAEA as it looks to start ramping up oversight of the international nuclear agreement with Iran. \n“Laura has spent her career building and leading global coalitions to prevent states and terrorists from acquiring and using weapons of mass destruction,” national security adviser Susan Rice said in a statement. \n“While we will deeply miss her at the White House, there is no better person than Laura to lead our delegation in Vienna during this critical time.” \nThe IAEA will be taking center stage if the Iran agreement goes into effect later this year. The international organization has been charged with monitoring and inspecting Iran’s compliance with the deal, which sets limits on its nuclear powers in exchange for the lifting of sanctions. \nOf late, the IAEA has come under fire for refusing to allow members of Congress an opportunity to read the text of some of its bilateral agreements with Iran. \nBefore stepping into her current role in 2009, Holgate headed policy on Russia at the Nuclear Threat Initiative, an organization trying to prevent the spread of nuclear, biological and chemical weapons. \nShe also served in posts in the Energy and Defense departments. Tags: 1 day Fifth Planned Parenthood video... An official also discusses altering abortion procedures to meet specific... Bush drops 40 pounds on Paleo diet Bush talked about his weight loss in an interview at an Iowa Dairy Queen. Trump: Harvard students '... Trump fell victim to an elaborate prank by a group of Harvard students. Field set for first GOP debate Rick Perry fails to make the top 10, officially announced by Fox late... Senate GOP thwarted in effort to... Two Democrats voted to move forward with the bill, which stalled in a 53-... Kelly Osbourne makes racial remark... \"If you kick every Latino out ... then who is going to be cleaning your... Harvard Lampoon tricks Trump with... A fake endorsement called Trump \"the most formidable and competitive\" GOP... Iran denies link between... A website alleged that Javad Zarif’s son was the best man at Vanessa Kerry... Trump: Shut down government over... Trump called for the tactic to cut off the group's funding in the wake of... Trump's leaked phone number... Callers to Trump's number are told about his website and Twitter account. Poll: Clinton's favorability takes... Clinton is viewed unfavorably by 48 percent; favorably by 37 percent. Capitol Police: Staffer arrested... Rep. Duncan Hunter says his staffer is \"a hero\" and the incident must be... Judge extends block on videos from... A hearing is set for Aug. 27. Obama celebrated birthday at Rose'... The president and his guests reportedly skipped the line on their way in. McConnell's vow: No more... The Senate majority leader pledges to begin talks \"at some point.\" Three lines of attack against... Opponents are looking to all three branches of government to block the... Gawker publishes Trump phone number “Mr. Trump has several numbers so this is not an issue,” a campaign source... Juan Williams: GOP's anger turns... OPINION | Republicans who feed the resentments of the base imperil GOP... Congress holds hearing on... Why would anyone take seriously such a biased hearing on the BDS movement? Biden challenge to Clinton would... The biggest challenge would be finding a niche — and a reason for his... GOP lawmaker diagnosed with... Rep. Curbelo says last few weeks have been trying for family. Fifth Planned Parenthood video to... The videos have led to a defunding fight over Planned Parenthood. Two undocumented immigrants... VIDEO | The outcry was loud Monday night in Huntington Park, Calif. Carson: Black Lives Matter... Carson also discussed illegal immigration in an NBC interview.", "external_links": [], "published": "2015-08-05T23:52:00.000+03:00", "crawled": "2015-08-06T03:46:57.011+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}