{"organizations": [], "uuid": "3ff2bf1f83d0c60450880770dae53d630c1c1a66", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c506521d00002f00144392.jpeg", "site_section": "http://www.huffingtonpost.com/tag/elizabeth-warren/feed", "section_title": "Elizabeth Warren on Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-hud-big-banks_55c4f2f2e4b0923c12bcc4b1?ncid=txtlnkusaolp00000592&kvcommref=mostpopular", "country": "US", "title": "How The Obama Administration Is Helping Big Bank Felons", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "How The Obama Administration Is Helping Big Bank Felons", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T19:24:00.000+03:00", "replies_count": 0, "uuid": "3ff2bf1f83d0c60450880770dae53d630c1c1a66"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/obama-hud-big-banks_55c4f2f2e4b0923c12bcc4b1?ncid=txtlnkusaolp00000592&kvcommref=mostpopular", "ord_in_thread": 0, "title": "How The Obama Administration Is Helping Big Bank Felons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How The Obama Administration Is Helping Big Bank Felons So much for that tough talk about holding Wall Street accountable for its crimes. Shahien Nasiripour Chief Financial and Regulatory Correspondent, The Huffington Post Posted: 08/11/2015 04:24 PM EDT | Edited: 08/11/2015 04:54 PM EDT \nWith the blessing of the White House and the Justice Department, the Department of Housing and Urban Development is attempting to sneak through a major policy change that would enable big banks convicted of felonies to continue lending through a federal mortgage program, according to federal records and government officials. \nThe housing agency wants to quietly delete a requirement for lenders to certify they haven’t been convicted of violating federal antitrust laws or committing other serious crimes. HUD proposed the move on May 15, without detailing the reasoning behind the change. It’s now considering public comment, with an eye towards finalizing the proposal. \nFive years after lawmakers and the Obama administration said the Dodd-Frank financial reform law would end the problems caused by banks perceived to be “too big to fail,” HUD's move could represent yet another capitulation from federal officials who want to appear to be tough on Wall Street’s crimes, but don’t want big banks to suffer the consequences typically associated with felony convictions. \nThe main beneficiaries of the proposal would be JPMorgan Chase, the nation's largest bank with more than $2.4 trillion in assets, and Citigroup, the third-largest U.S. bank with $1.8 trillion in assets, according to Federal Reserve data . Attorney General Loretta Lynch speaks as former Attorney General Eric Holder and President Barack Obama look on. | Credit: Susan Walsh/Associated Press \nThe HUD proposal only came to the public's attention in recent weeks, when three Democratic lawmakers -- Rep. Maxine Waters of California and Sens. Sherrod Brown of Ohio and Elizabeth Warren of Massachusetts -- highlighted the housing agency's plans in a critical letter to HUD Secretary Julián Castro, citing private discussions with agency officials. \nBoth JPMorgan and Citi pleaded guilty to criminal federal antitrust violations in May, marking the first time in a decade that large American banks have pleaded guilty to criminal charges . But HUD's new proposal, the lawmakers wrote in their letter to Castro, would allow it \"to turn a blind eye\" to the banks' criminal acts, “putting homebuyers and taxpayers at additional risk.” \nThe proposed change would also sharply contrast with the way HUD treats low-income Americans who live in federally subsidized housing. Federal rules allow local housing authorities to evict tenants immediately if they're arrested for certain crimes, such as marijuana possession. The accused can lose their homes even if they’re ultimately found not guilty. \n“Turning a blind eye to rich and powerful banks that have plead to very serious felonies really marks the worst kind of double standard,” said Runa Rajagopal , a supervising attorney at The Bronx Defenders, a nonprofit firm that represents low-income clients in New York. \nCameron French, a HUD spokesman, said the Obama administration “has taken extraordinary steps to hold lenders accountable for their actions that helped lead to the economic crisis.” He declined to provide further comment until after the department has responded to the lawmakers' letter. \nJustice Department spokespeople Nicole Navas and Patrick Rodenbush, Citi spokesman Mark Rodgers and JPMorgan spokeswoman Amy Bonitatibus all declined to comment on the proposed change to the disclosure rules. A representative of the White House Office of Management and Budget, which preliminarily approved HUD’s request, declined to comment. \nReining In Misbehaving Banks After The Financial Crisis \nFor the last several years, federal prosecutors during the Obama administration have repeatedly helped misbehaving banks avoid many of the consequences of their actions -- and have faced stinging criticism from federal lawmakers and public interest groups for failing to demand accountability. One egregious example came in 2012, when the Justice Department allowed U.K. banking giant HSBC to dodge a criminal indictment -- despite evidence that it violated U.S. sanctions and allowed Mexico's Sinaloa Cartel and Colombia's Norte del Valle Cartel to launder their drug proceeds through the bank’s U.S. and Mexico units. Drug traffickers laundered at least $881 million through HSBC, according to the Justice Department. \nLanny Breuer, who served as the assistant attorney general for the criminal division at the time, said the so-called “collateral consequences” of forcing HSBC to plead guilty -- such as the possibility of the bank losing business and shedding jobs -- “were absolutely a factor” in the department’s decision to seek a settlement rather than pursue criminal charges. \nIn 2013, former Attorney General Eric Holder said the size of big banks made it more difficult for the Justice Department to prosecute them, though he later attempted to walk back that comment after a public outcry. \nSince then, the Justice Department has attempted to toughen its stance against banks accused of misconduct. BNP Paribas, the big French bank, pleaded guilty in June 2014 to helping rogue nations evade U.S. sanctions. \nAnd on May 20, JPMorgan and Citi each pleaded guilty to criminal federal antitrust violations for their traders’ participation in what Attorney General Loretta Lynch described as “a brazen display of collusion” in a years-long, trans-Atlantic scheme to manipulate currency markets for profit. \nThe pleas were heralded as a major coup for federal prosecutors, and the two banks paid a combined $1.5 billion in fines for violating the Sherman Antitrust Act -- penalties Lynch said “appropriately reflect the conspiracy’s breathtaking flagrancy, its systemic reach and its significant impact.” \nCiti and JPMorgan each told the Securities and Exchange Commission that the pleas were the result of a single employee’s conduct, federal records show. But to Lynch, the guilty pleas “serve as a stark reminder that this Department of Justice intends to vigorously prosecute all those who tilt the economic system in their favor; who subvert our marketplaces; and who enrich themselves at the expense of American consumers.\" \nGuilty Pleas Coincided With New HUD Proposal \nAs early as October 2014, federal prosecutors had been seeking guilty pleas from big U.S. banks for their currency crimes, according to the news reports. Multiple outlets in February and March said that the Justice Department wanted JPMorgan and Citi to plead guilty to federal antitrust charges. \nCiti warned investors on May 11 that a settlement with the Justice Department resolving the currency market allegations “could include a guilty plea on an antitrust charge.” JPMorgan told investors on May 14 that “any resolution acceptable to [the Justice Department] would require that the firm plead guilty to an antitrust charge.” HUD Secretary Julián Castro with President Barack Obama. | Credit: Bloomberg via Getty Images \nOn May 15 -- five days before Citi and JPMorgan entered their guilty pleas -- HUD proposed to eliminate its requirement that lenders working with the agency certify they haven't been convicted of non-mortgage related felonies. \nHUD oversees the Federal Housing Administration, which insures lenders against losses they’d sustain if borrowers default on their mortgages. First-time homebuyers, borrowers with spotty credit, and those who can’t afford big down payments all benefit from FHA financing because lenders would otherwise charge them much higher rates on their mortgages, or decide not to lend them any money at all. \nThe agency’s insurance program provides “a huge economic stimulation to the country in the form of home and community development,” according to its own description. \nIn return for shedding the risk of borrower defaults and promoting easier access to credit, the federal government requires lenders to meet certain standards and uphold certain promises to borrowers and taxpayers. Currently, lenders must submit a certification with every loan application that they haven't been convicted of violating any major crimes in the preceding three years -- such as fraud, falsification of records, forgery or making false statements. Lenders also must certify that they haven’t been convicted of violating federal antitrust laws. \nA federal judge still needs to accept Citi and JPMorgan’s guilty pleas -- but once that occurs, the banks will officially become felons convicted of violating the Sherman Antitrust Act. They’d then, seemingly, be unable to make FHA-insured mortgages. \nBut if HUD removes its requirement for lenders to certify they haven’t been convicted of major crimes, JPMorgan and Citi can continue to participate in the agency’s FHA program -- unless the lenders are convicted of mortgage-related misconduct, the Obama administration says. \nYet state and federal authorities have accused Citi and JPMorgan of various mortgage misdeeds in the past. In 2012, the two banks, along with three others, struck a settlement with the housing agency and other authorities that resolved allegations they had illegally robo-signed foreclosure documents and otherwise mistreated distressed borrowers seeking to modify their mortgages in violation of federal rules. They also settled allegations they had defrauded the housing agency. \nHUD's Biggest Concern \nDespite evidence of the banks' misconduct, government officials and industry executives who pressed for the HUD's policy change said the agency's main concern was expanding access to mortgage credit. \nMore than a dozen lenders have been ensnared in federal investigations probing whether they defrauded FHA in the wake of the Great Recession, which saw millions of borrowers default on their mortgages. The Obama administration seized on lenders’ certifications, which accompanied loan applications, to claim they had lied to the federal government about the quality of their FHA-insured loans. Thanks to the False Claims Act , a Civil War-era law that allows the government to recover damages worth three times the actual harm plus additional penalties, the administration recovered billions of dollars in damages -- JPMorgan, for example, agreed to pay $614 million last year, and Citi agreed to pay $158 million in 2012. \nBut the investigations and settlements prompted an industry backlash. Lenders and their representatives in Washington are still arguing that the Justice Department is targeting them over so-called “ foot faults ,” or minor infractions that played little role in a borrower’s mortgage default. \nSignificantly for HUD, lenders have also complained that the Justice Department’s investigations and lawsuits have led them to curtail credit. The prospect of additional fines pushed some big FHA lenders, including JPMorgan, to retreat from the market. Others increased their requirements for an FHA-insured mortgage, eschewing the kind of borrower who typically received FHA mortgages in the past. For example, many lenders have demanded higher credit scores. JPMorgan Chase Chief Executive Officer Jamie Dimon | Credit: Bloomberg via Getty Images \nThat response from banks raised concerns among borrower advocacy groups and civil rights organizations that perhaps the Obama administration had gone too far in holding lenders accountable for their mistakes. \nResearchers at the Washington-based Urban Institute argue that mortgage lending has become unnecessarily restrictive as a result of Justice Department litigation. It’s now much harder for Americans with mediocre credit to qualify for an FHA mortgage. Some banks, including JPMorgan, have sharply reduced their FHA activity, and consumer groups want to jump-start more mortgage lending. \nIn a nod to those concerns, federal officials have sought to clarify the guidelines for lenders over the past year, so they won’t fear possible government lawsuits if they continue participating in the government mortgage insurance program. \nJustice Department officials informally approved HUD's changes, according to people briefed on the internal government discussions. So did the White House budget office, at least initially. The White House budget office could push HUD to alter its proposal before it's finalized. \nBut officials at the Justice Department said the new policy didn’t limit their ability to bring future lawsuits under the False Claims Act. \nLabor, Consumer and Civil Rights Groups React To The Proposal \nIn announcing its May proposal, HUD didn’t play up the fact that it wanted to delete the certification requirement. Nor did it explain the rationale for its proposal. \nThe agency and the White House argued that because the proposed changes didn’t constitute a significant alteration of a regulation or policy, HUD didn’t need to request public comment about the deleted certification requirement, according to people briefed on the internal deliberations. Instead, the agency requested public comment on the new version of the loan application form under the Paperwork Reduction Act, a federal law that aims to minimize the paperwork burden when the government collects information from the public. \nBut officials at HUD's inspector general were upset they weren’t consulted, people briefed on the discussions said. Marta Metelko, a spokeswoman for HUD's inspector general, declined to comment. \nLikewise, traditional Obama administration allies criticized HUD’s seeming gift to Citi and JPMorgan, even though they support the housing agency’s efforts to increase mortgage lending. The Center for American Progress, National Consumer Law Center, and Consumer Federation of America wrote in a joint July 14 letter to HUD that they were concerned that the proposal had been secretly developed and not adequately justified. \nIn a separate July 14 letter, other prominent groups -- including the AFL-CIO, Center for Responsible Lending, NAACP and the National Council of La Raza -- urged the housing agency to drop its effort to allow banks convicted of felonies to remain in the government’s mortgage insurance program. \n“We oppose any steps that weaken the language or standards for lender disbarment,” the labor, consumer and civil rights groups said. \nBut David Stevens, a former FHA chief who left the agency to become chief executive of the Mortgage Bankers Association, said the existing certification was unnecessary and counterproductive. \nFirst, Stevens said, the form accompanying loan applications is usually completed by low-level loan employees -- not executives who are aware of the lender’s various legal issues. “There’s just no way someone signing this certification could have that level of knowledge,” he said. \nSecond, the consequences of not adopting the housing agency’s proposed changes would ultimately hurt the housing market if major lenders are forced to exit the government lending program. \nThe criticism against the housing agency for wanting to change the form is “overblown,\" Stevens said. Kicking out lenders such as Citi and JPMorgan would be an “overstep,” he added. \nGuilty Pleas Without Consequences It would also run counter to the Justice Department's record of striking deals with banks suspected of misconduct. Normally, banks convicted of violating money-laundering laws automatically face federal hearings to determine whether their banking license should be revoked. Yet federal prosecutors have allowed lenders suspected of money laundering to enter into deferred-prosecution agreements, or have charged them with lesser violations, such as failing to report suspicious activity to government authorities, to avoid these hearings, said Brandon Garrett , a professor at the University of Virginia law school and author of the book “ Too Big to Jail .” Attorney General Loretta Lynch | Credit: Chip Somodevilla/Getty Images In just the past six years, the Swiss bank UBS and federal prosecutors have struck two nonprosecution agreements and one deferred prosecution agreement for activities including bid-rigging in the U.S. municipal debt market, manipulating key interest rates, and helping Americans evade their taxes . The bank pleaded guilty to the interest rate charge this year after the Justice Department determined that the bank violated its 2012 nonprosecution agreement. Federal prosecutors said UBS’s currency traders and sales staff deceived clients and conspired to restrain competition in foreign exchange markets. \nOther federal agencies have also sought to soften the blow for big banks accused of crimes. Federal securities regulators and the Department of Labor -- which oversees managers of private-sector pension plans -- have given waivers to criminally charged banks following settlements with federal prosecutors. \nIn the days leading up to BNP’s June 2014 guilty plea, officials from the Justice and Labor departments discussed the pending settlement, according to emails obtained by Public Citizen , a nonprofit that keeps tabs on the federal government and big business. The group obtained the e-mails under the Freedom of Information Act and shared them with The Huffington Post. Numerous big banks, including JPMorgan and Citi, have also received multiple waivers from the SEC allowing them to conduct business as usual after striking settlements or pleading guilty to crimes, even after being accused of violating the same rules over and over. \nAccording to federal records, both JPMorgan and Citi requested waivers from the SEC so they could continue quickly selling new shares -- a privilege normally reserved for large companies that comply with the law -- despite their impending felony convictions. The Justice Department agreed to delay sentencing until after the two banks secured waivers from the Labor Department so their business units could continue managing U.S. pensions, court filings show. \nOn May 20 -- the same day Citi and JPMorgan’s plea agreements were announced --the SEC granted the waivers without public debate. In similar cases, the SEC took weeks to decide on waiver applications. \n\"It is troubling enough to consistently grant waivers for criminal misconduct. It is an order of magnitude more troubling to refuse to enforce our own explicit requirements for such waivers,” Kara Stein, an SEC commissioner, said in May . “This type of recidivism and repeated criminal misconduct should lead to revocations of prior waivers, not the granting of a whole new set of waivers.\" \nMeanwhile, buried in the banks' plea agreements with the Justice Department were promises from federal prosecutors that they would aid the banks in trying to clean up any fallout from their guilty pleas, removing their sting. \nThose promises included a guarantee that the Justice Department, if asked, would advise other federal agencies of the “ fact, manner, and extent ” of Citi’s and JPMorgan’s cooperation with prosecutors. \nIn effect, JPMorgan and Citi pleaded guilty to felony criminal charges, but the SEC and the Justice Department are helping them avoid the often debilitating consequences that come with being a felon. \n\"Two Systems of Justice\" \nIn a report last month , the Democratic staff on the House Financial Services Committee slammed federal regulators for routinely granting big banks exemptions from rules designed to penalize misconduct. Rep. Maxine Waters (D-Calif.), pictured, along with Sens. Sherrod Brown (D-Ohio) and Elizabeth Warren (D-Mass.), have criticized HUD's proposal | Credit: Alex Wong/Getty Images \n“Neither banks nor their customers are well-served when regulators rubber-stamp their requests for waivers,” the Democrats said in the July 21 report. “Until bad actors in the banking industry have to deal with the collateral consequences of their actions, it is unrealistic to expect bad actors to behave any better.” \nFederal authorities have “done little to dispel the sentiment that no one will ever be brought to justice,” the committee's Democratic staff said. \n“We’ve got two systems of justice,” said Bartlett Naylor, financial policy advocate for Public Citizen. “The judicial system is pretty harsh on individuals who can’t afford major Wall Street law firms -- many of whose partners previously were officials at the Justice Department. But when it comes to criminal banks, we have de facto policies within the Justice Department that protect banks from ... accountability.\" \nIn contrast to the federal government’s lenient stance toward banks, HUD oversees public housing authorities and landlords who can be extremely unforgiving of residents accused of crimes, critics of the proposed changes say. \nPublic housing authorities can evict tenants for suspected criminal activity regardless of whether they've actually been arrested or convicted, according to research published in 2013 in a HUD policy journal . \nThe Obama administration has taken limited steps toward aiding ex-offenders. Shaun Donovan, the White House budget chief who preceded Castro as housing secretary, in 2011 and 2012 urged public housing authorities and landlords to use their discretion when it came to allowing ex-offenders to reunite with relatives in HUD-subsidized homes. \nBut researchers writing in the HUD policy journal criticized that approach as lacking, arguing that simply relying on public agencies and landlords to use their discretion “is not necessarily effective.\" \nTenants accused of wrongdoing are often bullied by property managers into accepting settlements that force them out of the building, said Runa Rajagopal, the attorney from The Bronx Defenders. Rajagopal has represented clients with felony convictions who had to show they were sorry for their past crimes, prove they’d turned their lives around and convince housing authorities that they’ll never again break the law in order to be allowed back into public housing. \nFew are successful, she said. \n“Vulnerable communities have to jump through all these hoops ... to demonstrate they are worthy of assistance,” Rajagopal said. \"They are routinely denied access to public housing, whereas for these banks -- we’re going to just give you a pass, just because you’re banks.”", "external_links": [], "published": "2015-08-11T19:24:00.000+03:00", "crawled": "2015-08-12T17:38:16.599+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}