{"organizations": ["Blue America", "Keeper Alliance", "Lehman College"], "uuid": "49ae08bfc3dd54b67657d4d4f041bad7bf66dd97", "thread": {"site_full": "edition.cnn.com", "main_image": "http://media2.s-nbcnews.com/j/newscms/2015_31/1152386/obama_5f1c3defea992993f895bf11befbc7ee.nbcnews-fp-1200-800.jpg", "site_section": "http://feeds.feedburner.com/google/AOpN", "section_title": "obama news - Google News", "url": "http://edition.cnn.com/2015/08/02/politics/obama-climate-change-plan/", "country": "IL", "title": "How Obama Is Reinventing the Bully Pulpit in 'Blue America' - NBCNews.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "How Obama Is Reinventing the Bully Pulpit in 'Blue America' - NBCNews.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T11:44:00.000+03:00", "replies_count": 0, "uuid": "49ae08bfc3dd54b67657d4d4f041bad7bf66dd97"}, "author": "", "url": "http://edition.cnn.com/2015/08/02/politics/obama-climate-change-plan/", "ord_in_thread": 0, "title": "How Obama Is Reinventing the Bully Pulpit in 'Blue America' - NBCNews.com", "locations": ["New York", "Bronx"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Perry Bacon Jr", "Obama"], "text": "Aug 2 2015, 4:58 am ET How Obama Is Reinventing the Bully Pulpit in 'Blue America' by Perry Bacon Jr. President Barack Obama speaks at the launch of My Brother's Keeper Alliance at Lehman College in the Bronx borough of New York, Monday, May 4, 2015. AP Share advertisement \nWith almost no input from Republicans, President Barack Obama has advanced much of his domestic policy agenda in \"Blue America,\" getting liberal-leaning cities and states to take up ideas that can't be adopted nationally because of opposition on Capitol Hill. \nIn State of the Union addresses over the last three years and other speeches, the president has proposed a series of ideas, such as universal preschool, that have not caught on in Congress. \nThe president and his aides have aggressively used the bully pulpit to push cites, states and corporations to adopt these proposals, often with little support or funding from Washington. \"For $80 billion, we could have universal preschool for every 3-year-old & 4-year-old in America\" — @POTUS on what we spent on incarcerations advertisement \nMore than 50 cities have set up programs to help young black and Hispanic males as part of Obama's \"My Brother's Keeper\" initiative, 14 states and a number of large cities like Los Angeles have raised their minimum wage, corporations like McDonald's and Microsoft and cities like Atlanta have expanded paid sick and family leave programs for their workers. New York City created universal preschool, and 34 states have expanded their preschool programs since Obama advocated the idea in his 2013 State of the Union address, according to White House officials. \nRelated: Los Angeles City Council Passes Minimum Wage Hike \nOregon over the last few weeks has created a program to allow students to attend two years of community college nearly tuition-free and mandated businesses offer employees at least five paid sick days a year, both Obama administration initiatives. \n\"When he (Obama) mentioned it, it helped in some regard because people could see Mark Haas' wasn't crazy, it was a mainstream idea,\" said Oregon state senator Mark Haas, a Democrat referring to the president's speeches advocating free community college. \nHaas was the author of the state's community college bill. A student in line for his diploma wears a cap decorated with the cost of his education during graduation ceremonies at the University of Idaho in Moscow, Idaho., Saturday, May 16, 2015. Orlin Wagner / AP \nThe gridlock in Washington reflects the intense divide between Republicans and Democrats. \nSo does the president's success in getting his ideas adopted outside of Washington. \nNearly all of these policy changes have happened in \"Blue America,\" cities and states with Democratic mayors or governors who back the president. \nThe left-leaning city of Louisville raised its minimum wage late last year, while Kentucky's conservative U.S. senators opposed a federal minimum wage increase. advertisement \n\"The administration has been very deliberate in pursuing a strategy of taking these debates around the country, working with state and local governments and working with corporations and the private sector as well to make sure we're making progress on things that are the president's priorities,\" said Cecilia Muñoz, Obama's top domestic policy adviser, in an interview with NBC News. Copy this code to your website or blog <iframe width=\"635\" height=\"500\" src=\"http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=n_rundown_munoz_140609\" scrolling=\"no\" frameborder=\"0\"></iframe> \nIn many ways, the push for action at the state and local level reflects Obama and other progressives catching up to conservatives' strategy of investing in policy outside of Washington. Republicans control the majority of state legislatures and governor's offices in the country, and they are pressing their agenda in a number of states, often rebutting Obama's priorities. \nOklahoma and Michigan, both of which have GOP governors, have passed provisions over the last year that bar cities in those states from increasing the minimum wage on their own. Even as Louisville hikes its minimum wage, several more conservative cities and counties in Kentucky have enacted right-to-work laws, which Obama opposes. advertisement \nObama is following, not leading, on some issues, proposing them nationally in part because they already had momentum in states. \nEven conservative places like Oklahoma had launched universal preschool programs in their states before Obama proposed the idea nationally. Progressives have been pushing to increase the minimum wage and expand sick leave programs for workers for decades. \nNew: Obama Pushes for Paid Leave \nIn an interview with NBC News, Oregon Gov. Kate Brown, a Democrat, said that the policy changes in her state reflect not just a push from the White House, but a broader coalition on the left. \nShe said she reads \"Governing,\" a magazine focused on state policy, to find new policy ideas as well as talking to officials at the city level, like New York Mayor Bill de Blasio, who called to congratulate Brown after the sick leave law was enacted. Both chambers in Oregon's state legislature are Democratic. \n\"The states and the local governments are the innovators, we are the petri dishes that help cultivate good ideas,\" said Brown. \nThe administration acknowledges many of these ideas were percolating locally. But they argue Obama's advocacy helps put them in the mainstream. \nOregon officials, in pushing their community college plan, highlighted the work of Tennessee, which the president had mentioned in his 2015 State of the Union address. The \"My Brother's Keeper\" program has spurred a number of corporations, including the National Basketball Association, to create or expand mentoring programs for black and Hispanic men. Copy this code to your website or blog <iframe width=\"635\" height=\"500\" src=\"http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=x_30_lw_brotherskeeper_140228\" scrolling=\"no\" frameborder=\"0\"></iframe> \nThe District of Columbia enacted a policy earlier this year that bans schools from suspending kids in preschool, one of the policy ideas that the administration has pushed through My Brother's Keeper. \n\"We've learned that by putting down a marker, the president can really elevate debates in a way that helps them really take off around the country,\" said Muñoz. \nAnd the administration has adjusted the roles and duties of its staffers to reflect this approaching, having them work on policy in states and cities as well as with Congress. \nBroderick Johnson, a senior adviser to the president whose official role is coordinating the Cabinet, in fact spends much of his time working with cities and groups on developing their MBK programs. Labor Secretary Tom Perez and Valerie Jarrett, Obama's longtime senior adviser, have flown to cities all over the country encouraging local officials and businesses to adopt paid sick leave and family leave programs. \nWhite House aides write policy briefs tailored to states, explaining how increasing the minimum wage and or expanding preschool will have help local communities. Aides in the White House's public engagement and intergovernmental affairs operations, run by Jarrett, are constantly tracking what is happening in cities and states and looking to advance Obama's agenda. \nWhen Republicans in the Missouri state legislature last month pushed through a bill that would have banned cities in the state from increasing the minimum wage, one of Jarrett's aides called the office of Missouri Governor Jay Nixon, who is a Democrat, and urged him to veto the legislation, which he did. Jarrett herself intervened earlier this year, urging state lawmakers in Pennsylvania not to pass a provision that would have weakened a paid sick leave law in Philadelphia. Copy this code to your website or blog <iframe width=\"635\" height=\"500\" src=\"http://player.theplatform.com/p/2E2eJC/nbcNewsOffsite?guid=nn_05_cm_jarrett_140627\" scrolling=\"no\" frameborder=\"0\"></iframe> \nWhen Obama visited Oregon in April, administration aides made sure he spoke with Haas, the author of the community college proposal, which had not passed back then. \n\"I told the president of the United States 'we're going to pass this thing,' so the pressure was on,\" Haas said. \nThere is an obvious limit to this approach: Congress controls much of the government's money, and they are not working with Obama on many these projects. \nMBK calls on cities and states to take steps like creating mentoring programs and suspending fewer young black male students, initiatives that cost little money. The cost of paid leave programs and increases to the minimum wage are incurred by private companies and potentially the workers themselves, not the government directly. \nOnly a few, very progressive states like California have dramatically expanded preschool, which is more expensive. And only Oregon has recently adopted universal community college programs, another costly idea. \nOne of the goals of the working with cities and states, says Muñoz, is to \"create momentum that will bring these debates back to Washington, so that Congress will get in on the game.\" \nRelated: GOP senator calls universal pre-K a 'great idea,' but questions funding \nBy that measure, the administration is having little success. Republicans in Congress remain strongly opposed to universal preschool and family leave programs and are not proposing to increase the federal minimum wage. \nBut this approach suggests a model for a future president, in an era of divided government where passing major legislation in Washington may be impossible. \nBefore her presidential campaign started, Hillary Clinton was using the controversial foundation she ran with her husband and daughter as a way of raising issues in the same way Obama has from the White House. \nPennsylvania Sen. Rick Santorum has said he would use the bully pulpit of the presidency to promote marriage if elected. \nWisconsin Gov. Scott Walker, another of the leading GOP candidates, has urged other states to adopt policies to limit the power of labor unions, as he has done in Wisconsin. \nHe could use the presidency as a way to encourage conservative cities and states to enact right-to-work laws, even if Democrats in Washington block any kind of national policy limiting unions. \nObama's team of course is hoping some of their changes will outlast the president and continue even after he leaves office, no matter who is his successor. \n\"Local folks making local decisions play a really strong role in this administration,\" said Jerry Abramson, the former mayor of Louisville who is now the director of intergovernmental affairs at the White House. \"And I think that other presidents who understand the power of local and state elected officials and advocacy groups, I would think would follow that lead.\" Perry Bacon Jr.", "external_links": [], "published": "2015-08-02T11:44:00.000+03:00", "crawled": "2015-08-02T23:30:39.439+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}