{"organizations": ["CNN"], "uuid": "131e219b3fd6d38e8ca91934b47339174a78cbf6", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/08/19/WE01233262/3668313/InterpretingObamasImmigrationOrd-3668313_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1264914", "country": "", "title": "Interpreting Obama’s Immigration Orders - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Interpreting Obama’s Immigration Orders - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "131e219b3fd6d38e8ca91934b47339174a78cbf6"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1264914", "ord_in_thread": 0, "title": "Interpreting Obama’s Immigration Orders - CNN iReport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Interpreting Obama’s Immigration Orders By noblex | Posted 22 hours ago \nhttp://www.listfree.org/167241-interpreting-obamas-immigration-orders.html \nIt wasn’t that long ago that President Obama issued a variety of Executive Actions designed to force reform within the nations’ immigration system. As was expected, those orders have been challenged at every turn from coast to coast with many questioning their legality. It has been enough to keep immigration lawyers in Illinois busy with requests from clients wanting to know if they qualify under the terms set forth by said orders. \nThis past month, the Fifth Circuit heard arguments seeking to block these executive actions from taking place. The case brought forth by the State of Texas is seeking to reverse Obama’s executive actions. The court has yet to rule, but with 11 million undocumented immigrants in the United States; nearly 525,000 in Illinois, it’s a ruling that many people are eagerly anticipating. \n“Oral arguments were presented to the Fifth Court from the US Department of Justice seeking to reverse the preliminary injunction blocking implementation of these executive actions. These actions would expand the Deferred Action for Childhood Arrivals as well as Deferred Action for Parents of Americans and Lawful Permanent Residents, more commonly referred to as DACA and DARPA,” commented Ronald Shapiro, and immigration lawyer in Illinois. \nAs of today, it is unclear whether the court will reverse the injunction. Given the court’s conservative stance on many issues, it’s unlikely that they will. In fact, the court has shown considerable disdain for the executive actions from day one. \n“This May, the court sided with Texas on the issue. I can say that it’s unlikely that they’ve changed their opinion since then. While they have shown a willingness to listen to new arguments, that shouldn’t be taken as a sign that they’re willing to change their position. Indeed, they have reputation for being generous with new arguments. That doesn’t mean they will be swayed by them,” observed Ronald Shapiro. \nShould the court uphold the injunction, it’s certain that the case will be put before the Supreme Court. If that happens, it will be mid-late summer 2016 before the issue could be decided. TAGS: ", "external_links": [], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-20T22:24:47.259+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}