{"organizations": ["Fox News"], "uuid": "a2aae3378d003b161885dc32b55d692daaeb0fa8", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/PKG0849-080615FNLVIVERITO-3QUS3VIA_FNC_080615_14-08.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/17/nyc-council-speaker-wants-her-voice-on-immigration-heard-on-national-stage/", "country": "", "title": "NYC Council speaker wants her voice on immigration to be heard on national stage | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "NYC Council speaker wants her voice on immigration to be heard on national stage | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "a2aae3378d003b161885dc32b55d692daaeb0fa8"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/17/nyc-council-speaker-wants-her-voice-on-immigration-heard-on-national-stage/", "ord_in_thread": 0, "title": "NYC Council speaker wants her voice on immigration to be heard on national stage | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francis"], "text": "Pope Francis will sit in chair made by Latino day laborers \nNew York City’s second most powerful elected official, Melissa Mark-Viverito, says she’s looking to become a household name nationwide this presidential election in an effort to help the Democrats campaign on issues like immigration and criminal justice. \n“I’m looking to play a really important role, or a role in general, for the issues that are important to me,” New York City Council Speaker Mark-Viverito said to Fox News Latino. “I definitely want to lend my voice to whatever candidates I decide to support, whether for president or in terms of Congress. I will be lending my voice in that way.” \nSince Mark-Viverito, 46, became the city’s first Latina City Council Speaker in January 2014, she has been an outspoken proponent of immigration reform and believes she can sell her pro-immigrant reform message to voters nationwide. \n“We have done some great work on immigration, in particular in New York City, and we would love to see that serve as a model across the nation,” Mark Viverito said. \nFor her part, the Puerto Rican-born lawmaker said she is relishing the opportunity to launch attacks on Republicans for what she says are out-of-touch immigration policies. She said some Republicans – with their harsh tone on immigration – have all but guaranteed that Democrats have sewn up the Latino vote. \n“Those candidates,” Mark-Viverito said, “do not reflect in any way the issues and interests that [Latinos] have as a community.” \nDemocratic National Committee said it's eager to have her as a vocal ally over the next 15 months. \n“Melissa Mark Viverito is a wise Latina politico that only NYC can create and who immigrants in the U.S. need now more than ever,” said DNC spokesman Pablo Manriquez. “During a time when no Republican candidate has the courage to stand up for immigrants in the face of Donald Trump’s mass deportation agenda, she remains a principled and tireless advocate for our immigrant and Latino families and communities. She brings it every day on the City Council with the compassion and ferocity Latinos everywhere can appreciate.” \nThe Republican Party notes they have made inroads with Hispanics, pointing to their positive results during the midterm election last fall – particularly in key battleground states like Florida and Colorado. Despite accusations of being out of touch with Hispanic voters, GOP candidates won key senatorial and gubernatorial races thanks, in part, to relatively strong support from Latino voters. \nNew York Republicans who are familiar with Mark-Viverito say they are confident her record as speaker will sour any attempts by her to win over Hispanic voters nationwide. \n“[Mayor] Bill de Blasio and his biggest ally, Speaker Mark-Viverito are a godsend to the Republican Party,” said New York Republican State Committee chairman Ed Cox. “Under their watch, the city's crime rates are spiking, quality of life is deteriorating and the public education system is embroiled in scandal; they are throwing the city back to its terrible era of crime and grime from all of which Hispanics suffer disproportionately.” \nMark-Viverito is known for her strong advocacy on policies that are sympathetic to undocumented immigrants. \nShe is the driving force behind the city’s municipal identification card program, the largest program of its kind in the country, which provides government-issued IDs to New Yorkers regardless of their immigration status. \nShe is also a staunch supporter of so-called “sanctuary cities,” which protect and shelter undocumented immigrants from deportations under federal immigration law. \nThe speaker is also a big supporter of President Barack Obama’s directive that created Deferred Action for Child Arrivals, which deferred deportation for children illegally brought to the U.S., and was eager to implement an executive order that sought to expand that program before a federal court judge in Texas blocked the order. \nShe said she sees immigration reform as the central presidential campaign issue that will decide the Latino vote in the United States. And, she said, she looks forward to taking her message to the national stage during the coming months. \n“Even me as a Puerto Rican, as a born U.S. citizen, immigration reform is critically important to me,” Mark-Viverito said. “It’s something I’ve advocated for and fought for and not one of these [Republican] candidates is really talking about that, actually walking away from the idea of developing any sort of plan for comprehensive immigration reform if president, and that’s a real problem.” \nBryan Llenas currently serves as a New York-based correspondent for Fox News Channel (FNC) and a reporter for Fox News Latino (FNL). Click here for more information on Bryan Llenas . Follow him on Twitter @BryanLlenas . \nLike us on Facebook ", "external_links": [], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-19T01:21:24.626+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}