{"organizations": ["Taylor Swift", "Congress", "CNN"], "uuid": "c425ea90c2bd739948b87df9f7cc1ed6181de9de", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/12/politics/john-kasich-immigration/index.html", "country": "", "title": "Kasich leaves door open on immigration, supports abortion exceptions - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Kasich leaves door open on immigration, supports abortion exceptions - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "c425ea90c2bd739948b87df9f7cc1ed6181de9de"}, "author": "", "url": "http://www.cnn.com/2015/08/12/politics/john-kasich-immigration/index.html", "ord_in_thread": 0, "title": "Kasich leaves door open on immigration, supports abortion exceptions - CNNPolitics.com", "locations": ["America", "U.S.", "Washington", "Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dana Bash", "Kasich", "John Kasich"], "text": "Kasich weighs in on illegal immigration 03:48 Story highlights He likened granting immediate citizenship to cutting the line at a Taylor Swift concert Kasich also explained that he no longer supported ending birthright citizenship Washington (CNN) Ohio Gov. John Kasich said Wednesday he would complete a border fence and crack down on illegal immigration if elected president, but he refused to slam the door on a possible pathway to citizenship for undocumented immigrants already in the U.S. \"I would prefer for them to be legalized once we find out who they are because they can -- I think they contribute a lot to America,\" Kasich told CNN's Dana Bash on \"The Lead.\" \"They're hard workers, they're God-fearing, they're family-oriented. If they committed a crime, they've got to be deported or put in prison, but the only reason I say that is we have to solve this.\" He likened granting immediate citizenship to cutting the line at a Taylor Swift concert: \"I don't favor citizenship because, as I teach my kids, you don't jump the line to get into a Taylor Swift concert.\" But Kasich declined to entirely dismiss the possibility. \"Let me be clear, I don't favor it and I'm not sure we would ever have to do that. Let's make citizenship, getting in here legally. That's my view on it. But I'm just not going to pound the table on all these things and say my way or the highway. I will on some things, but I've got to be careful about that.\" He explained his reasoning, saying he thinks about what it would be like to actually be president. \"I actually think about what it would be like to be president,\" Kasich said. \"So if you ever notice when people run for president, they make lots of promises and they never keep them. ... And you know why? Because they make promises they can't keep because they don't know any better.\" Kasich also explained that he no longer supports ending birthright citizenship -- something he backed while he was in Congress. \"When I think about it, I don't believe it should be a fundamental part of this whole thing because I think it remains dividing to people, to be honest with you,\" Kasich said when asked about the change.   \"I think we need to get over that. I'm not for it anymore. Let these people who are born here be citizens and that's the end of it. I don't want to dwell on it,\" he said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics ", "external_links": [], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-15T05:40:31.632+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}