{"organizations": [], "uuid": "9ce4118aeae39b6cbad10c67d503f5d11f987a35", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55de225c1700004301568add.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/news.xml", "section_title": "Women News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/barack-obama-wnba-champions_55de211ee4b08cd3359e6ecd", "country": "US", "title": "Obama Takes Shots At WNBA Champions", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Takes Shots At WNBA Champions", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T23:49:00.000+03:00", "replies_count": 0, "uuid": "9ce4118aeae39b6cbad10c67d503f5d11f987a35"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/barack-obama-wnba-champions_55de211ee4b08cd3359e6ecd", "ord_in_thread": 0, "title": "Obama Takes Shots At WNBA Champions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Takes Shots At WNBA Champions The Phoenix Mercury beat his hometown team, the Chicago Sky, in the finals. Posted: 08/26/2015 04:49 PM EDT \nWASHINGTON, Aug 26 (Reuters) - President Barack Obama welcomed the Phoenix Mercury to the White House on Wednesday but chided last season's WNBA champions for beating his hometown team in the finals. \nThe Mercury, led by five-time Women's National Basketball Association scoring champion Diana Taurasi, won a record 29 regular season games en route to their third championship. \n\"I would be happy to be here, except that the Mercury getting here involved beating the Chicago Sky in the finals,\" Obama, a Chicago native, joked at the East Room ceremony. \"In fact, Diana, backstage, was trash-talking me.\" ASSOCIATED PRESS \n\"You have kept yet another Chicago sports team from getting into the White House. But there's always next year.\" \nThe Mercury swept the Sky in three straight games to claim the title. \nObama praised the players for the charitable work they are doing in the Phoenix area, saying \"this is a team that I think is representative of what the WNBA is all about.\" \n\"They're doing good in their community,\" he said. \"They're great athletes. They and women across the WNBA are changing the way that young girls, including my daughters, see themselves.\" JIM WATSON via Getty Images \nThe president said he has seen a shift in attitude over the last 20 years so that women now are routinely seen as \"great athletes and great leaders.\" \n\"And that does not happen unless these outstanding women perform the way they do,\" he said, before adding with a chuckle, \"Plus they look so good. They clean up pretty good.\" \n(Reporting by Steve Ginsburg; Editing by Eric Beech) Olivier Douliery via Getty Images", "external_links": [], "published": "2015-08-26T23:49:00.000+03:00", "crawled": "2015-08-27T00:06:01.318+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}