{"organizations": ["Peace Corps", "CNN", "State Department"], "uuid": "5b971f44dc304d77f5c9ac4b49fe2f7a2720ebd5", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150617193157-cnne-pkg-perez-dominican-republic-haitians-immigration-deadline-00000504-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_americas.rss", "section_title": "CNN.com - Latin America", "url": "http://edition.cnn.com/2015/08/10/politics/state-department-dominican-republic-haiti-crisis/index.html?eref=rss_latinamerica", "country": "US", "title": "Peace Corps vets unite for U.S. action on Dominican immigration policies", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Peace Corps vets unite for U.S. action on Dominican immigration policies", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T11:13:00.000+03:00", "replies_count": 0, "uuid": "5b971f44dc304d77f5c9ac4b49fe2f7a2720ebd5"}, "author": "", "url": "http://edition.cnn.com/2015/08/10/politics/state-department-dominican-republic-haiti-crisis/index.html?eref=rss_latinamerica", "ord_in_thread": 0, "title": "Peace Corps vets unite for U.S. action on Dominican immigration policies", "locations": ["Haiti", "Santo Domingo", "United States", "U.S.", "Dominican Republic", "Anse-a-Pitres", "American States", "Villa Altagracia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["White", "Brewster", "Pamela White", "James Brewster", "Keane Bhatt", "Danilo Medina", "Bhatt", "Leahy"], "text": "MUST WATCH En Español: Repatriación de haitianos en R. Dominicana 08:19 The 560 signatories include volunteers dating back to the the inception of Peace Corps activities in the Dominican Republic in 1962. The letter argues for the State Department to use the Leahy amendment -- a law that allows for the withholding of U.S. aid to military forces engaged in human rights violations -- to target some Dominican units. The sway that a group of former Peace Corps volunteers will have is unclear, but one organizer behind the letter says the goal is to highlight the U.S. ties to the Dominican policies. \"This is not a question of sovereignty (in the Dominican Republic),\" Keane Bhatt, told CNN. \"This is an issue that implicates the United States as well.\" Bhatt was a Peace Corps volunteer in Villa Altagracia, a community near Santo Domingo, from 2008 to 2010. Dominican government denies violations The Dominican government stands by its policies and rejects accusations of violations of international law or human rights law as falsehoods. Some human rights organizations estimate that as many as 200,000 Dominicans of Haitian descent were left stateless. \"This is completely false,\" Dominican President Danilo Medina said in speech last month. \"And since we don't want to think that this is a malicious falsehood, but simply an error, we are going to examine where this error originated and what the reality is.\" He added: \"Simply, the only thing that has occurred is that our immigration laws are being enforced once again. Nothing more, nothing less.\" The Dominican government has also reacted strongly against the opinions of outsiders. The response to a call from the Organization of American States for additional dialogue between the Dominican Republic and Haiti, which share one island was sharp. \"We have already said previously: there is no possibility of dialogue between the Dominican Republic and Haiti as long as the Haitian government's attacks and plans to discredit our country continue,\" the government statement said. \"We reiterate that the immigration policy of the Dominican Republic is a domestic matter and we won't accept any outside interference from any person or organization.\" Moderate U.S. response U.S. Ambassador to the Dominican Republic, James Brewster, and the ambassador to Haiti, Pamela White, visited the border area between the two counties to assess the situation. \"Ambassadors Brewster and White observed a peaceful situation along the border at the time of their respective visits,\" which took place July 14 and July 16, respectively, a State Department spokesperson told CNN. \"We are still concerned with systemic issues, including the lack of clear protocols for deportations and the possibility that persons will be rendered stateless.\" In light of the tent settlements that have been erected in the south, near the Haitian border city of Anse-a-Pitres, the spokesperson said, \" We continue to monitor the significant increase in migrants returning to Haiti, which is now in the tens of thousands.\" The purpose of the letter from the former Peace Corps volunteers is to express that the time to monitor the situation is over and it is time to act, Bhatt said. The campaign involves no current Peace Corps volunteers -- only former volunteers -- and is not intended to put current volunteers at odds with the Dominican government, Bhatt said. \"This is not a criticism of the Dominican people,\" Bhatt said, describing it as a very narrow appeal for the State Department to make use of U.S. law where it is merited. According to the Peace Corps Dominican Republic website , there are 174 volunteers in the country, and more than 4,400 volunteers total to date. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-08-11T11:13:00.000+03:00", "crawled": "2015-08-11T16:08:07.483+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}