{"organizations": ["Alaska Interagency Coordination Center", "EPA", "Senate", "National Clean Energy Summit", "Interagency Coordination Center", "NASA", "San Bernardino National Forest", "Reuters", "NOAA", "National Mining Association", "U.S. Energy Information Administration", "Shikoku"], "uuid": "56be20be9c6357ecfac03b95ced94fea74473ca3", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/02/politics/obama-climate-change-plan/index.html", "country": "", "title": "Obama to unveil major climate change proposal Monday - CNNPolitics.com", "performance_score": 10, "site": "cnn.com", "participants_count": 0, "title_full": "Obama to unveil major climate change proposal Monday - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T19:48:00.000+03:00", "replies_count": 0, "uuid": "56be20be9c6357ecfac03b95ced94fea74473ca3"}, "author": "", "url": "http://www.cnn.com/2015/08/02/politics/obama-climate-change-plan/index.html", "ord_in_thread": 0, "title": "Obama to unveil major climate change proposal Monday - CNNPolitics.com", "locations": ["North West Province", "Bali", "Lake Erie", "Rhode Island", "Western Australia", "British Columbia", "Kochi Prefecture", "California", "Greenland", "U.S.", "Indian Ocean", "Canada", "Vancouver Island", "Pacific Ocean", "Vancouver", "Pilanesberg National Park", "Alaska", "Georgia", "South Africa", "Russia", "Wisconsin", "Lake Baikal", "Muroto", "Nevada"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Clinton", "Mitch McConnell", "Luke Popovich", "Nangka", "Bush", "Tanana", "Raung", "Scott Walker", "Martin O'Malley", "Obama"], "text": "Bush, Obama spar over climate change 01:31 PLAY VIDEO RELATED: In break with Obama, Clinton 'skeptical' about arctic drilling The plan, which will also include a requirement for states to submit their own respective plans, is already being met with major opposition from congressional Republicans and governors, including Wisconsin governor and presidential candidate Scott Walker. Even before the rule was announced, many states announced plans to fight it, including some vows to take the administration to court over the new rules. Senate Majority Leader Mitch McConnell urged states not to comply with the plan in a letter to all 50 governors. Critics also said that the plan will bring unwelcome increases in electricity prices. \"This plan is all pain and no gain,\" said Luke Popovich, vice president of communications for the National Mining Association. \"That's why state leaders across the country are coming to the same conclusion -- that we should not sacrifice our power system to an unworkable plan built on a faulty interpretation of the law.\" A multi-million dollar campaign backed by the energy industry has sought to debunk the science of climate change, but polls show most Americans believe the planet is warming. Coal supplied 37% of U.S. electricity in 2012, compared to 30% from natural gas, 19% from nuclear power plants, 7% from hydropower sources such as dams and 5% from renewable sources such as wind and solar, according to the U.S. Energy Information Administration. EPA officials have conceded in the past that some of the dirtiest power plants now operating, such as older coal-fired plants, will end up shuttered as the nation shifts its reliance from traditional fossil fuel sources to cleaner alternatives. Stuff from above 12 photos Ash and volcanic gases rise from the Mt. Raung volcano's caldera and drift northwest on the Indonesian island of Java. This image was captured by the Landsat 8 satellite on July 27. Mt. Raung erupted at least 13 times in the past 25 years, according to the Smithsonian Global Volcanism program. The most recent eruption has been going for about four weeks. Ash has forced authorities to temporarily cancel flights and close airports. Hide Caption 1 of 12 Stuff from above 12 photos Algae blooms create swirls of green in western Lake Erie in this image taken July 28 by the Landsat 8 satellite. NOAA scientists predicted that the 2015 season for harmful algal blooms would be severe in western Lake Erie and possibly affect water safety. The blooms thrive when exposed to agricultural runoff, sunlight and warm temperatures. Hide Caption 2 of 12 Stuff from above 12 photos Smoke from fires near the shoreline of Russia's Lake Baikal was captured by NASA's Aqua satellite on July 27. The red spots show where fires were most active. Lake Baikal is the largest freshwater lake by volume in the world, but its water levels have dropped in recent months, according to the Reuters news agency. Hide Caption 3 of 12 Stuff from above 12 photos Alaska's Interagency Coordination Center said that 4,748,841 acres in the state had burned in wildfires by July 30. That acreage is enough to make 2015 fourth on the list of years with the most area burned. The record was set in 2004, when 6,590,140 acres burned. The town of Tanana was hardest-hit this year, with about 496,000 acres burned -- that's an area about half the size of Rhode Island. Many of Tanana's 300 residents left in June. The Landsat 8 satellite took this false-color image of the fire-scarred area on July 24, 2015. Burned forest appears brown and unburned forest is green. Hide Caption 4 of 12 Stuff from above 12 photos Slow-moving Typhoon Nangka made landfall near Muroto on the Japanese island of Shikoku on July 16. The storm became a typhoon on July 4 and traveled nearly 4,000 kilometers (2,485 miles) across the Pacific Ocean. As the storm closed in, nearly 4,000 residents of Kochi Prefecture were urged to evacuate. Hide Caption 5 of 12 Stuff from above 12 photos When astronauts look down at Earth from the International Space Station, they use coastlines to help them figure out which part of the planet they're flying over. This photo was taken by a crew member on the space station on June 6. It shows coastal lagoons with rounded islands along the Indian Ocean coastline of Western Australia. You can also see square, white ponds of the salt-extraction industry. This stretch of Australian coast has had more direct hits by cyclones than any other place on the Western Australia's coastline. Hide Caption 6 of 12 Stuff from above 12 photos A fire raging in California's San Bernardino National Forest had scorched thousands of acres by early July. NASA's Earth Observing-1 satellite took this false-color image of a burned area spanning 49 square miles (127 square kilometers) on July 3. The burned areas appear dark red because they're reflecting shortwave infrared light. Hide Caption 7 of 12 Stuff from above 12 photos Pilanesberg National Park in North West Province, South Africa, is located in one of the world's largest and best-preserved alkaline ring dike complexes. The circular features were created by an ancient volcano. This image was taken by NASA's Landsat 8 satellite on June 19. Most of the streams that run through the valleys have dried up, but man-made dams have trapped water for the park's wildlife. The structure sits about 300 to 1,600 feet (100 to 500 meters) above the surrounding landscape. Hide Caption 8 of 12 Stuff from above 12 photos Mt. Raung is seen spewing ash and volcanic gases in this image taken on July 12 by NASA's Aqua satellite. The eruption forced hundreds of flights to and from Bali and other regional airports to be canceled. The ash clouds went as high as 20,000 feet (6 kilometers) into the air. Hide Caption 9 of 12 Stuff from above 12 photos Aqua satellite took this image of sea ice on the eastern coast of Greenland on July 16. The swirls of ice are caused by winds and currents that steer the ice, according to NASA. Hide Caption 10 of 12 Stuff from above 12 photos Fires have burned thousands of acres in Alaska. NASA's Terra satellite took this photo of smoke of smoke and haze over Alaska on July 12. Fires are outlined in red. The Alaska Interagency Coordination Center says about 300 fires were actively burning when the image was taken. Hide Caption 11 of 12 Stuff from above 12 photos Fires in western Canada sent thick smoke over Vancouver and adjacent areas of British Columbia in early July. Some residents wore face masks for protection and health officials warned Women's World Cup fans against outdoor activities. NASA's Terra satellite captured these images of the smoke July 5 and 6. The smoke almost obscures the Strait of Georgia and southern Vancouver Island. Hide Caption 12 of 12 Expecting a tough fight, the White House will launch, what it describes as an \"all-out climate push\" by the President and cabinet officials to fan out to sell the plan. In the next several weeks, Obama will travel to Nevada to speak at the National Clean Energy Summit and later become the first sitting President to go to the Alaskan Arctic. The impending battle ahead could be seen as a major legacy issue for Obama as he transitions into the last quarter of his presidency. \"There are few issues more important to the president,\" a senior administration official said, adding that Obama is likely to make the case that climate change is a moral, economic and national security obligation in the months ahead. The news of the President's plan was hailed on Sunday by Democratic presidential candidates Hillary Clinton and Martin O'Malley. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Race to the White House More from Politics ", "external_links": [], "published": "2015-08-02T19:48:00.000+03:00", "crawled": "2015-08-02T19:48:36.470+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}