{"organizations": ["Fox News Latino Republican"], "uuid": "ceab38ee2d97eb94cce231da301a8b6f2179f010", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/Trump%20at%20the%20border%20WAVES.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/20/conservatives-trying-to-raise-gop-image-among-latinos-dismayed-by-tone/", "country": "", "title": "Latino conservatives dismayed by tone of immigration talk | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Latino conservatives dismayed by tone of immigration talk | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T20:15:00.000+03:00", "replies_count": 0, "uuid": "ceab38ee2d97eb94cce231da301a8b6f2179f010"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/20/conservatives-trying-to-raise-gop-image-among-latinos-dismayed-by-tone/", "ord_in_thread": 0, "title": "Latino conservatives dismayed by tone of immigration talk | Fox News Latino", "locations": ["U.S. Mexico", "Laredo", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Otero"], "text": "Latino conservatives dismayed by tone of immigration talk Published August 20, 2015 Fox News Latino Republican presidential hopeful Donald Trump waves after arriving for a visit to the U.S. Mexico border in Laredo, Texas, Thursday, July 23, 2015. (AP Photo/LM Otero) \nMany Republicans – including key figures in the party leadership – believed that Mitt Romney lost the 2012 presidential election in large part because of the poor image the GOP had among Hispanic voters. \nPeople like Republic National Committee chairman Reince Priebus vowed to persuade the fast-growing ethnic group that the party respects them and learned its lesson from that defeat. \nLeading the GOP in this effort is the steadily-growing number of Latino Republicans, who believe that most Hispanics share more views and values with the GOP than they realize. But now, many in that group are watching in frustration as the issue of immigration – wrapped in hardline rhetoric – looms over the 2016 GOP presidential candidates, thanks to the early frontrunner Donald Trump. \nThe real estate mogul and television personality plunged into the sensitive topic earlier than usual – in fact, in his announcement that he was running for the Oval Office. \nHe accused Mexico of dumping its very worst people on the United States, depicting undocumented immigrants from that nation as rapists and drug dealers, among other things. \nThen he denounced “anchor babies,” a derogatory term for children born in the United States to undocumented immigrants, and says he wants an end to “birthright” citizenship, as the granting of American citizenship to all children born in the country is known. \nAnd, of course, he’s vowed that a President Trump would round up and deport all undocumented immigrants in the nation: “They gotta go.” Perhaps we might consider letting the “good ones” try to re-enter the legal way. \nThe Republican National Hispanic Assembly lamented Trump’s remarks as “extremely counterproductive.” \nGonzalo Ferrer, the group’s national chairman, said Trump’s most recent comments about immigrants are “extremely bigoted, offensive to all Hispanic Americans, unconstitutional … and self-defeating,” according to the Wall Street Journal. \nFerrer said Trump exhibits a “reckless disregard for the harm he is causing to Republican Hispanic American families and to the Republican cause.” \nThe discourse about rescinding the citizenship of children of undocumented immigrants born here is particularly troubling to Latino conservatives, who were still trying to combat the GOP’s image in the Latino community as being anti-Hispanic. \n“Basically, they are saying, ‘We don’t want you. Get out,’” said Ferrer of Trump’s immigration ideas. \nWhat may be worse, since he began airing his views on immigration, a number of Trump’s opponents in the crowded Republican field have taken up his call against birthright citizenship or advocating mass deportation or building a border wall. \nAmong the few who haven't tried to out-Trump Trump on the issue is Sen. Marco Rubio of Florida, who has taken pains to make clear that the mogul's views do not reflect his own. \nDemocrats have wasted little time in using all the incendiary rhetoric to what they hope will be their advantage, characterizing his hard line views on immigration as vintage GOP ideology. \n\"The GOP is ignoring the lessons of the past and continuing to push the same failed policies that hurt Latinos again and again,\" said Rep. Debbie Wasserman Schultz, who is chair of the Democratic National Committee, in a statement. \"During a summer when Trump’s dangerous anti-immigrant rhetoric divided the nation, it has united the GOP with a simple, brutal and shameless message to immigrants, and especially Latinos: You are not welcome here.” \n“It’s making our effort to advance free-market, conservative principles to Latinos more difficult,” said Daniel Garza, executive director of the Libre Intiative, which describes its role as promoting “the principles of economic freedom” to Hispanics. \nJavier Palomarez, president of nonpartisan U.S. Hispanic Chamber of Commerce, told the Journal, “This is not what America does. We don’t pick on children. And we don’t break families up. That’s not the solution.” \nSome conservatives worry that Trump’s harsh talk will make it impossible for the GOP to win the 45 percent share of the Latino vote that some political observers say they’ll need to achieve next year to have a shot at winning back the White House. \nGarza said, “[That] is something we should consider, those of us on the conservative side. That now may be in jeopardy.” \nLike us on Facebook ", "external_links": [], "published": "2015-08-21T20:15:00.000+03:00", "crawled": "2015-08-21T20:15:23.104+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}