{"organizations": [], "uuid": "a3b42029aa75d0e216c843a9787076bc50b26244", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_080715getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/250613-obama-leave-dc-for-marthas-vineyard-vacation", "country": "US", "title": "Obama leaves DC for Martha's Vineyard vacation", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama leaves DC for Martha's Vineyard vacation", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T23:51:00.000+03:00", "replies_count": 0, "uuid": "a3b42029aa75d0e216c843a9787076bc50b26244"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/250613-obama-leave-dc-for-marthas-vineyard-vacation", "ord_in_thread": 0, "title": "Obama leaves DC for Martha's Vineyard vacation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama leaves DC for Martha's Vineyard vacation Getty Images By Jordan Fabian - 08/07/15 04:51 PM EDT President Obama left Washington on Friday for his family’s annual vacation on Martha’s Vineyard, Mass., hoping for a brief respite after one of the most eventful stretches of his presidency. After a nuclear accord with Iran, Supreme Court victories on same-sex marriage and healthcare, and a win in Congress on trade, Obama will escape to a rented seven-bedroom, nine-bathroom home that sits just off Vineyard Sound. “His schedule has been especially demanding in the last several weeks,” press secretary Josh Earnest told reporters Friday. “I think he would also be quick to tell you that the last several weeks have been especially rewarding for him.” ADVERTISEMENT Obama is getting a one-day head start on his vacation, which was scheduled to begin Saturday and last until Aug. 23. As on past trips, the president is expected to spend his time on the golf course, biking, hiking and dining with friends and family. But the commander in chief won’t completely avoid the demands of his job. The White House is making a major push to win congressional approval of the Iran deal, and the president could spend some of his time making calls to lawmakers to discuss the details of the agreement, Earnest said. It’s also possible Obama may cross paths with Hillary Clinton, the Democratic presidential front-runner, as they did last year . Earnest said he wasn’t sure of Clinton’s vacation plans but noted that Martha’s Vineyard “is a small island.” And if past is prologue, there’s also a chance world events could interrupt Obama’s 17-day getaway. Last year, Obama departed Washington just as the U.S. launched airstrikes against Islamic militants in Iraq. Later, Islamic State and Iraq and Syria militants beheaded American journalist James Foley. Obama was criticized for playing a round of golf after addressing Foley’s death, a decision he later admitted made for bad “optics.” The president was also forced to address racially charged riots in Ferguson, Mo., following the killing of Michael Brown by a white police officer. In a rare move, Obama returned to Washington for several days amid the events in Iraq and Ferguson. Obama and his family have vacationed on Martha’s Vineyard every year of his presidency aside from 2012, when he was running for reelection. The 8,100-square-foot home where the Obamas stay belongs to Democratic donor Joanne Hubschman. It includes an infinity pool, hot tub and a dual tennis-basketball court, according to The Martha’s Vineyard Times . Tags:", "external_links": [], "published": "2015-08-07T23:51:00.000+03:00", "crawled": "2015-08-08T00:24:58.164+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}