{"organizations": [], "uuid": "ca6eaef3fe52d1013cd1557b88de28d4f5bd32e6", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/250482-obama-admin-launches-jobs-program-for-climate-rule", "country": "US", "title": "Obama admin launches jobs program for climate rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama admin launches jobs program for climate rule", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T00:36:00.000+03:00", "replies_count": 0, "uuid": "ca6eaef3fe52d1013cd1557b88de28d4f5bd32e6"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/250482-obama-admin-launches-jobs-program-for-climate-rule", "ord_in_thread": 0, "title": "Obama admin launches jobs program for climate rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama admin launches jobs program for climate rule By Timothy Cama - 08/06/15 05:36 PM EDT \nThe Obama administration is teaming up with three major unions to encourage creation of jobs that will be needed to implement the new climate rule for power plants. \nThe Department of Energy (DOE) said Thursday that it will provide technical assistance and similar help to the Utility Workers Union of America, the International Brotherhood of Electrical Workers and the United Steelworkers, and other unions that want to join. ADVERTISEMENT The program is aimed at pushing states and others to comply with the climate rule in ways that maximum preservation and creation of jobs like upgrading power plants, installing renewable energy and building energy infrastructure, the DOE said.\n“The flexible nature of the Clean Power Plan means that states have many options to cut their pollution, help ensure reliability, and keep America’s workers on the job building our energy future,” Energy Secretary Ernest Moniz said in a statement. \n“This partnership will enable the Energy Department and our labor unions to work with the states on designing plans that maximize job creation,” he said. \nEach of the unions involved raised concerns previously about potential job losses resulting from the climate rule, which is expected to cause many coal-fired power plants to close or significantly roll back operations. \nThe International Brotherhood of Electrical Workers openly blasted the rule, saying tens of thousands of jobs would be at risk from it. Tags:", "external_links": [], "published": "2015-08-07T00:36:00.000+03:00", "crawled": "2015-08-07T02:38:41.691+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}