{"organizations": ["GOP", "CNN"], "uuid": "d70b6d6163736ba2cfc4eddf435da63421a459b2", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150816091736-huckabee-comments-abortion-rape-10-year-old-paraguay-00003121-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/08/16/politics/mike-huckabee-abortion-paraguay/index.html?eref=rss_latest", "country": "US", "title": "Mike Huckabee: With abortion, there are two victims", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Mike Huckabee: With abortion, there are two victims", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T16:35:00.000+03:00", "replies_count": 0, "uuid": "d70b6d6163736ba2cfc4eddf435da63421a459b2"}, "author": "", "url": "http://edition.cnn.com/2015/08/16/politics/mike-huckabee-abortion-paraguay/index.html?eref=rss_latest", "ord_in_thread": 0, "title": "Mike Huckabee: With abortion, there are two victims", "locations": ["Iran", "Paraguay", "Cleveland", "Israel", "Iowa", "Florida", "Middle East", "Arkansas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Dana Bash", "Marco Rubio", "Mike Huckabee", "Barack Obama", "Huckabee", "Rubio"], "text": "Huckabee: 'When an abortion happens there are 2 victims' 02:14 (CNN) Mike Huckabee says his opposition to abortion rights in any circumstances won't change after Paraguay refused a 10-year-old rape victim access to the procedure. The former Arkansas governor who is seeking the Republican presidential nomination called the girl's rape a tragedy in an interview with CNN's Dana Bash on \"State of the Union\" Sunday. But he said: \"Let's not compound a tragedy by taking yet another life.\" \"A 10-year-old girl being raped is horrible. But does it solve a problem by taking the life of an innocent child? And that's really the issue,\" Huckabee said. He said his opposition to abortion is based in part on its lasting effects, including that of the woman making the decision. \"There are two victims. One is the child; the other is that birth mother who often will go through extraordinary guilt years later when she begins to think through what happened -- with the baby, with her. And again, there are no easy answers here,\" Huckabee said. \"I just come down on the side that life is precious; every life has worth and value. I don't think we discount the intrinsic worth of any human being, and I don't know where else to go with it than just to be consistent and say, if life matters, and that's a person, then every life matters,\" he said. He's the latest Republican to weigh in on the issue that Democrats like Hillary Clinton have used to attack Florida Sen. Marco Rubio , another GOP 2016 contender, in recent days. Rubio, too, opposes abortion in all instances, something he made clear during the first Republican presidential debate in Cleveland. Huckabee, the winner of the 2008 Iowa caucuses but trailing several other candidates in the 2016 race, also said Sunday that he plans a two-day swing through Israel. He'll depart Tuesday. He said the trip to the country that he's visited \"dozens and dozens of times\" since 1973 will include some fundraising efforts. But Huckabee said the trip will be focused on meeting with Israeli officials to discuss the Iran nuclear deal -- which he and the rest of the GOP field opposes. Huckabee courted controversy this summer when he said President Barack Obama, by agreeing to the deal, is marching Israelis \"to the door of the oven.\" \"I think it is the most dangerous situation we face -- not just for the Middle East, but for the rest of the world for a long time,\" he said Sunday. \"This is arming and equipping a terrorist state.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> Race to the White House More from Politics", "external_links": [], "published": "2015-08-16T16:35:00.000+03:00", "crawled": "2015-08-16T16:44:37.452+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}