{"organizations": ["Shell"], "uuid": "6930fe2aabbeef9ccc8339f21b79aea12dc903df", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/18/politics/hillary-clinton-arctic-drilling-obama/index.html", "country": "", "title": "Hillary Clinton arctic drilling views break from Obama - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Hillary Clinton arctic drilling views break from Obama - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T21:05:00.000+03:00", "replies_count": 0, "uuid": "6930fe2aabbeef9ccc8339f21b79aea12dc903df"}, "author": "", "url": "http://www.cnn.com/2015/08/18/politics/hillary-clinton-arctic-drilling-obama/index.html", "ord_in_thread": 0, "title": "Hillary Clinton arctic drilling views break from Obama - CNNPolitics.com", "locations": ["United States", "New Hampshire", "Las Vegas", "Greenland", "Canada", "Arctic Ocean", "Alaska", "Nevada"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Hillary Clinton", "Barack Obama", "Kerry", "Obama"], "text": "2013: Shell's arctic drilling underway 03:31 Las Vegas, Nevada (CNN) Add Arctic drilling to the list of issues Hillary Clinton now disagrees with President Barack Obama on. Hours after the Obama administration finalized plans to allow oil drilling in the Arctic Ocean, Clinton tweeted that the decision was not worth the risk. \"The Arctic is a unique treasure. Given what we know, it's not worth the risk of drilling,\" Clinton tweeted, adding her trademark \"-H,\" an acknowledgment that the tweet came from her. The Obama administration, citing \"rigorous safety standards\" and a long review process, first granted conditional approval to energy giant Shell to begin oil drilling in the Arctic waters off the coast of Alaska in May. On Monday, the administration finalized the plan. Clinton signaled in July that she was skeptical of the decision, telling a reporter in New Hampshire that she had \"doubts about whether we should continue drilling in the Arctic.\" \"I don't think it is a necessary part of our overall clean energy climate change agenda,\" Clinton said. \"I will be talking about drilling in general but I am skeptical about whether we should give the go ahead to drill in the Arctic.\" Tuesday's tweet plants Clinton squarely in the opposed category, and aligns her with environmental activists who want the United States to wean itself off fossil fuels and say drilling in the Arctic will deepen the country's commitment to oil. But it also takes away a key reason Clinton has declined to decide where she stands on the Keystone XL pipeline, a 1,179-mile-long project that would move oil from Canada to refineries in the United States. Clinton has repeatedly said that she doesn't want to weigh in on the controversial pipeline, primarily because he doesn't want to \"second guess\" Obama on an issue that she worked on at State. \"I want to wait and see what he and Secretary Kerry decide,\" she said last month in New Hampshire. But deciding to step into the Arctic drilling debate means she is second guessing her former boss, and on an issue that she spoke about as Secretary of State. \"The melting of sea ice, for example, will result in... the possibility to develop newly accessible oil and gas reserves,\" Clinton said during a speech in Greenland in 2011 . \"We seek to pursue these opportunities in a smart, sustainable way that preserves the Arctic environment and ecosystem.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics ", "external_links": [], "published": "2015-08-18T21:05:00.000+03:00", "crawled": "2015-08-18T21:05:45.808+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}