{"organizations": [], "uuid": "dd603e073eb9e4b83353146516d068e9b64d1a2d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaclinton_012415getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/251154-obama-hillary-to-attend-marthas-vineyard-birthday-party", "country": "US", "title": "Obama, Hillary to attend Martha's Vineyard birthday party", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama, Hillary to attend Martha's Vineyard birthday party", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T21:20:00.000+03:00", "replies_count": 0, "uuid": "dd603e073eb9e4b83353146516d068e9b64d1a2d"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/251154-obama-hillary-to-attend-marthas-vineyard-birthday-party", "ord_in_thread": 0, "title": "Obama, Hillary to attend Martha's Vineyard birthday party", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama, Hillary to attend Martha's Vineyard birthday party Getty Images By Jordan Fabian - 08/14/15 02:20 PM EDT \nPresident Obama and Hillary Clinton will reportedly attend a party on Saturday on Martha’s Vineyard, setting up their first encounter since Clinton formally launched her campaign for president. \nThe two are expected to be at an 80th birthday celebration for Vernon Jordan, a longtime Clinton confidante, Bloomberg reported Friday. ADVERTISEMENT The Obamas are on a two-week vacation on the posh Massachusetts island, where Jordan also spends time every summer. Clinton was scheduled to make campaign stops on Friday and Saturday in Iowa before attending the party. \nThe last known meeting between Obama and Clinton was in March, when the two huddled privately in the Oval Office. \nThe expected encounter comes at a tough time for Clinton, who is dealing with a deepening controversy surrounding her use of a private email account to conduct business as secretary of State. \nThe furor surrounding the email issue has dampened Clinton’s support in the polls, and it has prompted Vice President Biden to consider a run for president. \nThe Obamas and Clintons mingled at an 80th birthday party for Jordan’s wife, Ann, during the president’s vacation last year in Martha’s Vineyard. Past: 1 day Dems near Clinton panic mode “I’m not sure they completely understand the credibility they are losing,... Turmoil mounts surrounding Clinton... Team Clinton blasts criticism as \"misinformation\" and \"nonsense.\" Carson: Planned Parenthood in... Carson said the organization's founder \"was not particularly enamored with... Seven GOP candidates who could... Of the crowded 2016 GOP primary field, who will be the first to head for... Carson on Clinton email server: '... GOP presidential candidate Ben Carson said on Wednesday that Democrat... Report: Al Gore insiders chatting... Gore started to trend on Twitter after reports of the talks emerged. Cruz wants immigration details on... Cruz and Sessions are probing the \"nexus between terrorism and our... Black lawmakers back disruptions... “They really are speaking to the issues,\" Rep. Sheila Jackson Lee (D-Texas... Outsiders take over GOP Conservatives are thrilled with the developments. Airline to weigh passengers before... Passengers will have to step on the scale before they step on their... Clinton mocked for emoji tweet Clinton asks how student loans make followers feel in \"3 emojis or less.\" Celebs line up for, against Donald... Rosie O’Donnell is not a fan. Obama shares his summer reading... The president's most notable selection is Between The World and Me by Ta-... Trump defends Planned Parenthood Republican presidential front-runner Donald Trump defended Planned... Oath Keepers descend on Ferguson An official called the presence of the heavily armed men \"both unnecessary... Navy shuffles up aircraft carrier... The \"three-carrier swap\" leaves the Asia-Pacific region without a forward-... Mexico won't pay for Trump's... \"It's 100 percent they're going to pay,\" Trump claimed in an interview. Trump: China 'just destroying us'... \"China has gotten rich off us,” Trump said in Michigan. Ex-adviser: Trump a 'great... “Trump has the size and boldness to be the leader we need,” Roger Stone... Fiorina: Trump, Obama both hit... Fiorina argued that both men employ inflammatory rhetoric against their... 'Regular guy' style costs Walker... Walker has seen his standing in Iowa slip away to Donald Trump.", "external_links": [], "published": "2015-08-14T21:20:00.000+03:00", "crawled": "2015-08-14T22:07:13.635+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}