{"organizations": ["Facebook", "Twitter"], "uuid": "f782d4470bca0994e63f8676639fd8ceaffff43e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/082315_pi_clinton_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/08/24/amid-biden-deliberations-wh-leaves-door-open-to-obama-primary-endorsement/", "country": "", "title": "Amid Biden deliberations, WH leaves door open to Obama primary endorsement | Fox News", "performance_score": 5, "site": "foxnews.com", "participants_count": 0, "title_full": "Amid Biden deliberations, WH leaves door open to Obama primary endorsement | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T05:50:00.000+03:00", "replies_count": 0, "uuid": "f782d4470bca0994e63f8676639fd8ceaffff43e"}, "author": "", "url": "http://www.foxnews.com/politics/2015/08/24/amid-biden-deliberations-wh-leaves-door-open-to-obama-primary-endorsement/", "ord_in_thread": 0, "title": "Amid Biden deliberations, WH leaves door open to Obama primary endorsement | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["WH", "Biden", "Obama"], "text": "Amid Biden deliberations, WH leaves door open to Obama primary endorsement Published August 24, 2015 Facebook 0 Twitter 0 livefyre Email Print \nThe White House left the door open Monday to President Obama endorsing a candidate in the 2016 Democratic primary, raising the tantalizing possibility of Obama choosing between two administration powerhouses as Vice President Biden mulls a run against Hillary Clinton. \nThe prospect of a Biden-vs.-Clinton rerun already is said to be dividing current and former Obama administration staffers looking at whom to support -- and potentially work for -- in 2016. Clinton was the obvious choice until her personal email scandal and problematic poll numbers stirred talk about Biden, whose supporters already are pulling together a team for a possible run. \n\"He's going to collect all the information that he needs to make a decision,\" White House Press Secretary Josh Earnest said Monday. Earnest, on the president's first day back in Washington from a Martha's Vineyard vacation, was peppered with reporter questions on the prospects for a Biden bid and where Obama would fall. \nHe told reporters Obama certainly would support the eventual Democratic nominee in the general election next year -- but hinted an endorsement could come earlier. \n\"I wouldn't rule out the possibility of an endorsement in the Democratic primary,\" Earnest said. \nEarnest, speaking as Obama and his No. 2 held their weekly lunch meeting, reiterated that Obama believes picking Biden as his running mate was his smartest political decision. But he also said Obama has a deep appreciation for Clinton's service as secretary of state. \nWithout tipping his hand as to whether Obama is encouraging Biden to enter, Earnest said the VP is well-positioned to make the decision himself, as a two-time presidential candidate who's been on the Obama ticket twice. \n\"You could make the case that there's probably no one in American politics today who has a better understanding of exactly what is required to mount a successful national presidential campaign,\" Earnest said. \nBiden remains undecided but wants to make a call soon. \nThe Wall Street Journal reports that he is increasingly leaning toward running against Clinton if he can pull together a robust campaign. \nBiden stoked speculation further on Saturday by interrupting his own time off and reportedly holding a meeting with Sen. Elizabeth Warren, D-Mass., a darling of the left who herself had been urged by grassroots supporters to run. She declined, but she has not yet endorsed anyone in the 2016 race. \nPolitico reports that the possibility of a Biden bid is dividing the Obama administration, where many had assumed Clinton was the candidate to back. Sources suggested Biden still has strong support. \"I don't know what the official line will be,\" an unnamed White House official told Politico, \"but you will have a lot of people in the building rooting for him.\" \nJosh Alcorn, a ringleader in the effort to get Biden in the race, said Sunday that while Biden trails would-be competitors in money and organization, he could still win. \n\"We have a grassroots list of 200,000 people that's growing every day,\" Alcorn, senior adviser for Draft Biden 2016, told \"Fox News Sunday.\"\"He may not have the financial resources, but there is a groundswell of support.\" ", "external_links": [], "published": "2015-08-25T05:50:00.000+03:00", "crawled": "2015-08-25T05:50:25.996+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}