{"organizations": [], "uuid": "af59e5d4a29b11e61f41fb3ebe35dbaff6d7363e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c3c3c71d00006e00144199.jpeg", "site_section": "http://www.huffingtonpost.com/tag/yemen/feed", "section_title": "Yemen on Huffington Post", "url": "http://www.huffingtonpost.com/entry/iran-tried-to-stop-houthi-rebels-in-yemen_55c3ba1be4b0d9b743db627c?kvcommref=mostpopular", "country": "US", "title": "Iran Tried To Stop Houthi Rebels In Yemen, Obama Says", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Iran Tried To Stop Houthi Rebels In Yemen, Obama Says", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T20:41:00.000+03:00", "replies_count": 0, "uuid": "af59e5d4a29b11e61f41fb3ebe35dbaff6d7363e"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/iran-tried-to-stop-houthi-rebels-in-yemen_55c3ba1be4b0d9b743db627c?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Iran Tried To Stop Houthi Rebels In Yemen, Obama Says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Iran Tried To Stop Houthi Rebels In Yemen, Obama Says The move demonstrates Iran's rational nature, the president said. Ryan Grim Washington bureau chief for The Huffington Post Posted: 08/06/2015 05:41 PM EDT \n﻿ ﻿ ﻿ ﻿ ﻿ ﻿WASHINGTON -- Iran tried to hold back Shia rebels who were intent on taking the Yemeni capital of Sanaa at the height of the uprising in 2014, President Barack Obama told a group of reporters Wednesday afternoon. ﻿ \nThe Houthi rebels, however, ignored the advice and marched on, precipitating a much wider war in Yemen. \nObama's observation confirms an earlier Huffington Post report that, contrary to widespread assumptions in the United States, Iran was not the driving force of the crisis in Yemen. \nThe president relayed the anecdote as an example of how Iran is calculating, rational and opportunistic in its interventions, rather than being wildly driven by the passions of its ideology, at a briefing with reporters to discuss the nuclear deal between Iran and six world powers. \n“When the Houthis started moving, that wasn’t on orders from Soleimani, that wasn’t on an order from the IRGC,” he said, referring to Qasim Soleimani, the head of the Iranian Revolutionary Guard.”That was an expression of the traditional Houthi antagonism towards Sanaa, and some of the machinations of the former president, [Ali Abdullah] Saleh, who was making common cause out of expediency with the Houthis.” \nObama said the U.S. had a front row seat to the machinations. \n\"We watched as this proceeded. There were moments where Iran was actually urging potential restraint,” he said. ”Now, once the Houthis march in and there’s no there there” -- in other words, the government completely collapsed and Houthis expecting resistance found none at all -- “are they interested in getting arms to the Houthis and causing problems for the Saudis? Yes. But they weren’t proceeding on the basis of, come hell or high water, we’re moving on a holy war here.” \nDespite its malevolent intentions and motivation, displays such this one suggested to him that, in the end, Iran is rational and can be dealt with, Obama said. \n“It’s on that basis that we entered into the interim agreement,” he said. \nThat doesn’t mean, Obama said, that he finds Supreme Leader Ayatollah Khamenei or his ideology palatable. “I think his ideology is steeped with anti-Semitism, and if he could, without catastrophic costs, inflict great harm on Israel, I’m confident that he would. But…it is possible for leaders or regimes to be cruel, bigoted, twisted in their world views and still make rational calculations with respect to their limits and their self-preservation,\" he said. \n\"What we’ve seen, at least since 1979, is Iran making constant, calculated decisions that allow it to preserve the regime, to expand their influence where they can, to be opportunistic, to create what they view as hedges against potential Israeli attack, in the form of Hezbollah and other proxies, in the region. I think what Iran has been doing in Yemen is a perfect illustration of this.\" \nThe rationality goes hand-in-hand with duplicity, Obama said, but one can be used against the other. \n\"If you look at how the interim agreement proceeded, they actually executed systematically,\" he said, suggesting that Iran engaged rationally with the agreement. \"There were a couple of times where, by the way, during that interim agreement, they fell short of their obligations. We identified that quickly, insisted that if they didn’t fix it they weren’t getting the sanction relief that was promised, and it was fixed. And that actually, interestingly, gives us more confidence about our ability to manage the implementation of the larger deal.\" Help support Huffington Post journalism by signing up to get an email when Ryan Grim publishes a new story. \nEnter your email address:", "external_links": [], "published": "2015-08-06T20:41:00.000+03:00", "crawled": "2015-08-07T00:54:08.248+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}