{"organizations": ["DEA", "Drug Enforcement Administration", "Bellevue Hospital", "American Association of Poison Control Centers", "Metro", "Metro Police", "U.S. Attorney's Office", "New York Police Department", "Metropolitan Police Department", "CNN", "New York Police"], "uuid": "f307ede80e307bbdc0fbc6cb5228a788b14c1dd5", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/04/politics/synthetic-marijuana-overdoses-crime/index.html", "country": "", "title": "Summer surge of synthetic marijuana causes overdoses - CNNPolitics.com", "performance_score": 6, "site": "cnn.com", "participants_count": 0, "title_full": "Summer surge of synthetic marijuana causes overdoses - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T04:22:00.000+03:00", "replies_count": 0, "uuid": "f307ede80e307bbdc0fbc6cb5228a788b14c1dd5"}, "author": "", "url": "http://www.cnn.com/2015/08/04/politics/synthetic-marijuana-overdoses-crime/index.html", "ord_in_thread": 0, "title": "Summer surge of synthetic marijuana causes overdoses - CNNPolitics.com", "locations": ["New York", "Washington", "U.S.", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bratton", "William Bratton", "Cathy Lanier"], "text": "Synthetic marijuana plaguing law enforcement 01:43 Story highlights Some law enforcement officials say the rise in synthetic marijuana is leading to more crime Overdoses are also on the rise, according to reports (CNN) Synthetic marijuana is flooding the streets of major U.S. cities this summer, causing a surge in overdoses and, according to some police officials, a rise in violent crime. The situation has become urgent enough that police chiefs meeting in Washington this week called for development of field tests that can help police quickly figure out suspects on the synthetic marijuana. Sold in slickly marketed packets with names like K2, Scooby Snax and Spice, the drugs are made up of a variety of chemicals and have little to do with marijuana. The chemicals found in the packets vary -- even identically branded packages often contain vastly different ingredients -- and users likely have no idea what they're smoking. By early July, poison control centers in the U.S. tallied 4,377 reports of people suffering the effects of synthetic marijuana, compared to 3,682 in all of last year, according to the American Association of Poison Control Centers. And some users are now finding their way onto the police crime blotters. A survey of 35 major city police departments across the U.S. found that 30% have attributed some violent crimes to synthetic marijuana use. Speaking at a press conference on Tuesday, New York Police Commissioner William Bratton called it \"weaponized marijuana\" and described it as \"a great and growing concern.\" \"These dangerous products do not belong on store shelves within our neighborhoods and are a threat to public health,\" Bratton said in a statement to CNN. The New York Police Department added that there are more than 100 overdose cases a month at New York's major trauma center, Bellevue Hospital. In Washington, the Metropolitan Police Department said a man believed to be suffering the effects of synthetic marijuana carried out gruesome fatal stabbing on a Metro train in full view of subway riders on July 4. Toxicology tests haven't been made public in the case. And the city's EMS Department reports transporting 439 people suffering from suspected synthetic marijuana overdoses in June alone. Most of the synthetic marijuana comes from factories in China and is imported to the U.S., the Drug Enforcement Administration said. In the wake of a crackdown in recent years, many convenience stores have pulled the items from their shelves and now users have to know code names to get it from store clerks or they can buy it from street dealers. Along with hallucinogenic effects, the drugs can produce nausea, agitation, seizures and even suicidal or violent reactions. The DEA says the drugs fall under a broad label of depressant-hallucinogens that it has had trouble classifying because of the varying types of chemicals manufacturers use. Homeless populations appear to be bearing the brunt of the overdoses in some cities. This week, the U.S. Attorney's Office in Washington plans to begin some presentations to homeless shelters to warn residents of the dangers of the drugs. The drugs are illegal, but part of the problem in stopping it is the varying chemicals used to make them. There has been some criticism that police are looking to blame the synthetic drug for spikes in crime, but Washington's police chief said this week said it was not the \"biggest problem, but it is a significant problem in many different communities.\" \"In some cities, synthetic cannabinoids is a huge issue, in other cities its just beginning to grow,\" said Washington's Metro Police Chief Cathy Lanier on Monday. \"Its connection to violence, that's a gap that can be fixed\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Politics Originals ", "external_links": [], "published": "2015-08-05T04:22:00.000+03:00", "crawled": "2015-08-05T04:22:58.811+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}