{"organizations": [], "uuid": "dcafc65beb31d90bf7cc9c7ae5e384301b956ba7", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55ce18861d00002f00144d6e.jpeg?cache=xLEyUXwpV5", "site_section": "http://www.huffingtonpost.com/tag/elizabeth-warren/feed", "section_title": "Elizabeth Warren on Huffington Post", "url": "http://www.huffingtonpost.com/entry/democrat-blocking-obama-nominee_55ce17cfe4b07addcb42cc11?kvcommref=mostpopular", "country": "US", "title": "Why A Democrat Is Now Blocking An Obama Nominee", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Why A Democrat Is Now Blocking An Obama Nominee", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T16:06:00.000+03:00", "replies_count": 0, "uuid": "dcafc65beb31d90bf7cc9c7ae5e384301b956ba7"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/democrat-blocking-obama-nominee_55ce17cfe4b07addcb42cc11?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Why A Democrat Is Now Blocking An Obama Nominee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Why A Democrat Is Now Blocking An Obama Nominee Sen. Sherrod Brown has a new tactic in the fight to access secretive trade deal documents. Zach Carter Senior Political Economy Reporter, The Huffington Post Posted: 08/14/2015 01:06 PM EDT | Edited: 08/14/2015 01:27 PM EDT Credit: Alex Wong via Getty Images \nWASHINGTON -- Sen. Sherrod Brown (D-Ohio) is blocking an Obama nominee for deputy U.S. trade representative over the administration's refusal to grant his staff access to key trade documents, reigniting an intraparty battle over the Trans-Pacific Partnership. \nBrown, Sen. Elizabeth Warren (D-Mass.) and many other Democratic critics have long maligned the intense secrecy provisions that the administration imposes on negotiation drafts of the controversial trade pact with 11 other Pacific nations. The administration treats the text as classified information, making it a crime for lawmakers to publicly air specific complaints about the deal. \nThroughout the TPP talks, the administration has continued to impose barriers that have prevented Brown's top trade staffer from reviewing negotiation documents unless Brown himself is physically present in the room with her. Brown has said such standards are stricter than the government's information controls for some Iran sanctions work and CIA briefings. \nOn Aug. 5, according to Brown aides, the senator placed a call to a top staffer at the White House agency that oversees trade negotiations. Brown said he would put a hold on Obama's nomination of Marisa Lago as deputy U.S. trade representative if the agency didn't change its policy by noon on Friday to allow his staffer to evaluate the texts without being accompanied by Brown. Brown's office says they never heard back from the agency. \n“The administration would rather sacrifice a nominee for a key post than improve transparency of the largest trade agreement ever negotiated,” Brown said in a written statement provided to HuffPost. “Even seasoned policy advisors with the requisite security clearance can’t review text without being accompanied by a member of Congress. It shouldn’t be easier for multinational corporations to get their hands on trade text than for public servants.” \nBy placing a hold on a nomination, even a single senator can prevent the Senate from giving nominees a confirmation vote. Holds can be removed if 60 senators vote to clear them, but assembling 60 allies has become a daunting task in recent years. Republicans have deployed the tactic aggressively to gum up Obama's governing ability. \nThe trade fight between Obama and his own party appeared to have been laid to rest in June, after Obama and Republicans pushed through fast-track legislation easing the passage of whatever final TPP deal the administration reaches. But Obama negotiators have failed to close the deal in meetings with other TPP countries in the months since. China's recent currency devaluation has also focused negative attention on Obama's trade agenda, with criticism coming not only from Democrats, but also from Republican presidential contender Donald Trump. \nLago is currently a ssistant secretary for international markets and development at the U.S. Treasury Department. Like U.S. Trade Representative Michael Froman, she is an alum of Wall Street banking titan Citigroup, where she worked for five years. Liberal groups have been become increasingly skeptical about Obama nominees from Wall Street over the past year. \nThe conflict between Democrats and Obama over trade secrecy previously came to a head in April, when a frustrated Obama lashed out at Warren. \n\"When I just keep on hearing people repeating this notion that it's secret -- I gotta say, it's dishonest,\" Obama told reporters at the time. Warren and Brown responded with a letter calling for Obama to release TPP negotiating documents. The deal remains classified.", "external_links": [], "published": "2015-08-14T16:06:00.000+03:00", "crawled": "2015-08-15T08:05:05.428+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}