{"organizations": [], "uuid": "aeb75f55b0d155e1b1ca15787b4f76daeec4a4eb", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55dbb405170000b700568732.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/news.xml", "section_title": "WorldPost News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/judge-dolly-gee_55db850ae4b04ae49704188e", "country": "US", "title": "Judge Fighting Family Detention Has Personal Connection To Immigration", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Judge Fighting Family Detention Has Personal Connection To Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T05:30:00.000+03:00", "replies_count": 0, "uuid": "aeb75f55b0d155e1b1ca15787b4f76daeec4a4eb"}, "author": "Roque Planas", "url": "http://www.huffingtonpost.com/entry/judge-dolly-gee_55db850ae4b04ae49704188e", "ord_in_thread": 0, "title": "Judge Fighting Family Detention Has Personal Connection To Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Judge Fighting Family Detention Has Personal Connection To Immigration U.S. District Court Judge Dolly Gee has built a track record as a defender of immigrants. Roque Planas National Reporter, The Huffington Post Posted: 08/24/2015 10:30 PM EDT Credit: AP Photo/Eric Gay An immigrant from Honduras who entered the United States illegally wears an ankle monitor as she sweeps the floor during her stay at a respite house, Tuesday, Aug. 18, 2015, in San Antonio. \nThe federal judge who called for the Obama administration to shut down family detention centers knows the issue of immigration personally. \nU.S. District Court Judge Dolly Gee, whose parents came to the U.S. from China, has built a record as a defender of immigrants and ethnic minorities in California, the state with the country's largest foreign-born population and perhaps the most liberal policies towards the undocumented. Now on the federal bench, Gee is among the least sympathetic judges when it comes to the administration's policy of detaining Central American mothers with their children in an effort to discourage more families from making the dangerous trip across the southern border of the U.S. \nLast year, some 68,000 mothers crossed the border illegally with their children, along with a similar number of unaccompanied minors. The vast majority came from the violence-plagued Central American countries of Honduras, El Salvador and Guatemala, and many of them have applied for asylum or other immigration relief. The Obama administration responded to the crisis by widely expanding family detention, a practice it had all but abandoned back in 2009. \nImmigrant rights groups have widely protested family detention, arguing that asylum-seeking mothers and their children should be allowed to pursue their claims outside of immigrant detention. Both of the detention centers in South Texas, where most of the women and children are locked up, have faced repeated allegations of mistreatment, including sexual harassment , threats of separating mothers from their children and neglecting detainees who need medical treatment . \nGee seems to share the concerns of groups protesting these centers. In July, she sharply rebuked the administration in a ruling describing the treatment of immigrant children as \"deplorable.\" Her ruling said that family detention violated the 1997 Flores Settlement, which says that federal authorities must detain children in the least restrictive setting possible and should generally favor a policy of releasing them. \n“It is astonishing that defendants have enacted a policy requiring such expensive infrastructure without more evidence to show that it would be compliant with an agreement that has been in effect for nearly 20 years,” Gee said in her ruling. \nGovernment lawyers responded earlier this month to the ruling , saying that the Department of Homeland Security had already begun expediting the screening of women and children for asylum. But the lawyers also said they need to keep detaining the families, in order to prevent \"another surge in illegal migration across our Southwest border by Central American families, including by incentivizing adults to bring children with them on their dangerous journey as a means to avoid detention and gain access to the interior of the United States.\" \nGee fired back on Friday. \n“This statement is speculative at best, and, at worse, fear-mongering,” she wrote in Friday’s order , which opened with a quote from Mahatma Gandhi. (\"An error does not become truth by reason of multiplied propagation, nor does truth become error because nobody sees it.\") \nGee said the government's response was \"rehashing many of the same arguments which the Court previously rejected.\" She wrote that the attorneys had \"utterly failed to satisfy the requirements for a motion for reconsideration,\" and ordered the government to release the children from family detention by Oct. 23. Government lawyers may appeal the decision. \nGee’s perspective might, to some degree, reflect her background. After graduating from law school at the University of California at Los Angeles in 1984, Gee launched a career as a labor lawyer, inspired by an urge to reform the exploitative conditions that her immigrant mother experienced while working as a seamstress in the Los Angeles clothing industry, according to a 1999 article by The Associated Press. \nShe joined the firm Schwartz, Steinsapir, Dohrmann & Sommers in 1986, focusing on workplace harassment and employment discrimination issues, according to the firm’s bio . By 1990, she had become a partner. Through the 1990s and up until 2006, Gee also worked as a regional coordinator for the Teamsters union , where she supervised elections and investigated allegations of election rule violations. \nGee has also played an active role in professional associations that represent ethnic minorities. She co-founded the Asian Pacific American Bar Association of Los Angeles and the Multicultural Bar Alliance, and served as a president of the Southern California Chinese Lawyers Association, the AP reported. In March of 1991, she wrote an opinion piece in the Los Angeles Times calling for a “police chief who appreciates the diversity of our community and who can train its law-enforcement officers to deal more evenhandedly with its citizens.” \n“When statistics indicate that one of every four young African-American males is or has been incarcerated and that a majority of those in prison have been convicted of drug-related offenses, it is time to take a critical look at our system of justice and its goals,” Gee wrote. “Leveling blame at immigrant or minority communities, imposing harsher penalties and constructing more jails are desperate solutions of shortsighted policy-makers who do not have the energy or resources to tackle problems of poverty, ignorance, racism and the misallocation of resources. Neither victims of crime nor society as a whole benefit from such policies of avoidance,” the piece says. \nIt was Obama who appointed Gee as a U.S. District Court judge for the Central District of California. Gee’s ascension was one of several appointments aimed at bolstering the diversity of the federal bench . The U.S. Senate confirmed her appointment in December of 2009 unanimously, making her the first Chinese-American to serve as a federal district court judge, according to a press release issued at the time by U.S. Sen. Barbara Boxer (D-Calif.). \n“Dolly Gee has an exemplary record and she will be an outstanding addition to the federal bench,” Boxer said in the 2009 release . “As a daughter of immigrants from rural China, she personifies the American dream. She used her position as a prominent attorney in Los Angeles to promote racial tolerance and fight for those who face discrimination.” \nIn one of her most widely reported rulings prior to the family detention decision last month, Gee ordered the federal government to offer free legal services to detained immigrants with mental disabilities . The 2013 ruling also said that immigrant detainees with mental illnesses must receive a bond hearing within 180 days. Credit: AP Photo/Eric Gay A child's artwork is seen on a table as Cristian, 6, and Alexus, 11, immigrants who entered the United States illegally with their mothers from Guatemala, eat breakfast at a respite house, Tuesday, Aug. 18, 2015, in San Antonio. \nGee’s ruling on family detention might be seen as an ironic twist for the administration, since the judge whom Obama appointed is ordering an end to an immigration enforcement method that administration officials have staunchly defended. \nGee’s personal background and career trajectory would appear to mark her as the polar opposite of Judge Andrew Hanen , the federal judge in Texas who enjoined Obama’s executive actions on immigration in November, including the ambitious Deferred Action for Parents of U.S. Citizens program. If implemented, the executive actions would shield an estimated 4.4 million undocumented immigrants from deportation and allow them to work legally in the United States. \nPrior to blocking the implementation of DAPA, Hanen intimated that the Obama administration had encouraged the smuggling of children by allowing unaccompanied minors to be released to family members in the U.S. \n\"Instead of arresting (the child's mother) for instigating the conspiracy to violate our border security laws, the (Homeland Security Department) delivered the child to her — thus successfully completing the mission of the criminal conspiracy,\" Hanen wrote in a ruling on a child smuggling case in 2013 , the AP reported.", "external_links": [], "published": "2015-08-25T05:30:00.000+03:00", "crawled": "2015-08-25T05:40:50.145+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}