{"organizations": ["Congress"], "uuid": "5a5b9ae5140c9793f063748c57c57374c81934ad", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/energy-environment/250580-obama-pushes-congress-on-wildfire-funding", "country": "", "title": "Obama pushes Congress on wildfire funding | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama pushes Congress on wildfire funding | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T22:10:00.000+03:00", "replies_count": 0, "uuid": "5a5b9ae5140c9793f063748c57c57374c81934ad"}, "author": "", "url": "http://thehill.com/policy/energy-environment/250580-obama-pushes-congress-on-wildfire-funding", "ord_in_thread": 0, "title": "Obama pushes Congress on wildfire funding | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Devin Henry", "Obama"], "text": "Obama pushes Congress on wildfire funding By Devin Henry - 08/07/15 02:15 PM EDT \nPresident Obama wants Congress to move forward on legislation funding firefighting efforts and wildfire prevention. \nAt a bill signing on Friday, Obama blamed the “severity and length” of this year’s wildfire season on climate change, and he said lawmakers should work to make sure efforts to fight the fires are properly funded. ADVERTISEMENT “One of the things we're trying to work on with Congress is making sure that we are able to properly fund firefighting efforts, but also that we're engaged in the kind of conservation planning to ensure that we're preventing fires from happening in the first place,” he said.\n“And so that's a project that, at least in the Western states, you get a lot of bipartisan support for. Hopefully we'll be able to get that same kind of support here in Washington.” \nThe Forest Service said this week that, for the first time in its history, it has spent more than half of its budget this year fighting fires. \nIt spent approximately $320 million on the 10 largest wildfires last year alone, and like Obama, Agriculture Secretary Tom Vilsack said he expects wildfires to get worse as climate change intensifies. \nWildfires aren’t treated as natural disasters, so Congress cannot appropriate emergency funding to fight them. The Forest Service instead needs to move around funding within the department to cover additional firefighting costs every year. \nCongress has considered some proposals to fix the problem, including legislation treating wildfire efforts more like other disaster funding. Vilsack endorsed that approach this week. \n\"We must treat catastrophic wildfire not like a routine expense, but as the natural disasters they truly are,\" he said in a statement. \"It's time to address the runaway growth of fire suppression at the cost of other critical programs.\" \nObama was signing a bill Friday designating three wilderness areas in Idaho’s Boulder-White Clouds region. The bill, from Rep. Mike Simpson (R-Idaho), passed Congress unanimously. \n“We want to urge the American people to visit these new, incredible wilderness areas, and recognize that not only will this give opportunities to people in Idaho, but it's going to be there for future generations as well,” Obama said. Tags: ", "external_links": [], "published": "2015-08-07T22:10:00.000+03:00", "crawled": "2015-08-07T22:10:18.694+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}