{"organizations": [], "uuid": "0b2563ceb126bc6df3f568e9fedc1c41f0d9bb59", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack08102015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/homenews/administration/250861-no-recess-for-obama-on-iran", "country": "", "title": "No recess for Obama on Iran | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "No recess for Obama on Iran | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T13:42:00.000+03:00", "replies_count": 0, "uuid": "0b2563ceb126bc6df3f568e9fedc1c41f0d9bb59"}, "author": "", "url": "http://thehill.com/homenews/administration/250861-no-recess-for-obama-on-iran", "ord_in_thread": 0, "title": "No recess for Obama on Iran | TheHill", "locations": ["Jordan Fabian", "Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama", "Julian Hattem"], "text": "No recess for Obama on Iran Getty Images By Julian Hattem and Jordan Fabian - 08/12/15 06:00 AM EDT \nThe White House and its allies are redoubling their efforts to win support for the Iran nuclear deal during President Obama’s two-week vacation at Martha’s Vineyard. \nObama’s vacation represents an opportunity of sorts for opponents, since the president’s bully pulpit will be relatively silent. ADVERTISEMENT Over the break, opponents are blanketing TV airwaves with commercials attacking the deal as they seek to raise pressure on lawmakers to oppose it.\nTo counter that effort, Obama is expected to make additional calls to undecided lawmakers to get them to support the deal during his vacation. \nWhite House officials are also calling lawmakers over the five-week congressional recess. \nRep. Jerrold Nadler (D-N.Y.) — an undecided lawmaker who has been the target of heavy lobbying on both sides — told reporters that he didn’t necessarily expect speak with Obama personally during the break. \n“But I expect to hear from some other people in the White House,” Nadler said. \nThe House and Senate will vote in September on a resolution disapproving the deal, which lifts U.S. sanctions on Iran in exchange for concessions on Tehran’s nuclear program. \nIf the disapproval measure is approved by Congress and overcomes an Obama veto — something that would require two-thirds majorities in both chambers — it would kill the deal. \nOverriding a promised Obama veto is a long-shot, but the administration is taking no chances. \nObama recorded interviews with CNN, NPR and Mic News that aired Sunday and Monday, allowing him to get his message out while on vacation. \nSecretary of State John Kerry and Secretary of Energy Ernest Moniz — the top two U.S. negotiators with Iran and the administration’s most active salesmen — convened a rare roundtable with reporters from regional newspapers on Monday to talk up the agreement. \nThree of the papers invited to attend are from New York, allowing top administration officials to rebut Sen. Charles Schumer’s (D-N.Y.) argument against the deal to readers in his home state. Schumer, the only Senate Democrat to announce his opposition so far, has called on the administration to negotiate a better deal. \n“It is absolutely mistaken for somebody to assert that ‘Oh, we’ll get a better deal,’” Kerry said, according to the Buffalo News . \nOpponents of the deal believe the recess is an opportunity. They argue the August break \nis muffling the White House’s sales pitch. \n“For a campaign like this, in August, it’s a district-by-district focus and the president can’t be in 40 districts at once, even if he was at home instead of Martha’s Vineyard,” said Omri Ceren, managing director at The Israel Project, which is opposed to the deal. \n“It’s not so much that he’s off the field but you've got to go where the lawmakers are.” \nCitizens for a Nuclear Free Iran — the group created by the American Israel Public Affairs Committee (AIPAC) to oppose the deal — has reportedly spent more than $11 million on TV advertisements in recent weeks, warning that the agreement is a “bad deal.” \nOn Monday, United Against Nuclear Iran — another organization that opposes the agreement — unveiled a new 30-second ad accusing the Obama administration of abandoning four Americans stuck in Iran. The ad will be played on national and regional TV networks, the organization said. \nSeparately, an organization of Iraq war veterans going by Veterans Against the Deal also began a national ad campaign this week. Videos featuring veterans who were “blown up by an Iranian bomb” are being run in the home states of on-the-fence Democrats including Sens. Jon Tester (Mont.), Heidi Heitkamp (N.D.) and Joe Manchin (W.Va.). \nThe August recess also provides a new venue for advocacy groups on both sides of the issue: town halls. \nLiberal activists have made the Iran deal their No. 1 focus this month and have renewed their pressure to get supporters of the deal to lobby their member of Congress in person. Last week, groups including MoveOn.org, Daily Kos and Credo launched a website with a list of upcoming events to steer their members to the right place. \nPro-deal activists say the effort is already paying off. \n“So far what we’ve seen both in California and in Colorado over the last couple of days is many more supporters of the Iran deal coming to talk to their members than opponents,” MoveOn Washington Director Ben Wikler said last week, referring to two events in particular where backers of the deal overwhelmed opponents. \nCritics of the agreement have also pledged to seize on town halls, meet-and-greets and other opportunities to get face time with members of Congress who may not yet be fully decided. \n“There are calls and e-mails to the office and calls personally from people who just want to know where I am,” Sen. Jeff Flake (R-Ariz.) — one of the few undecided Republicans — told the Arizona Republic . \nThe frantic lobbying is a sign of the importance of the deal, which can be legacy-defining both for Obama and for individual members of Congress. \n“The typical sanctity of August recess has been not something that anyone’s focusing on at the moment,” joked one congressional aide. \n", "external_links": [], "published": "2015-08-12T13:42:00.000+03:00", "crawled": "2015-08-12T13:42:28.455+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}