{"organizations": ["Trump"], "uuid": "43ab2c2c0fc27fc667f3bba1147bda787773f49c", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150817121249-trump-zuckerberg-immigration-620xa.jpg", "site_section": "", "section_title": "", "url": "http://money.cnn.com/2015/08/21/news/economy/zuckerberg-trump-immigration/index.html", "country": "", "title": "Zuckerberg group fires back at Trump immigration plan - Aug. 21, 2015", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Zuckerberg group fires back at Trump immigration plan - Aug. 21, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T21:42:00.000+03:00", "replies_count": 0, "uuid": "43ab2c2c0fc27fc667f3bba1147bda787773f49c"}, "author": "", "url": "http://money.cnn.com/2015/08/21/news/economy/zuckerberg-trump-immigration/index.html", "ord_in_thread": 0, "title": "Zuckerberg group fires back at Trump immigration plan - Aug. 21, 2015", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Zuckerberg", "Chris Isidore @CNNMoney Trump", "Mark Zuckerberg"], "text": "Zuckerberg group fires back at Trump immigration plan By Chris Isidore @CNNMoney Trump on immigration: 'I have to do the right thing' The pro-immigration reform group founded by Mark Zuckerberg and other tech heavyweights is firing back at Donald Trump, saying his immigration plan would harm the U.S. economy. \nThe statement posted by FWD.us. President Todd Schulte doesn't identify Trump by name. But it refers to \"anti-immigrant voices yelling for mass deportation.\" Trump unveiled an immigration plan early this week that promised much tougher enforcement and deportation policies. \n\"What's absurd is not just these 'plans,' but that those who would seek to represent Americans as president are falling all over themselves to support backward policies that would rip apart American families and collapse our economy,\" said the group's statement. \nZuckerberg was a key force behind the creation of FWD.us in 2013, which aims to increase legal immigration and a path to citizenship for many current undocumented workers. Zuckerberg's support for more immigration led Trump to criticize him by name when he released his own immigration plan this week. \nFWD.us says the mass deportation of an estimated 11.5 million undocumented immigrants would cost the economy $1.7 trillion, citing a 2013 study by a Harvard economist . It said it would devastate the construction, agricultural and hospitality industries. \n\"Try imagining California or Florida without agriculture,\" said Schulte's post. \nIt also said mass deportations would cut payroll tax collections used to support Social Security and Medicare by $100 million. \nSchulte said more H-1B visas are needed to bring in skilled foreign workers, who he said would create jobs rather than hurt American workers. Tech companies have long been pressing for an increase in H-1B visas. \nTrump has argued that these visas are preventing Americans from getting jobs and depressing U.S. wages. \n\"Mark Zuckerberg's personal Senator, Marco Rubio, has a bill to triple H-1Bs that would decimate women and minorities,\" Trump said in his immigration plan. Rubio is also seeking the Republican presidential nomination. CNNMoney (New York) August 21, 2015: 1:34 PM ET ", "external_links": [], "published": "2015-08-21T21:42:00.000+03:00", "crawled": "2015-08-21T21:42:48.335+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}