{"organizations": [], "uuid": "b14986bf1d281bef4e7d2aab7cc0101fac144d6d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/080515_yw_ayotte_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/08/06/mcconnell-calls-for-obama-to-retract-statement-comparing-members-congress-to/", "country": "US", "title": "Obama urged to retract statement comparing members of Congress to Iranian hardliners", "performance_score": 3, "site": "foxnews.com", "participants_count": 15, "title_full": "Obama urged to retract statement comparing members of Congress to Iranian hardliners | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 21, "uuid": "40018b41a095df6c405006f108f50e61dc6e9ef0"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/08/06/mcconnell-calls-for-obama-to-retract-statement-comparing-members-congress-to/#post-0", "ord_in_thread": 0, "title": "Obama urged to retract statement comparing members of Congress to Iranian hardliners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 06, 2015 FoxNews.com livefyre Email Print\nSenate Majority Leader Mitch McConnell called for President Obama to retract a statement he made Wednesday saying members of Congress who opposed the Iran nuke deal had something in common with Iranians who chanted “Death to America” in the streets of Tehran.\nObama made the comments in a speech at American University in Washington while going after critics of the deal, who he said were “selling a fantasy” to the American people. He added that Iranian hardliners chanting \"Death to America\" don't represent all of Iran.\n\"In fact, it's those hardliners who are most comfortable with the status quo,\" Obama said. \"It's those hardliners chanting \"Death to America\" who have been most opposed to the deal. They're making common cause with the Republican caucus.\"\nMcConnell, R-Ky., called the comments “bizarre and preposterous” in a statement released Wednesday afternoon, adding that “supporters and defenders” of the proposed deal should reject the president’s “offensive rhetoric.”\n“Members of both parties have serious and heartfelt concerns about the Iran deal,” he said in a statement. “These Democrats and Republicans deserved serious answers today, not some outrageous attempt to equate their search for answers with supporting chants of 'Death to America.'”\nThe president's remarks were part of an intense lobbying campaign by the White House ahead of Congress' vote next month to either approve or disapprove the international agreement. Opponents of the agreement have streamed to Capitol to make their case, and have spent tens of millions of dollars on advertisements.\nThe White House is preparing for the likelihood that lawmakers will vote against the deal next month and is focusing its lobbying efforts on getting enough Democrats to sustain a presidential veto. Only one chamber of Congress is needed to sustain a veto and keep the deal in place.\nObama needs 146 Democrats in the House or 34 in the Senate to sustain a veto. As of Wednesday afternoon, 16 House Democrats and 11 senators had publicly declared their support for the deal.\nThe White House has said it is confident it can sustain a veto at least in the House.\nThe Associated Press contributed to this report.\n Politics 1 Former President George W. Bush shows up for jury duty in Dallas 2 With Trump at center stage, GOP candidates ready to rumble at 1st debate 3 Fox News announces candidate line-up for prime-time debate 4 New 9/11 photos of George W. Bush released 5 Obama invokes Iraq war debate in push for Iran deal, amid Dem defections See all Trends Advertisement", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T09:39:34.104+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}