{"organizations": [], "uuid": "ae144804176fbdd2f41dea9d035685e27f3bddc9", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150817121249-trump-zuckerberg-immigration-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_topstories.rss", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/08/17/news/companies/donald-trump-mark-zuckerberg-immigration/index.html", "country": "US", "title": "Donald Trump calls out Mark Zuckerberg on immigration", "performance_score": 10, "site": "cnn.com", "participants_count": 15, "title_full": "Donald Trump calls out Mark Zuckerberg on immigration - Aug. 17, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T23:58:00.000+03:00", "replies_count": 17, "uuid": "786ebf082be74363bdb2bf9302e0b7eb229363a3"}, "author": "Chris Isidore", "url": "http://money.cnn.com/2015/08/17/news/companies/donald-trump-mark-zuckerberg-immigration/index.html#post-0", "ord_in_thread": 0, "title": "Donald Trump calls out Mark Zuckerberg on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump outlines his immigration plan Donald Trump has a new target for his criticism of the nation's immigration policies - Facebook founder Mark Zuckerberg. Zuckerberg is one of the leading tech executives who has called for a more open immigration policy. Specifically, he wants to make more H-1B visas available to tech employers so they can hire foreign skilled workers.\nTrump said he wants to require employers to pay H-1B workers much more money, which he said would discourage companies from hiring them and boost job prospects for Americans. He also wants to have tech jobs offered to unemployed Americans before they can be filled by workers with H-1B visas.\n\"This will improve the number of black, Hispanic and female workers in Silicon Valley who have been passed over in favor of the H-1B program. Mark Zuckerberg's personal Senator, Marco Rubio, has a bill to triple H-1Bs that would decimate women and minorities,\" Trump wrote in his immigration plan. Rubio is also seeking the Republican nomination for president.\nRelated: Bernie Sanders and Donald Trump agree on one big issue\nZuckerberg started a public interest group called Fwd.us to push for immigration and lobbying reform along with Microsoft founder Bill Gates and Yahoo CEO Marissa Mayer. Neither Facebook ( FB , Tech30 ) nor Fwd.us had an immediate comment on Trump's criticism of Zuckerberg.\nTrump says that there are plenty of graduates with degrees in science, technology, engineering and math, known as STEM, to fill tech jobs. That means that employers don't need H-1B visas to fill jobs, and are using them instead to keep wages low.\nEmployers are supposed to pay a typical wage to anyone hired under a H-1B visa. But in reality, employees on these visas are typically paid 20 to 45% less than U.S. workers who they are are often replacing, said Ron Hira, a Howard University public policy professor who has studied the visa's pay scale.\n\"I don't think you should eliminate the H1-B program. The problem is it's being abused and it's a source of very cheap labor,\" said Hira.\nThe first debate night in three minutes: Trump edition The Census Bureau confirms that 74% of people who hold a STEM bachelor's degree have a job outside of those fields.\nRelated: Trump's signature move - the 'meh' shrug\nMany of them work in other well-paying fields, such as finance, accounting, health care or law. College graduates with a STEM degree earn a median income of between $69,700 and $92,900, depending on their field of study. Other college graduates earn between $51,000 to $70,300. The Census Bureau report used 2012 figures, the most recent data available.\nThe unemployment rate for STEM graduates was about 3% in 2012, according to the Census, when the overall unemployment rate was 8%.\nCNNMoney (New York) August 17, 2015: 3:58 PM ET", "external_links": ["http://i2.cdn.turner.com/money/dam/assets/150807082230-donald-trump-first-republican-presidential-primary-debate-1024x576.jpg", "http://www.fwd.us/", "http://i2.cdn.turner.com/money/dam/assets/150817114640-donald-trump-1024x576.jpg"], "published": "2015-08-17T23:58:00.000+03:00", "crawled": "2015-08-18T00:45:01.940+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}