{"organizations": [], "uuid": "2c59adef956b800c77284a4005bde39c2321996f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55cbe9281d00006e00144ab3.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/healthy-living/index.xml", "section_title": "Healthy Living - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/ohio-marijuana-legalization_55cbe829e4b064d5910a7ce5", "country": "US", "title": "Ohio Voters Will Get To Decide On Legalizing Marijuana", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Ohio Voters Will Get To Decide On Legalizing Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:52:00.000+03:00", "replies_count": 0, "uuid": "2c59adef956b800c77284a4005bde39c2321996f"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/ohio-marijuana-legalization_55cbe829e4b064d5910a7ce5", "ord_in_thread": 0, "title": "Ohio Voters Will Get To Decide On Legalizing Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ohio Voters Will Get To Decide On Legalizing Marijuana They'll get to vote on a constitutional amendment in November. Posted: 08/12/2015 08:52 PM EDT ROBYN BECK via Getty Images \nCLEVELAND, Aug 12 (Reuters) - Ohio voters will decide in November whether to legalize marijuana use for treating illnesses and for getting high. \nSecretary of State Jon Husted said on Wednesday he had certified the group ResponsibleOhio had gathered enough valid signatures to place a constitutional amendment before voters in November. \nThe proposed amendment's language still needs approval by the Ohio Ballot Board, he said. \nThe measure would establish a Marijuana Control Commission charged with regulating the growth, sale and taxation of marijuana, similar to legalization plans approved by voters in four other U.S. states. \nIn November, Oregon and Alaska approved the use of marijuana for recreational purposes in state-regulated systems that will usher in retail pot shops similar to those already operating in Washington state and Colorado. \nThe District of Columbia has also voted to allow recreational-use marijuana but not retail shops. \nAbout half of U.S. states allow marijuana for medical use. Sean Gallup via Getty Images \nThe vote in Ohio, a heartland state known as a political bellwether in national elections, reflects the shifting landscape for a substance that remains illegal under federal law. Pro-marijuana groups hope to put similar measures before voters in six other U.S. states in 2016. \nThe Ohio amendment would designate 10 locations for the growing of marijuana and make it legal for people 21 or older to use and possess up to one ounce (28 grams) of the drug and grow up to four marijuana plants for personal use. \nResponsibleOhio handed in 305,591 signatures from half of the state's 88 counties. \nThe wording of the amendment has drawn criticism from some marijuana legalization supporters who say it creates a marijuana monopoly in the state. \nAnother ballot measure, an anti-monopoly proposal backed by state lawmakers in June, would effectively block the marijuana measure if passed in November because a citizen-initiated amendment takes 30 days longer to take effect than a legislative one. \n(Reporting by Kim Palmer in Cleveland, Ohio; Editing by Eric M. Johnson and Mohammad Zargham)", "external_links": [], "published": "2015-08-13T03:52:00.000+03:00", "crawled": "2015-08-13T12:32:27.084+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}