{"organizations": ["Fox News Latino Stolen Picasso", "Fox News Latino Pablo Picasso", "French Embassy", "U.S. Immigration and Customs Enforcement"], "uuid": "057b07f9ced4669db246e27e80330327a93a4bec", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/lifestyle/0/0/Picasso%20Painting%20France.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/lifestyle/2015/08/14/stolen-picasso-painting-recovered-during-immigration-raid-in-new-jersey/", "country": "", "title": "Stolen Picasso painting recovered during immigration raid in New Jersey returned to France | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Stolen Picasso painting recovered during immigration raid in New Jersey returned to France | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T23:30:00.000+03:00", "replies_count": 0, "uuid": "057b07f9ced4669db246e27e80330327a93a4bec"}, "author": "", "url": "http://latino.foxnews.com/latino/lifestyle/2015/08/14/stolen-picasso-painting-recovered-during-immigration-raid-in-new-jersey/", "ord_in_thread": 0, "title": "Stolen Picasso painting recovered during immigration raid in New Jersey returned to France | Fox News Latino", "locations": ["France", "Washington", "New Jersey"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Harnik"], "text": "Stolen Picasso painting recovered during immigration raid in New Jersey returned to France Published August 14, 2015 Fox News Latino Pablo Picasso's \"La Coiffeuse,\" seen in a protective plastic cover, is displayed at the French Embassy in Washington, Thursday, Aug. 13, 2015. The U.S. Immigration and Customs Enforcement returned the stolen painting, valued at $15 million, that was stolen in 1998 and was seized in December 2014. (AP Photo/Andrew Harnik) \nWASHINGTON (AP) – The U.S. government on Thursday formally returned a painting by Pablo Picasso valued at $15 million that had been stolen from a Paris museum more than a decade ago and seized by immigration officials late last year in New Jersey. \nDuring a ceremony at the French Embassy, Sarah Saldaña, director of Immigration and Customs Enforcement, officially repatriated the abstract artwork, titled \"La Coiffeuse\" or \"The Hairdresser.\" It was signed over to Frédéric Doré, the Embassy of France's deputy chief of mission. \n\"There's a tremendous feeling of accomplishment when we return a piece of art like this,\" Saldaña said. \nThe painting was on its way from Belgium to the New York borough of Queens when it was identified and seized in Newark, New Jersey. \nKelly Currie, acting U.S. attorney for the Eastern District of New York, said the package aroused suspicion because it was heading for a climate-controlled storage facility — a peculiar destination for a package carrying French words suggesting it contained a $37 Christmas gift. \nCurrie said the speed with which government agencies handled the case was \"unprecedented.\" \n\"The United States is not an easy market for black-market smuggling of art and antiquities,\" he said. \nDetails of who sent the package and how the painting was stolen weren't provided and the investigation continues. Currie said no arrests have been made. \nPicasso painted \"La Coiffeuse\" in 1911. The brownish Cubist painting, which is no bigger than a pizza box, sat on a tan easel wrapped in plastic and situated behind a burgundy rope for the duration of the event. \nIn November 2001, officials at the National Museum of Modern Art in Paris discovered the artwork was missing from storage when they went to retrieve it in preparation for an exhibition in India. \nOfficials gave no indication when the painting will be returned to the museum and said it had endured minor damages and would have to be restored. \n\"The message from ICE today is, 'This is a part of our mission, a part of the work we do,'\" Saldaña said. \"You saw some tremendous investigative work in detecting this piece to begin with and we will continue to do so.\" \nLike us on Facebook ", "external_links": [], "published": "2015-08-14T23:30:00.000+03:00", "crawled": "2015-08-15T15:12:22.070+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}