{"organizations": [], "uuid": "9d470dd96c3f041f4a1319b6c5d27486017422a3", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/NOVO81915.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/us/2015/08/19/baby-heart-still-beating-after-abortion-doctor-says-in-new-anti-abortion-video/", "country": "US", "title": "Baby's heart 'still beating' after abortion, doctor says in new anti-abortion video", "performance_score": 8, "site": "foxnews.com", "participants_count": 1, "title_full": "Baby's heart 'still beating' after abortion, doctor says in new anti-abortion video | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "9d470dd96c3f041f4a1319b6c5d27486017422a3"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/us/2015/08/19/baby-heart-still-beating-after-abortion-doctor-says-in-new-anti-abortion-video/", "ord_in_thread": 0, "title": "Baby's heart 'still beating' after abortion, doctor says in new anti-abortion video", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print An anti-abortion group released another video targeting Planned Parethood and its partners.  (Center for Medical Progress) \nA doctor for a Planned Parenthood tissue harvesting partner appears to admit a baby’s “heart actually is still beating” at times following abortions and an ex-procurement tech gives a first-person account of watching a baby’s heart beat before she dissects its brain in the latest release from an anti-abortion group.\nThe allegations are part of a new video from the Center for Medical Progress, an anti-abortion activist group that has released a series of undercover and first-person interview videos focusing on Planned Parenthood and its partners.\nWednesday’s 11-minute, edited release features first-person interviews with Holly O’Donnell, a former procurement technician for StemExpress, a tissue harvesting company that worked with Planned Parenthood. It also features clips from previous CMP releases and new undercover audio and video.\nGRAPHIC CONTENT WARNING: Watch the new Planned Parenthood video. \nCMP has been the target of two restraining orders by federal judges – including one from StemExpress – banning them from releasing some of their recordings. But the Los Angeles Superior Court order only bars CMP from releasing video of three StemExpress officials taken at a restaurant in May. Wednesday’s video does not appear to violate that limited order.\n“So you know there are times when after the procedure is done that the heart actually is still beating”\n- Dr. Ben Van Handel\nA recorded conversation heard during the new video features a voice identified as belonging to Dr. Ben Van Handel, the executive director of Novogenix Laboratories, LLC. Novogenix provides researchers with “human primary tissue-specific stem cells” according to its website.\n“So you know there are times when after the procedure is done that the heart actually is still beating,” Handel tells an undercover CMP investigator during the conversation.\nO’Donnell, who has been featured in previous videos, describes a co-worker showing her a beating heart in an aborted baby.\n“‘Hey Holly, come over here, I want you to see something kinda cool. It’s kinda neat,’” O’Donnell said the coworker told her. “So I’m over here, and the moment I see it I’m just flabbergasted. This is the most gestated fetus and the closest thing to a baby that I’ve seen. And she’s like, ‘Okay I want to show you something.’ And she has one of her instruments and she just taps the heart and it starts beating and I’m sitting here and I’m looking at this fetus and its heart is beating and I don’t know what to think.”\nFollowing the demonstration, O’Donnell said she and the co-worker cut the face of the baby open and dissected its brain.\n“It had a face,” O’Donnell said. “It wasn’t completely torn up. And its nose was very pronounced. It had eyelids. Its mouth was pronounced.”\nIn one of the most disturbing portions of the video, CMP shows a clip of a baby seeming to move its arms and legs post-abortion. The clip is from the Grantham Collection and Center for Bio-Ethical Reform and is not new undercover material.\nPrevious videos have appeared to show Planned Parenthood officials admitting the organization alters abortion procedures to procure fetal tissue, delivers intact fetuses and sells fetal tissue for profit. Each of those practices is against federal law. A video last week featured O’Donnell alleging that StemExpress sometimes did not obtain consent from mothers to use their fetal tissue, which would be a serious ethical breach if true.\nPlanned Parenthood has denied breaking any laws and has said payments discussed in the videos relate to reimbursement costs for procuring the tissue – which is legal.\n“These extremists show a total lack of compassion and dignity for women’s most personal medical decisions,” an Aug. 4 statement from Planned Parenthood said.\n“Human Capital Episode 3: Planned Parenthood’s Custom Abortions for Superior Product” is the seventh release from CMP.\nThe videos have brought investigations of Planned Parenthood's policies on aborted fetuses by three Republican-led congressional committees and three states. Investigators in Florida cited four Planned Parenthood clinics for violations earlier this month.\nThe Senate failed to advance a Republican-led measure to halt federal aid to Planned Parenthood before its summer recess. But the issue of defunding Planned Parenthood has become a rallying cry for many groups on the right and is a top issue in the Republican primary battle.", "external_links": [], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-19T18:43:38.905+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}