{"organizations": ["Elise Foley Immigration & Politics"], "uuid": "d83d6f616ebbe209efa6f287a8361ad2bc2d2629", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55bf7aca1d00002f001439ca.jpeg?cache=e6z21R8clJ", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/jeb-bush-immigration-sanctuary-cities_55bf7999e4b0d4f33a0349e3", "country": "", "title": "Jeb Bush Calls For Crackdown On Sanctuary Cities In Immigration Plan", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Jeb Bush Calls For Crackdown On Sanctuary Cities In Immigration Plan", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T18:41:00.000+03:00", "replies_count": 0, "uuid": "d83d6f616ebbe209efa6f287a8361ad2bc2d2629"}, "author": "", "url": "http://www.huffingtonpost.com/entry/jeb-bush-immigration-sanctuary-cities_55bf7999e4b0d4f33a0349e3", "ord_in_thread": 0, "title": "Jeb Bush Calls For Crackdown On Sanctuary Cities In Immigration Plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush", "Bush"], "text": "Jeb Bush Calls For Crackdown On Sanctuary Cities In Immigration Plan Bush's proposals are heavy on enforcement, light on detail about undocumented immigrants. Elise Foley Immigration & Politics Reporter, The Huffington Post Posted: 08/03/2015 11:22 AM EDT Immigration has been seen as a potential weakness for Republican presidential candidate Jeb Bush. | ASSOCIATED PRESS \nWASHINGTON -- Republican presidential candidate Jeb Bush laid out an enforcement-heavy immigration plan on Monday, calling for police to enforce immigration laws and saying those who refuse to do so should lose federal funding. \nBush's six proposals, first released to New Hampshire radio station WMUR and later published on Medium.com , didn't offer much detail on what has been considered a potential weakness for the former Florida governor among GOP primary voters: his longtime support for allowing undocumented immigrants to remain in the U.S. Legal immigration wasn't covered at all. Instead, Bush detailed three proposals on border security and three on interior immigration enforcement, with a jab at President Barack Obama included. \n\"The policies I am advocating can ultimately receive bipartisan support in Congress and become law,\" Bush wrote. \"President Obama has had six-and-a-half years to address our broken immigration system. Instead of leading the nation towards consensus, he has divided the country. One has to ask whether he is more interested in providing a wedge issue for his party than offering a solution for the country. There should be no doubt where I stand.\" \nBush's positions are in line with those of most of the other contenders for the Republican nomination, who have eschewed the idea of a path to citizenship for the undocumented and instead focused on border security and enforcement. While Bush did not get into a specific order for passing his proposals, he did call for a comprehensive approach rather than enforcement first, unlike many of his fellow Republicans. Democratic candidates, meanwhile, have heavily emphasized their support for a path to citizenship for the undocumented immigrants. \nIn the proposals, Bush highlighted his opposition to so-called sanctuary cities, which Republicans are targeting after a previously deported felon was charged with the murder of Kathryn Steinle in San Francisco last month. Critics blamed the city's non-cooperation with Immigration and Customs Enforcement, which local officials in sanctuary cities say helps police better work with the community. Bush called San Francisco \"the worst form\" of a sanctuary city after Steinle's death. \nHis plan instead calls for getting police more involved in immigration enforcement, reversing the approach many jurisdictions have taken thus far. Bush proposes expanded cooperation between the federal government and state and local police to assist with detention and deportation. Jurisdictions that decline to work with ICE should lose federal law enforcement funding, Bush said, a policy House Republicans recently voted to adopt . \nEmployers should be required to use electronic verification to check whether potential hires are legally allowed to work in the U.S., Bush proposed, and individuals who overstay their visas should be found and deported. \nIn his border security proposals, Bush said patrol agents should be \"forward-leaning\" and stationed closer to the border for multiple days at a time. He added that more infrastructure and technology are needed, along with fencing \"where appropriate (e.g., based on the terrain along the border or the proximity of populated areas).\" \nOn undocumented immigrants, the word \"citizenship\" was nowhere to be found -- unsurprising for a candidate who once called for a path to citizenship but has since said he no longer supports it. \nInstead, Bush called for \"a rigorous path\" to legal status \"over an extended period of time,\" a path that includes paying fines and taxes, passing a criminal background check, learning English, working with provisional work authorization and not receiving federal government assistance. \n\"While passions run high on this issue, there is no rational plan to deport millions of people that the American people would support,\" Bush wrote. \"It would disrupt communities and families and could cost taxpayers hundreds of billions of dollars.\" ", "external_links": [], "published": "2015-08-03T18:41:00.000+03:00", "crawled": "2015-08-03T18:41:06.721+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}