{"organizations": [], "uuid": "6d688f40d545219e2786fd8b98b2523263d08323", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c4dd1c1d00006e00144306.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-russia-iran-syria-crisis_55c4d2e7e4b0f1cbf1e4bb76", "country": "US", "title": "Obama: Russia And Iran 'Don’t Seem Concerned About The Humanitarian Disaster' In Syria", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama: Russia And Iran 'Don’t Seem Concerned About The Humanitarian Disaster' In Syria", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T20:42:00.000+03:00", "replies_count": 0, "uuid": "6d688f40d545219e2786fd8b98b2523263d08323"}, "author": "Ryan Grim", "url": "http://www.huffingtonpost.com/entry/obama-russia-iran-syria-crisis_55c4d2e7e4b0f1cbf1e4bb76", "ord_in_thread": 0, "title": "Obama: Russia And Iran 'Don’t Seem Concerned About The Humanitarian Disaster' In Syria", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Obama: Russia And Iran 'Don’t Seem Concerned About The Humanitarian Disaster' In Syria On the plus side, \"The window has opened a crack for us to get a political resolution.\" Ryan Grim Washington bureau chief for The Huffington Post Posted: 08/07/2015 01:42 PM EDT | Edited: 2 minutes ago \nWASHINGTON -- The prospects for a political resolution in Syria are improving now that Russia and Iran have revised their view of President Bashar al Assad’s chances of survival, President Barack Obama told a group of reporters gathered at the White House on Wednesday afternoon. \n“The window has opened a crack for us to get a political resolution in Syria, partly because both Russia and Iran, I think, recognize that the trend lines are not good for Assad,” he said. “Neither of those patrons are particularly sentimental; they don’t seem concerned about the humanitarian disaster that’s been wrought by Assad and this conflict over the last several years, but they are concerned about the potential collapse of the Syrian state. And that means, I think, the prospect of more serious discussions than we’ve had in the past.” \nSome 200,000 people have died since the war began, and many times more have been displaced. \nThe Islamic State claimed another key city in Syria on Thursday, taking Qaryatain from Assad’s forces. Recently, Assad publicly conceded that a lack of manpower has hampered his war effort. \n“A couple of years ago, they might have been feeling that time was on Assad’s side and they could wait this out. I don’t think they feel that way as much anymore,” Obama said. \nEven getting Russia and Iran’s buy-in, however, won’t make the situation easy, the president said. “How to execute an actual transition is very difficult. The strongest opposition forces on the ground are vicious terrorist organizations that are constantly merging and blending with people who just want to get the yoke of an oppressive regime off their backs. And being able to sort through what a representative government would look like -- one that would give Sunnis inside of Syria a sense of their rightful place at the table, while preserving protections for Alawite and Druze and Christians -- after so much bloodshed is going to be tough. \n\"And just because Iran and Syria may recognize Assad’s weaknesses doesn’t necessarily mean that Assad recognizes his weaknesses,” Obama added. “So I don’t want to get carried away in suggesting that we’re on the brink of a significant breakthrough yet, but I think the conversations are more serious now than they might have been earlier.” \nDespite the ongoing U.S.-Russia proxy war in Ukraine, the Iran negotiations suggest that Russia and the U.S. could still work together in Syria. “I was surprised, on the upside, that Russia was able to compartmentalize the Iran issue in light of the severe tensions that we have over Ukraine,” Obama said. “And that underscores Russia’s genuine concern about Iran getting a nuclear weapon, the dangers of proliferation, and the convergence that we do have with Russia in battling against violent extremism.” \nNothing can be completed, he said, without Iran at the table. “And yes, Iran is going to have to be involved. There’s no way to resolve Syria without Iran being involved, given its financing of Assad and the fact that Hezbollah is probably the most effective fighting force that Assad can count on.” \nIran and has aided Assad, as well as the Lebanon-based Hezbollah. \nSaudi Arabia, the largest Sunni power in the Persian Gulf, will also need to be heavily involved, said Obama, despite the nation’s antipathy toward Iran. \nIn April, The Huffington Post reported that Qatar was brokering secret talks between the Turks and Saudis, aimed at enticing both countries to become militarily involved in the Syrian crisis. \n“The Turks’ willingness to take seriously action on the borders to stop the flow of foreign fighters joining ISIL is significant. So I think there’s movement there, but it hasn’t gelled yet,” Obama said. Like this story? Sign up to get an email when politics reporter Ryan Grim publishes a new one. \nEnter your email address:", "external_links": [], "published": "2015-08-07T20:42:00.000+03:00", "crawled": "2015-08-07T20:48:43.119+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}