{"organizations": [], "uuid": "12fd2df1de717d5c8257414dc2c9fe7955fd7c5e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_080515gn2.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/business-a-lobbying/250690-obama-indifferent-to-christians-in-middle-east-former-wh-official-says", "country": "US", "title": "Obama indifferent to Christians in Middle East, Sununu says", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama indifferent to Christians in Middle East, Sununu says", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T21:56:00.000+03:00", "replies_count": 0, "uuid": "12fd2df1de717d5c8257414dc2c9fe7955fd7c5e"}, "author": "Lydia Wheeler", "url": "http://thehill.com/business-a-lobbying/250690-obama-indifferent-to-christians-in-middle-east-former-wh-official-says", "ord_in_thread": 0, "title": "Obama indifferent to Christians in Middle East, Sununu says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama indifferent to Christians in Middle East, Sununu says Greg Nash By Lydia Wheeler - 08/09/15 02:56 PM EDT Former White House Chief of Staff John Sununu said in an interview on Sunday that President Obama seems to be “indifferent” to the persecution of Christians in the Middle East. During an appearance on \"The Cats Roundtable,\" a 970 radio show on AM 970 in New York, Sununu said Americans needs to keep pressuring their congressmen and senators to “talk some sense into the president.” “It’s a tragedy what’s happening,” Sununu told host John Catsimatidis. “And I cannot believe that this administration, this president, does not understand that there is a concerted effort to destroy the Christian community in Iraq, the Christian community in Syria in particular, and they’re being slaughtered.” Sununu, who comes from Greek Orthodox family with roots in the Middle East, said there are tens of thousands of Christians being killed. “There seems to be an indifference in Washington to what is happening there,” he said. “These are not trivial numbers.” Sununu served as New Hampshire’s 75 th governor and White House chief of staff during the George W. Bush administration. Tags: Past: 1 day Trump slams Fox News, praises... “What’s better than Drudge? He’s a fantastic guy. What he’s built is... Protesters shut down Bernie... The protesters claimed affiliation with the Black Lives Matter movement. Most retweeted GOP debate tweet... The liberal lawmaker's tweet was retweeted over 20,000 times. Fury of left falls on Schumer Charles Schumer’s decision to oppose the nuclear deal with Iran has roiled... 2016 contenders criticize Trump... Jeb Bush joins Scott Walker, Lindsey Graham, Mike Huckabee and Carly... Limbaugh rips Fox News for 'war on... \"The last place I ever thought I would see it continued is Fox News,\" the... Trump: Megyn Kelly had blood... The candidate is ratcheting up his feud with the Fox News debate moderator. Can anything bring down Teflon... Strategists in both parties are scratching their heads and wondering how... Conservative event disinvites... RedState Gathering has instead invited Kelly to appear in Trump's place... Trump goes to war with Fox News Trump unleashed attacks toward Fox News anchor Megyn Kelly and pollster... Brent Budowsky: Is Trump a Clinton... OPINION | Is Trump’s run in the GOP primary designed to wreak havoc on the... Trump tries to clarify Megyn Kelly... Trump tweeted Saturday morning that “wherever” meant Kelly’s nose. State rep planned to accuse... Todd Courser reportedly aimed to plant a fake story about being caught... Boehner turns up heat on Hillary He has waged a sustained attack against the Democratic front-runner. Megyn Kelly calls out Trump the... Her questions were tough, based on facts that Donald Trump did not contest. Trump slams Rosie O'Donnell in... Megyn Kelly questioned Trump's comments calling women \"fat pigs, dogs and... Trump campaign loses top adviser But it's not clear whether Trump or advisor Roger Stone severed the... Trump starts online fundraising... “I have no doubt that the liberal media and the GOP establishment will... Trump is right on Crimea His answer, though, sent shockwaves through the bipartisan military... Trump campaign: 'Only a deviant'... The candidate is pushing back against the growing backlash over his... FBI issues alert about military... VIDEO | The alert says Middle Eastern men are approaching families in... Election model predicts Dem will... A Democrat will win the White House, but just barely, Moody’s Analytics... Elizabeth Warren's marriage... The Hill's Judy Kurtz joins Fox 5 for her weekly \"in The Know\" segment.", "external_links": [], "published": "2015-08-09T21:56:00.000+03:00", "crawled": "2015-08-09T23:01:53.238+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}