{"organizations": [], "uuid": "dd22b1051f2d804caf37d4e63889a0f47032062e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3309838/images/o-JEB-BUSH-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/barack-obama/feed", "section_title": "Barack Obama on Huffington Post", "url": "http://www.huffingtonpost.com/john-a-tures/who-withdrew-from-iraq-wa_b_7997690.html", "country": "US", "title": "John A. Tures: Who Withdrew From Iraq? Was It Bush or Obama and Clinton?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "John A. Tures: Who Withdrew From Iraq? Was It Bush or Obama and Clinton?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T11:22:00.000+03:00", "replies_count": 0, "uuid": "dd22b1051f2d804caf37d4e63889a0f47032062e"}, "author": "John A. Tures", "url": "http://www.huffingtonpost.com/john-a-tures/who-withdrew-from-iraq-wa_b_7997690.html", "ord_in_thread": 0, "title": "John A. Tures: Who Withdrew From Iraq? Was It Bush or Obama and Clinton?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nJeb Bush has claimed that President Barack Obama and Hillary Clinton were responsible for withdrawal from Iraq. But is that true? A look at the evidence, including George W. Bush's own words and White House website, shows who was really responsible for America's departure, contributing to the rise of ISIS. \nBBC News reported that at the Ronald Reagan Presidential Library, Jeb Bush said \n\"So eager to be the history-makers, they failed to be the peacemakers,\" Mr Bush said of Mr Obama and Mrs Clinton. \"It was a case of blind haste to get out and to call the tragic consequences somebody else's problem. Rushing away from danger can be every bit as unwise as rushing into danger, and the costs have been grievous.\" \nBut were Obama and Clinton responsible for the withdrawal? \nHere's the transcript from the George W. Bush White House Archives site , and his meeting with Iraqi Prime Minister Nouri al-Maliki in December 2008. And here are the details of the Strategic Framework Agreement and Security Agreement with Iraq, also on the Bush White House Archives site . Here are the details of the deal Bush signed, or you could read it yourself at the link. \n\"The Security Agreement also sets a date of December 31, 2011, for all U.S. forces to withdraw from Iraq. This date reflects the increasing capacity of the Iraqi Security Forces as demonstrated in operations this year throughout Iraq, as well as an improved regional atmosphere towards Iraq, an expanding Iraqi economy, and an increasingly confident Iraqi government.\" \nPerhaps it was Jeb Bush's brother who was so eager to be the history-maker, and sign the deal in December of 2008, so he could get credit for the withdrawal. \nWhen confronted with this, Jeb Bush said that Obama didn't try hard enough to keep American troops in Iraq. \nObama did try to negotiate an extension, but Iraq's al-Maliki government would not give American troops immunity from Iraq law, something the U.S. President called \"the deal breaker.\" And Iraq's decision not to provide such immunity was criticized by Republican conservatives . \nWhen made aware of these arguments, Jeb Bush tried one last time to pin it all on Obama. In 2009, the \"mission was accomplished,\" the former Florida Governor insisted . \nMission...Accomplished. Those were ironically the same words that President George W. Bush used to insist that the war was over in 2003, when in reality, we were unprepared for a brutal war, and the deaths of thousands of American military personnel at the hands of domestic insurgents and international terrorists. \nJeb Bush was attempting to deflect attention from George W. Bush and his Iraq policies. Instead, he reminded us not only who was in charge of the Iraq War and withdrawal, but how eerily similar the two brothers are about so many things. One may never think of one without thinking of the other. \nJohn A. Tures is a professor of political science at LaGrange College in LaGrange, Ga. He can be reached at jtures@lagrange.edu . More:", "external_links": [], "published": "2015-08-17T11:22:00.000+03:00", "crawled": "2015-08-17T17:20:43.915+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}