{"organizations": [], "uuid": "7763dd04f7be790740a14c7c0c55372f9a8d4ddb", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3284376/images/o-OBAMA-MARTHA-VINEYARD-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/08/10/obama-vacaciones-marthas-vineyard_n_7961896.html", "country": "", "title": "Los Obama disfrutan de unas lujosas vacaciones en Martha's Vineyard (FOTOS)", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Los Obama disfrutan de unas lujosas vacaciones en Martha's Vineyard (FOTOS)", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T18:51:00.000+03:00", "replies_count": 0, "uuid": "7763dd04f7be790740a14c7c0c55372f9a8d4ddb"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/08/10/obama-vacaciones-marthas-vineyard_n_7961896.html", "ord_in_thread": 0, "title": "Los Obama disfrutan de unas lujosas vacaciones en Martha's Vineyard (FOTOS)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "reddit \nLos Obama disfrutan de un descanso en la exclusiva isla de Martha's Vineyard en Massachusetts. \nEl presidente, como se aprecia en las fotos, pasará buena parte de sus días en su pasatiempo favorito: golf . \nYa es tradición que el presidente y su familia visite la lujosa zona en el noreste del país cada año. En el 2014, el presidente tomó las vacaciones más largas con su familia desde que ocupó la Casa Blanca. \nLa familia presidencial se suele alojar en una lujosa mansión, propiedad de Joanne Hubschman, cuyo fallecido esposo, Henry, era uno de los más altos ejecutivos de la compañía General Electric. \nLa residencia, estimada en 12 millones, ocupa un área de 10 acres con piscina, cancha de tenis y baloncesto, gimnasio, aparte de una paradisiaca vista al mar, de acuerdo con ABC . \nLa familia Hubschman ha donado importantes sumas de dinero al Partido Demócrata y a diferentes campañas de candidatos. \n>>>MIRAS LAS FOTOS: Mark Wilson via Getty Images A la salida de la Casa Blanca y listos para las vacaciones. Michelle y Barack Obama acompañados de su hija Sasha. ASSOCIATED PRESS La pareja presidencial con su hija caminan rumbo al Marine One. ASSOCIATED PRESS Obama, con una sonrisa en la cara, conversa con su esposa. ASSOCIATED PRESS Michelle Obama, muy clásica en este vestido negro. SAUL LOEB via Getty Images Al arribo a Martha's Vineyard, el presidente y la primera dama saludan a simpatizantes. SAUL LOEB via Getty Images Llegaron a Martha's Vineyard a bordo del Marine One. SAUL LOEB via Getty Images La primera dama saluda a su descenso del Marine One. ASSOCIATED PRESS El presidente conversa con el congresista demócrata Bill Keating a su llegada a Massachusetts. ASSOCIATED PRESS El golf, el pasatiempo favorito del presidente. ASSOCIATED PRESS Obama juega al golf mientras Michelle Obama y las niñas disfrutan de la playa. ASSOCIATED PRESS ", "external_links": [], "published": "2015-08-10T18:51:00.000+03:00", "crawled": "2015-08-10T18:51:57.834+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}