{"organizations": ["State Kerry"], "uuid": "20a3a19210f77d5b8da61b5bc655ab41d2da73f8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/najmedin-meshkati/profiles-in-courage-of-ou_b_7937354.html", "country": "", "title": "Profiles in Courage of our Epoch: President Obama and Secretary of State Kerry | Najmedin Meshkati", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Profiles in Courage of our Epoch: President Obama and Secretary of State Kerry | Najmedin Meshkati", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "20a3a19210f77d5b8da61b5bc655ab41d2da73f8"}, "author": "", "url": "http://www.huffingtonpost.com/najmedin-meshkati/profiles-in-courage-of-ou_b_7937354.html", "ord_in_thread": 0, "title": "Profiles in Courage of our Epoch: President Obama and Secretary of State Kerry | Najmedin Meshkati", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Najmedin Meshkati", "Obama"], "text": "reddit \nPresident Kennedy was fond of quoting Dante that \"the hottest places in Hell are served for those who, in a time of great moral crisis, maintain their neutrality.\" (Robert F. Kennedy, December 18, 1963) \nThe unprecedented harsh way that President Obama and Secretary of State Kerry were/are recently characterized and treated by some members of the Congress and a few politicians concerning the nuclear deal with Iran , could be considered as a symptom of a brewing national moral crisis. In the words of an editorial in The New York Times , it was not only \"beyond ugly\", but also \"disrespectful and insulting\" , according to Senator Barbara Boxer (D-CA). \nMr. Obama has graciously opined that these reactions are \"part of a general pattern we've seen that would be considered ridiculous if it weren't so sad. We had a sitting senator called John Kerry Pontius Pilate. We've had a sitting senator, who also happens to be running for president, suggest that I'm the leading state sponsor of terrorism.\" \nPresident Obama and Secretary Kerry, who have also been former senators, are cut from the same cloth as what President John F. Kennedy, in his Pulitzer Prize-winning book (1956), Profiles in Courage , depicted as \"courageous\" (senators). Those who defied their constituents, did what they believed is right for the country, and suffered from severe criticism. \"Men whose abiding loyalty to their nation triumphed over all personal and political considerations, men who showed the real meaning of courage and a real faith in democracy. ... And thus, in the days ahead, only the very courageous will be able to take the hard and unpopular decisions necessary for our survival.\" President Kennedy's bold vision for political courage and making compromises also beautifully applies to this very context of the nuclear deal with Iran: \nWe shall need compromises in the days ahead, to be sure. But these will be, or should be, compromises of issues, not of principles. We can compromise our political positions, but not ourselves. We can resolve the clash of interests without conceding our ideas... Compromise does not mean cowardice. Indeed it is frequently the compromisers and conciliators who are faced with the severest tests of political courage as they oppose the extremist views of their constituents. \nIn light of the extremists' ongoing onslaught whilst courageous steadfastness of Messrs, Obama and Kerry and their dignified, measured responses, one could say that they certainly, at least, deserve receiving the John F. Kennedy Profile in Courage Award . They should be recognized for \"stand[ing] fast for the ideals upon which this country was founded, often at great personal risk\" (Caroline Kennedy, 2003); as well as for their remarkable dedication and quality of political courage that JFK admired most. \n\nNajmedin Meshkati, a Professor Engineering and International Relations at the University of Southern California (USC), was a Jefferson Science Fellow and Senior Science and Engineering Advisor, Office of Science and Technology Advisor to the Secretary of State (2009-2010), and nominator of the late congressman John P. Murtha for the Profile in Courage Award, which he received in 2006. More: ", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T16:52:32.824+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}