{"organizations": [], "uuid": "e56233b417b66d5ea0451ce460e4532bb2a9187c", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150814164312-donald-trump-august-11-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/08/18/politics/donald-trump-immigration-policy-tweets/index.html", "country": "US", "title": "Donald Trump undermines his own immigration policy", "performance_score": 2, "site": "cnn.com", "participants_count": 1, "title_full": "Donald Trump undermines his own immigration policy - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "e56233b417b66d5ea0451ce460e4532bb2a9187c"}, "author": "Jeremy Diamond", "url": "http://www.cnn.com/2015/08/18/politics/donald-trump-immigration-policy-tweets/index.html", "ord_in_thread": 0, "title": "Donald Trump undermines his own immigration policy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Donald Trump says he wants to keep smart, talented foreign students in the U.S. But his own immigration proposal would make it harder to do so (CNN) Donald Trump appeared to contradict his own immigration policy proposal Tuesday, just two days after releasing a detailed outline of his plans.\nTrump said he wants foreigners who study at American universities to be able to stay in the U.S., but his immigration plan released Sunday would make it more difficult for foreigners to obtain certain visas and green cards that would allow them to remain and work in the U.S. legally.\n\"When foreigners attend our great colleges & want to stay in the U.S., they should not be thrown out of our country,\" Trump tweeted on Tuesday. \"I want talented people to come into this country -- to work hard and become citizens. Silicon Valley needs engineers, etc.\"\nWhen foreigners attend our great colleges & want to stay in the U.S., they should not be thrown out of our country.\n— Donald J. Trump (@realDonaldTrump) August 18, 2015 I want talented people to come into this country—to work hard and to become citizens. Silicon Valley needs engineers, etc.\n— Donald J. Trump (@realDonaldTrump) August 18, 2015 But in a section of his immigration proposal entitled \"Put American Workers First,\" Trump blames \"the influx of foreign workers\" for keeping salaries from growing, keeping unemployment high and making it difficult for \"poor and working class Americans ... to earn a middle class wage.\"\nRELATED: Trump outlines immigration specifics\nCNN reached out to Trump's campaign to explain the discrepancy, but the they have yet to respond.\nAnd while Trump insisted Tuesday that \"Silicon Valley needs engineers\" and suggested foreigners could fill that void, Trump's plan would make it more difficult for companies to hire foreigners with degrees in the STEM fields (science, technology, engineering and mathematics).\nTrump proposed tightening requirements on H-1B visas, which companies use to hire foreigners in the STEM fields, by raising the salary threshold for those visas and requiring employers to first hire Americans before considering foreign hires.\nTrump also proposed a temporary freeze on issuing new green cards, calling for \"a pause where employers will have to hire from the domestic pool of unemployed immigrant and native workers.\"\nFollow @CNNpolitics", "external_links": ["https://twitter.com/realDonaldTrump/status/633695409408491520", "https://twitter.com/realDonaldTrump/status/633695559900073984", "https://www.donaldjtrump.com/positions/immigration-reform", "https://twitter.com/CNNpolitics"], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-18T23:00:54.029+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}