{"organizations": ["Facebook", "Twitter"], "uuid": "550e73a95d0bf1b56bb4957bc22de4a9aee921de", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/abcnews.rss", "section_title": "ABC News (US)", "url": "http://www.foxnews.com/us/2015/08/27/fatal-shot-in-san-francisco-murder-case-that-sparked-immigration-spat/", "country": "US", "title": "Fatal shot in San Francisco murder case that sparked immigration spat ricocheted off pavement", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Fatal shot in San Francisco murder case that sparked immigration spat ricocheted off pavement", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T12:27:00.000+03:00", "replies_count": 0, "uuid": "550e73a95d0bf1b56bb4957bc22de4a9aee921de"}, "author": "", "url": "http://www.foxnews.com/us/2015/08/27/fatal-shot-in-san-francisco-murder-case-that-sparked-immigration-spat/", "ord_in_thread": 0, "title": "Fatal shot in San Francisco murder case that sparked immigration spat ricocheted off pavement", "locations": ["San Francisco"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fatal shot in San Francisco murder case that sparked immigration spat ricocheted off pavement Published August 27, 2015 Facebook 0 Twitter 0 Email Print \nSAN FRANCISCO – The shot that killed a young San Francisco woman and touched off a heated immigration debate ricocheted off pavement before striking her in the back, which defense attorneys say show the killing was an accident. \nBut San Francisco police inspector John Evans testified the bullet traveled in a straight line, suggesting Juan Francisco Lopez-Sanchez was pointing the gun in the direction of Kate Steinle, 32. \nThe competing versions of the same event emerged Wednesday during the second day of a preliminary hearing held to determine if there's enough evidence for Lopez-Sanchez to stand trial on murder charges. A third day of testimony is expected Thursday. A judge will rule later. \nEvans testified Wednesday that investigators found a spot on Pier 14 where a bullet left a mark on July 1 before striking Steinle in the back as she walked with her father. San Francisco medical examiner Michael Hunter also testified Wednesday that the bullet made a rectangular-shaped wound rather than a typical oval-shaped wound, indicating too that the bullet had ricocheted before striking Steinle. \nNonetheless, prosecutors have charged Lopez-Sanchez with intentionally firing at Steinle. \nSanchez told police he fired the fatal bullet, but called the incident an accident, according to his lawyer Matt Gonzalez and court testimony. \nLopez-Sanchez said he found the Sig Sauer .40-caliber pistol wrapped in a T-shirt under a bench on San Francisco's Pier 14. The gun belonged to a Bureau of Land Management ranger, who reported that his service weapon was stolen from his car in downtown San Francisco in June. \nDivers plucked the gun from San Francisco Bay next to the pier the day after the shooting. \nSan Francisco Police ballistics expert Andy Smith testified that the gun was in good, working condition and that the weapon probably didn't malfunction. \n\"Pulling the trigger, however that trigger was pulled, was the only way for that gun to discharge,\" Smith said. \"This gun could not just be sitting on a table and all of a sudden, due to some malfunction, go off.\" \nGonzalez suggested that his client \"mishandled\" the gun, which needs about five pounds of pressure to pull the trigger and successfully fire. \nGonzalez said he plans to call a gun expert to the witness stand Thursday to testify about accidental shootings involving the gun Lopez-Sanchez fired. \nSan Francisco and other cities and counties ignore requests from federal authorities to detain jail inmates who are thought to be in the country illegally. \nSan Francisco Sheriff Ross Mirkarimi said he was following city law when jailers released Lopez-Sanchez after a 20-year-old marijuana possession charge was dropped. But leading politicians, including top Democrats such as California Sen. Dianne Feinstein and presidential hopeful Hillary Clinton, said Lopez-Sanchez should have been detained. Advertisement", "external_links": [], "published": "2015-08-27T12:27:00.000+03:00", "crawled": "2015-08-27T12:42:42.614+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}