{"organizations": [], "uuid": "3a666b81bf0e6c3f3e1b68400f46104fa67a4d41", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/computersmartphoneinternet_051315getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/regulation/energy-environment/250203-smartphone-laptop-batteries-facing-new-efficiency-standards", "country": "US", "title": "Obama officials push efficiency rules for smartphones, laptops", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama officials push efficiency rules for smartphones, laptops", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T20:41:00.000+03:00", "replies_count": 0, "uuid": "3a666b81bf0e6c3f3e1b68400f46104fa67a4d41"}, "author": "Tim Devaney", "url": "http://thehill.com/regulation/energy-environment/250203-smartphone-laptop-batteries-facing-new-efficiency-standards", "ord_in_thread": 0, "title": "Obama officials push efficiency rules for smartphones, laptops", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama officials push efficiency rules for smartphones, laptops Getty Images By Tim Devaney - 08/04/15 01:41 PM EDT The Obama administration is considering new rules that would require the batteries of smartphones and laptops to last longer when charged. The Department of Energy (DOE) is pushing the stronger efficiency standards for rechargeable batteries used in smartphones, laptops, tablets, MP3 players, and digital cameras. The proposed regulations, which are coming soon, would cut rechargeable battery energy use by 11 percent, according to DOE, while saving consumers as much as $1.2 billion. ADVERTISEMENT The rules would also offer significant environmental benefits, according to the administration, but it would also cost industry $529 million to comply. \"This standard covers everything that has a rechargeable battery — everything from cell phones, to tablets, to cordless power tools to ride-on toy cars,” said Andrew deLaski, spokesman for the Appliance Standards Awareness Project. The DOE estimates about 95 percent of the industry already comply with the standards, but the agency is targeting the small portion of rechargeable batteries that don’t. The department is expected to strengthen its previous 2012 proposal, which energy advocates say would have weakened compliance. At the time, California had already issued stronger standards that many states were already following. But the DOE’s rules would have provided an incentive for many states to follow the lesser standard, which could have increased consumer energy bills by $300 million each year, according to the Appliance Standards Awareness Project. The DOE is now revising the proposal to match California’s standards, which advocates are calling a victory. The rules are expected to hit the Federal Register in the coming weeks. Past: 1 day Bush drops 40 pounds on Paleo diet Bush talked about his weight loss in an interview at an Iowa Dairy Queen. Trump: Harvard students '... Trump fell victim to an elaborate prank by a group of Harvard students. Juan Williams: GOP's anger turns... OPINION | Republicans who feed the resentments of the base imperil GOP... Trump widens lead in new poll The billionaire businessman leads Jeb Bush 26 percent to 12 percent. Rand Paul attributes Trump's rise... \"We're going to come back to our senses and look for someone serious,\"... Trump builds his political machine He is taking aggressive steps in Iowa and New Hampshire. Kasich makes quick rise in polls Ohio Gov. John Kasich entered the GOP race late but has already made... Sanders disagrees with Clinton on... Sanders said he was surprised by Clinton's reluctance to state a position... Senate GOP thwarted in effort to... Two Democrats voted to move forward with the bill, which stalled in a 53-... GOP field gets ready to rumble The top 10 candidates are preparing to face off in the long-awaited Fox... Sanders: 'No question' I can beat... The longshot presidential candidate said he is forcing Hillary to \"respond... Trump sees double-digit surge in... Trump leads the GOP field in a new Wall Street Journal/NBC News poll. Signs of division in the GOP on... Some Republicans are questioning the strategy of using budget... Harvard Lampoon tricks Trump with... A fake endorsement called Trump \"the most formidable and competitive\" GOP... Cruz cooks bacon with a machine gun The presidential candidate shows off the method in a new video. Gawker publishes Trump phone number “Mr. Trump has several numbers so this is not an issue,” a campaign source... Jindal cuts off state Medicaid... The presidential candidate cited the recent controversial videos. Carson: Black Lives Matter... Carson also discussed illegal immigration in an NBC interview. Dem senator backs defunding... Manchin is the first Senate Democrat to back the legislation. Trump: GOP challengers 'viciously... \"They attacked me first and I hit them back,\" he said Sunday. Iran denies link between... A website alleged that Javad Zarif’s son was the best man at Vanessa Kerry... Poll: ObamaCare enrollees less... Cost is the most common problem cited by people who are enrolled.", "external_links": [], "published": "2015-08-04T20:41:00.000+03:00", "crawled": "2015-08-04T21:12:39.479+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}