{"organizations": [], "uuid": "e4e654989d4c3e8ffaf3c9ca997959a1646daabf", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150804123705-denali-6-aboveitall-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_us.rss", "section_title": "CNN.com - U.S.", "url": "http://edition.cnn.com/2015/08/30/politics/obama-alaska-denali-climate-change/index.html", "country": "US", "title": "McKinley to Denali: In Alaska, Obama to rename tallest U.S. peak - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "McKinley to Denali: In Alaska, Obama to rename tallest U.S. peak - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T22:59:00.000+03:00", "replies_count": 0, "uuid": "e4e654989d4c3e8ffaf3c9ca997959a1646daabf"}, "author": "Jim Acosta", "url": "http://edition.cnn.com/2015/08/30/politics/obama-alaska-denali-climate-change/index.html", "ord_in_thread": 0, "title": "McKinley to Denali: In Alaska, Obama to rename tallest U.S. peak - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights President Barack Obama is traveling to Alaska to discuss climate change for the week He will be renaming the country's tallest mountain from Mt. McKinley to Denali Anchorage, Alaska (CNN) To hear the White House describe Alaska, the state has become the canary in the climate change coal mine, complete with raging wildfires, accelerating ice melt in the arctic, vanishing glaciers and whole villages forced to relocate away from rising seas.\nPresident Barack Obama will carry that urgent message to Alaska this week in the hopes his long journey away from his busy agenda in Washington will begin to change the national conversation on global warming.\nHis first step while he's there: officially renaming the country's tallest mountain from Mt. McKinley to Denali, an historic nod to the region's native population, which the White House says is under threat from the already-present threat of climate change.\n\"This is all real. This is happening to our fellow Americans right now,\" Obama said in his weekly address Saturday.\nAll week long, Obama will try to call attention to Alaska as a kind of climate change ground zero. Whether it's a hike on a melting glacier near the town of Seward or his visit with a fisherman in the remote coastal village of Dillingham, the President wants a distracted public to see the jarring effects of global warming through his own eyes.\nTo maximize the impact of the historic trip, which will make Obama the first sitting U.S. president to visit the arctic, the White House plans to devote all of the resources of its potent social media operation.\nJUST WATCHED The president's Iran embarrassment Replay More Videos ... MUST WATCH\nThe president's Iran embarrassment 00:52 It's also using the trip to formalize the Denali name change, which native Alaskans have sought for decades. Named McKinley in 1896, shortly after President William McKinley was nominated as a candidate for office, the 20,320-foot peak has long been known locally as Denali, its name in the indigenous Athabascan language.\nThe national park that surrounds the mountain was named Denali in 1980, but the peak itself is still listed in official federal documents as McKinley. Past attempts to make the change were blocked by lawmakers from McKinley's home state of Ohio.\nRELATED: Why Ohio lawmakers don't want Mt. McKinley renamed Denali\nObama is set to meet Monday with members of the native population to discuss ways the federal government can help them prepare for the effects of a changing climate, which the White House says include interrupted winter hunting seasons, newly hostile conditions for fish and wildlife and seawater encroaching on long-settled territory.\n\"The issue of climate change is not an issue of the future tense in Alaska, it is affecting people's lives and their livelihoods in real ways,\" White House senior adviser Brian Deese said in a preview of the three-day trip.\nDuring a conference call with reporters, Deese laid out the administration's latest data on the climate challenges facing Alaskans.\nThe arctic has warmed almost twice as fast as the rest of the world and portions of northern Alaska have lost a \"football field's worth of land a day to coast erosions and sea-level rise,\" Deese said.\n13 photos: Then-Senator Barack Obama's trip to Kenya Fourteen years after traveling to Kenya for the first time, Barack Obama received a warm welcome when he and his family visited in August 2006. Hide Caption 1 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Arriving on East African Express Airlines, Obama stepped off to far less fanfare than when he will later descend the steps of Air Force One. Hide Caption 2 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya A safari in the Maasai Mara National Reserve was one of the side trips on Obama's 17-day, six-nation tour of Africa in 2006. Hide Caption 3 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya On the lookout for wild game, Obama and his family set off across the Maasai Mara. A lion kill was the day's highlight. Hide Caption 4 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Artwork sprouted up across Kenya celebrating the ancestral roots of Obama, including this mural in Nairobi. Hide Caption 5 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Michelle Obama and the couple's two daughters, Sasha and Malia, joined a school dedication during the 2006 trip. Hide Caption 6 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Obama and Malia, who he playfully called \"Cool Breeze,\" enjoyed the scenery in rural Kenya. Hide Caption 7 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Peace Corps volunteers from the United States were pleased to run into Obama in Kisumu, Kenya. Hide Caption 8 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya The Obama brand was popular across Africa, too, with these admirers holding up shirts as they watched Obama pass. Hide Caption 9 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Sarah Obama, the matriarch of the family, welcomed Obama to her home in Kogelo. She was the stepmother of his father, Barack Obama Sr. Hide Caption 10 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Large crowds gathered across Kenya to welcome Obama, who received too many gifts to bring home to the United States. Hide Caption 11 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Five months before announcing his presidential bid, Obama sat in a Nairobi school and discussed the hopes and dreams of students. Hide Caption 12 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya The Nation, the premiere newspaper in Nairobi, treated the freshman senator's visit as major news. Hide Caption 13 of 13 Wildfires have scorched \"5 million acres of land, which is approximately the size of my home state of Massachusetts,\" he added.\nObama will deliver remarks at a conference of arctic nations in Anchorage to foreign ministers representing counties with a vested interest in the region. Secretary of State John Kerry, Interior Secretary Sally Jewell and other top administration officials are also making the 4,000-mile plus journey for the gathering.\nThe foreign policy implications of a changing arctic are quickly coming into focus for the Obama administration, as Russia is increasingly behaving like a military rival in the area.\nThe Center for Strategic and International Studies, a Washington think-tank recently warned Moscow is boosting its military presence in the arctic, dubbing the Russian ambitions as \"the ice curtain.\"\nThe rapid ice melt in the Arctic is more than just a military concern. There are also vital economic considerations, as the evolving climate is opening up new shipping opportunities over the top of the world for counties from China to Scandinavia.\nBut for fishermen who have relied on the predictability of Alaska's frigid temperatures for generations, the stakes are much higher. As the President noted in his weekly address, the state's independent governor warns four Alaskan villages are in \"imminent danger\" and must be relocated.\n\"Think about that. If another country threatened to wipe out an American town, we'd do everything in our power to protect ourselves,\" Obama said in the address. \"Climate change poses the same threat, right now.\"\n11 photos: 11 ways climate change affects the world Melting polar ice caps – The consequences of climate change go far beyond warming temperatures, which scientists say are melting the polar ice caps and raising sea levels. Click through the gallery for a look at 10 other key effects of climate change, some of which may surprise you. Hide Caption 1 of 11 11 photos: 11 ways climate change affects the world Drought – In the coming decades climate change will unleash megadroughts lasting 10 years or more, according to a new report by scholars at Cornell University, the University of Arizona and the U.S. Geological Survey. We're seeing hints of this already in many arid parts of the world and even in California, which has been rationing water amid record drought. In this 2012 photo, a man places his hand on parched soil in the Greater Upper Nile region of northeastern South Sudan. Hide Caption 2 of 11 11 photos: 11 ways climate change affects the world Wildfires – There's not a direct link between climate change and wildfires, exactly. But many scientists believe the increase in wildfires in the Western United States is partly the result of tinder-dry forests parched by warming temperatures. This photo shows a wildfire as it approaches the shore of Bass Lake, California, in mid-September. Hide Caption 3 of 11 11 photos: 11 ways climate change affects the world Coral reefs – Scientists say the oceans' temperatures have risen by more than 1 degree Fahrenheit over the last century. It doesn't sound like much, but it's been enough to affect the fragile ecosystems of coral reefs, which have been bleaching and dying off in recent decades. This photo shows dead coral off the coast of St. Martin's Island in Bangladesh. Hide Caption 4 of 11 11 photos: 11 ways climate change affects the world Food prices – A U.N. panel found in March that climate change -- mostly drought -- is already affecting the global agricultural supply and will likely drive up food prices. Here, in 2010, workers on combines harvest soybeans in northern Brazil. Global food experts have warned that climate change could double grain prices by 2050. Hide Caption 5 of 11 11 photos: 11 ways climate change affects the world Pollen allergies – Are you sneezing more often these days? Climate change may be to blame for that, too. Recent studies show that rising temperatures and carbon dioxide levels promote the growth of weedy plant species that produce allergenic pollen. The worst place in the United States for spring allergies in 2014, according to the Asthma and Allergy Foundation of America? Louisville, Kentucky . Hide Caption 6 of 11 11 photos: 11 ways climate change affects the world Deforestation – Climate change has not been kind to the world's forests. Invasive species such as the bark beetle, which thrive in warmer temperatures, have attacked trees across the North American west, from Mexico to the Yukon. University of Colorado researchers have found that some populations of mountain pine beetles now produce two generations per year, dramatically boosting the bugs' threat to lodgepole and ponderosa pines. In this 2009 photo, dead spruces of the Yukon's Alsek River valley attest to the devastation wrought by the beetles. Hide Caption 7 of 11 11 photos: 11 ways climate change affects the world Mountain glaciers – The snows capping majestic Mount Kilimanjaro, Africa's highest peak, once inspired Ernest Hemingway. Now they're in danger of melting away altogether. Studies suggest that if the mountain's snowcap continues to evaporate at its current rate, it could be gone in 15 years. Here, a Kilimanjaro glacier is viewed from Uhuru Peak in December 2010. Hide Caption 8 of 11 11 photos: 11 ways climate change affects the world Endangered species – Polar bears may be the poster child for climate change's effect on animals. But scientists say climate change is wreaking havoc on many other species -- including birds and reptiles -- that are sensitive to fluctuations in temperatures. One, this golden toad of Costa Rica and other Central American countries, has already gone extinct. Hide Caption 9 of 11 11 photos: 11 ways climate change affects the world Animal migration – It's not your imagination: Some animals -- mostly birds -- are migrating earlier and earlier every year because of warming global temperatures. Scholars from the University of East Anglia found that Icelandic black-tailed godwits have advanced their migration by two weeks over the past two decades. Researchers also have found that many species are migrating to higher elevations as temperatures climb. Hide Caption 10 of 11 11 photos: 11 ways climate change affects the world Extreme weather – The planet could see as many as 20 more hurricanes and tropical storms each year by the end of the century because of climate change, according to a 2013 study published in the Proceedings of the National Academy of Sciences. This image shows Superstorm Sandy bearing down on the New Jersey coast in 2012. Hide Caption 11 of 11 Even though environmentalists welcome the President's focus, some conservationists have accused Obama of climate hypocrisy, citing the recent approval for Royal Dutch Shell to begin oil and gas drilling in the Chukchi Sea off of Alaska's northwest coast. Also of concern to climate change activists is the administration's looming decision on the Keystone XL pipeline.\n\"Climate leaders don't drill in the arctic,\" tweeted the progressive group, Credo. The tweet featured a rendering of Obama wearing a Shell oil patch on his chest and standing on an aircraft carrier with a banner reading \"Mission Accomplished,\" a reference to the image of President George W. Bush during the Iraq War.\nThe President defended the decision in favor of Shell's application as part of a balanced energy approach which he describes as the development of domestic resources of oil and natural gas until more sustainable, alternative fuel sources become the norm.\n\"I share people's concerns about offshore drilling. I remember the BP spill in the Gulf of Mexico all too well,\" Obama said in his weekly address. \"That's precisely why my administration has worked to make sure that our oil exploration conducted under these leases is done at the highest standards possible.\"\nOne White House official dubbed the journey to Alaska a \"signature\" trip of the Obama presidency, noting climate change will come to be seen as a top priority in the administration's \"fourth quarter.\"\nJust last week, Obama paid visits to Nevada to discuss initiatives to expand solar power and New Orleans where he marked the 10th anniversary of Hurricane Katrina and warned about the effects of severe weather.\nLater this year, Obama will return to the issue of global warming when he meets with Pope Francis in September and again at a climate conference in Paris in December.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/140923233321-01-climate-change-impact-restricted-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184215-06-climate-change-impact-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923233321-01-climate-change-impact-restricted-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174848-obama-kenya-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923190000-10-climate-change-impact-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183903-04-climate-change-impact-restricted-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130922-obama-kenya-gallery-2-small-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174831-obama-kenya-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184326-07-climate-change-impact-restricted-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131417-obama-kenya-gallery-11-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174831-obama-kenya-medium-plus-169.jpg", "http://www.pnas.org/content/110/41/16361.full.pdf+html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130922-obama-kenya-gallery-2-large-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131229-obama-kenya-gallery-10-super-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131417-obama-kenya-gallery-11-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130940-obama-kenya-gallery-3-small-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174848-obama-kenya-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721173016-obama-kenya-medium-plus-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174702-obama-kenya-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130922-obama-kenya-gallery-2-medium-plus-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923190000-10-climate-change-impact-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923185234-11-climate-change-impact-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131206-obama-kenya-gallery-9-small-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174723-obama-kenya-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174848-obama-kenya-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184026-05-climate-change-impact-restricted-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184637-09-climate-change-impact-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131206-obama-kenya-gallery-9-medium-plus-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184505-08-climate-change-impact-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174848-obama-kenya-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130940-obama-kenya-gallery-3-super-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131206-obama-kenya-gallery-9-large-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183542-02-climate-change-impact-restricted-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184326-07-climate-change-impact-restricted-topics.jpg", "http://www.colorado.edu/news/releases/2012/03/14/discovery-pine-beetles-breeding-twice-year-helps-explain-increasing-damage#sthash.PCdFWhdi.dpuf", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184505-08-climate-change-impact-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131436-obama-kenya-gallery-12-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721173016-obama-kenya-small-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131136-obama-kenya-gallery-7-small-11.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184505-08-climate-change-impact-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721173016-obama-kenya-small-11.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150830093720-ip-the-presidents-iran-embarrassment-00001809-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131136-obama-kenya-gallery-7-exlarge-169.jpeg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://www.aafa.org/pdfs/FINAL_public_LIST_Spring_2014.pdf&quot;", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923233321-01-climate-change-impact-restricted-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174831-obama-kenya-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131004-obama-kenya-gallery-4-super-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721173016-obama-kenya-super-169.jpeg", "http://ipcc.ch/report/ar5/wg2/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131436-obama-kenya-gallery-12-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131136-obama-kenya-gallery-7-medium-plus-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131004-obama-kenya-gallery-4-exlarge-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183542-02-climate-change-impact-restricted-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183321-01-climate-change-impact-restricted-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184215-06-climate-change-impact-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174831-obama-kenya-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131206-obama-kenya-gallery-9-small-11.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184505-08-climate-change-impact-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131229-obama-kenya-gallery-10-exlarge-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183903-04-climate-change-impact-restricted-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174831-obama-kenya-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131229-obama-kenya-gallery-10-small-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174848-obama-kenya-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130940-obama-kenya-gallery-3-full-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131417-obama-kenya-gallery-11-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184637-09-climate-change-impact-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174702-obama-kenya-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174723-obama-kenya-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721173016-obama-kenya-large-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131004-obama-kenya-gallery-4-small-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174723-obama-kenya-small-169.jpg", "http://blog.nature.org/science/2014/03/31/ipcc-coral-reefs-science-climate-change/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131229-obama-kenya-gallery-10-small-11.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174702-obama-kenya-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183903-04-climate-change-impact-restricted-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131206-obama-kenya-gallery-9-super-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174848-obama-kenya-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184215-06-climate-change-impact-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131206-obama-kenya-gallery-9-exlarge-169.jpeg", "http://journals.ametsoc.org/doi/abs/10.1175/JCLI-D-12-00282.1&quot;", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923185234-11-climate-change-impact-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131417-obama-kenya-gallery-11-exlarge-169.jpg", "http://journals.ametsoc.org/doi/abs/10.1175/JCLI-D-12-00282.1", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131229-obama-kenya-gallery-10-large-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150830093720-ip-the-presidents-iran-embarrassment-00001809-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131417-obama-kenya-gallery-11-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183745-03-climate-change-impact-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130922-obama-kenya-gallery-2-exlarge-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131004-obama-kenya-gallery-4-full-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183903-04-climate-change-impact-restricted-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131436-obama-kenya-gallery-12-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174723-obama-kenya-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183745-03-climate-change-impact-topics.jpg", "http://ipcc.ch/report/ar5/wg2/&quot;", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131436-obama-kenya-gallery-12-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150830093720-ip-the-presidents-iran-embarrassment-00001809-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150830093720-ip-the-presidents-iran-embarrassment-00001809-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183903-04-climate-change-impact-restricted-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131417-obama-kenya-gallery-11-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184215-06-climate-change-impact-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150830093720-ip-the-presidents-iran-embarrassment-00001809-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150830093720-ip-the-presidents-iran-embarrassment-00001809-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184026-05-climate-change-impact-restricted-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174831-obama-kenya-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130940-obama-kenya-gallery-3-medium-plus-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130940-obama-kenya-gallery-3-exlarge-169.jpeg", "http://blog.nature.org/science/2014/03/31/ipcc-coral-reefs-science-climate-change/&quot;", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923190000-10-climate-change-impact-horizontal-large-gallery.jpg", "http://csis.org/event/new-ice-curtain-russias-strategic-reach-arctic", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130940-obama-kenya-gallery-3-small-11.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923190000-10-climate-change-impact-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184505-08-climate-change-impact-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174702-obama-kenya-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174702-obama-kenya-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131206-obama-kenya-gallery-9-full-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923233321-01-climate-change-impact-restricted-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130922-obama-kenya-gallery-2-super-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131136-obama-kenya-gallery-7-super-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130922-obama-kenya-gallery-2-small-11.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131229-obama-kenya-gallery-10-full-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131136-obama-kenya-gallery-7-full-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174702-obama-kenya-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923190000-10-climate-change-impact-topics.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174831-obama-kenya-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150830093720-ip-the-presidents-iran-embarrassment-00001809-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183542-02-climate-change-impact-restricted-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183542-02-climate-change-impact-restricted-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174848-obama-kenya-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131004-obama-kenya-gallery-4-large-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174723-obama-kenya-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130940-obama-kenya-gallery-3-large-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923233321-01-climate-change-impact-restricted-super-169.jpg", "http://www.pnas.org/content/110/41/16361.full.pdf+html&quot;", "http://www.aafa.org/pdfs/FINAL_public_LIST_Spring_2014.pdf", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131436-obama-kenya-gallery-12-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131417-obama-kenya-gallery-11-small-11.jpg", "http://www.colorado.edu/news/releases/2012/03/14/discovery-pine-beetles-breeding-twice-year-helps-explain-increasing-damage#sthash.PCdFWhdi.dpuf&quot;", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923184215-06-climate-change-impact-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721173016-obama-kenya-full-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131436-obama-kenya-gallery-12-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174723-obama-kenya-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131004-obama-kenya-gallery-4-medium-plus-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131436-obama-kenya-gallery-12-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174702-obama-kenya-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131136-obama-kenya-gallery-7-large-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131004-obama-kenya-gallery-4-small-11.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721130922-obama-kenya-gallery-2-full-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131229-obama-kenya-gallery-10-medium-plus-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721174723-obama-kenya-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721131136-obama-kenya-gallery-7-small-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923183542-02-climate-change-impact-restricted-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150721173016-obama-kenya-exlarge-169.jpeg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140923233321-01-climate-change-impact-restricted-small-169.jpg"], "published": "2015-08-31T22:59:00.000+03:00", "crawled": "2015-08-31T18:44:39.284+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}