{"organizations": [], "uuid": "74e76510192265b2961df39910c915d2a17d3db6", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Trump%20Latino%20Vote.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/08/06/trumps-divisive-style-forces-gop-rivals-to-show-their-immigration-cards-sooner/", "country": "IL", "title": "Trump’s divisive style forces GOP rivals to show their immigration cards sooner", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Trump’s divisive style forces GOP rivals to show their immigration cards sooner", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T20:38:00.000+03:00", "replies_count": 0, "uuid": "74e76510192265b2961df39910c915d2a17d3db6"}, "author": "Andrew O'Reilly", "url": "http://latino.foxnews.com/latino/politics/2015/08/06/trumps-divisive-style-forces-gop-rivals-to-show-their-immigration-cards-sooner/", "ord_in_thread": 0, "title": "Trump’s divisive style forces GOP rivals to show their immigration cards sooner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fox News Latino Donald Trump visits his Scottish golf course Turnberry on July 30, 2015 in Ayr, Scotland. Getty Images \nDonald Trump, once expected to be merely entertaining and full of choice sound bites, has turned out to be a pivotal factor in the GOP primary that is driving the party’s strategy for reaching out to Latino voters. \nHis infamous comments about Mexican immigrants being rapists and drug dealers came as the GOP was gearing for another presidential election cycle where it saw repairing its image among Latino voters as a priority. \nThe Republican National Committee has doubled down its efforts to reach this fast-growing voting bloc. GOP presidential candidates running against the real estate mogul for the party nomination – as well as Latino conservative leaders – also have, for the most part, made an extra effort to court Latino voters and distinguish themselves from Trump. \nAnd that may be a silver lining, some experts say, to the controversial comments Trump made when he launched his presidential campaign. Candidates are finding themselves having to spell out their own policies – much earlier than usual in the election cycle – when it comes to matters important to Hispanic voters. \n\"This situation with Trump presents an opportunity,\" Alfonso Aguilar, the Director of American Principles Project's Latino Partnership told Fox News Latino. \"It's a very good opportunity for candidates to distance themselves from him and say that his views don't represent that of the Republican Party.\" \nAguilar pointed to candidates like former Florida Gov. Jeb Bush, Sen. Marco Rubio of Florida and former Texas Gov. Rick Perry as examples of politicians successfully dealing with the incendiary comments made by Trump. \nBush, who long has enjoyed strong ties with the Hispanic community thanks to his Mexican-American wife Columba, fluency in Spanish and years living in Latin America, has spoken out against the mogul and made efforts to appeal to Latino voters. \nBush recently gave an interview in Spanish on Telemundo, where the candidate addressed topics such as immigration, discrimination and, of course, Trump. \n\"If you remain silent on Trump or commend him then things are not going to go well for you,\" said Aguilar, who served in the George W. Bush administration. \"Jeb Bush, on the other hand, is a top-tier candidate who says what Trump says is stupid and moves on.\" \nWith or without the backlash generated against Trump and the Republicans following his comments on immigration, GOP officials have stated that they are striving to reel in Latino voters – especially after the dismal performance it put up with the demographic during the 2012 election. \nThe Republican National Committee has already put staff in a number of states where Latino voters are key, including Colorado, Florida and Virginia, and said that it is focused on its so-called hyperlocal, grassroots campaigning to draw in voters. \nDespite the work by the GOP and the perceived silver lining of the Trump campaign, some observers still view \"the Donald\" as being problematic for a party that long has struggled to attract Latino voters. \n\"There is no question that Donald Trump will have a negative impact on the elections for the Republican Party,\" Hector Sanchez, the president of the National Hispanic Leadership Agenda told FNL. \"The Republican Party needs to stop this, but unfortunately some of these people believe these comments made by Trump.\" \nOf Republican voters, 20 percent favor Trump, according to a poll released Thursday by Quinnipiac University, the largest share any single candidate has received in Quinnipiac's seven surveys over the past two years and vastly more than the 16 other candidates vying for the Republican nod. Jeb Bush, generally seen as the most Latino-friendly candidate in the Republican field, came in third in the poll with 10 percent. Trump, however, still trails Hillary Clinton among Latino voters by a massive 61 percent to 28 percent split. \nAdding to this is the fact that for seemingly every Jeb Bush who takes Trump to task there appears to be more candidates who seem willing to just remain silent – or even agree – with what Trump is saying about immigrants. \nFirebrand Texas Sen. Ted Cruz has not only praised Trump, but even made a trip to New York to meet with the man himself – a move that some observers believe is likely to play out poorly for the Cuban-American lawmaker. \n\"Ted Cruz is hoping to get Trump's supporters if Trump drops out of the race,\" Aguilar said. \"But by doing that Cruz is done with the Latino vote.\" \nExperts of both sides of the political divide do say that polls this early in the presidential campaign season are highly speculative and generally poor indicators of who will end up in the White House. \nBut observers say that Trump's rhetoric could bolster the more radical, so-called nativist sentiments of the Republican Party that people such as former Texas Gov. Rick Perry – who called Trump's campaign a \"cancer on conservatism\" – warned about. \nThis is a concern, experts say, not only for Republicans looking to court Latino voters, but even for the opposing Democratic Party and Latinos overall. \n\"In one sense it's advantageous for us because Trump is stirring up trouble for his own party,\" Pablo Manriquez, a DNC spokesperson told FNL. \"But on the other hand, this type of rhetoric is bad for Latinos because it creates more discrimination and animosity toward them for the radical, nativist groups.\" \nTrump may be shocking many political observers with his staying power – and what will come out of his mouth next – but it is very early in the campaign season, a time when most fair-weather fans of politics are still not paying much attention to the news. \nExperts say this means that either Trump's comments will be pushed aside as the season progresses or will draw voters to the race earlier than some expected. \nEither way, many of these experts also cautioned not to underestimate the Latino voter's ability to separate what \"The Donald\" says from what his challengers in both parties are saying. A new poll from Univision, for example, noted that 61 percent of Latinos thought that Trump's comments on Mexican immigrants represented only his views and not the views of the entire Republican Party. \n\"I think Latino voters are sophisticated enough,” said Arturo Vargas, the executive director of the National Association of Latino Elected and Appointed Officials (NALEO), “to see that what Trump is saying is not the mainstream ideas of the Republican Party.\" \nFollow Andrew O'Reilly on Twitter @aoreilly84. \nFollow us on twitter.com/foxnewslatino", "external_links": [], "published": "2015-08-06T20:38:00.000+03:00", "crawled": "2015-08-06T19:40:12.733+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}