{"organizations": [], "uuid": "22cbb76f3569ffb0d821d01b8daa51bae78fff8d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/0820%20fla%20parenthood", "site_section": "http://www.foxnews.com/us/", "section_title": "U.S. Latest &amp; Breaking News Headlines | U.S. | Fox News", "url": "http://www.foxnews.com/us/2015/08/20/3-florida-planned-parenthood-clinics-to-resume-abortions-despite-investigations/", "country": "US", "title": "3 Florida Planned Parenthood clinics to resume abortions despite investigations", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "3 Florida Planned Parenthood clinics to resume abortions despite investigations | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "22cbb76f3569ffb0d821d01b8daa51bae78fff8d"}, "author": "Associated Press", "url": "http://www.foxnews.com/us/2015/08/20/3-florida-planned-parenthood-clinics-to-resume-abortions-despite-investigations/", "ord_in_thread": 0, "title": "3 Florida Planned Parenthood clinics to resume abortions despite investigations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 20, 2015 Associated Press Sept. 14, 2009: Women are concealed from view by Planned Parenthood volunteers as they enter the Planned Parenthood of Collier County in Naples, Fla. (AP)\nFORT LAUDERDALE, Fla. – Planned Parenthood said Wednesday that three of its Florida clinics will resume performing first-trimester abortions, although state health officials warn they are still investigating the organization.\nThe organization had asked a judge Monday to allow it to continue performing abortions, alleging the state had suddenly changed its definition of first-trimester abortions.\nState health officials' recent inspection of 16 Planned Parenthood facilities found three were performing second-trimester abortions, even though they are only licensed to perform first-trimester abortions. Planned Parenthood disputed that finding.\nPlanned Parenthood said in a statement Wednesday that the Agency for Health Care Administration confirmed those three health centers may continue to perform abortions within 14 weeks of a woman's last menstrual period.\nBut state officials say they have not reached an agreement with Planned Parenthood and are still investigating. While both parties agree on the 14-week definition, there may still be disagreement about when a pregnancy actually begins. State officials said in a letter sent to Planned Parenthood on Wednesday that the three clinics incorrectly reported when abortions were done, though the organization says it has reported the information the same way for the past nine years.\nThe Florida clinics were ordered to be inspected by Gov. Rick Scott, and similar investigations have taken place in other states since stealthily recorded videos showed Planned Parenthood officials discussing how they provide aborted fetal organs for research. The organization has said it does not profit from tissue donations and that those programs exist in only a handful of states.\nAbortion opponents say the videos show the organization is illegally harvesting and selling organs. The videos brought congressional scrutiny, including calls to withdraw federal funding from the organization.\nAuthorities in Massachusetts, Georgia, Indiana and South Dakota found no evidence of wrongdoing, and Idaho's Republican Gov. C.L. \"Butch\" Otter rejected calls last week by GOP lawmakers to investigate Planned Parenthood facilities in his state.\n\"Planned Parenthood will not back down from the politicians and anti-abortion extremists who are using every underhanded tactic they can to politicize these critical medical issues,\" said Dawn Laguens, executive vice president of Planned Parenthood Federation of America.", "external_links": ["http://www.ap.org/"], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-20T06:55:51.092+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}