{"organizations": ["Fox News Latino", "U.S. Immigration and Customs Enforcement"], "uuid": "0edb3bfc1d061a563f2e1e83ef2c86529d229c58", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/ice%20local%20police.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/08/05/new-effort-by-immigration-officials-to-work-with-local-police-comes-under-fire/", "country": "", "title": "New effort by immigration officials to work with local police comes under fire | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "New effort by immigration officials to work with local police comes under fire | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T19:16:00.000+03:00", "replies_count": 0, "uuid": "0edb3bfc1d061a563f2e1e83ef2c86529d229c58"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/08/05/new-effort-by-immigration-officials-to-work-with-local-police-comes-under-fire/", "ord_in_thread": 0, "title": "New effort by immigration officials to work with local police comes under fire | Fox News Latino", "locations": ["United States", "Phoenix-Mesa Gateway Airport", "MESA", "New York", "Mexico", "Arizona", "Guatemala", "Mesa", "AZ", "Guatemala City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John"], "text": "New effort by immigration officials to work with local police comes under fire Published August 05, 2015 Fox News Latino MESA, AZ - JUNE 24: Undocumented Guatemalan immigrants are body searched before boarding a deportation flight to Guatemala City, Guatemala at Phoenix-Mesa Gateway Airport on June 24, 2011 in Mesa, Arizona. The U.S. Immigration and Customs Enforcement agency, ICE, repatriates thousands of undocumented Guatemalans monthly, many of whom are caught in the controversial \"Secure Communities\" data-sharing program which puts local police on the frontlines of national immigration enforcement. ICE recently announced a set of adjustments to the federal program after many local communities and some states, including New York, insisted on opting out, saying immigrants were being deported for minor offenses such as traffic violations. Guatemala ranks only second to Mexico in the number of illegal immigrants deported from the United States. (Photo by John Moore/Getty Images) 2011 Getty Images \nA new Homeland Security Department program that is replacing the controversial Secure Communities has come under fire recently by both sides of the immigration debate. \nThe program, known as the Priority Enforcement Program, or PEP, began without much fanfare on July 2 and calls for Department of Homeland Security to work with local police to identify undocumented immigrants who have been arrested and in custody. \nUnlike Secure Communities, PEP does not require that local police detain immigrants past their eligible release so that immigration authorities can pick them and put them in their custody while they move to deport them. \n“Secure Communities needed to be fixed because it was inhibiting our ability to get at the criminals,’’ said DHS head Jeh Johnson recently when he spoke before the House Judiciary Committee. He said that PEP “resolves the legal and political controversy.’’ \nBut some city officials and law enforcement are refusing to work with DHS through the PEP program – but for different reasons. Immigration advocates say it will foster distrust between immigrant communities and law enforcement, and those who favor strict immigration enforcement call it ineffective and a threat to community safety. \nOpponents of Secure Communities said the program led many immigrants to fear turning to the police, whom they saw as quasi-immigration agents, and they argued that federal agents went after people who posed no danger to their neighbors. \n“A large part of the skepticism comes from just a poor track record with Secure Communities,’’ said one DHS official, who spoke on the condition of anonymity to the Washington Post. “There’s a trust deficit here that has to be overcome.’’ \nThose hawkish on immigration criticized the program because it allows for the release of undocumented immigrants. They claim that releasing immigrants gives them an opportunity to commit more crimes. \n“PEP is not about setting priorities for which illegal aliens should be deported,” said Dan Stein, president of the Federation for American Immigration Reform (FAIR). “It is about ensuring that the vast majority of illegal aliens will be excluded from removal.\" \nHe also said he has issues with having the administration designate who is a priority for deportation and who is not. \n“The administration is using the pretense of focusing on hardened criminals to advance its real priority – granting de facto amnesty to the vast majority of illegal aliens,\" Stein said. “While immigration enforcement should prioritize the removal of those who pose the greatest danger to public safety and national security, such policies should not grant blanket exemptions to other illegal aliens.\" \nDHS maintains that more than 30 law enforcement agencies around the country have said they are open to working with PEP, but the Washington Post noted that few have said so publicly. \nLos Angeles officials told the Post that its police department is not going to participate with PEP. Philadelphia officials are mulling it over. \n“We are walking a fine line,’’ the Post quoted John H. Eaves, chairman of the Board of Commissioners in Fulton County, Ga., as saying. \nThe county is discussing PEP with U.S. Immigration and Customs Enforcement (ICE), which enforces the program. \n“We want to make sure our community is safe,’’ Eaves said. “At the same time, we are a diverse community with a strong immigrant population, and we want to make sure that everyone is afforded civil and human rights, and that no one is unduly held beyond a certain period of time.” \nThe debate has become more tense and emotional after the July 1 killing of Kathryn Steinle along the San Francisco waterfront. \nHer alleged killer is an undocumented immigrant who was deported several times, and returned illegally to the United States. The alleged murderer reportedly said he settled in San Francisco because he knew local police would not turn him over for deportation because of the city’s sanctuary policy. \nHe was freed in March on an old marijuana charge even though ICE had filed a detainer request with San Francisco law enforcement. The city's sheriff's department was criticized for releasing him and not notifying federal immigration authorities. \nThe debate over PEP, experts said to the Post, reflects the divide between DHS and police over how to handle undocumented immigrants who are arrested and held in jail. \nDHS officials say they are hopeful that local officials will cooperate with PEP, noting that they need the program to deport dangerous criminals and make sure they do not fall through the cracks. \nThey concede they have a lot of work to do, however, before they can persuade the many officials who are skeptical about local-federal working relationships. \nAngie Junck, supervising attorney at the San Francisco-based Immigrant Legal Resource Center, was quoted by the Post as saying that PEP is “the reincarnation of the failed and dangerous Secure Communities program.’’ \n“We see this as DHS kind of rebranding to rebuild the trust they lost with a lot of local law enforcement agencies,’’ she said. “We are very concerned that it will repeat the mistakes of the past.’’ \nLike us on Facebook ", "external_links": [], "published": "2015-08-05T19:16:00.000+03:00", "crawled": "2015-08-05T19:16:17.963+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}