{"organizations": ["Obama Risks Empowering Iran", "Hezbollah"], "uuid": "9b1b40382b5429291bb1447d813e070a18eee631", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d252901d00006e0014501d.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/lebanon-hezbollah-iran_55d1f479e4b07addcb43674a", "country": "", "title": "To Fight ISIS, Obama Risks Empowering Iran's Favorite Terror Group", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "To Fight ISIS, Obama Risks Empowering Iran's Favorite Terror Group", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T16:30:00.000+03:00", "replies_count": 0, "uuid": "9b1b40382b5429291bb1447d813e070a18eee631"}, "author": "", "url": "http://www.huffingtonpost.com/entry/lebanon-hezbollah-iran_55d1f479e4b07addcb43674a", "ord_in_thread": 0, "title": "To Fight ISIS, Obama Risks Empowering Iran's Favorite Terror Group", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jessica Schulberg"], "text": "To Fight ISIS, Obama Risks Empowering Iran's Favorite Terror Group The Lebanese army has closer ties to Hezbollah than the U.S. wants to admit. Akbar Shahid Ahmed Foreign Affairs Reporter, The Huffington Post Jessica Schulberg Foreign Affairs Reporter, The Huffington Post Posted: 08/19/2015 07:31 AM EDT \nWASHINGTON -- More than $1 billion in U.S. military equipment quietly began flowing to the Lebanese military over the last year. \nSaudi Arabia is paying for much of it : powerful missiles, advanced aircraft. But Washington is also making its contribution. Lebanon, a country one-third the size of Maryland that is nestled between Syria and Israel, has today become the fifth-largest recipient of U.S. military aid. \nThe flood of money indicates how worried the U.S., Saudi Arabia and other power players have become about the extremist threat that Islamic State militants and the al-Qaeda affiliate in Syria pose to Lebanon. \nThe Obama administration is betting the Lebanese military can keep the Islamic State, also known as ISIS, and al-Qaeda from wreaking further havoc . Both groups have developed cells in Lebanon that they are likely to activate in response to battleground shifts in Syria, Lebanese officials say. \nBut it's a dangerous bet. As the Obama administration doles out weapons and money to fend off one extremist threat in Lebanon, it's risking that U.S. equipment might end up supporting another group that's no friend to America: the Shiite paramilitary organization Hezbollah -- a key ally of Iran, backer of Syrian President Bashar Assad, and unrelenting foe of U.S. ally Israel . How Syria's Civil War Is Forcing Difficult Choices In Lebanon Positive, but inconsistent and shadowy Negative relations rebels \n\nThe Lebanese army's connection to Hezbollah has complicated U.S. policy in Lebanon for decades. Congress, wary of Hezbollah, has halted aid to the Lebanese military several times over the issue. \nBut the relationship between the two organizations is hard to break. Although Hezbollah is known abroad primarily for its paramilitary activities, it's also one of the main Shiite political parties in Lebanon and currently holds 12 of the 128 seats in the country's parliament. And although the army contains a diverse range of Lebanese (the country is home to members of both main Muslim sects and many Christians), the military and the Shiite militia agree on the need to defend the country against foreign interference. \nDifferent interpretations of that mission have in the past led the army to support Hezbollah actions that the U.S. dislikes -- namely, fighting Israel. \nToday, the Shiite militia is pursuing its largest military campaign to date, with thousands of fighters in Syria helping Assad's regime battle opposition forces supported by the U.S., Saudi Arabia and other regional actors. Hezbollah's move into Syria is a marked break with its raison d'etre: to protect Lebanon's southern border from Israel. But it is an essential move because the Shiite militia's supply lines from Iran rely on a Hezbollah-friendly Syria. \nHezbollah's support for Assad over the past two years has made it -- and, by extension, Lebanon -- a target. Last year, the Islamic State and al-Qaeda attacked the Lebanese border town of Arsal, forcing out thousands of residents , many of them already refugees, and taking government soldiers hostage. The Islamic State released a video showing its fighters beheading one of the Lebanese soldiers. Al-Qaeda, operating in Syria under the name Jabhat al-Nusra, still holds 16 others . \nNeither the Lebanese army nor Hezbollah wants to see the civil war in Syria creep into Lebanon. So -- as they have for years -- they're cooperating. \nIn June 2013, for example, Lebanese fighters loyal to radical Sunni leader Ahmed al-Assir attacked a military checkpoint in Abra, about 25 miles south of Beirut. Assir had accused the military of backing Hezbollah and urged his followers to travel to Syria to fight Hezbollah and Assad there. As the Lebanese army struggled to fend off Assir's supporters, members of Hezbollah fought directly alongside the Lebanese soldiers, journalists at the scene recalled. \nIt was \"one of the more transparent incidents of … cooperation\" between Hezbollah and the Lebanese army, said Faysal Itani, a fellow at the Atlantic Council who studies Lebanon. \nAlthough the Lebanese army tried to downplay the extent of the cooperation, Hezbollah claimed it saved the military from a massacre. \"They would have lost more than 100 soldiers if we were not there to show them how to do this,\" one Hezbollah fighter told McClatchy at the time. Credit: Mahmoud Zayyat/AFP/Getty Images The Lebanese army deployed in the southern town of Abra on June 18, 2013, after they heard shooting by gunmen loyal to anti-Hezbollah Sunni leader Ahmed al-Assir. \nDespite that sort of blatant cooperation with a group that America considers a terrorist organization, U.S. policymakers seem to have decided that the threat of extremist expansion into Lebanon makes increased support to the military essential. \nSo they've adopted a policy of public denial, insisting that the ties between the Lebanese army and Hezbollah are minimal. \"We understand the relationship between Hezbollah and Lebanon's legitimate security forces as one of coexistence, not of collaboration,\" a State Department official told HuffPost. \nThe official insisted that U.S. aid to the Lebanese military is not a direct boon to Hezbollah and Assad in Syria. \"We use vetting procedures, end-use monitoring of defense articles, and other controls to mitigate the risk that Hezbollah may receive direct or indirect benefits from U.S. assistance,\" the official added. \nBut the irony is that by shoring up the Lebanese army, Washington could make Hezbollah more confident about continuing to back Assad -- and therefore keep Lebanon in the anti-Assad extremists' crosshairs, undermining the U.S.'s own policy goal. \nSunni Arab extremists \"are not seeking to cause violence [in Lebanon] -- they are mainly concerned about Hezbollah,\" said Joseph Bahout, a fellow at the Carnegie Endowment for International Peace in Washington. \"This has more to do with the ongoing battles in Syria. It's more a Syrian issue than a Lebanese issue.\" \n\"Were it not for Hezbollah's involvement in Syria,\" Itani said, \"I don't believe Lebanon would be a priority for these groups at all -- at least not for now.\" \nAs long as Hezbollah continues to back Assad and remains a target for the Islamic State and al-Qaeda, however, the Lebanese army will be hard-pressed to defend its borders without Hezbollah, Itani added. \nJennifer Cafarella, a fellow at the Institute for the Study of War, told HuffPost that both al-Qaeda's Jabhat al-Nusra and the Islamic State are altering their strategies in Lebanon in reaction to how their battles with Hezbollah are going in Syria. The Islamic State may hit parts of northeastern Lebanon in the weeks ahead, Cafarella suggested, so that it can draw Hezbollah's attention there and away from the Syrian city of Homs, leaving that city more vulnerable to attack. \nThis kind of thinking leaves the Lebanese in a bind. They aren't able to change the situation within Syria, as Hezbollah makes its decisions in opaque consultation with the Assad regime and the Iranian government, but they must pay the price when it changes. \n\"There's a consensus among all Lebanese\" about the Syrian civil war, said Fouad Hamdan, a Lebanese civil society activist now living in the Netherlands. \"We do not want to fight it out in Lebanon.\" \nAt best, the Obama administration's approach to Lebanon may accomplish the greater goal of making the Lebanese army stronger and independent of Hezbollah. \n\"The best way to prepare the LAF for what will be an inevitable showdown [with Hezbollah] is to instill a confidence, independence, and esprit de corps at the institutional and individual levels in the LAF,\" Itani said, referring to the Lebanese Armed Forces. \"That said, this is admittedly a risky strategy that could backfire, but the alternative of leaving the LAF to its own devices is even more likely to empower Hezbollah.\" \nBut at worst, the Obama administration is effectively fueling the problem it is trying to tackle -- while handing American weaponry to Hezbollah, the most powerful of Iran's proxies. That adds even more confusion to the U.S.'s already bizarre relationship with Iran in the fight against the Islamic State and al-Qaeda, with the two powers backing opposite sides in Syria even as they tacitly coordinate in Iraq and, increasingly, in Lebanon. \nIn either case, there's no sign yet of the stable, pro-West Lebanon that U.S. policymakers envision. ", "external_links": [], "published": "2015-08-19T16:30:00.000+03:00", "crawled": "2015-08-19T16:30:34.070+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}