{"organizations": [], "uuid": "124aca36c5eb3c2ed62cf80657692f60e1a2f08f", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150407150616-coal-op-ed-620xa.jpg", "site_section": "", "section_title": "", "url": "http://money.cnn.com/2015/08/03/investing/coal-obama-climate-change/index.html", "country": "", "title": "Coal companies have been scorched under Obama - Aug. 3, 2015", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Coal companies have been scorched under Obama - Aug. 3, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "124aca36c5eb3c2ed62cf80657692f60e1a2f08f"}, "author": "", "url": "http://money.cnn.com/2015/08/03/investing/coal-obama-climate-change/index.html", "ord_in_thread": 0, "title": "Coal companies have been scorched under Obama - Aug. 3, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Egan", "Obama"], "text": "By Matt Egan @mattmegan5 It's a terrible time to be in the coal business. \nCompanies have struggled for five years in an environment of strict regulation and low prices, along with a host of poorly-timed mergers. Alpha Natural Resources ( ANRZ ) filed for bankruptcy on Monday, becoming the latest coal company to succumb to the difficult environment. \nLife is about to get even tougher as President Obama -- never a friend of the coal industry -- rolls out new rules aimed at America's coal-burning power plants' greenhouse gas emissions. \nSince Obama took office in January 2009, shares of many coal companies have plummeted more than 90%. Several companies have gone bust. \n\"Only the very toughest will survive,\" said Sheila Hollis, a partner who heads up energy, environment and resources at the law firm Duane Morris. \nShares of several coal companies crumbled further on Monday as Obama announced the new climate change initiative. Peabody Energy ( BTU ) , Cloud Peak Energy ( CLD ) and Westmoreland Resource Partners ( WMLP ) tumbled more than 8% each. \n\"The EPA is setting the first ever nationwide standards to end the limitless dumping of carbon pollution from power plants,\" Obama said on Monday from the White House. \nRelated: Prepare for gold to plunge..as low as $350 \nCheap natural gas is killing coal: Coal's downfall has been in the making for a long time. Its collapse accelerated after Obama took office, but the White House may not have been the main driver. \nBack in 2009, everyone believed the world was running out of metallurgical coal, or \"met coal,\" the type that goes into making steel. Prices spiked above $340 a ton as demand from fast-growing China was off the charts. \nNow, met coal prices have crumbled below $100 a ton as China's economy is no longer enjoying explosive growth, and doesn't need as much steel or coal. \nDemand for \"thermal\" coal, used to fire power plants, has also fallen off a cliff. That's because the price of natural gas, a rival source of energy, has plummeted. Demand for nat gas has soared. In fact, U.S. electricity generation from natural gas eclipsed coal for the first time ever in April, according to Energy Information Administration stats going back to 1973. \n\"The economics have actually forced the change Obama is trying to implement,\" said David Gagliano, an analyst who covers the industry at BMO Capital Markets. \nRelated: Solar is growing fast but coal will continue to dominate \nDebt-fueled marriages go bust: But that's not all. Coal companies, including Alpha Natural Resources, went on a buying binge when prices were sky high. Those acquisitions look awful today and companies are struggling to pay off the debt used for the purchases. \n\"The companies issued debt to buy other companies at absolutely the peak of the market. Prices collapsed and then these companies literally imploded,\" said Gagliano. \nThis is how much things have changed. Back in 2008, Cleveland-Cliffs offered to buy Alpha at $128 a share, or roughly $10 billion. The deal eventually collapsed. \nToday Alpha's shares trade at less than 4 cents, and are essentially worthless. Even though it has filed for bankruptcy, Alpha plans to continue operating its 60 coal mines, which are located in Kentucky, Pennsylvania, Virginia, West Virginia and Wyoming. \nAlpha's collapse was sped by its 2011 acquisition of Massey Energy, the company that owned the West Virginia mine that blew up in 2010, killing 29 miners. \nIt's hardly the only coal company to go bankrupt. Walter Energy, Patriot Coal and James River Coal have already done so. \nThere is one company that's fared a little better than the rest. Consul Energy's ( CNX ) shares have \"only\" declined 60% in the past five years and it's still worth north of $3.5 billion. But the reason it's still alive? The company diversified into natural gas. \n\"Ironically it's done well because it transformed from being a pure coal company to being a coal and natural gas company,\" said Gagliano. ", "external_links": [], "published": "2015-08-03T03:00:00.000+03:00", "crawled": "2015-08-03T23:57:18.291+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}