{"organizations": ["Facebook", "Fox News Obama", "Twitter"], "uuid": "06786e3370c1884afb003f6ed500c3f096c8ecba", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/022714_kelly_chaffetz_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/08/07/watchdog-group-claims-obama-administration-ignoring-order-to-reveal-documents/", "country": "", "title": "Obama administration accused of stonewalling in suit over downing of SEAL Team 6 chopper | Fox News", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama administration accused of stonewalling in suit over downing of SEAL Team 6 chopper | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T20:32:00.000+03:00", "replies_count": 0, "uuid": "06786e3370c1884afb003f6ed500c3f096c8ecba"}, "author": "", "url": "http://www.foxnews.com/politics/2015/08/07/watchdog-group-claims-obama-administration-ignoring-order-to-reveal-documents/", "ord_in_thread": 0, "title": "Obama administration accused of stonewalling in suit over downing of SEAL Team 6 chopper | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama administration accused of stonewalling in suit over downing of SEAL Team 6 chopper Published August 07, 2015 Facebook 0 Twitter 0 livefyre Email Print \nThe Obama administration was accused Thursday of ignoring a judge’s order to turn over documents in the downing of a helicopter that killed Navy SEALs from the unit that carried out the raid on Usama bin Laden. \nFamilies of Navy SEAL Team 6 members and others killed in the attack marked the fourth anniversary of the Aug. 6, 2011, tragedy by blasting the government for stonewalling in a public records lawsuit filed by the watchdog group Freedom Watch, the Washington Times reported . All 38 people aboard the chopper, call sign Execution 17, were killed over the Wardak Province in Afghanistan, including 30 Americans. \n“It has now been four years since Extortion 17 was shot down,” Doug Hamburger, whose son Patrick was killed, told the paper. “I find it quite disturbing that the government is not willing to give us the answers we deserve. I find it very irritating that we will not question the Afghans about their knowledge of what took place that night.” \nThe families believe SEAL TEAM 6 had been turned into a Taliban target after President Obama revealed that members of the team, though not the ones killed in the crash, were involved in the killing of bin Laden in Pakistan three months earlier. \nThey also believe that persons inside the Afghan National Security Forces may have tipped off the Taliban to the Chinook’s mission. \nA Defense Department official told a House subcommittee last year there is no proof the mission was compromised by the Afghans. \nA federal judge in February signed an order requiring the Obama administration to release documents on a continual basis through the spring and summer. \nFreedom Watch’s Larry Klaymen told the Times that despite the order he’s gotten only 1 of 50 Pentagon documents the Justice Department has identified as relevant. He said the Justice Department set a new deadline for the release and then ignored it. \n“They don’t even produce under their own self-imposed deadline,” he said. “We’re pleading with the judge to do something, and he’s just sitting on it.” \n", "external_links": [], "published": "2015-08-07T20:32:00.000+03:00", "crawled": "2015-08-07T20:33:14.459+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}