{"organizations": [], "uuid": "893e82fbb96cc0f13a218f8b3c78edbc18312732", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150815142257-donald-trump-helicopter-2-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/08/16/politics/donald-trump-immigration-plans/index.html", "country": "US", "title": "Donald Trump outlines immigration specifics", "performance_score": 3, "site": "cnn.com", "participants_count": 1, "title_full": "Donald Trump outlines immigration specifics - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "893e82fbb96cc0f13a218f8b3c78edbc18312732"}, "author": "Jeremy Diamond", "url": "http://www.cnn.com/2015/08/16/politics/donald-trump-immigration-plans/index.html", "ord_in_thread": 0, "title": "Donald Trump outlines immigration specifics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Donald Trump outlines his immigration plans His policy paper also explains how he would get Mexico to pay for a border wall (CNN) Republican frontrunner Donald Trump said Sunday he would overturn a law that grants citizenship to people born in the U.S. and put stricter limits on legal immigration, offering his most detailed account yet of how he would handle a policy issue that has become a cornerstone of his campaign.\nTrump, who has repeatedly been pressed for specifics on his immigration plan since the issue rocketed him to the top of the polls, also explained for the first time how he will force Mexico to pay for a wall on its border with the U.S. in his nearly 1,900-word policy paper .\nThe proposal could help Trump swat away naysayers who charge that he is not a serious candidate. It also gives Trump an opportunity to burnish his conservative credentials, particularly as he is coming under more heavy fire from conservative influencers.\nTrump took a shot at his Republican opponent Sen. Marco Rubio of Florida, slamming what he calls the \"Schumer-Rubio\" comprehensive immigration bill, which passed the Senate in 2013 and later died in the House, as \"nothing more than a giveaway to the corporate patrons who run both parties.\"\nRELATED: Trump on Immigration: 'They have to go'\nTrump's immigration plan is based on three core principles: that the U.S. must build a wall across the U.S.-Mexico border, that immigration laws must be fully enforced and that \"any immigration plan must improve jobs, wages and security for all Americans.\"\nHis policy mixes some long-held Republican proposals on immigration with ideas that are more likely to appeal to the far right.\nTrump calls for requiring a nationwide system to verify workers' legal status, tripling the number of immigrations and customs enforcement agents and implementing a tracking system to identify people who overstay their visas.\nBut Trump's plans take a hardline approach in his vow to reverse a U.S. law that grants American citizenship to any child born in the United States, regardless of whether the child's parents are undocumented immigrants.\nHe also calls for suspending the issuance of any new green cards, writing, \"there will be a pause where employers will have to hire from the domestic pool of unemployed immigrant and native workers.\"\nTrump's policy proposal does not explain how long the pause will last.\nEven Trump's approach to the Dreamers -- those who were brought to the U.S. illegally as children -- goes a step further than others in the GOP field who believe children of undocumented immigrants should be allowed to stay in the U.S.\n\"The executive order gets rescinded,\" Trump said Sunday on NBC's \"Meet the Press,\" of President Barack Obama's executive order allowing dreamers to remain in the U.S.\n\"We have to keep the families together, but they have to go,\" he told NBC.\n16 photos: Donald Trump's empire Real estate developer and entrepreneur Donald Trump has been in the spotlight for years. From producing and starring in TV shows to campaigning for the U.S. presidency, see how he's shaped his empire. Hide Caption 1 of 16 16 photos: Donald Trump's empire Trump stands with Alfred Eisenpreis, New York's economic development administrator, in 1976 while they look at a sketch of a new 1,400-room renovation project of the Commodore Hotel. After graduating from the University of Pennsylvania in 1968, Trump worked with his father on developments in Queens and Brooklyn before purchasing or building multiple properties in New York and Atlantic City, New Jersey. Those properties included Trump Tower in New York and Trump Plaza and multiple casinos in Atlantic City. Hide Caption 2 of 16 16 photos: Donald Trump's empire Trump was married to Ivana Zelnicek Trump from 1977-1990, when they divorced. They had three children together. Hide Caption 3 of 16 16 photos: Donald Trump's empire Trump dips his second wife, Marla Maples, after the couple married in a private ceremony in New York in December 1993. The couple divorced in 1999. Hide Caption 4 of 16 16 photos: Donald Trump's empire An advertisement for the television show \"The Apprentice\" hangs at Trump Towers in New York in 2004. The show launched in January of that year. In January 2008, the show returned as \"Celebrity Apprentice.\" Hide Caption 5 of 16 16 photos: Donald Trump's empire A 12-inch talking Trump doll is on display at a toy store in New York in September 2004. Hide Caption 6 of 16 16 photos: Donald Trump's empire Trump wrestles with \"Stone Cold\" Steve Austin at WrestleMania in 2007. Trump has close ties with the WWE and its CEO, Vince McMahon. Hide Caption 7 of 16 16 photos: Donald Trump's empire Trump attends the U.S. Open tennis tournament with his third wife, Melania Knauss-Trump, and their son, Barron William Trump, in 2006. Trump and Knauss married in 2005. Trump has five children from three marriages. Hide Caption 8 of 16 16 photos: Donald Trump's empire For \"The Apprentice,\" Trump was honored with a star on the Hollywood Walk of Fame in January 2007. Hide Caption 9 of 16 16 photos: Donald Trump's empire Trump holds a copy of his book \"Think Big and Kick Ass in Business and Life\" at a book signing in New York in 2007. He has published 16 books, according to his website. Hide Caption 10 of 16 16 photos: Donald Trump's empire In 2009, Trump announced his resignation as chairman of Trump Entertainment Resorts. Days later, Trump Entertainment Resorts filed for bankruptcy. Hide Caption 11 of 16 16 photos: Donald Trump's empire A supporter comes out for Trump at a tea party event in Boca Raton, Florida, in April 2011. Trump said he had considered running for President in 2012. Hide Caption 12 of 16 16 photos: Donald Trump's empire In 2012, Trump announces his endorsement of Republican presidential candidate Mitt Romney. In May 2012, on CNN's \"The Situation Room,\" Trump said that President Barack Obama's birthplace is a matter of opinion. In regards to the President's Hawaiian birth certificate , Trump said \"a lot of people do not think it was an authentic certificate.\" Hide Caption 13 of 16 16 photos: Donald Trump's empire Trump speaks in Sarasota, Florida, after accepting the Statesman of the Year Award at the Sarasota GOP dinner in August 2012. It was just before the Republican National Convention in nearby Tampa. Hide Caption 14 of 16 16 photos: Donald Trump's empire Trump appears on stage with Nick Jonas and Giuliana Rancic during the 2013 Miss USA pageant. Trump has been executive producer of the Miss Universe, Miss USA and Miss Teen USA pageants since 1996. Hide Caption 15 of 16 16 photos: Donald Trump's empire On June 16, Trump announces that he is running for President during a speech from Trump Tower in New York. He said he will give up the show \"The Apprentice\" to run. His recent comments on undocumented immigrants from Mexico has led to Univision deciding not to air the Miss Universe pageant, which is co-owned by Trump and NBCUniversal. Within days, NBCUniversal and Macy's also cut ties . Hide Caption 16 of 16 While Trump has called for deporting all of the undocumented immigrants in the United States and allowing \"the good ones,\" to re-enter illegally, his policy outline makes no mention of that plan. Instead, it calls for deporting all \"criminal aliens.\" It does not address the deportation of otherwise law-abiding undocumented immigrants.\nTrump also explained how he would force the Mexican government to bankroll a wall along the southern border.\nIf Mexico refuses to pay for the wall, a Trump administration would begin charging additional fees to Mexicans who come into the U.S. on visas or with border crossing cars -- particularly for visas to \"Mexican CEOs and diplomats,\" which Trump would cancel \"if necessary.\" Trump's plan also calls for possible tariffs and foreign aid cuts and would seize \"all remittance payments derived from illegal wages.\"\n\"The Mexican government has taken the United States to the cleaners. They are responsible for this problem, and they must help pay to clean it up,\" Trump wrote. \"We will not be taken advantage of anymore.\"\nImmigration advocates quickly slammed Trump's proposal Sunday.\n\"The extremism is stunning, and the direction is dangerous,\" said Frank Sharry, the executive director of pro-immigration group America's Voice. \"Trump's 'plan' would create a police state capable of rounding up and deporting all 11 million hardworking immigrant families settled in America.\"\nSharry also criticized Trump's move to change the birthright citizenship rules and put further limits on legal immigration.\n\"Fortunately, these marginalized ideas are as unpopular as they are unworkable, and thus will never happen,\" he said.\nTrump's immigration plan would surely draw stiff opposition from Democrats in Congress, but it's also likely to raise alarm with the big business, a major proponent of high-skilled visas.\nJUST WATCHED Trump takes kids up in helicopter Replay More Videos ... MUST WATCH\nTrump takes kids up in helicopter 01:04 The price tag for his plan could draw the ire of Republicans, too.\nA 2013 bipartisan immigration bill that cleared the Senate called for doubling the number of border patrol agents and completing some 700 miles of fence along the border. The nonpartisan Congressional Budget Office pegged the cost of the bill around $23 billion, mainly because of the security measures included.\nUltimately, the CBO said the Senate bill would have reduced the federal deficit by legalizing millions of immigrants living in the country illegally and, in turn, boosting tax revenues. The CBO also said that legislation would spur economic growth.\nTrump's plan, however, does not include those revenue-generating provisions.\nTo prevent additional undocumented immigrants for entering and staying in the United States, Trump pledged to \"defund sanctuary cities\" -- stripping cities of federal dollars if they do not fully cooperate with federal immigration officials -- establish a nationwide employment \"e-verify\" system, and end the \"catch-and-release\" policy of detaining illegal immigrants without deporting them.\nJUST WATCHED Trump criticizes Jeb at Iowa State Fair Replay More Videos ... MUST WATCH\nTrump criticizes Jeb at Iowa State Fair 00:53 While most of Trump's brash rhetoric has focused on ending illegal immigration peppered with charges that immigrants coming from Mexico are \"killers\" and \"rapists,\" Trump has also advocating for streamlining the legal U.S. immigration system.\nThere was little mention of that in his latest policy proposal. Instead, it relied heavily on plans designed to protect American jobs from foreign workers and called for tighter rules on visas for high-skilled workers. In crafting his plan, Trump sought advice from Republican Sen. Jeff Sessions of Alabama, a longtime supporter of curbing both legal and illegal immigration.\n\"The influx of foreign workers holds down salaries, keeps unemployment high, and makes it difficult for poor and working class Americans -- including immigrants themselves and their children -- to earn a middle class wage,\" Trump wrote in his proposal.\nTrump's first policy paper comes somewhat begrudgingly. In a press conference Saturday, he downplayed voters' interest in such policy specifics, calling them a preoccupation of the press.\n\"I think the press is more eager to see it than the voters, to be honest,\" Trump told reporters in Iowa Sunday. \"I don't think the people care. I think they trust me. I think they know I'm going to make good deals for them.\"\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/121024053029-14-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701115834-donald-trump-close-up-2015-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053034-12-trump-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054107-30-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701114048-donald-trump-escalator-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701115834-donald-trump-close-up-2015-full-169.jpg", "http://www.trump.com/Publications/Trump_Books.asp", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050203-05-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054103-32-trump-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142027-donald-trump-1976-restricted-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142027-donald-trump-1976-restricted-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701114048-donald-trump-escalator-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053022-17-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053029-14-trump-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050205-07-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815170520-donald-trump-helicopter-ride-kids-iowa-00000316-large-169.jpg", "http://www.trump.com/Publications/Trump_Books.asp&quot;", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053034-12-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701115834-donald-trump-close-up-2015-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142007-donald-trump-wife-ivana-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053034-12-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050205-07-trump-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050203-05-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815140829-donald-trump-speaks-at-iowa-rally-sot-nr-00000509-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815140829-donald-trump-speaks-at-iowa-rally-sot-nr-00000509-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701115834-donald-trump-close-up-2015-large-169.jpg", "https://www.donaldjtrump.com/positions/immigration-reform", "http://i2.cdn.turner.com/cnnnext/dam/assets/130825131232-01-donald-trump-0825-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054112-27-trump-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701115834-donald-trump-close-up-2015-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053029-14-trump-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701114048-donald-trump-escalator-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054112-27-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701114048-donald-trump-escalator-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142027-donald-trump-1976-restricted-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054103-32-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050205-07-trump-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050244-02-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701114048-donald-trump-escalator-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050244-02-trump-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142027-donald-trump-1976-restricted-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142007-donald-trump-wife-ivana-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815140829-donald-trump-speaks-at-iowa-rally-sot-nr-00000509-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815140829-donald-trump-speaks-at-iowa-rally-sot-nr-00000509-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142027-donald-trump-1976-restricted-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142007-donald-trump-wife-ivana-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142007-donald-trump-wife-ivana-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815170520-donald-trump-helicopter-ride-kids-iowa-00000316-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701114048-donald-trump-escalator-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050205-07-trump-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053034-12-trump-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815170520-donald-trump-helicopter-ride-kids-iowa-00000316-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815170520-donald-trump-helicopter-ride-kids-iowa-00000316-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053037-10-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050244-02-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050205-07-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142027-donald-trump-1976-restricted-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142007-donald-trump-wife-ivana-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053029-14-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054103-32-trump-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701114048-donald-trump-escalator-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815170520-donald-trump-helicopter-ride-kids-iowa-00000316-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054103-32-trump-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054107-30-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054103-32-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815140829-donald-trump-speaks-at-iowa-rally-sot-nr-00000509-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130825131232-01-donald-trump-0825-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142007-donald-trump-wife-ivana-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053549-20-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130825131232-01-donald-trump-0825-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815140829-donald-trump-speaks-at-iowa-rally-sot-nr-00000509-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815140829-donald-trump-speaks-at-iowa-rally-sot-nr-00000509-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050244-02-trump-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815170520-donald-trump-helicopter-ride-kids-iowa-00000316-small-169.jpg", "https://twitter.com/CNNpolitics", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701115834-donald-trump-close-up-2015-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053022-17-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024050244-02-trump-story-body.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054112-27-trump-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701115834-donald-trump-close-up-2015-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053549-20-trump-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142027-donald-trump-1976-restricted-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150701142007-donald-trump-wife-ivana-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054112-27-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053037-10-trump-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130825131232-01-donald-trump-0825-topics.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053034-12-trump-hp-video.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024053029-14-trump-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/121024054112-27-trump-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150815170520-donald-trump-helicopter-ride-kids-iowa-00000316-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/130825131232-01-donald-trump-0825-story-top.jpg"], "published": "2015-08-16T03:00:00.000+03:00", "crawled": "2015-08-16T20:28:26.583+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}