{"organizations": ["Fox News", "Facebook", "Twitter"], "uuid": "732d26e938080d6fefbc323ac372df722708b7ce", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/080415_an_rove_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/08/06/16-states-ask-obama-admin-to-put-power-plant-rules-on-hold/", "country": "", "title": "16 states ask Obama admin to put power plant rules on hold | Fox News", "performance_score": 5, "site": "foxnews.com", "participants_count": 0, "title_full": "16 states ask Obama admin to put power plant rules on hold | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T11:18:00.000+03:00", "replies_count": 0, "uuid": "732d26e938080d6fefbc323ac372df722708b7ce"}, "author": "", "url": "http://www.foxnews.com/politics/2015/08/06/16-states-ask-obama-admin-to-put-power-plant-rules-on-hold/", "ord_in_thread": 0, "title": "16 states ask Obama admin to put power plant rules on hold | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "16 states ask Obama admin to put power plant rules on hold Published August 06, 2015 Facebook 0 Twitter 0 Email Print \nWASHINGTON – The campaign to stop President Barack Obama's sweeping emissions limits on power plants began taking shape Wednesday, as 16 states asked the government to put the rules on hold while a Senate panel moved to block them. \nWest Virginia Attorney General Patrick Morrisey, who is leading the charge against the rules, banded together with 15 other state attorneys general in a letter to Environmental Protection Agency Gina McCarthy requesting that the agency temporarily suspend the rules while they challenge their legality in court. The letter called for the EPA to respond by Friday. \nThe EPA and the White House both said they believe the limits are legal and have no plans to put them on hold. But by submitting the formal request anyway, the attorneys general are laying the groundwork to ask the courts to suspend the emissions limits instead. \n\"These regulations, if allowed to proceed, will do serious harm to West Virginia and the U.S. economy,\" Morrisey said. \"That is why we are taking quick action to bring this process to a halt.\" \nThe 16 states and a handful of others are preparing to sue the Obama administration to block the rules permanently by arguing they exceed Obama's authority. Bolstered by a recent Supreme Court ruling against the administration's mercury limits, opponents argued that states shouldn't have to start preparing to comply with a rule that may eventually get thrown out by the courts. \nThe speedy opposition from the states came two days after Obama unveiled the final version of the rules, which mark the first time the U.S. has ever limited carbon dioxide emissions from existing power plants. Obama's revised plan mandates a 32 percent cut in emissions nationwide by 2030, compared to 2005 levels — a steeper cut than in his earlier proposal. \nMost of the attorneys general signing the letter Wednesday are Republicans. Yet they were joined by Jack Conway of the coal-producing state of Kentucky. Conway and Kentucky Gov. Steve Beshear are both Democrats, but have joined the state's Republican leaders in denouncing Obama's power plant limits, which form the centerpiece of his plan to fight climate change. \nAlthough the most serious threat to Obama's power plant rules is in the courts, lawmakers in Congress are also pursuing legislative means to stop them. The first vote came Wednesday in the Senate Environment and Public Works Committee, where a bill blocking the rules passed the GOP-controlled panel by a voice vote — but not without a bit of drama. \nOver the protests of boycotting Democrats, the Senate GOP-controlled panel approved legislation designed to block the Obama administration from implementing the tough new standards. \nDemocrats walked out of the committee meeting in protest of a separate bill about pesticides, arguing it should have been the subject of a fact-finding hearing. Lacking the necessary quorum for a vote, Republican Chairman Jim Inhofe of Oklahoma reconvened the meeting in a lunchroom just off the Senate floor, where the aroma of a just-completed GOP lunch was still wafting in the air. \nThe voice vote approving the bill sends it to the full Senate, where a filibuster battle awaits. Obama has vowed to veto any such legislation, and Republicans have yet to prove they can muster the votes to override his veto. Advertisement ", "external_links": [], "published": "2015-08-06T11:18:00.000+03:00", "crawled": "2015-08-06T11:18:56.700+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}