{"organizations": [], "uuid": "3054461936362cfeaeb305c040bc3c09ba349aae", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/06/opinions/ruckman-presidential-pardons/index.html", "country": "", "title": "Why isn't Obama more merciful on prisoners? (Opinion) - CNN.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Why isn't Obama more merciful on prisoners? (Opinion) - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "3054461936362cfeaeb305c040bc3c09ba349aae"}, "author": "", "url": "http://www.cnn.com/2015/08/06/opinions/ruckman-presidential-pardons/index.html", "ord_in_thread": 0, "title": "Why isn't Obama more merciful on prisoners? (Opinion) - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Why isn't Obama more merciful on prisoners? By P. S. Ruckman, Jr. Updated 1647 GMT (2347 HKT) August 6, 2015 JUST WATCHED Obama's push for prison reform 01:54 Story highlights President Obama announced that his administration will provide federal Pell Grants to nonviolent prisoners P. S. Ruckman: With his eye set on his legacy, Obama can do more on criminal justice by granting more pardons P. S. Ruckman Jr. is professor of political science at Rock Valley College and editor of the Pardon Power blog . He is the author of the forthcoming book, \"Pardon Me, Mr. President: Adventures in Crime, Politics and Mercy.\" He is also co-authoring a history of pardons with George Lardner Jr., a Pulitzer-Prize winner and former reporter with the Washington Post. The opinions expressed in this commentary are solely those of the author. (CNN) As the end of his second term approaches slowly, President Obama has his eye out on his legacy. One issue that has been on his mind is prison reform. Recently, Obama announced that his administration will provide federal Pell Grants to nonviolent prisoners. For several decades up until 1994, prison inmates were eligible for Pell Grants to further their education. It's a way to gain employment once they are released and, consequently, a critical factor in reducing the likelihood of recidivism. But the politically opportunistic \"tough on crime\" mentality eventually won the day, concluding, in essence, that the best way to address rehabilitation and the problem of recidivism was to simply keep prisoners in prison. Pell Grant eligibility was removed. Now, the Obama administration has proposed a pilot program that would restore that eligibility for certain prisoners, especially those who are also eligible for release in the near future (i.e., people who, arguably, need such support the most). P. S. Ruckman, Jr. Proponents of prison reform applaud the move, which comes on the heels of President Obama's historic visit to a federal prison. There is bound to be a world of difference between understanding prison from books or television, and actually walking into such a place. What a great thing it would be if every president, from now on, visited a federal prison, perhaps a few times a year. One suspects that federal prison for the typical member of Congress means nothing more than a few lines in a lengthy budget. But prisons should mean more to the President, not just because he cares deeply about justice, but because he holds the power to pardon those within prison walls as well as those who suffer the collateral consequences of convictions. President Obama could do even more on the criminal justice front: He can grant more pardons and commutations of sentence. To date, his clemency record has been abysmal. Only eight other presidents have granted clemency less, and most of them served a single term or less. The White House press secretary said President Obama has been \"bold\" with respect to commutations of sentence because he had granted more than the previous four presidents combined. The truth is that Obama has granted exactly 1 more commutation than the previous four presidents combined, even though he has received over 1,000 more applications for commutations of sentence than the previous four combined. Amazingly, Obama's record on pardons is even worse. President Obama should recognize that the problems with the current clemency process are systemic and need to be addressed in a systemic way. He should grant an amnesty (preferably conditional) to all nonviolent (and especially first-time) drug offenders in our federal prisons, with good prison records, who would not even be in prison were they sentenced under current law. These people should not spend another month in prison. About one in every two pardons and commutations of sentences granted over the last four decades have been granted in the month of December alone. That nonsense needs to stop. From here to the end of his presidency, the President should grant a steady stream of individual pardons and commutations of sentence, every month, just like most presidents have done, throughout most of our nation's history. Justice should be a full-time concern, not a last-minute splurge. The Founding Fathers put the pardon power in the Constitution so presidents would be active participants in our system of checks and balances. As a presidential candidate, President Obama was upfront about his drug use as a youth. He used marijuana and experimented with cocaine. He could have lied or tried to cover it up. He could have manufactured some shameless spin (\"I didn't inhale\") to embarrass his supporters and dumbfound his critics. But, he didn't. He admitted his \"mistakes.\" Those mistakes were made by many young people who ended up in prisons. Ironically, drug offenses such as possession of marijuana that led offenders to jail are now legal in some states. Moreover, prison incarceration has disproportionately affected African-American men. The NAACP reports that five times as many whites are using drugs as African-Americans, yet African-Americans are sent to prison for drug offenses at 10 times the rate of whites. So, when at the prison, President Obama served up a dose of John Bradford (\"There but for the grace of God go I\"), it packed a lot more punch than usual. It could not be fairly dismissed as a hollow display of self-righteous piety. The President bluntly said, about the prisoners there, \"When they describe their youth and their childhood, these are young people who made mistakes that aren't that different from the mistakes I made ...\" What a profound moment in the history of the presidency. What an uncomfortable -- but at the same time -- entirely refreshing break from the routine we have come to expect from politicians who would more likely bluster tin horn denials or contrived off-target answers. President Obama should calmly ignore the obligatory barking of outdated, posturing critics and embrace Alexander Hamilton's desire that there be \"easy access\" to mercy in this country, all the while, humbly remembering, \"But for the grace of God ...\" There are many battles on the criminal justice front. Let's see how far President Obama can go in his pursuit of justice for all. ", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T20:57:41.945+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}