{"organizations": ["Fox News Latino", "Fox News Latino Obama"], "uuid": "5a8c3f78885713dc57c7fdca9ed445ad3073a732", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Human%20Trafficking%20Report.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/08/04/cuba-removed-from-us-human-trafficking-blacklist-overruling-experts-report-says/", "country": "", "title": "Obama officials overruled experts to remove Cuba, others from human trafficking list | Fox News Latino", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama officials overruled experts to remove Cuba, others from human trafficking list | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T20:10:00.000+03:00", "replies_count": 0, "uuid": "5a8c3f78885713dc57c7fdca9ed445ad3073a732"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/08/04/cuba-removed-from-us-human-trafficking-blacklist-overruling-experts-report-says/", "ord_in_thread": 0, "title": "Obama officials overruled experts to remove Cuba, others from human trafficking list | Fox News Latino", "locations": ["Cuba"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama officials overruled experts to remove Cuba, others from human trafficking list Published August 04, 2015 Fox News Latino (AP Photo/Lenny Ignelzi) \nThe 2015 U.S. report on human trafficking has come under fire amid allegations that senior State Department officials ignored experts’ recommendations and took Cuba and Malaysia off its blacklist of countries failing to combat modern-day slavery. \nAccording to an investigation by the news agency Reuters , U.S. government analysts that independently grade global efforts to fight human trafficking were repeatedly overruled by senior State Department officials and also forced into inflating assessments of 14 strategically important countries in this year’s Trafficking in Persons report. \nBesides Cuba and Malaysia being removed from the U.S. blacklist as a result of the intervention of senior State Department staff, China, India, Uzbekistan and Mexico all were awarded higher grades than the U.S.’s human rights experts had wanted. \nThe revelations from the Reuters’ report comes amid grumblings that Washington let politics – particularly the renewed relations with Havana – sway the rankings of the oft-contentious list. \nCuba has for several years been stuck on the lowest ranking, \"tier 3,\" amid allegations of coerced labor — specifically with Cuban government work missions abroad. Its upgrade comes a week after the U.S. and Cuba formally restored diplomatic relations after a half-century of estrangement. \nThe U.S. also removed Cuba from its list of state sponsors of terrorism in late May. \nChina was also slated to be ranked in “tier 3,” but that was overruled despite the conclusion of analysts that leaders in Beijing did not undertake increased anti-trafficking efforts. Knocking the Asian powerhouse and major trading partner with the United States down to “tier 3” would have put China alongside the likes of Iran, Libya, Russia, Syria, Zimbabwe and North Korea – countries regarded by the United Nations as among the worst human right abusers in the world. \nOther nations upgraded from tier 3 were the Democratic Republic of Congo, Papua New Guinea and Saudi Arabia. Those downgraded to tier 3 were Belarus, Belize, Burundi, Comoros, the Marshall Islands and South Sudan. \nThe Trafficking in Persons Report is one of several annual assessments issued by the department on human rights-related topics, but it's unusual in that it ranks nations, which can ruffle diplomatic feathers. It is based on the actions governments take, rather than on the scale of the problem in their countries. Globally, more than 20 million people are believed to be affected in industries such as mining, construction, the sex trade, and domestic service. \nPresident Barack Obama now has 90 days to determine whether to apply sanctions against tier 3 governments. The president can block various types of aid and could withdraw U.S. support for loans from the World Bank and International Monetary Fund. But the U.S. often chooses not to, based on its national security interests, as it did last year for both Thailand and Malaysia, which Washington views as important partners in its strategic outreach to Asia. \nThe Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-08-04T20:10:00.000+03:00", "crawled": "2015-08-04T20:10:16.589+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}