{"organizations": [], "uuid": "76398288ef4fa3a2de60150358dfcc3a794d7416", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Donald%20Trump%20main%20hate%20crimes.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/21/latino-groups-warn-trump-immigration-rhetoric-could-inspire-more-hate-crimes/", "country": "", "title": "Latino groups warn Trump's immigration rhetoric could inspire more hate crimes | Fox News Latino", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Latino groups warn Trump's immigration rhetoric could inspire more hate crimes | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "76398288ef4fa3a2de60150358dfcc3a794d7416"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/21/latino-groups-warn-trump-immigration-rhetoric-could-inspire-more-hate-crimes/", "ord_in_thread": 0, "title": "Latino groups warn Trump's immigration rhetoric could inspire more hate crimes | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Trump"], "text": "Fox News Latino \nNational Latino groups say Donald Trump's \"bigoted\" and \"hateful anti-immigrant rhetoric\" is inspiring a backlash against Hispanics, as evidenced by the recent beating of a homeless Mexican man in Boston allegedly by two men who say they were \"inspired in part\" by the real estate mogul. \n“Donald Trump’s hateful anti-immigrant rhetoric has resulted in the senseless beating of a homeless man solely because he is Latino,” said Roger C. Rocha, Jr., president of the League of United Latin American Citizens. “It is obvious that Trump’s vision of making America great does not include Latinos.” \n- The League of United Latin American Citizens National President Roger C. Rocha, Jr. \nA 58-year-old Mexican national was beaten with a metal pole and urinated on Wednesday by two brothers in Boston who told troopers afterwards they were inspired at least in part by Trump. A police report about the incident quoted one of the brothers as saying: “Donald Trump was right, all these illegals need to be deported.\" \nAlex Nogales, president and CEO of the National Hispanic Media Coalition, told Fox News Latino he believes Trump is solely responsible for creating the kind of atmosphere that will lead to future hate crimes against the Hispanic community. \nBoth organizations, as well as a slew of other Latino groups and leaders, have condemned Trump since he described Mexican immigrants as rapists and criminals during his June announcement that he was running for president. \n“We know that hate speech has consequences. What did he expect?” Nogales said. “I blame him directly for the environment that is being created where fellow Republicans are dumping on the Latino community. This guy is using the immigration issue to get the racists in his party aligned against us and these are the kinds of consequences we can continue to expect.” \nOn Friday afternoon Trump tweeted, “Boston incident is terrible. We need energy and passion, but we must treat each other with respect. I would never condone violence.” \nThe tweet was the strongest condemnation of the attack by Trump yet, and came after he received backlash for not condemning the attack on Wednesday night. He said he hadn’t heard about it, called it a shame, and said his followers are \"very passionate.\" \nStill, Nogales was unmoved by Trump's tweet. \n“I am not at all sympathetic,\" Nogales said. \nBoth Nogales and Rocha reference a 2013 FBI Hate Crime Statistics report which found that 52.6 percent of 821 Latino victims were targeted because of anti-Hispanic or anti-Latino bias. \nOn Thursday, the Mexican government also condemned the attack on the sleeping homeless man, saying it \"rejects any act of violence\" motivated by racism, national origin or immigration status. Mexican officials said they would be following the case \"very closely.\" \nMeanwhile, Latino leaders and organizations continue to call for businesses to distance themselves from Trump. \n“This recent act demonstrates Trump’s complete disregard for the safety and well-being of the Latino community and underlines that he is not fit to serve in any elected office, let alone as President of the United States,” Rocha said. “It is obvious that Trump’s vision of making America great does not include Latinos.” \nBryan Llenas currently serves as a New York-based correspondent for Fox News Channel (FNC) and a reporter for Fox News Latino (FNL). Click here for more information on Bryan Llenas . Follow him on Twitter @BryanLlenas . \nLike us on Facebook ", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-22T07:29:51.935+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}