{"organizations": ["Fox News", "Arizona National Guardsman", "Texas National Guard"], "uuid": "473f6a3a269be92c1b162d1f57bd09ddba11877e", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/GettyImages-455311756.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/05/despite-immigration-becoming-heated-issue-border-security-is-less-urgent-this/", "country": "", "title": "Despite immigration becoming heated issue, border security is less urgent this year | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Despite immigration becoming heated issue, border security is less urgent this year | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T16:29:00.000+03:00", "replies_count": 0, "uuid": "473f6a3a269be92c1b162d1f57bd09ddba11877e"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/05/despite-immigration-becoming-heated-issue-border-security-is-less-urgent-this/", "ord_in_thread": 0, "title": "Despite immigration becoming heated issue, border security is less urgent this year | Fox News Latino", "locations": ["United States", "Rio Grande", "Latino HAVANA", "Mexico", "U.S.", "Arizona", "TX", "Nogales", "AZ", "Texas", "Havana", "NOGALES"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John", "Obama", "Rick Perry"], "text": "Despite immigration becoming heated issue, border security is less urgent this year Published August 05, 2015 Fox News Latino HAVANA, TX - SEPTEMBER 11: A Texas National Guard soldier scans the Mexican side of the U.S.-Mexico border on September 11, 2014 in Havana, Texas. The troops, deployed along the Rio Grande, are part of a 1,000 strong force called up by Texas Governor Rick Perry to guard the border. The soldiers were sent to help state and federal law enforcement stem a surge of illegal immigrants, many of them families and unaccompanied minors. (Photo by John Moore/Getty Images) 2014 Getty Images NOGALES, AZ - DECEMBER 07: An Arizona National Guardsman watches over the U.S. border with Mexico at an observation post on December 7, 2010 in Nogales, Arizona. The Obama administration ordered more than 500 soldiers placed along the Arizona border to man \"entry identification sites\" and spot illegal immigrants crossing into the United States. The troops, who have no detention authority, radio U.S. Border Patrol agents when they spot immigrants crossing. The troop deployment was meant to further bolster border security and help stem illegal immigration into Arizona, which has become a flashpoint for the issue nationwide. (Photo by John Moore/Getty Images) 2010 Getty Images Next Slide Previous Slide \nSAN ANTONIO (AP) – In the weeks leading up to Thursday's first debate of the 2016 presidential race, Republican candidates have sought to distinguish themselves from each other — and President Barack Obama — with ever-tougher positions on border security and illegal immigration, claiming current measures are failing. \nAnd yet by many standards, the situation is not nearly as urgent as it was during last summer's crisis and has improved steadily and markedly in some respects over the past decade or so — partly because of actions taken by the U.S. government, but also because of factors beyond Washington's control. \nLast year's alarming surge of unaccompanied children and families arriving from Central America via Mexico has been cut by about half, according to U.S. Customs and Border Protection, a drop-off attributed in part to a crackdown by Mexico and better enforcement along the U.S. border. \nAlso, illegal immigration from Mexico has plunged dramatically since 2000, when Border Patrol agents arrested roughly 1.6 million Mexicans. Last year, agents stopped about 230,000. \nIn addition, since 2007, about 1 million Mexicans living illegally in this country have left, according to Marc Rosenblum, deputy director of the U.S. immigration policy program at the Migration Policy Institute in Washington. \nThose trends have been attributed to a variety of factors, including the overall sluggish economy in the U.S., the decline in this country's construction industry, and better opportunities in Mexico, according to a report by Rogelio Saenz, dean of the College of Public Policy at the University of Texas at San Antonio. \n\"The urgency is gone on the U.S.-Mexico border,\" said Adam Isacson, border security analyst for the Washington Office on Latin America, a think tank. \nDuring the spring and summer of 2014, the U.S.-Mexico border, particularly the 320-mile Rio Grande Valley section in Texas, became a major crossing point for tens of thousands of families and unaccompanied minors from Central America, many of them fleeing gang violence in Guatemala, El Salvador and Honduras. \nLast year marked the first time arrivals from those Central American countries — some 468,000 altogether — outstripped migrants from Mexico. \nThe surge was treated as a national security issue. The Obama administration beefed up the Border Patrol in the Rio Grande Valley, while Texas deployed National Guardsmen and a large contingent of troopers. The state has approved $800 million of spending on border security in the next two years alone. \nMexican officials, with support from the U.S., have stepped up apprehensions of migrants passing through that country. \nThe Obama administration also opened two secure family detention centers in Texas that together can house more than 2,000 women and children. Detention was envisioned in part as a way to discourage families from coming. It was an alternative to the usual practice of releasing families with notices to appear in court. \nThe detention policy has met with legal and political challenges from immigrant advocates. Homeland Security officials have said they are moving families through the facilities as quickly as possible, and more women are being fitted with electronic ankle bracelets as a condition of release. \nRosenblum said the spike in unaccompanied children and families was not really a failure of border security. Instead of trying to evade U.S. authorities, the families \"are being intentionally apprehended,\" Rosenblum said. Many have applied for asylum and face years-long backlogs in the legal system. \nSince Obama took office, he has transformed immigration enforcement through a series of directives and policy changes that narrowly define which immigrants living in the country illegally should face deportation. \nThe focus is now on people who pose a national security or public safety threat or have serious criminal histories, those with multiple serious misdemeanors, and those who have crossed the border or been ordered out of the country since the beginning of 2014. \nObama also launched a program shortly before his 2012 re-election that allows young immigrants brought to the country as children to apply for permission to stay and work legally for up to two years at a time. More than 740,000 young immigrants have been approved for the program. \nWhile the administration deported a record 409,849 immigrants in 2012, the number has been steadily declining since. \nLast year, Immigration and Customs Enforcement sent home 315,943 immigrants. And as of July 20, the agency had sent back about 187,000 this year, according to internal ICE documents obtained by The Associated Press. The documents show that more than 109,000 of those were convicted criminals. \nLike us on Facebook Follow us on Twitter & Instagram \n", "external_links": [], "published": "2015-08-05T16:29:00.000+03:00", "crawled": "2015-08-05T16:29:40.504+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}