{"organizations": [], "uuid": "a55c8f5b8010f0bf25a81f59d1ef0f6c5ceac8c9", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2012/12/26/us/barack-obama---fast-facts/index.html", "country": "", "title": "Barack Obama Fast Facts - CNN.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Barack Obama Fast Facts - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "a55c8f5b8010f0bf25a81f59d1ef0f6c5ceac8c9"}, "author": "", "url": "http://www.cnn.com/2012/12/26/us/barack-obama---fast-facts/index.html", "ord_in_thread": 0, "title": "Barack Obama Fast Facts - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Barack Obama Fast Facts Updated 1728 GMT (0028 HKT) August 20, 2015 50 photos: Obama in 50 states President Barack Obama, visiting Watertown, South Dakota, on Friday, May 8, shows off a note given to him by 11-year-old Rebecca Kelley. Rebecca had written him a letter asking him to visit South Dakota, which is the 50th state Obama has visited during his time in office. White House photographer Pete Souza highlights a picture from each state. Hide Caption 50 photos: Obama in 50 states Marching at the 50th anniversary of Bloody Sunday in Selma, Alabama, on March 7, 2015. Hide Caption 2 of 50 50 photos: Obama in 50 states Air Force One refueling at Elmendorf Air Force Base near Anchorage, Alaska, on November 12, 2009. Hide Caption 50 photos: Obama in 50 states Viewing the Grand Canyon in Arizona on August 16, 2009. Hide Caption 50 photos: Obama in 50 states Touring tornado damage in Vilonia, Arkansas, on May 7, 2014. Hide Caption 50 photos: Obama in 50 states Viewing the Golden Gate Bridge in San Francisco, California, on July 23, 2014. Hide Caption 50 photos: Obama in 50 states Playing pool with Gov. John Hickenlooper in Denver, Colorado, on July 8, 2014. Hide Caption 7 of 50 50 photos: Obama in 50 states Making last-minute edits to his speech in Newtown, Connecticut, before a vigil for those killed at Sandy Hook Elementary School on December 16, 2012. Hide Caption 8 of 50 50 photos: Obama in 50 states Honoring fallen soldiers from Afghanistan at Dover Air Force Base in Delaware on October 29, 2009. Hide Caption 9 of 50 50 photos: Obama in 50 states Keeping his distance from a baby alligator on Earth Day at Everglades National Park in Florida on April 22, 2015. Hide Caption 10 of 50 50 photos: Obama in 50 states Graduates cheering the President during a heavy downpour at Morehouse College in Atlanta, Georgia, on May 19, 2013. Hide Caption 50 photos: Obama in 50 states Swimming at Pyramid Rock Beach in Kaneohe Bay, Oahu, Hawaii, on January 1, 2012. Hide Caption 50 photos: Obama in 50 states Posing for a photo with kids at Boise Airport in Idaho on January 21, 2015. Hide Caption 50 photos: Obama in 50 states Viewing Chicago, Illinois, at sunset from Marine One on January 11, 2012. Hide Caption 14 of 50 50 photos: Obama in 50 states Dropping by the Gingerbread House Bakery in Kokomo, Indiana, with Vice President Joe Biden on November 23, 2010. Hide Caption 15 of 50 50 photos: Obama in 50 states Speaking at a grassroots campaign event at Living History Farms in Urbandale, Iowa, on September 1, 2012. Hide Caption 50 photos: Obama in 50 states Waving to people after his economic speech in Osawatomie, Kansas, on December 6, 2011. Hide Caption 17 of 50 50 photos: Obama in 50 states Greeting troops with Vice President Joe Biden at Fort Campbell in Kentucky on May 6, 2011. Hide Caption 18 of 50 50 photos: Obama in 50 states Flying over the Gulf of Mexico from Grand Isle to New Orleans, Louisiana, after the BP oil spill on June 4, 2010. Hide Caption 19 of 50 50 photos: Obama in 50 states Hiking with the family on Cadillac Mountain at Acadia National Park in Maine on July 16, 2010. Hide Caption 50 photos: Obama in 50 states Graduates celebrating at the U.S. Naval Academy in Annapolis, Maryland, on May 22, 2009. Hide Caption 21 of 50 50 photos: Obama in 50 states Discussing the situation in Ferguson, Missouri, while on vacation in Martha's Vineyard, Massachusetts, on August 14, 2014. Hide Caption 22 of 50 50 photos: Obama in 50 states Sitting on the famed Rosa Parks bus at the Henry Ford Museum in Dearborn, Michigan, on April 18, 2012. Hide Caption 23 of 50 50 photos: Obama in 50 states Talking with letter writer Rebekah Erler at Matt's Bar in Minneapolis, Minnesota, on June 26, 2014. Hide Caption 24 of 50 50 photos: Obama in 50 states Meeting on the BP oil spill in the Gulf of Mexico at the Gulfport Coast Guard Station in Mississippi on June 14, 2010. Hide Caption 50 photos: Obama in 50 states Consoling families affected by the deadly tornadoes in Joplin, Missouri, on May 29, 2011. Hide Caption 50 photos: Obama in 50 states Fly fishing near Bozeman, Montana, on August 14, 2009. Hide Caption 50 photos: Obama in 50 states Greeting military personnel at Offutt Air Force Base near Omaha, Nebraska, on August 13, 2012. Hide Caption 50 photos: Obama in 50 states Viewing the Hoover Dam in Nevada on October 2, 2012. Hide Caption 29 of 50 50 photos: Obama in 50 states Joking with Vice President Joe Biden before a campaign rally in Portsmouth, New Hampshire, on September 7, 2012. Hide Caption 30 of 50 50 photos: Obama in 50 states Highlighting the opening of the Point Pleasant Beach boardwalk on May 28, 2013, with New Jersey Gov. Chris Christie and his family after Superstorm Sandy's devastation the previous September. Hide Caption 31 of 50 50 photos: Obama in 50 states Having lemonade with Andy and Etta Cavalier at their home in Albuquerque, New Mexico, on September 28, 2010. Hide Caption 32 of 50 50 photos: Obama in 50 states Greeting families with former first lady Laura Bush (from left), former President George W. Bush and first lady Michelle Obama before a commemoration ceremony on the 10th anniversary of the 9/11 terrorist attacks in New York on September 11, 2011. Hide Caption 33 of 50 50 photos: Obama in 50 states Listening to the President's remarks in Millers Creek, in the foothills of the Appalachians in North Carolina, on October 17, 2011. Hide Caption 34 of 50 50 photos: Obama in 50 states Greeting a young boy during a Flag Day celebration on June 13, 2014, at the Standing Rock Sioux Tribe Reservation in Cannon Ball, North Dakota. Cannon Ball is south of Bismarck. Hide Caption 35 of 50 50 photos: Obama in 50 states Greeting workers during a shift change at V&M Star, a manufacturer of steel products, in Youngstown, Ohio, on May 18, 2010. Hide Caption 36 of 50 50 photos: Obama in 50 states Hugging Amy Simpson, principal of Plaza Towers Elementary School, while viewing the remains of the school after a tornado in Moore, Oklahoma, on May 26, 2013. Hide Caption 37 of 50 50 photos: Obama in 50 states Reacting to a quip from a patron at the Gateway Breakfast House in Portland, Oregon, on July 24, 2012. Hide Caption 50 photos: Obama in 50 states Addressing a rally in Philadelphia, Pennsylvania, on October 10, 2010. Hide Caption 50 photos: Obama in 50 states Viewing the ocean at Brenton Point in Newport, Rhode Island, on August 29, 2014. Hide Caption 40 of 50 50 photos: Obama in 50 states Reacting to an enthusiastic greeter at Columbia Metropolitan Airport in South Carolina on March 6, 2015. Hide Caption 41 of 50 50 photos: Obama in 50 states Shaking hands with Booker T. Washington students before their commencement ceremony in Memphis, Tennessee, on May 16, 2011. Hide Caption 42 of 50 50 photos: Obama in 50 states Trying on a pair of cowboy boots at the University of Texas in Austin on August 9, 2010. Hide Caption 43 of 50 50 photos: Obama in 50 states Viewing solar panels at Hill Air Force Base, north of Salt Lake City, in Utah on April 3, 2015. Hide Caption 50 photos: Obama in 50 states Greeting the crowd in Burlington, Vermont, on March 30, 2012. Hide Caption 45 of 50 50 photos: Obama in 50 states Speaking during a rainstorm in Glen Allen, Virginia, on July 14, 2012. Glen Allen is near Richmond. Hide Caption 50 photos: Obama in 50 states Departing Seattle, Washington, on a foggy morning on November 25, 2013. Hide Caption 47 of 50 50 photos: Obama in 50 states Celebrating the life of Sen. Robert C. Byrd with Vice President Joe Biden and former President Bill Clinton, at a memorial service in Charleston, West Virginia, on June 28, 2010. Hide Caption 48 of 50 50 photos: Obama in 50 states Cheering with the La Follette Lancers football team during their practice in Madison, Wisconsin, on September 28, 2010. Hide Caption 50 photos: Obama in 50 states Watching geysers with the family at Yellowstone National Park in Wyoming on August 15, 2009. Hide Caption 50 of 50 (CNN) Here's a look at the life of Barack Obama, the 44th president of the United States. Personal: Birth date : August 4, 1961 Birth place : Honolulu, Hawaii Birth name : Barack Hussein Obama, Jr. Father : Barack Hussein Obama, Kenyan government official and former goat herder Mother : Stanley Ann (Dunham) Obama Soetoro, anthropologist Marriage : Michelle (Robinson) Obama (October 3, 1992 - present) Children : Natasha (Sasha), June 10, 2001, and Malia, July 4, 1998 Education : Columbia University, B.A., 1983, Harvard University, J.D., 1991 Religion : Christian The name Barack means \"one who is blessed\" in Swahili. Is the first African-American to be president of the Harvard Law Review. Timeline: 1964 - His parents divorce when Barack is two years old. Late 1960s - Lives in Indonesia with mother and stepfather Lolo Soetoro. 1971 - Returns to Hawaii to live with his maternal grandparents and attend school. November 24, 1982 - Barack Obama, Sr., dies in a car accident in Kenya. 1992-2004 - Practices civil rights law and teaches constitutional law at the University of Chicago Law School. November 7, 1995 - His mother, Stanley Ann (Dunham) Soetoro, 52, dies of ovarian cancer in Honolulu. 1995 - Publishes his autobiography \"Dreams from my Father,\" in which he admits to experimenting with marijuana and cocaine as a teenager. 1997-2005 - Illinois State Senator, representing the 13th District. 2000 - Runs for the U.S. House seat in Illinois' 1st District and loses to former Black Panther Bobby Rush. July 27, 2004 - Delivers the keynote address at the Democratic National Convention. November 2004 - Wins the U.S. Senate race in Illinois, defeating Alan Keyes. It is the first time in history a Senate race is between two African-American candidates. January 4, 2005 - Is sworn in as U.S. senator. 2006 - Wins a Grammy for Best Spoken Word Album for his reading of \"Dreams From My Father.\" August 20 - September 3, 2006 - Tours five African countries, including a visit to Nyangoma-Kogelo, Kenya, his late father's hometown. January 16, 2007 - Files papers with the FEC to form a presidential exploratory committee. February 10, 2007 - Announces his candidacy for president at an event in Springfield, Illinois. November 3, 2007 - Makes a surprise guest appearance on \"Saturday Night Live,\" as himself. January 3, 2008 - Wins the Iowa Democratic Caucuses with 38% of the vote. February 10, 2008 - Wins his second Grammy Award for Best Spoken Word Album for the audio version of his book, \"The Audacity of Hope: Thoughts on Reclaiming the American Dream.\" Former President Bill Clinton and former President Jimmy Carter were also nominated. March 18, 2008 - Makes a speech in Philadelphia defending his former pastor, Rev. Jeremiah Wright, who made racially-charged and anti-government comments during sermons. June 3, 2008 - Secures enough delegates to win the nomination - 2,118 - after the South Dakota and Montana primaries. June 19, 2008 - Announces he will not accept federal matching funds for his presidential campaign, foregoing $80 million dollars in federal money and a cap on how much he can spend. August 23, 2008 - Chooses Senator Joseph Biden (D-DE) as his running mate and has first rally with Biden in Springfield, Illinois in front of the old state capitol. August 27-28, 2008 - Is officially nominated as and accepts the nomination for president on the democratic ticket, becoming the first African-American candidate in U.S. history to lead a major party. November 3, 2008 - Grandmother, Madelyn Dunham, 86, dies in Hawaii after a long battle with cancer. November 4, 2008 - Is elected president of the United States with an estimated 66.7 million popular votes and 365 electoral votes. November 16, 2008 - Resigns his seat in the U.S. Senate. December 17, 2008 - Is named Time Magazine's \"Person of the Year.\" January 20, 2009 - Is sworn in as the 44th president of the United States January 22, 2009 - Issues executive orders regarding the closing of Guantanamo Bay, torture and creating a review of detention facilities and of individual cases. April 6, 2009 - During a speech made in Turkey, is quoted as saying, \"The United States is not, and will never be, at war with Islam.\" April 7, 2009 - Makes a surprise trip to Iraq , his first as president. October 9, 2009 - Is awarded the Nobel Peace Prize. March 23, 2010 - Signs the health care reform bill into law. March 28, 2010 - Makes a surprise visit to Afghanistan, the first as president. July 21, 2010 - Signs the Wall Street reform bill into law. August 31, 2010 - President Obama addresses the nation from the Oval Office to mark the end of U.S. combat operations in Iraq . September 1-2, 2010 - Hosts meetings between Israeli Prime Minister Benjamin Netanyahu and Palestinian President Mahmoud Abbas in Washington, DC. Other leaders attending meeting are Egyptian President Hosni Mubarak and King Abdullah II of Jordan. April 27, 2011 - The White House releases President Obama's original birth certificate . May 1, 2011 - In a televised press conference, Obama announces to the world that al Qaeda leader Osama bin Laden has been killed in a raid in Abbottabad, Pakistan . May 5, 2011 - Attends ceremony to honor victims of September 11th at Ground Zero. Lays a wreath, meets with first responders, families and colleagues of the victims. He also visits the \"Pride of Midtown\" firehouse, Engine 54, Ladder 9, Battalion 9, the unit that lost 15 men, the most of any one firehouse. May 25, 2011 - Is the first U.S. president to address the U.K. Parliament. October 21, 2011 - Announces the withdrawal of virtually all U.S. troops in Iraq by December 31, fulfilling a 2008 campaign pledge to end the war. May 9, 2012 - Excerpts from an interview with ABC air in which Obama endorses same-sex marriage. He is the first U.S. president to do so. He also says the legal decision should be up to the states. June 15, 2012 - Issues an executive order suspending the deportation of certain young undocumented immigrants who were brought to the United States as children. September 6, 2012 - Accepts the Democratic nomination for president at Time Warner Cable Arena in Charlotte, North Carolina. November 6, 2012 - Wins re-election as president of the United States beating Republican challenger and former Governor of Massachusetts Mitt Romney . December 19, 2012 - Is named Time Magazine's \"Person of the Year\" for the second time. January 20, 2013 - Is sworn in for his second term, in a private ceremony in the Blue Room of the White House. December 17, 2014 - Obama announces plans to normalize diplomatic relations with Cuba and ease economic restrictions on the nation, a policy shift he called the end of an \"outdated approach\" to U.S.-Cuban relations that, \"for decades, has failed to advance our interests.\" Obama said the U.S. will move towards re-opening its embassy in the communist nation and allow some travel and trade that had been banned under a decades-long embargo instated during the Kennedy administration. July 23, 2015 - Obama travels to his paternal homeland for the first time as President to participate in Global Entrepreneurship Summit in Nairobi, Kenya. 7 photos: Obama turns 53 years old Obama turns 53 years old – Democratic presidential candidate Barack Obama smiles and waves as the crowd sings \"Happy Birthday\" to him before his speech at the Lansing Center in Lansing, Michigan, on August 4, 2008. Hide Caption 1 of 7 7 photos: Obama turns 53 years old Obama turns 53 years old – Reporter Helen Thomas celebrates her 89th birthday with President Barack Obama, celebrating his 48th birthday, at the White House. Hide Caption 2 of 7 7 photos: Obama turns 53 years old Obama turns 53 years old – President Barack Obama reacts as the audience sings \"Happy Birthday\" after he presented the 2010 Citizens Medals at the White House. (AP Photo/Charles Dharapak) Hide Caption 3 of 7 7 photos: Obama turns 53 years old Obama turns 53 years old – Jazz musician Herbie Hancock, left, and members of OK-go are onstage as President Barack Obama celebrates his 50th birthday in Chicago in August 2011. Hide Caption 4 of 7 7 photos: Obama turns 53 years old Obama turns 53 years old – President Barack Obama walking from Marine One upon his return to the White House in August 2012 following a visit to Camp David, Maryland, where he spent his 51st birthday. Hide Caption 5 of 7 7 photos: Obama turns 53 years old Obama turns 53 years old – President Barack Obama waves as he returns to the White House where he kicked off his 52nd birthday weekend. Hide Caption 6 of 7 7 photos: Obama turns 53 years old Obama turns 53 years old – President Barack Obama acknowledges early birthday wishes after making a statement at the White House on August 1. He turned 53 on the 4th. Hide Caption ", "external_links": [], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-21T02:04:25.233+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}