{"organizations": [], "uuid": "fcea371ef008fa9d84544689d0db2685610db63a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c3a11514000077002e22b9.jpeg", "site_section": "http://www.huffingtonpost.com/tag/medical-marijuana/feed", "section_title": "Medical Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/entry/doj-medical-marijuana_55c382ade4b0d9b743db14fc?cps=gravity_2448_-6512387198148319565&kvcommref=mostpopular", "country": "US", "title": "The DOJ 'Intended To Discourage' A Historic Medical Marijuana Bill", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The DOJ 'Intended To Discourage' A Historic Medical Marijuana Bill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T19:26:00.000+03:00", "replies_count": 0, "uuid": "fcea371ef008fa9d84544689d0db2685610db63a"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/doj-medical-marijuana_55c382ade4b0d9b743db14fc?cps=gravity_2448_-6512387198148319565&kvcommref=mostpopular", "ord_in_thread": 0, "title": "The DOJ 'Intended To Discourage' A Historic Medical Marijuana Bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The DOJ 'Intended To Discourage' A Historic Medical Marijuana Bill Advocates say the DOJ \"misled\" members of Congress. The department says that's \"wholly inaccurate.\" Matt Ferner National Reporter, The Huffington Post Posted: 08/06/2015 04:26 PM EDT Credit: The Boston Globe/Getty Images \nAn internal Department of Justice memo leaked this week reveals that in the days leading up to last year's historic passage of a federal medical marijuana protections measure, the DOJ passed around \"informal talking points\" to members of Congress that were \"intended to discourage passage\" of the statute due to concerns about overreach -- concerns that would later turn out to be incorrect. \nIn May 2014, the House passed an appropriations amendment, introduced by Reps. Dana Rohrabacher (R-Calif.) and Sam Farr (D-Calif.), that blocked the DOJ from using funds to target state-legal medical marijuana operations. These historic protections for medical marijuana patients and providers were eventually signed into law by President Barack Obama as part of a larger federal budget bill. \nThis week saw the leak of a February 2015 memo revealing that before last year's House vote, the DOJ was concerned that the proposed amendment could effectively \"limit or possibly eliminate the Department’s ability to enforce federal law in recreational marijuana cases as well.\" \nWithin a year of the amendment passing, though, the DOJ would decide that it actually wasn't that concerned after all. The department admits in its own memo that it no longer interprets the Rohrabacher-Farr statute as \"placing any limitations on our ability to investigate and prosecute crimes involving recreational marijuana.\" \nThe memo, leaked by Tom Angell , a marijuana legalization advocate and writer for Marijuana.com, was slammed by marijuana policy reformers, who claim the DOJ \" misled \" or even lied to members of Congress in its talking points as a way of trying to smother the historic legislation. \nHere's a look at the key passage in the leaked memo: DOJ \nPatrick Rodenbush, a spokesman for the DOJ, defended the intent of the original talking points to The Huffington Post. \n\"It's wholly inaccurate to characterize an informal interpretation of proposed legislative language as misleading,\" Rodenbush said. \nHe explained that it's common for the DOJ to provide \"informal guidance\" to members of Congress on how an amendment, or its various proposed drafts, could potentially affect the department. The guidance distributed in 2014, he said, was not meant to be read as the DOJ's final legal position on the amendment. \nRodenbush also reiterated the department's current position on the medical marijuana protections, which the House voted in June to renew for another fiscal year. \n\"In line with our enforcement priorities, the amendment will not impact our ability to prosecute private individuals or private entities who are violating the Controlled Substances Act,\" Rodenbush said. \nIt's a position that Rohrabacher and Farr, the sponsors of the original statute, continue to dispute. \nIn a letter just last week, the pair called for an investigation by the DOJ's own inspector general into the department's ongoing prosecution of various medical marijuana cases in states where the substance is legal. They argue that the DOJ has overstepped its bounds, \"spending dollars it does not have the legal authority to spend,\" by cracking down on medical marijuana. \n\"The implementation of state law is carried out by individuals and businesses as the state authorizes them to do,\" the letter reads. \"For DOJ to argue otherwise is a tortuous twisting of the text... and common sense.\" \nTo date, 23 states and the District of Columbia have legalized marijuana for medical purposes, and 17 others have legalized the limited medical use of marijuana extracts. Four states, as well as D.C., have legalized recreational marijuana. But marijuana, be it medical or recreational, remains prohibited under federal law, and states that have legalized it rely on guidance from the DOJ that urges federal prosecutors to refrain from targeting state-legal marijuana programs. \nUnder the Obama administration, the Drug Enforcement Administration and several U.S. attorneys have raided marijuana dispensaries and sent people to prison, even though they'd been complying with state laws. According to a 2013 report from the advocacy group Americans for Safe Access, the Obama administration has spent nearly $80 million each year -- more than $200,000 a day -- cracking down on medical marijuana. \nMeanwhile, the American public overwhelmingly supports the use of medical marijuana: A 2014 CBS News poll found that 86 percent of Americans believe doctors should be able to prescribe marijuana to their patients. And multiple recent polls indicate that a majority of Americans are in favor of recreational marijuana legalization.", "external_links": [], "published": "2015-08-06T19:26:00.000+03:00", "crawled": "2015-08-07T18:11:14.310+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}