{"organizations": [], "uuid": "9f350a9eb4c716ee4f0410afa92a4da4e0790a48", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarackgolf_081114getty.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/250003-obama-golfs-with-old-friends-on-pre-birthday-weekend", "country": "US", "title": "Obama golfs with old friends on pre-birthday weekend", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama golfs with old friends on pre-birthday weekend", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T18:16:00.000+03:00", "replies_count": 0, "uuid": "9f350a9eb4c716ee4f0410afa92a4da4e0790a48"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/250003-obama-golfs-with-old-friends-on-pre-birthday-weekend", "ord_in_thread": 0, "title": "Obama golfs with old friends on pre-birthday weekend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama golfs with old friends on pre-birthday weekend By Jordan Fabian - 08/01/15 11:16 AM EDT President Obama on Saturday celebrated his upcoming birthday with an annual tradition: hitting the links with a group of old friends. The president — who turns 54 on Tuesday — and his friends played golf at Joint Base Andrews just outside the Beltway before heading up to the Camp David presidential retreat for the rest of the weekend. ADVERTISEMENT Obama invited three of his high school pals from Hawaii on the golf outing: Mike Ramos, Bobby Titcomb and Greg Orne. Like past years, the president appeared to be playing with a larger group than usual. At least seven men sporting golf attire were spotted chatting at the White House before leaving for the course. The White House said Marvin Nicholson, the president's body man and frequent golf partner, was also among the group. A cooler was seen being loaded into a van before the outing. Obama plans to return to the White House on Sunday afternoon. Tags: Past: 1 day Bush at Urban League: Obama was '... The Republican says president was right on noting past injustices. Obama tells liberals: I can't... The White House is mounting a vigorous push to convince liberals to back... A.B. Stoddard: Clinton must be... OPINION | Obvious mistakes aren’t being avoided but amplified, and... Christie to Colorado: Pot party... “As of January 2017, I will enforce the federal laws,” he says. Trump: 'World would unite if I... \"I think that I would have great diplomatic skills,\" he said in Scotland. Trump atop new poll; Kasich making... Despite leading the field, Trump has the worst favorability score among... Planned Parenthood strikes back The group’s top leaders have sharpened their attacks against the... McConnell warns Obama against... Fight over tobacco could jeopardize support for huge trade pact. Rubio: I hope Tom Brady retires “Every week he is not on the field is good news for the Miami Dolphins,\"... Sen. Grassley blocks judges, tells... The Iowa Republican refused to allow the confirmation of three judges for... White House threatens to veto bill... A measure stripping funding \"is certainly something\" that would draw a... Hillary's haircut: $600? Part of a New York salon was reportedly locked down for her visit. CISA: the dirty deal between... CISA is an out and out surveillance bill masquerading as a cybersecurity... Gruesome abortion clinic footage... The video contains hidden-camera footage from inside a Planned Parenthood... Fox debate rules could give Trump... The top-polling candidate will reportedly get center podium at the first... Sanders would clobber Trump in a... Sanders is destined to be a pacesetter; Trump is destined to become a... Trump campaign looking into... Advisor Sam Nunberg will be fired if reports are true, the campaign... Democrats and Republicans take... White lives are not 21 times more likely to be killed by the police. Cruz wants delay in Iran review... Presidential candidate says 60-day clock hasn't really even started yet. Is Bernie Sanders the next George... Can a senator from a small state again come out of nowhere to win the... Sanders vows no third-party run in... “I would not want to be responsible for electing some right-wing... Rand Paul attributes Trump's rise... \"We're going to come back to our senses and look for someone serious,\"...", "external_links": [], "published": "2015-08-01T18:16:00.000+03:00", "crawled": "2015-08-01T19:20:09.825+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}