{"organizations": ["Santa Maria Times", "Air Force", "CNN", "U.S. Supreme Court"], "uuid": "1f6460582a8f51c67785b20b7b30fcf3cf712357", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/09/us/undocumented-immigrant-charged-with-killing-air-force-vet/index.html", "country": "", "title": "Chief blames immigration policy in woman's murder - CNN.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Chief blames immigration policy in woman's murder - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "1f6460582a8f51c67785b20b7b30fcf3cf712357"}, "author": "", "url": "http://www.cnn.com/2015/08/09/us/undocumented-immigrant-charged-with-killing-air-force-vet/index.html", "ord_in_thread": 0, "title": "Chief blames immigration policy in woman's murder - CNN.com", "locations": ["United States", "California", "U.S.", "Mexico", "Santa Barbara County", "Durango", "Santa Maria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pharis", "Martin", "Joyce Dudley", "KEYT", "Martinez", "Lori Pedego", "Villagomez"], "text": "The debate over immigration 01:46 PLAY VIDEO Villagomez was arrested five days later -- on a probation violation -- and he was charged August 4 in the attack on Pharis, according to police. Pharis, 64, died in the hospital August 1. Her family said she was \"much loved,\" while her employer -- the Air Force's 50th Space Wing -- called her death a \"tragic loss\" in a statement from the commander. Arrested weeks prior Public defender Lori Pedego's office was closed Sunday, and she couldn't be immediately reached for comment. But last month, Martinez had pleaded not guilty to attempted murder, first-degree burglary with person present, assault with intent to commit rape, sexual penetration by foreign object and resisting a peace officer, according to the Santa Maria Times . Following Pharis' death -- which family members told CNN affiliate KEYT resulted from a coronary embolism -- police upgraded the charges to first-degree murder for both men, with the special circumstances of burglary, mayhem and rape, KEYT reported. Martinez faced an additional special circumstance of torture, the station said. \"These charges carry the possibility of the death penalty or life without possibility of parole,\" Santa Barbara County District Attorney Joyce Dudley told reporters, saying she did not yet know which sentence she would pursue. Police say Martinez has had numerous run-ins with the law, including an incident shortly before the attack on Pharis. \"Two weeks before this murder, Santa Maria police officers arrested him for possession of meth, and you know what we had to do? We had to cite him out. That's the problem with this system. This is not just in Santa Maria. This is all over the state of California and all over the United States,\" Martin said. The chief singled out California's Assembly Bill 109 -- an effort to comply with the U.S. Supreme Court's mandate to reduce the prison populations in state prisons -- and Prop 47 , which makes most nonviolent drug and property crimes misdemeanors, as the reasons that Martinez was able to commit the crimes of which he's accused. No immigration requests? Martin said although Martinez -- originally from the state of Durango, Mexico -- was in the United States illegally and even though he'd been booked in Santa Barbara County at least four times since 2009, local police received no formal requests from federal immigration authorities. The county first booked Martinez on November 19, 2009, for driving without a valid license. He was released 19 days later, police said. He was picked up again on May 22, 2014, initially for felony drug and sexual assault charges, police said. The assault charge was later modified to misdemeanor battery. U.S. Immigration and Customs Enforcement filed an \"immigration detainer -- notice of action,\" but the sheriff's office determined the request did not meet its \"immigration detention requirements,\" police said. Martinez posted bail and was released June 4. And during the methamphetamine arrest Martin referenced, Martinez was arrested July 17 on charges of possessing drug paraphernalia and felony possession of a \"concealed dirk or dagger.\" The paraphernalia charge was dismissed, and Martinez pleaded no contest to the weapons charge and the 2014 drug charge. Though the weapons charge earned him 30 days in jail, which would have begun October 31, Martinez was ordered released on July 20, five days before Pharis was attacked, police said. He was supposed to return to court August 24. JUST WATCHED ", "external_links": [], "published": "2015-08-09T03:00:00.000+03:00", "crawled": "2015-08-10T00:57:19.582+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}