{"organizations": ["Miss USA", "NBC Obama", "Trump Towers", "ISIS", "NBC", "University of Pennsylvania", "CNN", "Univision"], "uuid": "d59088ac52bb96a8783405813958c7b56580964e", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/16/politics/donald-trump-immigration-planned-parenthood-iraq-2016/index.html", "country": "", "title": "Trump on immigration: 'They have to go' - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Trump on immigration: 'They have to go' - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T18:10:00.000+03:00", "replies_count": 0, "uuid": "d59088ac52bb96a8783405813958c7b56580964e"}, "author": "", "url": "http://www.cnn.com/2015/08/16/politics/donald-trump-immigration-planned-parenthood-iraq-2016/index.html", "ord_in_thread": 0, "title": "Trump on immigration: 'They have to go' - CNNPolitics.com", "locations": ["Sarasota", "United States", "Iran", "Atlantic City", "Brooklyn", "Tampa", "Florida", "Iowa", "Boca Raton", "Iraq", "New Hampshire", "Queens", "New York", "Mexico", "U.S.", "New Jersey"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nick Jonas", "Donald Trump", "Barack Obama", "Trump", "Chuck", "Melania Knauss-Trump", "Mitt Romney", "Knauss", "Giuliana Rancic", "Steve Austin", "Obama", "Macy", "Barron William Trump", "Ivana Zelnicek Trump", "Marla Maples", "Alfred Eisenpreis", "Vince McMahon"], "text": "Donald Trump says undocumented immigrants in the U.S. need to be deported He also said the Iran deal will lead to \"nuclear holocaust\" (CNN) Donald Trump says he would undo all of President Barack Obama's executive moves to forestall deportations of undocumented immigrants if he's elected president. \"They have to go,\" the real estate mogul who is leading Republican primary polls nationally and in the key early-voting states of Iowa and New Hampshire, said in an interview aired Sunday on NBC's \"Meet the Press.\" In the wide-ranging interview, Trump also declined to rule out shutting down the federal government over Planned Parenthood. He called for the United States to seize oil in Iraq -- particularly the oilfields controlled by ISIS. And he warned of a \"nuclear holocaust\" if the Iran deal is implemented. But Trump's top campaign issue so far has been his focus on immigration. He told NBC Obama's moves that allow undocumented immigrants who were brought into the United States as children to stay, as well as actions that allow the undocumented parents of U.S. citizen children to avoid deportation. RELATED: Trump outlines immigration specifics Trump said he would deport families \"together.\" They'd be required to leave the United States and only then could some come back under an expedited process, he said, because \"we either have a country or we don't have a country.\" He also said he opposes \"birthright citizenship\" -- or a right to citizenship for any child born within a country's borders, regardless of their parents' legal status. \"You have to. What they're doing -- they're having a baby,\" Trump said. He didn't reprise his attacks on Obama's citizenship -- which shot Trump into the political spotlight four years ago -- but wouldn't answer when asked whether he believes the President was born in the United States. \"I don't like talking about it anymore,\" he said. \"Because honestly I have my own feelings.\" Trump also said he isn't sure whether he has ever donated to Planned Parenthood -- which he attacked for offering abortions in some of its clinics. \"I give to so many, Chuck. I give to so many organizations over the years,\" Trump said. \"Hundreds of millions of dollars. And so I don't know. I don't think so. But it's possible somewhere.\" 16 photos: Donald Trump's empire Real estate developer and entrepreneur Donald Trump has been in the spotlight for years. From producing and starring in TV shows to campaigning for the U.S. presidency, see how he's shaped his empire. Hide Caption 1 of 16 16 photos: Donald Trump's empire Trump stands with Alfred Eisenpreis, New York's economic development administrator, in 1976 while they look at a sketch of a new 1,400-room renovation project of the Commodore Hotel. After graduating from the University of Pennsylvania in 1968, Trump worked with his father on developments in Queens and Brooklyn before purchasing or building multiple properties in New York and Atlantic City, New Jersey. Those properties included Trump Tower in New York and Trump Plaza and multiple casinos in Atlantic City. Hide Caption 2 of 16 16 photos: Donald Trump's empire Trump was married to Ivana Zelnicek Trump from 1977-1990, when they divorced. They had three children together. Hide Caption 3 of 16 16 photos: Donald Trump's empire Trump dips his second wife, Marla Maples, after the couple married in a private ceremony in New York in December 1993. The couple divorced in 1999. Hide Caption 4 of 16 16 photos: Donald Trump's empire An advertisement for the television show \"The Apprentice\" hangs at Trump Towers in New York in 2004. The show launched in January of that year. In January 2008, the show returned as \"Celebrity Apprentice.\" Hide Caption 5 of 16 16 photos: Donald Trump's empire A 12-inch talking Trump doll is on display at a toy store in New York in September 2004. Hide Caption 6 of 16 16 photos: Donald Trump's empire Trump wrestles with \"Stone Cold\" Steve Austin at WrestleMania in 2007. Trump has close ties with the WWE and its CEO, Vince McMahon. Hide Caption 7 of 16 16 photos: Donald Trump's empire Trump attends the U.S. Open tennis tournament with his third wife, Melania Knauss-Trump, and their son, Barron William Trump, in 2006. Trump and Knauss married in 2005. Trump has five children from three marriages. Hide Caption 8 of 16 16 photos: Donald Trump's empire For \"The Apprentice,\" Trump was honored with a star on the Hollywood Walk of Fame in January 2007. Hide Caption 9 of 16 16 photos: Donald Trump's empire Trump holds a copy of his book \"Think Big and Kick Ass in Business and Life\" at a book signing in New York in 2007. He has published 16 books, according to his website. Hide Caption 10 of 16 16 photos: Donald Trump's empire In 2009, Trump announced his resignation as chairman of Trump Entertainment Resorts. Days later, Trump Entertainment Resorts filed for bankruptcy. Hide Caption 11 of 16 16 photos: Donald Trump's empire A supporter comes out for Trump at a tea party event in Boca Raton, Florida, in April 2011. Trump said he had considered running for President in 2012. Hide Caption 12 of 16 16 photos: Donald Trump's empire In 2012, Trump announces his endorsement of Republican presidential candidate Mitt Romney. In May 2012, on CNN's \"The Situation Room,\" Trump said that President Barack Obama's birthplace is a matter of opinion. In regards to the President's Hawaiian birth certificate , Trump said \"a lot of people do not think it was an authentic certificate.\" Hide Caption 13 of 16 16 photos: Donald Trump's empire Trump speaks in Sarasota, Florida, after accepting the Statesman of the Year Award at the Sarasota GOP dinner in August 2012. It was just before the Republican National Convention in nearby Tampa. Hide Caption 14 of 16 16 photos: Donald Trump's empire Trump appears on stage with Nick Jonas and Giuliana Rancic during the 2013 Miss USA pageant. Trump has been executive producer of the Miss Universe, Miss USA and Miss Teen USA pageants since 1996. Hide Caption 15 of 16 16 photos: Donald Trump's empire On June 16, Trump announces that he is running for President during a speech from Trump Tower in New York. He said he will give up the show \"The Apprentice\" to run. His recent comments on undocumented immigrants from Mexico has led to Univision deciding not to air the Miss Universe pageant, which is co-owned by Trump and NBCUniversal. Within days, NBCUniversal and Macy's also cut ties . Hide Caption 16 of 16 But he demurred when asked whether he would shut down the federal government over Medicaid dollars going to pay for women's health services at Planned Parenthood -- which many Republican presidential contenders have advocated. \"It's something I'd have to think about, to be honest with you. I don't want to give a hard and fast answer to that,\" Trump said. \"It bothers me greatly that they're doing the abortions. At the same time, women's health issues are, you know, very important to me.\" On foreign policy, Trump advocated seizing Iraqi oilfields that are controlled by ISIS in order to \"take away their wealth.\" \"You go and knock the hell out of the oil, take back the oil,\" he said. \"We take over the oil, which we should have done in the first place.\" Pressed on the possibility that doing so might require ground troops, Trump said: \"That's OK.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> Politics Originals ", "external_links": [], "published": "2015-08-16T18:10:00.000+03:00", "crawled": "2015-08-16T18:10:40.102+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}