{"organizations": [], "uuid": "a3c6ec7ff159e4b64dbd347b92725e2d705fe9ca", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/emissions_airpollution_052814getty_1.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/250050-gop-presidential-hopefuls-blast-obama-on-climate", "country": "US", "title": "GOP presidential hopefuls blast Obama on climate", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP presidential hopefuls blast Obama on climate", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T15:41:00.000+03:00", "replies_count": 0, "uuid": "a3c6ec7ff159e4b64dbd347b92725e2d705fe9ca"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/250050-gop-presidential-hopefuls-blast-obama-on-climate", "ord_in_thread": 0, "title": "GOP presidential hopefuls blast Obama on climate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP presidential hopefuls blast Obama on climate Getty Images By Timothy Cama - 08/03/15 08:41 AM EDT \nTop Republican candidates for president blasted the Obama administration’s landmark climate rule for power plants. \nCiting concerns like the science behind climate change or the economy, 2016 hopefuls said at a late Sunday event hosted by Freedom Partners that President Obama’s carbon limits will only hurt the country. ADVERTISEMENT Sen. Ted Cruz (R-Texas) said climate change simply isn’t happening, and the temperature data proves it.\n“Facts matter,” Cruz said at the event hosted by the Charles and David Koch-backed group. \n“If you look to the satellite data in the last 18 years, there’s been zero recorded warming. Now the global warming alarmists, that’s a problem for their theories. Their computer models show massive warming, the satellite says it ain’t happening.” \nPolitico’s Mike Allen characterized Cruz’ position as “full-on denial” of the overwhelming consensus that the climate is changing and humans are significantly contributing, and Cruz did not disagree. \nHe said the new power plant rules that Obama will formally release Monday show that leading Democrats have abandoned working Americans. \n“And they have chosen to go with California environmentalist billionaires and their campaign donations instead of the jobs of union members,” he said. Billionaire environmental activist Tom Steyer has donated to a number of Democrats. \nCruz pledged that he would move to block the rules if elected. \nSen. Marco Rubio (R-Fla.) did not disagree with the science of climate change, but focused on how the new rules would hurt the economy. \n“It will make the cost of electricity high for millions of Americans,” he said, adding that while a billionaire wouldn’t mind the increase in energy costs, a single mother would. \nRubio also questioned the effectiveness of the rules, saying that major developing countries like China and India will still emit massive amounts of greenhouse gases. \n“The bottom line is that American energy will allow millions of people to improve their standard of living, just as it has eradicated poverty for millions of people around the world,” he said. \nThe rules, which top Obama administration officials detailed Sunday, would mandate a 32-percent reduction in the power sector’s carbon emissions, stronger than what the administration proposed last year. \nFormer Florida Gov. Jeb Bush (R) said the rules are unconstitutional and will not survive court challenges. Tags:", "external_links": [], "published": "2015-08-03T15:41:00.000+03:00", "crawled": "2015-08-03T16:18:58.981+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}