{"organizations": ["Email Fox News Debate Host Asks", "The Huffington Post", "Fox News Debate Host Asks"], "uuid": "e749b276f431d3dd0a7cf0be806411ae8d6272a3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c3d3561d00002f001441c8.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/fox-news-debate-moderator-nudges-presidential-candidates-toward-spying-on-mosques_55c3d12ce4b0923c12bc48ea", "country": "", "title": "Fox News Debate Host Asks GOP Presidential Candidates If They'd Spy On Mosques. Obama Already Does.", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Fox News Debate Host Asks GOP Presidential Candidates If They'd Spy On Mosques. Obama Already Does.", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T01:35:00.000+03:00", "replies_count": 0, "uuid": "e749b276f431d3dd0a7cf0be806411ae8d6272a3"}, "author": "", "url": "http://www.huffingtonpost.com/entry/fox-news-debate-moderator-nudges-presidential-candidates-toward-spying-on-mosques_55c3d12ce4b0923c12bc48ea", "ord_in_thread": 0, "title": "Fox News Debate Host Asks GOP Presidential Candidates If They'd Spy On Mosques. Obama Already Does.", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan Grim"], "text": "0 Email Fox News Debate Host Asks GOP Presidential Candidates If They'd Spy On Mosques. Obama Already Does. Ryan Grim Washington bureau chief for The Huffington Post Posted: 08/06/2015 06:28 PM EDT ASSOCIATED PRESS \nIt took Fox News less than a half an hour to propose, in the form of a question, that the next president ramp up surveillance on mosques. \nAfter suggesting that the U.S. was broadly at risk from Islamist extremists already in the country, co-moderator Martha MacCallum wondered, \"Would you put mosques, for example, potentially under surveillance?\" \nThe question ended up being handled by former New York Gov. George Pataki, likely addressing his largest audience since declaring his quixotic bid. \nPataki did not speak to the question of mosque surveillance directly in his response, but said he would go after hate speech that encouraged \"violent jihad\" and was not constitutionally protected religious practice or speech. \n\"Martha, religious liberty doesn't include encouraging a fellow American to engage in violent jihad and kill an American here,\" Pataki said. \"That is not protected free speech. That is not protected religious belief. That is like shouting 'fire' in a crowded theater, and it is illegal.\" \n\"We have to shut down -- whether or not they are in prisons preaching -- or in mosques preaching,\" Pataki added. \nLater in the debate, Sen. Lindsey Graham (R-S.C.) said that if he needed to spy on a mosque, he would. \n“If I have to monitor a mosque, I’ll monitor a mosque,” Graham said. Mosques are already under surveillance. The FBI alone has some 15,000 informants — many of them focused on spying on Muslim communities in the United States. And a team of Associated Press reporters won the Pulitzer Prize in 2012 for exposing the NYPD's surveillance of Muslim communities throughout New York City and its suburbs. ", "external_links": [], "published": "2015-08-07T01:35:00.000+03:00", "crawled": "2015-08-07T01:35:11.432+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}