{"organizations": [], "uuid": "c1860ef2663d09cb645f067b8acbe940786640a6", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150804160906-barack-obama-benjamin-netanyahu-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/08/04/politics/netanyahu-obama-iran-deal-jewish-groups/index.html", "country": "US", "title": "Iran deal: Obama, Netanyahu duel for American Jewish support - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Iran deal: Obama, Netanyahu duel for American Jewish support - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "c1860ef2663d09cb645f067b8acbe940786640a6"}, "author": "Kevin Liptak", "url": "http://www.cnn.com/2015/08/04/politics/netanyahu-obama-iran-deal-jewish-groups/index.html", "ord_in_thread": 0, "title": "Iran deal: Obama, Netanyahu duel for American Jewish support - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights President Obama will personally lobby Jewish American groups to support the Iran deal during an afternoon White House meeting. Israeli Prime Minister Netanyahu claimed the nuclear agreement \"gives Iran two paths to the bomb\" in a webcast with Jewish leaders. Washington (CNN) President Barack Obama and Israeli Prime Minister Benjamin Netanyahu are presenting dueling messages to the American Jewish community Tuesday amidst a roiling debate on the Iran nuclear deal.\nObama is planning to personally lobby Jewish American groups to support the agreement during an afternoon White House meeting, another example of this administration's push to convince skeptical parties of the plan's merits as lawmakers mull whether to back it.\nThe White House refused to release a list of participants ahead of time, but many of the expected attendees also heard from Israeli Prime Minister Benjamin Netanyahu earlier Tuesday during a webcast speech to Jewish organizations. The Anti-Defamation League, Orthodox Union and J Street are among the groups whose representatives will be in attendance Tuesday afternoon.\n\"The nuclear deal with Iran doesn't block Iran's path to the bomb, it actually paves Iran's path to the bomb,\" Netanyahu said in his presentation, which was sponsored by the Jewish Federations of North America and the Conference of Presidents of Major American Jewish Organizations and broadcast to synagogues and community centers around the country.\nThe deal, Netanyahu claimed, \"gives Iran two paths to the bomb: Iran can get to the bomb by keeping the deal, or Iran could get to the bomb by violating the deal.\"\nIn his session with leaders of Jewish organizations, Obama hopes to counter that argument in \"direct, blunt\" terms, White House Press Secretary Josh Earnest said on Tuesday.\nJUST WATCHED Anger in Israel over Iran nuclear deal Replay More Videos ... MUST WATCH\nAnger in Israel over Iran nuclear deal 02:43 PLAY VIDEO READ: Washington battle rages over Iran deal's fate\nBut Earnest indicated the White House session was not arranged specifically to rebut Netanyahu.\n\"The Prime Minister has ample opportunity to make clear what his views are and he has taken advantage of that opportunity,\" Earnest said. \"The President believes it is in the national security interests of our closest ally in the region, Israel, to prevent Iran from obtaining a nuclear weapons through diplomacy.\"\nThe administration is hurriedly working to convince lawmakers to back the diplomatic accord with Iran, which was struck in mid-July.\nDemocrats who haven't announced their position are being pressured the most and one of them, House Minority Whip Steny Hoyer of Maryland, is traveling with a group of Democratic congressmen to Israel now that the House has recessed.\nMeanwhile many Jewish groups, led by the powerful American Israeli Public Affairs Committee, are lobbying against the deal, pouring millions of dollars into ad campaigns claiming the plan threatens Israel's safety.\nAIPAC and its affiliates are planning to spend upwards of $20 million on the effort, much of it aimed at lawmakers on the fence.\nOn the other side, the dovish J Street released a new TV ad Tuesday in support of the deal, part of a $5 million advocacy campaign.\nAs part of the administration's pushback, Obama will also deliver remarks at American University in Washington on Wednesday detailing the advantages of pursuing diplomacy with Iran.\nThe White House has drawn a comparison to a 1963 commencement speech delivered by President John F. Kennedy at the same institution, in which he advocated for diplomatic talks with the Soviet Union.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-super-169.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-small-169.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-large-169.jpg"], "published": "2015-08-04T03:00:00.000+03:00", "crawled": "2015-08-05T00:19:44.585+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}