{"organizations": [], "uuid": "089101cd0b9449a07a2b493f6eb8f1304c2b0559", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3343518/images/o-BIDEN-CLINTON-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/hillary-clinton/feed", "section_title": "Hillary Clinton on Huffington Post", "url": "http://www.huffingtonpost.com/daniel-r-depetris/what-obama-should-do-abou_1_b_8039514.html", "country": "US", "title": "Daniel R. DePetris: What Obama Should Do About the Hillary Clinton-Joe Biden Pickle", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Daniel R. DePetris: What Obama Should Do About the Hillary Clinton-Joe Biden Pickle", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T20:58:00.000+03:00", "replies_count": 0, "uuid": "089101cd0b9449a07a2b493f6eb8f1304c2b0559"}, "author": "Daniel R. DePetris", "url": "http://www.huffingtonpost.com/daniel-r-depetris/what-obama-should-do-abou_1_b_8039514.html", "ord_in_thread": 0, "title": "Daniel R. DePetris: What Obama Should Do About the Hillary Clinton-Joe Biden Pickle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit ASSOCIATED PRESS \nThe \"will he or won't he\" over Vice President Joe Biden's prospects for jumping into the 2016 Democratic presidential primary race has reached a fevered pitch -- so much so that the speculation is beginning to take over the Donald Trump obsession that previously dominated the political beat. \nQuestions over whether Biden has a realistic shot at winning the nomination against a formidable Hillary Clinton (even with lower ratings in some categories over the private email controversy or scandal, depending on who you ask) is all anyone has been able to talk about over the past several days. But this isn't another case of hypertension among political reporters, because the VP is fueling these stories through his own actions; on Saturday, he met with Sen. Elizabeth Warren to gauge whether her voters would be interested in a Biden candidacy. And according to The Washington Post , Biden will be summoning some of President Barack Obama's top donors to his residence after Labor Day. All of this comes on top of a private meeting between Biden and Obama on Monday, during which the President gave his second-in-command \" blessing \" to keep on exploring a presidential run. \nYet there is another interesting story beneath the Biden 2016 phenomenon that is now being picked up by the major political outlets: who will President Obama endorse for the Democratic primary? The question could get really awkward for the President and his team, since both Hillary Clinton and Joe Biden served critical roles in his administration. The President has only nice things to say about both of these people, so it's going to be an incredibly difficult decision for Obama to make when the time comes for an endorsement. \nHeadlines like \" Potential Joe Biden Run Puts White House in a Bind ,\" \" Family Feud? Obama Caught Between Clinton, Biden Ambitions , and \" Will Biden Run? Drama Creates Dilemma for Obama \" all have the same exact theme: the next six months could be one of the most personally troubling times for Obama if two of his administration heavyweights actually start targeting each other in an election year. \nPete Souza/Flickr \nIndeed, the Clinton-Biden schism goes beyond the President himself. Politico reports that much of the White House staff has a special love and affinity for Joe Biden and would love to see him become the next President of the United States. Yet there are others in the White House and across the administration who sincerely doubt that the 72-year old VP can be any more successful in 2016 than he was in 1988 or 2008. For all of Biden's gifts as a politician and a genuinely good man (ever person who has dealt with the former Delaware Senator-turned VP loves him), he did terribly the last time he ran for the Democratic nomination and would need to scrape up enough money and talent to staff a national campaign. \nAs one anonymous official told Politico , \"This is something that's going to be really hard for the president and for the White House...Anyone who has worked there [the White House] loves Joe Biden. He's a wonderful man, and your heart breaks for him for what he's been through -- though for those same reasons, everyone wants to protect him from running a third time, and running this bruising race way too late in the game.\" \nIf President Obama thinks he has problems now with balancing the Clinton-Biden split, he has another thing coming if his very own Vice President formally declares his candidacy. Both candidates could realistically earn Obama's endorsement because both are more likely than not to uphold and expand upon his domestic and foreign policy accomplishments -- most recently the Joint Comprehensive Plan of Action, an accord that all 17 GOP presidential candidates say is a bad deal that should be upended or thrown into the garbage altogether. Press Secretary Josh Earnest indicated that Obama could very well make some sort of endorsement as the Democratic primaries grind on next year. Or, as Earnest said during an August 24 press briefing \"I wouldn't rule out an endorsement.\" \nIf I were in the White House giving President Obama advice right now, I would tell him to do something that may be tough for him to do. That is, ride out the Democratic primaries without endorsing any candidate. Let the contest play out as it's supposed to play out: with Democratic primary voters choosing their nominee without a president weighting in. It may seem unorthodox, and one could very well argue that as President of the United States and leader of the Democratic Party, Obama has the right and responsibility to openly declare who he thinks is the best person to lead the party once he departs from the scene. But there is a political reality here that Obama will want to avoid, and that is whichever decision he makes on the Hillary Clinton- Joe Biden question will get people upset. If he chooses Hillary, Obama will be pummeled by people in his own administration who love Joe Biden (particularly those who have already left the White House) as someone who let the Vice President down. And, if he chooses Biden over Hillary, a lot of big donors and establishment-types in the Democratic Party will run with the idea (rightly or wrongly) that Obama never truly forgave Hillary for running a bruising campaign against him in 2008. \nIn other words, Obama loses either way. \nPresident Obama is in the unenviable position of winding down his administration at the same that that two enormously important players during his presidency could potentially be running against one another. What down side would there be to stay above the fray of presidential politics and watch the Democratic primary as a neutral observer? If he wants to endorse someone, Obama can do it once the party chooses its nominee. \nFollow Daniel R. DePetris on Twitter: www.twitter.com/DanDePetris More:", "external_links": [], "published": "2015-08-26T20:58:00.000+03:00", "crawled": "2015-08-27T01:23:35.844+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}