{"organizations": [], "uuid": "a2ec38369b881d8a501dd4688bd9039c6d3e4084", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/romneytrump.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/campaign/251528-trump-takes-heat-from-romney-advisers-on-immigration", "country": "US", "title": "Trump takes heat from Romney advisers on immigration", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trump takes heat from Romney advisers on immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T13:00:00.000+03:00", "replies_count": 0, "uuid": "a2ec38369b881d8a501dd4688bd9039c6d3e4084"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/campaign/251528-trump-takes-heat-from-romney-advisers-on-immigration", "ord_in_thread": 0, "title": "Trump takes heat from Romney advisers on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump takes heat from Romney advisers on immigration By Alexander Bolton - 08/20/15 06:00 AM EDT \nThe ghost of Mitt Romney’s failed 2012 presidential election campaign is haunting Republicans when it comes to Donald Trump’s immigration plan. \nTrump’s proposals to end birthright citizenship while rounding up and deporting undocumented immigrants reminds many Republicans of Romney’s call for illegal immigrants to self-deport. ADVERTISEMENT Sen. Lindsey Graham (S.C.) told reporters on Monday that Trump’s proposal is “going to kill the Republican Party.”\n“That’s self-deportation on steroids,” he said. \nSen. Jeff Flake (Ariz.), who along with Graham was one of the Republican co-authors of the comprehensive immigration reform bill that passed the Senate in 2013, called Trump’s proposal “simply unrealistic.” \n“Not only would its costs run into the hundreds of billions of dollars, it would devastate the economies of states that rely on billions of dollars annually from cross-border trade, including Arizona, Texas and California,” he said in a statement to The Hill. \nRepublicans believe Romney hurt himself by moving to the right in the 2012 primary on immigration. In the general election, President Obama won 71 percent of the Hispanic vote according to some exit polls, significantly contributing to Romney’s loss. \nNow the GOP is worried something similar is happening with Trump as rivals to the GOP frontrunner begin adopting some of his immigration rhetoric. \nIt has set off alarm bells among GOP lawmakers and strategists, particularly among former advisers to Romney who vividly remember his problems with Hispanic voters. \nEric Fehrnstrom, a former senior advisor to Romney, tweeted Tuesday that “Trump’s immigration plan is a Punji stake pit for other candidates. They should not fall into the trap of looking like they oppose reform.” \nKatie Packer Gage, a deputy campaign manager for Romney, told CNN that Republican candidates need to be careful. \n“This is an issue that I think Republican candidates have to be very careful about. I don’t think that the majority of the American people are ready to repeal the 14 th Amendment and say children born in this country are not citizens,” she said. \nVin Weber, a GOP strategist and former senior advisor to Romney’s 2012 White House bid, said voters don’t currently see Trump as speaking for the GOP but worries that will change if he continues to dominate the polls. \n“The longer that he remains in the front-runner status and if he can solidify for the time being that role and the more other candidates move toward his positions, the more this is going to be become the Republican position,” he said. “I’m very concerned about it. \nTrump has proposed building a permanent wall along the 1,900-mile U.S.-Mexican border, tripling the number of Immigration and Customs Enforcement officers, implementing a nationwide e-verify system and increasing penalties for people who overstay their visas. \nThe business mogul’s tough talk on illegal immigration has struck a nerve with many Republican voters, and he is riding high in polls. \nMany in the GOP believe that will put pressure on other Republican candidates to move toward Trump’s rhetoric. \nSen. Ted Cruz (R-Texas) said Wednesday that he “absolutely” supports changing the 14th amendment to end birthright citizenship, saying that “we should end granting automatic birthright citizenship to the children of those who are here illegally.” \nWisconsin Gov. Scott Walker, who has seen Trump overtake him in polls in Iowa, said much of what Trump is proposing is “similar to the things I’ve mentioned.” \nLouisiana Gov. Bobby Jindal, who is near the bottom of the pack of presidential hopefuls, has embraced Trump’s call to end birthright citizenship for the children of illegal immigrants. \nEven Graham, who has frequently battled with Trump and says most of his plan is unworkable, offered support for ending birthright citizenship. \n“I think it's a bad practice to give citizenship based on birth,” he told CNN’s “The Situation Room.” \n“We have evidence of people buying tourist visas for the express purpose of coming over here and having a child. I don't think that's a good idea,” he said. \nA study put out by the Republican National Committee after the last presidential election concluded the GOP needed to change how it engages with Hispanics, who make up a sizable share of the vote in three swing states — Colorado, Florida and Nevada — that could decide which party controls the White House as well as the Senate in 2017. \nLatinos made up 17 percent of eligible voters in Florida 2014, 16 percent in Nevada and 14 percent in Colorado. Hispanics account for nearly five percent of eligible voters in Virginia, another presidential target state. \n“It’s essential that be competitive with that community,” Weber said. “There are competing theories in the Republican Party. One is that we need to be more competitive with Hispanic voters, young voters and women — particularly Hispanic voters.” \n“There’s a competing theory that says we need to increase our percentage and turnout among the traditional white base of the Republican Party. My view is that’s like being asked to the last dance on the Titanic,” he added. \nAlfonso Aguilar, a former Bush administration official and executive director of the American Principles Project’s Latino Partnership, says Walker could be the “biggest loser.” \n“Scott Walker by embracing the proposal to end birthright citizenship, he’s done with Latino voters,” said Aguilar. “And I think that’s going to affect him with donors as well. \n“He had his self-deportation moment,” he added. Tags:", "external_links": [], "published": "2015-08-20T13:00:00.000+03:00", "crawled": "2015-08-20T14:57:50.294+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}