{"organizations": [], "uuid": "e38c36c5484b3abd9cc9dec4ad8e155f15584cfe", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/PKG0431-081915FNL1-3QVC2PWA_FNC_081915_14-23.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/20/bob-menendez-says-obama-administration-cuba-policy-is-one-way-street/", "country": "", "title": "Bob Menendez says Obama administration's Cuba policy is 'one-way street' | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Bob Menendez says Obama administration's Cuba policy is 'one-way street' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "e38c36c5484b3abd9cc9dec4ad8e155f15584cfe"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/20/bob-menendez-says-obama-administration-cuba-policy-is-one-way-street/", "ord_in_thread": 0, "title": "Bob Menendez says Obama administration's Cuba policy is 'one-way street' | Fox News Latino", "locations": ["Cuba", "U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bob Menendez", "Obama"], "text": "5 decades later, U.S. and Cuba diplomatic ties restored \nSen. Robert Menendez took aim at what he sees as velvet-glove treatment of the Castro regime in Cuba by the Obama administration, saying that all the U.S. overtures toward the communist nation have made zero difference in how oppressed its citizens are. \nMenendez, the son of Cuban immigrants who grew up in Union City, New Jersey, was raised on stories about the suffering of people who stayed behind in. And like many Cuban exiles and the children they raised with those stories, the Democratic senator has little tolerance for any move toward being amiable with Cuba’s leaders. \nLate last year, both presidents Barack Obama and Raúl Castro announced a deal to re-establish diplomatic relations, including easing U.S. trade and travel restrictions. But that agreement, he said in an interview with Fox News Latino, “is a one-way street.” We send convicted spies back, and we get an innocent American, who should never have been held hostage in the first place, in return. We don’t send spies back in the world anywhere. This is like a whole new [world] order. \n- Sen. Robert Menendez, on U.S.-Cuba accord to restore diplomatic relations \n“Cuba said, ‘You want to have a relationship with us? Well, we want our three convicted spies back,’” Menendez said. “Including one who was convicted of conspiracy to commit the murder of three United States citizens.” \nIn the last few weeks, the two nations re-opened embassies in each other’s capitals. Last Friday, Secretary of State John Kerry was in Havana to raise the American flag in front of the U.S. embassy. \nExtending an olive branch to Castro while requiring him to make no meaningful changes in return, is an affront to human rights and the United States moral authority in the world, Menendez maintains. \n“We send them the spies back, we get an innocent American – who should never have been held hostage in the first place – in return,” he said. “We don’t send spies back in the world. Anywhere. This is like a whole new [world] order.” \nThe Obama administration has said that more than 50 years of a Cold War hostility toward Cuba has accomplished nothing, except to give Fidel and Raúl Castro’s regimes an excuse – the U.S. embargo – for why its economy is a mess and people struggle to make ends meet. \nThe White House has denied that the release of the American, Alan Gross, who was in a Cuban jail for five years, was a swap for the Cuban spies. \nGross was arrested in 2009 for his work as a U.S. government contractor to set up Internet access without local censorship for Cuba’s Jewish community. Cuban officials said it was a crime to engage in what it called subversive work and gave him a 15-year prison sentence. \nMenendez said there are numerous, serious human-rights violations Cuba has committed that should have been resolved before any accord involving restoring relations took place. \nThose include the U.S. fugitives, including former Black Liberation Army leader Joanne Chesimard, who was sentenced for the 1973 killing of a New Jersey state trooper, who have been granted refuge in Cuba. Chesimard escaped prison and ended up on the island in 1984. Then-President Fidel Castro called her a hero and granted her political asylum. \nChesimard, 67, is the only woman on the FBI's list of \"wanted terrorists\" and has a $2 million bounty on her head. \nMenendez says Chesimard is but one of “50 to 75 felons that committed major crimes in the United States who are in Cuba.” \nThere was also the decision, he said, by the Obama administration to invite Cuba to the Summit of the Americas earlier this year. \nThe basic concept of the summit, he said, is a gathering for democratically-elected officials in the Western Hemisphere. \n“I don’t think anyone can dispute that Cuba is not a democratically-elected government,” Menendez said. \nAll these allowances by the United States, the senator said, “undermine the value of democracy and human rights in the region.” \nObama administration officials and congressional lawmakers, including Sen. Patrick Leahy, the Vermont Democrat, who were at the forefront of pushing for restored U.S.-Cuba relations said that leaders from Latin America often complained about Cuba being left out. \n“I care about the Cuban people,” Menendez said. “I want to see democracy and human rights … There is no free press there. You can’t elect who you want to govern you. You can’t start your own business at will. You don’t get to choose freely at the altar you worship without consequences.” \nHe looks at all of the things that have changed since the accord, and sees little trickling down to the people, he said. \n“In the first seven months of this year alone, 2,500 human-rights activists and political dissidents have been arrested and detained for peaceful protests,” he said. \n“Then on the day that we open our embassy, Secretary Kerry doesn’t invite [Cuba’s] human-rights activists, the political dissidents the independent journalists to the opening and flag-raising. If in the courtyard of the U.S. embassy in Havana dissident is not permitted, it will certainly not be permitted on the island.” \nElizabeth Llorente can be reached at elizabeth.llorente@foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \nLike us on Facebook ", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-22T07:30:13.016+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}