{"organizations": ["Fox News Latino FILE"], "uuid": "8d4f87d4ef84ab81a69ab1a4a61aa1ddeb77d3f9", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Rubio%20FPI%20Speech.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/14/marco-rubio-slams-obama-for-outreach-to-cuba-iran-calls-it-flawed-strategy/", "country": "", "title": "Marco Rubio slams Obama for outreach to Cuba and Iran, calls it 'flawed strategy' | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Marco Rubio slams Obama for outreach to Cuba and Iran, calls it 'flawed strategy' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "8d4f87d4ef84ab81a69ab1a4a61aa1ddeb77d3f9"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/14/marco-rubio-slams-obama-for-outreach-to-cuba-iran-calls-it-flawed-strategy/", "ord_in_thread": 0, "title": "Marco Rubio slams Obama for outreach to Cuba and Iran, calls it 'flawed strategy' | Fox News Latino", "locations": ["Iran", "Cuba", "U.S.", "Atlanta", "Havana", "R-Fla."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marco Rubio", "John Kerry", "Obama", "Rubio"], "text": "Marco Rubio slams Obama for outreach to Cuba and Iran, calls it 'flawed strategy' Published August 14, 2015 Fox News Latino FILE - In this Aug. 7, 2015, file photo, Republican presidential candidate Sen. Marco Rubio, R-Fla., steps on the stage to speak at the RedState Gathering in Atlanta. Rubio will lay out a strategy on Friday, Aug. 14, to deal with the \"tyrannical regimes\" of Cuba and Iran, the same day Secretary of State John Kerry attends a historic flag-raising ceremony at the U.S. Embassy in Havana. (AP Photo/David Goldman, File) \nNEW YORK (AP) – Republican presidential candidate Marco Rubio is slamming President Barak Obama's outreach to Iran and Cuba, calling his diplomacy with the two nations evidence of \"every flawed strategic, moral and economic notion\" that has driven his foreign policy. \nIn a blistering speech Friday to the conservative-leaning Foreign Policy Initiative in New York, set for delivery the same day Secretary of State John Kerry re-opens the U.S. embassy in Havana, the Florida senator will say that Obama has made no efforts \"to stand on the side of freedom.\" \n\"He has been quick to deal with the oppressors, but slow to deal with the oppressed,\" Rubio says in excerpts of prepared remarks released by his campaign. \"And his excuses are paper-thin.\" \nA member of the Senate Foreign Relations Committee, the Cuban-American lawmaker has made foreign policy a centerpiece of his campaign for president. In the speech, he pledges to \"roll back\" what he termed Obama's \"concessions\" to Cuba and the recently completed nuclear deal with Iran and says he will \"repair the damage done to America's standing in the Middle East.\" \nRubio says he would demand that the Cuban government carry out political and human rights reforms to maintain diplomatic relations and would return the country to the U.S. list of state sponsors of terrorism until it stops \"helping North Korea evade international sanctions\" and \"harboring fugitives from American justice.\" \nThe Obama administration has said it is normalizing ties with Cuba after more than 50 years of hostility failed to shake the communist government's hold on power. It argues that dealing directly with Cuba over issues including human rights and trade is far likelier to produce democratic and free-market reforms over the long term. \nWhile the issue is one of personal importance to Rubio, whose parents emigrated from Cuba in the 1950s, it doesn't top the list of foreign policy issues that matter to Americans. \nA poll released Friday by the Associated Press-NORC Center for Public Affairs Research found that only 1 in 3 Americans said it was important to hear from the next president about their approach to Cuba, compared with nearly 9 of 10 who wanted to hear about terrorism and cyberattacks by foreign countries or terrorist groups. \nRoughly three-quarters of Americans said it was important to hear from the next president about Iran. Rubio in his speech vows to re-impose the economic sanctions U.S. and other world powers agreed to lift in exchange for curbs on Tehran's nuclear program. \n\"I will give the mullahs a choice: either you have an economy or you have a nuclear program, but you cannot have both,\" he says. \nAny talks to come afterward must result in a deal that terminates Iran's nuclear program, he says, and would also be tied to \"Iran's broader conduct, from human rights abuses to support for terrorism and threats against Israel.\" \n\"There would be no room for equivocation, no room for manipulation and no room for cheating,\" Rubio says. \"Some will say there will also be no room for negotiations. But history proves otherwise. Iran may not return to the table immediately, but it will return when its national interests require it to do so.\" \nOpposition to the Iran nuclear deal, brokered by the U.S., Britain China, France, Germany and Russia, is universal among the Republican candidates for president. Congress will vote on the agreement in about a month, and Obama is working to secure enough Democratic votes to prevent Congress from overriding his veto of its likely vote to oppose the deal. \nObama has said that Republicans are opposing the Iran nuclear deal because his name is on it. \n\"Unfortunately, a large portion of the Republican Party, if not a near unanimous portion of Republican representatives, are going to be opposed to anything that I do,\" Obama told NPR News earlier this week. \nLike us on Facebook ", "external_links": [], "published": "2015-08-15T03:00:00.000+03:00", "crawled": "2015-08-16T05:13:30.174+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}