{"organizations": [], "uuid": "51dd6c373f758d5470f498064e385276a65e200f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c3fda41400002e002e23bc.jpeg?cache=rZ0TQsDMEg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/candidate-mentions-debate-drinking-game_55c3fce8e4b0f1cbf1e481c7", "country": "", "title": "Hope You Didn't Have 'Clinton' Or 'Obama' In Your Debate Drinking Game", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Hope You Didn't Have 'Clinton' Or 'Obama' In Your Debate Drinking Game", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T04:14:00.000+03:00", "replies_count": 0, "uuid": "51dd6c373f758d5470f498064e385276a65e200f"}, "author": "", "url": "http://www.huffingtonpost.com/entry/candidate-mentions-debate-drinking-game_55c3fce8e4b0f1cbf1e481c7", "ord_in_thread": 0, "title": "Hope You Didn't Have 'Clinton' Or 'Obama' In Your Debate Drinking Game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Obama"], "text": "Hope You Didn't Have 'Clinton' Or 'Obama' In Your Debate Drinking Game Early debate on Thursday included very little GOP infighting. Ariel Edwards-Levy Reporter, The Huffington Post Posted: 08/06/2015 08:42 PM EDT | Edited: 31 minutes ago Credit: Scott Olson/Getty Images \nThe seven Republicans who didn't make it into the main presidential debate Thursday might have had some incentive to punch upward at their better-polling rivals. \nInstead, they focused their barbs almost solely at Democrats, hitting President Barack Obama for his record on health care, Iran and immigration, and slamming Democratic presidential candidate Hillary Clinton on everything from the Benghazi, Libya, attack to her support for Planned Parenthood. Democratic presidential hopeful Sen. Bernie Sanders (I-Vt.) got a backhanded compliment from Louisiana Gov. Bobby Jindal, who lauded him as \"honest enough to call himself a socialist.\" Even former New York Gov. Mario Cuomo (D), whose tenure ended in 1994, merited a mention. \nBut most of the GOP field? Not so much. \nA few Republicans did take on Donald Trump after the moderator directly asked for their opinions, with former Texas Gov. Rick Perry disparaging him for \"using his celebrity rather than his conservatism,\" and businesswoman Carly Fiorina challenging him to define his governing principles. \nOther than that, however, the lone bit of genuine infighting during the debate came from Jindal. After delicately sidestepping an opportunity to criticize fellow candidate and Ohio Gov. John Kasich by name for taking federal money for Medicaid expansion, he came out swinging against former Florida Gov. Jeb Bush, whom he said was advocating for Republicans to \"hide our conservative principles to get the left and the media to like us.\" \n(Fiorina also took on Bush after the debate, telling Bloomberg that the former governor’s comments on women's health issues were \"foolish.\") \nBut the rest of the Republicans, who will be debating later Thursday night, weren’t mentioned at all in the early debate. While Perry mentioned a few of his fellow low-polling candidates by name, he was mostly complimentary: He cited Lindsey Graham's hawkishness on Iran, suggested Fiorina might replace John Kerry as secretary of state, and, of course, lauded his own jobs record in the third person. \nThe final tally of how often each politician was directly mentioned by a candidate during Thursday’s early debate, per the transcript : \nBarack Obama or Obamacare: 20 Hillary Clinton: 14 ", "external_links": [], "published": "2015-08-07T04:14:00.000+03:00", "crawled": "2015-08-07T04:14:59.287+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}