{"organizations": [], "uuid": "f11c870681ba30312dd569c7b19a588615e03ae5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55bbf8a71700002600566455.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/index.xml", "section_title": "Latino Voices - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/immigration-bernie-sanders-gop-talking-points_55bbf39be4b06363d5a2572a", "country": "US", "title": "Immigration Activists Accuse Bernie Sanders Of Using GOP Talking Points", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Immigration Activists Accuse Bernie Sanders Of Using GOP Talking Points", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T02:57:00.000+03:00", "replies_count": 0, "uuid": "f11c870681ba30312dd569c7b19a588615e03ae5"}, "author": "Elise Foley", "url": "http://www.huffingtonpost.com/entry/immigration-bernie-sanders-gop-talking-points_55bbf39be4b06363d5a2572a", "ord_in_thread": 0, "title": "Immigration Activists Accuse Bernie Sanders Of Using GOP Talking Points", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration Activists Accuse Bernie Sanders Of Using GOP Talking Points But advocates don't dispute Sanders' commitment to comprehensive reform. Elise Foley Immigration & Politics Reporter, The Huffington Post Daniel Marans Reporter, The Huffington Post Posted: 07/31/2015 07:57 PM EDT | Edited: 1 hour ago Alex Wong via Getty Images \nWASHINGTON -- When Sen. Bernie Sanders (I-Vt.) said this week that he opposes open borders -- more a hypothetical than an actual policy proposal -- no one was shocked. The Democratic presidential candidate supported comprehensive immigration reform in 2013 and favors a path to citizenship for undocumented immigrants, but he's long been skeptical of guest worker programs and other legal immigration that could squeeze out American workers. \nSome immigration advocates, however, said they were surprised Sanders quickly went from talking about open borders to saying he doesn't want immigrants to take American jobs. \nSanders has insisted he was speaking about open borders, something no candidate is pushing, but also repeated his concern that businesses want to bring foreign workers to the U.S. to take American jobs. \n\"Those are the talking points that Republicans use to drive a wedge between Latinos and the African-American vote, saying, 'They're coming to take your jobs.' That at its core does not resonate and does not set him apart from the Republican Party,\" said Greisa Martinez, advocacy coordinator for United We Dream, a group led by undocumented immigrants who came to the U.S. as children. \nSanders' immigration policy stances are generally in step with advocacy groups. But as he struggles to win over minority voters, his tone matters. Some advocates said they have concerns that his opposition to new immigrant workers disrespects immigrants as a whole. \nFWD.us, the Mark Zuckerberg-backed group that advocates for immigration reform, was the first organization to criticize Sanders for his remarks to Vox. Todd Schulte, the group's executive director, wrote Wednesday that Sanders \"falsely pits immigrants as an obstacle to tackling unemployment.\" He called that view \"troubling,\" and noted that studies have found immigration boosts the economy. \nSanders often says giving undocumented immigrants legal status would aid the economy, but his comments on new immigrants tend to hinge more on the idea of Americans losing their jobs -- to the chagrin of some advocates. \n\"There's just overwhelming information about how immigrants contribute to our economy and to our communities, and that's something that should be part of the conversation instead of the frame of mind that immigrants can take jobs, which is incorrect,\" said Lizet Ocampo, associate director for immigration at the Center for American Progress, which has analyzed economic benefits of immigration reform . Immigration activists, seen here protesting deportations, have been critical of Sen. Bernie Sanders' recent comments on immigration. | SAUL LOEB via Getty Images \nSanders' skepticism about expanding legal immigration, particularly guest worker programs, reflects a broader tension within the immigrant rights movement that long separated organized labor and allies like Sanders from other center-left and business community stakeholders. In 2007, Sanders and labor allies in the Senate voted against a bipartisan immigration reform bill , which they said expanded guest worker programs without adequate protections for American workers. \nMore recently, the labor-backed wing of the reform movement has found ways to overcome its misgivings about increasing guest worker programs for the sake of passing comprehensive immigration reform. Sanders joined major labor unions in lending support to increases in the guest worker program as part of the 2013 comprehensive immigration bill in exchange for promises of new protections against exploitation. Sanders also secured $1.5 billion for youth job training. \nTo many observers, Sanders’ 2013 vote shows current differences are matters of tone, not substance. \n“Abstractly,” Sanders, like organized labor, “would prefer no guest worker programs,” said Harley Shaiken, an organized labor expert at the University of California, Berkeley. “They have shown a willingness to accept some kind of guest worker programs as the price of admission to comprehensive reform, meaning the participation of the business community.” \nDaniel Costa, director of immigration law and policy research at the Economic Policy Institute, said Sanders’ remarks reflect a divide -- not among progressive reform advocates, but between progressives and business-backed groups like FWD.us. He called the FWD.us criticism of Sanders “hyperbole” aimed at silencing questions about guest worker programs pushed by big business. FWD.us founder Mark Zuckerberg also is founder and CEO of Facebook, which Costa notes lobbied Congress for a larger, more lenient H-1B visa guest worker program in 2013. \n“The corporate view of immigration has had a public relations victory,” Costa said. “They have tied immigration reform with what they want, which is expanded and deregulated guest worker programs. There is a left view and a more corporate view that is being mistaken for the left view sometimes.” \nCosta noted that other reform groups share Sanders’ concerns and support attempts to insure protections against exploitation of foreign workers, but have sometimes disagreed about how much to compromise in order to achieve comprehensive reform. \nFrank Sharry, executive director of the immigration advocacy group America's Voice, said Sanders is part of a spectrum on the pro-immigration reform side, which ranges from those who think legal immigration is good to keep up with the labor market, to those who say it could hurt American jobs. AFL-CIO president Richard Trumka (L) and Sanders (R) share a moment at an April rally. Sanders' skepticism of guest worker programs is shared by organized labor with which he has close ties. | Win McNamee via Getty Images \nBut in the end, they agree on the need for comprehensive immigration reform. \nThe 2013 comprehensive immigration reform bill that Sanders supported \"had a pretty significant expansion of legal immigration,\"Sharry said. \"So to call him some troglodyte who doesn't get it and wants to keep them all out -- that's just not true.\" \nNeither United We Dream nor FWD.us discounted Sanders as an ally, even as they questioned his recent comments. \n\"We're thankful for the senator's support for the bill in 2013, but we want to make sure that we are laying the foundation for success in the future, and really hope that moving forward -- to be a strong ally -- he will reconsider his debunked falsehoods about immigrants taking jobs from Americans and depressing wages,\" FWD.us’s Schulte said in an email on Friday. \nThe AFL-CIO wouldn't comment directly on Sanders’ remarks, instead emphasizing its commitment to comprehensive immigration reform. Sanders and the other major Democratic presidential candidates, as well as Republican hopeful Mike Huckabee, spoke to top organized labor officials at the AFL-CIO’s executive council meeting earlier this week in an attempt to win the labor federation’s endorsement. \n\"The AFL-CIO’s position on the need for comprehensive immigration reform with a path to citizenship is clear,\" Amaya Smith, a spokeswoman for the AFL-CIO, said in an email. \"The AFL-CIO has been talking to various presidential candidates on issues important to working families. We’ll be evaluating candidates in the future on a host of issues that are part of the Raising Wages agenda.\"  11 Ways Immigration Reform Helps The Economy of", "external_links": [], "published": "2015-08-01T02:57:00.000+03:00", "crawled": "2015-08-01T04:11:30.904+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}