{"organizations": ["GOP"], "uuid": "c6c89f499dfbfee93d8e8c857f6cf3c689be16fa", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150803170559-obama-economy-620xa.jpg", "site_section": "", "section_title": "", "url": "http://money.cnn.com/2015/08/06/news/economy/republican-debate-obama-economy/index.html", "country": "", "title": "The Obama economy has problems. Does the GOP have answers? - Aug. 6, 2015", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "The Obama economy has problems. Does the GOP have answers? - Aug. 6, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T22:28:00.000+03:00", "replies_count": 0, "uuid": "c6c89f499dfbfee93d8e8c857f6cf3c689be16fa"}, "author": "", "url": "http://money.cnn.com/2015/08/06/news/economy/republican-debate-obama-economy/index.html", "ord_in_thread": 0, "title": "The Obama economy has problems. Does the GOP have answers? - Aug. 6, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "High on the Republican presidential candidates' list of talking points is the Obama economy. Specifically, bashing it. \nThey have some grist to work with. \nEven though the economy is way ahead of where it was four years ago,Americans aren't happy. Half of the country flat out disapproves of how the president is handling the economy, according to recent Wall Street Journal/NBC poll . \nEven more alarming is the return of pessimism. Take a look at Gallup's U.S. Economic Confidence Index . It's measured weekly, and the first August reading is negative -- the lowest since last October. The jitters are back. \nAmericans don't feel good about their pocketbooks, yet the campaigns don't seem to get it yet. \nRelated: Look out, Trump. Bush and Christie vow to double economic growth \nGloomy outlook: This isn't 2008. America is no longer in the Great Recession. People aren't losing their homes like they were, and a lot of people have jobs again. That's why unemployment fallen to 5.3% -- not far from what economists say is normal. \nThe problem now isn't that the economy is at a dead stop. It's that it's walking instead of sprinting. Too many people don't feel that they can get ahead. They are working again, but they feel stuck -- and they think their children will be even worse off. Nearly two-thirds of Americans surveyed by Pew Research believe kids today will grow up to be in poorer financial shape than their parents. \nTo steal Paul Krugman's term from 1990s, it feels like we're in the \"Age of Diminished Expectations.\" \nThe big issues: To understand real people economics now, look at three factors. \n1) People aren't earning more than they did in 1995 \nFamily incomes -- what data crunchers call \"household incomes\" -- in the United States are the same now as they were in 1995 after you adjust for inflation. That means that the typical family isn't really any better off now than 20 years ago, despite having jobs. It goes to the heart of why there's so much interest in the minimum wage and inequality issues in this election. \n2) Too many part-time jobs \nYes unemployment has fallen a lot since President Obama took office, but America has a \" hidden unemployment \" problem. Over 6.5 million people work part-time jobs but want full-time jobs. That's much higher than the roughly 4.5 million part-timers before the Great Recession began. \nThe best \"minimum wage\" increase of all would be to get a lot of these part-time workers back to full-time employment -- and the salaries and benefits that often come with it. Part-time workers are five times more likely to live in poverty than their full-time peers. \n3) People aren't buying things \nAmericans have a reputation for being big spenders, yet the numbers show they are still in a Recession Hangover and aren't spending like they once did. That's a real problem since the U.S. economy is based about 70% on consumption (aka people buying things). It reflects how people are nervous about the future. The annual savings rate, now over 5% , is significantly higher than the pre-recession norm of around 3%, according to the Federal Reserve. \nEconomists kept thinking spending would pick up, especially with gas prices so low . But it's not happening, another sign of the deeper fears. \nNo, it's not a terrible economy anymore. The U.S. is growing again (better than Europe and Japan ). But the feeling on both sides of the political aisle -- and certainly on Main Street -- is we can do better. \nEven on Wall Street and at the Federal Reserve, the experts were predicting much stronger growth in 2015 (near 3% for GDP this year) than what's turning out to be the case. (It's more like 2% to 2.5%). \nRelated: America's Act II: Will the economy come back? \nWhat candidates must do \nPart of the reason Donald Trump is doing well is because his campaign slogan -- \"Make America Great Again\" -- is shaping up to be 2016's version of Barack Obama's \"Hope.\" It has connotations of a better future on a lot of levels, but especially for your pocketbook. It also doesn't hurt that he's run some successful businesses and presents a vision of making it in America. \nIn the early days of the 2016 campaign trail, candidates were trying to show regular Americans that they \"got it\" on economics. They had struggled financially too. Marco Rubio had to raid his retirement funds in order to pay for home repairs and Hillary Clinton still pays a mortgage on her house. \nBut that's starting to feel too much like a 2008 or 2012 approach. It's not just about candidates \"getting it,\" it's about having ideas on how to get America really going again. \nSo far, those details have been light, as you might expect at this stage. Chris Christie did put out a 5-point economic plan. It's only four pages long , but is probably the most in depth proposal to come out yet. Trump doesn't even have an \"issues\" section on his website. \nThe Obama economy has problems. Now the GOP needs answers. CNNMoney (New York) August 6, 2015: 2:34 PM ET ", "external_links": [], "published": "2015-08-06T22:28:00.000+03:00", "crawled": "2015-08-06T22:28:44.384+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}