{"organizations": [], "uuid": "bd70ee1db62d76d935aa97b2767e13e2e8e88e3b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c422a31d00006e0014421e.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/marco-rubio-says-he-doesnt-support-abortion-exceptions-he-backed-2-years-ago_55c40397e4b0923c12bc5f8c", "country": "", "title": "Marco Rubio Claims He Doesn't Support The Abortion Exceptions He Backed 2 Years Ago", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Marco Rubio Claims He Doesn't Support The Abortion Exceptions He Backed 2 Years Ago", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T09:41:00.000+03:00", "replies_count": 0, "uuid": "bd70ee1db62d76d935aa97b2767e13e2e8e88e3b"}, "author": "", "url": "http://www.huffingtonpost.com/entry/marco-rubio-says-he-doesnt-support-abortion-exceptions-he-backed-2-years-ago_55c40397e4b0923c12bc5f8c", "ord_in_thread": 0, "title": "Marco Rubio Claims He Doesn't Support The Abortion Exceptions He Backed 2 Years Ago", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marco Rubio", "Samantha Lachman", "Rubio"], "text": "Email Marco Rubio Claims He Doesn't Support The Abortion Exceptions He Backed 2 Years Ago In 2013, Rubio co-sponsored an abortion ban with exceptions for rape, incest and saving the life of the mother. Samantha Lachman Staff Reporter, The Huffington Post Posted: 08/06/2015 11:18 PM EDT | Edited: 3 hours ago \nWASHINGTON -- Florida Sen. Marco Rubio attempted during Thursday's Republican presidential debate to deny his past support for exceptions to proposed bans on abortion. \n\"You favor a rape and incest exception to abortion bans,\" moderator Megyn Kelly said. \"If you believe that life begins at conception, as you say you do, how do you justify ending a life just because it begins violently, through no fault of the baby?\" \n\"Well, Megyn, first of all, I'm not sure that's a correct assessment of my record,\" Rubio said. \"I have never said that, and I have never advocated that. What I have advocated is that we pass a law in this country that says all human life, at every stage of its development, is worthy of protection. And in fact I think that law already exists. It's called the Constitution of the United States.\" \nHowever, though Rubio may not have \"advocated\" for exceptions, his record on the issue is more nuanced than his answer suggested: The senator co-sponsored a 2013 bill that would have banned abortions after 20 weeks of pregnancy with exceptions for survivors of rape and incest, as well as mothers whose lives were at risk. \nLast month, Rubio attended the National Right to Life convention, where he similarly failed to mention his support for the 2013 bill. This, along with his answer to Kelly's question, suggests that the senator has shifted to more conservative rhetoric, likely in order to appeal to social conservatives in the Republican primary. \nJust 19 percent of Americans believe that abortion should be illegal in all circumstances, according to Gallup . \nFor more GOP debate coverage, visit our liveblog . ", "external_links": [], "published": "2015-08-07T09:41:00.000+03:00", "crawled": "2015-08-07T09:41:21.335+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}