{"organizations": [], "uuid": "6f3b122e4b82214e4be576dddc197d8fb7034865", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/082815_fff_katrina_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/08/30/obama-to-rename-mt-mckinley-to-denali-during-alaska-trip-that-focuses-on/", "country": "US", "title": "Obama to rename Mt. McKinley to 'Denali' during Alaska trip that focuses on climate change", "performance_score": 6, "site": "foxnews.com", "participants_count": 25, "title_full": "Obama to rename Mt. McKinley to 'Denali' during Alaska trip that focuses on climate change | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T03:00:00.000+03:00", "replies_count": 29, "uuid": "993062d3e13fecb5d45c2a23efa736bfb2bb9913"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/08/30/obama-to-rename-mt-mckinley-to-denali-during-alaska-trip-that-focuses-on/#post-0", "ord_in_thread": 0, "title": "Obama to rename Mt. McKinley to 'Denali' during Alaska trip that focuses on climate change", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 30, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print\nPresident Obama is restoring the name of the tallest North American mountain peak -- Mt. McKinley in Alaska -- to the native Alaskan name of “Denali,” the White House said Sunday.\nThe official renaming is expected to come during Obama’s trip this week to Alaska where he will try to garner support for ways to slow climate change. However, the state economy is heavily dependent on the oil industry.\nIn 1896, a prospector in the mountains of central Alaska named the range after William McKinley upon learning that he had been nominated as a candidate for U.S. president.\nMcKinley became the country’s 25th president and was assassinated six months into his second term. The 20,000-foot-tall peak had been previously known as Denali -- generally believed to be central to the Athabascan tribe's creation story and the site of significant cultural importance to many Alaska natives, according to the White House.\nDenali also is an Athabascan word meaning \"the high one\" and is widely used across the state today, according to the White House.\nThe president will stay in Alaska through Wednesday and while there will attend a State Department-sponsored meeting on climate change, titled GLACIER/Global Leadership in the Arctic Conference.\nThe conference will bring together foreign ministers of Arctic nations and key non-Arctic states with scientists, policymakers and stakeholders from Alaska and the Arctic, the White House said.\n“The Arctic is warming twice as fast as the rest of the world and is experiencing the consequences,” the White House also said Sunday.\nSupporters of the global warming theory say those changes include higher average temperatures and less winter sea ice, which is allowing for heavy storm surges that the sea ice once kept at bay, the White House said.\nOn Monday, Obama is scheduled to meet with leaders from the Alaska native community along with Gov. Bill Walker, Lt. Governor Byron Mallott and Sen. Lisa Murkowski to discuss ways to strengthen cooperation between the federal government and Alaska native tribes. Among the issues scheduled to be discussed is management strategies for fish and wildlife.\n\"I’d like to thank the president for working with us to achieve this significant change to show honor, respect and gratitude to the Athabascan people of Alaska,” said Murkowski, a Republican.\nThe White House also said the official change is the final step in a process that started in 1975 in Alaska and cited the Interior Department's authority to change the name.\nThere have been several efforts by Alaska politicians to change the peak's name to Denali. But politicians from McKinley's home state of Ohio have opposed the change.\nThe Associated Press contributed to this story.", "external_links": [], "published": "2015-08-30T03:00:00.000+03:00", "crawled": "2015-08-31T01:54:19.755+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}