{"organizations": [], "uuid": "0e0c558b575a22e84f513d15ff68927accdb1b5b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55a93c591300002b0093a2a3.jpeg?cache=xdIbeLqbvX", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/fake-ids-anti-abortion-activists_55bbbcc2e4b0b23e3ce2b0af", "country": "", "title": "Here Are The Fake IDs Anti-Abortion Activists Used To Film Planned Parenthood", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Here Are The Fake IDs Anti-Abortion Activists Used To Film Planned Parenthood", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T01:26:00.000+03:00", "replies_count": 0, "uuid": "0e0c558b575a22e84f513d15ff68927accdb1b5b"}, "author": "", "url": "http://www.huffingtonpost.com/entry/fake-ids-anti-abortion-activists_55bbbcc2e4b0b23e3ce2b0af", "ord_in_thread": 0, "title": "Here Are The Fake IDs Anti-Abortion Activists Used To Film Planned Parenthood", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Laura Bassett Laura Bassett"], "text": "Here Are The Fake IDs Anti-Abortion Activists Used To Film Planned Parenthood The group behind the videos is facing at least two lawsuits. Laura Bassett Laura Bassett, Senior Politics Reporter, The Huffington Post Posted: 07/31/2015 05:04 PM EDT | Edited: 1 hour ago \nThe anti-abortion activists who gained access to highly sensitive areas of Planned Parenthood clinics and other related organizations over the past three years are facing at least two lawsuits after they allegedly used fake identification cards and created a fake company in order to film their targets without consent. \nPlanned Parenthood and the National Abortion Federation claim that David Daleiden, the founder of Center for Medical Progress, used a fake ID displaying the name \"Robert Daoud Sarkis\" to circumvent their security precautions and gain access to the groups' annual meetings and facilities. \nThe CMP has released four videos so far -- and claims to have many more on the way -- that show Planned Parenthood doctors discussing reimbursement costs for the donation of fetal parts for medical research. In the first video, a woman, who is yet to be identified, can be heard speaking to Planned Parenthood doctor Deborah Nucatola. That woman apparently used a fake ID with the name \"Susan Sarah Tennenbaum.\" Via Planned Parenthood of the Gulf Coast Via Planned Parenthood of the Gulf Coast \nDemocrats in Congress asked California Attorney General Kamala Harris (D) to look into whether the Center for Medical Progress violated any laws in its deceptive investigation, and a Los Angeles judge issued a temporary injunction against the group on Thursday that bars it from releasing at least one undercover video the public has not yet seen. \nThe National Abortion Federation filed suit against the anti-abortion group in federal court on Friday, asking that it be temporarily barred from releasing any more videos they may have \"illegally obtained\" using the fake IDs at NAF events. \n\"In order to circumvent the very necessary security precautions NAF has in place, CMP engaged in a long-running illegal conspiracy,\" the group said in a statement. \"They set up a fake company and sent fake employees of that company with fake identities to misrepresent themselves and gain access to NAF’s annual meetings and member facilities that provide abortion care. They signed agreements with NAF that prohibited the activities they have engaged in, obviously with no intention of honoring those agreements.\" \nThe Huffington Post reported that the anti-abortion group may have also illegally deceived the IRS by applying for tax-exempt status as a biomedicine charity. \nDaleiden told CNN on Friday that his group has done nothing illegal and will fight any attempts to silence it. \"The Center for Medical Progress follows all applicable laws in the course of our investigative journalism work, and we're of course ready to contest any infringement or attempt to suppress or silence our free speech rights and our rights under the First Amendment to publish,\" he said. \nDaleiden claims the videos his group has released prove that Planned Parenthood sells fetal parts after abortions. Planned Parenthood insists it is donating, not selling, fetal tissue; it does not profit from those donations in any way beyond recouping costs; and its actions are legal. \nPlanned Parenthood has not joined the lawsuit against the anti-abortion group, but a spokesman for the family planning provider said Friday that it supports NAF's legal action \"to hold the perpetrators of these multiple frauds accountable.\" \n\"This was not journalism -- this was part of a conspiracy to harass and intimidate Planned Parenthood, our patients, and all abortion providers determined to provide compassionate and quality care every day,\" said Dawn Laguens, executive vice president of Planned Parenthood. ", "external_links": [], "published": "2015-08-01T01:26:00.000+03:00", "crawled": "2015-08-01T01:26:20.759+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}