{"organizations": [], "uuid": "4e5cd70d1e1ee1d9135b8550004a0a5d009dd480", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c0dc1b1400002f002e1e29.jpeg?cache=SJNHw20bgQ", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/news.xml", "section_title": "WorldPost News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/jeb-bush-immigration-latino-groups_55c0d8abe4b06363d5a37c31", "country": "US", "title": "Jeb Bush Immigration Proposal Falls Flat With Many Latino Groups", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Jeb Bush Immigration Proposal Falls Flat With Many Latino Groups", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T20:18:00.000+03:00", "replies_count": 0, "uuid": "4e5cd70d1e1ee1d9135b8550004a0a5d009dd480"}, "author": "Roque Planas", "url": "http://www.huffingtonpost.com/entry/jeb-bush-immigration-latino-groups_55c0d8abe4b06363d5a37c31", "ord_in_thread": 0, "title": "Jeb Bush Immigration Proposal Falls Flat With Many Latino Groups", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jeb Bush Immigration Proposal Falls Flat With Many Latino Groups Hispanic conservatives, on the other hand, contend that Bush is building consensus. Roque Planas Reporter, Latino Voices, The Huffington Post Posted: 08/04/2015 01:18 PM EDT \nMany Latino groups and immigrant rights activists found little to like in a six-point immigration proposal released by former Florida Gov. Jeb Bush (R) on Monday, ahead of the Republican presidential candidates' forum in New Hampshire. \nThough Bush prefaces his proposal with a nod toward enacting a rigorous process to allow undocumented immigrants to achieve “legal status,” all of the six points refer to either ramping up border security or interior enforcement of immigration law. \nThe bullet points offer a ringing endorsement of the conservative agenda on immigration. The proposal calls for multiplying the Border Patrol’s forward operating bases, expanding the use of surveillance technology on the border and deporting more people who overstay visas. \nHis plan also calls for cracking down on sanctuary cities like New York and San Francisco, which have more lenient policies toward undocumented immigrants, by withholding federal law enforcement funds unless they enact more hard-line policies. Conservatives have decried such policies in the wake of the death of Kathryn Steinle allegedly at the hands of an undocumented immigrant in San Francisco. \nBush has played up his ties to the Latino community in his home state of Florida, which boasts a large Hispanic population. He highlights his marriage to Mexican-born Columba on his campaign website, speaks fluent Spanish and has discussed one of his son’s encounters with racism . Many Latino groups aren't fond of the immigration proposal released by GOP presidential candidate Jeb Bush. | Credit: Jim Cole/Associated Press \nBut Matt Barreto, the co-founder and managing partner of the pollster Latino Decisions, said Bush’s immigration plan would likely fall flat with most Latino voters, who overwhelming support immigration reform with a pathway to citizenship. \n“Jeb Bush's latest immigration plan seems to focus entirely on so-called border security with very little detail on how and when he would address undocumented immigrants already living in the U.S.,” Barreto said in an email to HuffPost. “This will be a major source of tension with Latino voters. In our previous polling, only 13 percent of Latino voters agreed with Bush that legal status should be contingent on border security. Instead, 81 percent of Latino voters said legal status for immigrants should start right away, alongside any border security measures.” \nSome progressives, such as Executive Director of Presente Action Arturo Carmona, deride what they see as a lopsided proposal that caters primarily to hard-liners. \n“The only thing he’s offering is border militarization and interior enforcement,” Carmona said. “Donald Trump says that Latinos and Mexicans are rapists and murderers, but his solution is to build a border wall. Bush is essentially espousing the same policies based on border enforcement -- he’s just doing it with different language.” \nThe deputy vice president of the National Council of La Raza, Clarissa Martinez, likened the problem of immigration reform to a stool with three legs: enforcement, the legal immigration system and addressing undocumented people already living here. \n“Right now, Bush’s proposal pretty much only deals with one leg of the stool,” Martinez told HuffPost. “We were hoping to see more. This proposal is incomplete and we’re hoping to see the other parts of it.” \nThe emphasis on border security also clashes with the consistent decline in illegal crossings over the U.S.-Mexico border and the doubling of Border Patrol agents over President Barack Obama’s terms in office, Martinez added, noting that Bush’s outlook in that regard reflected that of much of the U.S. Congress. Apprehensions for illegally crossing the border stood at 487,000 last year -- less than a third of the 1.7 million apprehensions in 2000. Immigrant detainees walk through the Immigration and Customs Enforcement detention facility on Feb. 28, 2013, in Florence, Arizona. Many Latino groups and immigrant rights organizations criticized Jeb Bush's immigration proposal for failing to address in detail the status of undocumented people living in the country. | Credit: John Moore/Getty Images \nOthers, however, view Bush’s proposal as strategic. Alfonso Aguilar, the executive director of the Latino Partnership at the American Principles Project and the chief of the U.S. Office of Citizenship during the George W. Bush administration, said the only way immigration reform will pass is if advocates address conservative demands to ramp up border security. \n“What a lot of immigration advocates don’t appreciate is that in order to pass immigration reform, you have to work with conservative Republicans in Congress,” Aguilar told HuffPost. “Bush understands that he’s in a Republican primary. He’s articulating a plan at this time in the political process that addresses the concerns of the conservative base ... This is how you build consensus.” \nFor Juan Hernández -- a co-founder of the Hispanic Republicans of Texas, who said his comments reflect his personal views rather than the organization’s -- the most important part of Bush’s immigration proposal is that it comes from someone who understands the issue on a personal level and is willing to compromise. \n“In that discussion of immigration, we’re talking about our friends and family members,” Hernández told HuffPost. “And a harsh attitude is not one we’re willing to consider. Bush comes with his heart first and then talks about how we can realistically -- in the 21st century, after Sept. 11, with the Congress that we have -- pass a law.” \nTo many undocumented immigrants, Bush’s proposal strikes an even more personal note. Juan Escalante, a 26-year-old immigrant rights activist who lives in Tallahassee, Florida, and is undocumented, said when he evaluates candidates' views on immigration, he tries to imagine how his mother would respond. \n“If my mother saw this, her first question would be, ‘When can I get in line? How can I apply to relief?’” Escalante told The Huffington Post. “If I showed this to her, she’s not going to have an answer to that. That’s just the honest truth … At the end of the day, it’s essentially an immigration enforcement plan.”", "external_links": [], "published": "2015-08-04T20:18:00.000+03:00", "crawled": "2015-08-04T20:55:27.206+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}