{"organizations": [], "uuid": "e668d11e683936b405ce0eb58d895c9b19942614", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55b6c1db1400002f002e0ff4.jpeg", "site_section": "http://www.huffingtonpost.com/tag/war-on-drugs/feed", "section_title": "War on Drugs on Huffington Post", "url": "http://www.huffingtonpost.com/entry/bernard-noble-marijuana_55b6b838e4b0074ba5a5e160?kvcommref=mostpopular", "country": "US", "title": "This Man Is Serving More Than 13 Years In Prison For Two Joints' Worth Of Marijuana", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "This Man Is Serving More Than 13 Years In Prison For Two Joints' Worth Of Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:01:00.000+03:00", "replies_count": 0, "uuid": "e668d11e683936b405ce0eb58d895c9b19942614"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/bernard-noble-marijuana_55b6b838e4b0074ba5a5e160?kvcommref=mostpopular", "ord_in_thread": 0, "title": "This Man Is Serving More Than 13 Years In Prison For Two Joints' Worth Of Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "10 Email This Man Is Serving More Than 13 Years In Prison For Two Joints' Worth Of Marijuana \"We live in a world where people who are living in disadvantaged environments face challenges and situations that seem to never turn out as they do for people in more privileged and un-challenged neighborhoods.\" Matt Ferner National Reporter, The Huffington Post Posted: 08/14/2015 12:01 AM EDT | Edited: 1 hour ago Bernard Noble, before being sentenced to more than 13 years in prison, appears in this photo with his daughter. | Bernard Noble \nThis summer, Louisiana Gov. Bobby Jindal (R) signed a bill that significantly decreases criminal penalties for marijuana possession in the state. But for some prisoners already serving time on marijuana charges, the state's old draconian drug laws continue to apply. \nTake the case of Bernard Noble. A 49-year-old father of seven, Noble is serving more than 13 years behind bars in Jackson Parish Correctional Center in Jonesboro. His crime: being caught with the equivalent of two joints' worth of marijuana in 2010. He has no chance of parole. The state Board of Pardons and Parole rejected Noble's petition for clemency in May simply because he hasn’t served 10 or more years in prison yet -- state law requires inmates to have been in custody of the Department of Corrections for a minimum of 10 years before they’ll consider an inmate’s application for clemency. \nNoble has seven prior convictions on his record, stretching back to 1989. All are convictions for possession of small amounts of drugs, mostly marijuana but two for cocaine, and all are nonviolent. Four are misdemeanors, but three are felonies. The state used two of the felony charges -- 1991 and 2003 convictions for possession of small amounts of cocaine and marijuana -- in their branding of Noble as a \"habitual offender\" under Louisiana law. That allowed them to sentence him to the maximum of 13 years and three months, no parole. \nAt first, Noble was sentenced to five years in prison. But the Orleans Parish District Attorney’s office, headed by Leon Cannizzaro, appealed that ruling and took the case all the way to the state Supreme Court, which ultimately decided to give Noble the maximum possible sentence. \nHad Louisiana's new law reducing penalties for marijuana possession been in effect in 2010, Noble would have had to serve between about 16 months and four years -- even under the state's habitual offender law. \nNow Noble has few options left. This is his story. \nWhat was your life like growing up? \nI grew up in a poor area of Carrolton called “Gert Town” in a single parent home. I had to take on many of the responsibilities in raising my siblings, while she [my mother] worked full-time and part-time jobs. Dressing them for school, homework, etc. Laundry duties were only one of many. I would use grocery store baskets from the local A&P and pile the clothes so high that I had to sit my brother or sister on the top of the laundry, to keep and hold them down, then carefully guide it to the laundromat. \nWhen did you start using drugs? \nIn 1987, burdened by all the pressures of raising my brother and sisters with all the chores, I didn’t have a normal teenage life. At 19 I began to use crack cocaine, finding comfort in staying high. As I got older it was more rebellious than anything. I never was in any gangs or serious criminal activities, my friend and I bought drugs through odd jobs and he had a full-time job. \nYou lost your home in 2005 due to Katrina. Can you talk about losing your home, and what that did to you and your family? \nIt was very devastating, as it was for people all over New Orleans. [I was] in a house with my children’s mother, and she was pregnant. Surviving and helping them stay calm in all that destruction was difficult. I had to provide food, and at the same time find a way out of the city which was being blocked by the Kenner Police. But I found a way to sneak my family and I in my vehicle and get out. We were naked in the house trying to stay cool. \nWhat happened after Katrina, where did you move? \nWe ended up in Houston, Texas, in a football stadium for shelter. Upon meeting a man who offered us to go to Missouri, we decided we had lost it all and accepted, so we relocated to Missouri. \nWhat was your dream professionally? What kind of work were you hoping to do around the time of your 2010 arrest? \nI wanted to own my own company, and I was thinking of transportation or some sort of driving profession. So I enrolled in school for driving and got a certified CDL license. I was established in towing and opened a New Orleans-style restaurant specializing in New Orleans cuisine. \nWhat kind of work had you been involved in in your adult life? What was your last job when you were arrested? \nIn my adult life early on at 21 clean and sober, I worked in a venetian blinds company, cook, janitor, laborer, and drove commercial vehicles for various companies, also sanitation and sewage department, mail package delivery company, automotive/towing, airport shuttle, bus company and medical services delivery company, and janitorial company was a business I opened. My last job was the restaurant and sweet shop upon arrest. I was in New Orleans to buy hot sausage and meet a vendor for French bread to be used at my restaurant. I was with two other men visiting my father at his radio shop when we were stopped. \nCan you recount what happened in 2010 on the day of your arrest? How did it happen? What did the police say was the reason they stopped you? \nYes. Visiting New Orleans and my father at his shop, he was installing TVs in the headrest for the kids to watch videos. I was going also to visit my mother while there, and as mentioned before buy hot sausage and French bread for my restaurant. \nI was walking looking for my father’s workers around the corner from his shop. Upon finding them and returning to the shop, I was riding a bicycle with the other two men walking beside me. Suddenly, five cars of police swung the corner and one of the men with me threw a small bag of marijuana. The officers stopped us about 10 feet from where he threw it, and the officers after searching found it. They gave no reason for the stop then, under oath they said that my reaction to them pulling up seemed suspicious. I actually was moving out of the way of the police car, to them I was said to have seemed nervous. I was the only one charged with possession of marijuana. There were others around also. \nWere you shocked when DA Cannizzaro appealed your original five-year sentence for a 13-year sentence? \nTotally shocked and in \"awe,\" especially after two judges felt the same way! \nHad you been given the opportunity to get treatment, do you think you could have avoided prison altogether? Had you ever tried treatment in the past? \nYes. But in my case I was in the neighborhood to visit my father’s shop and someone threw the marijuana. It’s a poor neighborhood, and unfortunately poor neighborhoods are in high-crime areas. As poor people, we are forced to live in such places and work in them. Police patrol and stop aggressively. I have never been in drug treatment. Bernard Noble responded to HuffPost's interview questions in a handwritten six-page letter. | Credit: Bernard Noble \nCan you describe the feelings of not being able to see your children grow up? Not being able to provide for your family while in prison? \nThis has been a very draining and crippling experience as a father, and as someone who has had to be relied upon by my children and siblings, I feel I have let them down. Missing these five years with my children feels as if my life has stopped because I’m helpless to provide and lead my family. I feel my life is passing by because I can never get back the time I lost. \nHow has this affected your children? Are they old enough to have an understanding about what has happened to their father? \nWell, my oldest daughter feels and expresses her concern for her younger siblings without me for guidance. They may even see someone else as their father figure because my relationship of 13 years with their mother ended. Two of my children have different challenges in life, which require special needs. They have autism and rheumatoid arthritis. \nHow old are your children? \nMy oldest in 24, and oldest boy is 22, my youngest son is 8 with autism. Then I have the 13-year-old girl with rheumatoid arthritis and three remaining girls 12, 10 and 7. Seven children total. \nAre you married or do you have a committed partner you’re with? \nNever been married, and I’m not comfortable speaking about the relationship I lost. \nDo you feel like this is a fair punishment for an adult who has used such small amounts of drugs recreationally? \nI believe that the judicial system with so many more serious severe and harsh crimes being committed in New Orleans, they should never use the taxpayer’s money and \"real concerns\" to recklessly punish anyone in this manner for the crime in which I’m being punished for. It should shock the conscience and fairness of the system. Bernard Noble explains what he'd say to Louisiana Gov. Bobby Jindal if he could ask for clemency. | Credit: Bernard Noble \nWhat would you say to Bobby Jindal, if you had the opportunity, to convince him to grant you clemency? \nI’m not perfect, not many of us are, and I have had my challenges in life. But we live in a country where we would like to believe that all life is precious, and to destroy a life and take someone’s freedom for 13 years for a tiny amount of marijuana is so overkill. I have no violent past. And I have always tried to better myself striving in my accomplishments, as it should show in all I’ve did. I have dedicated my life to raising my children even in overpayment of child support by $10,000 dollars. I take full responsibility for my actions. If granted clemency I will strive harder than ever to live in such a way that represents honesty, integrity and transparency, while operating and developing my nonprofit organization -- The Noble Cause Foundation, to work with formerly incarcerated parents to re-enter society as productive members of society. The pain I have caused with my incarceration to my family is the cross I bear, and I pray that I be allowed to enter back into society. \nCan you describe your day in prison? From the moment you wake up to the moment you go to sleep. \nAs for waking up. I barely rest in the sense of true rest. But my day starts with taking medication around 5 a.m., then breakfast if you call it that; most times I don’t eat it. Then I’m locked back up to eat for lunch (12:00 noon) and dinner (5:00 p.m.). I try to pass my time reading the Bible and other spiritual material. I shower late in the evening, then retire to my bunk to dream about freedom, suffering! \nWhat do you miss the most about freedom? \nBeing a father and a productive citizen, providing for my family and our life, feeling good about a honest day's pay for an honest living … life having purpose. \nWhat do you want to do with your life when you get out? \nBesides reopen my restaurant business, as I have mentioned. I will start my nonprofit organization -- The Noble Cause Foundation -- helping incarcerated parents re-enter society to be productive. \nWhat would you say to other young men in similar positions as you were at the time of your arrest? \nWhat can one say -- we live in a world where people who are living in disadvantaged environments face challenges and situations that seem to never turn out as they do for people in more privileged and un-challenged neighborhoods, they do not have to react to over-zealous officers preying on anyone and everyone who leaves the house, grocery store or friend’s residence. They can feel free to enjoy life without that what I faced in 2010. So what can I say? Pray! \nDo you blame anyone specifically for your current circumstances? \nYes I do. I believe that this sort of prosecuting does not reflect the public’s interest in having people's punishment fit the crime, and that this sort of thing flies in the face of justice. Our DA’s office has been used historically to bully, force and put away people for too long for periods of time that do not reflect correction, rehabilitation, transparency, fairness and the equal protection in which the Constitution provides when it concerns people less esteemed ... so yes, I blame the district attorney’s office as a whole -- check the record for decades dating back far as the '70s. That office’s goal and desire, is to win! How can a level-thinking fair individual at some point does not come to see that what has been done is a miscarriage of justice! Bernard Noble shared what he missed most about life outside prison. | Credit: Bernard Noble \n*** \nChristopher S. Bowman, assistant DA at the Orleans Parish District Attorney's Office, categorically denied Noble's allegations about his office to HuffPost. He asked to have his comments published in full: \nMr. Noble has at least four felony convictions as well as countless arrests for possession of a firearm by a convicted felon, multiple domestic violence arrests, and possession with the intent to distribute cocaine. Until the most recent conviction, Mr. Noble was the beneficiary of suspended sentences and house arrest. In fact, a judge following one conviction gave Mr. Noble a one day sentence because the law no longer allowed a suspended sentence as a result of his criminal record. Mr. Noble was offered a reasonable plea agreement but refused it because it would have required an actual prison sentence. This DA's office very much believes in rehabilitation, but Mr. Noble is a sad example of someone who squandered countless opportunities to receive that rehabilitation in a non custodial environment. \nThe picture Bowman paints of Noble isn't necessarily relevant to the facts of his case that the court considered when it handed down his current sentence, Noble's attorney, Jee Park, told HuffPost. \nNoble's other felony, a second arrest from 1999 for being in possession of a small amount of marijuana, was not used against him because of the way Louisiana law handles second-time marijuana convictions. \nWith regard to the charge of possession of a firearm by a felon, Noble was found not guilty at trial, Park said. \nThere were no convictions for domestic violence or distribution of cocaine in Noble's record provided to HuffPost by the Orleans Public Defenders Office. That means that Noble may have been arrested at some point on suspicion of those charges, but he was not convicted of those alleged crimes. \n\"I don't understand how Bernard is a sad example of someone who has squandered his opportunities,\" Park said. \"If anything, he is someone who has pulled himself up on his own bootstraps from his incredibly neglectful and impoverished childhood, who finished high school and held steady, gainful employment ever since he was able to do so.\" \nAlso On HuffPost: 27 Reasons Why U.S. Shouldn't Lead The War On Drugs of", "external_links": [], "published": "2015-08-14T03:01:00.000+03:00", "crawled": "2015-08-14T09:12:22.340+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}