{"organizations": ["U.N.", "Associated Press", "GOP", "House", "Facebook", "Twitter", "Fox News Report"], "uuid": "b78f119320aca5ba93fc9b3c6e6b7190901dd614", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/feeds/Associated%20Press/2015/08/20/0/0/866c75c3309f91257f0f6a70670070a8.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2015/08/20/report-on-secret-iran-side-deal-angers-gop-but-pelosi-pledges-house-dems-will/", "country": "", "title": "Report on secret Iran side deal angers GOP but Pelosi pledges House Dems will back up Obama | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Report on secret Iran side deal angers GOP but Pelosi pledges House Dems will back up Obama | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T21:34:00.000+03:00", "replies_count": 0, "uuid": "b78f119320aca5ba93fc9b3c6e6b7190901dd614"}, "author": "", "url": "http://www.foxnews.com/us/2015/08/20/report-on-secret-iran-side-deal-angers-gop-but-pelosi-pledges-house-dems-will/", "ord_in_thread": 0, "title": "Report on secret Iran side deal angers GOP but Pelosi pledges House Dems will back up Obama | Fox News", "locations": ["Iran", "Lebanon", "Beirut"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pelosi", "Mohammad Javad Zarif", "Hussein", "Obama"], "text": "Report on secret Iran side deal angers GOP but Pelosi pledges House Dems will back up Obama Published August 20, 2015 Facebook 0 Twitter 0 Email Print FILE - A Wednesday, Aug. 12, 2015 photo from files showing Iranian Foreign Minister Mohammad Javad Zarif, during a press conference at the Lebanese foreign ministry in Beirut, Lebanon. An unusual secret agreement with a U.N. agency will allow Iran to use its own experts to inspect a site allegedly used to develop nuclear arms, according to a document seen by The Associated Press. (AP Photo/Bilal Hussein, File) (The Associated Press) \nWASHINGTON – Republican opposition to President Barack Obama's nuclear deal is flaring over revelations of a secret side agreement involving Iranian inspections. But House Democrats are shrugging off the report and claiming they have the votes to back up Obama. \nThe Associated Press reported Wednesday on a previously undisclosed side deal between Iran and the U.N.'s International Atomic Energy Agency that would allow Tehran to use its own inspectors to investigate a site it has been accused of using to develop nuclear arms. \nThe revelation, based on a document seen by the AP, newly riled Republican lawmakers who have been severely critical of the broader agreement to limit Iran's future nuclear programs, signed by the Obama administration, Iran and five world powers in July. The critics have complained that the wider deal is unwisely built on trust of the Iranians, while the administration has insisted it depends on reliable inspections. \n\"President Obama boasts his deal includes 'unprecedented verification.' He claims it's not built on trust,\" said House Speaker John Boehner, R-Ohio. \"But the administration's briefings on these side deals have been totally insufficient — and it still isn't clear whether anyone at the White House has seen the final documents.\" \nSaid House Foreign Affairs Committee Chairman Ed Royce, R-Calif.: \"International inspections should be done by international inspectors. Period.\" \nBut in an interview with the AP, House Democratic leader Nancy Pelosi questioned the significance of the disclosure, noting it relates to investigations of past military work, not nuclear dealings going forward. \"I truly believe in this agreement,\" she said. \nAnd the California Democrat asserted that House Democrats have the votes to uphold any Obama veto of a congressional resolution disapproving of the Iran agreement. Congress will vote next month on such a resolution, but if it is approved Obama has pledged to veto it. A two-thirds vote in the House and Senate would then be necessary to override him — a tough goal to reach even in a Congress controlled by Republicans who will likely oppose Obama unanimously. \n\"The president's veto would be sustained\" if the vote were held today, Pelosi said, adding she hopes it doesn't get to that point. \"But I feel very confident about it. ... We will sustain the veto.\" \nIAEA Director General Yukiya Amano issued a statement Thursday saying he was disturbed that the AP report \"suggested\" that the IAEA has given responsibility for nuclear inspections to Iran. \nWhile noting the side deal is confidential, \"I can state that the arrangements are technically sound and consistent with our long-established practices. They do not compromise our safeguards standards in any way,\" Amano said. \nBehrouz Kamalvandi, spokesman of Iran's nuclear agency was quoted on state TV calling the AP report \"media speculation\" without denying its substance. \nThe document seen by the AP is a draft that one official familiar with its contents said doesn't differ substantially from the final version. He demanded anonymity because he isn't authorized to discuss the issue. \nIt is labeled \"separate arrangement II,\" indicating there is another confidential agreement between Iran and the IAEA governing the agency's probe of the nuclear weapons allegations. \nThe document suggests that instead of carrying out their own probe, IAEA staff will monitor Iranian personnel as they inspect the Parchin nuclear site. \nIran will provide agency experts with photos and videos of locations the IAEA says are linked to the alleged weapons work, \"taking into account military concerns.\" \nThat wording suggests that — beyond being barred from physically visiting the site — the agency won't get photo or video information from areas Iran says are off-limits because they have military significance. \nIAEA experts would normally take environmental samples for evidence of any weapons development work, but the agreement stipulates that Iranian technicians will do the sampling. \nThe sampling is also limited to only seven samples inside the building where the experiments allegedly took place. Additional ones will be allowed only outside of the Parchin site, in an area still to be determined. \n\"Activities will be carried out using Iran's authenticated equipment consistent with technical specifications provided by the agency,\" the agreement says. While the document says that the IAEA \"will ensure the technical authenticity\" of Iran's inspection, it does not say how. \nThe draft is unsigned but the signatory for Iran is listed as Ali Hoseini Tash, deputy secretary of the Supreme National Security Council for Strategic Affairs instead of an official of Iran's nuclear agency. That reflects the significance Tehran attaches to the agreement. \nIran has refused access to Parchin for years and has denied any interest in — or work on — nuclear weapons. Based on U.S., Israeli and other intelligence and its own research, the IAEA suspects that the Islamic Republic may have experimented with high-explosive detonators for nuclear arms at that military facility and other weapons-related work elsewhere. \nThe IAEA has repeatedly cited evidence, based on satellite images, of possible attempts to sanitize the site since the alleged work stopped more than a decade ago. \nWith the Capitol empty of lawmakers and staff with Congress on its annual six-week summer recess, it was difficult to gauge whether the new disclosure on the side deal would affect Democratic support. \nIn the hours after the side deal became public two more Democratic senators — Joe Donnelly of Indiana and Ed Markey of Massachusetts — announced their support for the deal. That brought the total of Democratic senators supporting it to 25, with just two opposed. \nThe liberal group Americans United for Change also announced plans Thursday for a $500,000 ad campaign supporting the deal in a half-dozen cities with large Jewish populations, countering concerted opposition from the American Israel Public Affairs Committee and other groups. \nThe newly disclosed side agreement, for an investigation of the Parchin nuclear site, was worked out between the IAEA and Iran. The United States and the five other world powers were not party to it but were briefed by the IAEA and endorsed it as part of the larger package. \nWhite House National Security Council spokesman Ned Price said the Obama administration was \"confident in the agency's technical plans for investigating the possible military dimensions of Iran's former program. ... The IAEA has separately developed the most robust inspection regime ever peacefully negotiated.\" \n___ ", "external_links": [], "published": "2015-08-20T21:34:00.000+03:00", "crawled": "2015-08-20T21:35:03.597+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}