{"organizations": [], "uuid": "493096e1af3eada1f10f902dfe598529486fb8c8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/081015_an_kt_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/08/11/obama-signed-off-on-irans-right-to-nuclear-program-in-secret-2011-talks/", "country": "US", "title": "Obama signed off on Iran’s right to nuclear program in secret 2011 talks", "performance_score": 4, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama signed off on Iran’s right to nuclear program in secret 2011 talks | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "493096e1af3eada1f10f902dfe598529486fb8c8"}, "author": "Adam Kredo", "url": "http://www.foxnews.com/politics/2015/08/11/obama-signed-off-on-irans-right-to-nuclear-program-in-secret-2011-talks/", "ord_in_thread": 0, "title": "Obama signed off on Iran’s right to nuclear program in secret 2011 talks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Adam Kredo\nPublished August 11, 2015 Washington Free Beacon Facebook 0 Twitter 0 Email Print\nPresident Barack Obama approved of Iran’s right to operate a nuclear program in 2011 during secret meetings with Iranian officials, according to new disclosures by Iran’s Supreme Leader.\nThe comments, made earlier this year by Ali Khamenei, dispute claims by the Obama administration that it only began talking to Iran after the election of President Hassan Rouhani.\nKhamenei revealed in a recent speech that talks began in secret with anti-Semitic, Holocaust denying former President Mahmoud Ahmadenejad. At this time, Obama told the Iranians he endorses Iran’s right to have a nuclear program.\n“The issue of negotiating with the Americans is related to the term of the previous [Ahmadinejad] government, and to the dispatching of a mediator to Tehran to request talks,” Khamenei said in a recent speech translated by the Middle East Media Research Institute (MEMRI).\n“At the time, a respected regional figure came to me as a mediator and explicitly said that U.S. President [Obama] had asked him to come to Tehran and present an American request for negotiations,” Khamenei disclosed. “The Americans told this mediator: ‘We want to solve the nuclear issue and lift sanctions within six months, while recognizing Iran as a nuclear power.’”\n“I told that mediator that I did not trust the Americans and their words, but after he insisted, I agreed to reexamine this topic, and negotiations began,” Khamenei added.\nClick for more from The Washington Free Beacon.\nAdvertisement\nTrending in Politics 1 House members' trip to Israel allows Netanyahu to press case against Iran nuclear deal 2 Obama signed off on Iran’s right to nuclear program in secret 2011 talks 3 White House aide arrested after allegedly shooting gun at boyfriend 4 Fox News host Megyn Kelly addresses Trump 'dustup' 5 US intervenes in lawsuit over Palestinian terror attacks See all Trends Advertisement", "external_links": ["http://freebeacon.com/national-security/obama-signed-off-on-irans-right-to-nuclear-program-in-2011/"], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-11T21:01:44.273+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}