{"organizations": [], "uuid": "15ccd9edb6be6844b4a412039633f7cfb1ec5929", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150804160906-barack-obama-benjamin-netanyahu-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_meast.rss", "section_title": "CNN.com - Middle East", "url": "http://edition.cnn.com/2015/08/04/politics/netanyahu-obama-iran-deal-jewish-groups/index.html", "country": "US", "title": "Obama tries to reassure American Jewish leaders on Iran CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Obama tries to reassure American Jewish leaders on Iran - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T10:58:00.000+03:00", "replies_count": 0, "uuid": "15ccd9edb6be6844b4a412039633f7cfb1ec5929"}, "author": "Kevin Liptak", "url": "http://edition.cnn.com/2015/08/04/politics/netanyahu-obama-iran-deal-jewish-groups/index.html", "ord_in_thread": 0, "title": "Obama tries to reassure American Jewish leaders on Iran CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights President Obama personally lobbied Jewish American groups to support the Iran deal during an afternoon White House meeting. Israeli Prime Minister Netanyahu claimed the nuclear agreement \"gives Iran two paths to the bomb\" in a webcast with Jewish leaders. Washington (CNN) President Barack Obama tried to persuade American Jewish leaders to back his recent nuclear deal with Iran at a Tuesday White House meeting that was at times contentious, according to participants.\n\"It's my birthday and I'm going to be blunt,\" Obama told the group of 22 Jewish leaders who gathered in the Cabinet Room on his 54th birthday, according to one attendee. The President \"meticulously\" made his case for loosening sanctions on Tehran in exchange for stricter inspections of potential nuclear sites, the person said.\nObama's appeal came as Israeli Prime Minister Benjamin Netanyahu, who vigorously opposes the deal, made his own pitch to American Jews via webcast earlier in the day.\nBoth sides are trying to win the support of Jewish voters as lawmakers decide whether to back the deal ahead of a vote on the issue in mid-September. Several key Democratic senators announced their support for the deal ahead of the White House event, but other senior House Democrats indicated their opposition.\nThe White House session -- described by attendees as \"serious\" and \"cordial\" but at times \"contentious\" -- lasted more than two hours. Vice President Joe Biden, who the White House has dispatched to sell the deal to lawmakers, also attended. Participating groups included the Anti-Defamation League, Orthodox Union and J Street.\nREAD: Washington battle rages over Iran deal's fate\nThe most intense moment during the early evening session came when several of the Jewish leaders confronted Obama on his recent comments that opposing the Iran deal is tantamount to supporting war with Iran.\nThe leaders said Obama's language could be damaging to the American Jewish community -- and made a direct appeal that the debate over the Iran nuclear accord not be framed that way.\nObama responded that he was mindful and sensitive to those concerns but underlined that he truly believes if the deal is struck down, war could be in short order.\nJewish leaders who attended said the President repeatedly rejected the notion that a better deal could be had, and he warned that if the agreement fails, Iran could obtain a nuclear bomb in months.\n\"He really stuck to his guns and challenged people on that\" notion of a better deal, a source at the meeting said.\nObama, another attendee said, was the \"most passionate I've ever seen him.\"\nAs part of the administration's push, Obama will also deliver remarks at American University in Washington on Wednesday detailing the advantages of pursuing diplomacy with Iran.\nA White House official said Obama would \"frame the congressional decision about whether to block the implementation of a deal that prevents Iran from getting a nuclear weapon as the most consequential foreign policy debate since the decision to go to war in Iraq.\"\n\"He will make the case that this should not even be a close call -- this deal has the most comprehensive inspections and transparency regime that we've ever negotiated, verifiably cuts off all of Iran's pathways to a bomb, and includes a permanent prohibition on Iran obtaining a nuclear weapon,\" the official said.\n\"He will point out that the same people who supported war in Iraq are opposing diplomacy with Iran, and that it would be an historic mistake to squander this opportunity -- removing constraints on the Iranian program, unraveling the sanctions regime, and damaging American credibility,\" the official continued.\nJUST WATCHED Anger in Israel over Iran nuclear deal Replay More Videos ... MUST WATCH\nAnger in Israel over Iran nuclear deal 02:43 PLAY VIDEO In his own speech Tuesday, Netanyahu repeated his dire warnings that the deal would imperil Israel and the wider Middle East.\n\"The nuclear deal with Iran doesn't block Iran's path to the bomb, it actually paves Iran's path to the bomb,\" Netanyahu said in his presentation, which was sponsored by the Jewish Federations of North America and the Conference of Presidents of Major American Jewish Organizations and broadcast to synagogues and community centers around the country.\nThe deal, Netanyahu claimed, \"gives Iran two paths to the bomb: Iran can get to the bomb by keeping the deal, or Iran could get to the bomb by violating the deal.\"\nThe White House indicated Tuesday that Obama's session with Jewish leaders was not arranged specifically to rebut Netanyahu.\n\"The Prime Minister has ample opportunity to make clear what his views are and he has taken advantage of that opportunity,\" Press Secretary Josh Earnest said. \"The President believes it is in the national security interests of our closest ally in the region, Israel, to prevent Iran from obtaining a nuclear weapons through diplomacy.\"\nHowever, the administration did use its Twitter account dedicated to the deal to post live \"fact checks\" during Netanyahu's address. One read, \"FACT: Walking away from the Iran deal pushes Iran closer to a nuke and sparks a regional arms race.\"\nThe White House also used another social media site, Medium, to post the text from the Iran nuclear deal, and on Monday night briefed visiting Israel journalists.\nThe outreach suggests the White House sees responding to Israel's criticism as pivotal to winning votes on Capitol Hill.\nThe pressure has ratcheted up this week as Congress heads into its August recess, with several key senators coming out in favor of the deal and several House members saying they oppose it.\nAt the same time, House Republicans unveiled a resolution to block the President's nuclear deal, which -- if it passes and gets enough support to override a veto -- would effectively kill the international deal.\nDemocratic Sen. Tim Kaine of Virginia, Sen. Bill Nelson of Florida and Sen. Barbara Boxer of California officially endorsed the agreement on Thursday, a welcome development for the White House as it continues its full-court press in the face of what appears to be virtually unanimous GOP opposition.\nBut several Democratic House members, who are Jewish themselves and represent heavily Jewish constituencies, also came out against the agreement.\nNew York Rep. Steve Israel, chairman of the Democratic Policy and Communications Committee, New York Rep. Nita Lowey, ranking member of the House Appropriations Committee, and Florida Rep. Ted Deutch, ranking member of the House Foreign Affairs Middle East subcommittee, all said they wouldn't support the deal.\nMeanwhile, Democratic Rep. Andre Carson of Indiana, who is on the intelligence committee, announced his support.\nJUST WATCHED Sen. Schumer: I won't be pressured on Iran nuclear deal Replay More Videos ... MUST WATCH\nSen. Schumer: I won't be pressured on Iran nuclear deal 01:23 PLAY VIDEO However, many key Democrats -- notably, New York Sen. Chuck Schumer, who is poised to become the Democratic leader in the next session of Congress -- have not yet announced which way they will vote.\nThe administration is hoping the latest public endorsements by Democratic senators give it momentum going into Congress' summer recess, when opponents are vowing to ramp up pressure on members in their districts.\nDemocrats who haven't announced their position are being pressured the most. Among them, House Minority Whip Steny Hoyer of Maryland is traveling this week with a group of Democratic members to Israel, where they will hear Israeli officials' concerns directly.\nAnother key leader, Senate Minority Leader Harry Reid of Nevada, is also declining to say how he will vote, noting Tuesday that he doesn't have to decide until next month.\nReid's reluctance to officially weigh in may be an effort to give some space to Schumer, who is perhaps the most pivotal of the remaining undecided Democrats and faces enormous pressure as the most senior Jewish member in leadership.\nSchumer told reporters on Tuesday that he is still studying the deal and repeated his mantra that, \"I'm not going to let pressure or politics or party influence my decision.\"\nBoth chambers need to vote by Sept. 17, and Republicans, who control both the House and Senate, already say they have the votes to pass a resolution of disapproval.\nThe president has vowed to veto it, so the critical vote will be on overriding his veto. If every Republican supports the override, 44 Democrats in the House and 13 in the Senate would be needed to block it.\nWhen pressed on whether he thought there would be enough Democrats voting to uphold the deal, Reid said, \"I don't know. Time will only tell.\"\nIllinois Sen. Dick Durbin, the No. 2 Senate Democrat, who supports the nuclear agreement and is counting votes, refused to give out numbers but said things look \"positive.\"\nREAD: GOP candidates grill U.S. officials at Iran hearing\nSeveral undecided Democrats tell CNN they intend to take most if not all of the entire 60 days they have under a legislated review period to make up their minds.\nMany with vocal constituent groups on both sides said they don't see any incentive to come out publicly until they digest all of the information. They also want to see whether Iranian leaders make any additional comments about their commitment to implementing the deal.\nSenate Majority Leader Mitch McConnell said he hoped there would be \"a thorough, thoughtful and respectful debate\" in September. He told reporters he wanted to set aside time for each senator to make a speech on the deal and said he hoped that all senators would listen from their seats on the floor and suspend any committee business during the debate.\nIn anticipation of the vote, many Jewish groups, led by the powerful American Israel Public Affairs Committee, are lobbying against the deal, pouring millions of dollars into ad campaigns claiming the plan threatens Israel's safety.\nAIPAC and its affiliates are planning to spend upwards of $20 million on the effort, much of it aimed at lawmakers on the fence.\nOn the other side, the dovish J Street released a new TV ad Tuesday in support of the deal, part of a $5 million advocacy campaign.\nAs part of the administration's pushback, Obama will also deliver remarks at American University in Washington on Wednesday detailing the advantages of pursuing diplomacy with Iran.\nThe White House has drawn a comparison to a 1963 commencement speech delivered by President John F. Kennedy at the same institution, in which he advocated for diplomatic talks with the Soviet Union.\nCORRECTION: An earlier version of this story incorrectly referred to New York Rep. Steve Israel as the chairman of the Democratic Congressional Campaign Committee. He has left that position and is now the chairman of the Democratic Policy and Communications Committee.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-super-169.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-small-169.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150714104848-netanyahu-iran-nuclear-deal-reaction-00003719-large-169.jpg"], "published": "2015-08-06T10:58:00.000+03:00", "crawled": "2015-08-06T13:17:46.104+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}