{"organizations": ["Iran", "Castros", "Congress"], "uuid": "7790bdc711291f3e8e4b4d02c7331d256ba732cc", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150807084945-marco-rubio-abortion-faith-cuomo-newday-00001520-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/08/14/politics/marco-rubio-cuba-iran-speech/index.html?eref=rss_politics", "country": "US", "title": "Rubio slams Obama on day of embassy re-opening", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Rubio slams Obama on day of embassy re-opening", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T16:24:00.000+03:00", "replies_count": 0, "uuid": "7790bdc711291f3e8e4b4d02c7331d256ba732cc"}, "author": "", "url": "http://edition.cnn.com/2015/08/14/politics/marco-rubio-cuba-iran-speech/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Rubio slams Obama on day of embassy re-opening", "locations": ["Iran", "Cuba", "America", "New York", "U.S.", "Wisconsin", "Florida", "Middle East", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marco Rubio", "Barack Obama", "Kerry", "Scott Walker", "John Kerry", "Obama", "Rubio"], "text": "Marco Rubio: Life begins at conception 04:22 (CNN) Republican candidate Marco Rubio, the son of Cuban immigrants, blasted President Barack Obama and Secretary of State John Kerry on Friday for restoring ties with Cuba and seeking a nuclear deal with Iran. \"I would like to focus my remarks today on these two dangerous developments with Iran and Cuba, as I believe they represent the convergence of nearly every flawed strategic, moral, and economic notion that has driven President Obama's foreign policy, and as such are emblematic of so many of the crises he has worsened around the world,\" Rubio said in New York at the Foreign Policy Initiative. Rubio, a Florida senator, said he would welcome dissidents from Iran, Cuba, China and \"freedom fighters from around the world\" to be guests at his inauguration, should he win the 2016 battle for the White House. Rubio's speech comes the same day that Kerry is in Cuba, celebrating the reopening of the U.S. embassy there. It also comes as Obama is pushing Congress to approve a deal with Iran -- Republicans, like Rubio, are united in their opposition to the deal, but have been seeking Democratic support. RELATED: Kerry to reopen embassy in Cuba, but tensions remain If elected president, Rubio said he would begin the process of ending any Iran deal approved by the Obama administration. \"I will undertake a three-part plan to roll back President Obama's deal with Iran and repair the damage done to America's standing in the Middle East,\" Rubio said. It is a move not quite as stark as others, like Wisconsin Gov. Scott Walker, who have said they would simply revoke the deal outright on their first day in office. Rubio also said he would roll back the diplomatic deal struck to renew ties with Cuba. \"I will give the Castros a choice: either continue repressing your people and lose the diplomatic relations and benefits provided by President Obama, or carry out meaningful political and human rights reforms and receive increased U.S. trade, investment, and support,\" Rubio said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-08-14T16:24:00.000+03:00", "crawled": "2015-08-14T16:42:22.750+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}