{"organizations": [], "uuid": "061dcd8062cfce24d8ddc86987f6095232e7b358", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/Obama_Alaska.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/politics/2015/08/29/in-alaska-obama-to-ask-for-action-against-climate-change-in-state-dependent-on/", "country": "US", "title": "In Alaska, Obama to ask for action against climate change in state dependent on oil", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "In Alaska, Obama to ask for action against climate change in state dependent on oil | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "061dcd8062cfce24d8ddc86987f6095232e7b358"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/08/29/in-alaska-obama-to-ask-for-action-against-climate-change-in-state-dependent-on/", "ord_in_thread": 0, "title": "In Alaska, Obama to ask for action against climate change in state dependent on oil", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print FILE: July 30, 2014: Margerie Glacier, part of Alaska's Glacier Bay National Park. Alaska.  (AP) \nWith melting glaciers and rising seas as his backdrop, President Barack Obama will visit Alaska next week to press for urgent global action to combat climate change, even as he carefully calibrates his message in a state heavily dependent on oil.\nObama will become the first sitting president to visit the Alaska Arctic when he travels to Kotzebue -- population around 3,000 -- just north of the Arctic Circle at the end of his three-day trip. He'll kick off the visit Monday with a speech to a State Department-hosted conference on climate change and the Arctic.\nThe unambiguous goal of the president's trip is to use dramatic and alarming changes to Alaska's climate to instill fresh urgency into his global warming agenda. Sea ice is melting, critical permafrost is thawing and Alaska's cherished glaciers are liquefying -- powerful visuals that Obama hopes will illustrate the threat to natural wonders and livelihoods and serve as a global call to action.\n\"This is all real,\" Obama said in his weekly address released Saturday. \"This is happening to our fellow Americans right now.\"\nYet Obama has taken steps that show he's cautiously navigating the competing environmental and energy interests at play. A few weeks ago, his administration gave Royal Dutch Shell a final permit to drill into oil-bearing rock off Alaska's northwest coast for the first time in more than two decades.\n\"The president has made great strides in protecting the Arctic, but we are really disappointed with this decision,\" said Nicole Whittington-Evans, Alaska director for The Wilderness Society. \"This is a point where we disagree.\"\nFor many Alaskans, though, the issue comes down to dollars and cents. Both the state government and its residents rely deeply on oil revenues to stay afloat, and falling oil prices have already created a serious budget deficit.\nBrian Deese, Obama's senior adviser, sought to strike a balance between Alaska's economics needs and the president's goal to eventually phase out fossil fuels. \"That's a transition that is not going to happen overnight,\" Deese said. In the meantime, he added, \"oil and gas will remain important parts of our overall energy mix.\"\nAhead of Obama's visit, state Republican leaders emphasized the need for more energy development and urged Obama not to exploit the state's stunning scenery for political purposes. Sen. Dan Sullivan warned that any national or ocean monument designations \"will go over like a lead balloon\" among Alaska's Democrats and Republicans alike.\n\"What there's concern about is that he's going to use Alaska as some green screen for climate change, when he doesn't take the opportunity to dig into other issues that are important to Alaskans, important to the country,\" Sullivan said in an interview.\nObama has been investing time on an unfinished global climate treaty that nations hope to finalize in December, as he works to secure his environmental legacy before his presidency ends. The president has pledged a U.S. cut in greenhouse gas emissions of up to 28 percent by 2030, compared to 2005 levels, and plans to use the Alaska visit to build public pressure on other nations to commit to similarly ambitious measures.\nAfter arriving in Anchorage on Monday afternoon, Obama plans to meet with Alaska Natives before addressing the Arctic climate resilience summit, dubbed GLACIER, which involves Arctic and non-Arctic leaders, scientists, environmental advocates and the energy industry. Secretary of State John Kerry, a key player in the climate treaty talks, also plans to speak.\nIn an unusual presidential photo-op, Obama will travel Tuesday to Seward, on Alaska's Kenai Peninsula, where the Exit Glacier is retreating in what environmentalists say is a dramatic sign of warming temperatures. After hiking to the glacier, Obama is to board a U.S. Coast Guard vessel to tour Kenai Fjords National Park.\nHis visit continues Wednesday in Dillingham, in southwest Alaska, where Obama will meet with fishermen locked in an ongoing conflict with miners over plans to build a massive gold and copper mine in Bristol Bay, home to the world's largest salmon fishery. Then he'll fly north to Kotzebue, a regional hub in the Alaska Arctic, where Obama will focus on the plight of rural, native villages where livelihoods are threatened by encroaching climate change.\nWhile in Alaska, Obama is likely to face calls from Democrats and environmentalists to restrict Arctic drilling and to renew his request to Congress to make more of the Arctic National Wildlife Refuge, or ANWR, off-limits as well. Republicans and energy advocates planned to urge the president to clear the way for more drilling.\nAside from brief campaign stops, few presidents have spent significant time in Alaska. President Warren Harding, shortly before his death in 1923, toured nine Alaska communities in three parts of the state.", "external_links": [], "published": "2015-08-29T03:00:00.000+03:00", "crawled": "2015-08-29T22:30:21.623+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}