{"organizations": [], "uuid": "3f4b3dd6d509f10981d09f271b3ba2c37614cf6a", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/081915_anr_henry_640.jpg", "site_section": "http://www.foxnews.com/fns/", "section_title": "Fox News Sunday with Chris Wallace | Fox News", "url": "http://www.foxnews.com/politics/2015/08/19/clinton-hit-for-breaking-with-obama-on-arctic-drilling-staying-mum-on-keystone/", "country": "US", "title": "Clinton hit for breaking with Obama on Arctic drilling, staying mum on Keystone", "performance_score": 4, "site": "foxnews.com", "participants_count": 14, "title_full": "Clinton hit for breaking with Obama on Arctic drilling, staying mum on Keystone | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 17, "uuid": "48c620d4e4a75db376d0f2ca00d0c24030944aee"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/08/19/clinton-hit-for-breaking-with-obama-on-arctic-drilling-staying-mum-on-keystone/#post-0", "ord_in_thread": 0, "title": "Clinton hit for breaking with Obama on Arctic drilling, staying mum on Keystone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 19, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print\nHillary Clinton is taking heat from Republicans for breaking with the Obama administration on Arctic drilling while continuing to hedge on her position on the Keystone XL Pipeline.\nThe Democratic presidential front-runner weighed in on the Arctic issue Tuesday, after an administration agency approved the final permit Royal Dutch Shell needs to drill in the Arctic Ocean off Alaska's northwest coast for the first time in more than two decades.\nClinton tweeted:\nThe Arctic is a unique treasure. Given what we know, it's not worth the risk of drilling. -H\n— Hillary Clinton (@HillaryClinton) August 18, 2015\nIt did not go unnoticed that the former secretary of state still hasn't said whether she backs the controversial Canada-to-Texas Keystone pipeline.\nNew Jersey Gov. Chris Christie, a GOP presidential candidate, fired back on Clinton's Twitter feed:\n. @HillaryClinton Still waiting to hear your position on Keystone... #AnswerTheQuestion\n— Chris Christie (@ChrisChristie) August 18, 2015\n2016 candidate and former Florida Gov. Jeb Bush also weighed in:\n. @HillaryClinton Wrong. Being more-anti energy than Obama is extreme. We should embrace energy revolution to lower prices & create US jobs.\n— Jeb Bush (@JebBush) August 18, 2015\nClinton addressed the two issues during a press conference in Las Vegas on Tuesday. Asked why she doesn't take a stance on Keystone given her public position on Arctic drilling, she said the two situations are not the same, given her personal involvement in Keystone deliberations.\nClinton previously has said she will \"refrain from commenting\" on Keystone because of her role in getting the review process started as secretary of state.\nOn Tuesday, though, she did urge the administration to move toward a decision and hinted she could eventually make her personal views known.\n\"I am getting impatient, because I feel that at some point a decision needs to be made,\" Clinton said. \"And I'm not comfortable saying, you know, 'I have to keep my opinion to myself' given the fact that I was involved in it. So at some point I may change my view on that.\"\nThe pipeline, while widely supported by Republicans, is a contentious issue for Democrats and has pitted labor groups that support it against environmental groups that oppose it.\nThe State Department has the lead role in reviewing the pipeline because it crosses the Canada-U.S. border. Under a George W. Bush-era executive order, oil pipelines crossing U.S. borders require a presidential permit.\nBut a recent Associated Press review found that since 2004, the federal government has taken an average of 478 days to give a yes or no to all other applications -- less than a year and a half. By contrast, the company hoping to build Keystone has been waiting for a decision for nearly seven years -- or more than five times the average.\nMeanwhile, the permit Clinton voiced concern about in the Arctic was issued Monday by the Bureau of Safety and Environmental Enforcement. The bureau approved the permit to drill below the ocean floor after the oil giant brought in a required piece of equipment to stop a possible well blowout.\nThe agency previously allowed Shell to begin drilling only the top sections of two wells in the Chukchi Sea because the key equipment, called a capping stack, was stuck on a vessel that needed repair in Portland, Oregon.\nBecause the vessel arrived last week, Shell is free to drill into oil-bearing rock, estimated at 8,000 feet below the ocean floor, for the first time since its last exploratory well was drilled in 1991.\n\"Activities conducted offshore Alaska are being held to the highest safety, environmental protection, and emergency response standards,\" agency Director Brian Salerno said in a statement Monday.\nEnvironmental groups oppose Arctic offshore drilling, saying industrial activity will harm polar bears, Pacific walrus, ice seals and threatened whales already vulnerable from climate warming and shrinking summer sea ice.\n\"Granting Shell the permit to drill in the Arctic was the wrong decision, and this fight is far from over,\" Sierra Club executive director Michael Brune said in a statement.\nThe Associated Press contributed to this report.", "external_links": ["https://twitter.com/JebBush/status/633660508957245440", "https://twitter.com/hashtag/AnswerTheQuestion?src=hash", "https://twitter.com/HillaryClinton/status/633629814713397249", "https://twitter.com/HillaryClinton", "https://twitter.com/ChrisChristie/status/633664343213780992"], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-19T23:56:48.294+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}