{"organizations": [], "uuid": "426b09a7ad3edcf3d987044e341b46131a826d77", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Cruz%20undo%20Obama%20Latino.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/08/21/campaigning-in-wyoming-ted-cruz-vows-to-rip-to-shreds-iran-accord-obama-legacy/", "country": "IL", "title": "Campaigning in Wyoming, Ted Cruz vows to 'rip to shreds' Iran accord, Obama legacy", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Campaigning in Wyoming, Ted Cruz vows to 'rip to shreds' Iran accord, Obama legacy | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "426b09a7ad3edcf3d987044e341b46131a826d77"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2015/08/21/campaigning-in-wyoming-ted-cruz-vows-to-rip-to-shreds-iran-accord-obama-legacy/", "ord_in_thread": 0, "title": "Campaigning in Wyoming, Ted Cruz vows to 'rip to shreds' Iran accord, Obama legacy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino Republican presidential candidate Ted Cruz speaks to about 150 people at a Wyoming Republican Party fundraiser in a barn on a ranch on the ourskirts of Cheyenne, Wyo., Thursday, Aug. 20, 2015. Cruz promised to undo large portions of President Barack Obama's legacy. (AP Photo/Mead Gruver) \nCheyenne, Wyoming (AP) –   Republican presidential candidate Ted Cruz campaigned at a Wyoming Republican Party fundraiser Thursday with tea-party-flavored promises to undo huge portions of President Barack Obama's legacy, from health care reform to a nuclear agreement with Iran.\nThe junior U.S. senator from Texas passed on the chance to criticize Donald Trump, the billionaire with an early lead over the more than a dozen candidates seeking the Republican nomination.\n\"How fantastic is it that we have so many young, dynamic, charismatic leaders standing up to lead this country,\" Cruz said to applause and an \"amen\" among the 150 or so attending.\nYet Cruz devoted a fair amount of time to Trump's centerpiece issue, illegal immigration. Cruz joked that he would deter Mexicans from entering the country illegally by manning the southern border with thousands of IRS agents.\nCruz first was elected to the Senate in 2012 and quickly established himself as a leader of the tea party faction. He gained notoriety in 2013 for leading an unsuccessful fight to defund the Affordable Care Act that culminated in a partial federal government shutdown.\nSpeaking in Cheyenne, Cruz promised to \"repeal every word\" of Obama's health care reform and replace it with \"personal, portable and affordable\" reform.\nHe said he would end the federal government's efforts to require insurance coverage for contraception regardless of religious beliefs. Cruz also pledged to end environmental regulations that hurt the coal industry -- a message with special significance in the top coal-producing state.\nHe promised to \"rip to shreds\" any nuclear agreement with Iran and urged the crowd to get behind a solidly conservative candidate such as himself.\n\"That is the only way we win,\" Cruz said. \"Every time we nominate Democrat-lite, we lose.\"\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-21T18:54:10.130+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}