{"organizations": [], "uuid": "ff45b1598fbf9a5a4ff6a6b5d8ace7596f487150", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/080315_shep_iran_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/08/05/obama-suffers-key-dem-defection-on-iran-deal-ahead-major-speech/", "country": "US", "title": "Obama invokes Iraq war debate in push for Iran deal, amid Dem defections", "performance_score": 9, "site": "foxnews.com", "participants_count": 23, "title_full": "Obama invokes Iraq war debate in push for Iran deal, amid Dem defections | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:00:00.000+03:00", "replies_count": 24, "uuid": "471ec2d2cbcc9639ad1f3943e63908536cf48e4e"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/08/05/obama-suffers-key-dem-defection-on-iran-deal-ahead-major-speech/#post-0", "ord_in_thread": 0, "title": "Obama invokes Iraq war debate in push for Iran deal, amid Dem defections", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 05, 2015 FoxNews.com livefyre Email Print\nPresident Obama vigorously defended Wednesday his nuclear agreement with Iran as one \"the world unanimously supports,\" reaching back to blame America's invasion of Iraq -- and the overthrow of Saddam Hussein -- for emboldening Iran, while labeling Republican opposition as \"knee-jerk partisanship,\" and Israeli Prime Minister Benjamin Netanyahu's criticism as \"wrong.\"\nSpeaking at American University in Washington, Obama described the congressional debate over the Iran deal as the \"most consequential\" since the Iraq invasion. The president called the agreement a \"very good deal\" that -- despite critics' claims to the contrary -- forbids Iran from building a nuclear weapon.\nIn anticipation of a barrage of advertising against the deal, Obama likened those arguments to the case for war in Iraq more than a decade ago.\n\"Many of the same people who argued for the war in Iraq are now making the case against the Iran nuclear deal,\" Obama said.\nThe stark comparison dovetails with the president's central claim that the alternative to an Iran deal may be war. And his appeal to lawmakers comes as he tries to stem defections from his own party.\nHe spoke after Democratic Rep. Steve Israel, of New York, told Newsday he will oppose the Iran plan. Spokeswoman Caitlin Girouard confirmed his opposition to Fox News.\nMore on this... Support for Iran nuclear agreement waning The defection was a blow to the president as he tries to shore up party support ahead of a vote in Congress expected next month. Israel is policy and communications chairman for House Democrats and the chamber's highest-ranking Jewish Democrat.\nThe backdrop for Obama's speech was meant to link the nuclear accord to a long tradition of American diplomacy, often conducted with unfriendly nations. He spoke at the same university where President John F. Kennedy made a famous call for Cold War diplomacy and nuclear disarmament. His address also coincides with the anniversary of the nuclear test ban treaty, the landmark 1963 agreement Kennedy and leaders from the Soviet Union and Britain finalized shortly after the president's well-known speech.\nAhead of the speech, Senate Majority Leader Mitch McConnell, R-Ky., pointed to \"growing bipartisan concern\" over the deal.\n\"It's widespread and it's well-founded,\" he said, citing recent defections. Republicans unveiled legislation on the House side Tuesday to oppose the deal.\nObama's address is part of an intense summer lobbying campaign by both supporters and opponents of the nuclear deal. Congressional lawmakers will vote next month on a resolution either approving or disapproving of the pact.\nSome key Democratic lawmakers announced their support this week, including Sens. Tim Kaine of Virginia, Barbara Boxer of California and Bill Nelson of Florida.\nHowever, the administration lost the backing of three prominent Jewish Democrats -- Nita Lowey and Florida Rep. Ted Deutch, in addition to Rep. Israel.\n\"In my judgment, sufficient safeguards are not in place to address the risks associated with the agreement,\" Lowey said in a statement. \"... This agreement will leave the international community with limited options in 15 years to prevent nuclear breakout in Iran, which will be an internationally-recognized nuclear threshold state, capable of producing highly enriched uranium.\"\nHouse Republicans already have announced they have the 218 votes lined up to oppose the deal. But, if the Senate also opposes the agreement, both chambers would need to muster a two-thirds majority to override an expected presidential veto. That's where Democratic votes will be critical for both sides of the debate.\nAddressing concerns that the nuclear deal effectively legitimizes Iran's nuclear program and puts it on a path to a bomb, Obama countered that a vote against the deal in Congress \"would not only pave Iran's pathway to a bomb, it would accelerate it.\"\nOn the sidelines of the speech, International Atomic Energy Agency Director General Yukiya Amano was meeting in Washington Wednesday with members of the Senate Foreign Relations Committee.\nObama has presented the choice before lawmakers as one of war and peace. During a private meeting Tuesday with American Jewish leaders, Obama said that if Congress blocks the deal, the only option he or the next president would have for stopping Iran from obtaining a nuclear weapon is military action.\nCritics of the deal, including Israeli Prime Minister Benjamin Netanyahu, say Obama is delegitimizing their concerns and instead painting them as eager for war. In a webcast Tuesday aimed at American Jews, Netanyahu called that argument \"utterly false\" and said Israel wants peace, not war.\nTo Obama, Kennedy's willingness to negotiate with the Soviet Union at the height of the Cold War is a useful comparison for defending his engagement with Iran, a country long at odds with the U.S. and its allies, particularly Israel.\nAmerican University is also where Kennedy's brother, the late Sen. Edward M. Kennedy, endorsed Obama in the 2008 Democratic presidential primary, a significant passing of the political torch from the youthful late president's family to a new generation.\nEven as they link Obama's diplomacy to Kennedy's, White House officials argue that the president's Iran accord has a key advantage over the nuclear test ban treaty. White House Press Secretary Josh Earnest said that while Kennedy had to roll back components of the U.S. nuclear program to strike a deal, Obama made no concessions to Iran that weaken U.S. national security.\nFox News' Rich Edson and The Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Obama suffers key Dem defection on Iran deal ahead of major speech 2 FBI investigating security of Hillary Clinton's private email server 3 Half of Clintons’ charitable giving in 2014 went to their own foundation 4 Krauthammer on Carson: 'He's the tortoise [in the race]' 5 First ObamaCare co-op to fail could cost taxpayers over $140 million ", "external_links": [], "published": "2015-08-05T03:00:00.000+03:00", "crawled": "2015-08-05T20:27:06.024+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}