{"organizations": ["American University Speech On Iran Email Obama Channels JFK", "The Huffington Post Ryan Grim", "American University Speech On Iran", "The Huffington Post"], "uuid": "0c5532409dd867e9cb5602d2250e66929401ba65", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c2377a1700002600566a83.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-channels-jfk-at-american-university-speech-on-iran_55c218fbe4b0138b0bf47e89", "country": "", "title": "Obama Channels JFK At American University Speech On Iran", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Channels JFK At American University Speech On Iran", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T19:22:00.000+03:00", "replies_count": 0, "uuid": "0c5532409dd867e9cb5602d2250e66929401ba65"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-channels-jfk-at-american-university-speech-on-iran_55c218fbe4b0138b0bf47e89", "ord_in_thread": 0, "title": "Obama Channels JFK At American University Speech On Iran", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jessica Schulberg"], "text": "Email Obama Channels JFK At American University Speech On Iran \"We created the time and space to win the cold war without firing a shot at the Soviets.\" Jessica Schulberg Foreign Affairs Reporter, The Huffington Post Ryan Grim Washington bureau chief for The Huffington Post Posted: 08/05/2015 12:20 PM EDT | Edited: 1 minute ago \n\nWASHINGTON -- When President John F. Kennedy ventured to American University in 1963 to deliver a landmark speech on nuclear negotiations with the Soviet Union, he sought to push back on domestic critics who accused him of naivete, of coddling an evil nation bent on destruction, spending heavily on proxy armies destabilizing the globe and undermining U.S. interests. \n\"Some say that it is useless to speak of world peace or world law or world disarmament--and that it will be useless until the leaders of the Soviet Union adopt a more enlightened attitude,\" Kennedy said. \"I hope they do. I believe we can help them do it. But I also believe that we must reexamine our own attitude--as individuals and as a nation--for our attitude is as essential as theirs.\" \nSimilar skeptics warn today that a nuclear deal with Iran is a foolish move as long as it refuses to renounce its support for destabilizing forces in Lebanon and elsewhere around the Middle East, and that it is simply untrustworthy. Led by Sen. Tom Cotton (R-Ark.), opponents of the deal have repeatedly urged military force to be given greater consideration as the answer. \"We do not share interests and values\" with the Iranians,\" Cotten said , \"and any deal not detrimental to the United States interests must be detrimental to Iranian interests.\" \n“Iran is a mortal and unrepentant enemy,” he said, echoing language used about the Soviet Union. \nSpeaking to the class of 1963 -- which included Sen. Bob Byrd -- shortly after the Cuban Missile Crisis, Kennedy implored graduates to re-examine their attitudes towards the Soviet Union and called for a nuclear test ban treaty in his now-famous \"Strategy of Peace,\" speech. \"First: Let us examine our attitude toward peace itself. Too many of us think it is impossible. Too many think it unreal. But that is a dangerous, defeatist belief. It leads to the conclusion that war is inevitable--that mankind is doomed--that we are gripped by forces we cannot control,\" Kennedy said. \"We need not accept that view. Our problems are manmade--therefore, they can be solved by man.\" \nKennedy, of course, was right, and the marshal approach advocated by the era's Tom Cottons was wrong: the U.S. and the U.S.S.R. survived the Cold War without a nuclear war. War was not inevitable. Nuclear negotiations led to a peaceful resolution, despite the trust deficit and proxy wars underway. \nBefore his death, Kennedy tried to go even further. At a May speech in St. Petersburg, Russia given by James Galbraith, the economist and son of Kennedy confidant John Kenneth Galbraith, he revealed Kennedy's plan for the Soviet Union. \"In the fall of 1963, at their last conversation, President Kennedy asked my father if he would consider becoming the Ambassador of the United States to the Soviet Union. Knowing my father's worldview as he did, there can be no doubt about the president’s purpose: he meant to end the Cold War,\" Galbraith said, according to a copy of the remarks he provided to HuffPost. \"But the conversation did not continue; it was cut short at Dallas. And the Cold War dragged on for another 25 years, until two very different leaders, Mikhail Gorbachev and Ronald Reagan, finally brought it to an end. \nObama's address at American University comes 52 years after Kennedy appeared. On Wednesday, Obama invoked parts of Kennedy's Cold War-era message, urging the audience to choose diplomacy over a perpetual military posture. \"The young president offered a different vision,\" Obama said of Kennedy, \"but he rejected the prevailing attitude..that equated security with a perpetual war footing.\" \nIt worked, Obama said. \"We created the time and space to win the cold war without firing a shot at the Soviets. The agreement now reached with the Islamic Republic of Iran builds on this tradition of strong, principled diplomacy.\" \nOn Monday, three critical Democratic senators, Tim Kaine (Va.), Barbara Boxer (Calif.) and Bill Nelson (Fla.) voiced their support for the deal. The president needs a third of either the Senate or the House to stick with him and support a deal with Iran, which would sustain the president's veto of congressional disapproval. \nThe deal was struck between the U.S., Iran, Russia, China, Germany, the U.K. and France. In exchange for foreswearing a nuclear weapon program and allowing access by inspectors, Iran receives relief from nuclear-related sanctions. \nOpponents of the deal have attempted to frame the debate as a choice between the existing deal and a better deal, though such a suggestion is pure fantasy. If the U.S. rejects the deal, it would be impossible to bring China, Russian, Germany, France and the U.K. all back to the table to reimpose sanctions simply because Congress finds Iran to be a a \"mortal and unrepentant enemy.\" \nIf the goal is to prevent Iran from obtaining a nuclear weapon, the choice, then, is between this deal and war. It's a simple fact, though one that deal skeptics have shied away from. President Obama hammered the point in his speech Wednesday. \n\"Between now and the congressional vote in September, you’re going to hear a lot of arguments against this deal, backed by tens of millions of dollars in advertisements. And if the rhetoric in these ads, and the accompanying commentary, sounds familiar, it should -- for many of the same people who argued for the war in Iraq are now making the case against the Iran nuclear deal,\" Obama said. \n\"Now, when I ran for president eight years ago as a candidate who had opposed the decision to go to war in Iraq. I said then that America didn’t just have to end that war, we had to end the mindset that got us there in the first place. It was a mindset characterized by a preference for military action over diplomacy; that put a premium on unilateral U.S. action over the painstaking work of building international consensus; a mindset that exaggerated threats beyond what the intelligence supported. Leaders did not level with the American people about the costs of war, insisting that we could easily impose our will on a part of the world with a profoundly different history and culture. And, of course, those calling for war labelled themselves strong and decisive, while dismissing those who disagreed as weak -- even appeasers of a malevolent adversary.\" \n﻿ ﻿Peace, President Kennedy understood, is boring, not the kind of pursuit that whips up the passions of nationalistic and fearful voters. But it is ultimately the wises course. \n\"I speak of peace,\" he said, \"as the necessary rational end of rational men. I realize that the pursuit of peace is not as dramatic as the pursuit of war--and frequently the words of the pursuer fall on deaf ears. But we have no more urgent task.\" \n", "external_links": [], "published": "2015-08-05T19:22:00.000+03:00", "crawled": "2015-08-05T19:22:37.843+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}