{"organizations": ["Oppose Iran Deal Ryan Grim Washington bureau", "The Huffington Post Nick Baumann Senior Enterprise", "Oppose Iran Deal Chuck Schumer"], "uuid": "04e40d5e386d164d56ed0a9827f7ca3dcc8404d2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c3f8e714000077002e23b6.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/chuck-schumer-planning-to-break-with-obama-oppose-iran-deal_55c3f7e9e4b0d9b743dba71d", "country": "", "title": "Chuck Schumer Planning To Break With Obama, Oppose Iran Deal", "performance_score": 9, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Chuck Schumer Planning To Break With Obama, Oppose Iran Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T03:52:00.000+03:00", "replies_count": 0, "uuid": "04e40d5e386d164d56ed0a9827f7ca3dcc8404d2"}, "author": "", "url": "http://www.huffingtonpost.com/entry/chuck-schumer-planning-to-break-with-obama-oppose-iran-deal_55c3f7e9e4b0d9b743dba71d", "ord_in_thread": 0, "title": "Chuck Schumer Planning To Break With Obama, Oppose Iran Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jessica Schulberg", "Obama"], "text": "Chuck Schumer Planning To Break With Obama, Oppose Iran Deal Ryan Grim Washington bureau chief for The Huffington Post Nick Baumann Senior Enterprise Editor, The Huffington Post Jessica Schulberg Foreign Affairs Reporter, The Huffington Post Posted: 08/06/2015 08:51 PM EDT ASSOCIATED PRESS \nNew York Sen. Chuck Schumer, the chamber's third-ranking Democrat, plans to announce his opposition to the nuclear deal negotiated by the U.S., Iran, and five world powers tomorrow, three people familiar with his thinking tell The Huffington Post. \nSchumer's move will come a day after New Hampshire Democratic Sen. Jeanne Shaheen and Schumer's fellow New York senator, Kirstin Gillibrand, announced their support for the deal. That momentum is blunted by Schumer's pending announcement. Backers of the deal had hoped that if Schumer decided to oppose the deal, he would hold off until the last minute. Schumer's support of a war footing over diplomacy puts him at odds with the Democratic caucus he intends to lead next term, though it is consistent with the position he has long taken. \nAs the soon-to-be leader of his party in the Senate, Schumer’s decision to directly fight President Barack Obama on the biggest foreign policy achievement of his presidency is a bold, but not surprising, move. Schumer has long been more hawkish on foreign policy than some of his fellow Democrats. In 2002, he voted for the Authorization for the Use of Military Force in Iraq. In 2006 he backed John Bolton's nomination to serve as George W. Bush's ambassador to the United Nations, reportedly telling a Senate Democratic caucus meeting that \"a vote against Bolton was a vote against Israel.\" Bolton is an ardent foe of negotiation with Iran. \nSchumer has a sizable Jewish constituency and has developed close ties to the American Israel Public Affairs Committee, the influential pro-Israel lobbying group that has pledged over $20 million to kill the nuclear accord. During his 34 years in the legislature, Schumer has become fond of telling his voters that his surname is derived from “shomer,” the Hebrew word for “guardian.” “I am a shomer for Israel and I will continue to be that with every bone in my body,” he said in 2010. But to his more hawkish pro-Israel constituents, Schumer’s hesitation to announce his position and his failure to whip fellow Democrats against the deal demonstrates a betrayal of this promise. “Schumer, you are no shomer,” yelled a crowd of 10,000 protesters, rallying against the Iran deal in Times Square, New York last month. “Where is Chuck? Kill this deal!” they chanted. Schumer’s announcement comes one month before lawmakers hold a critical vote on a resolution of disapproval of the nuclear accord, which would revoke the president’s ability to waive some sanctions against Iran and likely kill the deal. Even if all Republican Senators vote down the Iran deal (and Arizona Sen. Jeff Flake is a big if), 13 Democrats will need to join them in order to override President Barack Obama’s inevitable veto of the resolution. In the past several days, a handful of fence-sitting Democrats have come out in support of the nuclear agreement -- including Sens. Tim Kaine (D-Va.), Bill Nelson (R-Fla.), and Gillibrand -- making it increasingly unlikely that Schumer and other opponents of the diplomatic accord will succeed in driving it down. ", "external_links": [], "published": "2015-08-07T03:52:00.000+03:00", "crawled": "2015-08-07T03:52:54.229+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}