{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "e688e38171ce13b4482c4c37f3fb31ba9a2ef83e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/01/12/paris-mr-obama-why-cant-show-radical-islamists-mean-business/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1439467065841.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/01/12/paris-mr-obama-why-cant-show-radical-islamists-mean-business.html", "country": "", "title": "Paris: Mr. Obama, why can't you show radical Islamists we mean business? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Paris: Mr. Obama, why can't you show radical Islamists we mean business? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "e688e38171ce13b4482c4c37f3fb31ba9a2ef83e"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/01/12/paris-mr-obama-why-cant-show-radical-islamists-mean-business.html", "ord_in_thread": 0, "title": "Paris: Mr. Obama, why can't you show radical Islamists we mean business? | Fox News", "locations": ["France", "Paris"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print File- Jan. 9, 2015: President Obama speaking about the France newspaper attack. ( AP Photo/Carolyn Kaster) \nPresident Obama was a no-show Sunday at the unity rally in Paris. There were leaders from around the world. Eric Holder, the lame duck Attorney General was sent in Obama's absence. Holder was in Paris for an anti-terrorism summit. He did not appear with other world leaders at the rally. \nI wonder what was on Obama's schedule that was more important to the president than showing radical Islam we mean business? \nI trust the president's absence had nothing to do with his well-documented refusal to tie terror to where it comes from. The radical wing within the Muslim community. By not showing up and locking arms with President François Hollande, Chancellor Angela Merkel, Prime Minister Benjamin Netanyahu, PLO Chairman Mahmoud Abbas, and others...has our president hat tipped terrorists that we in America still are afraid to offend them? \nIt was a nice show of solidarity in Paris on Sunday. But will world leaders respond with action or return to their respective countries and not just declare war on radical Islam? They must actively seek to root out radicals and destroy their infrastructure. Enough have died at the hands of these savages. They have no right to hide behind \"no-go zones.\" \nI first mentioned the extensive network of \"no-go\" zones in Britain and France after the beheading of a British soldier in the streets of London by a radical Muslim. \nThe left called me intolerant. \nI was called Islamophobic by CAIR. \nI didn't care then, and I could care even less, now. \nBack home, we need to make sure there are no safe places for terror in America. \nThere are pockets of high density Muslim populations all the across the United States. \nWe are free in America to live where and how we choose. And, of course, that applies to Muslim communities, too, as long as these places are not hiding terror cells. \nLaw enforcement has a responsibility to make sure that there are no areas where they are afraid to police. They have a responsibility to ensure these areas are not breeding places of terror. \nOur elected officials need to back law enforcement with strong support. And they need to arm law enforcement with the tools they need to keep our country safe. -- That means intelligence support, arming them adequately and letting them know that We the People support law enforcement. \nBut here’s the bottom line: If you intend to hurt Americans, you will be tracked, followed and profiled. \nSorry, does that sound politically incorrect? Too bad! \nHow many more beheaded journalists or massacres of innocents do we need to rethink the current administration's political correctness strategy? \nIt simply didn't work. It made liberal progressives feel better about their tolerance but that tolerance has turned deadly over and over again. \nFinally, watching those leaders marching through the Paris streets sans Obama, I wanted to shout, \"Hey Islamic terrorists, he doesn't speak for me!\" And likely MILLIONS of Americans, who are ready to fight for our freedom and safety feel the same way. \nMatt Drudge may have summed up the Obama presidency perfectly in less than 140 characters: \n@DRUDGE: ALL Obama moves are designed to further his career in global govt after he leaves White House. Understand this, and things make more sense. \nEric Bolling currently serves as co-host of Fox News Channel's \" The Five \" (weekdays 5-6PM/ET). He also serves as the host of \" Cashin' In \" (Saturdays 11:30AM-12PM/ET), an analysis program on FNC's weekend business block, \" The Cost of Freedom .\" Bolling joined the network in 2008. Click here for more information on Eric Bolling . ", "external_links": [], "published": "2015-08-13T03:00:00.000+03:00", "crawled": "2015-08-14T04:14:04.474+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}