{"organizations": [], "uuid": "18b8d7e052e5b62cdd1313612de13b9331bdbb35", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d737db1d00006e0014575f.jpeg", "site_section": "http://www.huffingtonpost.com/tag/weed/feed", "section_title": "Weed on Huffington Post", "url": "http://www.huffingtonpost.com/entry/marijuana-drugged-driving_55d73688e4b08cd3359bb3db?kvcommref=mostpopular", "country": "US", "title": "As Legal Marijuana Expands, States Struggle With Drugged Driving", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "As Legal Marijuana Expands, States Struggle With Drugged Driving", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T13:44:00.000+03:00", "replies_count": 0, "uuid": "18b8d7e052e5b62cdd1313612de13b9331bdbb35"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/marijuana-drugged-driving_55d73688e4b08cd3359bb3db?kvcommref=mostpopular", "ord_in_thread": 0, "title": "As Legal Marijuana Expands, States Struggle With Drugged Driving", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As Legal Marijuana Expands, States Struggle With Drugged Driving Some states see creating DUID laws as part of the marijuana legalization process. Pew's Stateline By Sarah Breitenbach Posted: 08/21/2015 10:44 AM EDT This piece comes to us courtesy of Stateline. Stateline is a nonpartisan, nonprofit news service of the Pew Charitable Trusts that provides daily reporting and analysis on trends in state policy. \nWashington State Patrol Sgt. Mark Crandall half-jokingly says he can tell a driver is under the influence of marijuana during a traffic stop when the motorist becomes overly familiar and is calling him “dude.” \nThe truth in the joke, Crandall says, is that attitude and speech patterns can be effective markers for drugged driving. And, according to legalization advocates and some in law enforcement, they can be more reliable than blood tests that measure THC—the psychoactive compound in marijuana. \nWhen it comes time to go to court, the testimony of an officer trained as a drug recognition expert is often more valuable than a THC test because of disparities in how the drug impacts driving ability, Crandall said. \n“Here’s the really bad driving that I saw, here’s the magnified impairment that I saw on the side of the road,” he said. “It’s telling a good story and making sure that it’s backed up with facts, and evidence, and proof, and the ability of the officer to articulate it well.” \nAs more states make medical and recreational marijuana use legal, they increasingly are grappling with what constitutes DUID, or driving under the influence of drugs, and how to detect and prosecute it. And they’re finding it is more difficult than identifying and convicting drunken drivers. \nWhile marijuana is the substance, other than alcohol, most frequently found in drivers involved in car accidents, the rate at which it actually causes crashes is unclear . \nAt least 17 states, including Washington, have “per se” laws , which make it illegal to have certain levels of THC in one’s body while operating a vehicle, according to the National Conference of State Legislatures (NCSL). Under these laws, no additional evidence is required to prove a driver is impaired. \nOf those states, Colorado, Montana, Nevada, Ohio, Pennsylvania and Washington allow for some amount of THC to be found in a driver’s blood, ranging from 1 to 5 nanograms per milliliter (ng/ml). Other states leave no wiggle room and consider any amount of THC to be impairing and grounds for being charged with DUID. \nIn Colorado, where recreational marijuana became legal in 2012, drivers are assumed to be under the influence of marijuana if they have THC levels of 5 ng/ml or higher, but the law also lets defendants produce evidence that they were not impaired. \nAlaska, Colorado, the District of Columbia, Oregon and Washington allow adult recreational use of marijuana, and another 18 states permit its use for medical purposes. More states are expected to permit recreational marijuana use as legalization efforts move to the ballot in Ohio this fall and Nevada in 2016. \nAt a recent NCSL meeting in Seattle, nearly all policymakers who attended a session on legalizing marijuana said they expected their states would soon have to debate legalization, if they haven’t already. A study by the Pew Research Center released in April found that 53 percent of adults supported the legal use of marijuana. (Pew also funds Stateline ). How THC Works \nState lawmakers, conditioned by the universal system of rating blood alcohol content to determine intoxication, have long wanted similar measurements to gauge a driver’s impairment under the influence of THC. But that has proven elusive. \nUnlike alcohol consumption, which creates impairments that are measurable by blood alcohol content, the consumption of marijuana creates physical effects that vary from person to person and THC levels can depend on how cannabis is ingested and whether the person is a long-term marijuana user, said Rebecca Hartman, a researcher with the National Institute on Drug Abuse . \nPeople’s THC levels peak quickly as they inhale marijuana smoke and then decrease rapidly in the first 30 minutes to an hour after smoking. Even though the THC levels are decreasing, users can still be impaired, Hartman said. \nHow the human body processes marijuana varies so much from person to person that even on different days a user might metabolize the drug at different rates, she said. \n“We’ve shown that cannabis increases lane weaving and some studies have shown one of the big things that cannabis is known to impair is driver attention,” Hartman said. \nA June study on drugged driving conducted by Hartman and others suggested that people driving with THC levels of 13.1 ng/ml had a tendency to weave within lanes, similar to those who had a 0.08 blood alcohol content, the point at which drivers can be prosecuted in all states. \nGeorge Bianchi, a criminal defense attorney in Seattle, said the rule in his state (5 ng/ml) is not appropriate because studies of driver impairment vary so much. He said he thinks Hartman’s study opens the door to using 13 ng/ml as a national standard for marijuana impairment. \n“I think you should try to quantify it somehow,” he said. “And this recent study seems to do that.” Controlling Drugged Driving \nSome states see creating DUID laws as part of the marijuana legalization process, said Morgan Fox, a spokesman for the Marijuana Policy Project. \nSeveral states considered adding or modifying per se DUID limits in 2015. Legislation that would elevate the Illinois per se standard from zero tolerance to 5 ng/ml, as amended (down from 15 ng/ml) by Republican Gov. Bruce Rauner, is awaiting final approval by the General Assembly. And a bill that would create a per se standard in New Jersey is before that legislature. Alabama , Maine and New Mexico also reviewed bills adding per se DUID limits ranging from 2 ng/ml to 5 ng/ml, though none passed. \n“Considering most states already have them in place, and they are already being enforced, we don’t see the need to add them,” Fox said. “But we’re not going to scuttle a bill that would legalize [marijuana] because of per se [laws].” \nBecause of the variation in users’ impairment levels, critics of blood testing like Paul Armentano, deputy director for the National Organization for the Reform of Marijuana Laws, say the tests are not an appropriate measure of how well a person was driving at the time of a traffic stop or crash. \n“Where is the need to go in this [direction] with cannabis when there is a consensus among experts in the field that the presence of THC in the blood in a single sample is not an accurate predictor of recent use nor is it a predictor of performance?” Armentano said. \nHe cites a February 2015 drug and alcohol crash risk study from the Department of Transportation that points to contradictions between previous studies about the relationship between marijuana use and motor vehicle crashes. The analysis, which looked at marijuana and other drugs, found that, when adjusted for age, gender and alcohol use, there was no significant increase in the level of crash risk associated with the use of THC. Inappropriate Arrests \nLegalization advocates said they worry that per se standards will lead to DUID convictions of people who were not impaired by marijuana when they were pulled over for a traffic violation, but might test positive for THC because they are frequent recreational users or use marijuana as medicine. \n“These laws could lead to significant unintended consequences and the most significant of those is that the law prosecutes and convicts individuals of violating traffic safety laws for simply having engaged in behavior in the privacy of their own home that at no point rose to a legitimate traffic safety threat,” Armentano said. In 2014 the Arizona Supreme Court overturned a lower court ruling that allowed for the prosecution of drivers under the per se law, even if there was no evidence of impairment. The previous year, the Michigan high court ruled that police must prove driver impairment to pursue DUID charges. \nStates began adopting THC-specific standards in the early 1990s as a consequence of highly publicized crashes and other accidents, Armentano said, contending that the laws are largely unnecessary given established protocols for determining if a driver is under the influence of a drug. \n“The officer is collecting evidence from the minute he flashes his lights,” he said. “Based on evidence observed at the scene, he or she is going to start making some judgment about whether [the driver] might be under the influence.” \nAlso on HuffPost: Most Influential People Who've Used Marijuana of", "external_links": [], "published": "2015-08-21T13:44:00.000+03:00", "crawled": "2015-08-21T22:05:59.291+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}