{"organizations": [], "uuid": "df54bf449b4f0bee6e466c2902181b92b39bd41c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3285882/images/o-BILL-BRATTON-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/stefanie-jones/nypd-stop-lying-heres-how_b_7967308.html", "country": "", "title": "NYPD Stop Lying! Here's How to Handle 'Synthetic Marijuana' | Stefanie Jones", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "NYPD Stop Lying! Here's How to Handle 'Synthetic Marijuana' | Stefanie Jones", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T22:54:00.000+03:00", "replies_count": 0, "uuid": "df54bf449b4f0bee6e466c2902181b92b39bd41c"}, "author": "", "url": "http://www.huffingtonpost.com/stefanie-jones/nypd-stop-lying-heres-how_b_7967308.html", "ord_in_thread": 0, "title": "NYPD Stop Lying! Here's How to Handle 'Synthetic Marijuana' | Stefanie Jones", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Stefanie Jones"], "text": "reddit \nThe NYPD has been drumming up attention over the supposed dangers of \"synthetic marijuana\" -- a class of cannabinoid chemicals typically sprayed over plant matter and packaged with names like \"K2,\" \"Spice\" and \"Green Giant.\" \nLast week, NYPD Commissioner Bill Bratton used highly emotional language , calling it \"weaponized marijuana\" and saying it makes people \"totally crazy,\" gives them superhuman strength, and using two videos to illustrate, seems to make people run around naked. \nProblem is, one of those videos wasn't even a person on any kind of synthetic cannabinoid. As Gothamist first reported, the video was actually from a 2003 episode of the series COPS , and shows someone allegedly on PCP. \nNew York isn't the only place where we've seen fear-mongering tactics. Just two months ago, Washington D.C. Police Chief Cathy Lanier blamed the city's increase in crime on use and sale of synthetic cannabinoids. \nSo what's the truth behind all this hype? \nVarious synthetic cannabinoid products are mostly being used in homeless and other vulnerable populations. This product fills their particular needs: it's cheap, accessible, and won't show up on drug tests given by shelters or treatment centers. \nAlso, many of those in homeless or other vulnerable communities are struggling with mental health issues. Add to that the unpredictable effects of synthetic cannabinoids like K2, and you end up with a few individuals unlucky enough to have their resulting terrible drug experience happening in public spaces and filmed for all of us to watch. \nNo one's saying that's not a tough situation to walk into as a first responder. But that's no excuse for police forces to spread misinformation, promote hysteria, and encourage further criminalization of poor people and people who use drugs. \nSo - law enforcement. Chill out. And consider these responses: Education . Shelters, treatment centers, and other organizations that work with homeless and vulnerable populations need access to accurate, non-judgmental information about synthetic cannabinoids and basic harm reduction advice like, \"Don't smoke the whole packet. Try not to smoke every day. Keep someone with you in case things go wrong.\" \nCompassionate immediate response . When someone is disturbing the public during a difficult drug experience, restraint is sometimes necessary -- but generally not arrest or imprisonment. Police may want to work with the local Health Departments or hospitals to adapt a model used at some psychedelic festivals: developing a temporary \"mental health space\" and a team to work with the people brought there. The Zendo Project , which is the name of the service used at festivals, uses trained therapists and volunteers sit with, talk, and \"hold space\" for people undergoing difficult drug experiences. Medication can be administered if necessary, but volunteers know that time and simple human compassion is generally all that's needed for people to ride out their high and return to normal. Adapted to a city setting, for individuals with continuing mental health and housing issues, the people can be connected with the resources they need. Regulation -- not criminalization . Banning substances is actually what fuels the cycle of new synthetic cannabinoids and other drugs continually popping up. If we want to stop or slow K2 or other synthetic cannabinoid use we should regulate marijuana, which is a safer and widely desired drug not associated with violence. We should also follow the lead of countries like New Zealand that passed a law requiring people who produce and sell synthetic cannabinoids to show proof of health and safety testing before being allowed on the market. \nIncidentally, we also need a lot more research to understand these substances. But until that time, let's pump the brakes on the \"synthetic marijuana\" freak-out and try to address the issue with science, compassion, health and human rights in mind. \nStefanie Jones is the nightlife community engagement manager for the Drug Policy Alliance . \nThis piece first Appeared on the Drug Policy Alliance Blog: http://www.drugpolicy.org/ ", "external_links": [], "published": "2015-08-10T22:54:00.000+03:00", "crawled": "2015-08-10T22:54:13.551+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}