{"organizations": ["Ohio Statehouse", "Reuters", "Fox News Facebook", "Twitter"], "uuid": "300cd5031005a44a579098fb93de799f1cd21ba2", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/kasichohiointernal5454.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/08/24/ohio-legislature-to-consider-down-syndrome-abortion-ban/", "country": "", "title": "Ohio mulls Down syndrome abortion ban, Kasich mum for now | Fox News", "performance_score": 6, "site": "foxnews.com", "participants_count": 0, "title_full": "Ohio mulls Down syndrome abortion ban, Kasich mum for now | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T05:40:00.000+03:00", "replies_count": 0, "uuid": "300cd5031005a44a579098fb93de799f1cd21ba2"}, "author": "", "url": "http://www.foxnews.com/politics/2015/08/24/ohio-legislature-to-consider-down-syndrome-abortion-ban/", "ord_in_thread": 0, "title": "Ohio mulls Down syndrome abortion ban, Kasich mum for now | Fox News", "locations": ["Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kasich", "John Kasich"], "text": "Facebook 0 Twitter 0 livefyre Email Print At left; the Ohio Statehouse. At right, Ohio Gov. John Kasich. (Reuters) \nOhio lawmakers are considering a controversial bill that would ban abortions sought because the baby has Down syndrome, placing the swing state at the center of a new battle for anti-abortion advocates. \nThe measure also has implications for the 2016 presidential race, as Ohio Gov. John Kasich seeks the Republican nomination and tries to walk a fine line between burnishing his pro-life credentials and positioning himself as a moderate member of the GOP field. He has not taken a position on the legislation. \n\"The governor is pro-life and believes strongly in the sanctity of human life, but we don't take a public position on every bill introduced into the Ohio General Assembly,\" Rob Nichols, a Kasich spokesman, told FoxNews.com. \nThe Ohio bill would ban a physician from performing an abortion if they know the woman is seeking the procedure solely because of a test indicating Down syndrome in the unborn child. \nThe bill would hold the doctor, not the mother, responsible for violating the proposed law, which carries a penalty of six-to-18 months in jail. \nThe legislation is unique, though not unprecedented. North Dakota passed a similar measure in 2013 that banned abortions motivated by the sex of the baby; a diagnosis for a genetic abnormality such as Down syndrome; or the potential for a genetic abnormality. More on this... Kasich touts bipartisan approach, successes as governor \nThe proposal in politically purple Ohio, though, could have widespread implications, particularly if it spurs even more states to act. According to a 2012 study in the medical journal \"Prenatal Diagnosis,\" U.S. women who receive a fetal diagnosis of Down syndrome choose to have an abortion between 50 and 80 percent of the time, down from 90 percent in 1999 from a study in the same journal. \nThe legislation is thought to have a good chance of passing. The bill recently passed out of committee in the state House of Representatives on a 9-3 bipartisan vote. Ohio Right to Life, which helped draft the bill, is hoping it will be voted on in a few weeks, when lawmakers return from recess, and reach Kasich’s desk by Christmas. \n“What does that say of us as a society if we make decisions about who lives or who dies dependent on if they are going to be an inconvenience, or they are [costing] too much money for health care costs?” Ohio Right to Life President Michael Gonidakis told FoxNews.com. “Someday we are going to find a genetic marker for autism. Are we going to have a 90 percent abortion rate for people with autism? I hope not.” \nGonidakis says he thinks the legislation will pass and Kasich will ultimately sign it. \n“We have a track record of being strategic and putting forth an incremental approach to all our initiatives,” Gonidakis said, adding that they have worked with Kasich on roughly a dozen pro-life measures, including a late-term abortion ban. \nRepublican state Rep. Sarah LaTourette, a co-sponsor of the bill, also told FoxNews.com she is confident the bill will pass. \n\"While I make no effort to conceal my pro-life convictions, I firmly believe this bill is about discrimination, not abortion. Choosing to end an individual's life simply because they are different, or might have Down syndrome, is discrimination,\" she said in an email. \"There is simply no other way to look at it.\" \nHowever, if Kasich chooses to back the bill, he is sure to face stiff opposition from pro-choice groups. \n\"We believe we should all work to ensure people with disabilities are treated with equality and dignity. However, we oppose this ban because it interferes with the medical decisions of Ohioans and does nothing to help people with disabilities or their families,” Kellie Copeland, executive director of NARAL Pro-Choice Ohio, told FoxNews.com. \nCopeland said she believes it will be an “uphill battle” to oppose the legislation, but people have flooded her group's phone lines with calls offering donations to fight it. \n“We have to make it clear to Gov. Kasich that this is not good health care, this is not what the people of Ohio want,” Copeland said. “This ban would encourage patients to keep information from their doctors and that is bad medicine.” \nGonidakis said he is “100 percent” confident the governor will sign the bill. “He is the most pro-life governor in our state’s history,” he said. \nCopeland seemed to agree with Gonidakis: “He’s signed everything they slapped on his desk so far so I don’t see why this would be anything different.” \nAdam Shaw is a Politics Reporter for FoxNews.com. He can be reached here or on Twitter: @AdamShawNY . Advertisement ", "external_links": [], "published": "2015-08-25T05:40:00.000+03:00", "crawled": "2015-08-25T05:40:12.166+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}