{"organizations": [], "uuid": "c3a9b031b354367a7a6c8526dacd436b4a6c042d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/08/18/abortion-industry-corrupt-to-core/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1439918084495.jpg?ve=1&tl=1", "site_section": "http://feeds.foxnews.com/foxnews/opinion", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2015/08/18/abortion-industry-corrupt-to-core.html", "country": "US", "title": "The Abortion Industry: Corrupt to the Core", "performance_score": 0, "site": "foxnews.com", "participants_count": 21, "title_full": "The Abortion Industry: Corrupt to the Core | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 21, "uuid": "eb7f6927b829f4d0bd9678a2caaa252270e0228a"}, "author": "Frank Pavone", "url": "http://www.foxnews.com/opinion/2015/08/18/abortion-industry-corrupt-to-core.html#post-0", "ord_in_thread": 0, "title": "The Abortion Industry: Corrupt to the Core", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Father Frank Pavone, Troy Newman, Mark Crutcher \nPublished August 18,   livefyre Email Print Anti-abortion activists and supporters of legal abortion stand in front of the Supreme Court in Washington, Friday, Jan. 25, 2013, on the 40th anniversary of the Roe v. Wade decision. Thousands of anti-abortion demonstrators marched through Washington to the steps of the U.S. Supreme Court to protest the landmark decision that legalized abortion. (AP Photo/J. Scott Applewhite) (AP2013) \nEach of us has devoted his life, for decades now, to ending abortion. And we have done so -- and continue to do so -- with the conviction that abortion, and the industry that sells it, is collapsing under its own weight. The myriad of pro-life organizations and efforts -- of which we are a part and for which we are grateful -- in the end can perhaps be best described as efforts to hasten a collapse already underway and to save as many lives as possible in the process. We have each seen, time and time again, how exposing the horror of abortion itself causes many people to reject it, without us making a single argument or rationale for doing so. We simply need to expose to the light of day this evil which continues, in large part, because its purveyors are experts at keeping it hidden. As Paul writes to the Ephesians, \"Have nothing to do with the fruitless works of darkness, but rather, expose them\" (Eph. 5:11).\nNo lie can live forever. You can hide the truth for a while, but despite the best efforts to do so, it will eventually come out. And it has come out in multiple revelations of abortion itself and of the corruption that characterizes the abortion industry. It comes out as pro-life organizations show to the public what aborted babies look like.\nIt came out It came out when Life Dynamics, in a project in which all three of us were involved, published the book Lime 5. This book fully documented the horrors that take place inside American abortion clinics, including the devastating toll taken on those who work in them.  Some of the material contained in this book is literally sickening, such as the revelations about women and young girls being raped and sexually assaulted while having abortions. \nLife Dynamics was also the first organization to go undercover and document that the bodies of children killed in these places were being chopped up and sold for parts.  Later, they also proved that clinics associated with both Planned Parenthood and the National Abortion Federation were knowingly protecting adult men who sexually abuse minor girls.  After this scandal was exposed, it was clear that these two organizations are running what is basically a nationwide pedophile protection ring. \nTo understand the real world impact of all this, all one has to do is watch the heartbreaking interview with Deborah Cardamone on the Life Dynamics website, SafeAndLegal.com.  Ms. Cardamone describes what happened when her beautiful 18-year-old daughter, Marla, was deceived into having an abortion she didn’t want.  In the end, not only was Deborah’s grandchild dead, so was Marla.   \nThe truth about the abortion industry also came out in the undercover videos of Live Action, and yet again in the trial of Philadelphia abortionist Kermit Gosnell in 2013. And it is coming out now in the multiple undercover videos revealing more evidence about the sale of baby body parts by Planned Parenthood.\nYou can't practice vice virtuously. If your conscience has deteriorated to the point that you can kill babies, you're going to do a lot of other evil as well. Your ability to discern right from wrong has been destroyed, and there's no way that the fallout is only going to impact one segment of your activities.\nAnd that is precisely the downfall of the abortion industry. Many who accept legal abortion in our country do so only because they really think \"legal\" means safe, and they believe the myth that abortion is a benign procedure that actually can be performed within some kind of morally and legally upright framework.\nBut nothing is farther from the truth. The men and women who kill children also destroy everything and everyone in their path.  Gosnell’s increasingly sloppy and corrupt abortion business not only murdered babies born alive and the killed at least two women, but led to the incarceration of several of his employees whose lives were also ruined by his corruption.  Phoenix abortionist Brian Finkel is currently serving 35 years in prison for raping or otherwise sexually abusing his abortion patients, who must carry the scars of their abuse forever.  Abortionist John Hamilton of Oklahoma is currently serving life in prison for murdering his wife after years of killing babies.  Most recently, Oklahoma abortionist Naresh Patel is facing fraud charges after authorities caught him exploiting non-pregnant women for financial gain.  Patel led them to believe they were pregnant so he could sell them expensive abortion drugs.\nAnd herein lies a problem for the abortion industry that they cannot get away from: as more and more people, including those who identify themselves as \"pro-choice,\" become aware of this corruption, many of them re-evaluate what they think about the abortion industry, and about abortion itself. Moreover, we are then able to utilize existing laws to put out of business the clinics that are performing abortions, even while the procedure itself is legal, because they are doing so many other things that aren't.\n In exposing abortion, we mobilize not only pro-life people; we mobilize pro-choice people, including that large segment of the American public who are conflicted about abortion because they see it as a contest between the rights of a woman and the rights of her child. Exposing what really goes on in the abortion industry reveals that the true nature of the conflict is between a corrupt, unscrupulous abortion industry on the one hand, and the child and her family on the other. And that's a scenario in which the American people will not have such a hard time choosing sides.\nFather Frank Pavone is National Director of Priests for Life and Missionaries of the Gospel of Life. He is president of the National Pro-life Religious Council and Pastoral Director for Rachel's Vineyard, the world's largest ministry of healing after abortion. He travels throughout the country, to an average of four states every week, preaching and teaching against abortion. \nTroy Newman is President of Operation Rescue .\nMark Crutcher is President of Life Dynamics .\n ", "external_links": [], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-19T12:17:15.298+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}