{"organizations": [], "uuid": "6030f1cbd9abccfa590e0b6f1f3690637ab72ead", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/presidentobama_080515getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/250913-obama-pushes-congress-to-renew-voting-rights-act", "country": "US", "title": "Obama pushes Congress to renew Voting Rights Act", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama pushes Congress to renew Voting Rights Act", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T15:04:00.000+03:00", "replies_count": 0, "uuid": "6030f1cbd9abccfa590e0b6f1f3690637ab72ead"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/250913-obama-pushes-congress-to-renew-voting-rights-act", "ord_in_thread": 0, "title": "Obama pushes Congress to renew Voting Rights Act", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama pushes Congress to renew Voting Rights Act Getty Images By Jordan Fabian - 08/12/15 08:04 AM EDT \nPresident Obama on Wednesday urged Congress to restore the Voting Rights Act following a Supreme Court decision that gutted a core part of the landmark law. ADVERTISEMENT \"Congress must restore the Voting Rights Act. Our state leaders and legislatures must make it easier — not harder — for more Americans to have their voices heard,\" he wrote in a letter to The New York Times . \"Above all, we must exercise our right as citizens to vote, for the truth is that too often we disenfranchise ourselves.\"\nThe president wrote that he was \"inspired\" by a recent New York Times magazine article that detailed opponents' efforts to \"undermine this historic law.\" \n\"They remind us that progress does not come easy, but that it must be vigorously defended and built upon for ourselves and future generations,\" he wrote. \nA 2013 Supreme Court decision invalidated a key part of the law that required states with histories of racial discrimination to seek approval from the federal government before changing its voting laws. \nIn the wake of the ruling, several states governed by Republicans, including North Carolina and Texas, have passed laws that curb early voting, require people to provide identification at the polls and prohibit pre-registration for people under 18. \nObama and Democrats in Congress have pushed for new legislation, saying the state laws have made it harder to vote. \nOn the 50th anniversary of the law's passage last Thursday, Obama said updating the law \"has to be a priority.\" Tags:", "external_links": [], "published": "2015-08-12T15:04:00.000+03:00", "crawled": "2015-08-12T16:06:32.957+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}