{"organizations": [], "uuid": "8b95beedd45b6a362b5e473be182e2790e5b19b1", "thread": {"site_full": "radio.foxnews.com", "main_image": "http://radio.foxnews.com/wp-content/uploads/2014/03/Bernie-Sanders.jpg", "site_section": "http://feeds.feedburner.com/RSSMicro/Top_News", "section_title": "Top News on RSS Feeds", "url": "http://radio.foxnews.com/2015/08/05/sanders-obama-broke-away-from-what-got-him-elected/", "country": "US", "title": "Sanders: Obama ‘Broke Away’ From What Got Him Elected", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Sanders: Obama ‘Broke Away’ From What Got Him Elected", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T04:48:00.000+03:00", "replies_count": 0, "uuid": "8b95beedd45b6a362b5e473be182e2790e5b19b1"}, "author": "", "url": "http://radio.foxnews.com/2015/08/05/sanders-obama-broke-away-from-what-got-him-elected/", "ord_in_thread": 0, "title": "Sanders: Obama ‘Broke Away’ From What Got Him Elected", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Alan Colmes Aug 5, 2015 \nWednesday on “The Alan Colmes Show,” Alan spoke with Democratic candidate for President Sen. Bernie Sanders (I-VT) about his recent surge in New Hampshire that has him in a statistical tie with Hillary Clinton. Alan and Sen. Sanders also discussed why the only way to deal with Republicans is to give them “an offer they can refuse,” the Senator’s reaction to the crows of thousands who come to see him, and his thoughts on Vice President Joe Biden possibly entering the 2016 race: \nCOLMES: You have the Granite State poll has you within shouting distance, within the margin of error with Hillary Clinton. And other major polls similarly show you doing well. Not just New Hampshire, but all over. Are you surprised by how well you are doing? \nSEN. SANDERS: The answer is yes and no, Alan. I think that we have a message and an analysis which from the very beginning I believed would resonate with the American people. Look, the American people know there is something wrong when people work longer hours for low wages. We have the highest rate of childhood poverty of any major country on Earth, when we have lost millions of jobs because of disastrous trade polices to China and other countries. They know something is wrong when almost all the wealth and income goes to the top 1%. I knew we had a program that would resonate with the American people, an analysis, but it is happening faster than I thought it would. \n\nCOLMES: What can a Democratic, or a Democratic Socialist in your case, let’s say just left of center President do with an increasingly Republican congress that is not sympathetic to some of these arguments and certainly won’t help provide, it seems, the funds you need to invest to make some of these programs happen? \nSEN. SANDERS: OK, well what we can do is make them an offer they can’t refuse. In other words what goes on politically now in this country, Alan, is we just came from a midterm election in which 63% of the American people didn’t vote, 80% of young people didn’t vote. When I talk about the need for political revolution, what I am talking about is an unprecedented way, is people become involved in the political process. Understanding that democracy is not a spectator sport, you got to be active in it or we going to lose it.", "external_links": [], "published": "2015-08-06T04:48:00.000+03:00", "crawled": "2015-08-06T05:42:32.910+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}