{"organizations": ["Iowa State Fair Democtratic", "Iowa State Fair Big Mac", "Iowa Cubs", "Iowa State Fair Ron Carnegie", "CNN", "Iowa State Fair Twins Quinn and Emerson Eastman", "Iowa State Fair Democratic", "Twins", "Iowa State Fair", "Iowa State Fair Democatic", "GOP", "Iowa State Fair Caroline Kramer", "Iowa State Fair Shelby Heston", "State Department", "Iowa State Fair Republican"], "uuid": "4629d2762699047931bffbcad657d02aa913405b", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150807123010-mike-huckabee-aug-6-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/08/16/politics/mike-huckabee-abortion-paraguay/index.html?eref=rss_politics", "country": "US", "title": "Huckabee: With abortion, there are two victims", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Huckabee: With abortion, there are two victims", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T16:47:00.000+03:00", "replies_count": 0, "uuid": "4629d2762699047931bffbcad657d02aa913405b"}, "author": "", "url": "http://edition.cnn.com/2015/08/16/politics/mike-huckabee-abortion-paraguay/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Huckabee: With abortion, there are two victims", "locations": ["Iowa State Fair County Fair Queens", "Iran", "Paraguay", "Creston", "Iowa State Fair Former Arkansas", "Cleveland", "Israel", "Fairfield", "Florida", "Iowa", "Iraq", "Des Moines", "California", "Stanwood", "Maryland", "Wisconsin", "Middle East", "Arkansas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Glenn Kasper", "Jeb Bush", "Barack Obama", "Donald Trump", "Mark Halperin", "Bush", "Kelly O'Donnell", "George W. Bush", "Kasich", "Hillary Clinton", "Nordeman", "Mike Huckabee", "Eric Bradner", "Brian Bolton", "Martin O'Malley", "Rubio", "George Washington", "Paul Wolfowitz", "Leon", "Landon Nordeman", "Bernie Sanders", "Trump", "Krista Heston", "Huckabee", "John Heilemann", "Sanders", "Clinton", "Dana Bash", "Tom Harkin", "Marco Rubio", "Wolfowitz", "Ty Redman"], "text": "Huckabee: 'When an abortion happens there are 2 victims' 02:14 Story highlights Mike Huckabee opposes exceptions in abortion bans \"There are two victims. One is the child; the other is that birth mother,\" he says (CNN) Mike Huckabee says his opposition to abortion rights in any circumstances won't change after Paraguay refused a 10-year-old rape victim access to the procedure. The former Arkansas governor who is seeking the Republican presidential nomination called the girl's rape a tragedy in an interview with CNN's Dana Bash on \"State of the Union\" Sunday. But he said: \"Let's not compound a tragedy by taking yet another life.\" \"A 10-year-old girl being raped is horrible. But does it solve a problem by taking the life of an innocent child? And that's really the issue,\" Huckabee said. He said his opposition to abortion is based in part on its lasting effects, including that of the woman making the decision. RELATED: Kasich says he doesn't read the Bible to 'figure out what to think' \"There are two victims. One is the child; the other is that birth mother who often will go through extraordinary guilt years later when she begins to think through what happened -- with the baby, with her. And again, there are no easy answers here,\" Huckabee said. \"I just come down on the side that life is precious; every life has worth and value. I don't think we discount the intrinsic worth of any human being, and I don't know where else to go with it than just to be consistent and say, if life matters, and that's a person, then every life matters,\" he said. He's the latest Republican to weigh in on the issue that Democrats like Hillary Clinton have used to attack Florida Sen. Marco Rubio , another GOP 2016 contender, in recent days. Rubio, too, opposes abortion in all instances, something he made clear during the first Republican presidential debate in Cleveland. Huckabee, the winner of the 2008 Iowa caucuses but trailing several other candidates in the 2016 race, also said Sunday that he plans a two-day swing through Israel. He'll depart Tuesday. 29 photos: Postcards from the Iowa State Fair Republican presidential candidate Donald Trump poses for a picture with a woman and child at the 2015 Iowa State Fair in Des Moines on Saturday, August 15. Presidential candidates of every stripe were at the fair this weekend, mingling with voters in the first-in-the-nation caucus state, taking questions on the Des Moines Register Soapbox and, of course, chowing down on some deep-fried food. Photographer Landon Nordeman traversed the fair in search of presidential candidates and interesting people. These are his photographs from the first three days of the event. Hide Caption 1 of 29 29 photos: Postcards from the Iowa State Fair Trump poses with supporters' children before taking some of them on a free helicopter ride. He arrived at the fair shortly after 1 p.m. in grand fashion, landing in his private helicopter with \"TRUMP\" emblazoned on its side. The fair wouldn't let Trump's helicopter take off from the fairgrounds, so he used a nearby parking lot to make the flights. Hide Caption 2 of 29 29 photos: Postcards from the Iowa State Fair After a short chat with the media, Trump enters the fairgrounds, where he was mobbed by hundreds of fairgoers who wanted to shake his hand or just snap a photo of him. He was closely guarded by a half-dozen security guards and another 10 police officers, a mix of local cops and state troopers. Hide Caption 3 of 29 29 photos: Postcards from the Iowa State Fair Democratic presidential candidate Hillary Clinton meets the press. She was introduced by former Iowa Sen. Tom Harkin, who endorsed Clinton earlier this week. She was immediately asked about the swirling controversy over her use of a private email server while she headed the State Department. Friday night, Clinton joked about why she loves the social media app Snapchat, saying, \"those messages disappear all by themselves.\" Hide Caption 29 photos: Postcards from the Iowa State Fair Trump supporters watch as his helicopter takes off. Hide Caption 29 photos: Postcards from the Iowa State Fair NBC News correspondent Kelly O'Donnell is among the media waiting for Clinton to speak. Hide Caption 6 of 29 29 photos: Postcards from the Iowa State Fair Democatic hopeful Sen. Bernie Sanders, right, speaks to journalists Mark Halperin and John Heilemann. Trump and Clinton may have drawn large crowds, but according to CNN's Eric Bradner, Sanders drew the largest crowds of the afternoon. Hide Caption 7 of 29 29 photos: Postcards from the Iowa State Fair Republican presidential candidate Jeb Bush speaks to journalists on Friday, August 14. The former Florida governor got grief over the Iraq War launched by his brother. One of the fair-goers asked Bush whether he was being advised by Paul Wolfowitz, George W. Bush's deputy secretary of defense and the architect of his Iraq War policy. Bush said Wolfowitz was providing some advice, but he insisted he was his \"own person\" and pointed the audience to the foreign policy speech he gave earlier this week in California, saying that was where he articulated his policies if spectators wanted more information. Hide Caption 8 of 29 29 photos: Postcards from the Iowa State Fair A reporter uses a cracked smart phone to record Bush. The Republican presidential candidate has become widely known for his weight loss on the \"Paleo\" diet. Hide Caption 29 photos: Postcards from the Iowa State Fair Bush prepares to throw a baseball in front of a crowd. Hide Caption 29 photos: Postcards from the Iowa State Fair A woman riding a chairlift waves at Bush. Hide Caption 11 of 29 29 photos: Postcards from the Iowa State Fair A sheep from Wisconsin is seen at the fair. There are lots of opportunities to check out animals at the fairgrounds. This year, there is a \"Pig Place,\" \"Animal Learning Center,\" \"Sheep Stop,\" \"Horse Haven,\" \"Cattle Corner\" and more, according to the fair's official website. Hide Caption 12 of 29 29 photos: Postcards from the Iowa State Fair Ty Redman, 28, a farmer from Leon, Iowa, attends the fair. He has yet to decide whom he will vote for in the upcoming election. Hide Caption 29 photos: Postcards from the Iowa State Fair Brian Bolton, a Republican from Creston, Iowa, participates in a Cowboy Mounted Shooting competition. Hide Caption 14 of 29 29 photos: Postcards from the Iowa State Fair Caroline Kramer, 18, is from Stanwood, Iowa. She has yet to decide whom she will vote for in the upcoming election. Hide Caption 29 photos: Postcards from the Iowa State Fair A man in a cowboy hat stands inside the office of the Horse Barn. Hide Caption 16 of 29 29 photos: Postcards from the Iowa State Fair Shelby Heston, 16, from Fairfield, Iowa, gets prepped for the Cowgirl Queen competition. Her mother, Krista Heston (right), says she is voting Republican no matter who gets the nomination. Hide Caption 29 photos: Postcards from the Iowa State Fair Fairgoers vote for presidential candidates with corn kernels on Thursday, August 13. Hide Caption 29 photos: Postcards from the Iowa State Fair A dairy cow named Ginger. Hide Caption 29 photos: Postcards from the Iowa State Fair There are 19 rides at the fair, according to the fair website. Hide Caption 20 of 29 29 photos: Postcards from the Iowa State Fair Former Arkansas governor and GOP presidential candidate Mike Huckabee speaks to the crowd. He offered a counter to Jeb Bush's promise to bring the economy back to 4% growth: 6%. \"I believe we can get it to 6 or higher with a fair tax. I'm convinced,\" Huckabee told a crowd of potential caucus-goers at the Iowa State Fair on Thursday. \"I guarantee you we will goose the economy if you bring $11 trillion of working capital back to this country.\" Hide Caption 29 photos: Postcards from the Iowa State Fair Two options for french fries. Hide Caption 22 of 29 29 photos: Postcards from the Iowa State Fair Nyabiay Jieng, 17, from Des Moines, said she has yet to decide whom she will vote for in the upcoming election. Hide Caption 23 of 29 29 photos: Postcards from the Iowa State Fair Retired farmer Glenn Kasper, a conservative, is attending the fair with his wife. He has not picked a candidate yet, he says. Hide Caption 29 photos: Postcards from the Iowa State Fair Big Mac is a 1,166-pound big boar champion. Hide Caption 25 of 29 29 photos: Postcards from the Iowa State Fair Democtratic presidential candidate Martin O'Malley speaks to the audience. The former Maryland governor is Bernie Sanders' foremost progressive challenger for the party's nomination. Hide Caption 29 photos: Postcards from the Iowa State Fair County Fair Queens pose for a picture. Hide Caption 29 photos: Postcards from the Iowa State Fair Twins Quinn and Emerson Eastman, 7, competed in the Twins, Triplets and More Contest. Hide Caption 28 of 29 29 photos: Postcards from the Iowa State Fair Ron Carnegie attends the state fair as George Washington before heading to an Iowa Cubs minor league baseball game. Photographing him there was photographer Landon Nordeman's favorite moment: \"I mean, really, how American can you get?\" As for his second favorite moment, Nordeman says: \"I got to milk a cow.\" Hide Caption 29 of 29 He said the trip to the country that he's visited \"dozens and dozens of times\" since 1973 will include some fundraising efforts. But Huckabee said the trip will be focused on meeting with Israeli officials to discuss the Iran nuclear deal -- which he and the rest of the GOP field opposes. Huckabee courted controversy this summer when he said President Barack Obama, by agreeing to the deal, is marching Israelis \"to the door of the oven.\" \"I think it is the most dangerous situation we face -- not just for the Middle East, but for the rest of the world for a long time,\" he said Sunday. \"This is arming and equipping a terrorist state.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> Race to the White House More from Politics", "external_links": [], "published": "2015-08-16T16:47:00.000+03:00", "crawled": "2015-08-16T16:57:23.568+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}