{"organizations": ["Pueblo Unido", "U.S. Department of Agriculture"], "uuid": "b2ce44f021fe3481b5c58c0a9055a33b5ad6fe3e", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/13/politics/maevewest-coachella-illegal-immigration-drought-california/index.html", "country": "", "title": "The messier side of the immigration debate: water - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "The messier side of the immigration debate: water - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "b2ce44f021fe3481b5c58c0a9055a33b5ad6fe3e"}, "author": "", "url": "http://www.cnn.com/2015/08/13/politics/maevewest-coachella-illegal-immigration-drought-california/index.html", "ord_in_thread": 0, "title": "The messier side of the immigration debate: water - CNNPolitics.com", "locations": ["California", "U.S.", "Coachella Valley"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sergio Carranza", "Ruiz", "Raul Ruiz"], "text": "The place where immigration and drought politics intersect 03:05 Coachella, California (CNN) The political debate over illegal immigration has centered on border security and whether there should be a path to citizenship for the 11 million undocumented living in this country. But the presidential candidates from both parties rarely touch on the more complex questions underpinning the debate like the living conditions of the people who work the fields and whether the government has any role in providing for their basic needs such as clean water. With California in the throes of a historic drought, those issues are converging here in the Coachella Valley, a place best known for its lush resorts and the Coachella Music Festival, but also home to a $600 million dollar agriculture industry. Many of the farm workers here live off the grid in makeshift mobile home parks that are not connected to the water and sewer systems most Americans take for granted. Water shortages across California have put a greater strain on groundwater resources in these communities -- increasing the concentration of contaminants in the well water that they depend on. But the politics of piping clean water to these homes, at a cost of tens of millions of dollars, are complicated. Many of the families are of mixed status, some legal and some not, sparking debate over the amount of taxpayer funds that should be spent. Congressman Raul Ruiz, who grew up in this valley as the son of farm workers and became a doctor, said there are serious health issues at stake within these communities, which he and other activists describe as a cornerstone of the U.S. economy. In the midst of the drought, he said, many of the farm workers who live here must pull more water from the wells: \"and these wells already have arsenic, chromium, selenium and other contaminants in the water. What you're doing is you're increasing the concentration of these contaminants in the well water that humans are consuming.\" \"They live in a completely different reality of water issues than the rest of the state,\" Ruiz said. In some areas, he said, \"we have six times more than the limit of arsenic that is considered safe for human consumption.\" The congressman and non-profit groups have advocated for public and private dollars to be put toward cleaning up the water in the mobile home parks throughout the Valley. Last year, Ruiz secured more than $7 million worth of U.S. Department of Agriculture grants to help deal with the issue. But he argues it deserves far more attention -- which is not a simple matter in the midst of roiling immigration debate. Building the infrastructure that would be needed to tap into the regional water system isn't the most cost effective or politically feasible option for many of these communities effective, says activist Sergio Carranza of the non-profit group Pueblo Unido, which specializes in water issues. \"Creating smaller regional approaches, such as having filtration systems and using on site water systems, creates an opportunity for balance: more cost effectiveness and a new way to sustain the water for existing communities that are in need.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics ", "external_links": [], "published": "2015-08-13T03:00:00.000+03:00", "crawled": "2015-08-13T13:29:46.561+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}