{"organizations": ["NBC", "CNN"], "uuid": "06c6b40b191d2a496be2a902ecb09802a6e0be0e", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150815142257-donald-trump-helicopter-2-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/08/16/politics/john-kasich-iraq-war-2002/index.html?eref=rss_politics", "country": "US", "title": "Trump outlines immigration specifics", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Trump outlines immigration specifics", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T17:55:00.000+03:00", "replies_count": 0, "uuid": "06c6b40b191d2a496be2a902ecb09802a6e0be0e"}, "author": "", "url": "http://edition.cnn.com/2015/08/16/politics/john-kasich-iraq-war-2002/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Trump outlines immigration specifics", "locations": ["United States", "U.S.", "Mexico"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dana Bash", "Trump", "Donald Trump"], "text": "Story highlights Donald Trump outlines his immigration plans His policy paper also explains how he would get Mexico to pay for a border wall (CNN) Republican frontrunner Donald Trump announced Sunday in a policy paper his plans to reform the U.S. immigration system and secure the southern border, providing his most detailed account yet of how he will handle a key policy issue. Trump, who has repeatedly been pressed for specifics on his immigration plan since the issue rocketed him to the top of the polls, for the first time explained how he plans on forcing Mexico to pay for a border wall. He also put forth a plan to reform the legal immigration system in the nearly 1,900 word paper. Trump outlined three \"core principles\": that the U.S. must build a wall across the U.S.-Mexico border, that immigration laws must be fully enforced and that \"any immigration plan must improve jobs, wages and security for all Americans.\" If Mexico refuses to pay for the border wall, as Trump insists they do, he would begin charging additional fees to Mexicans who come into the U.S. on visas or with border crossing cars -- particularly for visas to \"Mexican CEOs and diplomats,\" which Trump would cancel \"if necessary.\" He would also consider tariffs and foreign aid cuts and would seize \"all remittance payments derived from illegal wages.\" \"The Mexican government has taken the United States to the cleaners. They are responsible for this problem, and they must help pay to clean it up,\" the policy paper says. \"We will not be taken advantage of anymore.\" RELATED: Trump on Immigration: 'They have to go' Trump did not, however, provide details on how he would deport all undocumented immigrants living in the United States, before allowing \"the good ones\" to re-enter legally. In fact, Trump does not reference that plan at all, instead only calling for the deportation of all \"criminal aliens\" and making no reference to the deportation of law-abiding undocumented immigrants. But Trump has consistently done so in previous interviews. On July 29, Trump told CNN's Dana Bash, \"I want to move them out and we're going to move them back in and let them be legal. Because they have to be in here legally.\" And in an interview aired Sunday on NBC's \"Meet the Press,\" Trump said simply: \"They have to go.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> Politics Originals", "external_links": [], "published": "2015-08-16T17:55:00.000+03:00", "crawled": "2015-08-16T18:43:12.948+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}