{"organizations": ["Huffington Post"], "uuid": "c8e2300cd4c4035a424d0ebc79e129081972ed62", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e0b70414000077002e452c.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/want-to-reduce-illegal-immigration-end-the-drug-war_55e0b5f7e4b0c818f617d3d1", "country": "", "title": "Want To Reduce Illegal Immigration? End The Drug War.", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Want To Reduce Illegal Immigration? End The Drug War.", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "c8e2300cd4c4035a424d0ebc79e129081972ed62"}, "author": "", "url": "http://www.huffingtonpost.com/entry/want-to-reduce-illegal-immigration-end-the-drug-war_55e0b5f7e4b0c818f617d3d1", "ord_in_thread": 0, "title": "Want To Reduce Illegal Immigration? End The Drug War.", "locations": ["U.S.", "Mexico", "Central America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Roque Planas"], "text": "Want To Reduce Illegal Immigration? End The Drug War. The one way of stemming illegal immigration that Republicans aren't talking about. Roque Planas National Reporter, The Huffington Post Posted: 08/29/2015 08:00 AM EDT Credit: Jae C. Hong/Associated Press Addressing drug war violence in Mexico and Central America will help curb illegal immigration into the U.S. \nSeveral GOP presidential hopefuls have over the last few weeks offered wildly extreme and generally unrealistic proposals for deterring illegal immigration -- largely spurred by Donald Trump’s grandiose plan to deport all 11 million undocumented immigrants in the United States, then let a few of the “good ones” back in , all while building a giant, possibly self-branded border wall. Other ideas Republican primary candidates have pondered lately include eliminating birthright citizenship , which is guaranteed by the 14th amendment to the Constitution, because some argue that it acts as a magnet for undocumented immigrants. \nWhile these ideas might energize the GOP’s conservative base, they wouldn’t do much to deter illegal immigration, for one simple reason: All of these propositions rest on the false assumption that most undocumented immigrants are crossing into the U.S. primarily to look for a better life and a higher-paying job. \nAnyone who speaks to undocumented immigrants regularly knows that they invariably view the dangerous and expensive trip into the U.S. as a last resort, usually because something went horribly wrong at home -- not because of dreams of having a child who is a U.S. citizen. \nMost of those who have crossed the southern border illegally over the last few years are not looking for work -- they’re fleeing violence in their home countries of Mexico, El Salvador, Guatemala or Honduras. All four of these countries have experienced a sharp rise in drug-related violence, which is frequently deadly, over the last decade. In Mexico, for example, former President Felipe Calderón's frontal assault on the country’s cartels, continued by his successor Enrique Peña Nieto, has cost more than 100,000 lives , according to some estimates. \nFor the last five years, Mexico, El Salvador, Guatemala and Honduras have topped the list of countries from which the U.S. receives the most asylum applications , and in the last year alone the number totaled nearly 120,000. \nWhen 68,000 unaccompanied minors, and a similar number of mothers traveling with children, crossed into the U.S. from Central America illegally, they generally didn’t disappear into the shadows, as the talking point goes. Most of them turned themselves in to border officials and asked for asylum or some other form of humanitarian relief. Those who manage to get access to a lawyer, which isn’t easy when you have no money and aren’t entitled to a public defender, usually win and are allowed to stay . \nThe violence and intimidation that comes with the ongoing drug war drove the vast majority of these people from their homes. Some of the violence is spurred by warring cartels fighting to control the routes into the lucrative U.S. drug market . Other times, it's brutal street gangs that intimidate business owners and residents by forcing them to pay protection fees, and scare children into their ranks under the threat of death. Even government forces attack their own civilians , often with total impunity. The U.S. government has spent more than $2.3 billion fighting the drug war in Mexico over the last seven years, but rarely criticizes abuses committed by the security forces it finances. \nThe ongoing violence could be greatly reduced tomorrow if the government halted its efforts to suppress the drug trade and stopped treating its own drug-using citizens like criminals. For conservatives, this plan has the added bonus of shrinking the size of government rather than ballooning it by billions of dollars -- as both Trump and slightly more moderate candidates in the Republican primary, like former Florida Gov. Jeb Bush and Sen. Marco Rubio (R-Fla.) propose to do. \nThe drug war policy, which costs so many lives, has become increasingly absurd given the legalization of marijuana in many states. Consider for a moment that weed accounted for nearly 90 percent of the drugs seized on the U.S.-Mexico border from 2005 to 2011, according to an analysis by the Center for Investigative Reporting. Almost every time a Border Patrol official makes a drug bust, it’s to confiscate a drug that can be bought and sold legally today in Colorado and Washington. Oregon, the District of Columbia and Alaska have also passed legislation to allow the recreational use of weed. If the U.S. were to legalize marijuana across the entire country, Mexico’s cartels would lose a significant chunk of their profits . \nLegalizing the recreational use of marijuana should be a no-brainer for policymakers who are seriously concerned about national security and the integrity of our own criminal justice system. Public health concerns, however, make crafting policies that would eliminate the black market for other more harmful drugs less straightforward. \nBroad consensus exists, however, among leading Latin American voices of the left, right and center, that the focus should shift away from criminalizing users. They're urging governments “not to shy away from the transformative potential of regulation,” in the words of the Global Commission on Drug Policy, a group led by several former Latin American heads of state. \nAs long as the violence continues in Mexico and Central America, people will continue to flee to the United States. Bigger border walls won’t do much to keep them from searching for safety. Ending the drug war will. ", "external_links": [], "published": "2015-08-29T03:00:00.000+03:00", "crawled": "2015-08-29T16:34:47.771+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}