{"organizations": ["GOP", "CNN"], "uuid": "86dc9fdbc3bc5ba9622adc636f69d7cc5055819e", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/19/politics/donald-trump-chris-cuomo-cnn-interview-immigration/index.html", "country": "", "title": "Donald Trump: 'I have to do right thing' on immigration - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Donald Trump: 'I have to do right thing' on immigration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "86dc9fdbc3bc5ba9622adc636f69d7cc5055819e"}, "author": "", "url": "http://www.cnn.com/2015/08/19/politics/donald-trump-chris-cuomo-cnn-interview-immigration/index.html", "ord_in_thread": 0, "title": "Donald Trump: 'I have to do right thing' on immigration - CNNPolitics.com", "locations": ["New York", "Mexico", "U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Trump", "Donald Trump", "Cuomo", "Chris Cuomo", "Wolf Blitzer"], "text": "Trump said he wouldn't need to amend the Constitution to revoke birthright citizenship But the GOP front-runner said there are \"a lot of good ones\" among undocumented immigrants New York (CNN) Donald Trump isn't backing down from his call to revoke citizenship for children born in the U.S. to undocumented immigrant parents despite concerns he'll turn Hispanic voters off to the GOP. \"I have to do the right thing,\" the mogul said in an interview with CNN's Chris Cuomo Wednesday, when asked about his immigration plan being under fire. Trump has called for building a wall along the border with Mexico, revoking the right to citizenship to children born the U.S. if their parents aren't documented, and for deporting undocumented immigrants and then allowing \"good ones\" to re-enter the country. He has been hit with criticism from some Republicans while taking and heavy fire from the left. He even took flak as he sat down for the interview with CNN in Trump Tower, when an onlooker in the lobby of the building shouted: \"You will never win the Latino vote. The Latino (voters) don't like you.\" RELATED: Trump's immigration plan: the specifics Trump didn't respond to the heckler, and after the interview finished taping, two people watching from the crowd told Trump they were Mexicans and would gladly support and work for him, which he relayed to Cuomo. \"You know, this country is so politically correct. Nobody wants to take a stance on anything,\" Trump told Cuomo. \"Now they like to use the word undocumented because it's more political -- I don't use that word. They're illegal immigrants. They came over illegally. Some are wonderful people, and they've been here for a while. They've got to go out. They've got to leave.\" He did say there were \"a lot of good ones\" among immigrants, and that he would try to bring them back. \"These people -- the really good ones, and we have some great ones -- we're going to try and expedite so they can come back,\" he said. \"But they're going to come back legally.\" RELATED: Trump's immigration plan: the specifics The candidate also reiterated that he believes in changing birthright citizenship -- which grants automatic citizenship to all children born in the U.S. -- though he said he wouldn't need to amend the Constitution to do it. \"No. 1, the 14th Amendment is very questionable as to whether or not somebody can come over, have a baby and immediately that baby is a citizen. OK?\" Trump said. \"Amending is too big a deal. It's going to take -- it'll be two terms. I'd be in my second term or my eighth year by the time -- assuming everything went smoothly. ... I believe you can win it legally.\" He said people can't be allowed to just \"walk over\" the border to give birth. \"You have people on the border and in one day they walk over, have a baby. And now all of a sudden we're supposed to pay the baby ... medical, Social Security,\" Trump said. Watch The Situation Room with Wolf Blitzer weekdays at 4pm to 6pm ET and Saturdays at 6pm ET. For the latest from The Situation Room click here. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> Race to the White House More from Politics ", "external_links": [], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-20T00:08:22.638+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}