{"organizations": ["Violating Constitutional Rights Youth Sue Obama Administration For Allowing Climate Change", "Youth Sue Obama Administration For Allowing Climate Change"], "uuid": "4bb4fb2b5d7dba9a03d60b753768f71fe882fccd", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55cbc67b1d00002f00144a5c.jpeg?cache=mLVxARQyf7", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/youth-obama-climate-change-lawsuit_55cbc451e4b064d5910a7183", "country": "", "title": "Youth Sue Obama Administration For Allowing Climate Change, Violating Constitutional Rights", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Youth Sue Obama Administration For Allowing Climate Change, Violating Constitutional Rights", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T02:56:00.000+03:00", "replies_count": 0, "uuid": "4bb4fb2b5d7dba9a03d60b753768f71fe882fccd"}, "author": "", "url": "http://www.huffingtonpost.com/entry/youth-obama-climate-change-lawsuit_55cbc451e4b064d5910a7183", "ord_in_thread": 0, "title": "Youth Sue Obama Administration For Allowing Climate Change, Violating Constitutional Rights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Youth Sue Obama Administration For Allowing Climate Change, Violating Constitutional Rights \"We have a moral obligation to leave a healthy planet for future generations.\" Dhyana Taylor Politics Intern, The Huffington Post Posted: 08/12/2015 07:08 PM EDT \nTwenty-one young people from around the country filed a lawsuit against the Obama administration on Tuesday accusing the federal government of violating their rights by contributing to climate change through the promotion of fossil fuels. \nThe plaintiffs, who range in age from 8 to 19, filed their complaint in U.S. District Court in Oregon. The complaint lists numerous defendants, including President Barack Obama, Secretary of State John Kerry, the Department of Energy, the Department of the Interior, the Department of Transportation, the Department of Agriculture, the Department of Defense and the Environmental Protection Agency. Meg Ward, Our Children's Trust \n\"Defendants have for decades ignored their own plans for stopping the dangerous destabilization of our nation's climate system,\" the plaintiffs said in their complaint , which was filed with the help of the Oregon-based nonprofit Our Children's Trust . \"Defendants have known of the unusually dangerous risk of harm to human life, liberty, and property that would be caused by continued fossil fuel use and increase [carbon dioxide] emissions.\" \nWhile setting new policies to reduce carbon emissions, the Obama administration has often touted an \"all of the above\" approach to energy policy that includes oil, natural gas, coal and renewable energy, the complaint continues. By continuing to promote the development and use of fossil fuels, the federal government violated their constitutional rights, the young plaintiffs allege. \n\"What we are providing is an opportunity for them to participate in the civic democratic process and go to the branch of government that can most protect their rights,\" said Julia Olson, the lead counsel on the case. \nOlson, a public interest attorney, has been working closely with plaintiff Xiuhtezcatl Martinez, 15, since 2011. It was Martinez who originally asked Olson to prepare the case against the United States government. \nMartinez, who serves as the youth director for Earth Guardians , spoke before the United Nations General Assembly in June and demanded world leaders take action against climate change. It was his third time addressing the United Nations. \nClimate change threatens the forests surrounding Martinez's home in Boulder, Colorado, and will lead to a scarcity of water, the complaint says. Another plaintiff, 18-year-old Alexander Lozak, said that extreme drought conditions are threatening the Oregon land that his great, great, great, great, grandmother first farmed. \n\"The health and bodily integrity of his family and their farm, which they rely on for food and as a source of income—as well as for their personal well-being—increasingly are harmed by climate change caused by Defendants,\" the complaint says. Meg Ward, Our Children's Trust \nThe youngest plaintiff, 8-year-old Levi Draheim, said he can no longer swim in the river near his home in Indialantic, Florida, because of an increase in bacteria and fish die-offs. \nIn response to the complaint, the Environmental Protection Agency defended its work to confront climate change, which it described as \"the biggest environmental challenge we face.\" \n\"That's why President Obama launched the Climate Action Plan and why EPA is taking action with our Clean Power Plan: to give our kids and grandkids the cleaner, safer future they deserve,\" Laura Allen, deputy press secretary for the EPA, said in a statement to The Huffington Post. \"We have a moral obligation to leave a healthy planet for future generations.\" \n\"A child born today will turn fifteen in the year 2030 – the year when the full benefits of the Clean Power Plan will be realized,\" Allen added. \"The actions we take now will clear the way for that child – and kids everywhere – to learn, play, and grow up in a world that’s not only clean and safe, but full of opportunity.\" \nIn early August, Obama called climate change \" one of the key challenges of our lifetime .\" \n\"We're the first generation to feel the effects of climate change and the last generation that can do something about it,\" the president told an audience at an event in the White House's East Room, where he unveiled new regulations on emissions from power plants. \nBut in the eyes of Olson and the plaintiffs, that's not enough. They are asking for a court order to force Obama to immediately implement a national plan to decrease atmospheric concentrations of carbon dioxide to 350 parts per million -- a level many scientists agree is the highest safe concentration permissible -- by the end of this century. The concentration of carbon dioxide in the atmosphere has already hit 400 parts per million . \n\"It's really important that the court step in and do their jobs when there's such intense violation of constitutional rights happening,\" Olson said. \nThe White House did not immediately respond to a request for comment. ", "external_links": [], "published": "2015-08-13T02:56:00.000+03:00", "crawled": "2015-08-13T02:56:16.141+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}