{"organizations": ["The Center for Medical Progress", "StemExpress", "CNN", "CMP"], "uuid": "0171e2739bb94691dc219fb79ef169807b7428b4", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/21/politics/planned-parenthood-abortion-video-center-for-medical-progress/index.html", "country": "", "title": "Anti-abortion group releases 8th Planned Parenthood video - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Anti-abortion group releases 8th Planned Parenthood video - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "0171e2739bb94691dc219fb79ef169807b7428b4"}, "author": "", "url": "http://www.cnn.com/2015/08/21/politics/planned-parenthood-abortion-video-center-for-medical-progress/index.html", "ord_in_thread": 0, "title": "Anti-abortion group releases 8th Planned Parenthood video - CNNPolitics.com", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David", "Eric Ferrero", "O'Donnell", "Daleiden", "StemExpress", "Eugene Scott", "Holly O'Donnell"], "text": "What's next in Planned Parenthood fight? 05:57 Story highlights The heavily edited video features five different Planned Parenthood leaders speaking about potential sales and procedures It is against federal law to sell organs and tissues from aborted fetuses Washington (CNN) A group targeting Planned Parenthood released another video Friday that purports to show the controversial organization breaking federal laws in its abortion procedures. The heavily edited two-minute video, from The Center for Medical Progress, is part of the group's \"Human Capital\" series and features five different Planned Parenthood leaders from across the country speaking about potential sales and procedures interspersed with recollections from Holly O'Donnell, a former procurement technician for StemExpress, a biomedical research company. \"We were asked to procure certain tissues, like brain, liver, thymus, pancreas, heart, lungs and pretty much anything on the fetus,\" O'Donnell says in the video. The video is the eighth such clip from The Center for Medical Progress featuring Planned Parenthood leaders discussing the harvesting and sale of organs, claims that have become a political and cultural flashpoint in the debate over abortion. The California-based, anti-abortion group has released other videos that it claims are unedited. It is against federal law to sell organs and tissues from aborted fetuses. Several GOP presidential candidates have called for the women's health organization to be defunded. A spokesman for Planned Parenthood said Friday night that the undercover film was politically motivated. \"There's nothing on this extremely heavily edited video that hasn't already been seen and discredited,\" said Eric Ferrero, a Planned Parenthood spokesman. \"There seems to be no limit to how far this group will go to deceive the public in order to pursue an extreme political agenda.\" And StemExpress said in a statement that the discussion was about \"intact livers,\" not fetuses, adding that livers are \"among the most urgently needed of medical tissues by scientists and medical researchers working to cure cancer, diabetes and Alzheimer's disease.\" The company added: \"StemExpress has never requested, received or provided to a researcher an 'intact fetus.' CMP's and (organization leader David) Daleiden's claims to the contrary are unequivocally false.\" CNN's Eugene Scott contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics ", "external_links": [], "published": "2015-08-22T03:00:00.000+03:00", "crawled": "2015-08-22T06:45:40.858+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}