{"organizations": [], "uuid": "3ffb5dbd4465a92f86f074247d9150307769000f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/flakejeff_061313gn_0.jpg", "site_section": "http://thehill.com/taxonomy/term/36/feed#", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/policy/national-security/250839-senate-republican-predicts-obama-will-win-on-iran", "country": "US", "title": "GOP's Sen. Flake predicts Obama will win on Iran", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP's Sen. Flake predicts Obama will win on Iran", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T20:26:00.000+03:00", "replies_count": 0, "uuid": "3ffb5dbd4465a92f86f074247d9150307769000f"}, "author": "jhattem@thehill.com (Julian Hattem)", "url": "http://thehill.com/policy/national-security/250839-senate-republican-predicts-obama-will-win-on-iran", "ord_in_thread": 0, "title": "GOP's Sen. Flake predicts Obama will win on Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP's Sen. Flake predicts Obama will win on Iran Greg Nash By Julian Hattem - 08/11/15 01:26 PM EDT \nA Senate Republican is predicting opponents of the Iran nuclear deal won't be able to overcome a veto by President Obama of a resolution disapproving the accord. \n\"I still believe that the president will have enough votes to sustain a veto,\" Sen. Jeff Flake (R-Ariz.) told the The Arizona Republic in an interview published over the weekend. ADVERTISEMENT The comments from Flake — who has emerged as one of the few possible Republican supporters of the nuclear deal — could be troubling for its opponents. \nDespite Sen. Charles Schumer’s (D-N.Y.) announcement that he would oppose the deal , critics of the Iran deal have been confronted with a steady stream of Democratic lawmakers backing it. \nWhile a resolution of disapproval will surely pass the House and could win the 60 votes necessary to overcome a filibuster in the Senate, winning the two-thirds majority in each chamber to overcome veto looks difficult. If all Republicans vote to kill the deal, they will need to peel off 13 Democrats in the Senate and 44 in the House to override a veto. \nOn Monday, Flake’s fellow Arizonan, Sen. John McCain (R), appeared confident that the Senate would be able to overcome a filibuster , but he was less sure about overriding a veto. \nLobbying on the Iran deal has stayed as hot as ever during the August recess. \n“I’m getting a lot of calls,\" Flake told The Republic . \"There are calls and e-mails to the office and calls personally from people who just want to know where I am. \n\"My concern has been that we are, with this agreement, giving up some of the tools that we have used in the past or could use in the future to deter or punish that kind of behavior,\" he added. \nIn particular, he has said he wants to make sure that the U.S. can still impose penalties on Iran for other behaviors, such as human rights abuses and support for global terrorism. \n\"The administration says, no, we're not giving up our ability, for example, to impose sanctions,” he said. “But if you read the agreement, it seems to indicate otherwise, and the Iranians certainly believe otherwise, and have said so.\" Tags:", "external_links": [], "published": "2015-08-11T20:26:00.000+03:00", "crawled": "2015-08-12T02:54:00.338+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}