{"organizations": [], "uuid": "e113b876711715b4dbe6d2fbcb6bd84aeb6734db", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/methane_113013getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/251171-obama-seeks-new-air-pollution-limits-for-landfills", "country": "US", "title": "Obama seeks new air pollution limits for landfills", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama seeks new air pollution limits for landfills", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T23:40:00.000+03:00", "replies_count": 0, "uuid": "e113b876711715b4dbe6d2fbcb6bd84aeb6734db"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/251171-obama-seeks-new-air-pollution-limits-for-landfills", "ord_in_thread": 0, "title": "Obama seeks new air pollution limits for landfills", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama seeks new air pollution limits for landfills Greg Nash By Timothy Cama - 08/14/15 04:40 PM EDT \nThe Obama administration on Friday said it wants to restrict allowable methane emissions from landfills by about a third. \nThe mandate for new pollution-reduction systems for standard landfills would reduce methane emissions by 487,000 tons annually when they fully take effect in 2025, the Environmental Protection Agency (EPA) said. ADVERTISEMENT Friday’s action is the latest move by the Obama administration to cut methane, a greenhouse gas about 25 times more powerful than carbon dioxide in terms of global warming potential.\nObama set out last year to restrict methane through new rules or voluntary measures from the oil and gas sector, agriculture and other industries. \n“Children, older adults, people with heart or lung disease and people living in poverty may be most at risk from the health impacts of climate change,” the EPA said in a statement. “In addition to methane, landfills also emit other pollutants, including the air toxics benzene, toluene, ethylbenzene and vinyl chloride.” \nThe announcement includes separate proposals for new and modified landfills and for existing ones. The emissions-reduction technology would also capture other pollutants. \nThe rules would update regulations last written in 1996 for landfill pollution. \nThe methane reductions under the proposal are the equivalent of the carbon dioxide emissions caused by 1.1 million homes, valued at $750 million a year — about 14 times the cost of compliance. \nThe Environmental Defense Fund applauded the proposal and said that it was long overdue. \n“Common-sense, highly-cost effective opportunities are available to reduce landfill methane emissions and protect public health,” Peter Zalzal, a senior attorney with the group, said in a statement. “Landfills are a major source of potent methane emissions and proven best practices can readily be deployed to reduce these harmful emissions.” Tags:", "external_links": [], "published": "2015-08-14T23:40:00.000+03:00", "crawled": "2015-08-15T04:52:26.777+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}