{"organizations": [], "uuid": "70e537028a9a86987e887e38177d59ac17e04365", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/08/03/el-mandatario-estadounidense-dijo-que-las-medidas-anunciadas-son-las-ms-importantes-realizadas-contra-el-calentamiento-de-la-tierra.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/08/03/obama-presenta-el-paso-mas-grande-de-eu-contra-el-cambio-climatico", "country": "", "title": "Obama presenta \"el paso más grande\" de EU contra el cambio climático", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama presenta \"el paso más grande\" de EU contra el cambio climático", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "70e537028a9a86987e887e38177d59ac17e04365"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/08/03/obama-presenta-el-paso-mas-grande-de-eu-contra-el-cambio-climatico", "ord_in_thread": 0, "title": "Obama presenta \"el paso más grande\" de EU contra el cambio climático", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Obama presenta \"el paso más grande\" de EU contra el cambio climático El mandatario divulgó un plan para reducir drásticamente las emisiones de gases de efecto invernadero; estados de EU anunciaron rechazo Por Allie Malloy y Sunlen Serfaty Lunes, 03 de agosto de 2015 a las 15:12 El mandatario estadounidense dijo que las medidas anunciadas son las más importantes realizadas contra el calentamiento de la Tierra (Reuters). Lo más importante El proyecto es \"el paso más grande e importante que hemos tomado contra el cambio climático\", dijo Obama Incluso antes de que fuera anunciado el nuevo plan, muchos estados anunciaron planes para combatirlo Temas relacionados Glaciares de Groenlandia 'corren' contra tiempo \nWASHINGTON (CNN) — La administración del presidente de Estados Unidos, Barack Obama, reveló un plan mayor contra el cambio climático, dirigido a reducir drásticamente las emisiones de gases de efecto invernadero de las plantas de energía basadas en combustión de carbono. \nEste lunes, Obama comenzó a presentar su propuesta al público, durante un evento realizado en la Casa Blanca. \n\"Hoy, luego de trabajar con los estados y las ciudades así como las compañías de energía, la Agencia de Protección Ambiental de Estados Unidos (EPA, por sus siglas en inglés) establece los primeros estándares a nivel nacional para terminar con la disposición sin límite de contaminación de carbono, por parte de las plantas de energía\", dijo el mandatario estadounidense este lunes desde la Casa Blanca. \nEl \"Plan para Limpiar la Energía” es la última versión de las regulaciones que emitió la EPA, y según Obama es \" el paso más grande e importante que hemos tomado contra el cambio climático\". \nBajo el plan, la administración requerirá a los estados que reúnan estándares específicos para reducir las emisiones de carbono, basados en su consumo individual de energía. \nEl plan también incluye un programa de incentivos para los estados a fin de que puedan comenzar a cumplir con los estándares durante sus primeras etapas, para producir energía renovable y de bajo costo. \n\"Las plantas de energía son la fuente más grande de contaminación derivada de la emisión de carbono que contribuye al cambio climático”, dijo Obama en un video difundido por la Casa Blanca. \n\"Hasta ahora, no se han establecido límites federales para la cantidad de emisión de carbono que se lanza al aire\". \nIncluso antes de que fuera anunciado el plan nuevo, muchos estados anunciaron planes para combatirlo, amenazando con llevar a la administración estadounidense a la corte por las nuevas reglas. \nEl líder del Senado, Mitch McConnell, pidió a los estados que no se adhieran al plan, en una carta enviada a los 50 gobernadores de Estados Unidos. \nLos críticos aseguraron que el plan conllevará incrementos en los precios de electricidad. \nEn una conferencia con la prensa realizada este lunes, Gina McCarthy, administradora de la EPA, dijo que el plan costará un total de 8,400 millones de dólares, con beneficios que irán de los 34,000 a los 54,000 millones de dólares. \nUna campaña multimillonaria respaldada por la industria de la energía ha buscado descalificar los estudios científicos que alertan sobre un cambio climático, pero encuestas han arrojado que la mayoría de los estadounidenses creen que el planeta se está calentando. \nEl carbono aportó el 37% de la electricidad en Estados Unidos en 2012, comparado con 30% por parte del gas natural, 19% de las plantas de energía nuclear, 7% de fuentes hidrológicas como presas y un 5% de recursos renovables como el viento y el sol, según reportó la Administración de Información de Energía de EU. \nLa batalla que se vislumbra \nLa lucha legal que se vendrá podría ser un legado mayor para la administración de Obama, justo en la transición del último cuarto de su presidencia. \n\"Hay pocos temas que son más importantes para el presidente”, dijo un funcionario de primer nivel de la administración estadounidense, añadiendo que Obama hará del cambio climático un tema moral, económico y de seguridad nacional en los próximos meses. \nLa Casa Blanca lanzará un “impulso contra el cambio climático” que implementará el presidente y sus secretarios, a fin de que el plan sea aceptado. Obama viajará a Nevada para hablar en la Reunión Nacional de Energía Limpia y luego se convertirá en el primer presidente estadounidense que visite el Ártico en Alaska. Encuentra este artículo con: mundo, estados unidos, barack obama, presidente, cambio climatico, plan, reducir, emisiones, gases efecto invernadero, plantas energia, casa blanca Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"923b35bd9c764d458bad6edf7994fc24\", \"time\": \"2015-08-04T03:29:45.699Z\" } Video ", "external_links": [], "published": "2015-08-03T03:00:00.000+03:00", "crawled": "2015-08-04T06:29:56.046+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}