{"organizations": [], "uuid": "095d37b4e4de76cbcc1319a552fce260e71d0946", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/shopping/feed", "section_title": "Shopping on Huffington Post", "url": "http://www.huffingtonpost.com/jon-bird/kenyan-retail-in-the-foot_b_7956216.html", "country": "US", "title": "Jon Bird: Kenyan Retail in the Footsteps of Obama and Satya", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Jon Bird: Kenyan Retail in the Footsteps of Obama and Satya", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T13:37:00.000+03:00", "replies_count": 0, "uuid": "095d37b4e4de76cbcc1319a552fce260e71d0946"}, "author": "Jon Bird", "url": "http://www.huffingtonpost.com/jon-bird/kenyan-retail-in-the-foot_b_7956216.html", "ord_in_thread": 0, "title": "Jon Bird: Kenyan Retail in the Footsteps of Obama and Satya", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \n\"There's something happening here. What it is ain't exactly clear.\" \nThe lyrics to the 1967 Buffalo Springfield protest anthem popped into my head as I toured Nairobi in late July. There's definitely something happening here. The week before my visit, Barack Obama had been in town and the buzz was still palpable. Roadside billboards still \"welcomed home\" Obama (and my guess is that they may stay in place for some time). And while I was there, Microsoft CEO Satya Nadella arrived - choosing Kenya as his favored place in the world to launch Windows 10 . This was all pretty impressive - the leader of the free world, and one of the world's captains of tech both in town in the space of a week. \nBut I wasn't here for politics or software. I was in Kenya for retail. And there is a lot happening in this sector too. Kenya seems on the verge of exploding from an emerging economy to a fully-fledged consumer economy. The middle class is growing. Bright, shiny new shopping malls are popping up everywhere in Nairobi. (\"A new dawn, a new shopping experience\" one billboard trumpeted, while at the base was a raggedy bunch of street traders hawking their wares.) \nNot that these shopping malls - and Kenya generally - lack problems. Kenya is addressing significant challenges in terms of corruption, infrastructure, and most obviously, security. \n\"There's a man with a gun over there. Telling me I got to beware.\" \nOne of the shopping centers that I stopped in at was the Westgate Mall - the site of the terrorist attack in 2013 that tragically claimed 67 deaths, with 175 wounded. It had just reopened after a major remodeling, and as with many places in Kenya, armed guards with submachine guns stood watchfully at the entry, and I had to submit myself to airport-style security just to get in the front doors. To Western eyes, this was confronting. To the locals, it's just a necessary part of life. \nOnce inside, you could be anywhere in the world. The Westgate \"shopping experience\" was largely an international one - albeit with many local retailers present (and some good ones at that). There were the same escalators, marble and glass you'd find in a squillion shopping centers around the globe. New global brands like KFC were present. The mall was a work-in-progress though, with many stores yet to open, and a visible lack of polish to the building finishes. Workmanship is another issue in Kenya right now. \nIt was interesting to see the burgeoning retail development in Kenya. But a mall is a mall, and far more fascinating to me were the multiple tiers of retail. \n\"What a field day for the heat. A thousand people in the street.\" \nLike much of Africa, Kenya is a nation of traders. Merchants are everywhere. Stop your car at a traffic light and enterprising hawkers thrust goods in your face. On the roadside are individual stalls offering fruit and fresh juice. Clustered together in shantytown style structures are the \"Jua Kali\" artisans - the name meaning literally \"hot sun\", because they largely work in the open air. \nThen you move up to the convenience stores and supermarkets, again with several levels from basic to gourmet. Entry-level supermarkets are often situated next to transport hubs. Workers buy their single serves of cooking fat or oil, or bar soap (a practice known as \"dolloping\") from a \"kipimo\" (Swahili for \"measured\") market and jump into a \"matatus\" (minibus) for the ride home. \nThe distinction between retail tiers comes down to the type of consumer and shopper - whether you are paid daily, weekly or monthly. If you're paid daily, you shop the same way, carefully doling out your money for the single meal of the day. If you're remunerated monthly, you will stock up on groceries at a fancier supermarket, and be a regular at the mall. \n\"I think it's time we stop, hey, what's that sound. Everybody look what's going down.\" \nIt would be a mistake though to characterize Kenyan retail (or Kenya generally) as unsophisticated. In some ways it is ahead of more mature markets. Perhaps the key here is the way that the average Kenyan embraces and uses technology. \nAccording to Africatime.com in a country of 40 million people, 33 million are subscribed to a mobile network. Fixed line communication is virtually non-existent, and is priced the same as mobile. And one of the key uses of all those mobile phones is shifting money around and paying for goods via a neat system called \"M-Pesa\" (\"M\" for mobile, \"Pesa\" the Swahili word for money). There are 26 million M-Pesa subscribers. \nForget the recent wonders of Apple Pay. M-Pesa was introduced seven years earlier, back in 2007, the same year that the iPhone was launched. Invented in Kenya, the service allows customers to deposit money into an account linked to their mobile phones, and then easily make use of those funds. In all the retail outlets I went to there was an M-Pesa sign at the register with a special code. Want to buy something? Just text your payment. Simple and smart. \nInnovation continues apace. After all, Kenya is becoming the \"Silicon Savannah\", with tech start-ups emerging, bringing all kinds of new ideas to market like the \"Brck\" - a brick-shaped device that broadcasts a Wi-Fi signal that can be shared in areas with marginal Internet connection. (Reliable broadband can be an issue in Africa.) \nServices too are being digitized in a way that (at least in the U.S.) we can only dream about. At ecitizen.go.ke , the average Kenyan can apply for a driver's license, a marriage certificate, or register for a business without physically standing in line at a government office. \nTo use Barack Obama's words, \"Africans are beginning to leapfrog old technologies into new prosperity.\" That's a key statement - the new world is not bound by the legacy systems we have in the old world. \nVimal Shah , the renowned Kenyan entrepreneur and CEO of Bidco told the group I was with, \"the sun always shines in Kenya\". He meant that statement figuratively as well as literally. Kenya is ambitious - the government has a 2030 Vision, and they are rapidly moving towards it. \nAs Obama also said in his visit, \"Africa is on the move\" and Kenya (and East Africa) is at the leading edge of that momentum. There's something happening here and from a retail perspective, it's one of the most exciting places in the world to be. \nFollow Jon Bird on Twitter: www.twitter.com/thetweetailer More:", "external_links": [], "published": "2015-08-13T13:37:00.000+03:00", "crawled": "2015-08-13T17:44:45.333+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}