{"organizations": [], "uuid": "9076a2f3ec75470f3ebc62aaf7b2f270e97fef23", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/putininternal15151.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/08/08/gop-lawmakers-blast-obama-administration-after-russia-attempts-massive-arctic/", "country": "US", "title": "'Strategic blunder': Republicans slam Obama administration as Russia tries Arctic land grab", "performance_score": 4, "site": "foxnews.com", "participants_count": 30, "title_full": "'Strategic blunder': Republicans slam Obama administration as Russia tries Arctic land grab | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-08T03:00:00.000+03:00", "replies_count": 31, "uuid": "68ad983f1e13690ee506d1707869daba95720b1c"}, "author": "Adam Shaw", "url": "http://www.foxnews.com/politics/2015/08/08/gop-lawmakers-blast-obama-administration-after-russia-attempts-massive-arctic/#post-0", "ord_in_thread": 0, "title": "'Strategic blunder': Republicans slam Obama administration as Russia tries Arctic land grab", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Adam Shaw\nPublished August 08, 2015 FoxNews.com Aug 5, 2015: Russian President Vladimir Putin attends a meeting with senior government officials at the Novo-Ogaryovo residence outside Moscow, Russia. (AP)\nRepublican lawmakers slammed the Obama administration this week after Russia announced it had submitted a bid to the United Nations for huge areas of the Arctic that could contain vast quantities of oil and gas, with one lawmaker describing the application as evidence of a “strategic blunder” on the part of the administration's foreign policy.\nRussia’s foreign ministry said in a statement Tuesday that Moscow was claiming over 463,000 square miles of Arctic sea shelf, extending more than 350 nautical miles from the shore.\nThe Arctic is believed to hold up to 25 percent of the planet’s untapped oil and gas supplies. Russia, the U.S. and Canada are among those trying to assert jurisdiction over parts of the region.\nSen. Dan Sullivan, R-Alaska, told FoxNews.com he isn’t surprised by what he called Russia's “latest attempt to grab territory in the Arctic” and noted that the move comes after Vladimir Putin has been amassing forces in the region.\n“Meanwhile, in the face of this Russian military buildup, we are significantly reducing Army forces in our nation’s only Arctic state, Alaska. This is a strategic blunder by the Obama administration,” Sullivan said.\nRussia first submitted its claim to the territory in 2002, but it was rejected by the U.N. due to lack of evidence. In 2007, Russia staked a symbolic claim to the Arctic seabed by dropping a canister containing the Russian flag on the ocean floor from a submarine at the North Pole.\nThe Kremlin submitted a partial revision regarding the Okhotsk Sea in 2013, and the commission issued a recommendation the following year.\nThe Russian foreign ministry said their new bid contains new arguments and \"ample scientific data\" to back up their claim.\nMoscow has ramped up its military presence in the Arctic recently, restoring a Soviet-era military base in the New Siberian Island and other Arctic military outposts. The Russians have also conducted large-scale military exercises involving tens of thousands of troops, dozens of ships and submarines, and over 100 aircraft.\nRELATED VIDEO: Was Mitt Romney right about Russia?\nSullivan called for the administration to increase U.S. physical presence in the region in response, but said that the administration “seems more focused on climate change.”\n”Right now, the Russians are playing chess in the Arctic and our Administration still seems to think it’s tic-tac-toe,” Sullivan said.\nThe State Department told FoxNews.com that Moscow was following appropriate procedure under the Law of the Sea Convention.\n“This technocratic process is the usual manner in which coastal states secure legal certainty in their sovereign rights and jurisdiction to continental shelf beyond 200 nautical miles,” a State Department spokesperson said.\nSullivan’s fellow GOP Alaska Sen. Murkowski appeared to agree with the State Department, acknowledging that Russia is following protocol as a party to the Law of the Sea, and in contrast to Sullivan, saw it at as a more measured approach from the Russians than in other regions.\n“At this point, it’s worth noting that Russia is following protocol and following international agreements in submitting their claims rather than unilaterally claiming them via military force as they’ve done in other parts of the world,” a spokesperson for Sen. Murkowski told FoxNews.com.\nLawmakers in the House, however, joined Sen. Sullivan in taking aim at the administration.\n“Russia’s latest move into the Arctic is the fruit of the Obama administration’s failed energy policies. Obama has sent a clear signal to the world -- which Russia has correctly interpreted -- that our nation is choosing weakness when it comes to energy development,” Julia Slingsby, press secretary for the House Committee on Natural Resources, said.\n“Instead of letting Russia bully us, America should be exerting our energy power by developing our resources on multiple fronts. A strong American presence in the Arctic means a safer Arctic,” Slingsby said.\nHouse Foreign Affairs Committee Chairman Ed Royce, R-Calif., chose not to criticize the Obama administration directly, but said the U.S. and its allies should stand up to Russia.\n“Russia has been aggressively pushing its claims to the Arctic, especially the resource-rich continental shelf. It now has an Arctic Command to strengthen its military presence in the region. The U.S. and others bordering the Arctic must maintain a united front against Moscow’s aggressive ambitions toward this vital region,” Royce told FoxNews.com in a statement.\nThe Associated Press contributed to this report.\nAdam Shaw is a Politics Reporter for FoxNews.com. He can be reached here or on Twitter: @AdamShawNY .\nAdvertisement\nTrending in Politics 1 'Strategic blunder': Republicans slam Obama administration as Russia tries Arctic land grab 2 Obama administration accused of stonewalling in suit over downing of SEAL Team 6 chopper 3 GOP 2016 candidates look to seize momentum out of debates 4 Michigan pol reportedly tried to fake male prostitute scandal to hide relationship 5 Dem defections show deep divisions in party over Iran nuclear deal See all Trends Advertisement", "external_links": ["http://www.twitter.com/adamshawny"], "published": "2015-08-08T03:00:00.000+03:00", "crawled": "2015-08-08T12:15:18.171+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}