{"organizations": ["University of Colorado", "U.N.", "University of Arizona", "Cato Institute", "University of East Anglia", "Clean Power", "Cornell University", "Asthma and Allergy Foundation of America", "National Academy of Sciences"], "uuid": "a90e408636f35c20c4230da4ff25b356e92a8958", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/04/opinions/knappenberger/index.html", "country": "", "title": "Obama Clean Power Plan: Why it's misguided (Opinion) - CNN.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama Clean Power Plan: Why it's misguided (Opinion) - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "a90e408636f35c20c4230da4ff25b356e92a8958"}, "author": "", "url": "http://www.cnn.com/2015/08/04/opinions/knappenberger/index.html", "ord_in_thread": 0, "title": "Obama Clean Power Plan: Why it's misguided (Opinion) - CNN.com", "locations": ["United States", "North American", "Louisville", "Costa Rica", "St. Martin's Island", "India", "California", "Alsek River", "Mount Kilimanjaro", "Mexico", "U.S.", "Western United States", "Brazil", "Paris", "Kentucky", "Africa", "South Sudan", "New Jersey", "Bass Lake", "China", "Bangladesh"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ernest Hemingway", "Barack Obama", "Chip Knappenberger", "Obama"], "text": "Obama reveals plan to combat climate change 02:32 Story highlights President Barack Obama unveiled Clean Power Plan on Monday Chip Knappenberger: Plan will be ineffective at improving public health Chip Knappenberger is the assistant director of the Center for the Study of Science at the Cato Institute. The views expressed are his own. (CNN) In unveiling the final details of his Clean Power Plan on Monday, President Barack Obama laid out the three main objectives of this federal action: Mitigate dangerous climate change, protect the public health, and provide international leadership. For good measure, he also threw in a fourth aspiration: Protect the planet for our children. How could one object to such unassailable goals? Chip Knappenberger Unfortunately, upon close inspection, the plan's actual impact on climate turns out to be largely undetectable and the public health benefits tenuous, at best. It's tough to leave the world better for future generations by deliberately slowing the rate of human development, which is what this plan unfortunately calls for. When it comes to future climate change, mainstream scientific projections, which appear to be running to hot, predict about 2.5°C of warming by the end of the century as a result of carbon dioxide emitted from the burning of fossil fuels (coal, oil, natural gas). Nearly 90% of this warming is expected to come from developing nations such as China, India, and countries in sub-Saharan Africa. Of the remaining warming, amounting to about 0.3°C, about half will come from U.S. emissions. This means, that if we in the United States were to cease emitting all carbon dioxide from this day forward, future global warming would only be reduced by about 0.15°C by the end of the century. That's all. This is why incremental actions like the Clean Power plan, which only seeks a 10% reduction in U.S. greenhouse gas emissions by the year 2030, will have no appreciable impact on the future course of climate, only around 0.02°C. Put simply, when it comes to mitigating climate change, the U.S. has little role to play. 11 ways climate change affects the world 11 photos 11 ways climate change affects the world 11 photos Melting polar ice caps – The consequences of climate change go far beyond warming temperatures, which scientists say are melting the polar ice caps and raising sea levels. Click through the gallery for a look at 10 other key effects of climate change, some of which may surprise you. Hide Caption 1 of 11 11 ways climate change affects the world 11 photos Drought – In the coming decades climate change will unleash megadroughts lasting 10 years or more, according to a new report by scholars at Cornell University, the University of Arizona and the U.S. Geological Survey. We're seeing hints of this already in many arid parts of the world and even in California, which has been rationing water amid record drought. In this 2012 photo, a man places his hand on parched soil in the Greater Upper Nile region of northeastern South Sudan. Hide Caption 2 of 11 11 ways climate change affects the world 11 photos Wildfires – There's not a direct link between climate change and wildfires, exactly. But many scientists believe the increase in wildfires in the Western United States is partly the result of tinder-dry forests parched by warming temperatures. This photo shows a wildfire as it approaches the shore of Bass Lake, California, in mid-September. Hide Caption 3 of 11 11 ways climate change affects the world 11 photos Coral reefs – Scientists say the oceans' temperatures have risen by more than 1 degree Fahrenheit over the last century. It doesn't sound like much, but it's been enough to affect the fragile ecosystems of coral reefs, which have been bleaching and dying off in recent decades. This photo shows dead coral off the coast of St. Martin's Island in Bangladesh. Hide Caption 4 of 11 11 ways climate change affects the world 11 photos Food prices – A U.N. panel found in March that climate change -- mostly drought -- is already affecting the global agricultural supply and will likely drive upfood prices. Here, in 2010, workers on combines harvest soybeans in northern Brazil. Global food experts have warned that climate change could double grain prices by 2050. Hide Caption 5 of 11 11 ways climate change affects the world 11 photos Pollen allergies – Are you sneezing more often these days? Climate change may be to blame for that, too. Recent studies show that rising temperatures and carbon dioxide levels promote the growth of weedy plant species that produce allergenic pollen. The worst place in the United States for spring allergies in 2014, according to the Asthma and Allergy Foundation of America? Louisville, Kentucky . Hide Caption 6 of 11 11 ways climate change affects the world 11 photos Deforestation – Climate change has not been kind to the world'sforests. Invasive species such as the bark beetle, which thrive in warmer temperatures, have attacked trees across the North American west, from Mexico to the Yukon. University of Colorado researchers have found that some populations of mountain pine beetles now produce two generations per year, dramatically boosting the bugs' threat to lodgepole and ponderosa pines. In this 2009 photo, dead spruces of the Yukon's Alsek River valley attest to the devastation wrought by the beetles. Hide Caption 7 of 11 11 ways climate change affects the world 11 photos Mountain glaciers – The snows capping majestic Mount Kilimanjaro, Africa's highest peak, once inspired Ernest Hemingway. Now they're in danger of melting away altogether. Studies suggest that if the mountain's snowcap continues to evaporate at its current rate, it could be gone in 15 years. Here, a Kilimanjaro glacier is viewed from Uhuru Peak in December 2010. Hide Caption 8 of 11 11 ways climate change affects the world 11 photos Endangered species – Polar bears may be the poster child for climate change's effect on animals. But scientists say climate change is wreaking havoc on many other species -- including birds and reptiles -- that are sensitive to fluctuations in temperatures. One, this golden toad of Costa Rica and other Central American countries, has already gone extinct. Hide Caption 9 of 11 11 ways climate change affects the world 11 photos Animal migration – It's not your imagination: Some animals -- mostly birds -- are migrating earlier and earlier every year because of warming global temperatures. Scholars from the University of East Anglia found that Icelandic black-tailed godwits have advanced their migration by two weeks over the past two decades. Researchers also have found that many species are migrating to higher elevations as temperatures climb. Hide Caption 10 of 11 11 ways climate change affects the world 11 photos Extreme weather – The planet could see as many as 20 more hurricanes and tropical storms each year by the end of the century because of climate change, according to a 2013 study published in the Proceedings of the National Academy of Sciences. This image shows Superstorm Sandy bearing down on the New Jersey coast in 2012. Hide Caption 11 of 11 EXPAND GALLERY Meanwhile, the human health benefits of the President's plan do not largely stem from the reduction in carbon dioxide emissions. After all, carbon dioxide is a colorless, odorless gas that is not dangerous to breathe. Instead, they are to come from the \"co-benefits\" of reducing some forms of air pollution that are emitted when fossil fuels are burned. But these by-product emissions are already subject to existing regulations and are being double-counted by the President. Further, direct health impacts from climate change are difficult to pin down -- and ethereal -- as adaptive measures can more than erase them. With a major U.N. climate conference to be held in Paris this December, President Obama is eager to impress upon world leaders that climate change is a serious problem that requires global cooperation to address, and that the U.S. is going to do its part to lead the way. But there are problems. First, world leaders realize that President Obama is going to have a tough time convincing his own country to go along with his plans. Before the Clean Power Plan was even announced, a coalition of states had sued to stop it . And although a federal court deemed that effort premature, now that the plan has been finalized, other lawsuits are promised, as are Congressional actions and state-level refusals. But Obama may have an even bigger hurdle to jump internationally. For developing countries, reducing carbon dioxide emissions means reducing economic growth and human progress. Off-the-shelf renewable technologies are grossly insufficient to meet the immediate and growing needs of a world where well over a billion people do not have access to electricity, much less in sufficient quantity and quality. For populations in these parts of the world, limiting carbon dioxide emissions by restricting fossil fuel use may, in fact, prove dangerous -- much more so than the threats that a changing climate may bring. Restricting fossil fuel use means restricting transportation, electricity, air conditioning, and other critical technologies. For people that aren't already living in wealth and abundance, those restrictions can have serious human consequences for health and well-being. Ultimately, and looked at with a critical eye, the Clean Power Plan will be ineffective at mitigating climate change and improving public health. Worse, it indicates a desire for President Obama to lead the world away from the best path for ensuring human progress and well-being. ", "external_links": [], "published": "2015-08-05T03:00:00.000+03:00", "crawled": "2015-08-05T06:50:24.137+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}