{"organizations": [], "uuid": "0c3f2e73594c7cf5d51331a532e8d42e645877c8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/081815_yw_perry.jpg", "site_section": "http://www.foxnews.com/yourworld/", "section_title": "Your World with Neil Cavuto | Fox News", "url": "http://www.foxnews.com/transcript/2015/08/18/perry-on-immigration-reform-this-is-not-rocket-science/", "country": "US", "title": "Perry on immigration reform: 'This is not rocket science'", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Perry on immigration reform: 'This is not rocket science' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "0c3f2e73594c7cf5d51331a532e8d42e645877c8"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/08/18/perry-on-immigration-reform-this-is-not-rocket-science/", "ord_in_thread": 0, "title": "Perry on immigration reform: 'This is not rocket science'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 18,\nThis is a rush transcript from \"Your World,\" August 18, 2015. This copy may not be in its final form and may be updated.\nCHARLES PAYNE, GUEST HOST: Well, as we all know, Donald Trump's immigration plan is getting plenty of attention. But the question is, will it actually work?\nLet's ask a presidential candidate who knows the border very well, in fact, the best.\nFormer Texas Governor Rick Perry joins us.\nGovernor Perry, Donald Trump finally put on paper what he had been talking about, extraordinarily controversial. But a lot of people think it's the plan that will work. What's wrong with it?\nRICK PERRY, R-PRESIDENTIAL CANDIDATE: Well, I can tell you what will work. I haven't looked at all of his plan.\nBut what will work is putting the personnel in the right places on the border. And you had this strategic fencing in the metropolitan areas. And the one thing that's really missing that we have got to put in place, and that is the aviation assets, whether it's fixed-wing rotor craft, whether it's drones flying 24/7 from Tijuana to El Paso to Brownsville.\nThat's 1,933 miles. If you want to secure that border and do it in a timely fashion, that's the only way you can do it, with quick-response teams when they see activities on that border that are either illegal or are suspicious. Then you send those quick-response teams immediately to address it.\nAt that particular point in time, you can secure the border. We have just never had the will in Washington, D.C., to do that. When I'm the president of the United States, I can promise you one thing. The will to secure the border will reside in the Oval Office every day.\nPAYNE: Well, sir, would you have the will, would a president -- would President Perry have the will to say we know there's a game being played, and it's taking advantage of our kindness, where people come here and have children, anchor babies, and then everyone ends up coming from their country here and they can't be removed, would you have the will to turn that around? And how would you?\nPERRY: Well, here's the real issue.\nIf you're saying will you do away with the 14th Amendment, I think you need to look back at a little bit of history. When is the last time we changed the Constitution of this country? And it was back in the early '90s. And it took 202 years to do that.\nSo, I'm a governor who has to deal with finding solutions to problems. I know how to deal with the solution. And it's not changing the Constitution. But that's political rhetoric.\n(CROSSTALK)\nPAYNE: But what is the solution, sir?\nPERRY: The problem -- well, I just told you what the solution is. It's secure the border.\nIf you don't secure the border, none of these problems go away. You can change all the rules and regulations that you want. If you can get it done -- I will suggest to you what you can get done is secure the border.\nAll of these challenges that we face, whether it's health care costs, whether it's -- whatever the cost that gets driven by people coming into this country illegally, those are cured when you secure the border. This is not rocket science.\nPAYNE: But, with all due respect...\nPERRY: You put the personnel...\nPAYNE: With all due respect, sir, I have seen...\nPERRY: Go ahead.\nPAYNE: ... footage with families who are walking through the Rio Grande, and they're being filmed and they know it. There's just so many of them, they know they can't be captured, if you have 200, almost 300 sanctuary cities that have rolled out the red carpet, and they're telling these people, get here, have a baby, and you never have to leave.\n(CROSSTALK)\nPERRY: Charles, you're talking to somebody who has dealt with this for 14 years. That is correct.\nBut it's not the state of Texas' responsibility to do this. We have had to respond because the federal government has been such a failure.\n(CROSSTALK)\nPAYNE: As the president of the United States, building a wall does not seem like it would be enough if the inducements on the other side are so great.\nPERRY: I agree with you. Building a wall is not going to do it, because you are going to put the ladder business into pretty good high mode.\nPAYNE: Then how do we stop it?\nPERRY: What you do is you put personnel there.\nWe know how to secure the -- we know how to secure the border, Charles.\nYou guys are talking in circles here. You put the personnel down there in the right places, the amount that we need, the strategic fence in the metropolitan areas, and use aviation assets. We're not using those technologies today. You can secure the border, Charles.\nThat can be done. And the idea that you say that, well, you can't do that, I don't believe that. I have spent more time on that border than anybody. I have seen it.\nPAYNE: Right.\nPERRY: I tried to get the president -- last summer, I looked him in the eye and I said, Mr. President, if you don't secure that border, Texas will.\nAnd we sent our National Guard. We need a president with that kind of will in the White House to secure that border. I will do it. I know how to do it.\nPAYNE: What about the 11 million or so illegals that are already in this country then? What would be the solution to dealing with them?\nPERRY: Listen, we will figure out the way to deal with those individuals, from the standpoint of being able to find out, who is in this country that needs to be sent back to their country?\nWe can identify those individuals pretty quick with a policy I think that will work. But the key is, we have got to secure the border. All of this conversation that we have about these side issues, whether it's how to deal with 11 million people or how to deal with the 14th Amendment...\nPAYNE: How is that a side issue? I don't understand.\nPERRY: ... that is political rhetoric until you get the border secure.\nPAYNE: With all due respect...\nPERRY: What do you mean you don't understand? This is easy to understand.\nPAYNE: How can 11 million illegals...\n(CROSSTALK)\nPERRY: You have somebody in the White House that has the will to do this, Charles. That is the issue.\nPAYNE: How can 11 million illegals be a side issue, though?\nPERRY: We have not had in Washington, D.C., a Republican or a Democrat to be -- to secure that border.\nAnd until you get the border secure, we are wasting our time. And Americans know that. They have...\n(CROSSTALK)\nPERRY: ... in the makeup today.\nPAYNE: Right.\nPERRY: And they're going to get somebody in there that will secure that border.\nPAYNE: We have got 11 million illegals already here. And to say that, well, you will deal with that once you're sworn in, I don't think will help you get sworn in.\nPeople don't work because of the illegals that are here taking American jobs. What is your plan to take care of that?\nPERRY: There are plenty of people working with Washington, D.C., when we get into office to deal with that issue.\nBut I'm telling you, to get this off -- distracted off of securing that border is absolutely and totally a fallacy and the wrong thing for us to be doing. You all ought to be able to talking about every day, how are you going to secure the border, not deflecting off on these other issues, that, quite frankly, the American people want to see the border secure, because it's like a disease.\nIf you have got a disease, you go to the absolute core of what it is. You stop the illegal immigration that is coming into America, and a lot of these other issues go away.\nPAYNE: All right. Well, all I'm saying is that I think the inducements on this side of the border are so great, someone will build an El Chapo kind of tunnel to get under the wall, to hide from the drones.\nI'm just saying that's an important cog. I don't think anyone dismisses that. But if you don't take care of what is in -- what -- how does a person take a train, ride on top of a train from Guatemala to the Texas border and then wait and then come into this country? They want what we have. And I don't know that building a wall in and of itself and even with drones will be enough if we don't have a president that says, once you get in here, you have wasted your time.\nPERRY: What we have to have is somebody in the White House who gets up every day, goes to the Oval Office, Charles, with the intent of securing that border.\nIt can happen. It will happen. We just hadn't elected a president that had the will to do it yet. I'm that person. I know how to do this. I will get it done.\nPAYNE: Governor Perry, before we go, a lot of talk about you struggling here a little bit with respect to funds. How are you fixed on money, and are you going to be able to ride this thing all the way through?\nPERRY: Well, everybody in this country most -- well, I won't say everybody in this country, but most of us in this country have had challenges from finances from time to time.\nIn the state of Texas, we came up short a couple of times in our budgets. And I know how to deal with that. You cut the spending. I'm like a small business or I'm like a guy who has got his own personal challenges with our campaign. We cut our spending. We cut back.\nI know how to have a small footprint. I'm in this in the long haul. I'm going to be in Iowa a lot. I'm going to be in New Hampshire and I'm going to be in South Carolina a lot.\nPAYNE: All right, Governor Rick Perry, thank you very much. We really appreciate your time, as always.\nPERRY: Charles, thank you. It's good to be with you.\nPAYNE: Thanks. You, too. Thanks.\nPERRY: Godspeed.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n ", "external_links": [], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-19T22:58:47.676+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}