{"organizations": [], "uuid": "aa0e726947a91d611a2b1a07a2cad1aaed965b26", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/feeds/Associated%20Press/2015/08/14/0/0/United%20States%20Cuba-1.jpg", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2015/08/14/top-us-diplomat-john-kerry-flies-to-cuba-to-raise-flag-in-victory-lap-for-new/", "country": "US", "title": "Top US diplomat John Kerry flies to Cuba to raise flag in victory lap for new Obama policy lap", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Top US diplomat John Kerry flies to Cuba to raise flag in victory lap for new Obama policy lap | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "aa0e726947a91d611a2b1a07a2cad1aaed965b26"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2015/08/14/top-us-diplomat-john-kerry-flies-to-cuba-to-raise-flag-in-victory-lap-for-new/", "ord_in_thread": 0, "title": "Top US diplomat John Kerry flies to Cuba to raise flag in victory lap for new Obama policy lap", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press Facebook 0 Twitter 0 Email Print A worker tests the audio equipment in the patio of U.S. Embassy where the flag raising ceremony will take place, in Havana, Cuba, Thursday, Aug. 13, 2015. The US embassy in Cuba will hold a ceremony on Friday, Aug. 14, to raise the U.S. flag, to mark its reopening on Havana’s historic waterfront. Ordinary Cubans will cheer, U.S. business executives will network and Secretary of State John Kerry will meet with Cuba’s foreign minister, the country’s Roman Catholic archbishop and a hand-picked group of dissidents. (AP Photo/Ramon Espinosa)  (The Associated Press) \nA worker tests the audio equipment in the patio of US Embassy where the flag raising ceremony will take place, in Havana, Cuba, Thursday, Aug. 13, 2015. The US embassy in Cuba will hold a ceremony on Friday, Aug. 14, to raise the U.S. flag, to mark its reopening on Havana’s historic waterfront. Ordinary Cubans will cheer, U.S. business executives will network and Secretary of State John Kerry will meet with Cuba’s foreign minister, the country’s Roman Catholic archbishop and a hand-picked group of dissidents. (AP Photo/Ramon Espinosa)  (The Associated Press) \nA worker tests the audio equipment in the patio of U.S. Embassy in Havana, Cuba,Thursday, Aug. 13, 2015. The US embassy in Cuba will hold a ceremony on Friday, Aug. 14, to raise the U.S. flag, to mark its reopening on Havana’s historic waterfront. Ordinary Cubans will cheer, U.S. business executives will network and Secretary of State John Kerry will meet with Cuba’s foreign minister, the country’s Roman Catholic archbishop and a hand-picked group of dissidents. (AP Photo/Ramon Espinosa)  (The Associated Press) \nTourists ride on a vintage American car in front of the U.S. embassy in Havana, Cuba, Thursday, Aug. 13, 2015. The US embassy in Cuba will hold a ceremony on Friday, Aug. 14, to raise the U.S. flag, to mark its reopening on Havana’s historic waterfront. Ordinary Cubans will cheer, U.S. business executives will network and Secretary of State John Kerry will meet with Cuba’s foreign minister, the country’s Roman Catholic archbishop and a hand-picked group of dissidents. (AP Photo/Ramon Espinosa)  (The Associated Press) \nPrevious Next HAVANA –   Washington's top diplomat is coming to Havana on Friday to raise the Stars and Stripes over the newly opened U.S. Embassy, making a symbolically charged victory lap for the Obama administration's new policy of engagement with Cuba.\nOrdinary Cubans will cheer, U.S. business executives will network and Secretary of State John Kerry will meet with Cuba's foreign minister, the country's Roman Catholic archbishop and a hand-picked group of dissidents.\nThen the hard part begins.\nSoon after Kerry heads home Friday evening, the Cuban and U.S. diplomats who negotiated the embassy reopening will launch full-time into the next phase of detente: expanding economic ties between the two nations with measures like direct flights and mail service.\nThe Americans also want to resolve billions of dollars in half-century-old American claims over property confiscated after the Cuban revolution. Cuba has its own claims, as noted in a newspaper column by Fidel Castro on Thursday saying the U.S. owes the island \"numerous millions of dollars\" for damages caused by the embargo.\n\"We have diplomatic relations; now we can get to the real work,\" said Wayne Smith, a retired U.S. diplomat who witnessed the closing of the U.S. Embassy in 1961, served in Cuba under President Jimmy Carter and returned this week to attend Friday's ceremony.\nPresidents Barack Obama and Raul Castro announced on Dec. 17 that they would re-establish diplomatic ties 54 years after the flag was taken down from the embassy overlooking Havana's seaside boulevard, the Malecon.\nObama also said he would be moving to empower the Cuban people by loosening the U.S. trade embargo on Cuba through a series of executive actions that make it easier for American citizens to travel to Cuba and trade with the island's growing class of private business owners.\nEight months later, Cuba has repeatedly demanded a complete lifting of the embargo. It has not responded to Obama's actions with measures that would allow ordinary Cubans to benefit from them, such as allowing low-cost imports and exports by Cuban entrepreneurs looking to do business with the U.S.\n\"I think we're ending one phase and entering another,\" said Robert Muse, a U.S. lawyer specializing in Cuba. \"The handshakes, the fraternal regards, the raising of the flags, that'll end on Aug. 14. Then I think it's very particular conversations begin.\"\nWhile Cuba has increased its highly limited Internet access since Dec. 17 in a measure U.S. officials partially attribute to the warming with Washington, ordinary Cubans are growing increasingly impatient for concrete results from the new relationship.\n\"I'm optimistic but cautious,\" said Rolando Mendez, a state worker walking outside the new U.S. Embassy on Thursday. \"We have to wait and see how events develop and if there really will be benefits for the two peoples.\"\nThe U.S. tried several times to hold discussions with Cuban officials about the details of Obama's loosening of U.S. regulations but those meetings never happened amid the pressure to strike a deal allowing the reopening of embassies in Havana and Washington on July 20.\nU.S. diplomats say that such a meeting, which will hopefully lead to a real increase in trade with the U.S., is among the top priorities of the normalization talks expected to start in earnest in coming weeks.\nAfter the flag ceremony and a meeting with Havana Archbishop Jaime Ortega, Kerry is scheduled to meet with Cuban Foreign Minister Bruno Rodriguez followed by a news conference and the raising of a second flag at the stately home of the embassy's chief of mission, where the secretary of state is also expected to meet with Cuban dissidents.\nKerry said in a series of interviews with Spanish-language press Wednesday that the day would move the U.S.-Cuban relationship into a series of detailed talks about topics including \"law enforcement, maritime security, education, health, telecommunications.\"\n\"We will talk very directly about a sort of road map toward real, full normalization,\" Kerry said.\n___\nAssociated Press writer Michael Weissenstein reported this story in Havana and Bradley Klapper reported from Washington. AP writer Anne-Marie Garcia contributed to this report.\n___\nMichael Weissenstein on Twitter: https://twitter.com/mweissenstein\nBradley Klapper on Twitter: https://twitter.com/bklapperAP", "external_links": [], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-14T11:44:04.719+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}