{"organizations": [], "uuid": "8587322834a0d2f55c0f067f7af2ce0d1685f568", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150817122111-scott-walker-booed-at-iowa-state-fair-soapbox-00002324-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/08/17/politics/scott-walker-donald-trump-immigration/index.html", "country": "US", "title": "Walker says immigration plan", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Walker says immigration plan - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "8587322834a0d2f55c0f067f7af2ce0d1685f568"}, "author": "Tom LoBianco", "url": "http://www.cnn.com/2015/08/17/politics/scott-walker-donald-trump-immigration/index.html", "ord_in_thread": 0, "title": "Walker says immigration plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Scott Walker says his own immigration plan is similar to Donald Trump's But Walker would not specify whether he would seek to deport children born in the U.S. Washington (CNN) Wisconsin Gov. Scott Walker talked tough on immigration Monday, saying he had a \"similar\" approach to that of real estate mogul Donald Trump but declined to say precisely how he would crackdown if elected president.\nWalker told Fox News that his immigration plan was \"similar\" to Trump's -- he said he would support building a wall along the Mexican border -- but would not go so far as to endorse Trump's proposal.\n\"I've laid out a number of important reforms when it comes to immigration early this year, not only about securing the border but enforcing the law,\" Walker said later at the Iowa State Fair on Monday. \"In light particularly of what we've seen with sanctuary cities that we need to make sure that we enforce the law in every part of this country and not just in some parts or the other.\"\nRELATED: Trump outlines immigration specifics\nBut Walker would not specify whether he would seek to deport children born in the United States -- legal citizens under the 14th Amendment to the Constitution -- something Trump said he would do, as part of a highly touted immigration plan released this past weekend.\n\"I've talked about how going forward I believe we should change the rules, the law but in terms of deporting the best thing we can do is enforce the law,\" Walker said, when asked about ending birthright citizenship. \"We enforce the law and require employers across America to uphold the law -- which means an effective E-verify system -- I think that ultimately puts us in a better place.\"\nFormer Florida Gov. Jeb Bush , speaking in Charleston, South Carolina, on Monday, said he appreciates that Trump has a plan, but that the approximately 11 million undocumented immigrants currently living in the U.S. need to be dealt with in a way that's \"realistic.\"\nHe also said the U.S. needs \"to have border security done in a way to lessen the number of people who are crossing the border.\"\nNew Jersey Gov. Chris Christie told CNN earlier Monday that he supported building a wall in select, urban areas along the border, but said he had no expectation that Mexico would pay for it.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-08-17T03:00:00.000+03:00", "crawled": "2015-08-17T23:35:16.532+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}