{"organizations": [], "uuid": "03ce6e8dae13faf16f7f01654d708ce878652bcc", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c131771d00002f00143da0.jpeg?cache=5i781CYhgP", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/jeb-bush-abortion_55c12653e4b0b75c1c8c7885", "country": "US", "title": "Jeb Bush Evokes Ghost Of Mitt Romney With Flub About Abortion", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Jeb Bush Evokes Ghost Of Mitt Romney With Flub About Abortion", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T01:20:00.000+03:00", "replies_count": 0, "uuid": "03ce6e8dae13faf16f7f01654d708ce878652bcc"}, "author": "Igor Bobic", "url": "http://www.huffingtonpost.com/entry/jeb-bush-abortion_55c12653e4b0b75c1c8c7885", "ord_in_thread": 0, "title": "Jeb Bush Evokes Ghost Of Mitt Romney With Flub About Abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jeb Bush Evokes Ghost Of Mitt Romney With Flub About Abortion The candidate seemed to endorse cutting women's health services. Igor Bobic Associate Politics Editor, The Huffington Post Posted: 08/04/2015 06:20 PM EDT \nWASHINGTON -- Republican presidential candidate Jeb Bush on Tuesday committed another unforced error by suggesting he wanted to cut funding for women's health services. \nAddressing 13,000 pastors at the Southern Baptist Forum in Nashville, Tennessee, Bush said he supports cutting federal funds for Planned Parenthood, the largest women's health service provider in the U.S. \n\"The next president should defund Planned Parenthood,\" said Bush, the former Florida governor, garnering a lengthy round of applause. \nBut Bush mixed his desire to eliminate federal funding for abortions with federal funding for all women's health services, prompting him to issue a clarification later. \n\"You could take dollar for dollar -- although I'm not sure we need a half-billion dollars for women's health issues -- but if you took dollar for dollar, there are many extraordinary fine community health organizations that exist to provide quality care for women on a wide variety of health issues,\" Bush said. \"But abortion should not be funded by the government.\" \nThe Hyde Amendment, routinely attached to congressional spending measures, already prohibits federal funding for abortions, except in cases of incest, rape or medical emergency. \nLater, Bush issued a statement. “With regards to women’s health funding broadly, I misspoke, as there are countless community health centers, rural clinics, and other women’s health organizations that need to be fully funded,\" he said in the statement. \"They provide critical services to all, but particularly low-income women who don’t have the access they need. \n“I was referring to the hard-to-fathom $500 million in federal funding that goes to Planned Parenthood -– an organization that was callously participating in the unthinkable practice of selling fetal organs.\" \nDemocrats immediately seized on Bush's remarks in Nashville, noting that U.S. spending on women's health care pales in comparison to other federal expenditures. . @JebBush : You are absolutely, unequivocally wrong. https://t.co/a6O17dlEh4 — Hillary Clinton (@HillaryClinton) August 4, 2015 \nTaken in context, Bush's remarks fall in line with arguments his fellow Republicans have been making for weeks in response to controversial videos that show Planned Parenthood officials discussing research on aborted fetal tissue. \nIf Bush actually was suggesting he wanted to cut all federal funding for women's health services, it would place him at odds with Senate Republicans, whose failed bill attempting to defund Planned Parenthood would have reallocated federal funds to other women's care providers. \nBush's difficulties with phrasing is a sign of a broader problem. His reoccurring clumsy comments evoke the stumbles of Mitt Romney in 2012. Romney's penchant for out-of-context quotes gave Democrats countless opportunities to paint him as an out-of-touch plutocrat who didn't care for the middle class. \nBush misstepped last month, for example, when he seemed to say Americans need to work even \" longer \" hours. He was later forced to clean up the comment, clarifying that he meant Americans needed to work more full-time hours, not part-time hours. Later in July, Bush handed Democrats another quote on a silver platter when he said we ought to \" phase out \" Medicare. \nWatch video of Bush's comments on Planned Parenthood above .", "external_links": [], "published": "2015-08-05T01:20:00.000+03:00", "crawled": "2015-08-05T01:27:37.234+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}