{"organizations": ["Fox News Latino"], "uuid": "0fd2e47cfdbe09d132161181cec36cfd80502cb4", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/zimmerman%20tweet.JPG", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/08/27/george-zimmerman-goes-all-out-against-obama-for-not-condemning-virginia/", "country": "", "title": "George Zimmerman goes all out against Obama for not condemning Virginia shooting | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "George Zimmerman goes all out against Obama for not condemning Virginia shooting | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T20:00:00.000+03:00", "replies_count": 0, "uuid": "0fd2e47cfdbe09d132161181cec36cfd80502cb4"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/08/27/george-zimmerman-goes-all-out-against-obama-for-not-condemning-virginia/", "ord_in_thread": 0, "title": "George Zimmerman goes all out against Obama for not condemning Virginia shooting | Fox News Latino", "locations": ["Virginia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["George Zimmerman", "Obama"], "text": "George Zimmerman goes all out against Obama for not condemning Virginia shooting Published August 27, 2015 Fox News Latino \nGeorge Zimmerman, the neighborhood watchman who fatally shot unarmed black teenager Trayvon Martin in 2012, is once again riding on a national story to go into a tirade about racial relationships in the country. \nNow he is calling President Barack Obama a racist for not condemning the Virginia news crew killings right away. \nObama sent out a statement shortly afterward, saying \"it breaks my heart every time\" he hears about these incidents. \"What we know is that the number of people who die from gun-related incidents around this country dwarfs any deaths that happen through terrorism,\" Obama said hours after the shooting. \nOn Thursday morning Zimmerman even posted on Twitter a picture of the killer, Vester Lee Flanagan, with the caption: \"If Obama had a son...\" \nThe day before, hours after the shooting, the Florida man tweeted a message confronting the president for his silence and using homophobic slurs referring to the shooter, who was gay. \n“Pansy Fester lee Flanagan, too much of a daisy to deal w/racism,” he tweeted. “Murders 2 whites. Hate crime, 100%. Racist Obama says nothing condeming.” \nLater he posted a new tweet, along with photos of the victims, Alison Parker and Adam Ward. \n\"White woman & man get murdered by a Black P.O.S. 8 hours later B. Hussein Obama the divider still says NOTHING,\" Zimmerman wrote. If Obama had a son... pic.twitter.com/GRh4XIn7vr \n— George Zimmerman (@TherealGeorgeZ) August 27, 2015 \nZimmerman’s account has 6,092 followers and flaunts a confederate flag. \nThe two young journalists were killed on live television Wednesday by a disgruntled former reporter they once worked with at WDBJ-TV. They were doing an innocent story about the 50th anniversary of a reservoir known as Smith Mountain Lake when the gunman walked up to them and fired. The chilling images of Parker running away were captured on Ward's camera as he fell to the ground. \nZimmerman was acquitted in 2013, a decision that sparked protests and national debate about race relations. \nThe Justice Department later announced it was not bringing a civil rights case against Zimmerman. Since his acquittal, Zimmerman has had several brushes with the law. \nThose include two incidents involving allegations of assault by girlfriends, and his wife claiming he smashed her iPad. \nCharges were either dropped or not pursued because of a lack of evidence in those cases. \nThe Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-08-27T20:00:00.000+03:00", "crawled": "2015-08-27T20:00:48.771+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}