{"organizations": ["Iran", "AIPAC", "Congress", "American Israel Public Affairs Committee", "White House", "Conference of Presidents of Major American Jewish Organizations", "American University"], "uuid": "1c40840eec04cb1759f879140bfbad5920a336a4", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/05/politics/obama-iran-nuclear-deal-speech/index.html", "country": "", "title": "Obama: Iran deal opponents prefer military action - CNNPolitics.com", "performance_score": 7, "site": "cnn.com", "participants_count": 0, "title_full": "Obama: Iran deal opponents prefer military action - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T19:45:00.000+03:00", "replies_count": 0, "uuid": "1c40840eec04cb1759f879140bfbad5920a336a4"}, "author": "", "url": "http://www.cnn.com/2015/08/05/politics/obama-iran-nuclear-deal-speech/index.html", "ord_in_thread": 0, "title": "Obama: Iran deal opponents prefer military action - CNNPolitics.com", "locations": ["North America", "Iran", "U.S.", "Washington", "Capitol Hill", "Israel", "Middle East", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Netanyahu", "Barack Obama", "George W. Bush", "Benjamin Netanyahu", "Martha", "Obama"], "text": "Intense battle on Capitol Hill over Iran deal 01:43 Story highlights Before the congressional review period expires in September, the administration has launched an aggressive lobbying effort for the deal. Obama claimed that opponents of his agreement with Iran were deploying similar arguments as those used to go to war in Iraq. Washington (CNN) President Barack Obama, seeking to amplify his campaign to garner congressional support for the Iran nuclear deal, declared Wednesday that the decision facing lawmakers next month is the most significant since Congress voted to invade Iraq more than a decade ago. The 2002 Iraq vote, which spawned foreign policy headaches for the past two administrations, was driven by war-hungry politicians, Obama claimed. He said Wednesday that opponents of his agreement with Iran were deploying similar arguments ahead of a September vote in Congress on the agreement. \"It was a mind-set characterized by a preference for military action over diplomacy,\" he said of the arguments in favor of invading Iraq in remarks at American University in Washington. \"A mind-set that put a premium on U.S. action over the painstaking work of building international consensus. A mind-set that exaggerated threats beyond what the intelligence supported.\" The George W. Bush administration, Obama claimed, \"did not level with the American people about the costs of war.\" With a little more than a month before the congressional review period expires, the administration has launched an aggressive lobbying effort to convince Democrats of the deal's merits. They've largely written off trying to convince Republicans, many of whom denounced the negotiations that led to the accord. Part of the administration's challenge is countering an onslaught of advertising and lobbying coming from opponents of the deal, led by the American Israel Public Affairs Committee. AIPAC has committed to spending upwards of $20 million in a bid to stymie the plan. On Tuesday, Obama and Israel Prime Minister Benjamin Netanyahu offered dueling messages on the Iran deal to American Jews, delivering back-to-back addresses to leaders of Jewish organizations that could help sway opinion on Capitol Hill. Netanyahu repeated his dire warnings that the deal would imperil Israel and the wider Middle East. \"The nuclear deal with Iran doesn't block Iran's path to the bomb, it actually paves Iran's path to the bomb,\" Netanyahu said in his presentation, which was sponsored by the Jewish Federations of North America and the Conference of Presidents of Major American Jewish Organizations and broadcast to synagogues and community centers around the country. The deal, Netanyahu claimed, \"gives Iran two paths to the bomb: Iran can get to the bomb by keeping the deal, or Iran could get to the bomb by violating the deal.\" Obama, meeting later with more than 20 Jewish leaders at the White House, repeatedly rejected the notion that a better deal could be had, and warned that if the agreement fails, Iran could obtain a nuclear bomb in months. \"He really stuck to his guns and challenged people on that\" notion of a better deal, a Jewish leader at the meeting said. Obama and top administration officials have spent the month since the deal was signed personally meeting with lawmakers to explain the technicalities of the plan. As both the president and Congress head to summer vacations, the White House has pledged to maintain lines of communication between Martha's Vineyard, where Obama will spend the next two weeks, and lawmakers in their home districts. Many of those members of Congress have planned town hall-style events to weigh constituents' opinions of the deal -- the same format that harnessed and increased anger over Obama's health care law five years ago. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House news ", "external_links": [], "published": "2015-08-05T19:45:00.000+03:00", "crawled": "2015-08-05T19:46:13.310+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}