{"organizations": [], "uuid": "0b289ab671cd333ac4706b79f71ae22c76af3567", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150804212544-obama-demo-day-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_topstories.rss", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/08/05/technology/white-house-obama-entrepreneurs-demo-day/index.html", "country": "US", "title": "Obama: \"The next Steve Jobs might be named Stephanie or Esteban.\"", "performance_score": 1, "site": "cnn.com", "participants_count": 4, "title_full": "Obama: \"The next Steve Jobs might be named Stephanie or Esteban.\" - Aug. 5, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T16:02:00.000+03:00", "replies_count": 3, "uuid": "df13a0bd34295aa0717c4e544e5a3a5df6d405b4"}, "author": "Sara Ashley O'Brien", "url": "http://money.cnn.com/2015/08/05/technology/white-house-obama-entrepreneurs-demo-day/index.html#post-0", "ord_in_thread": 0, "title": "Obama: \"The next Steve Jobs might be named Stephanie or Esteban.\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stephanie. Esteban. One of these names could be the next generation's big inventor. That's according to President Obama, who stressed the importance of inclusive entrepreneurship at the first White House \"Demo Day\" on Tuesday.\n\"Ideas can come from anyone, anywhere, and they can be inspired by any kind of life experience,\" Obama said in a speech in the East Room, which was filled with startup founders, leaders in business, philanthropy and non-profits.\nObama called on those in powerful positions to ensure that all entrepreneurs are given a level playing field.\n\"Examine all the talent America has to offer, no matter who they are and where they set up shop,\" Obama said. \"We've got to make sure that everybody is getting a fair shot -- the next Steve Jobs might be named Stephanie or Esteban. They might never set foot in Silicon Valley.\"\nFewer than 3% of VC-funded startups in the U.S. are led by women, according to Obama, and fewer than 1% are led by African Americans.\n\"It's always hard to get in front of the right people, but sometimes it's harder if you're a woman or an under-represented minority who all too often have to fight just to get a seat at the table,\" the president said. \"Yet we've seen again and again that companies with diverse leadership often outperform those that don't.\"\nHe also stressed the importance of funding regionally diverse companies -- which might not have easy access to capital but nonetheless have great ideas.\nThat's why entrepreneurs who were invited to showcase their startups at Demo Day came from broad backgrounds.\n\"I got a call end of last week telling me that I'd been invited to this event by the White House focused on promoting diversity,\" said Privahini Bradoo. She's an entrepreneur born in India who now runs a electronics recycling firm called BlueOak.\nBlueOak has raised over $40 million in funding from investors, including the Silicon Valley VC firm Kleiner Perkins Caufield & Byers and the state of Arkansas. Bradoo splits her time between Silicon Valley, where the firm was founded, and Osceola, Arkansas, where BlueOak's flagship refinery is based.\nThen there's African-American entrepreneur Pashon Murray who started Detroit Dirt in 2010. Her team of five collects waste from companies in Detroit like GM ( GM ) and Blue Cross Blue Shield and turns it into rich soil.\n\"We're creating hazards by dumping it in landfills -- we can actually diminish the gas emissions by capturing them and making methane,\" Murray told CNNMoney. \"Why aren't we doing more of that in the United States?\"\nTo coincide with Demo Day, the Obama Administration also announced a host of efforts on Tuesday.\nThe National Venture Capital Association -- which includes 45 VC firms like Andreessen Horowitz and Kleiner Perkins Caufield Byers -- committed to advancing opportunities for women and underrepresented minorities. That includes measuring and reporting diversity numbers at their firms and portfolio companies.\nCompanies like Xerox ( XRX ) and Box ( BOX ) promise to interview at least one woman and one underrepresented minority for every senior level position. (Similar to Pinterest's announcement last week.)\nOther efforts include more than 100 engineering deans pledging to attract and retain a diverse student body, building the pipeline for the next generation of American engineers and entrepreneurs. Also, the TechHire initiative will expand to 10 new cities and states.\nThe White House said it will track and report on progress started at \"demo day.\"\n\"You never know who's going to have the next big idea, or what path will lead them there,\" added Obama.\nRelated: Hip-hop dancer, college dropout: #iLookLikeAnEngineer\nRelated: Pinterest is testing ways to fix diversity\nCNNMoney (New York) August 5, 2015: 8:02 AM ET", "external_links": ["https://www.whitehouse.gov/issues/technology/techhire", "https://www.whitehouse.gov/the-press-office/2015/08/04/fact-sheet-president-obama-announces-new-commitments-investors-companies", "http://nvca.org/pressreleases/leaders-of-the-venture-capital-industry-commit-to-actions-to-advance-inclusion-in-the-entrepreneurial-ecosystem/", "http://i2.cdn.turner.com/money/dam/assets/150804212544-obama-demo-day-780x439.jpg", "http://nvca.org/"], "published": "2015-08-05T16:02:00.000+03:00", "crawled": "2015-08-05T16:13:50.379+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}