{"organizations": [], "uuid": "ee79f3a850c0badcc30ca6648a34fa41edeee512", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/naturalgasdrillingrigtx_020515getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/250268-obama-spurns-natural-gas-in-climate-rule", "country": "US", "title": "Obama spurns natural gas in climate rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama spurns natural gas in climate rule", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T13:00:00.000+03:00", "replies_count": 0, "uuid": "ee79f3a850c0badcc30ca6648a34fa41edeee512"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/250268-obama-spurns-natural-gas-in-climate-rule", "ord_in_thread": 0, "title": "Obama spurns natural gas in climate rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama spurns natural gas in climate rule By Timothy Cama - 08/05/15 06:00 AM EDT \nPresident Obama’s love affair with natural gas is over. \nThe president once touted gas as an essential clean bridge fuel to wean the United States off dirtier fossil fuels and onto renewable energy, and it was seen as a key to his landmark climate change rule for power plants. ADVERTISEMENT But when Obama unveiled the finalized rule this week, he barely spoke about natural gas. Instead, the Environmental Protection Agency (EPA) boasted that the new regulation will accommodate a large transition from coal power directly to renewables like wind and solar, skipping over natural gas altogether.\nThe White House said the proposed rule encourages a boom in natural gas use because of a set of carbon reduction deadlines for states in 2020, which would be too soon for many states to deploy renewables. \n“The proposed rule relied on a large, early shift of coal generation to natural gas,” officials said in a fact sheet. “For example, the share of natural gas in the generation mix was projected to be significantly higher in 2020 than in the baseline.” \nBut that deadline was pushed back two years. \n“Instead, the rule drives early reductions from renewable energy and energy efficiency, which will drive a more aggressive transformation in the domestic energy industry,” it said. \nThe rule does not actually instruct states to choose some generation sources over others, and promises that no coal-fired power plant will have to be retired before its useful life is over. \nBut the changed date, along with an incentive program for states to earn credits for renewable installation, has officials convinced they can avoid some gas increases. It also allowed the White House to seek a nationwide 32 percent cut in power plants’ carbon in the final rule, more than the 30 percent proposed last year. \nThe gas industry is furious. Obama had previously held up gas as a top driver of the United States’ recent emissions reductions, because gas emits as little as half of the carbon dioxide as coal when burned. \nAnd while gas companies are still working to figure out that actual impact of the rule, they aren’t happy with the way the administration presented it. \n“We’re disappointed in the shift in messaging,” said Frank Macchiarola, top lobbyist for America’s Natural Gas Alliance. \n“The rhetoric out of the White House has been trying to send a clear message that they’re creating a shift from natural gas to more renewables being emphasized in the rule,” he said. \nMacchiarola said the president presented a “false choice” between natural gas and renewables. In reality, they can be used together, especially because wind and solar power only provide electricity intermittently. \n“The fact is that for a diverse fuel supply, you’re going to need both out into the future,” he said. \nThe American Petroleum Institute had a similar take. \n“The announcement yesterday will dramatically increase consumer cost, it will destroy jobs, and at the end of the day it doesn’t recognize clean-burning natural gas, which has brought us to a 20-year low [for greenhouse gas emissions] today,” said Jack Gerard, the group’s president. \nTo the conservative Institute for Energy Research, the move shows that Obama opposes all fossil fuels. \n“What it really says is that the Obama administration is not enamored with anything that emits carbon dioxide emissions, whether that’s coal or even natural gas,” said Dan Simmons, vice president for policy at the organization. \n“We’ve long believed that the administration would go after natural gas like they’re going after coal,” he said. “This is just one of the opening salvos in what the administration’s long-term plans are.” \nObama’s relations with natural gas had started to strain in recent years, due largely to his regulatory agenda. Federal agencies have written or are working on rules for hydraulic fracturing on federal land, methane leaks from natural gas drilling and other policies that could impact the industry. \nTo environmentalists, avoiding natural gas is great news. \n“We’re thrilled about any opportunity to replace coal directly with renewable energy, because the whole idea of natural gas as a bridge fuel has become debunked as we get more and more understanding of how bad natural gas is, and how ready-to-go renewable energy is,” said Julian Boggs, the global warming outreach director for Environment America. “Deploying as much renewable energy as possible is essential to solving global warming. Natural gas can’t solve global warming.” \nEPA head Gina McCarthy maintained that the administration is not trying to favor any power source over others. \n“I don’t want you to get the impression that we are putting our finger on any particular type of energy generation,” she told reporters when asked about the role of gas. “If you take a look at the energy mix you’ll see that natural gas still remains a very strong part of the energy mix.” \nAnd Jason Grumet, president of the Bipartisan Policy Center, argued that because gas generation will increase under the rule, the industry should be thankful. \n“The natural gas industry is expected to overlook modest deprivations, since no one likes a sore winner,” Grumet said.", "external_links": [], "published": "2015-08-05T13:00:00.000+03:00", "crawled": "2015-08-05T13:11:20.022+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}