{"organizations": [], "uuid": "5e8142a47dac25a6ca75a4edf0e5dd0089c717cf", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/inhofejames_020315getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/250347-senate-panel-votes-to-block-obama-climate-rule", "country": "US", "title": "Senate panel votes to block Obama climate rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate panel votes to block Obama climate rule", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T22:16:00.000+03:00", "replies_count": 0, "uuid": "5e8142a47dac25a6ca75a4edf0e5dd0089c717cf"}, "author": "Timothy Cama and Devin Henry", "url": "http://thehill.com/policy/energy-environment/250347-senate-panel-votes-to-block-obama-climate-rule", "ord_in_thread": 0, "title": "Senate panel votes to block Obama climate rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate panel votes to block Obama's climate rule Getty Images By Timothy Cama and Devin Henry - 08/05/15 03:16 PM EDT \nA Senate committee voted Wednesday to block implementation of the administration’s climate rule for power plants. \nThe bill passed by voice vote at a hastily organized meeting of the Senate Environment and Public Works Committee just across the hall from the Senate chamber in the Capitol, because the panel’s 11 Republicans wanted to pass the bill before August recess starts later Wednesday. ADVERTISEMENT Chairman James Inhofe (R-Okla.) called the vote while senators stood along the side of the room.\nThe nine Democrats on the committee did not attend the afternoon meeting. They walked out on an earlier meeting , denying Republicans a quorum for their vote, due to objections over an unrelated bill on pesticides. \n“They’ve had their one walk-out and we passed it anyway,” Inhofe said after the vote. \nThe bill, known as the Affordable Reliable Energy Now Act, sponsored by Sen. Shelley Moore Capito (R-W.Va.), would overturn the Environmental Protection Agency’s (EPA) regulations limiting carbon dioxide emissions from power plants, which President Obama released Monday. \nIt would also put certain restrictions on the EPA that would make it extraordinarily hard, if not impossible, to rewrite the rules. \n“This ... would pretty much take care of the problems that are out there, that are causing the economic demise of America,” Inhofe said. \nDemocrats accused the GOP earlier Wednesday of ignoring the facts and effects of climate change. \n“The bill creates giant loopholes, making it nearly impossible to take any meaningful action to address climate change and reduce harmful carbon pollution, which hurts our families,” said Sen. Barbara Boxer (D-Calif.), the top Democrat on the panel. \n“If we turn away from the president’s Clean Power Plan, we move toward the most devastating impacts of climate change,” she said. \nDemocrats unsuccessfully introduced a number of amendments to delay or block the effects of the legislation, including one from Sen. Ed Markey (D-Mass.) that would require regulations that have similar health benefits. \n“To put a fine point on it, if you don’t like the Clean Power Plan, then what’s your plan to cut carbon pollution and address the negative health impacts of climate change? What’s your plan to avoid the asthma, the deaths, the missed workdays?” he asked. \nSenate Majority Leader Mitch McConnell (R-Ky.) is one of the most outspoken opponents of the EPA’s rule and would likely want to get a vote in the full Senate quickly. \nInhofe said he hopes to see the bill come to the Senate floor for consideration soon after Congress’s August recess. \n“I would hope so, but I will have to talk to the leadership, because we just did this a few minutes ago so we didn’t have time to talk,” he said. “They have a lot of scheduling to do.” Tags:", "external_links": [], "published": "2015-08-05T22:16:00.000+03:00", "crawled": "2015-08-05T22:29:21.572+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}