{"organizations": [], "uuid": "c781e6902e6c3eab3bda65e70c0d4da52c89a020", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3327316/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/08/21/the-morning-email_n_8020064.html", "country": "", "title": "Friday's Morning Email: Obama Picks Up Key Support For Iran Deal", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Friday's Morning Email: Obama Picks Up Key Support For Iran Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T15:24:00.000+03:00", "replies_count": 0, "uuid": "c781e6902e6c3eab3bda65e70c0d4da52c89a020"}, "author": "", "url": "http://www.huffingtonpost.com/2015/08/21/the-morning-email_n_8020064.html", "ord_in_thread": 0, "title": "Friday's Morning Email: Obama Picks Up Key Support For Iran Deal", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Friday's Morning Email: Obama Picks Up Key Support For Iran Deal Posted: \nTOP STORIES \nTo get The Morning Email, HuffPost's daily roundup of the news, in your inbox, sign up here. \nOBAMA PICKS UP KEY SUPPORT FOR IRAN DEAL \"President Barack Obama's nuclear deal with Iran is picking up crucial support from swing-state Senate Democrats despite Republican opposition heightened by revelations of a secret side-agreement between Iran and the U.N. agency that inspects nuclear facilities.\" And such support could be coming at the expense of his approval ratings: the latest CNN/ORC poll says 51 percent disapprove of how he's handling the presidency . [ AP ] STOCKS TUMBLE OVER CHINA CONCERNS \"Worries about the health of China’s economy shook markets again Friday, hitting stocks in Asia and Europe. Signs of a sharp slowdown in the world’s second-largest economy have rattled investors since Beijing surprised markets last week by devaluing its currency.\" And China manufacturing activity dipped to its \"lowest level since 2009.\" [ WSJ ] \nFAA: TOO MANY CLOSE CALLS FOR PLANES AND DRONES \"Pilots have reported a surge in close calls with drones: nearly 700 incidents so far this year, according to FAA statistics, about triple the number recorded for all of 2014. The agency has acknowledged growing concern about the problem and its inability to do much to tame it.\" Check out a map of all close calls after August 1 . [ WaPo ] \nJIMMY CARTER: CANCER HAS SPREAD TO MY BRAIN Former President Jimmy Carter announced yesterday that the melanoma found in his liver has spread to four spots in his brain. [ Sam Levine, HuffPost ] \nHUNDREDS OF FEDERAL WORKERS IN ASHLEY MADISON HACK \"The AP traced many of the accounts exposed by hackers back to federal workers. They included at least two assistant U.S. attorneys; an information technology administrator in the Executive Office of the President; a division chief, an investigator and a trial attorney in the Justice Department; a government hacker at the Homeland Security Department and another DHS employee who indicated he worked on a U.S. counterterrorism response team.\" [ AP ] \nWHALES ARE DYING IN DROVES OFF THE COAST OF ALASKA The National Oceanic and Atmospheric Administration is incredibly worried. The news comes on the heels of the agency's announcement that July was the hottest month on record . [ Ed Mazza, HuffPost ] \nMEET THE WOMEN ARMY RANGERS Capt. Kristen Griest and 1st Lt. Shaye Haver could not be more impressive. [ Dayana Morales Gomez, HuffPost ] \nCAITLYN JENNER COULD BE CHARGED WITH VEHICULAR MANSLAUGHTER If convicted of potential charges stemming from a fatal car accident in February, Jenner could serve a year in county jail. [ Stephanie Marcus, HuffPost ] \nWHAT’S BREWING \nJOSH DUGGAR ADMITS TO CHEATING ON HIS WIFE \"Josh Duggar, who was forced to resign from his position as executive director of the conservative and anti-gay group Family Research Council Action when he admitted that as a teenager he sexually molested five minor girls -- has now owned up to cheating on his wife after his Ashley Madison profile was discovered.\" Duggar called himself \"the biggest hypocrite ever.\" [ HuffPost ] \nMEET THE FIRST POLYNESIAN DISNEY PRINCESS The animated film will focus on the new Disney character, Moana Waialiki. [ Us Magazine ] \nSURGERY FOR EARLIEST STAGE OF BREAST CANCER MAY BE UNNECESSARY \"As many as 60,000 American women each year are told they have a very early stage of breast cancer — Stage 0, as it is commonly known — a possible precursor to what could be a deadly tumor. And almost every one of the women has either a lumpectomy or a mastectomy, and often a double mastectomy, removing a healthy breast as well. Yet it now appears that treatment may make no difference in their outcomes.\" [ NYT ] \nLAUREN DUCA: HOW TO NOT GET CHEATED ON \"The only surefire way to prevent that from happening is to avoid dating altogether or, more specifically, to stay away from the Anthony who attended St. John Vianney High School in Holmdel, New Jersey. Otherwise, it is going to happen to you. It happens to everyone. It happened once, at least metaphorically, even to Beyoncé. The question is how to handle it.\" [ HuffPost ] \nHOW TO CATCH SOME ZZZ's ON THE PLANE Because no one needs to be awake in that little cramped space. [ HuffPost ] \nCONGRATS J-LAW With a $52 million dollar haul this year, Jennifer Lawrence topped Fortune's highest paid actresses list. Even with that, though, the wage gap is very, very real. [ HuffPost ] \nFORGET THE STANDING DESK And meet the bicycle desk. No, sadly, this is not a joke. [ The Atlantic ] \nFor more from The Huffington Post, download our app for iOS or Android . \nWHAT'S WORKING \nTHIS COLLEGE FOOTBALL TEAM IS FOCUSING ON SLEEP \"The key to a successful summer training camp has nothing to do with the football field. At least that's the operating principle for the University of Tennessee team. This year, each player has a sleep tracking device and a sleep coach to help him make sense of the new data.\" [ HuffPost ] \nON THE BLOG \nINSIDE AN OCD MIND \"My OCD normally materializes in intrusive thoughts, hypochondria, intermittent bouts of checking things repeatedly, localized skin picking, and a difficulty in making variations to routines. I make daily to-do lists and get upset or despondent when I don't complete them.\" [ HuffPost ] \nBEFORE YOU GO \n~ New Bill Cosby accusers bring the total number of women who say they were raped by Cosby to 50 . ", "external_links": [], "published": "2015-08-21T15:24:00.000+03:00", "crawled": "2015-08-21T15:24:44.617+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}