{"organizations": ["Alaska Trip Email Obama Will Restore Mt. McKinley", "ASSOCIATED PRESS"], "uuid": "a85614cf7736daa14df00b51b0099d42ac75e096", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e370c91d00002f00146432.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-denali-alaska_55e36f8ce4b0aec9f35398f3", "country": "", "title": "Obama Will Restore Mt. McKinley's Name To Denali On Alaska Trip", "performance_score": 6, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Will Restore Mt. McKinley's Name To Denali On Alaska Trip", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T00:20:00.000+03:00", "replies_count": 0, "uuid": "a85614cf7736daa14df00b51b0099d42ac75e096"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-denali-alaska_55e36f8ce4b0aec9f35398f3", "ord_in_thread": 0, "title": "Obama Will Restore Mt. McKinley's Name To Denali On Alaska Trip", "locations": ["Alaska"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mount McKinley", "McKinley", "Obama"], "text": "Email Obama Will Restore Mt. McKinley's Name To Denali On Alaska Trip The peak was named Mount McKinley in 1896, but Alaska natives had long before called the mountain Denali, meaning \"the High One.\" Posted: 08/30/2015 05:11 PM EDT | Edited: 1 minutes ago ASSOCIATED PRESS \nWASHINGTON, Aug 30 (Reuters) - President Barack Obama on Monday will officially restore Denali as the name of North America's tallest mountain, ending a 40-year battle over what to call the peak that has been known as Mount McKinley. \nThe symbolic gesture comes at the beginning of a three-day trip to Alaska where Obama hopes to build support for his efforts to address climate change during his remaining 16 months in office. \nThe peak was named Mount McKinley in 1896 after a gold prospector exploring the region heard that Ohioan William McKinley, a champion of the gold standard, had won the Republican nomination for president. \nBut Alaska natives had long before called the mountain Denali, meaning \"the High One.\" In 1975, the state of Alaska officially designated the mountain as Denali, and has since been pressing the federal government to do the same. Lance King via Getty Images \nAlaskans had been blocked in Congress by Ohio politicians, who wanted to stick with McKinley as a lasting tribute to the 25th U.S. president, serving from 1897 until his assassination in 1901. \nUnder Obama's action, Interior Secretary Sally Jewell will use her legal authority to end the long debate and rename the mountain, which has an elevation of more than 20,000 feet (6,100 meters). \n\"This designation recognizes the sacred status of Denali to generations of Alaska natives,\" the White House said in a statement. (Additional reporting by Steve Quinn in Juneau, Alaska; Editing by Peter Cooney) \nAlso on HuffPost: Ten Best U.S. National Parks of ", "external_links": [], "published": "2015-08-31T00:20:00.000+03:00", "crawled": "2015-08-31T00:20:11.889+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}