{"organizations": ["Fox News", "Facebook", "Twitter"], "uuid": "95a8ae40043fb2dc01db4d2e1a756139fe25fb37", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/081515_cb_funding_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/08/15/clinton-obama-meet-face-to-face-on-martha-vineyard-amid-email-controversy-biden/", "country": "", "title": "Clinton, Obama to meet face to face on Martha's Vineyard amid email controversy, Biden chatter | Fox News", "performance_score": 6, "site": "foxnews.com", "participants_count": 0, "title_full": "Clinton, Obama to meet face to face on Martha's Vineyard amid email controversy, Biden chatter | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T20:33:00.000+03:00", "replies_count": 0, "uuid": "95a8ae40043fb2dc01db4d2e1a756139fe25fb37"}, "author": "", "url": "http://www.foxnews.com/politics/2015/08/15/clinton-obama-meet-face-to-face-on-martha-vineyard-amid-email-controversy-biden/", "ord_in_thread": 0, "title": "Clinton, Obama to meet face to face on Martha's Vineyard amid email controversy, Biden chatter | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Biden", "Martha", "Obama"], "text": "Clinton, Obama to meet face to face on Martha's Vineyard amid email controversy, Biden chatter Published August 15, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama and Democratic presidential candidate Hillary Clinton will meet face to face Saturday evening on Martha's Vineyard, amid increasing scrutiny about Clinton's activities as secretary of state and speculation about whether Vice President Biden will challenge her in 2016. \nClinton and Obama will meet on the same exclusive Massachusetts vacation island on which they met last August under strained circumstances. They plan to attend the 80 th birthday party for Vernon Jordan, a Democratic operative and former Clinton administration adviser. \nThe swanky Massachusetts island is a famous as a gathering spot for prominent Democratic figures. \nClinton will join Obama, who is vacationing on the island with his family, along with a number of big-name corporate, civil rights and other political leaders. \nLast year before they met, Clinton criticized the administration’s foreign policy, arguing in a story in The Atlantic that failing to arm Syrian rebels against the regime of Syria’s Bashar al Assad's could have contributed to the rise of radical Islamic groups in Syria and Iraq. \nShe called Obama a day before they met at a private party on the Vineyard and told reporters she would \"absolutely\" hug it out with the president. \nThis year, Clinton's use of a private server and email accounts while she was secretary of state from 2009 to 2013 has become an increasing concern. She turned over roughly 55,000 pages of emails but deleted thousands of others she deemed personal. \nClinton has recently turned over the server to the State Department, and the FBI is now investigating how classified information from the agency reached the server. \nThe front running Clinton’s poll numbers, including those about her trustworthiness among voters, have declined in recent weeks as the email controversy appears to grow, which has created speculation about whether Biden will launch another presidential bid. \nClinton will go the island after speaking Saturday afternoon at the Iowa State Fair. \nShe and husband Bill Clinton, a former president, are scheduled to vacation in the Hamptons, a New York vacation spot also popular with the wealthy and famous, in the last two weeks of August. \nBiden running could create a politically awkward situation for Obama, though he is not expected to endorse a candidate in the party primary. \nBiden supporters are reportedly already looking at a possible campaign and fundraising potential. \nObama and his family vacation almost every August on Martha's Vineyard, and he's been spending most of this year's two-week trip on the golf course, at the beach and dining at the island's upscale restaurants. Obama returns to Washington on Aug. 23. \nThe Associated Press contributes to this report. Advertisement ", "external_links": [], "published": "2015-08-15T20:33:00.000+03:00", "crawled": "2015-08-15T23:27:28.488+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}