{"organizations": ["Trust Women Foundation", "KSNW", "CNN"], "uuid": "f20a508910a0252556445cddfc900f1f2ae51f59", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150818163909-moises-trevizo-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_topstories.rss", "section_title": "CNN.com - Top Stories", "url": "http://edition.cnn.com/2015/08/18/us/kansas-abortion-clinic-explosive-device-arrest/index.html?eref=rss_topstories", "country": "US", "title": "Fireworks arrest at abortion clinic", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Fireworks arrest at abortion clinic", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T00:31:00.000+03:00", "replies_count": 0, "uuid": "f20a508910a0252556445cddfc900f1f2ae51f59"}, "author": "", "url": "http://edition.cnn.com/2015/08/18/us/kansas-abortion-clinic-explosive-device-arrest/index.html?eref=rss_topstories", "ord_in_thread": 0, "title": "Fireworks arrest at abortion clinic", "locations": ["US", "U.S.", "Wichita"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["George Tiller", "Sam Stringer", "Trevizo", "Julie Burkhart", "Burkhart", "Doug Nolte", "Nolte", "Tiller", "Moises R. Trevizo", "Seth Kovar"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Man, 20, charged after bringing backpack with explosives into Kansas abortion clinic Updated 2206 GMT (0506 HKT) August 18, 2015 Moises R. Trevizo, 20, has been charged with unlawful possession of explosives. Story highlights Moises R. Trevizo is charged with unlawful possession of explosives He bought a backpack with an explosive device inside a Wichita abortion clinic \"I'm very concerned that someone would come in the building with weapons,\" founder says (CNN) A 20-year-old man ostensibly seeking a job at a Kansas abortion clinic was arrested after he told clinic staff his backpack contained an explosive device and knives, Wichita police said Tuesday. Moises R. Trevizo has been charged with unlawful possession of explosives and has been cooperative with police and clinic workers, said Capt. Doug Nolte. Trevizo and his attorney couldn't be immediately reached for comment. The explosive device was several fireworks that the suspect put together, police said. \"It was dangerous. Don't get me wrong. But it was the size of a salt shaker,\" Nolte told CNN. Police don't think the suspect planned to do anything against the clinic, Nolte said. The suspect had just moved out of a house and carried all his possessions in the backpack, police told CNN affiliate KSNW. The suspect said a friend had made the device, the station reported. The incident occurred Monday afternoon at South Wind Women's Center, which is located in the same facility once occupied by Dr. George Tiller and his clinic, which provided abortions. Tiller, 67, was killed in church by an anti-abortion gunman in 2009. Tiller was one of the few U.S. physicians who performed late-term abortions. South Wind Women's Center was open for business Monday with doctors and patients, said Julie Burkhart, who founded Trust Women Foundation, which opened the clinic. Burkhart had worked for Tiller for seven years. \"With what happened with him and other instances of violence across the country, we enacted security protocols,\" Burkhart said, referring to Tiller and violence against other abortion clinics. \"I'm very concerned that someone would come in the building with weapons. He was carrying knives and explosives. This really illustrates to me that the security protocols that we have in place work,\" Burkhart said. South Wind Women's Center even holds frequent drills with staff, Burkhart said. \"We don't let people just walk in with backpacks without searching them,\" Burkhart said. CNN's Seth Kovar and Sam Stringer contributed to this report. More from US", "external_links": [], "published": "2015-08-19T00:31:00.000+03:00", "crawled": "2015-08-19T00:56:41.136+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}