{"organizations": [], "uuid": "fc880c004ef03a13f310c6d3008c47bd5429d6de", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaclimate071415.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/250262-obama-presses-jewish-groups-to-support-iran-deal", "country": "US", "title": "Obama presses Jewish groups to support Iran deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama presses Jewish groups to support Iran deal", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T02:37:00.000+03:00", "replies_count": 0, "uuid": "fc880c004ef03a13f310c6d3008c47bd5429d6de"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/250262-obama-presses-jewish-groups-to-support-iran-deal", "ord_in_thread": 0, "title": "Obama presses Jewish groups to support Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama presses Jewish groups to support Iran deal Getty Images By Jordan Fabian - 08/04/15 07:37 PM EDT \nPresident Obama on Tuesday urged Jewish groups to back the Iran nuclear deal in the face of mounting pressure from Israeli Prime Minister Benjamin Netanyahu and other vocal opponents of the accord. \nThe president met with nearly two dozen leaders from major Jewish organizations, both for and against the deal, for more than two hours at the White House. \nObama made the case the deal would cut off Tehran’s path to a nuclear weapon and reassured them the U.S. would protect Israel’s security, the White House said. \nMalcolm Hoenlein, executive vice chairman of the Conference of Presidents of Major Jewish Organizations, described the exchange as “serious” and said he was not sure if any minds were changed. \nHoenlein declined to elaborate on the discussion, including the sticking points between Obama and the Jewish groups. \nThe closed-door meeting highlights Obama's ramped-up sales pitch to Jewish leaders, many of whom have sided with Netanyahu against the agreement. \nIt comes on the same day Netanyahu issued a dire warning about the deal directly to American Jews. \n“The nuclear deal with Iran doesn’t block Iran’s path to the bomb. It actually paves Iran’s path to the bomb,” he said on a webcast organized by major North American Jewish federations. “Worse it gives Iran two paths to a bomb; Iran can get to a bomb by keeping the deal or Iran can get to the deal by violating the deal.” \nWhile the meeting was not scheduled to counter Netanyahu, White House press secretary Josh Earnest said it would give Obama the chance to make a “blunt, direct case” that he is wrong. \n“Prime Minister Netanyahu has had ample opportunity to make public his views of this particular situation,” he said. “The president believes it is in the national security interests of our closest ally in the region, Israel, to prevent Iran from obtaining a nuclear weapon through diplomacy.” \nWinning support for the deal — or tamping down opposition — among Jewish groups is critical for Obama. Many of the organizations have ties on Capitol Hill, where the administration is looking to halt an effort to reject the accord. \nMore then a dozen groups on both sides of the debate participated in Tuesday’s huddle. \nThe American Israel Public Affairs Committee (AIPAC), J Street, the American Jewish Committee, the Anti-Defamation League, the Jewish Federations of North America and the National Jewish Democratic Council were among those that attended. \nRepresentatives from all three major Jewish movements, the Orthodox Union, the conservative Rabbinical Assembly and the Union of Reform Judaism also participated. \nThe White House and Jewish groups opposed to the deal are targeting Democratic lawmakers, whom Obama needs in order to uphold a potential veto of a resolution to disapprove of the agreement. \nThe Obama administration is confident it has enough votes to sustain a veto, but both sides are engaging in a furious lobbying effort over the August recess to sway undecided members ahead of an expected vote in September. \nA group funded by AIPAC and others is expected to spend at least $20 million on television ads against the deal. \nAnd 22 House Democrats on Monday will travel to Israel on a trip sponsored by an AIPAC offshoot, when they will meet with Netanyahu. \nObama last week urged his supporters to speak up for the deal, warning them some Democrats have become “squishy” due to a “well-financed” campaign from the other side. \nSupporters of the deal have begun to ramp up their sales pitch to Jewish lawmakers and the public. J Street, an Israel advocacy group aligned with Obama, launched a $5 million ad campaign Tuesday arguing the accord makes the U.S. and Israel safer. \nVice President Biden defended the deal during a call with Jewish leaders late last month, soon after it was finalized. And administration officials have been in constant contact with groups for weeks. \nObama also had a similar meeting with Jewish leaders and donors in April, before a framework agreement was reached. \nThe White House is confident their efforts are paying off. Officials point to an L.A. Jewish Journal poll showing a 48 percent plurality of American Jews back the agreement. \nTwo influential Jewish Democrats, Reps. Sandy Levin (Mich.) and Adam Schiff (Calif.) have recently voiced support for the deal. \nBut many Jewish lawmakers are lining up against the deal too. In a blow to Obama, Reps. Steve Israel (D-N.Y.), Ted Deutch (D-Fla.) and Nita Lowey (D-N.Y.) announced their opposition on Tuesday. \nOther Jewish heavy hitters in Congress, such as Sen. Chuck Schumer (D-N.Y.), remain undecided. \nA poll by the Israel Project, which opposes the deal, shows 47 percent of Jews disapprove of the agreement, while 44 percent are in favor. \nJulian Hattem contributed.", "external_links": [], "published": "2015-08-05T02:37:00.000+03:00", "crawled": "2015-08-05T03:11:27.378+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}