{"organizations": [], "uuid": "f2550a8932ea3eed96e1c1568c2350ee8ee8af94", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/trump%20immigration%20plan%20Latino.jpg", "site_section": "http://www.foxnews.com/topics/urss?q=real+estate", "section_title": "RSS for real estate", "url": "http://latino.foxnews.com/latino/politics/2015/08/17/donald-trump-lays-out-immigration-plan-pledges-to-end-birthright-citizenship/", "country": "US", "title": "Donald Trump lays out immigration plan; pledges to end birthright citizenship News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Donald Trump lays out immigration plan; pledges to end birthright citizenship | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "f2550a8932ea3eed96e1c1568c2350ee8ee8af94"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2015/08/17/donald-trump-lays-out-immigration-plan-pledges-to-end-birthright-citizenship/", "ord_in_thread": 0, "title": "Donald Trump lays out immigration plan; pledges to end birthright citizenship News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 17, 2015 Fox News Latino FILE - In this Saturday, Aug. 15, 2015, file photo, Republican presidential candidate Donald Trump waves to the crowd at the Iowa State Fair in Des Moines. Trump wants to deny citizenship to the babies of immigrants living in the U.S. illegally as part of an immigration plan that emphasizes border security and deportation for millions. (AP Photo/Charlie Riedel, File) \nWASHINGTON (AP) –   Republican presidential candidate Donald Trump wants to deny citizenship to the babies of immigrants living in the U.S. illegally as part of an immigration plan that emphasizes border security and deportation for millions.\nIn the first position paper posted to his campaign website , the real estate tycoon and television personality wrote that so-called \"birthright citizenship\" – the automatic granting of American citizenship to any child born on U.S. soil – \"remains the biggest magnet for illegal immigration. By a 2:1 margin, voters say it’s the wrong policy, including Harry Reid who said 'no sane country' would give automatic citizenship to the children of illegal immigrants.\"\nTrump pledged to rescind the Obama administration's executive orders on immigration. Trump's position paper also called for tripling the number of Immigration and Customs Enforcement agents and defunding sanctuary cities. \nHe went on NBC's \"Meet The Press,\" to talk about his vision of how to handle illegal immigration, saying that he would push to end the constitutionally-protected citizenship rights of children of any family living illegally inside the U.S.\n\"They have to go,\" Trump said, adding: \"What they're doing, they're having a baby. And then all of a sudden, nobody knows ... the baby's here.\"\nNative-born children of immigrants — even those living illegally in the U.S. — have been automatically considered American citizens since the adoption of the 14th Amendment of the Constitution in 1868.\nThe odds of repealing the amendment's citizenship clause would be steep, requiring the votes of two-thirds of both houses of Congress and support from three-fourths of the nation's state legislatures. Republicans in Congress have repeatedly failed since 2011 to pass bills aimed at ending birthright citizenship. Some conservatives believe that the granting of citizenship in such cases could be changed without amending the Constitution.\n\"They're illegal,\" Trump said, describing native-born children of people living illegally in the U.S. \"You either have a country or not.\"\nAmong the details in his posted immigration plan: Making Mexico pay for a permanent border wall. Mandatory deportation of all \"criminal aliens.\" Tripling the force of immigration officers by eliminating tax credit payments to immigrant families residing illegally in the U.S.\nTrump said a tough deportation policy was needed because \"there's definitely evidence\" of crimes linked to immigrants living in the country illegally. He repeated comments he's made previously, noting that: \"The good people can come back.\"\nThe New York businessman also said he would waste little time rescinding President Barack Obama's executive actions aimed at allowing as many as 3.7 million immigrants living illegally in the U.S. to remain in the country because of their U.S.-born relatives. Obama's November 2014 actions were halted by temporary injunctions ordered by several federal courts in rulings challenging his executive powers to alter immigration policies without congressional approval. The cases could lead to the Supreme Court.\n\"We have to make a whole new set of standards,\" Trump said. \"And when people come in, they have to come in legally.\"\nTrump's plan was endorsed by Sen. Jeff Sessions, R-Ala., who chairs a Senate subcommittee on immigration.\n\"This is exactly the plan America needs,\" Sessions said in a statement. \"Crucially, this plan includes an emphasis on lifting struggling minority communities, including our immigrant communities, out of poverty, by preventing corporations from bringing in new workers from overseas to replace them and drive down wages.\"\nMost other GOP candidates also back completing the border wall but differ over how to treat immigrant families already living in the U.S.\nFormer Florida Gov. Jeb Bush recently released his own immigration plan, which calls for the use of forward bases and drones to guard the border, but also backing an eventual plan to legalize the status of immigrant families.\nOn Sunday, Ohio Gov. John Kasich said he would \"finish the wall\" but would then work to legalize 11 million immigrants now estimated to live in the U.S. illegally. He spoke on CBS' \"Face the Nation.\"\nFlorida Sen. Marco Rubio worked with senators from both parties to develop a comprehensive plan in 2013 that would have legalized the status of many immigrant families. But Congress balked at the idea as tea party Republicans opposed the deal and Rubio has since backed away from his support.\nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2015-08-17T03:00:00.000+03:00", "crawled": "2015-08-17T19:03:14.137+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}