{"organizations": ["Iran", "State", "AIPAC", "Congress", "American Israel Public Affairs Committee", "Senate Foreign Relations Committee", "U.S. Senate", "CNN Congress"], "uuid": "7f9557e792b37f87f10716bf257b6c41ce706634", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150805125156-01-obama-iran-speech-0805-large-169.jpg", "site_section": "http://feeds.feedburner.com/google/AOpN", "section_title": "obama news - Google News", "url": "http://edition.cnn.com/2015/08/05/politics/obama-iran-nuclear-deal-speech/", "country": "IL", "title": "Obama blasts opponents of Iran nuclear deal - CNN", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama blasts opponents of Iran nuclear deal - CNN", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T19:56:00.000+03:00", "replies_count": 0, "uuid": "7f9557e792b37f87f10716bf257b6c41ce706634"}, "author": "", "url": "http://edition.cnn.com/2015/08/05/politics/obama-iran-nuclear-deal-speech/", "ord_in_thread": 0, "title": "Obama blasts opponents of Iran nuclear deal - CNN", "locations": ["United States", "Iran", "U.S.", "Washington", "Tennessee", "Capitol Hill", "Israel", "Middle East", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Bob Corker", "Netanyahu", "Joe Biden", "Benjamin Netanyahu", "Corker", "John Kerry", "Obama"], "text": "Congress grills Sec. Kerry on Iran deal specifics 02:40 PLAY VIDEO The decision facing lawmakers next month is the most significant since Congress voted to invade Iraq more than a decade ago, Obama said, insisting later that \"some form of war\" was assured if the Iran deal falls through. The 2002 Iraq vote, which spawned foreign policy headaches for the past two administrations, was driven by war-hungry politicians, Obama claimed. He said Wednesday that opponents of his agreement with Iran were deploying similar arguments ahead of the September vote in Congress. \"None of these arguments hold up. They didn't back in 2002 and 2003 and they shouldn't now,\" Obama said. \"The same mind-set, in many cases offered by the same people who seem to have no compunction with being repeatedly wrong, led to a war that did more to strengthen Iran, more to isolate the United States, than anything we have done in the decades before or since.\" Obama was not a member of the U.S. Senate in 2002, but he has repeatedly argued that it was a mistake to vote for war in Iraq and made that sentiment a cornerstone of his 2008 presidential campaign. Yet former senators who have served in his administration -- including Vice President Joe Biden and his former and current secretaries of State, Hillary Clinton and John Kerry -- all voted for the resolution. Republican pushback on speech Republicans were quick to push back on the President's remarks after the speech, with Senate Foreign Relations Committee Chairman Bob Corker, a Tennessee Republican, saying that he was \"disappointed\" by Obama's remarks and his attempt to turn the Iran deal into a partisan issue when there's concern in both parties. He particularly objected to Obama's framing the debate as equating an objection to the deal with \"this straw man that says it's about war.\" READ: Washington battle rages over Iran nuclear deal's fate He said that military officials have offered a different assessment of what the deal being voted down by Congress would mean. \"In testimony, the officials that have sat at the table with the President, have never ever ... said that if this deal doesn't work out, would there be military action,\" Corker said. Instead, he continued, they've said that \"it's likely that all our European partners would stay with us because they value our relationship more.\" And in a direct jab at Obama, he added, \"I think everyone in the U.S. knows that this President is not going to carry out military action against Iran. Iran knows that.\" With a little more than a month before the congressional review period expires, Obama's administration has launched an aggressive lobbying effort to convince Democrats of the deal's merits. They've largely written off trying to convince Republicans, many of whom denounced the negotiations that led to the accord. Opponents of the plan argue it doesn't have enough teeth in its inspection provisions and worry it allows too much of the country's nuclear infrastructure to remain in place. Millions spent to oppose the deal Part of the administration's challenge is countering an onslaught of advertising and lobbying coming from opponents of the deal, led by the American Israel Public Affairs Committee. AIPAC has committed to spending upwards of $20 million in a bid to stymie the plan. On Tuesday, Obama and Israel Prime Minister Benjamin Netanyahu offered dueling messages on the Iran deal to American Jews, delivering back-to-back addresses to leaders of Jewish organizations that could help sway opinion on Capitol Hill. Netanyahu repeated his dire warnings that the deal would imperil Israel and the wider Middle East. JUST WATCHED", "external_links": [], "published": "2015-08-05T19:56:00.000+03:00", "crawled": "2015-08-05T23:35:19.992+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}