{"organizations": ["DHS", "Southern District of Texas", "CNN", "U.S. Customs"], "uuid": "af2ab047e3e9ec0ca1193f1349128c915a06ab2f", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150206172613-jeh-johnson-2014-large-169.jpg", "site_section": "http://feeds.feedburner.com/Court-GoogleNews", "section_title": "COURT - Google News", "url": "http://edition.cnn.com/2015/08/04/politics/jeh-johnson-court-appearance-canceled/", "country": "IL", "title": "Jeh Johnson requests excuse from court appearance on immigration issue - CNN", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Jeh Johnson requests excuse from court appearance on immigration issue - CNN", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T18:43:00.000+03:00", "replies_count": 0, "uuid": "af2ab047e3e9ec0ca1193f1349128c915a06ab2f"}, "author": "", "url": "http://edition.cnn.com/2015/08/04/politics/jeh-johnson-court-appearance-canceled/", "ord_in_thread": 0, "title": "Jeh Johnson requests excuse from court appearance on immigration issue - CNN", "locations": ["Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Johnson", "Barack Obama", "Jeh Johnson", "Hanen", "Andrew Hanen"], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Jeh Johnson requests excuse from court appearance on immigration issue Updated 1640 GMT (2340 HKT) August 5, 2015 (CNN) A motion has been filed on behalf of Secretary of Homeland Security Jeh Johnson requesting he be excused from an Aug. 19 court hearing in Texas where a judge has ordered his appearance over his department's violations of a court-ordered injunction over the issuing of employment authorization grants to immigrants. On July 7, Judge Andrew Hanen in the Southern District of Texas ruled that the defendants -- Johnson and others -- had to attend an Aug. 19 hearing in the case and \"be prepared to show why he or she should not be held in contempt of Court.\" This was six weeks after the government had promised to rectify the more than 2,000 violations that were admittedly made in cases of immigrants applying for deferred action on their immigration status. The case stems from a December 2014 civil complaint naming Johnson, as well as other top officials from DHS and U.S. Customs and Border Patrol, numerous states charged that President Barack Obama's executive action on immigration is a \"unilateral suspension of the nation's immigration laws,\" which the suit calls \"unlawful.\" Among the chief complaints in the case was the issuing of 2,612 Employment Authorization Documents for three year terms instead of two years, which the government self-reported to the court as an erroneous mistake, following a Order of Temporary Injunction from implementing any changes or expansions to the DACA program in February. According to court documents, both parties were making progress towards a resolution and requested Judge Hanen give more time for reconciliation, but warned that he would not \"consider a direct violation of an injunction a side issue,\" if the matter had not been settled. In response, the government invalidated all three-year grants and EAD cards and reissued them for two years and reflected the changes in the SAVE database, which states use to verify benefits and driver's licenses. The government is now waiting to see if Hanen will be satisfied by their efforts to remedy the injunction violations and keep Secretary Johnson out of court at the next scheduled hearing for Aug. 19. Follow @CNNpolitics CORRECTION: An earlier version of this story misstated whether Johnson's court appearance had been canceled. The motion to cancel the hearing has not been ruled on by the court and Johnson is still ordered by the court to appear unless the judge rules otherwise. Immigration", "external_links": [], "published": "2015-08-05T18:43:00.000+03:00", "crawled": "2015-08-06T00:21:50.277+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}