{"organizations": [], "uuid": "1737c7d0bc3e03d1204661224583092a8781e592", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaalska.png", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/energy-environment/251040-obama-to-highlight-climate-change-impacts-in-alaska", "country": "", "title": "Obama to highlight climate change impacts in Alaska visit | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama to highlight climate change impacts in Alaska visit | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T20:32:00.000+03:00", "replies_count": 0, "uuid": "1737c7d0bc3e03d1204661224583092a8781e592"}, "author": "", "url": "http://thehill.com/policy/energy-environment/251040-obama-to-highlight-climate-change-impacts-in-alaska", "ord_in_thread": 0, "title": "Obama to highlight climate change impacts in Alaska visit | TheHill", "locations": ["Alaska"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Timothy Cama", "Obama"], "text": "Obama to highlight climate change impacts in Alaska visit By Timothy Cama - 08/13/15 12:42 PM EDT \nPresident Obama plans to travel to Alaska at the end of the month to highlight the impacts of climate change on America’s last frontier. \nIn a video Thursday, Obama said Alaska is in a unique position when it comes to climate change and he will meet with local and international leaders to discuss what is happening and how to stop it. ADVERTISEMENT “In Alaska, glaciers are melting,” he said.\n“The hunting and fishing upon which generations have depended for their way of life and for their jobs are being threatened. Storm surges once held at bay now endanger entire villages. As Alaskan permafrost melts, some homes are even sinking into the ground. The state’s God-given natural treasures are all at risk.” \nWhile the focus later this month will be on Alaska, Obama wants all Americans to be watching. \n“What’s happening in Alaska isn’t just a preview of what will happen to the rest of us if we don’t take action,” he said. “It’s our wake-up call. The alarm bells are ringing. And as long as I’m president, America will lead the world to meet this threat before it’s too late.” \nIn addition to meeting with locals, Obama will attend a conference on Arctic issues with government leaders, scientists, religious leaders and others in Anchorage to discuss climate change’s effects in the Arctic. \nThe White House has released few details about the trip, but Obama is likely to travel outside of Anchorage, possibly to a remote village. \nThe visit is part of a high-profile push by the administration this fall on climate change. It will occur less than a month after the release of the Environmental Protection Agency’s carbon dioxide rules for power plants and a few months before the United Nations meets in Paris to hammer out an international pact on climate change. \nObama hopes that he can overcome Republican opposition to his climate policies, including from Senate Majority Leader Mitch McConnell (Ky.), who has pledged to use every power he has to block the power plant rules. \nSen. Lisa Murkowski (R-Alaska) is suspicious of Obama’s intentions. \n“The president of the United States doesn’t go to anybody’s state and stay three days and not do something,” Murkowski said last week at an event hosted by Bloomberg Business. \nShe said Alaskans are speculating that Obama will announce steps to further restrict oil drilling in the Arctic National Wildlife Refuge, establish a marine sanctuary or other actions. Tags: ", "external_links": [], "published": "2015-08-13T20:32:00.000+03:00", "crawled": "2015-08-13T20:32:27.454+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}