{"organizations": [], "uuid": "040b72f00fbc5c83736143a6026de7acff517eed", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama1_080315getty.jpg", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/policy/energy-environment/250121-obama-rolls-out-climate-rule", "country": "US", "title": "Obama rolls out historic climate rule: 'We only get one planet'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama rolls out historic climate rule: 'We only get one planet'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T22:13:00.000+03:00", "replies_count": 0, "uuid": "040b72f00fbc5c83736143a6026de7acff517eed"}, "author": "Jordan Fabian", "url": "http://thehill.com/policy/energy-environment/250121-obama-rolls-out-climate-rule", "ord_in_thread": 0, "title": "Obama rolls out historic climate rule: 'We only get one planet'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama rolls out historic climate rule: 'We only get one planet' By Jordan Fabian - 08/03/15 03:13 PM EDT \nPresident Obama on Monday rolled out a historic rule that imposes the first-ever federal limits on greenhouse gas pollution from power plants. ADVERTISEMENT An emotional Obama argued climate change already affects the “reality we’re living with every day,” adding that it would be “shameful” if the U.S. waited any longer to address its causes.\n“We only get one home. We only get one planet. There is no plan B,” he said at the White House. “I don’t want my grandkids to not be able to swim in Hawaii, or not to be able to climb a mountain and see a glacier, because we didn’t do something about it.” \nThe rule is the cornerstone of Obama’s climate agenda, and administration officials have called it a crucial step to build momentum toward an international climate agreement in Paris this December. \nThe Environmental Protection Agency regulation demands that power producers cut their carbon emissions 32 percent below what they were a decade ago by 2030, and is designed to encourage use of cleaner alternatives. \nBut Republicans and industry groups have vowed to fight the rule in Congress and the courts, arguing that it could kill jobs in coal-producing areas, drive up power bills and cause the electric grid to become unreliable. \nSenate Majority Leader Mitch McConnell (R), who hails from the coal-producing state of Kentucky, said he will do “everything I can to fight” the rule. \n“These regulations would likely mean fewer jobs, shuttered power plants, and higher electricity costs for families and businesses,” he said in a floor speech on Monday. “I will not sit by while the White House takes aim at the lifeblood of our state’s economy.” \nThe White House plans to make an aggressive case for the rule as campaign season heats up; the rule’s fate could hinge on which party wins in 2016. \nDemocratic presidential front-runner Hillary Clinton has backed the deal and pledged to protect it if she is elected. Republican candidates have blasted the rule. \nObama announced he will be the first president to travel to the Alaskan Arctic, where he will highlight the negative effects of climate change. He’ll also promote clean energy sources during an event this month in Las Vegas. \nHe assailed “the special interests and their allies in Congress” who claim the rule will \"cost jobs, kill jobs, destroy the coal industry, and hurt low-income and minority community.” \n“We’ve heard these same stale arguments before,” he said. “Every time America has made progress, it has been despite these kinds of claims.” \n“If you care about low-income and minority communities, start by protecting the air that they breathe,” he added.", "external_links": [], "published": "2015-08-03T22:13:00.000+03:00", "crawled": "2015-08-04T00:35:23.307+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}