{"organizations": [], "uuid": "1ed0a6060a46d3c0ce5f5043583127b6e78e3d21", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/coalpowerplant_041515getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/250125-states-to-sue-obama-administration-over-climate-rules", "country": "US", "title": "States to sue Obama administration over climate rules", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "States to sue Obama administration over climate rules", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T22:41:00.000+03:00", "replies_count": 0, "uuid": "1ed0a6060a46d3c0ce5f5043583127b6e78e3d21"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/250125-states-to-sue-obama-administration-over-climate-rules", "ord_in_thread": 0, "title": "States to sue Obama administration over climate rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "States to sue Obama administration over climate rules Getty Images By Timothy Cama - 08/03/15 03:41 PM EDT \nA coalition of conservative states wasted little time Monday in promising to use the Obama administration to stop its climate rules for power plants. \nThe states, led by West Virginia, believe the rules are “fundamentally flawed and illegal” and intend to go to court to prove their case. ADVERTISEMENT “The final rule announced Monday blatantly disregards the rule of law and will severely harm West Virginia and the U.S. economy,” Patrick Morrisey, attorney general of West Virginia, said in a statement.\n“This rule represents the most far-reaching energy regulation in this nation’s history, drawn up by radical bureaucrats and based upon an obscure, rarely used provision of the Clean Air Act,” he said. “We intend to challenge it in court vigorously.” \nMorrisey, a Republican, did not say which states would join him in his lawsuit. The attorneys general of 13 other states joined Morrisey in his unsuccessful attempt to get the rule overturn before it was made final, and some political leaders in more than 30 states have expressed opposition to it. \nPresident Obama unveiled the final rules Monday. They aim to cut the power sector’s carbon emissions 32 percent by 2030, largely through the reduction in the use of coal for power generation. \nMonday’s release also includes standards for new power plants and a proposal for how the EPA will mandate emissions cuts in states that do not comply. \nThe states’ main objections to the rule are that the Environmental Protection Agency (EPA) lacks the authority to regulate states’ power sectors beyond the power plants themselves, as the agency plans to do. \nThey also say that the Clean Air Act of 1990 expressly forbids regulating power plants’ carbon since other harmful pollutants are regulated under another section of the law. \n“This final rule adopts a radical, unprecedented regime, transforming EPA from an environmental regulator into a central planning authority for electricity generation,” Morrisey said in the statement. \n“With this final rule, the administration is doubling down on a proposal that would force states to fundamentally reorder their energy economies, which will lead to fewer jobs, higher electricity rates and put stress on the reliability of the power grid,” he continued. \nMorrisey said he will build a coalition to challenge the rules, including states, consumers, mine workers, utilities and other groups. Tags:", "external_links": [], "published": "2015-08-03T22:41:00.000+03:00", "crawled": "2015-08-03T23:04:03.590+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}