{"organizations": [], "uuid": "79353b4637badb081be089b1d625ab61527696aa", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/UnivisionBlog.jpg", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2015/08/26/trump-immigration-issue-for-2016/", "country": "US", "title": "Trump & the Immigration Issue for 2016", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Trump & the Immigration Issue for 2016 | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "79353b4637badb081be089b1d625ab61527696aa"}, "author": "Clint Henderson", "url": "http://www.foxnews.com/us/2015/08/26/trump-immigration-issue-for-2016/", "ord_in_thread": 0, "title": "Trump & the Immigration Issue for 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Clint Henderson \n  FoxNews.com   livefyre Email Print Republican presidential candidate Donald Trump speaks during a rally, Tuesday, Aug. 25, 2015, in Dubuque, Iowa. (AP Photo/Charlie Neibergall) \nStocks continued the global sell off today with China’s key index losing another 1.3% despite aggressive moves by the Chinese government to intervene in the markets. China cut interest rates, but its moves seem increasingly impotent. Shares are down again today in Europe, and mixed in Asia. Japan closed up by 3% after six days of declines.\nThere may be some good news here in the U.S. though as stock look to open higher at the open. Still the Dow has lost 1900 points in the past two weeks!\nWhat a dramatic day in politics yesterday. Donald Trump kicking Univision anchor Jorge Ramos out of a news conference when Ramos refused to wait his turn to ask questions on illegal immigration. It’s shaping up to be one of the defining issues of the 2016 election, and Trump is refusing to back down from controversial comments about those in the country illegally. Ramos was eventually let back in the room and proceeded to debate Trump on immigration.\nNew Gallup poll shows a glaring weakness in Trump’s numbers – Latinos (not really that surprising). Two-thirds view him unfavorably. Hillary Clinton has a strong lead among Hispanics. (Most voters don’t even know the other candidates).\nA new poll in Iowa suggests despite the email controversy, Democrats are standing by Hillary Clinton. Clinton has a 34 point lead over Bernie Sanders in the Suffolk poll in Iowa. Clinton leads Biden by 43 points.\nLots of live politics events today.\nHillary Clinton speaking at 1pm on rural policy in Iowa. Ed Henry reporting.\nHuckabee, Paul, Rubio, Walker and Bush all holding events during our hours.\nTropical storm warnings issued for Puerto Rico, the U.S. and British Virgin Islands, and the Leeward Islands as Tropical Storm Erika approaches.\nWe’re also approaching the 10 year anniversary of Hurricane Katrina and we’ll talk with some special guests about how forecasting has improved.\nRespiratory problems being reported across big parts of the Western United States as wildfires continue to rage. Fires are raging in Oregon, Washington, Idaho, Montana, California and Alaska.\nThe young man accused of the New Hampshire rape at an elite prep school is expected to testify today.\nIt’s day two of a preliminary hearing for Francisco Sanchez.. accused of killing Kate Steinle in San Francisco. Sanchez is an illegal immigrant who had been in custody.  He’d been deported five times. Claudia Cowan reporting.\nJames Holmes will be formally sentenced today in Colorado for the Aurora movie massacre. He’ll get life in prison without parole. 12 were killed and dozens injured in the attack.\n2 NATO soldiers killed in an insider attack in Afghanistan.\nThe man who launched a terror attack in France and was taken down by 3 Americans and a British man was charged with terrorism finally. The Moroccan was known to EU government officials as a possible terrorist. Jonathan Hunt is reporting on the heroes who took him down.\nFor more news, follow me on Twitter: @ClintPHenderson \n \nhappening-now Jon Scott and Jenna Lee will take YOU to news when and where it happens.\nMore on this show", "external_links": [], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T17:13:19.425+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}