{"organizations": ["Islamic State", "Congress", "White House", "CNN"], "uuid": "a99181d4311c9203c9c527b0ca729351c298d595", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150807131226-exp-gps-obama-sot-netanyahu-00002220-large-169.jpg", "site_section": "http://feeds.feedburner.com/google/AOpN", "section_title": "obama news - Google News", "url": "http://edition.cnn.com/2015/08/09/politics/obama-iran-nuclear-deal-us-credibility-zakaria/", "country": "IL", "title": "Barack Obama: US credibility on the line in Iran nuclear deal - CNN", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Barack Obama: US credibility on the line in Iran nuclear deal - CNN", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T18:02:00.000+03:00", "replies_count": 0, "uuid": "a99181d4311c9203c9c527b0ca729351c298d595"}, "author": "", "url": "http://edition.cnn.com/2015/08/09/politics/obama-iran-nuclear-deal-us-credibility-zakaria/", "ord_in_thread": 0, "title": "Barack Obama: US credibility on the line in Iran nuclear deal - CNN", "locations": ["United States", "Iran", "Saudi Arabia", "US", "Washington", "Yemen", "Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Obama"], "text": "Expert: If deal holds, world will be much safer place Washington (CNN) President Barack Obama says the United States' credibility -- beyond just the specifics of the negotiations and his tenure in the White House -- is on the line as Congress votes on the Iran nuclear deal. In an interview aired Sunday on CNN's \"Fareed Zakaria GPS,\" Obama said the United States' role in global politics could be affected by the deal. \"Does the rest of the world take seriously the United States' ability to craft international agendas, to reach international agreements, to deliver on them in ways that garner the respect and the adherence from other countries?\" he said. Obama defends comparison between Iran hardliners and GOP Lawmakers are set to take up the Iran nuclear deal, which the United States and five other world powers negotiated, offering to end economic sanctions in exchange for curbs to Iran's nuclear program and increased international inspections, once they return to Washington in September. Asked whether military force against Iran might be necessary if the deal collapses, Obama said: \"I have a general policy on big issues like this not to anticipate failure. And I'm not going to anticipate failure now because I think we have the better argument.\" He pitched the deal as one that could potentially lead to increased cooperation among countries that are typically rivals, and pointed to the Islamic State's rise as one threat that could unite the region. Obama blasts opponents of Iran nuclear deal \"I do think that it is even conceivable that Saudi Arabia and Iran, at some point, would begin to recognize that their enemy is chaos as much as anything else,\" Obama said. \"And what ISIL represents and what the collapse of Syria or Yemen or others represent is far more dangerous than whatever rivalries that may exist between those two nation states.\"", "external_links": [], "published": "2015-08-09T18:02:00.000+03:00", "crawled": "2015-08-09T23:44:28.420+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}