{"organizations": [], "uuid": "813c587931773dab97c7510a1c1a012d2c7625f8", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150807121825-barack-obama-aug-5-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/08/07/politics/obama-vacation-marthas-vineyard/index.html", "country": "US", "title": "Obama family hours away from Martha's Vineyard vacation", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama family hours away from Martha's Vineyard vacation - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "813c587931773dab97c7510a1c1a012d2c7625f8"}, "author": "Sunlen Serfaty", "url": "http://www.cnn.com/2015/08/07/politics/obama-vacation-marthas-vineyard/index.html", "ord_in_thread": 0, "title": "Obama family hours away from Martha's Vineyard vacation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) President Barack Obama will escape Friday what a White House official describes as, the \"minute-by-minute breathless nature\" of Washington for a two-week vacation in the luxurious Martha's Vineyard.\n\"It's rare to sort of take the time and remove yourself of the day-to-day tick-tock,\" White House deputy press secretary Eric Schultz said in an interview with C-SPAN radio, \"so the President absolutely enjoys getting out of town, getting to a quieter more relaxed environment up in the Vineyard.\"\nThe Obamas have spent time in Martha's Vineyard during the doldrums of summer each August while the President has been in office -- an island haven off the coast of Cape Cod that has drawn former presidents and their families in the past.\n\"I think all Presidents have recognized the need to get away and to clear their minds,\" Schultz said, \"the vineyard it's a nice place that is removed again from the hustle and bustle of Washington.\"\nThe President is expected to quickly dive into the typical vacation routine he has set for himself: golf, dining out, hitting the local bookstores and spending time with family and friends -- in addition to receiving the Presidential Daily briefing each morning.\nBut looming over his head are major issues that will greet him upon returning back to Washington at the end of the month -- lobbying enough support for the Iran deal in Congress, staving off a government shutdown and the ongoing battle against ISIS. The White House says there will be an open line between the President and lawmakers during his vacation, as he continues to try to drum up enough support for the deal with Iran.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-08-07T03:00:00.000+03:00", "crawled": "2015-08-07T20:24:23.443+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}