{"organizations": [], "uuid": "46ee29ad016382ee1023d08663768758c32cac5b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/schumerobamaclinton_gn.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/251153-schumer-obama-ties-run-deep", "country": "US", "title": "Schumer, Obama ties run deep", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Schumer, Obama ties run deep", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T17:13:00.000+03:00", "replies_count": 0, "uuid": "46ee29ad016382ee1023d08663768758c32cac5b"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/251153-schumer-obama-ties-run-deep", "ord_in_thread": 0, "title": "Schumer, Obama ties run deep", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Schumer, Obama ties run deep Getty Images By Jordan Fabian - 08/15/15 10:13 AM EDT \nTeam Obama and Sen. Charles Schumer are in a public spat over the president’s nuclear deal with Iran. \nObama’s inner circle of longtime aides have blasted the New York senator on social media for his decision to back a measure disapproving the Iran deal, a top second-term goal of the president’s. ADVERTISEMENT It’s an unusual situation, with Obama’s former campaign manager David Plouffe scolding Schumer as naïve, and warning that Senate GOP Leader Mitch McConnell will run rings around him if he becomes Democratic leader, as expected, in the next Congress.\nWhat’s all the more unusual about the public war of words and hard feelings is that the ties between Team Obama and Team Schumer run deep. \nThe West Wing’s staff includes a number of key officials who were once top aides to Schumer, including Katie Beirne Fallon, a top Schumer aide who is Obama’s chief congressional liaison. \nFallon was brought on at the end of 2013 to repair the White House’s relationship with Capitol Hill following a tumultuous year and a disastrous midterm election that some Democrats blamed on Obama. \nWhile Fallon has been on leave since giving birth to twins in the spring, her office is tasked with building support in Congress for the Iran deal ahead of a key vote in September. \nPrincipal deputy press secretary Eric Schultz, another Schumer alumnus, has played an aggressive role defending the Iran deal, which involves rebutting his former boss in notes to reporters and posts on Twitter . \nOther current and former Obama administration officials include Fallon’s husband, Brian, who served as top spokesman for then-Attorney General Eric Holder after filling the same role for Schumer. He’s now a senior communications aide to Hillary Clinton’s presidential campaign. \nIt’s no surprise Schumer acolytes have filled the Obama White House. Hillary Clinton once described the senator’s hard-charging office as the “boot camp of politics,” saying , “if you survive it, you can go anywhere and do anything.” Alumni have gone on to high-powered positions in New York, Washington and beyond. \nOn the surface, the tensions might appear awkward for ex-Schumer staff in the White House, but Capitol Hill veterans say it’s clear where their loyalties lie. \n“I don’t envy them, but it is what it is,” said Jim Manley, a former top staffer to Senate Democratic Leader Harry Reid (D-Nev.) and Sen. Ted Kennedy (D-Mass.) “They are all professionals and I know they are going to put the president’s interests first and foremost.” \nSchumer’s decision to oppose the Iran deal is actually just the latest dustup with Obama. \nLast November, he second-guessed the decision to pursue Obamacare in the aftermath of the Great Recession. In a quieter fashion, he voted against a trade promotion authority bill backed by Obama but opposed by most Democrats. \nAll three items are legacy-defining items for the president, prompting Obama allies to lash out at Schumer. \n“Chuck Schumer, who said it was a mistake to pass Obamacare, now comes out again the Iran Deal. This is our next Senate leader?” tweeted former speechwriter Jon Favreau. \nThe White House did not go that far, but also did not offer praise for Schumer when asked whether it agreed he should not become the next Senate Democratic leader. \nPress secretary Josh Earnest simply said Democrats ”will consider the voting record of those who say they would like to lead the caucus.” \nSchumer struck back at the White House, raising the possibility it leaked his position after he informed the president last Thursday. The White House denies it was behind a leak. \nDespite their public saber rattling, there are many reasons to think Schumer and Obama will mend their fences. \nSchumer has visited the White House more than 100 times since Obama took office, according to public visitor records. \nJessica Schumer, the senator’s daughter, was chief of staff at the White House Council of Economic Advisers before stepping down this month. \nAnd two more Schumerites played prominent roles in electing Obama to the White House. \nSean Sweeney co-founded the pro-Obama super PAC Priorities USA Action after working as top aide to White House chief of staff Rahm Emanuel. Obama’s chief campaign fundraiser Julianna Smoot, honed her craft raising money for the Democratic Senatorial Campaign Committee in 2006 under Schumer. \nBeyond their staff-level connections, Schumer's rising status within the Democratic caucus means the White House could use his support on a number of other legislative fights this fall including thorny budget negotiations. \nEarnest said last Friday in the past, Schumer “has been supportive of other Democrats in pursuit of the president’s agenda.” \n“We like each other, respect each other, work together on 95 percent of the issues,” Schumer told reporters this week. Tags:", "external_links": [], "published": "2015-08-15T17:13:00.000+03:00", "crawled": "2015-08-15T18:18:05.694+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}