{"organizations": [], "uuid": "6def0963b81017a90e9514b01f840e7205f789e8", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150806194412-barack-obama-aug-5-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/08/06/politics/democrats-senate-house-iran-deal-vote/index.html", "country": "US", "title": "Democrats lining up behind Obama on Iran deal", "performance_score": 2, "site": "cnn.com", "participants_count": 1, "title_full": "Democrats lining up behind Obama on Iran deal - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "6def0963b81017a90e9514b01f840e7205f789e8"}, "author": "Deirdre Walsh", "url": "http://www.cnn.com/2015/08/06/politics/democrats-senate-house-iran-deal-vote/index.html", "ord_in_thread": 0, "title": "Democrats lining up behind Obama on Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights As Congress heads into a summer recess set to feature intense lobbying, many Democrats have already endorsed the Iran deal. The Planned Parenthood debate is taking some attention away from Republicans' effort to turn up the heat on Democrats on Iran. Washington (CNN) President Barack Obama is banking on a Democratic firewall to stop Republican efforts to scuttle the Iran nuclear deal, and for now his aggressive campaign to secure his party's support appears to be paying off.\nAs Congress heads into a summer recess set to feature intense lobbying by both sides, many Democrats have already endorsed the agreement. On Thursday, after Obama gave a fiery speech warning of harsh consequences should Congress vote it down, two more Democrats who were wavering came out in support: Sens. Kirsten Gillibrand of New York and Jeanne Shaheen of New Hampshire.\nRepublicans have scheduled a mid-September vote on a resolution to reject the Iran deal, which is expected to pass, and have eyed the August recess as the time to build up public pressure against the agreement. But with the latest string of Democrats coming out in favor of the deal, it is growing increasingly difficult for Republicans in the House and Senate to secure the votes they need -- 44 and 13 respectively -- from Democrats to help them override the veto Obama's promised.\nREAD: McConnell vows full debate on Iran, promises no government shutdown\n\"We're very confident that we can hold that veto, with the Democratic Caucus in the House and also the Senate,\" Ben Rhodes, the President's deputy national security advisor, told CNN on Wednesday.\nSo far, no Senate Democrats have announced that they will oppose the deal and in the House, the list of Democrats publicly opposing the deal is relatively short so far. It does, however, include a handful in senior positions (New York's Steve Israel and Nita Lowey and Florida's Ted Deutch among them), though House Minority Leader Nancy Pelosi has endorsed the deal.\nThe resistance from members of the President's party comes chiefly from those representing districts with significant Jewish constituencies, many of whom are fiercely opposed to the administration's foreign policy in the Middle East.\nSen. Chuck Schumer's vote key\nThat's why New York Sen. Chuck Schumer is particularly crucial. Republicans are hopeful that now that some key House Democrats from Schumer's home state are speaking out against the deal, he'll feel pressure to join them, which could serve as a major influence on the roughly dozen or so undecided Senate Democrats, as Schumer is in line to take over as the Senate Democratic leader next year.\nYet for now he remains among the most-high profile Democrats who won't say where they stand, repeatedly telling reporters he's methodically reviewing the details and ignoring political pressure.\n\"This is a decision of conscience. You've got to make up your own mind,\" Schumer told reporters heading into the last classified briefing for senators in Washington before the break, conducted by Energy Secretary Ernest Moniz and State Department negotiator Wendy Sherman on aspects of the deal.\nJUST WATCHED Sen. Schumer: I won't be pressured on Iran nuclear deal Replay More Videos ... MUST WATCH\nSen. Schumer: I won't be pressured on Iran nuclear deal 01:23 PLAY VIDEO New Jersey Democrat Bob Menendez, the former chairman of the Senate Foreign Relations Committee, is another member who hasn't announced his position, but he's made it clear he has a host of problems with the deal and is expected to vote with Republicans. Maryland's Ben Cardin, current Senate Foreign Relations Committee ranking member, is another important vote.\nThere are \"a couple of -- maybe three -- key senators on the Democratic side that, depending on which way they go, will sway a number of others,\" said Tennessee Republican Bob Corker, current chairman of the Senate Foreign Committee, though he declined to name them.\nBut if the administration succeeds in keeping defections to a minimum and Schumer continues to hold his cards close to his vest until the vote comes, even his potential \"no\" on the agreement likely won't dramatically affect the final outcome.\nFor now, the steady stream of statements of support from House and Senate Democrats are giving the White House some momentum heading into the summer break.\nDuring that time, outside groups opposed to the deal will be pouring tens of millions of dollars into campaign-style efforts to sway wavering Democrats and shape public opinion to ramp up pressure around the fall debate in Congress. They will be broadcasting ads, sending out mailings and visiting members' home-state offices.\nRepublican campaign eclipsed\nRepublicans, for their part, had planned to focus their August message on the dangers of approving the deal with Iran, seeing town hall meetings with constituents as an opportunity to gin up opposition as was done in similar settings against Obamacare.\nBut a series of videos showing Planned Parenthood officials discussing the sale of fetal tissue has triggered a new controversy over federal funding for the non-profit group. The conservative base is ramping up a campaign of its own to push GOP leaders not to approve any government funding bills that include federal money for Planned Parenthood.\nThat debate is taking some attention away from Republicans' effort to turn up the heat on Democrats, who are themselves using the August break to argue that the GOP fight on the spending bill could lead to another government shutdown.\nJUST WATCHED Obama: Nuclear material doesn't 'hide in the closet' Replay More Videos ... MUST WATCH\nObama: Nuclear material doesn't 'hide in the closet' 02:11 PLAY VIDEO READ: Washington battle rages over Iran nuclear deal\nTo counter the anti-deal effort in whatever shape it takes, the White House is keeping in close touch with undecided members and pledging they will have an open line to the President even as he heads off for a two-week vacation on Martha's Vineyard.\nOne concern for the administration with several weeks to go is the many Democrats who have told CNN they could hold out right until the vote is called. For Democrats who are already deeply skeptical that the Iranian government is committed to implementing the agreement, any signal from leaders in Tehran that undermines the deal during that time could jeopardize efforts to win their support.\nSeveral of those asked about the deal in recent days have indicated they still aren't ready to speak out.\n\"I've got work to do,\" Democratic Sen. Claire McCaskill of Missouri told reporters after Wednesday's classified briefing, saying she had a series of calls lined up with top diplomats to press them to resolve some outstanding concerns.\n\"I'm doing my due diligence,\" Sen. Mark Warner of Virginia, another Democrat wrestling with how to vote, told CNN.\nPennsylvania Sen. Bob Casey said he has attended briefings led by administration officials but is also setting up his own sessions with outside experts to give him additional analysis. \"I'm about a third of the way through the process.\"\nRisk in Obama's hardball speech\nObama took one last parting shot before leaving Washington, hitting critics of the deal hard in a speech Wednesday. He put the decision facing members in this vote on a par with the vote to go to war with Iraq. He insisted blocking the deal would result in a march to war.\nThough much of his attack was directed at Republicans -- he accused them of making \"common cause\" with hardliners in Tehran chanting \"Death to America\" -- it's unclear whether the President's sharpened message will backfire with those Democrats that he most needs to convince.\nThough at least five House Democrats and three senators have come out in support of Obama since his speech, others are taking a more equivocal stance.\n\"I voted against the Iraq war. I do not see a comparison between this vote and the Iraq vote,\" Cardin, who is still evaluating the deal, said on Thursday.\nCorker predicted that some of the Democrats still making up their minds would be alienated by the Obama's words.\n\"It probably infuriated some of the people that are on the bubble on the Democratic side of the aisle that are really trying to make up their mind,\" he said.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150805130637-lv-obama-iran-nuclear-deal-00001915-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150805130637-lv-obama-iran-nuclear-deal-00001915-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150805130637-lv-obama-iran-nuclear-deal-00001915-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-exlarge-169.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150805130637-lv-obama-iran-nuclear-deal-00001915-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150805130637-lv-obama-iran-nuclear-deal-00001915-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150805130637-lv-obama-iran-nuclear-deal-00001915-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150805130637-lv-obama-iran-nuclear-deal-00001915-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150328233433-chuck-schumer-medium-plus-169.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-07T03:12:28.211+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}