{"organizations": [], "uuid": "9ffb1410efb1bff6bea463ce681baad94464848a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3099432/images/o-OBAMA-FAMILY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/barack-obama/how-the-presidency-made-me-a-better-father_b_7632178.html", "country": "US", "title": "How the Presidency Made Me a Better Father | Barack Obama", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "How the Presidency Made Me a Better Father | Barack Obama", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-21T23:54:00.000+03:00", "replies_count": 0, "uuid": "9ffb1410efb1bff6bea463ce681baad94464848a"}, "author": "Barack Obama", "url": "http://www.huffingtonpost.com/barack-obama/how-the-presidency-made-me-a-better-father_b_7632178.html", "ord_in_thread": 0, "title": "How the Presidency Made Me a Better Father | Barack Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When you're the President of the United States, you're surrounded at all times -- by aides, by press, by Secret Service, by crowds. It's a bubble that's hard to escape.\nThat's what makes the people with whom you surround yourself in those rare private moments all the more important.\nIt just so happens that I'm fortunate enough to be surrounded by women. They're the most important people in my life. They're the people who've shaped me the most. And in this job, they are my sanctuary.\nPeople often ask me whether being President has made it more difficult to spend time with Michelle and our girls. But the surprising truth is that being in the White House has made our family life more \"normal\" than it's ever been.\nPhoto credit: Official White House photo by Samantha Appleton\nWhen Malia was born, Michelle and I were fortunate enough to spend a blissful three months mostly at home with our baby girl. But then Michelle went back to work part time, and I returned to my schedule of teaching at the University of Chicago law school and serving in the state legislature. This meant that I would often be away in Springfield for three days at a time. Even when I was home in Chicago, I had papers to grade and briefs to write and evening meetings to attend.\nAs professionals, we were blessed with the resources for things like reliable child care and takeout when we were too exhausted to cook. Our jobs afforded us the kind of flexibility that many working families simply don't have. Still, we each had a truckload of student debt, which meant that when we got married, we got poorer together. So we were counting every penny to manage our household bills, pay our student loans and maintain a full-time babysitter. The combined pressures sometimes put a real strain on our marriage, as they do for many working parents with young kids. After Sasha was born, Michelle was working while juggling our home life. I helped out, and I saw myself as a pretty enlightened guy. But the truth was, I helped on my terms and on my schedule, and the expectations and the burden disproportionately -- and unfairly -- fell on Michelle, as happens to many women.\nFortunately, we had the help of my wonderful mother-in-law, Marian, who lived just a few minutes away. Still, Michelle was understandably stressed and frustrated, and I suspect she felt a little like a single mom sometimes. Things didn't get any easier when I was elected to the Senate and had to commute back and forth to Washington every week. Then our lives were thrown completely out of balance during a presidential campaign that kept me on the road almost constantly -- leaving Michelle to carry an even heavier load for longer stretches of time.\nThat's why I call her the rock of our family -- because she is. She always has been.\nPhoto credit: Michelle Obama/Instagram\nStill, we didn't know what to expect when I became President. We knew I might have even less time for our family. We knew that uprooting Malia and Sasha from their friends and school and community in Chicago would be challenging. So for good measure, we brought Marian with us to ease the transition and to be with them when Michelle and I couldn't.\nBut to our surprise, moving to the White House was really the first time since the girls were born that we've been able to gather as a family almost every night. Michelle and I can go to parent-teacher conferences together. I've been able to make Malia's tennis matches and Sasha's dance recitals. Sasha let me help coach her basketball team -- the Vipers. They won the title. I've even ex-perienced what all dads dread: watching my daughter go to her first prom. In high heels.\nSo it's not always easy being a father of teenage girls. But it is pretty good to liveabove the store.\nPhoto credit: Chicago Tribune photo by Pete Souza\nEven with our jam-packed days, Michelle and I work hard to carve out certain blocks of family time that are sacrosanct. For example, at 6:30 p.m., no matter how busy I am, I leave work to go upstairs and have dinner with my family. That's inviolable. My staff knows that it pretty much takes a national emergency to keep me away from that dinner table. As a night owl, I'd rather stay up late reading briefings and working on speeches after everybody has gone to bed anyway.\nSo for an hour or so at dinner, my focus is not on my day, but on theirs. I ask Sasha and Malia the usual annoying parental questions: How was school? What are your friends up to? Have you done your homework? What are you thinking about? In return, they spend a lot of time teasing me about my big ears or stodgy suits -- and Michelle is always happy to join them.\nNow they're at an age when they're well-informed, so they often ask me questions about issues. Like a lot of young people, for instance, they're deeply interested in the environment. Like most in their gener-ation, they take it for granted that people shouldn't be treated differently because of their gender or race or sexual orientation or disability. They have every expectation that they and young women just like them can grow up to be anything they want to be. The highlight of my day is just listening to their thoughts about the world and seeing what smart, funny, kind young women they've become. That hour recharges me and gives me perspective. And those moments where I can just be Dad -- even if it's \"D d\" -- well, there's nothing better.\nPhoto credit: Callie Shell/Aurora photos\nMichelle does her best to preserve that time, and it has made a huge difference. Like I said, she's our rock. Whatever comes up, I know that they'll be there for me. And I will always be there for them. These days, the girls occasionally miss a night because they're so busy with school and activities. And like many parents of high school juniors who are excitedly touring college campuses, I'm already dreading that empty seat at the table when Malia goes off to school next fall. I can feel myself lingering at the table a little longer, trying to stave off the passage of time. But for as long as possible, I'm going to enjoy every minute of finally having us all together under one roof.\nFirst Lady Nancy Reagan once wrote, \"Nothing can prepare you for living in the White House.\" She was right, of course. Nothing can prepare you. But your family can sustain you.\nThis post originally appeared on More .\nFollow Barack Obama on Twitter: www.twitter.com/BarackObama\nMore: Barack Obama White House Father's Day Fatherhood The Obama Family Michelle Obama Raising Daughters Daughters Fathers and Daughters", "external_links": ["http://www.twitter.com/BarackObama", "http://www.more.com/relationships/attitudes/how-presidency-made-me-better-father"], "published": "2015-06-21T23:54:00.000+03:00", "crawled": "2015-06-21T23:59:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}