{"organizations": [], "uuid": "221c60ca29579d2b1f555b66cdc922461151bcea", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/americansiniraq02102015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/245450-two-iraq-veteran-democrats-urge-obama-to-limit-ground-troops", "country": "US", "title": "Two Democratic Iraq veterans urge Obama to limit ground troops", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Two Democratic Iraq veterans urge Obama to limit ground troops", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-18T21:43:00.000+03:00", "replies_count": 0, "uuid": "221c60ca29579d2b1f555b66cdc922461151bcea"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/245450-two-iraq-veteran-democrats-urge-obama-to-limit-ground-troops", "ord_in_thread": 0, "title": "Two Democratic Iraq veterans urge Obama to limit ground troops", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Two Democratic Iraq veterans urge Obama to limit ground troops Getty Images By Kristina Wong - 06/18/15 02:43 PM EDT Two House Democrats want their colleagues to sign a letter to President Obama urging him to resist calls to escalate U.S. military involvement in the fight against the Islamic State in Iraq and Syria (ISIS). Rep. Ruben Gallego (D-Ariz.), a former Marine, and Rep. Mark Takai (D-Hawaii), an Army National Guard lieutenant colonel — both members of the Armed Services Committee — say the U.S. should not fight the Iraqi military's battles for them. ADVERTISEMENT \"We fought in the Iraq War. We recognize the serious threat that ISIL poses to our allies in the region and support U.S. assistance to Iraq in its struggle against this deadly and determined enemy,\" a statement by Gallego and Takai said, using an alternative term for ISIS. \"However, we also strongly believe that we cannot fight the Iraqi military’s battles for them. That’s why we strenuously oppose calls to significantly escalate the U.S. ground commitment in this conflict,\" they said. The letter has 17 signatures so far. Gallego and Takai's letter comes at a time when other veterans in the House and Senate — mostly Republicans — are calling for an escalation in troop numbers and to allow troops to embed with Iraqi forces. \"We write to urge you to reject these misguided appeals,\" the Democrats wrote in the letter to the president. The two veterans noted Defense Secretary Ashton Carter's comments that Iraqi forces lost Ramadi, provincial capital of Anbar, because they lacked the \"will to fight.\" \"America’s history has repeatedly shown that though we can give our allies the arms and expertise to fight our common enemies, we cannot impart the determination necessary to prevail on the battlefield,\" they wrote. The letter would give lawmakers worried about the growing number of troops in Iraq an opportunity to voice their concerns, especially in the absence of a debate on whether to authorize military force against ISIS. The House on Wednesday voted against a provision that would have called for U.S. troops to be withdrawn from Iraq and Syria by the end of the year. The bipartisan measure, from Reps. Jim McGovern (D-Mass.), Barbara Lee (D-Calif.) and Walter Jones (R-N.C.), failed 139-288, with 19 Republicans joining 120 Democrats in voting yes. Tags: Past: 1 day House approves fast-track 218-208... The House took a first step toward resuscitating the White House’s trade... Trump to Stephanopoulos: 'You... “You shouldn’t be talking to me about that, in all fairness,” Trump said. New $10 bill to feature a woman Obama administration officials are seeking advice nationwide on who to... Gun owners not likely to use... A new study attempts to debunk the claim that gun owners rely on... Lindsey Graham's niece went to... \"He was quiet, strange, very unsocial,\" Graham's niece said of Dylann Roof. FBI identifies Dylann Roof, 21, as... FBI spokeswoman tells Charleston paper the suspect is from Columbia, S.C... Obama: Shooting should be wake-up... “This type of mass violence doesn’t happen in other countries,” he said. Court rules Bush officials can be... The split decision comes after more than a decade of litigation. Hillary Clinton crafts defense on... Hillary Clinton has started to formulate a strategy on one of the... Issa escorted out of Benghazi... Rep. Trey Gowdy escorted the California Republican from the closed-door... Charleston shooting suspect... Dylann Storm Roof, 21, was apprehended on Thursday morning in Shelby, N.C. New ObamaCare plan emerges in House The plan would give states the option of keeping ObamaCare subsidies. Charleston shooting suspect told... “I have to do it,” the shooter said, according to a witness account. Justice Thomas sides with liberals... The court sided with Texas after the state rejected a Confederate vanity... Nine dead in mass shooting at... \"This is an unfathomable and unspeakable act,\" Charleston's mayor said. Supreme Court sides with church in... The justices ruled 9-0 that an Arizona town's sign code violated the First... GOP lawmakers: We’re fine with... Republicans on Capitol Hill argue Trump will be a welcome addition to the... Trump paid actors to cheer his... The new contender reportedly paid extras $50 to participate in his... Carson: 'Racial based hate is... Charleston shootings are a reminder that hate is \"very much alive,\" says... Meet the ex-spy behind the... Tyler Drumheller may be called in to testify before the Benghazi panel. Issa on outside looking in on... Issa made headlines for being escorted out of a closed-door briefing. Clinton: Americans must face 'hard... Hillary called for prayer and action in response to the “horrific massacre... OPM tells lawmakers their... Members of Congress have started receiving notice from the Office of...", "external_links": [], "published": "2015-06-18T21:43:00.000+03:00", "crawled": "2015-06-20T01:55:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}