{"organizations": [], "uuid": "4c6d5999bc4b1fb6e83850a66dab52cf1346a593", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamacigarette.jpeg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/in-the-know/244497-obama-smoking-president-caught-on-camera-holding-pack-of-cigarettes", "country": "", "title": "Obama smoking? President caught on camera holding 'pack of cigarettes' | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama smoking? President caught on camera holding 'pack of cigarettes' | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-10T07:55:00.000+03:00", "replies_count": 0, "uuid": "4c6d5999bc4b1fb6e83850a66dab52cf1346a593"}, "author": "", "url": "http://thehill.com/blogs/in-the-know/244497-obama-smoking-president-caught-on-camera-holding-pack-of-cigarettes", "ord_in_thread": 0, "title": "Obama smoking? President caught on camera holding 'pack of cigarettes' | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 09, 2015, 10:01 pm Obama smoking? President caught on camera holding 'pack of cigarettes' By Judy Kurtz nomfup on Instagram \nPresident Obama, who claimed when he first entered the White House to have mostly kicked his nicotine habit, may have been caught on camera holding a pack of cigarettes. \nThe Commander-in-Chief is seen clutching a white object in a snapshot with Italian Prime Minister Matteo Renzi posted Sunday on Instagram by Renzi's spokesman. \nObama and Renzi were both In Germany attending the G7 summit. \nSeveral social media users questioned whether Obama was holding cigarettes in the pic, with one writing, “Smoking?” \nThe White House did not immediately respond to ITK's request for comment on the photo and the last time President Obama had had a cigarette. \nIt’s not the first time Obama’s claims of being mostly nicotine-free have been questioned. \nIn November, ITK broke the story that Obama invited Billy Joel to have a smoke at the White House with him. \nAccording to a source who spoke with Joel, Obama said to the “Piano Man” singer during his 2013 visit there, “I’m going out on the North Portico to have a smoke. Do you want to come with me?” \nObama said in 2009 that he “constantly” struggles with cigarettes. \n“Have I fallen off the wagon sometimes? Yes. Am I a daily smoker, a constant smoker? No,” he said at the news conference. \n“I would say that I am 95 percent cured,” Obama said, “But there are times where … There are times where I mess up.” \nObama was heard on an open mic at a 2013 event saying it was Michelle Obama who “scared” him into quitting smoking. \n“I haven’t had a cigarette in six years,\" the president said. \"That’s because I’m scared of my wife.” Past: 1 hour Bill would require trade deals to... A House trade vote could come as soon as this week. Republicans fear they will win... Republicans in Congress are worried the Supreme Court will hand them a... Bachelor Graham hints at 'rotating... “Well, I've got a sister. She could play that role if necessary,” Graham... Obama: 'We don't yet have a... The president said Iraq must show a greater commitment to fighting ISIS. Republicans wield power of the... A bill to fund the Justice Department is the latest front in the battle... Obama’s frustration with courts... Obama made some of his toughest and bluntest comments to date. Boehner: We don't have votes yet... \"I don't think we're quite there yet,\" the Speaker said. GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. House bill would require gun... Rep. Carolyn Maloney said the requirement would \"help save lives.\" Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" ", "external_links": [], "published": "2015-06-10T07:55:00.000+03:00", "crawled": "2015-06-10T07:55:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}