{"organizations": [], "uuid": "5ef5d68cbafa9e4fd479f69b5e448689d85abab3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/delaurorosa_061015getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/policy/finance/244551-last-second-objections-threaten-obama-gop-vote-on-trade", "country": "US", "title": "Last-second objections threaten Obama-GOP vote on trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Last-second objections threaten Obama-GOP vote on trade", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-10T20:06:00.000+03:00", "replies_count": 0, "uuid": "5ef5d68cbafa9e4fd479f69b5e448689d85abab3"}, "author": "Scott Wong and Peter Schroeder", "url": "http://thehill.com/policy/finance/244551-last-second-objections-threaten-obama-gop-vote-on-trade", "ord_in_thread": 0, "title": "Last-second objections threaten Obama-GOP vote on trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Last-second objections threaten Obama-GOP vote on trade By Scott Wong and Peter Schroeder - 06/10/15 01:06 PM EDT \nHouse Republicans are moving full-steam ahead toward a Friday vote to grant President Obama fast-track trade authority despite objections from Democrats to a last-second deal between Speaker John Boehner and Minority Leader Nancy Pelosi. \nThe late Tuesday night Pelosi-Boehner deal scrapping cuts to Medicare that were to be used to pay for a program offering help to workers displaced by trade appeared to lift the final obstacle to a Friday vote. ADVERTISEMENT After repeatedly hedging their bets on whether the big vote would take place this week, Republican leaders announced the Friday vote at a closed-door caucus meeting on Wednesday.\nBut Democrats at their own closed-door meeting complained to Pelosi that the Medicare deal wasn’t good enough because GOP leaders plan to attach the fix to a separate trade “preferences” bill. \nSince the bill granting trade preferences to African countries is not considered must-pass legislation, that means there is “no guarantee of enactment,” said a source in the meeting. \nBoehner and Republicans don’t want the fix attached to either fast-track or Trade Adjustment Assistance (TAA), the bill granting aid to displaced workers. Doing so would alter the Senate-passed package, requiring another vote by the upper chamber. \nIt’s not clear whether the stumble will be enough to derail the fast-track vote, though some GOP aides expressed deep frustration at the last-minute maneuvering. \n“We’ve gone out of our way to substantively address Democrats’ concerns with a TAA bill they support, it would be an incredible embarrassment to the president if his party manufactures an excuse to oppose it,” Boehner spokesman Kevin Smith said. \nBoehner suggested the last-ditch process complaints were an effort to find any reason possible to vote against the bill. \n“If people are looking for an excuse to vote no, I guess they can always find an excuse to vote no,” Boehner said. \nOther Republicans expressed confidence they would have the 218 votes necessary in win on Friday despite opposition within both parties. \n“We're moving because we feel comfortable moving,” Ways and Means Committee Chairman Paul Ryan (R-Wis.) said after the Wednesday meeting. \nObama and GOP leaders have been furiously lobbying to win the vote. \nDespite Obama’s efforts, an overwhelming number of Democrats are expected to vote against his call for fast-track. But the White House has won 19 Democratic votes, according to a Whip List kept by The Hill. \nA handful of other Democratic votes could also be in play for Obama, fast-track supporters such as Rep. Gerald Connolly (D-Va.) have said. \nRepublicans are seeking to win as many as 200 votes in their conference for fast-track. Thirty House Republicans are “no” or “leaning no” on the vote, according to The Hill’s Whip List . \nThe House Rules Committee will consider the fast-track legislation, the TAA bill and two other pieces of trade legislation at a meeting later on Wednesday that will determine the floor process for considering the bills. \nAfter Wednesday morning’s closed-door caucus meeting, Boehner acknowledged the process for bringing the bills to the floor was “still up in the air.” \nThe Pelosi-Boehner deal scraps cuts to Medicare that were to be used to pay for TAA. \nInstead, TAA’s costs will be offset by cracking down on fraudulent claims against tax credits used for higher education and increasing penalties on businesses that fail to file correct 1099 information returns. \nTrade opponents railed against the deal outside the Capitol on Wednesday. \nRep. Jan Schakowsky (D-Ill.), a strong opponent of fast-track, said the proposed changes should not assuage concerns among her fellow Democrats. \n“What we have heard so far about the so-called deal, the so-called fix is that regardless of what that fix might be, Democrats will be asked to vote for a TAA…bill that includes a cut to Medicare,” Schakowsky said. “And then we’re supposed to rely on the Republicans not to use that later on against us in TV ads that we voted against Medicare? \n“We are not going to vote on any bill within which there are words that cut and language that would cut Medicare benefits,” she added.", "external_links": [], "published": "2015-06-10T20:06:00.000+03:00", "crawled": "2015-06-10T20:19:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}