{"organizations": [], "uuid": "14eae127c16cb6eaa6923cdeb6abca2136528073", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/tsa_050211getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/policy/transportation/243769-obama-confident-in-tsa-despite-failure-to-detect-explosives", "country": "US", "title": "Obama confident in the TSA despite failure to detect explosives", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama confident in the TSA despite failure to detect explosives", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T21:06:00.000+03:00", "replies_count": 0, "uuid": "14eae127c16cb6eaa6923cdeb6abca2136528073"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/transportation/243769-obama-confident-in-tsa-despite-failure-to-detect-explosives", "ord_in_thread": 0, "title": "Obama confident in the TSA despite failure to detect explosives", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama confident in the TSA despite failure to detect explosives Getty Images By Jordan Fabian - 06/02/15 02:06 PM EDT \nPresident Obama has confidence in the Transportation Security Administration (TSA) despite the ease with which undercover agents were able to smuggle explosives into airports, the White House said Tuesday. \n“The president does continue to have confidence that the officers of the TSA do very important work that continues to protect the American people,” press secretary Josh Earnest said. ADVERTISEMENT A report released Monday found TSA employees failed to find fake explosives, weapons and other prohibited items in 95 percent of internal tests. The undercover agents successfully evaded security in 67 of 70 tests at major airports. The report prompted Department of Homeland Security Secretary Jeh Johnson to remove the agency’s acting director, Melvin Carraway, who had led the TSA since the beginning of the year.\nEarnest said the report raised \"specific concerns\" about security procedures, but said he expects the agency to adopt its recommendations on retraining employees and retesting screening equipment. \nHe added that the U.S. has a \"multi-layered\" security approach that protects travelers.“The American public should feel confident traveling in airports across the country.” \nThe White House spokesman chastised senators for acting too slowly on the nomination of Coast Guard Vice Adm. Peter Neffenger as TSA director. He said the upper chamber has held just one hearing on his nomination since Obama picked him in April. \n“We would have more confidence if we could have a more permanent, Senate-confirmed director on the job,” Earnest said. “We would like to see Congress act more quickly to confirm him.”Lawmakers have criticized Obama for not selecting a permanent leader for the agency more quickly. Longtime TSA director John Pistole announced he would retire in October, and the White House waited more than six months to nominate Neffenger. Senate Majority Leader Mitch McConnell's (R-Ky.) office blamed Obama for the delayed selection of Neffenger and said the nominee has not yet responded to some written inquiries from members of the Commerce Committee.“I understand the White House is raising some concerns about the lack of a confirmed TSA administrator. But folks, the White House is the cause of the delay,\" McConnell spokesman Don Stewart said in an email. Paul joins crusade to expose... The Bush administration blacked out 28 pages extracted from a... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-02T21:06:00.000+03:00", "crawled": "2015-06-03T05:12:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}