{"organizations": [], "uuid": "c954eb038deb30681f4a9aaa448e4668cfa764f1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/richard-brodsky/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/richard-brodsky/rand-paul-and-obama-toget_b_7498774.html", "country": "US", "title": "Rand Paul and Obama: Together Again On Common Core, Subsidies and Drug Laws | Richard Brodsky", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Rand Paul and Obama: Together Again On Common Core, Subsidies and Drug Laws | Richard Brodsky", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-03T16:39:00.000+03:00", "replies_count": 0, "uuid": "c954eb038deb30681f4a9aaa448e4668cfa764f1"}, "author": "Richard Brodsky", "url": "http://www.huffingtonpost.com/richard-brodsky/rand-paul-and-obama-toget_b_7498774.html", "ord_in_thread": 0, "title": "Rand Paul and Obama: Together Again On Common Core, Subsidies and Drug Laws | Richard Brodsky", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Occasionally, the genuine libertarian impulse of some Republicans rears up and undoes conventional alliances. Rand Paul's insistence on undoing parts of the post 9/11 wiretapping laws has created a series of strange bedfellows and opens an interesting door to further unusual coalitions.\nNational security skeptics have usually been Democrats on the left side of the divide, usually opposed by Cheney-type Republicans who cherish an expanded government role in domestic intelligence efforts. But that part of the Tea Party which lives its creed has been outspoken about limiting warrantless government intrusion into our mail and telephone calls.\nRand Paul led the successful effort to move the Republican Senate to oppose some form of data collection. Much to the chagrin of Republican hawks led by Mitch McConnell, he used the filibuster/unanimous consent rules to reform the surveillance laws. And Obama is going to sign the resulting legislation, having earlier declared himself opposed to portions of existing law.\nAll of this is well known. But it gives rise to speculation of a kind that is not only entertaining, it points to an unnerving possibility for a change in politics as usual.\nA fair-minded survey of liberal and conservative positions illuminates some interesting convergence of views. While Republicans often self-define as favoring limited government, that's not really true. Republicans do favor a reduced role for government in economic affairs. Not so much when it comes to personal behaviors usually where sex and gender are concerned. Abortion, gay marriage, pornography, birth control, and more are all places where government intrusion is a sign of commitment to\"conventional values\" which overrides any faith in limited government. Similarly, Democrats are all for keeping government out of personal lives and decisions, but are more than willing to use federal power to steer the economy and limit the power of corporations.\nIntellectual consistency has never been an attribute of American politics. Life is complicated and voters want different things at different times. But real social progress is a function of ideas and leaders who stick by them. Where Republicans and Democrats can find compatible intellectual grounds, there are all kinds of possibilities.\nLet's pretend that the Rand Paul/Obama wiretap alliance becomes politically attractive in other areas. What would emerge?\nThe first place to look is education policy, and Common Core. It's controversial on both the left (too much testing) and the right (federal overreach). And it's stirring up genuine grass roots, citizen-led movements that are ignored at one's political peril. The folks want something done. Some Republicans are using the controversy as a reason to abolish the Department of Education. Some Democrats and labor unions are using it to rehabilitate teacher unions. But there's a place for coalition here, and compromise.\nThe next place to look is the vast and expensive array of economic subsidies that corrupt (correct?) market forces and put billions in the pockets of wealthy corporations. A great deal of these giveaways are tax preferences or tax-exempt borrowing. Both left and right, and average voters, have reason to cheer if these were eliminated or reduced as a way of addressing structural budget deficits without raising taxes. There's a hint of this in the fight over Import-Export Bank subsidies.\nFinally, and obviously, reform of federal and state drug laws cries out for coalition. Put aside issues of mass incarceration, policing excesses and the rest. The economic and human cost of criminalizing addiction is becoming clearer and clearer to both Republicans and Democrats. There are a whole bunch of things that can be done.\nAre you listening Sen. Paul. it's not only the right thing to do, it's a pathway to a credible claim to your party's nomination for President. Are you listening President Obama. It's a way to use your last two years to do what you promised six years ago, transform both policies and politics and create a legacy of significance.\nOn the one hand it ain't rocket science. The limitations of the deep, existing political divisions we suffer from are obvious to everyone. New coalitions would be an improvement. On the other hand, these kind of coalitions take a light hand and a willingness to say nice things about your enemies. The wiretapping coalition will likely be hard to replicate. But the possibilities should have Rand Paul and Obama in negotiations right now.\nFollow Richard Brodsky on Twitter: www.twitter.com/richardbrodsky\nMore: Rand Paul Barack Obama Libertarian Common Core Drug Laws", "external_links": [], "published": "2015-06-03T16:39:00.000+03:00", "crawled": "2015-06-03T16:53:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}