{"organizations": [], "uuid": "44b76a059f058edb18fa0babd9814f40512ae512", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/2obamabarack0526getty_0.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/house-races/245386-obama-pelosi-raise-money-for-dems", "country": "US", "title": "Obama, Pelosi raise money for Dems", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama, Pelosi raise money for Dems", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-18T16:31:00.000+03:00", "replies_count": 0, "uuid": "44b76a059f058edb18fa0babd9814f40512ae512"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/ballot-box/house-races/245386-obama-pelosi-raise-money-for-dems", "ord_in_thread": 0, "title": "Obama, Pelosi raise money for Dems", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 18, 2015, 09:31 am Obama, Pelosi raise money for Dems By Jordan Fabian Getty Images \nPresident Obama and House Minority Leader Nancy Pelosi (Calif.) will join together to raise money for House Democrats on Friday amid a spat over the White House's trade agenda. \nObama and Pelosi will both attend a Democratic Congressional Campaign Committee fundraiser at the home of billionaire climate-change activist Tom Steyer in San Francisco, the top House Democrat’s hometown. ADVERTISEMENT The event comes one week after Pelosi helped derail a trade package backed by Obama, forcing the White House and Republicans to scramble to revive it this week. \nBoth sides have downplayed the notion that their differences on trade have harmed their relationship. \nDuring an interview with CNBC Tuesday, Pelosi dismissed a suggestion she stabbed the president in the back by opposing the trade legislation, which is his top second-term priority. \n“Well that's not fair; that's just not fair,” she said. \n“I had to say what I believed,” she added. “I said to members all along, do what you believe. And I said to other members, when other people make a decision different than you, I always say love one another.” \nWhite House press secretary Josh Earnest said Obama and Pelosi’s relationship remains strong despite their split on trade. \n“The strength of their professional and personal relationship is more than strong enough to weather a difference of opinion over one issue, even an issue as important as this one,” he told reporters on Wednesday. \nWhile Earnest has stressed the two leaders’ collaboration on other issues, such as healthcare reform, signs of tension were evident. \nHe declined to say whether Obama and Pelosi had spoken following Friday’s vote. After he was asked multiple times, Earnest said Obama was speaking to “the people who are most relevant to trying to find this path forward.” \n“She doesn't want the legislation to advance,” he said. \nPelosi did attend a picnic for members of Congress hosted by Obama on the South Lawn of the White House Wednesday evening. \nThe Friday event is part of the president’s four-day trip to California, which includes multiple high-dollar fundraisers. But it comes at a time of Democratic intraparty turmoil on trade. \nPelosi has been a critical ally for Obama in passing his legislative agenda — including the economic stimulus, ObamaCare and the Dodd-Frank financial regulatory reform bill — through Congress. \nBut with deep opposition to a trans-Pacific trade deal among congressional Democrats, Pelosi opposed a bill that would have given the president fast-track authority to complete the agreement. \nThe House is expected to vote again on the proposal Thursday, after Obama struck a deal with his traditional adversaries, Speaker John Boehner (R-Ohio) and Senate Majority Leader Mitch McConnell (R-Ky.). \nThe fundraisers are signs, however, the president is looking to promote party unity as the 2016 election approaches. Democrats are seeking to retain the White House and take back control of the House and Senate, which fell into GOP hands during the last two midterm elections. \nOn Thursday, Obama will attend two Democratic National Committee fundraisers hosted by actor/filmmaker Tyler Perry and TV producer Chuck Lorre. \nHe will sit down for an interview to air on comedian Marc Maron’s “WTF” podcast, before jetting off to San Francisco for fundraisers with Steyer and venture capitalist Shervin Pishevar. He will also give a speech Friday to the U.S. Conference of Mayors. Tags:", "external_links": [], "published": "2015-06-18T16:31:00.000+03:00", "crawled": "2015-06-18T23:18:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}