{"organizations": [], "uuid": "14cdf64ad39d9643dab33991e82bae39bd80adbf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3067452/images/o-CALIFORNIA-SHANNON-GROVE-facebook.jpg", "site_section": "http://www.huffingtonpost.com//feeds/verticals/green/index.xml", "section_title": "Green - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/12/california-drought-abortion_n_7571584.html?utm_hp_ref=green&ir=Green", "country": "US", "title": "GOP Rep Suggests Abortion Is To Blame For California Drought", "performance_score": 7, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "GOP Rep Suggests Abortion Is To Blame For California Drought", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-12T22:17:00.000+03:00", "replies_count": 0, "uuid": "14cdf64ad39d9643dab33991e82bae39bd80adbf"}, "author": "Lydia O'Connor", "url": "http://www.huffingtonpost.com/2015/06/12/california-drought-abortion_n_7571584.html?utm_hp_ref=green&ir=Green", "ord_in_thread": 0, "title": "GOP Rep Suggests Abortion Is To Blame For California Drought", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nScientists are still exploring the causes of California's historic drought, but one local lawmaker thinks it might all come down to one thing: God's wrath over abortion . \nWhile speaking at the California ProLife Legislative Banquet last week, California Assemblywoman Shannon Grove (R) suggested a theory that the state's worst drought in 1,200 years may be divine retribution for California providing women with access to abortions, RH Reality Check reported. \n“Texas was in a long period of drought until Governor Perry signed the fetal pain bill,” she told the audience. “It rained that night. Now God has his hold on California .” \nGrove was likely referring to House Bill 2, RH Reality Check noted, a Texas abortion bill banning abortions 20 weeks after fertilization , four weeks earlier than the standard set by Roe v. Wade. \nGrove did not immediately respond to a request for confirmation that she made the statement at the event, but she elaborated on her theory in a Facebook comment . \n\"I believe --and most Americans believe --that God’s hand is in the affairs of man, and certainly was in the formation of this country,\" she wrote. \"Is this drought caused by God? Nobody knows. But biblical history shows a consequence to man’s actions.\" \nPro-life activists in Kern County, the district Grove represents, didn't stand behind Grove's idea. \n“We are huge fans of Shannon Grove and all her efforts in Sacramento on behalf of life,” Marylee Shrider, executive director of Right to Life of Kern County, told The Bakersfield Californian. “That being said, we have not made a connection between the drought and abortion here in California.” \nPro-Choice Kern County called her comments \"absolute lunacy\" and made this mock-up of a T-shirt. \nSay it loud. \nPosted by Pro-Choice Kern County on Friday, June 12, 2015 \nCalifornia is suffering through its fourth year of unrelenting drought , and a snowpack measure in the Sierra Nevada mountains in April revealed levels at a record low of 6 percent of the long-term average for that time of year. \nThe National Oceanic and Atmospheric Administration reported last year that \"natural oceanic and atmospheric patterns\" are likely the primary causes of the drought, while others in the science community say man-made climate change has exacerbated the conditions . Also on HuffPost:", "external_links": [], "published": "2015-06-12T22:17:00.000+03:00", "crawled": "2015-06-12T22:34:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}