{"organizations": [], "uuid": "c5ead3dc7cd672f3247fffa2ada4103827850a17", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3086564/images/o-OFFICIAL-WHITE-HOUSE-PHOTO-BY-AMANDA-LUCIDON-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/impact/blog.xml", "section_title": "Impact Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/carrie-hesslerradelet/michelle-obama-the-perfec_b_7607806.html?utm_hp_ref=impact&ir=Impact", "country": "US", "title": "Michelle Obama, the Perfect Partner for Peace Corps and Let Girls Learn", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Michelle Obama, the Perfect Partner for Peace Corps and Let Girls Learn", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-18T01:27:00.000+03:00", "replies_count": 0, "uuid": "c5ead3dc7cd672f3247fffa2ada4103827850a17"}, "author": "Carrie Hessler-Radelet", "url": "http://www.huffingtonpost.com/carrie-hesslerradelet/michelle-obama-the-perfec_b_7607806.html?utm_hp_ref=impact&ir=Impact", "ord_in_thread": 0, "title": "Michelle Obama, the Perfect Partner for Peace Corps and Let Girls Learn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nI was so inspired by First Lady Michelle Obama’s remarks about the importance of girls’ education yesterday in London. \"There are 62 million young women like all of the girls here and around the country who aren't getting an education, and their potential is just being lost. And we can't afford that. We can't afford that.\" -- First Lady Michelle Obama \nEarlier this year, the Peace Corps was proud to join the First Lady in a powerful new collaboration called Let Girls Learn , dedicated to expanding access to education for adolescent girls around the world. We know that an investment in girls’ education is the single greatest investment we can make – because when a girl is given the opportunity to learn, everyone in her life benefits. \nFirst Lady Michelle Obama delivers remarks at Mulberry School for Girls in London, England. The First Lady visits the school to discuss cooperation between the United States and the United Kingdom to improve educational opportunities for girls around the world through the Let Girls Learn initiative. June 16, 2015. (Official White House Photo by Amanda Lucidon) \nThat’s why the momentum from the First Lady’s trip to London has been so exciting to witness. Together, a series of newly announced British and American partnerships totaling nearly $200 million will support training, girls’ leadership camps, and community-based programs in countries around the world. \nFirst Lady Michelle Obama meets with Prime Minister David Cameron and his wife Samantha Cameron for tea at 10 Downing Street, London, England. June 16, 2015. (Official White House Photo by Amanda Lucidon) \nI was especially proud to see returned Peace Corps Volunteer Bina Contreras (Uganda, 2009-11) participate in a roundtable discussion with the First Lady, Justine Greening, Secretary of State for International Development, Dr. Pauline Rose, Director of the Research for Equitable Access and Learning Center at Cambridge University, Nicky Morgan, Secretary of State for Education and Minister for Women and Equalities, and Fiona Mavhinga, founder of the Camfed Alumnae Association. \nBina represented all of us at the Peace Corps with grace and poise as she spoke about creating a workshop for girls’ empowerment through breakdancing in her community in Uganda. “My experience in Uganda showed me what is possible when you give girls a chance to step into the circle,” Bina said. \nFirst Lady Michelle Obama is welcomed by students at Mulberry School for Girls in London, England. The First Lady visits the school to discuss cooperation between the United States and the United Kingdom to improve educational opportunities for girls around the world through the Let Girls Learn initiative. June 16, 2015. (Official White House Photo by Amanda Lucidon) \nThis week I’m in Fiji, witnessing the power of Peace Corps Volunteers in action in communities across this island nation. Yesterday I visited the dynamic Farron Harvey in Korovou – a health educator working in secondary schools. Through role play and creative arts, Farron is inspiring girls to reach deep inside themselves to discover their own potential. She spends every weekend in the local market chatting with mothers and fathers about their important role in encouraging their daughters to stay in school and strive for a brighter future. \nPeace Corps Volunteers like Bina and Farron are catalysts for community–led change around the world. Now is the time for girls’ education to take the world stage. We are so excited for the future of Let Girls Learn, and I can’t imagine a better partner for this initiative than First Lady Michelle Obama. \nFirst Lady Michelle Obama greets students after delivering remarks at Mulberry School for Girls in London, England. The First Lady visits the school to discuss cooperation between the United States and the United Kingdom to improve educational opportunities for girls around the world through the Let Girls Learn initiative. June 16, 2015. (Official White House Photo by Amanda Lucidon) \nLearn more and support Peace Corps’ Let Girls Learn efforts by visiting letgirlslearn.peacecorps.gov . \nFollow Carrie Hessler-Radelet on Twitter: www.twitter.com/PeaceCorpsDir More: Click here to view Conversations Conversations", "external_links": [], "published": "2015-06-18T01:27:00.000+03:00", "crawled": "2015-06-18T02:14:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}