{"organizations": [], "uuid": "c358cb7d8a300b395478ed65f8637bc919ad549f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/flournoymichele_112414getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/246232-ex-obama-official-argues-for-intensifying-isis-strategy", "country": "US", "title": "Ex-Obama official argues for intensifying ISIS strategy", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ex-Obama official argues for intensifying ISIS strategy", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-26T06:19:00.000+03:00", "replies_count": 0, "uuid": "c358cb7d8a300b395478ed65f8637bc919ad549f"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/246232-ex-obama-official-argues-for-intensifying-isis-strategy", "ord_in_thread": 0, "title": "Ex-Obama official argues for intensifying ISIS strategy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ex-Obama official argues for intensifying ISIS strategy Getty Images By Kristina Wong - 06/25/15 11:19 PM EDT A former top defense official in the Obama administration is urging the White House to intensify its strategy against the Islamic State in Iraq and Syria (ISIS). In a Washington Post op-ed on Wednesday, Michèle Flournoy, former undersecretary of defense for policy and current chief executive of the Center for a New American Security (CNAS), called for measures that the Obama administration has staunchly opposed. \"To succeed in the president’s ambition of ultimately destroying the Islamic State — or even to contain its gains or roll them back — a broader and more intensive effort is needed,\" Flournoy wrote in the op-ed with Richard Fontaine, CNAS president and former foreign policy adviser to Sen. John McCain (R-Ariz.). ADVERTISEMENT The president should allow U.S. troops to deploy closer to the battlefield to better advise Iraqi forces in combat, they said. \"When Iraqis are trained, equipped and ready for combat, U.S. military advisers should embed with Iraqi battalions and advise Iraqi commanders during operations from 'the last point of concealment' — i.e., a protected position closest to the fighting,\" they wrote. Currently, U.S. forces are deployed with Iraqi forces at the headquarters, or brigade level, far from the battlefield. They are also prohibited from ground combat or entering any situation where they may come into contact with enemy forces. \"It’s hard to bolster morale, stiffen backbones or adjust a battle plan from a training base,\" they wrote. They also recommended allowing U.S. forward air controllers to embed with Iraqi forces in combat and call in air support so those forces could be \"far more effective.\" \"The air campaign against the Islamic State has thus far been the centerpiece of U.S. strategy, yet as structured it is unlikely to help turn the tide,\" they wrote. They said the U.S. should also provide weapons directly to Sunni and Kurdish fighters, which the Obama administration has also refused to do out of concern it would undermine the Shiite-controlled central government in Baghdad. They added the U.S. should hold out the prospect that arms could flow through Baghdad if the central government establishes a reliable process for their transfer and incorporates those fighters into its military. The U.S. should also step up training and equipping of Syrian rebels and establish an integrated political-military plan that increases pressure on Baghdad to be more inclusive, they said. Lastly, the U.S. needs to intensify the global campaign against ISIS in places such as Libya and Afghanistan, they said. The president should \"abandon the calendar-based withdrawal\" of U.S. troops from Afghanistan by 2016, they said. Instead, the U.S. should keep a \"modest force in place\" to advise and assist the Afghan national security forces. They acknowledged these steps would \"mark a significant intensification\" in the campaign against ISIS and expose U.S. troops to greater risk. \"Yet the risks of inaction are greater still,\" they wrote. \"If we have learned anything since 9/11, it should be the need to deny sanctuary to a terrorist group that wreaks unspeakable violence and brutality against all except those who share its tortured worldview.\" Tags:", "external_links": [], "published": "2015-06-26T06:19:00.000+03:00", "crawled": "2015-06-27T13:18:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}