{"organizations": [], "uuid": "c1ba8d8a4d62ab772322c4b01ad50af5c8c892dd", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/060715_FF_Corke_640.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/08/game-changer-hastert-accuser-transforms-coverage-sexual-abuse-allegations/", "country": "US", "title": "Obama: ISIS will be driven out of Iraq, despite setbacks", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama: ISIS will be driven out of Iraq, despite setbacks", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-08T16:24:00.000+03:00", "replies_count": 0, "uuid": "3310d1ee0490463e13c7459111c2f5d9baf0247f"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/08/obama-isis-will-be-driven-out-iraq-despite-setbacks/", "ord_in_thread": 0, "title": "Obama: ISIS will be driven out of Iraq, despite setbacks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: ISIS will be driven out of Iraq, despite setbacks Published June 08, 2015 Facebook 0 Twitter 0 Email Print \nDespite setbacks that have raised doubts about his policy, President Obama voiced optimism Monday that the Islamic State would be driven out of Iraq, but he said the effort will take time and an inclusive government in Baghdad. \nObama said the U.S. will continue to ramp up training and assistance to Iraqi troops so they can carry out offensive, not just defensive, operations. \n\"We have seen successes but we have also seen setbacks,\" Obama said at the end of a meeting with Iraqi Prime Minister Haider al-Abadi. Referring to Islamic State by one of its acronyms, Obama added: \"ISIL is going to be driven out of Iraq and ultimately it is going to be defeated.\" \nObama and Abadi spoke on the sidelines of a meeting by leaders of the Group of Seven industrialized economies. \nThe session with Abadi came just a day after an Iraqi general declared that Iraqi troops, backed by Shiite militias, had recaptured key parts of the northern refinery town of Beiji from the Islamic State. The news was a welcome change of pace for the U.S. after Islamic State militants won a major victory by capturing the city of Ramadi, the capital of Iraq's Anbar province. \nAbadi thanked Obama and G-7 members for standing with Iraq against the Islamic State. He said Iraqi troops were winning a number of battles and downplayed Ramadi's loss. \n\"We lost it only temporarily,\" he said. \nObama expressed confidence in Abadi's leadership, saying he appeared committed to creating an inclusive government that gave voice to the various factions in Iraq. \n\"There's a refreshing honesty in the part of the prime minister that a lot of work needs to be done,\" Obama said. Advertisement", "external_links": [], "published": "2015-06-08T16:24:00.000+03:00", "crawled": "2015-06-08T16:35:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}