{"organizations": [], "uuid": "207fd0fc6a8f01372d12abd1bfe3ec5867a76c8a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamachinatalks06242015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed", "section_title": "The Hill: International Policy", "url": "http://thehill.com/blogs/ballot-box/246059-obama-presses-china-over-hacking", "country": "US", "title": "Obama presses China over hacking", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama presses China over hacking", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-25T00:44:00.000+03:00", "replies_count": 0, "uuid": "207fd0fc6a8f01372d12abd1bfe3ec5867a76c8a"}, "author": "tlejeune@thehill.com (Jordan Fabian and Cory Bennett)", "url": "http://thehill.com/blogs/ballot-box/246059-obama-presses-china-over-hacking", "ord_in_thread": 0, "title": "Obama presses China over hacking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 24, 2015, 05:44 pm Obama presses China over hacking By Jordan Fabian and Cory Bennett Getty Images \nPresident Obama on Wednesday pressed top Chinese officials on cyber attacks during a closed-door meeting at the White House. \nObama “raised ongoing U.S. concerns” about China’s cyber behavior and urged the officials “to take concrete steps to lower tensions,” the White House said in a statement. \nThe meeting was part of a three-day summit of U.S. and Chinese officials in Washington, which has been overshadowed by a massive hack of federal government data. The administration is still reeling from a crushing breach that officials have privately blamed on China. ADVERTISEMENT The digital break-in has potentially exposed tens of millions of people's sensitive information and given Beijing a comprehensive database on U.S. government workers that could be used to imitate officials, stage future cyberattacks or even recruit informants or blackmail administrators.\nState Department officials vowed before the talks to directly address the data breach with Chinese officials, although public statements on cybersecurity throughout the meetings have been mostly oblique. \n“The kinds of conversations that take place behind closed doors in the context of a summit as significant as the Strategic and Economic Dialogue are different than the kinds of public discussions that take place,” White House press secretary Josh Earnest told reporters on Tuesday. \nChina has chided the U.S. for blaming Beijing for coordinating the hack. \nOther issues have also been raised between the two global economic powers. The U.S. and its allies are concerned that China’s island-building in the South China Sea could spark regional instability. And the U.S. is pursuing a trade deal with 11 other nations along the Pacific Rim it has billed as a way to counter the China’s rise. \nObama also raised the issue of China’s maritime behavior with the officials. \nBut the president sought to stress areas of common interest, such as working to reduce greenhouse gas emissions, economic treaties, negotiating a deal to curb Iran’s nuclear program and enacting domestic economic reforms. \nOfficials in the meeting included Chinese vice premiers Wang Yang and Liu Yandong.", "external_links": [], "published": "2015-06-25T00:44:00.000+03:00", "crawled": "2015-06-25T06:10:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}