{"organizations": [], "uuid": "fadfd224de06d5dd4ef6758505c7fbd9f458d6b4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/2obamabarack0526getty_0.jpg", "site_section": "http://www.breakingnews.com/feeds/rss", "section_title": "Breaking News - breakingnews.com", "url": "http://thehill.com/blogs/floor-action/house/244440-bill-would-require-publicly-available-trade-deal-before-fast-track", "country": "US", "title": "Lawmakers file bill to prohibit vote on granting President Obama fast-track trade authority unless text of trade deal is publicly available - @thehill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Lawmakers file bill to prohibit vote on granting President Obama fast-track trade authority unless text of trade deal is publicly available - @thehill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-09T23:41:00.000+03:00", "replies_count": 0, "uuid": "fadfd224de06d5dd4ef6758505c7fbd9f458d6b4"}, "author": "Jimmy Lovaas", "url": "http://thehill.com/blogs/floor-action/house/244440-bill-would-require-publicly-available-trade-deal-before-fast-track", "ord_in_thread": 0, "title": "Lawmakers file bill to prohibit vote on granting President Obama fast-track trade authority unless text of trade deal is publicly available - @thehill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 09, 2015, 03:12 pm Bill would require publicly available trade deal before fast-track vote By Cristina Marcos Getty Images \nA bipartisan group of lawmakers is calling for a change to House rules to prohibit a vote on granting President Obama fast-track trade authority unless the text of a sweeping trans-Pacific trade deal is publicly available. \nRep. Marcy Kaptur (D-Ohio) has introduced a resolution, titled the Trade Review Accountability Needs Sunlight and Preview of Any Regulations and Exact Negotiated Components (Trade TRANSPAREN-C), to require the trade deal to be publicly available for at least 60 days before Congress could vote to give the president the ability to sign off on an international negotiation. \n“Today it has become more of a blank check for the executive and turned Congress into little more than a rubber stamp,” Kaptur said in a statement about trade promotion authority (TPA). “This legislation calls for an end to this dangerous and irresponsible approach and replaces it with sunlight in the form of public access and accountability.” ADVERTISEMENT Congress could not vote to amend the trade pact upon granting the president fast-track authority.\nMembers of Congress have only been allowed to review text of the emerging Trans-Pacific Partnership (TPP) trade deal in a classified setting. A House vote to clear the Senate-passed bill to grant fast-track trade authority could come as soon as this week. \n“We can all agree that these trade agreements will have a significant economic impact,” Rep. Duncan Hunter (R-Calif.) added. “Given that fact, before Congress takes a vote on TPA, or any other trade measure, the American people deserve to see what these agreements contain.” \nFifteen other lawmakers have cosponsored the resolution, including Reps. Alan Grayson (D-Fla.), Louise Slaughter (D-N.Y.), Tim Ryan (D-Ohio), Paul Tonko (D-N.Y.), Mark Takai (D-Hawaii), Richard Nolan (D-Minn.), Brad Sherman (D-Calif.), Ted Yoho (R-Fla.), Mo Brooks (R-Ala.), David McKinley (R-W.Va.), Walter Jones (R-N.C.), Chellie Pingree (D-Maine), Mark Pocan (D-Wis.), Scott Perry (R-Pa.) and Steve Russell (R-Okla.). Tags: Past: 1 hour Sanders pulls within 8 points of... National Republican Party leaders frame the results as trouble for Clinton. Republicans fear they will win... Republicans in Congress are worried the Supreme Court will hand them a... Bachelor Graham hints at 'rotating... “Well, I've got a sister. She could play that role if necessary,” Graham... Obama: 'We don't yet have a... The president said Iraq must show a greater commitment to fighting ISIS. Republicans wield power of the... A bill to fund the Justice Department is the latest front in the battle... Obama’s frustration with courts... Obama made some of his toughest and bluntest comments to date. Boehner: We don't have votes yet... \"I don't think we're quite there yet,\" the Speaker said. GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. House bill would require gun... Rep. Carolyn Maloney said the requirement would \"help save lives.\" Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\"", "external_links": [], "published": "2015-06-09T23:41:00.000+03:00", "crawled": "2015-06-10T00:09:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}