{"organizations": [], "uuid": "34d57a07909efa8bbd11d5e5d75b5ee3e2d3fc6d", "thread": {"site_full": "radio.foxnews.com", "main_image": "http://www.alan.com/wp-content/uploads/2015/06/cheneyobama1_featured-340x213.jpg", "site_section": "http://radio.foxnews.com/feed/", "section_title": "FOX News Radio", "url": "http://radio.foxnews.com/2015/06/08/cheney-i-dont-know-what-makes-obama-tick/", "country": "IL", "title": "Cheney: ‘I Don’t Know What Makes Obama Tick’", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Cheney: ‘I Don’t Know What Makes Obama Tick’", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-08T21:00:00.000+03:00", "replies_count": 0, "uuid": "34d57a07909efa8bbd11d5e5d75b5ee3e2d3fc6d"}, "author": "Alan Colmes", "url": "http://radio.foxnews.com/2015/06/08/cheney-i-dont-know-what-makes-obama-tick/", "ord_in_thread": 0, "title": "Cheney: ‘I Don’t Know What Makes Obama Tick’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dick Cheney just doesn’t understand Barack Obama. \n“I’ve tried for a long time, John, to try to understand what makes him tick, and frankly I don’t know,” he said. Cheney commented specifically on Obama’s handling of ISIS, saying that he was confused by the president’s counterterrorism strategy in the region where the extremist group operates. \n“Obama has placed pretty severe limits on what our air guys can do. I think he doesn’t really want to be there — I think he’s there very reluctantly in terms of having fielded a limited force, because he felt after ISIS moved in in a big way and is obviously such a major threat, he felt that he had to do something politically, but it’s half a loaf, it’s pin pricks,” he said. \n“In order to be really effective with air power, you’ve got to be able to actively and aggressively go hit those targets, and that means targeting … that means flying enough missions to be able to do the job, and clearly they’re not allowed to do that at this point.” \nCheney also criticized potential 2016 Democratic candidate Hillary Clinton in the interview, arguing that she had faced too much scandal to be taken seriously in the Oval Office. \n“I must say I am surprised there isn’t more opposition to her within the Democratic Party,” he said. “I think there’s serious problems there that need to be investigated. If I was a Democratic voter, I would be looking for new talent.” Now read this:", "external_links": [], "published": "2015-06-08T21:00:00.000+03:00", "crawled": "2015-06-08T21:51:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}