{"organizations": [], "uuid": "b143491c0c2514958b4f1f50ae1ffd0c2969f616", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/bushjeb_051415getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/pundits-blog/defense/243853-jeb-bush-is-wrong-iraq-was-not-stable-before-obama", "country": "", "title": "Jeb Bush is wrong; Iraq was not stable before Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Jeb Bush is wrong; Iraq was not stable before Obama | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "b143491c0c2514958b4f1f50ae1ffd0c2969f616"}, "author": "", "url": "http://thehill.com/blogs/pundits-blog/defense/243853-jeb-bush-is-wrong-iraq-was-not-stable-before-obama", "ord_in_thread": 0, "title": "Jeb Bush is wrong; Iraq was not stable before Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 03, 2015, 07:30 am Jeb Bush is wrong; Iraq was not stable before Obama By H.A. Goodman, contributor Getty Images \nPresident Obama was sworn into office on Jan. 20, 2009. The year prior, Iraq and Afghanistan witnessed continued violence, bloodshed and political chaos. In the case of Iraq, George W. Bush's last year in office didn't see \" stability \" in that country, as stated recently by his brother, former Florida Gov. Jeb Bush (R). Unlike the myth that many Republicans are perpetuating in 2015, the surge did not \" generally pacify \" Iraq, Bush did not leave a \" winning war ,\" and Iraq didn't \"deteriorate\" (such as George W. Bush adviser Karl Rove stated after refusing to apologize to a veteran) because American troops left the country. ADVERTISEMENT From 2005 until the end of 2008, when adding up all the terrorist attacks compiled by the U.S. Department of State's Country Reports on Terrorism 2009 , there were a total of 19,535 terrorist attacks in Iraq. As for people \"killed, injured, or kidnapped\" from these 19,535 terrorist attacks, the State Department lists a total of 122,596 Iraqis . Regarding Iraq's human rights assessment in 2008, the State Department explained that \"Insurgent and extremist violence, coupled with weak government performance in upholding the rule of law, resulted in widespread and severe human rights abuses.\" One recent study cites a figure of 500,000 Iraqis who have died from terrorism, sectarian violence and other aspects of the Iraq War.\nThe terror associated with Jeb Bush's definition of \"stability\" in Iraq and the latest conservative whitewashing of the Iraq War's bloody history is staggering. The U.S. Department of State records that in 2008 alone, 3,256 terrorist attacks occurred in Iraq. As far as Bush \"winning\" the war, 19,077 people were \"killed, kidnapped, or injured as a result of terrorism\" in Iraq during George W. Bush's last year in office. Prior to 2008, the U.S. Department of State cites a total of 12,841 terrorist attacks in Iraq from 2006 to 2007, resulting in the death of 82,891 Iraqis. Apparently, Jeb Bush and others never read the State Department's Country Reports on Terrorism 2009 , which states that \"Since 2005 [until 2009], Iraq continues to be the single country with the most attacks and fatalities due to terrorism.\" \nWill any Republican candidate for president ever explain how 3,256 terrorist attacks in Iraq during 2008, and 12,841 terrorist attacks in Iraq during the 2006 to 2007 period, could ever mean \"stability,\" \"winning,\" or a country that Obama could have \"lost?\" \nAs for Iraq’s civilian \"deaths from violence\" in 2008, which includes terrorism but also addresses the issue of sectarian violence, the Iraq Body Count lists a death toll of 10,271 Iraqis. In terms of Jeb Bush's view of progress, or the impact of the surge, 26,036 Iraqis died in 2007 and 29,439 Iraqis died in 2006. Therefore, in the context of the 55,475 Iraqis who died as a result of violence in Iraq during the two years before 2008, Republicans might indeed be able to claim a morbid view of progress in George W. Bush's last year in office. \nNo rational person, however, could claim that such carnage means stability had been achieved in Iraq. \nIn the context of the war on terror, when all of the Unites States is rightfully gripped with shock and horror over the three Americans killed and over 260 wounded in the Boston Marathon bombing, Americans in general could never relate to the slaughter in Iraq. First, as mentioned earlier, the State Department's 2008 terrorism report states that 19,077 people were \"killed, kidnapped, or injured as a result of terrorism\" in Iraq. Second, the imaginary triumph that Rove, Bush and others claim existed doesn't take into account the 1,003 suicide bombings in Iraq from 2003 to 2010. According to a report about the prevalence of terrorism in Iraq, The Lancet notes that \"For the period between March, 2003, and December, 2010, their database contained information for 1,003 suicide attacks on Iraqi targets, which resulted in an estimated 12, 284 deaths — 79 suicide attacks on coalition forces caused about 200 deaths.\" \nRepublican claims of winning and stability seem morbidly ironic, especially when reading the following accounts of suicide bombings (only three examples within thousands of documented attacks) found in the University of Maryland's Global Terrorism Database: 02/01/2008 : Two bombs, attached to two mentally disabled women, were detonated in a crowded marketplace in Baghdad, Iraq, killing 90 people and injuring 130. Although it has not claimed responsibility for the attack, al-Qaida is suspected. 02/24/2008 : In Iskandariyah, Iraq, a suicide bomber detonated an explosive vest he was wearing in the midst of a pilgrimage of Shiites on their way to Karbala to celebrate Arbaeen. Forty five pilgrims were killed in this attack, and 68 civilians were injured according to Iraqi police. \nThe years leading up to Obama's inauguration witnessed bombs strapped to \"mentally disabled women\" and explosive vests detonating near religious pilgrimages, not Rove's irrational assertion that \"things deteriorated\" once we left Iraq. Also, the horrendous tally of 19,535 terrorist attacks during the last four years of George W. Bush's presidency can't logically be labeled a \"winning war.\" \nIn terms of political dysfunction, the reality is that Obama inherited from George W. Bush an Iraqi government full of corruption and Sunni versus Shiite bloodshed, despite the presence of U.S. troops. According to Transparency International's Corruptions Perception Index in 2008, Iraq almost took the crown as the most corrupt nation in the word, ranking 178 out of 180 countries. In 2008, an Amnesty International article noted that \"despite the heavy presence of [U.S.] and Iraqi security forces, Iraq is one of the most dangerous countries in the world, with hundreds of Iraqi civilians killed every month.\" As for the viewpoint of Rove, Bush and others who desperately yearn to keep Americans in Iraq, 322 U.S. soldiers died in 2008 and 1,834 Americans died in this war-torn country during the two years prior. \nAfter becoming president, Obama had to confront the limits of what U.S. News & World Report called an \" overstretched \" U.S. military that had been in combat longer than ever in U.S. history. Therefore, Jeb Bush's belief that keeping American troops in Iraq longer could either help America or promote \"stability\" (or prevent thousands of terrorist attacks) in Iraq simply doesn't correlate with reality. Jeb Bush, like Karl Rove and others, is wrong about Iraq and its \"stability\" before Obama took office. \nGoodman is an author and a journalist. Tags: ", "external_links": [], "published": "2015-06-03T03:00:00.000+03:00", "crawled": "2015-06-03T15:02:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}