{"organizations": [], "uuid": "d215a55444b651617581b1235c39143998c97cd6", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaaddress0530.png", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/244131-obama-wins-17th-house-dem-vote-for-trade", "country": "US", "title": "Obama wins 17th House Dem vote for trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama wins 17th House Dem vote for trade", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-05T18:54:00.000+03:00", "replies_count": 0, "uuid": "d215a55444b651617581b1235c39143998c97cd6"}, "author": "iswanson@thehill.com (Vicki Needham)", "url": "http://thehill.com/policy/finance/244131-obama-wins-17th-house-dem-vote-for-trade", "ord_in_thread": 0, "title": "Obama wins 17th House Dem vote for trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama wins 17th House Dem vote for trade By Vicki Needham - 06/05/15 11:54 AM EDT \nRep. Derek Kilmer (Wash.), whose state is one of the nation’s largest exporters, will back trade promotion authority (TPA), an aide told The Hill. \nKilmer would be the 17th House Democrat to back TPA or fast-track authority for President Obama, according to The Hill’s Whip List . ADVERTISEMENT The House could vote as early as next week on fast-track. Obama is aggressively lobbying Democrats, while House GOP leaders are trying to win over their members.\nLabor unions and other liberal groups oppose fast-track, which would ensure an up-or-down vote on the Trans-Pacific Partnership trade deal by preventing lawmakers from amending it. The TPP is being negotiated by the U.S. with 11 other nations. \nObama could need as many as two dozen House Democrats to back him in order to win the vote. \nObama told Rep. Jim Himes earlier this week that he had 20 Democratic votes, according to Himes. The Connecticut Democrat came out in favor of fast-track on Thursday, and Obama won another key Democratic vote in Rep. Don Beyer (Va.). \nMinority Leader Nancy Pelosi (D-Calif.) is not whipping the vote for Obama, and on Thursday said it was Speaker John Boehner’s (R-Ohio) responsibility to win votes for the measure. She guessed there were no more than 18 Democratic votes for fast-track. \nRep. Paul Ryan (R-Wis.), chairman of the Ways and Means Committee, acknowledged this week that his side doesn’t have the votes yet. But he also said he was more confident than before that he would get the votes to pass. \nRepublicans hold 245 seats in the lower chamber and they need 218 to pass the trade legislation. Tags: Past: 1 day Republicans wield power of the... A bill to fund the Justice Department is the latest front in the battle... Boehner: We don't have votes yet... \"I don't think we're quite there yet,\" the Speaker said. GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-05T18:54:00.000+03:00", "crawled": "2015-06-06T05:00:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}