{"organizations": [], "uuid": "745612871aaaf38366e04d5f177076e013a2d8e3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/blogs/floor-action/senate/245543-mcconnell-senate-will-vote-on-20-week-abortion-ban", "country": "US", "title": "McConnell: Senate will vote on 20-week abortion ban", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McConnell: Senate will vote on 20-week abortion ban", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-19T20:04:00.000+03:00", "replies_count": 0, "uuid": "745612871aaaf38366e04d5f177076e013a2d8e3"}, "author": "jcarney@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/senate/245543-mcconnell-senate-will-vote-on-20-week-abortion-ban", "ord_in_thread": 0, "title": "McConnell: Senate will vote on 20-week abortion ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 19, 2015, 01:04 pm McConnell vows Senate will vote on 20-week abortion ban By Jordain Carney Francis Rivera \nSenate Majority Leader Mitch McConnell pledged Friday that legislation to ban abortions after 20 weeks of pregnancy would get a vote in the upper chamber. \n\"A bill that protects life after 20 weeks in the womb, a bill that in the past in the Senate couldn't even get a hearing, I promise you will be getting a vote,\" the Republican leader said in an address at the Faith and Freedom Coalition Conference in Washington. ADVERTISEMENT Sen. Lindsey Graham (R-S.C.), who is running for president, introduced the legislation earlier this month. The House passed similar legislation last month. \nMcConnell, who didn't specify a timeline for bringing up the measure, said the bill is \"not only good news for pro-lifers, it's good news for the entire country.\" \n\"It's about time we begin the process of putting America into the ranks of most other civilized countries by protecting unborn children after 20 weeks in the womb. It's high time we did that,\" he added. \"I don't know about you but I think we're failing as a country if the best thing we can offer to a scared young mom to be is a referral to Planned Parenthood.\" \nWhile McConnell promised to bring a bill up for a vote, it faces an uphill path to clearing the Senate and would likely face a veto threat from President Obama \nThe Senate bill so far has 45 co-sponsors — all Republicans. Missing from the list of supporters are Sens. Kelly Ayotte (R-N.H.) and Mark Kirk (R-Ill.), both of whom are up for reelection in blue-leaning states, as well more moderate Republicans, including Sen. Susan Collins (R-Maine.) \nSenate Republicans are having to play defense on 24 Senate seats during next year's election, and a vote for the legislation could be used against vulnerable Republicans. \nGraham brushed aside the potential political fallout, telling reporters earlier this month : \"Don’t get in politics if you don’t want to talk about things like this.” Past: 1 day House approves fast-track 218-208... The House took a first step toward resuscitating the White House’s trade... Trump to Stephanopoulos: 'You... “You shouldn’t be talking to me about that, in all fairness,” Trump said. New $10 bill to feature a woman Obama administration officials are seeking advice nationwide on who to... Gun owners not likely to use... A new study attempts to debunk the claim that gun owners rely on... Lindsey Graham's niece went to... \"He was quiet, strange, very unsocial,\" Graham's niece said of Dylann Roof. FBI identifies Dylann Roof, 21, as... FBI spokeswoman tells Charleston paper the suspect is from Columbia, S.C... Obama: Shooting should be wake-up... “This type of mass violence doesn’t happen in other countries,” he said. Court rules Bush officials can be... The split decision comes after more than a decade of litigation. Hillary Clinton crafts defense on... Hillary Clinton has started to formulate a strategy on one of the... Issa escorted out of Benghazi... Rep. Trey Gowdy escorted the California Republican from the closed-door... Charleston shooting suspect... Dylann Storm Roof, 21, was apprehended on Thursday morning in Shelby, N.C. New ObamaCare plan emerges in House The plan would give states the option of keeping ObamaCare subsidies. Charleston shooting suspect told... “I have to do it,” the shooter said, according to a witness account. Justice Thomas sides with liberals... The court sided with Texas after the state rejected a Confederate vanity... Nine dead in mass shooting at... \"This is an unfathomable and unspeakable act,\" Charleston's mayor said. Supreme Court sides with church in... The justices ruled 9-0 that an Arizona town's sign code violated the First... GOP lawmakers: We’re fine with... Republicans on Capitol Hill argue Trump will be a welcome addition to the... Trump paid actors to cheer his... The new contender reportedly paid extras $50 to participate in his... Carson: 'Racial based hate is... Charleston shootings are a reminder that hate is \"very much alive,\" says... Meet the ex-spy behind the... Tyler Drumheller may be called in to testify before the Benghazi panel. Issa on outside looking in on... Issa made headlines for being escorted out of a closed-door briefing. Clinton: Americans must face 'hard... Hillary called for prayer and action in response to the “horrific massacre... OPM tells lawmakers their... Members of Congress have started receiving notice from the Office of...", "external_links": [], "published": "2015-06-19T20:04:00.000+03:00", "crawled": "2015-06-19T20:36:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}