{"organizations": [], "uuid": "2442f4b20b2af942fb4a8390953b0ba315706dd8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/new-york/blog.xml", "section_title": "New York Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/gabriel-sayegh/reform-new-york-untangling-the-future-of-marijuana_b_7503822.html", "country": "US", "title": "Reform New York: Untangling the Future of Marijuana Policy in the Empire State | Gabriel Sayegh", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "Reform New York: Untangling the Future of Marijuana Policy in the Empire State | Gabriel Sayegh", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-03T21:03:00.000+03:00", "replies_count": 2, "uuid": "bef9416cf7ac8fd59f104f2842f5361b64a701ea"}, "author": "Gabriel Sayegh", "url": "http://www.huffingtonpost.com/gabriel-sayegh/reform-new-york-untangling-the-future-of-marijuana_b_7503822.html#post-0", "ord_in_thread": 0, "title": "Reform New York: Untangling the Future of Marijuana Policy in the Empire State | Gabriel Sayegh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What is the status of medical marijuana in New York? How can one get a medical card or a dispensary license? When will New York end its racially biased marijuana arrest crusade? Will New York tax and regulate marijuana more broadly for adult use, like Colorado and Washington?\nThese questions are swirling around New York, where marijuana policies can seem like a confused, tangled mess. New York, the 23rd state to pass medical marijuana legislation, now has regulations are so restrictive that they may not work, leaving patients to suffer. New York, the marijuana arrest capital of the world, where young Black and Latino men are routinely arrested for marijuana possession while Albany lobbyists are scoring huge, lucrative contracts to help companies secure licenses to sell marijuana in the state. New York, where legislation to legalize marijuana for adults is gaining steam with the public and elected officials, yet faces enormous opposition by bureaucrats committed to the status quo of the failed war on drugs. What's really going on, and where's it all going?\nTomorrow, the Drug Policy Alliance (DPA), along policymakers, leaders in the marijuana industry, patients and supporters, are gathering to explore -- and answer -- these questions about marijuana policy reform in New York. The unique event is a fundraiser to support DPA's marijuana reform work in New York and will be held at ABC Home , in their beautiful event space named after Deepak Chopra, known as DeepakHomebase . Attendees will learn about New York's new medical marijuana program along with plans to legalize marijuana for adult use and to rebuild our communities devastated by marijuana prohibition.\nThere's a lot to cover. Last year, after a long fight led by the Drug Policy Alliance and our Compassionate Care New York campaign, we finally passed New York's medical marijuana bill -- a victory for patients, families and those who believe our drug laws need serious reform. But the bill was narrowed considerably by Governor Cuomo in the final days of negotiations, and has been further restricted through the regulatory process . Now all eyes are on implementation, because how this program is implemented will directly impact patients, and could impact the future of marijuana reform in New York for years to come.\nAs Cuomo stalls, reform campaigns to fix New York's broken marijuana policies are moving ahead. Legislators have introduced bipartisan legislation to create an emergency access program for critically ill patients, legislation to fix New York's medical marijuana law, a bill to further decriminalize marijuana and redress some of the harms caused by the enforcement of marijuana prohibition, and comprehensive legislation to tax and regulate marijuana in a manner similar to alcohol, while reinvesting in communities negatively impacted by the war on drugs.\nSpeakers at the event include these elected officials in Albany leading the charge for reform: Assemblyman Richard Gottfried, sponsor and champion of the medical marijuana law and proposals to expand it; Senator Daniel Squadron, and Assemblyman Robert Rodriquez, the sponsors of the Fairness and Equity Act , a robust human rights and racial justice bill that would decriminalize marijuana; and Senator Liz Krueger, sponsor of Marijuana Regulate and Tax Act -- a bill that would end prohibition in New York.\nAll around the country and around the world, people are recognizing the failure of marijuana prohibition and enacting sensible reforms. It's time for New York to leave behind the broken mess of our existing policies and help lead the movement for reform. Join us Thursday evening to find out how you can support this important work.\nFollow Gabriel Sayegh on Twitter: www.twitter.com/_gabrielsayegh\nMore:", "external_links": [], "published": "2015-06-03T21:03:00.000+03:00", "crawled": "2015-06-05T03:07:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}