{"organizations": [], "uuid": "c01a9e93a99584cd17d295b950bb5d13d1345840", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/black-voices/blog.xml", "section_title": "Black Voices Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/elwood-d-watson/conservatives-stop-scapegoating_b_7516584.html", "country": "US", "title": "Conservatives, Stop Scapegoating President Obama for the State of Race Relations | Elwood D. Watson", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 13, "title_full": "Conservatives, Stop Scapegoating President Obama for the State of Race Relations | Elwood D. Watson", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-05T23:04:00.000+03:00", "replies_count": 15, "uuid": "6f7caf63c0334173b3cacf4fd38b6b493a660c52"}, "author": "Elwood D. Watson", "url": "http://www.huffingtonpost.com/elwood-d-watson/conservatives-stop-scapegoating_b_7516584.html#post-0", "ord_in_thread": 0, "title": "Conservatives, Stop Scapegoating President Obama for the State of Race Relations | Elwood D. Watson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Many Republican politicians, pundits and loyal GOP voters have targeted President Obama (and, in some cases, First Lady Michelle Obama) as the reason for the current state of race relations in our nation. As those in the land of rock-ribbed republicanism see it, our current commander-in-chief is the primary reason that the racial situation is less than desirable.\nFrom former FOX News host (now 2016 presidential candidate) Mike Huckabee to retired neurosurgeon (also presidential candidate) Ben Carson. To Louisiana governor and potential 2016 candidate Bobby Jindal. To the always flame-throwing fire in the mouth, tea party darling and also 2016 candidate Ted Cruz. Each of these conservative Republican politicians has laid the downturn in racial harmony squarely at the feet of the president. Needless to say, they are not alone.\nRight-wing talk radio has made blaming President Obama for race relations a cottage industry. In fact, I have not seen anyone blamed so much for a situation since former Bush administration official Michael Brown was scapegoated for the ineffectiveness of FEMA during the hurricane Katrina tragedy in 2005. Perennial Obama critics Rush Limbaugh and Sean Hannity, acid-tonged author and commentator Ann Coulter, outlandish radical Obama haters Mark Levin, Alex Jones and sophisticated Obama critic Erik Erickson. Hugh Hewitt, Ben Ferguson and others have made criticizing the president for racism a daily affair. In fact, it has become an obsessive, 'round the clock hobby for a large segment of these individuals.\nTruth be told, race relations have not worsened under President Obama. They are indeed less than desirable and far from ideal, but the fact is that has always been the case. From the time African slaves were bought ashore and stepped foot on American soil to the present day, race relations between different ethnic groups has always been complex and complicated at best.\nAmerica always has had a tortured racial past. The nation's gender history hasn't been much better. From slavery to the Civil War. From the reactionary 1980s to the 21st century, race (like gender) is an ongoing topic that has been deeply etched in the fabric of the restless soul of a conflicted and unsettled nation. This is nothing new.\nRather, what has transpired is that, during his tenure in office, largely due to his race, many people have been forced to confront the issue of race as well as their own racism. Sad as it is, the truth is that, for many of these people, the fact that a man of African descent is the leader of the free world is too much for them to bear. To these people the Obama presidency is the equivalent of having a bad nightmare from which they have not yet awakened.\nBlack leaders of state are supposed to be relegated to literary fiction or to the imaginary creative spaces of Hollywood portrayed by actors such as James Earl Jones, Morgan Freeman and Chris Rock. It is these sorts of fictionalized accounts of Black presidencies where such limited idealism is supposed to end. Psychologically speaking, this is where many of the president's critics dwell in terms of emotion and values.\nLet's keep it real here. As a historian, I can tell you with unalloyed confidence that neither President Obama nor his wife is responsible for the more than 400 years of racial strife that has plagued this nation from its inception. He and his administration did not pull Union troops out of the South and end Reconstruction in the mid to late 19th century (that was Rutherford B. Hayes and his vice president, Samuel Tilden) that led to the demise of brief Black political enfranchisement in the South and other regions of our nation and allowed the South to return to its previous behavior of terrorizing, oppressing and demoralizing Black citizens thorough the sadistic employment of Jim Crow laws, grandfather clauses, colored (yes, \"colored,\" that was the term used at the time) and White water fountains, poll taxes, literacy tests and, in a number of cases, lynchings and other forms of physical violence.\nSuch vicious forms of political, social, emotional, economic and psychological denigration and degradation manifested themselves in the culture of the South for more than a half century right up until the mid-20th century long before our current president was born or held political office. President Obama can plead not guilty.\nDoes this mean that the president is devoid of any issue in regards to race? Of course not. There are a number of people (I am one of them) who have at times felt that the president has not taken an aggressive enough stance on discussing racial issues. In some cases, we feel that he has erred on the side of caution far too often in an effort to placate, pacify or, at the very least, neutralize his critics who monitor every comment he makes and are ready to pounce on or, in many cases, distort comments he makes in regards to the issue.\nThat being said, I can also understand why he is often apprehensive in public about really engaging in any sort of racial discussion for this very reason. The tender feelings of some on the conservative right (and some faux liberals) can be easily offended by people of color and other anti-racist activists who candidly and unabashedly speak truth to power.\nThe cold hard fact is that race has been, is and, for the foreseeable future, will be a crucial and ongoing issue for Americans of all political and racial and cultural backgrounds to deal with long after President Obama leaves office. It is best that we decide to approach the subject aggressively, practically and wisely.\nDr. Elwood D. Watson is a professor Of History, African American Studies and Gender Studies at East Tennessee State University. He is a co-author of Beginning a Career in Academia: A Guide For Graduate Students of Color . (Routledge Press, 2014)\nMore: Politics Black Voices Impact Barack Obama Race Baiting Racism Race Relations Conservative Media Republicans This Blogger's Books and Other Items from... Performing American Masculinities: The 21st-Century Man in Popular Culture\nby Elwood Watson, Marc Edward Shaw Outsiders Within: Black Women in the Legal Academy After Brown v. Board\nby Elwood D. Watson", "external_links": [], "published": "2015-06-05T23:04:00.000+03:00", "crawled": "2015-06-07T20:24:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}