{"organizations": [], "uuid": "0ec9b57e7cdbc37f407a5d4105a286b3877b4c4f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/isisflag_getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/blogs/pundits-blog/defense/246223-with-new-ransom-policy-obama-is-thinking-with-his-heart-not-head", "country": "US", "title": "With new ransom policy, Obama is thinking with his heart, not head", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "With new ransom policy, Obama is thinking with his heart, not head", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-26T14:00:00.000+03:00", "replies_count": 0, "uuid": "0ec9b57e7cdbc37f407a5d4105a286b3877b4c4f"}, "author": "dunlap@law.duke.edu (Charles J. Dunlap Jr., contributor)", "url": "http://thehill.com/blogs/pundits-blog/defense/246223-with-new-ransom-policy-obama-is-thinking-with-his-heart-not-head", "ord_in_thread": 0, "title": "With new ransom policy, Obama is thinking with his heart, not head", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 26, 2015, 07:00 am With new ransom policy, Obama is thinking with his heart, not head By Charles J. Dunlap Jr., contributor Getty Images \nIn many ways, President Obama's new policies regarding hostages are an understandable reaction to heartrending stories from the families of the victims of terrorist hostage-taking. \nIn fact, some of his initiatives are overdue and warranted. For example, the establishment of a dedicated fusion cell, as well as better communication with the families of the taken, are the kinds of things that make eminent sense. Even something as controversial as assisting families with contacting hostage-takers can find logic in many instances. \nBut the president's decision to permit families to pay ransoms is unwise, and one for which innocent people may pay the price. Inevitably, such financial support will enable extremists to commit further acts of terrorism, including taking even more hostages. Then-Under Secretary for Terrorism and Finance Intelligence David Cohen (now deputy director of the CIA ) has made these very points. Speaking in August 2014, he said that \"[r]ansom payments lead to future kidnappings, and future kidnappings lead to additional ransom payments. And it all builds the capacity of terrorist organizations to conduct attacks.\" ADVERTISEMENT Likewise, terrorism expert Brian Michael Jenkins has pointed that the $132 million ransom allegedly demanded by kidnappers for James Foley was the \"the equivalent of several hundred thousand AK-47s at black market prices or more than 200 times what it cost al Qaeda to carry out the 9/11 attacks.\" One can only imagine the nightmares so much money could have fueled had the Foley family somehow managed to raise it.\nWe should not underestimate how much of a break Obama's new policy is from the U.S.'s previous approach. The criminal law prohibition against providing \"material support\" to terrorism in almost any fashion has heretofore been interpreted quite broadly, to include much more than ransom payment. For example, in 2009, the Supreme Court in Holder v. Humanitarian Law Project upheld its application to a nonprofit who merely sought to \"train members of [a terrorist organization] on how to use humanitarian and international law to peacefully resolve disputes,\" and to \"teach ... members how to petition various representative bodies such as the United Nations for relief.\" \nAlthough integrating hostile and violent groups into the rule of law and associated political processes is a time-honored means of ending armed conflicts ( think Irish Republican Army ), the Supreme Court nevertheless concluded that Congress could still criminalize such behavior because a \"foreign terrorist organization introduced to the structures of the international legal system might use the information to threaten, manipulate, and disrupt,\" adding that \"[t]his possibility is real, not remote.\" One might likewise say that the possibility that terrorists will use ransom money to create mayhem is \"real, not remote.\" \nNeither the fact that the U.S. itself is not paying the money, nor even that some \"agreement\" with the terrorists to only use the ransom money for humanitarian purposes might be obtained, would change the deadly equation. As the Supreme Court said in the Humanitarian Law Project case, \"money is fungible.\" It was logical, the court said, for Congress to conclude that money collected for one purpose could be \"redirected to funding the [terrorist] group's violent activities.\" Again, the similarity with the fungibility and utility of ransom money is striking. \nFurthermore, how long will the U.S. be able to maintain such a schizophrenic policy? Imagine a situation where a wealthy family funds a ransom, while a poor family is unable to do so. Will the politicians yield to the predictable public clamor? Perhaps the better question is: How will they not? \nLikewise, what about the bevy of legal issues? Notwithstanding his constitutional obligation to \" take care that the laws be faithfully executed ,\" the president appears to be deciding, in effect, to unilaterally \"amend\" the law prohibiting material support by using executive power to create an exemption not found in the text. This exacerbates an already existing tension about executive discretion as being used to override the duties of the Constitution's \"take care\" clause. \nMoreover, in the aftermath of last fall's Arab Bank case, where a major Middle Eastern bank was held liable by terrorism victims for \"handling transfers and payments\" for members of a terrorist organization, financial institutions will likely be quite wary of any involvement in ransom payments. Even if somehow the U.S. legal architecture could be finagled to avoid liability, global financial entities are present in many jurisdictions where they might be vulnerable to suit. \nMoreover, it is not inconceivable that ransom-paying families themselves could be the target of lawsuits by future victims of terrorism given, as Cohen indicates, the predictability that ransom payments will facilitate more hostage-taking and more terrorist attacks. \nNo doubt the President was under great pressure from the victim's families, but it is naive to think that the families of whomever is fated to be the next victim will be placated by his efforts. The anxiety and fear in such situations can hardly be comprehended; the threat is too personal and too deeply emotional for families caught in such horrific circumstances. \nBut presidents have to steel themselves to accept the burden that prioritizing the interests of the citzenry as a whole obliges them to bear. As much as we want to relive the terrible pain of the few, it cannot be at the price of the safety and security of the many. \nDunlap is a retired Air Force major general and currently professor of the practice of law at Duke University School of Law, where he is also executive director of the Center on Law, Ethics and National Security. Tags:", "external_links": [], "published": "2015-06-26T14:00:00.000+03:00", "crawled": "2015-06-26T16:24:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}