{"organizations": [], "uuid": "f397cc9b26bcd0cd82270a52617dc79f6533fb55", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/carsonben_051615getty.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/gop-primaries/245341-carson-immigration-is-not-only-issue-latinos-care-about", "country": "US", "title": "Carson: Immigration is not only issue Latinos care about", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Carson: Immigration is not only issue Latinos care about", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-18T01:07:00.000+03:00", "replies_count": 0, "uuid": "f397cc9b26bcd0cd82270a52617dc79f6533fb55"}, "author": "esmilowitz@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/ballot-box/gop-primaries/245341-carson-immigration-is-not-only-issue-latinos-care-about", "ord_in_thread": 0, "title": "Carson: Immigration is not only issue Latinos care about", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 17, 2015, 06:07 pm Carson: Immigration is not only issue Latinos care about Dr. Ben Carson pushed back against assumptions that Latinos only care about immigration reform and preached unity during a speech Wednesday at a conference of Latino public officials. The 2016 Republican presidential contender opened by telling the crowd at the National Association of Latino Elected and Appointed Officials conference that many people advised him explicitly focus on immigration during his remarks. “They said, ‘Latino elected officials, you need to talk about immigration.’ But that’s like when I go speak to an African-American group and they say you need to talk to government entitlements. Give me a break,” he said. ADVERTISEMENT “People have a vast variety of things they are interested in, and to pigeonhole people into one area I think indicates something more about the person who is doing the pigeonholing, and that’s not a good thing.” Carson used a metaphor about his work as a brain surgeon to make the point that all Americans are the same deep down. He said that when he opens up patients’ skulls to work on their brains, nothing else matters. “The skin doesn’t make them who they are, the hair doesn’t make them who they are. The brain makes them who they are,” he said. But Carson said he couldn’t completely avoid immigration and warned that the nation must seal its borders in the name of national security. “The reason that I think we need to seal our borders completely, all of our borders — north, south, east and west — is not so much because I’m afraid of somebody from Honduras, but I’m afraid of somebody from Syria who wants to bomb us and do bad things,” he said. Carson also added that as a “compassionate nation,” Americans and American businesses must try to help people improve their situations in their home countries so that they don’t feel the need to come to the U.S. illegally. The GOP presidential hopeful talked about issues he said all Americans shared, including the need for strong education and American leadership. He joked about his own missives at school, recounting that he was a poor student until he started devoting time to reading. By then, he said, the same kids that called him dumb in fifth grade were begging him for help with their homework in seventh grade. Carson also called for a six-month tax hiatus to let companies repatriate money back into the United States on the condition that the companies spend 10 percent of that money creating jobs for the unemployed and for those on welfare. “You want to talk about an economic stimulus that costs the American taxpayer not one penny?” he asked. “That would be the way to do it.” With the Latino share of the electorate steadily increasing, many activists have touted the voting segment as a key constituency in the 2016 presidential election and beyond. President Obama relied on Latino voters as part of the constituency that helped him win two presidential elections. Univision's Jorge Ramos said in March that an estimated 16 million Latinos will vote in the 2016 elections, according to estimates, compared to the 12 million that voted in 2012. Carson is the only GOP presidential candidate taking part in the NALEO Republican Presidential Candidate Forum, although the organization extended invitations to 15 likely or declared GOP candidates. Democratic candidates Hillary Clinton and Sen. Bernie Sanders (I-Vt.) will speak over the next two days. Former Maryland Gov. Martin O’Malley was also invited but is not attending. Tags:", "external_links": [], "published": "2015-06-18T01:07:00.000+03:00", "crawled": "2015-06-18T11:33:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}