{"organizations": [], "uuid": "e866bbea66477104cb00eaea5677bcafb652ee84", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamagermany_060715getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/244224-obama-works-to-mend-ties-in-germany", "country": "US", "title": "Obama works to mend ties in Germany", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama works to mend ties in Germany", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-07T15:03:00.000+03:00", "replies_count": 0, "uuid": "e866bbea66477104cb00eaea5677bcafb652ee84"}, "author": "kballuck@thehill.com (Kyle Balluck)", "url": "http://thehill.com/policy/international/244224-obama-works-to-mend-ties-in-germany", "ord_in_thread": 0, "title": "Obama works to mend ties in Germany", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama works to mend ties in Germany Getty Images By Kyle Balluck - 06/07/15 08:03 AM EDT \nPresident Obama at the beginning of a trip to Germany for the G7 summit celebrated the “enduring friendship between the German and American people.” ADVERTISEMENT During comments on Sunday in the Bavarian village of Krun, Obama thanked his “great friend and partner,” German Chancellor Angela Merkel, and the people of Germany for their hospitality.\nObama, noting he as making his fourth visit to Germany as president, joked that he was going to try to buy some lederhosen after watching an alphorn performance. \nTensions between the two countries were heightened when a document leaked by Edward Snowden showed U.S. officials spied on Merkel’s personal cellphone. \n“Now, I must admit that when I first learned that Angela was going to host the G7 in Bavaria, I was hoping that it would fall during Oktoberfest. But, then again, there’s never a bad day for a beer and a weisswurst,” Obama said Sunday to laughter. \n“I come here grateful for the history that we share,” he said. “And so much of America -- including my hometown of Chicago -- would not be the same without the contributions of so many German immigrants, including from Bavaria. Over the years, Bavaria and Germany have returned the favor by welcoming countless Americans -- including generations of our servicemembers and students from the George Marshall Center. And on behalf of the American people, I want to thank you for your gracious hospitality.” \nObama thanked Merkel for her “partnership and leadership” on topics facing the G7 leaders, including trade partnerships, Ukraine and climate change. \n“My message to the German people is simple: We are so grateful for your friendship, for your leadership. We stand together as inseparable allies -- in Europe and around the world.” \nAfter his remarks, Obama was seen on a video feed drinking a beer and eating a pretzel and some kind of schnitzel. \n\"It was a very fine beer,” Obama said as he left the town square. “I wish I was staying.\" \nThe G7 leaders later posed in a field for a photo, according to the pool reporter. \n\"Everybody wave,\" Obama suggested. All the world leaders waved, somewhat reluctantly, according to the report, except for Merkel, who kept her hands clasped in front of her. \nObama and Merkel later discussed the ongoing crisis in Ukraine, according to the White House, and “agreed that the duration of sanctions should be clearly linked to Russia's full implementation of the Minsk agreements and respect for Ukraine's sovereignty.” \nThey also discussed the Transatlantic Trade and Investment Partnership and the “importance of working together to promote a successful climate agreement this year,” the White House added. \nThe president is expected attend a cultural performance Sunday evening, followed by a working dinner with G7 leaders on foreign and security issues. \n--This report was updated at 9:03 a.m. Tags:", "external_links": [], "published": "2015-06-07T15:03:00.000+03:00", "crawled": "2015-06-07T20:49:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}