{"organizations": [], "uuid": "3675d0a07d672ae01189b0210bac60c00096ca2c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_boehnerjohn_031715gn.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/246269-boehner-flies-with-obama-on-air-force-one", "country": "US", "title": "Boehner flies with Obama on Air Force One", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Boehner flies with Obama on Air Force One", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-26T20:07:00.000+03:00", "replies_count": 0, "uuid": "3675d0a07d672ae01189b0210bac60c00096ca2c"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/246269-boehner-flies-with-obama-on-air-force-one", "ord_in_thread": 0, "title": "Boehner flies with Obama on Air Force One", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 26, 2015, 01:07 pm Boehner flies with Obama on Air Force One By Jordan Fabian \nSpeaker John Boehner (R-Ohio) traveled with President Obama on Air Force One Friday to South Carolina for a funeral service for a victim of a mass shooting at a historic black church. The flight is believed to be Boehner’s first with Obama on the presidential aircraft. ADVERTISEMENT The Speaker was accompanied by seven other lawmakers who are attending the funeral of Rev. Clementa Pinckney, the pastor of Charleston's Emanuel African Methodist Episcopal Church, who was one of the nine victims of the shooting. \nObama will deliver a eulogy for Pinckney. The president, first lady Michelle Obama, Vice President Biden and Dr. Jill Biden are traveling with the president and will meet with the victims’ families.Boehner and Obama have had a fractious relationship since Republicans took control of the House in 2010. But in recent weeks, the two worked closely together to advance the president’s trade agenda, which was staunchly opposed by members of the president’s own party. The Speaker is leading a bipartisan delegation of lawmakers to the funeral. Accompanying him on Air Force One are House Majority Whip Steve Scalise (R-La.), Congressional Black Caucus Chairman G.K. Butterfield (D-N.C.), House Democratic Caucus Chairman Xavier Becerra (D-Calif.), Rep. Chris Van Hollen (D-Md.), Rep. John Lewis (D-Ga.), Rep. Elijah Cummings (D-Md.) and Rep. David Price (D-N.C.), the White House said.Spokesman Eric Schultz said there is another plane carrying more members of Congress attending the funeral. Boehner’s decision to travel with Obama stands in contrast to 2011, when he reportedly declined an invitation from the president to fly on the aircraft to a memorial service for the victims of a mass shooting in Tucson, Ariz.", "external_links": [], "published": "2015-06-26T20:07:00.000+03:00", "crawled": "2015-06-26T21:20:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}