{"organizations": [], "uuid": "508be34b270f26b9f9fb6e271133d83252a11d29", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_042415getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/national-security/244352-families-of-yemeni-drone-strike-victims-sue-obama", "country": "US", "title": "Families of Yemeni drone strike victims sue Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Families of Yemeni drone strike victims sue Obama", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-09T01:07:00.000+03:00", "replies_count": 0, "uuid": "508be34b270f26b9f9fb6e271133d83252a11d29"}, "author": "jhattem@thehill.com (Julian Hattem)", "url": "http://thehill.com/policy/national-security/244352-families-of-yemeni-drone-strike-victims-sue-obama", "ord_in_thread": 0, "title": "Families of Yemeni drone strike victims sue Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Families of Yemeni drone strike victims sue Obama By Julian Hattem - 06/08/15 06:07 PM EDT \nThe families of two Yemeni men killed in a 2012 drone strike have filed a wrongful death lawsuit against the Obama administration. \nThe August 2012 strike “violated the laws of war and norms of customary international law” and “provide[s] a case study of the failures of the drone war,” the families claimed in a 41-page complaint filed with the U.S. District Court for the District of Columbia on Sunday. ADVERTISEMENT Salem bin Ali Jaber, 43, and 26-year-old Waleed bin Ali Jaber “were wrongfully killed by United States personnel who performed their lethal acts in the United States,” they added.\n“Having exhausted all alternatives, the estates of Salem and Waleed seek justice from this court, including a determination that the strike that killed Salem and Waleed was unlawful, and any other relief that the interests of justice require.” \nThe families are not seeking monetary damages for the deaths, but seem primarily interested in getting the administration to admit that the attack was wrong. \n“When U.S. officials choose not to correct mistakes — or as here even to acknowledge them — they are responsible not only for innocent deaths, but also for undermining rather than protecting U.S. national security,” the families said in the suit, which names President Obama as well as former Defense Secretary Leon Panetta and former CIA Director David Petraeus. \nSalem was an imam who preached against al Qaeda and other violent extremist groups. Waleed was his cousin and a local traffic police officer. \nDays after Salem gave a sermon criticizing al Qaeda, the two were allegedly killed in a “signature strike” that appeared to be targeting three unknown men with whom they were meeting in the rural town of Khashamir. All five men were killed in the strike. \n“Within hours of the strike, it became clear to the bereaved family that government officials knew they had made a mistake,” the families said in their suit. \nBoth Yemeni and Americans officials have offered “personal condolences” behind closed doors, they added, but would not do so in public. However, Yemeni officials have given the men’s families money adding up to $155,000. \nIn the suit, the families noted that Obama just recently discussed the recent accidental death of one American and one Italian citizen, who were killed in a Pakistani drone strike while being held by al Qaeda. \n“There is a simple question at the heart of this claim. The president has now admitted to killing innocent Americans and Italians with drones; why are the bereaved families of innocent Yemenis less entitled to the truth?” the families declared. \nThe lawsuit was first reported by the New York Times . Tags: Past: 1 day Obama: 'We don't yet have a... The president said Iraq must show a greater commitment to fighting ISIS. Republicans wield power of the... A bill to fund the Justice Department is the latest front in the battle... Boehner: We don't have votes yet... \"I don't think we're quite there yet,\" the Speaker said. GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-09T01:07:00.000+03:00", "crawled": "2015-06-09T15:43:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}