{"organizations": [], "uuid": "e4739455e4921a2ee08083e0cb6e045eadfd26b4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/beaubiden_053115getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/243565-obamas-visit-bidens-after-sons-death", "country": "US", "title": "Obamas visit Bidens after son's death", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obamas visit Bidens after son's death", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-31T21:16:00.000+03:00", "replies_count": 0, "uuid": "e4739455e4921a2ee08083e0cb6e045eadfd26b4"}, "author": "jhattem@thehill.com (Julian Hattem)", "url": "http://thehill.com/blogs/blog-briefing-room/news/243565-obamas-visit-bidens-after-sons-death", "ord_in_thread": 0, "title": "Obamas visit Bidens after son's death", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 31, 2015, 02:16 pm Obamas visit Bidens after son's death Getty Images \nPresident Obama and the first lady on Sunday traveled to the Naval Observatory to spend time with Vice President Biden and his family the day after the death of the vice president’s son. ADVERTISEMENT The visit comes after the news on Saturday night that Beau Biden — the former Democratic attorney general for Biden’s home state of Delaware — had died after a long battle with brain cancer. He left behind a wife and two daughters.\nThe Obamas made the trek up to the vice president’s traditional home in Northwest Washington in a motorcade of nearly all black cars early on Sunday afternoon. \nIn a statement on Saturday, Obama said that the former attorney general had “lived a life that was full; a life that mattered; a life that reflected their reverence for family.” \nThe death of the 46-year-old elicited condolences from all corners of Washington on Saturday and Sunday. Tags: Past: 1 day Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. House bill would require gun... Rep. Carolyn Maloney said the requirement would \"help save lives.\" Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-05-31T21:16:00.000+03:00", "crawled": "2015-06-01T05:53:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}