{"organizations": [], "uuid": "88d0bf4d7b2f495d3d017d164e5033af2b59cfb2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/impact/blog.xml", "section_title": "Impact Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/suzanne-b-goldberg/the-strong-constitutional_b_7626132.html", "country": "US", "title": "The Strong Constitutional Case for Abortion | Suzanne B. Goldberg", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 4, "title_full": "The Strong Constitutional Case for Abortion | Suzanne B. Goldberg", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-20T06:58:00.000+03:00", "replies_count": 4, "uuid": "6364ef29c88936cd866996c49dc4fc4b94450d75"}, "author": "Suzanne B. Goldberg", "url": "http://www.huffingtonpost.com/suzanne-b-goldberg/the-strong-constitutional_b_7626132.html#post-0", "ord_in_thread": 0, "title": "The Strong Constitutional Case for Abortion | Suzanne B. Goldberg", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As the U.S. Supreme Court considers taking up another case related to abortion rights, now is the time to reexamine the old-chestnut narrative that abortion rests solely on a tenuous right to privacy and take heed that the Court -- yes, this Court -- has a long track record of protecting not only privacy but also the liberty that is part of such deeply personal decision-making.\nOver the last several decades, a popular, but inaccurate, narrative has taken hold about the constitution and abortion. Many argue that the right to privacy, set out in Roe v. Wade in 1973, is the sole constitutional protection for a woman's right to end a pregnancy. But this analysis rests on a limited and restrictive understanding of the law.\nThe right to abortion is grounded in the Fourteenth Amendment, which protects all of us from undue government interference with our liberty interests. More than 20 years ago, the Supreme Court made this clear when it reaffirmed the constitutional right to abortion in Planned Parenthood v. Casey. There, the Court explained that this right was rooted in a woman's Fourteenth Amendment liberty right, which covers decisions about marriage, procreation, contraception, family relationships, child rearing and education.\nIn the words of the linchpin justices, Souter, O'Connor and Kennedy:\nThese matters, involving the most intimate and personal choices a person may make in a lifetime, choices central to personal dignity and autonomy, are central to the liberty protected by the Fourteenth Amendment.\nAt the heart of liberty is the right to define one's own concept of existence, of meaning, of the universe and of the mystery of human life. Beliefs about these matters could not define the attributes of personhood were they formed under compulsion of the State.\nThis right to make these deeply personal decisions free from state interference was safeguarded, too, in Lawrence v. Texas , a groundbreaking case for LGBT rights that put an end to criminal sodomy laws. As Justice Kennedy wrote in that case, quoting Casey, \"It is a promise of the Constitution that there is a realm of personal liberty which the government may not enter.\" When the Court struck down the federal Defense of Marriage Act in 2012, the Court relied on liberty once again to support gay couples' freedom to marry free from federal government discrimination.\nThe liberty-based protection for personal and family decision making also shines a spotlight on the deeply flawed abortion restrictions that state legislatures have been busy enacting of late. In the first quarter of 2015 alone, state legislatures introduced close to 800 bills restricting reproductive rights and health, nearly 42 percent of which aimed to limit women's access to abortion. There is only one abortion clinic left in the entire state of Mississippi (which will close if one of these new laws is allowed to take effect) while Texas faces an abortion access crisis because of a law that, if fully enforced, would leave fewer than 10 clinics for the entire state (from 41 prior to the law's passage).\nThese restrictions impose profound and undue burdens on women's liberty right, as politicians promoting these laws have themselves recognized. In signing one of these legislative packages, Mississippi Governor Phil Bryant said, \"Today you see the first step in a movement to... try to end abortion in Mississippi.\"\nYet these new laws are old news under longstanding Supreme Court jurisprudence protecting women's liberty to make decisions about their reproductive lives. And states cannot abandon their obligation to protect all constitutional rights, including this one.\nSuzanne B. Goldberg is Director of the Center for Gender and Sexuality Law at Columbia Law School and Executive Vice President for University Life at Columbia University.\nMore:", "external_links": ["http://www.washingtonpost.com/opinions/laws-courts-shrinking-access-to-abortion/2014/10/10/efd0aef4-4f25-11e4-aa5e-7153e466a02d_story.html", "http://www.npr.org/sections/health-shots/2015/06/10/413318079/in-texas-federal-court-backs-abortion-restriction-law", "http://www.guttmacher.org/media/inthenews/2015/04/02/"], "published": "2015-06-20T06:58:00.000+03:00", "crawled": "2015-06-21T00:50:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}