{"organizations": [], "uuid": "651ad3a8b8a74eee839a8173306d1c285be8bdc5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2640986/images/o-CONGRESS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/steph-sherer/patients-are-relying-on-c_b_7496502.html", "country": "US", "title": "Patients Are Relying on Congress to Reauthorize the Rohrabacher-Farr Medical Marijuana Amendment | Steph Sherer", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Patients Are Relying on Congress to Reauthorize the Rohrabacher-Farr Medical Marijuana Amendment | Steph Sherer", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-03T01:17:00.000+03:00", "replies_count": 0, "uuid": "651ad3a8b8a74eee839a8173306d1c285be8bdc5"}, "author": "Steph Sherer", "url": "http://www.huffingtonpost.com/steph-sherer/patients-are-relying-on-c_b_7496502.html", "ord_in_thread": 0, "title": "Patients Are Relying on Congress to Reauthorize the Rohrabacher-Farr Medical Marijuana Amendment | Steph Sherer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Today, the U.S. House of Representatives is expected to take part in a “ marijuana vote-a-rama ” of sorts, with several amendments to dealing with marijuana to be offered on the floor during the FY2016 Commerce, Justice, and Science Appropriations Bill. The amendments offered will cover topics from hemp and cannabidiol (CBD) to protection of state adult-use laws. Not to be lost in the shuffle is the vote to reauthorize the Rohrabacher-Farr Amendment, which stipulates that the Department of Justice is not to spend any funds inferring with lawful state medical marijuana conduct. Patients, such as 15-year old Crohn’s patient/Colorado refugee Coltyn Turner , need the protection that a reauthorized Rohrabacher-Farr Amendment would continue to offer. The amendment was originally passed the House in May 2014, 219-189, with a strong bipartisan showing of 49 Republicans joining 170 Democrats. Later in December, Senator Mikulski helped ensure the bill remained in the final CRomnibus bill that President Obama signed into law. While its passage marked the first time since Congress approved a medical marijuana reform since designating marijuana in Schedule I of the Controlled Substances Act, momentum for additional medical marijuana reforms grown substantially in the past 12 months with introduction of the CARERS Act in both chambers and the passage of the Veterans Equal Access Amendment offered by Senators Daines (R-MT) and Merkley (D-OR) in Senate Appropriations Committee last month. Once again the amendment showing strong bipartisan support out of the gate, with 6 Republican, and 6 Democrat cosponsors lending their name to this year’s version : Rohrabacher (R-CA), Farr (D-CA), Ribble (R-WI), Lee (D-CA), Massie (R-KY), Blumenauer (D-OR), Heck (R-NV), Cohen (D-TN), Young (R-AK) Polis (D-CO), McClintock (R-CA), Titus (D-NV). The number of states listed on the amendment has jumped from 32 to 39, with New York , North Carolina, Virginia , Georgia , Oklahoma , Texas , and Louisiana becoming the latest states to be added to the list. This now means that about 85% of the U.S. population now lives somewhere with some sort of medical marijuana patient protection. Patients like Coltyn cannot afford to wait for the federal government to play catch-up and be denied access to their medicine, and in fact, they won’t wait, as Coltyn has said “ “I’d rather be illegally alive than legally dead.” With an estimated 2.4 million medical marijuana patients as of October 2014 who are being “illegally healed” in the eyes of the Department of Justice who makes no internal distinction between medical and non-medical marijuana use, the protections afforded by the Rohrabacher-Farr Amendment are needed now more than ever. During the floor debate last year , many of the amendment cosponsors spoke in favor of the amendment, thereby establishing the legislative intent of the amendment. From their words as well as the words of the amendment’s opponents, it was clear that the intent of the amendment was to prevent the Dept. of Justice from interfering with with state legal medical marijuana conduct. As Rep. Farr put it: “ This is essentially saying, look, if you are following State law, you are a legal resident doing your business under State law, the Feds just can't come in and bust you and bust the doctors and bust the patient. It is more than half the States. So you don't have to have any opinion about the value of marijuana. This doesn't change any laws. This doesn't affect one law, just lists the States that have already legalized it only for medical purposes, only medical purposes, and says, Federal Government, in those States, in those places, you can't bust people. It seems to me a practical, reasonable amendment in this time and age.” In practical terms, it is still hard to measure the true effectiveness of the amendment, but there has been an appreciable decrease in the amount of federal interference with state-legal medical marijuana conduct. This is not to say that DOJ is being in full compliance or is even being transparent about how it has been complying with the spending restriction. While DEA raids of state-legal facilities are no longer the regular occurrence they once were, raids and their subsequent prosecutions are still continuing, even in the absence of proof that state laws were being violated, such as the Kettle Falls Five case in Washington State . While Reps. Rohrabacher and Farr have sought answers from DOJ on why this kind of interference is continuing to take place, the Department has largely sidestepped the issue, offering a terse quasi-explanation in the L.A. Times , but little else. But as Rep. Farr responded in a tweet , “@TheJusticeDept lawyers can try to parse words but Congress was clear: Stop wasting funds/resources prosecuting patients!” We couldn’t say it better ourselves, but it’s worth repeating, it is a waste of taxpayer funds to prosecute state-legal medical marijuana patients. To further reiterate Rep. Farr, passage of the amendment sends a strong signal to DOJ that interfering with lawful state medical marijuana conduct goes against the sense of Congress. This sense is shared by over 85% of Americans who believe that patients should have safe and legal access to medical marijuana programs under the recommendation of a physician. The health of patients like Coltyn depends on the federal government not interfering with state medical marijuana laws (his self-produced PSA underscores the reason why it’s important) . Supporting this medical marijuana amendment is not only compassionate, but also fiscally pragmatic and politically safe. This vote should be a no-brainer for conservatives and liberals alike who want to keep big government out of the doctor’s office. Take action and ask your U.S. Representative to VOTE AYE on the Rohrabacher-Farr Amendment.\nFollow Steph Sherer on Twitter: www.twitter.com/safeaccess\nMore: Rohrabacher Farr Medical Marijuana Amendment Americans for Safe Access Cjs CARERS Act Marijuana Marijuana Medical Marijuana Rohrabacher Farr Amendment Asa Safe Access Veterans Equal Access Amendment", "external_links": [], "published": "2015-06-03T01:17:00.000+03:00", "crawled": "2015-06-03T00:39:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}