{"organizations": [], "uuid": "46d0f253ddc326ccbed08f361db3772150b33aa7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarackiran_052915getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/246135-ex-obama-advisers-on-iran-worry-nuclear-deal-will-fall-short", "country": "US", "title": "Ex-Obama advisers fear Iran deal will 'fall short'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ex-Obama advisers fear Iran deal will 'fall short'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-25T18:56:00.000+03:00", "replies_count": 0, "uuid": "46d0f253ddc326ccbed08f361db3772150b33aa7"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/246135-ex-obama-advisers-on-iran-worry-nuclear-deal-will-fall-short", "ord_in_thread": 0, "title": "Ex-Obama advisers fear Iran deal will 'fall short'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ex-Obama advisers fear Iran deal will 'fall short' Getty Images By Kristina Wong - 06/25/15 11:56 AM EDT A group of President Obama's former top Iran advisers signed an open letter on Wednesday expressing concern that the administration's nuclear agreement is not strong enough. \"The Iran nuclear deal is not done. Negotiations continue. The target deadline is June 30. We know much about the emerging agreement. Most of us would have preferred a stronger agreement,\" said the letter , whose signatories include former CIA Director David Petraeus and former Sen. Joe Lieberman (I-Conn.). The letter adds, \"we fear that the current negotiations, unless concluded along the lines outlined in this paper and buttressed by a resolute regional strategy, may fall short of meeting the administration’s own standard of a 'good' agreement.\" \nThe letter comes just five days before U.S. and international negotiators are due to conclude a final deal with Iran to roll back its nuclear program in exchange for sanctions relief. ADVERTISEMENT It was signed by 18 experts, including five former top Obama administration officials who were critical advisers on Iran. Those senior advisers include former State Department official Robert Einhorn, former White House official Gary Samore, former State Department adviser Dennis Ross and retired Vice Chairman of the Joint Chiefs of Staff Gen. James Cartwright. Members of a bipartisan group of experts have been meeting regularly within the last three years, under the auspices of The Washington Institute for Near East Policy to discuss the Iran nuclear issue, the letter said. They said the statement reflects their broad consensus and that the group \"frequently benefitted from the input of current Administration officials.\" The letter also lays out provisions that would have to be included in the deal in order to win their support. International Atomic Energy Agency inspectors must have timely and effective access to any sites in Iran they need to visit in order to verify Iran's compliance with the agreement, including military and other sensitive facilities, they said. Inspectors must also be able to take samples, interview scientists and government officials, and review and copy documents needed for their investigation of Iran's past and any ongoing nuclear weaponization activities in a timely and effective manner. \"This work needs to be accomplished before any significant sanctions relief,\" they added in regards to what is known as \"possible military dimensions\" of the program. The agreement must also establish strict limits on advanced centrifuge research and development, testing, and deployment in the first 10 years, and preclude the \"rapid technical upgrade and expansion of Iran's enrichment capacity after the initial ten-year period.\" Sanctions relief must be based on Iran's performance of its obligations under the deal. Suspension or lifting of the most significant sanctions must not occur until the IAEA confirms that Iran has taken \"the key steps\" required under the agreement, they said. The agreement must also include a timely and effective mechanism to reimpose sanctions automatically if Iran violates the agreement, including by denying or delaying access to inspectors. The U.S. must affirm its policy to prevent Iran from producing enough nuclear material for a weapon, or acquiring or building one both during the agreement and after it expires, they said. The signatories also urged the administration not to treat June 30 as an \"inviolable\" deadline for the conclusion of the final agreement with Iran. House Foreign Affairs Committee Chairman Ed Royce (R-Calif.) said Secretary of State John Kerry should bring the letter with him for upcoming negotiations in Europe. “Even those who helped set the stage for these negotiations are troubled at their direction,” Royce said. “So concerned about the Administration’s diplomacy, these respected individuals went public.” “When your close associates are speaking out, you know you’re on the wrong track. Secretary Kerry needs to take this letter to the negotiating table — and not come back with a bad deal,” he said. Tags:", "external_links": [], "published": "2015-06-25T18:56:00.000+03:00", "crawled": "2015-06-27T13:19:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}