{"organizations": [], "uuid": "573c575db825f9b616f95574dd17158b772d5abe", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/0607%20obama%20merkel.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/07/obama-aims-to-mend-relations-with-germany-on-latest-trip/", "country": "US", "title": "Obama aims to mend relations with Germany on latest trip", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama aims to mend relations with Germany on latest trip", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-07T11:54:00.000+03:00", "replies_count": 0, "uuid": "573c575db825f9b616f95574dd17158b772d5abe"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/07/obama-aims-to-mend-relations-with-germany-on-latest-trip/", "ord_in_thread": 0, "title": "Obama aims to mend relations with Germany on latest trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama aims to mend relations with Germany on latest trip Published June 07, 2015 Facebook 0 Twitter 0 Email Print June 7, 2015: US President Barack Obama, joined by Horst Seehofer, Minister President of Bavaria, right, is greeted by traditionally dressed Bavarian men and women as he arrives on Air Force One at the airport in Munich, southern Germany. (AP) \nELMAU, Germany – President Barack Obama is aiming to show unity with Western allies on global challenges during an overnight trip to Germany, especially Chancellor Angela Merkel amid enduring anti-Americanism in her country over U.S. spying programs. \nObama and Merkel plan to open his visit Sunday with a public display of friendliness, delivering remarks about the U.S.-German alliance before they stroll through the picturesque alpine village of Kruen to sample the Bavarian food and sights. The two plan to meet privately afterward at the nearby site of the two-day summit of the Group of Seven leading industrial nations to coordinate their agenda before joining the leaders of Britain, France, Italy, Canada and Japan. \nAs the president stepped off Air Force One after an overnight flight from Washington, he was greeted by a group children and adults in traditional Bavarian outfits. He then boarded the presidential helicopter for a flight through the mountains to meet Merkel. \nThe G-7 meeting at the Schloss Elmau resort is expected to be dominated by discussions of the West's response to the clashes between Ukraine and pro-Russian forces. Russian President Vladimir Putin was ousted from the group last year over his aggressive moves on the former Soviet state. \nAlso high on the agenda are the global economy, terrorism and trade as Obama negotiates separate pacts across the Pacific and Atlantic. \nObama is closer to Merkel than most heads of state, although their relationship has been tested in the past couple of years, particularly after it emerged that the National Security Agency had tapped Merkel's cellphone. The revelation was particularly chilling in Germany, with its oppressive history of secret government surveillance. \nThe spying controversy has grown in recent weeks amid reports that Germany's Federal Intelligence Agency, better known by its German acronym BND, may have helped the U.S. spy on European companies and officials as long ago as 2008. Merkel's chief of staff oversees the agency, and her coalition partner Social Democrats — a center-left party currently struggling in opinion polls — have even used it to put her office under pressure. Still, there have been no signs yet that questions over NSA surveillance have damaged her party's popularity. \n\"While we tend to view a lot of the impact of the NSA revelations in Europe as subsided, they have not subsided in Germany,\" said Heather Conley, director of the Europe Program at the Center for Strategic and International Studies in Washington. \"This issue is being used in multiple ways to increase, I think, anti-Americanism in Germany and to weaken the chancellor.\" \nGermans also will be looking to future U.S. relations beyond Obama's presidency, with 2016 presidential hopeful Jeb Bush planning to kick off a six-day European trip with a speech in Berlin on Tuesday to the economic council of the Christian Democratic Union, the conservative party led by Merkel. \nIn their last meeting, in February at the White House, Obama called Merkel \"my close friend and partner.\" Merkel addressed him as \"dear Barack\" while acknowledging tensions over the spying programs they are still working to overcome. \"There are still different assessments on individual issues there, but if we look at the sheer dimension of the terrorist threat, we are more than aware of the fact that we need to work together very closely,\" Merkel said. \nObama said there \"was no doubt\" the spying revelations damaged impressions of the United States in Germany and that he's been trying to restore confidence. \"Occasionally I would like the German people to give us the benefit of the doubt, given our history, as opposed to assuming the worst,\" he said. \nJulianne Smith, a former Obama White House official who is a senior fellow at the Center for New American Security, said part of the disillusionment in Germany and Europe more broadly comes from their sky-high expectations of Obama when he came to office. Hundreds of thousands turned out in the streets to hear Obama speak during a visit to Berlin during his 2008 campaign. \n\"It's been an interesting ride, and I think, frankly, everybody needs this summit,\" she said. \"They need the photo ops, they need to show the unity. They need it for their publics at home. They need it to send signals to President Putin that they're united. And, frankly, they need it because they have to trade notes behind closed doors on what their next steps are on a lot of these global challenges.\" Advertisement", "external_links": [], "published": "2015-06-07T11:54:00.000+03:00", "crawled": "2015-06-07T12:06:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}