{"organizations": [], "uuid": "c1226d4322420779b83e1e94c706949908507e31", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaaddress0502.png", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/243519-obama-signs-anti-trafficking-law", "country": "US", "title": "Obama signs anti-trafficking bill into law", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama signs anti-trafficking bill into law", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-30T02:02:00.000+03:00", "replies_count": 0, "uuid": "c1226d4322420779b83e1e94c706949908507e31"}, "author": "jbyrnes@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/blog-briefing-room/news/243519-obama-signs-anti-trafficking-law", "ord_in_thread": 0, "title": "Obama signs anti-trafficking bill into law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 29, 2015, 07:02 pm Obama signs anti-trafficking bill into law By Jesse Byrnes \nPresident Obama on Friday signed anti-human trafficking legislation that emerged from Congress after being the subject of a bitter battle on Capitol Hill earlier this year. Obama signed the Justice for Victims of Trafficking Act of 2015, White House press secretary Josh Earnest announced in a statement late in the evening. ADVERTISEMENT The House easily passed the bill with a vote of 420-3 earlier this month. It was a far different story in the Senate, where the bill languished for weeks before getting approved 99-0 last month. The legislation aimed at curbing sex trafficking crimes stalled in the Senate after Democrats argued abortion language in the bill expanded a restriction on using federal funds for abortion. An eventual deal required funding for victims of trafficking to come from two sources — criminal fines levied on perpetrators and money previously appropriated by Congress Debate over the bill prolonged a vote to confirm Loretta Lynch, Obama's pick for attorney general. Senate Majority Leader Mitch McConnell (R-Ky.) said he wouldn't allow members to leapfrog over the bill to confirm Lynch. She was eventually sworn in April 27. Sen. John Cornyn (R-Texas) introduced the legislation in the Senate. Rep. Ted Poe (R-Texas) introduced its companion legislation in the House. “Survivors of child sex trafficking in the United States will finally receive the vital services and protections they deserve,” Yasmin Vafa, director of Law and Policy for nonprofit Human Rights Project for Girls, said in a statement. “For the first time, there is a federal law on the books that specifically addresses domestic human trafficking and prioritizes the need to confront the demand for child sex,\" she added. - Updated Saturday at 2:04 p.m. Tags:", "external_links": [], "published": "2015-05-30T02:02:00.000+03:00", "crawled": "2015-06-01T05:54:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}