{"organizations": [], "uuid": "d923d557ed318e7d979e448cb8451bd73415fd8a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3061506/images/o-HILLARY-CLINTON-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/ian-reifowitz/david-brooks-says-hillary_b_7561320.html", "country": "US", "title": "David Brooks Says Hillary Can Have 'Bipartisan Governing Coalition' If She Just Copies Obama Campaign | Ian Reifowitz", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "David Brooks Says Hillary Can Have 'Bipartisan Governing Coalition' If She Just Copies Obama Campaign | Ian Reifowitz", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-11T18:44:00.000+03:00", "replies_count": 0, "uuid": "d923d557ed318e7d979e448cb8451bd73415fd8a"}, "author": "Ian Reifowitz", "url": "http://www.huffingtonpost.com/ian-reifowitz/david-brooks-says-hillary_b_7561320.html", "ord_in_thread": 0, "title": "David Brooks Says Hillary Can Have 'Bipartisan Governing Coalition' If She Just Copies Obama Campaign | Ian Reifowitz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "David Brooks isn't always wrong about politics. Sometimes he doesn't even write about politics. But on Tuesday, he published a NYT column so wrong that I cannot even come up with an appropriate metaphor to capture its, well, wrongness. Mr. Brooks began by arguing that every presidential candidate has to decide whether to focus on \"expanding my party's reach,\" or \"mobilizing my party's base.\" Among Republicans, he characterized Jeb Bush as doing the former, and Scott Walker the latter. Okay, nothing too problematic so far.\nBrooks then asserted that Hillary Clinton is pursuing a base mobilization strategy, going as far as to call her \"the Democratic Scott Walker,\" and urged her to rethink this \"mistake.\" He argued that a base mobilization strategy is bad for the country because of our \"broken politics,\" our excessive polarization, an excess of party orthodoxy, and what about bipartisanship and compromise and dancing rabbits and lollipops. You know the drill. Fine, he likes bipartisanship. Brooks is not an ideologically extreme conservative, and I'm glad to see a diversity of opinion out there, especially among Republicans.\nWhere Brooks inspired the face palm is in the next section, where he explained why a base mobilization strategy would hamper even a victorious candidate's ability to pass major legislation:\nIf the next president hopes to pass any actual laws, he or she will have to create a bipartisan governing majority. That means building a center-out coalition, winning 60 reliable supporters in the Senate and some sort of majority in the House.\nIf Clinton runs on an orthodox left-leaning, paint-by-numbers strategy, she'll never be able to do this.\nLet me put this as politely as I can. David Brooks has taken leave of his senses. There are no Republicans anywhere in this country who could be elected to the U.S. Senate, let alone the House of Representatives, who would ever, ever be part of any kind of bipartisan governing majority led by a Democratic president. Jon Stewart is more likely to be hired to take over Fox News than a single Republican senator or representative is likely to join, on a consistent basis, a bipartisan majority led by a Democratic president -- no matter how moderate he or she is.\nBrooks called on Hillary to heed his advice and go after swing voters rather than her party's base. He cited the three most recent successful presidential candidates as all having done so: \"In 1992, Bill Clinton firmly grabbed the center. In 2000, George Bush ran as a uniter, not a divider. In 2008, Barack Obama ran as a One Nation candidate who vowed to transcend partisan divides.\"\nNow, remember the part where Brooks talked about building a bipartisan governing majority? How'd that work out for the center-grabbing Bill Clinton? (I'm just paraphrasing Brooks here, guys.) How many Republican votes in the House or Senate did he get for his 1993 budget package, a modest, fiscally responsible bill that really did cut government spending along with enacting reasonable tax hikes on the wealthy? Answer: None . And how many congressional Republicans did he get on board with his push for healthcare reform, even after seeking their support? Answer: None .\nWhat about that partisan-transcending Barack Obama? He got all of three Republican senators (one of whom, Arlen Specter, subsequently became a Democrat) and no House Republicans to vote for his stimulus bill, a package that included one-third tax breaks and was designed as a compromise to attract bipartisan support. And how many Republicans voted for Obamacare? A big, fat none .\nIn fact, both of those non-base seeking Democrats ended up inspriring Republicans to respond by moving even further to the right, to the point where the right-wing extremists of 1994 had become moderate RINOs by 2010 tea party standards. But yeah, Mr. Brooks, go on about Democrats being able to build bipartisan governing majorities if only they are moderate enough.\nAccording to Brooks, Hillary shouldn't run a campaign built around mobilizing the base because voters \"like politicians who lead from a place of conviction, who care more about a cause than winning a demographic.\" Never mind that mobilizing the base means exactly leading from a place of conviction, because a Democrat mobilizes the base by advocating strongly progressive policies with which the base agrees. Chasing swing voters means running a non-ideological, convictionless campaign designed exactly to win a demographic.\nThe last two Democrats -- whom Brooks had either the gall or the ignorance to cite as examples of candidates who won by running the kind of campaign he endorses -- got virtually no Republican support for any legislation he actually proposed, no matter how moderate or centrist it was. Brooks also mentioned George W. Bush, and he did get some bipartisan support for his major initiatives, but that's because he was a Republican looking for Democratic votes, not the other way around.\nDavid Brooks should know better, and maybe, deep down, he does. But at least in print he must cling to the myth that both sides share responsibility for the toxic level of polarization in our politics. That's simply false. As Thomas Mann and Norman Ornstein documented , the blame lies with the Republicans, who have :\nBecome an insurgent outlier -- ideologically extreme; contemptuous of the inherited social and economic policy regime; scornful of compromise; unpersuaded by conventional understanding of facts, evidence, and science; and dismissive of the legitimacy of its political opposition.\nThere is nothing Hillary Clinton or any Democratic president can do that would enable him or her to rely on regular support from a collection of Republicans in Congress, the kind of support that one could characterize as forming part of a true bipartisan governing majority. Other than propose Republican policies, I guess. Oh, wait a minute, that didn't work for Obama either. Here's my advice to Hillary, or any Democratic candidate. Don't listen to David Brooks.\nFollow Ian Reifowitz on Twitter: www.twitter.com/ianreifowitz\nMore: David Brooks Hillary Clinton Barack Obama Bill Clinton George W Bush Obamacare Health Care Reform 1993 Budget White House 2016 White House 2008 Base Mobilization This Blogger's Books and Other Items from... Obama's America: A Transformative Vision of Our National Identity\nby Ian Reifowitz", "external_links": ["http://www.indiebound.org/?aff=HuffingtonPost", "http://ecx.images-amazon.com/images/I/51MPDTw3tIL._SL160_.jpg", "http://en.wikipedia.org/wiki/Omnibus_Budget_Reconciliation_Act_of_1993", "http://www.nytimes.com/2015/06/09/opinion/david-brooks-the-mobilization-error.html?ref=opinion", "http://www.nationalmemo.com/5-policies-republicans-loved-obama/", "http://www.dailykos.com/story/2013/07/29/1227102/-Political-Books-it-s-not-quite-treason-but-It-s-Worse-Than-it-Looks-by-Mann-and-Ornstein", "http://en.wikipedia.org/wiki/Clinton_health_care_plan_of_1993#Criticism", "http://www.washingtonpost.com/wp-dyn/content/article/2010/03/21/AR2010032100943.html", "http://www.csmonitor.com/USA/Politics/2009/0214/obama-wins-his-economic-stimulus-package-but-without-the-bipartisanship-he-sought", "http://www.amazon.com/exec/obidos/ASIN/1612344720", "http://www.denverpost.com/politics/ci_25594292/clinton-sought-gop-support-health-care", "http://www.amazon.com/", "http://www.twitter.com/ianreifowitz"], "published": "2015-06-11T18:44:00.000+03:00", "crawled": "2015-06-11T18:14:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}