{"organizations": [], "uuid": "a34567709371e1fde4ae0218e6375c7a6fc75df0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3057500/images/o-MARIJUANA-STOCK-PHOTOS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/media/blog.xml", "section_title": "Media Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/sharda-sekaran/marijuana-b-roll_b_7554530.html", "country": "US", "title": "Dear Media: Please Use This Realistic Marijuana B-Roll for Your News Stories | Sharda Sekaran", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Dear Media: Please Use This Realistic Marijuana B-Roll for Your News Stories | Sharda Sekaran", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-10T21:34:00.000+03:00", "replies_count": 0, "uuid": "a34567709371e1fde4ae0218e6375c7a6fc75df0"}, "author": "Sharda Sekaran", "url": "http://www.huffingtonpost.com/sharda-sekaran/marijuana-b-roll_b_7554530.html", "ord_in_thread": 0, "title": "Dear Media: Please Use This Realistic Marijuana B-Roll for Your News Stories | Sharda Sekaran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A couple of years ago I was watching my boss get interviewed on television about the cost of marijuana prohibition, growing public opinion in favor of legalization, and legislative efforts for marijuana policy reform. It was a fairly wonky conversation peppered with serious facts about the billions of dollars wasted on fighting the war on marijuana and the hundreds of thousands of people arrested each year.\nBut there was an irritating distraction. Whenever the program cut to video footage, it was all a bunch of young guys at maybe a 420 festival wearing stereotypical stoner uniforms (pot leaves, tie-dye, etc.) smoking comically enormous joints.\nWe've all seen it before, an otherwise normal news story about marijuana policy that cuts away to footage of cannabis caricatures. It's goofy, awkward, condescending and doesn't reflect the average marijuana consumer, who more than likely looks like a normal person you might see at a bank, supermarket or office.\nAnother television news program about marijuana had similar cheesy footage, and it was so bad that one of the commentators even asked \"Where do we get this stuff?\" His colleague admitted her team shot the footage at a marijuana event. She sort of shrugged, as if to say \"Hey. It's hard to get shots of people openly smoking weed.\"\nI get that. It must be a challenge. Marijuana consumption is still illegal in many places and there's enough of a social stigma and risk of arrest to deter many people from allowing themselves to be filmed while consuming. But with nearly half of Americans admitting to having used marijuana, not everyone must look like Jeff Spicoli or The Dude .\nSo, in an effort to combat the predominant, stereotypic images of people who use marijuana, and to encourage news outlets to use images that accurately reflect modern-day marijuana consumers, the Drug Policy Alliance (DPA) is releasing free, open-license B-roll footage for editorial use.\nThe B-roll was shot in Portland, Oregon, and features a diverse group in their 30s, 40s, 50s and 60s, doing a variety of activities, such as playing a board game, socializing at home, or purchasing marijuana at a licensed dispensary. The footage shows people consuming marijuana from joints, bubblers, vaporizers, pens and tinctures.\nI know people are not typically used to seeing older, regular looking people or a lady who might be a grandmother using marijuana. There might be some giggles but with someone -- most likely poor or a person of color -- getting arrested every 45 seconds in this country for marijuana possession, ending marijuana prohibition is no laughing matter.\nDPA also recently released stock photos , featuring recreational marijuana users and medical marijuana patients, that have since been used by news outlets worldwide. DPA's new B-roll footage and these stock photos can be used by the media for stories about marijuana legalization, the human and economic costs of marijuana prohibition, patients who use marijuana to relieve debilitating pain, or the emerging legal marijuana market, for example.\nWe're hoping media will use this free video footage and stock photos, or at the very least think twice about running stereotypical stoner images for their marijuana stories.\nSharda Sekaran is the managing director of communications for the Drug Policy Alliance ( www.drugpolicy.org )\nThis piece first appeared on the Drug Policy Alliance Blog: http://www.drugpolicy.org/ blog/dear-media-please-use- realistic-marijuana-b-roll- your-news-stories\nFollow Sharda Sekaran on Twitter: www.twitter.com/ssekaran\nMore: Marijuana B Roll Marijuana Stock Photos Drug War Drug Policy Drugs in the Media", "external_links": ["https://www.youtube.com/embed/p38lPTT0hjc", "http://www.imdb.com/character/ch0012340/", "http://www.imdb.com/character/ch0003518/", "http://www.drugpolicy.org/blog/dear-media-please-use-realistic-marijuana-b-roll-your-news-stories", "http://www.twitter.com/ssekaran", "http://www.pewresearch.org/fact-tank/2015/04/14/6-facts-about-marijuana/", "http://www.drugpolicy.org/", "http://www.drugpolicy.org/photo-library", "http://www.drugpolicy.org/marijuana-b-roll"], "published": "2015-06-10T21:34:00.000+03:00", "crawled": "2015-06-10T22:25:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}