{"organizations": [], "uuid": "e949f25c9ce1ecd92271c7b2d657519b67170207", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/turnermike_010615gn.jpg", "site_section": "http://thehill.com/taxonomy/term/1752/feed", "section_title": "House", "url": "http://thehill.com/policy/defense/245694-gop-lawmaker-obama-needs-to-accept-yes-on-defense-policy-bill", "country": "US", "title": "GOP lawmaker: Obama ‘needs to accept yes’ on defense bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP lawmaker: Obama ‘needs to accept yes’ on defense bill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-22T17:42:00.000+03:00", "replies_count": 0, "uuid": "e949f25c9ce1ecd92271c7b2d657519b67170207"}, "author": "mmatishak@thehill.com (Martin Matishak)", "url": "http://thehill.com/policy/defense/245694-gop-lawmaker-obama-needs-to-accept-yes-on-defense-policy-bill", "ord_in_thread": 0, "title": "GOP lawmaker: Obama ‘needs to accept yes’ on defense bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP lawmaker: Obama ‘needs to accept yes’ on defense bill Greg Nash By Martin Matishak - 06/22/15 10:42 AM EDT \nA senior member of the House Armed Services says President Obama shouldn’t threaten to veto the annual defense policy bill, since the measure meets his $612 billion request for the Defense Department. \n“Well, the president needs to accept yes,” Rep. Mike Turner (R-Ohio), chairman of the House Armed Services Tactical Air and Land Forces, said Monday during an interview with Bloomberg Television . \n“He should accept, yes. He has however, threatened to veto the bill because he believes that the EPA and the IRS are not being funded sufficiently,” he added. ADVERTISEMENT Last week the Senate passed its version of the 2016 National Defense Authorization Act (NDAA), around a month after the House approved its draft.\nThe measures, which must now be merged together in conference, authorize spending limits and set policy requirements for all Pentagon programs and initiatives. \nBoth bills have earned a veto threat from the White House because they include a roughly $38 billion boost to the Pentagon’s war fund, allowing the department to skirt budget caps put in place by the 2011 Budget Control Act. \nThe president and other top Democrats have insisted that if Congress is going to bust the budget ceiling for defense spending, lawmakers should do so for non-defense spending as well. \n“At this point, this is really an issue of looking at the president's request and how we might be able to meet the needs of our war fighters,” according to Turner. “We have a budget that in the aggregate fully funds the Department of Defense at the level the president has requested.” \nHe said the dollar amount “makes certain that we can rise to the challenges that we're seeing in [the Islamic State in Iraq and Syria] and also looking to how we can strengthen our presence in Europe.” \n“This is a budget that the president should support and certainly, I think both the Senate and the House are approaching an agreement,” Turner added. \nSenate Armed Services Committee chairman John McCain (R-Ariz.) and his House counterpart, Rep. Mac Thornberry (R-Texas), are optimistic that a joint bill could be hammered out and voted on by both chambers before lawmakers adjourn before the August recess.", "external_links": [], "published": "2015-06-22T17:42:00.000+03:00", "crawled": "2015-06-22T22:18:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}