{"organizations": [], "uuid": "ed4f0301ee7bec77c20aa8288422c1da1ff201ca", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaaddress0620.png", "site_section": "http://thehill.com/taxonomy/term/16/feed", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/245629-obama-write-trade-rules-before-china-does", "country": "US", "title": "Obama: Write trade rules 'before China does'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Write trade rules 'before China does'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-20T13:00:00.000+03:00", "replies_count": 0, "uuid": "ed4f0301ee7bec77c20aa8288422c1da1ff201ca"}, "author": "esmilowitz@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/news/245629-obama-write-trade-rules-before-china-does", "ord_in_thread": 0, "title": "Obama: Write trade rules 'before China does'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Past: 1 day House approves fast-track 218-208... The House took a first step toward resuscitating the White House’s trade... Trump to Stephanopoulos: 'You... “You shouldn’t be talking to me about that, in all fairness,” Trump said. New $10 bill to feature a woman Obama administration officials are seeking advice nationwide on who to... Gun owners not likely to use... A new study attempts to debunk the claim that gun owners rely on... Lindsey Graham's niece went to... \"He was quiet, strange, very unsocial,\" Graham's niece said of Dylann Roof. FBI identifies Dylann Roof, 21, as... FBI spokeswoman tells Charleston paper the suspect is from Columbia, S.C... Obama: Shooting should be wake-up... “This type of mass violence doesn’t happen in other countries,” he said. Court rules Bush officials can be... The split decision comes after more than a decade of litigation. Hillary Clinton crafts defense on... Hillary Clinton has started to formulate a strategy on one of the... Issa escorted out of Benghazi... Rep. Trey Gowdy escorted the California Republican from the closed-door... Charleston shooting suspect... Dylann Storm Roof, 21, was apprehended on Thursday morning in Shelby, N.C. New ObamaCare plan emerges in House The plan would give states the option of keeping ObamaCare subsidies. Charleston shooting suspect told... “I have to do it,” the shooter said, according to a witness account. Justice Thomas sides with liberals... The court sided with Texas after the state rejected a Confederate vanity... Nine dead in mass shooting at... \"This is an unfathomable and unspeakable act,\" Charleston's mayor said. Supreme Court sides with church in... The justices ruled 9-0 that an Arizona town's sign code violated the First... GOP lawmakers: We’re fine with... Republicans on Capitol Hill argue Trump will be a welcome addition to the... Trump paid actors to cheer his... The new contender reportedly paid extras $50 to participate in his... Carson: 'Racial based hate is... Charleston shootings are a reminder that hate is \"very much alive,\" says... Meet the ex-spy behind the... Tyler Drumheller may be called in to testify before the Benghazi panel. Issa on outside looking in on... Issa made headlines for being escorted out of a closed-door briefing. Clinton: Americans must face 'hard... Hillary called for prayer and action in response to the “horrific massacre... OPM tells lawmakers their... Members of Congress have started receiving notice from the Office of...", "external_links": [], "published": "2015-06-20T13:00:00.000+03:00", "crawled": "2015-06-20T17:21:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}