{"organizations": [], "uuid": "2fd3c182f618f2cda1ac62a8d4ac40db52f54c0c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/levinsander_050715getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/244702-white-house-tries-to-save-obama-trade-package", "country": "US", "title": "White House tries to save Obama trade package", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "White House tries to save Obama trade package", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-11T21:10:00.000+03:00", "replies_count": 0, "uuid": "2fd3c182f618f2cda1ac62a8d4ac40db52f54c0c"}, "author": "iswanson@thehill.com (Jordan Fabian and Peter Schroeder)", "url": "http://thehill.com/policy/finance/244702-white-house-tries-to-save-obama-trade-package", "ord_in_thread": 0, "title": "White House tries to save Obama trade package", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "White House tries to save Obama trade package Michael Bonfigli/The Christian Science Monitor By Jordan Fabian and Peter Schroeder - 06/11/15 02:10 PM EDT \nThe White House is trying to save President Obama’s trade agenda on Capitol Hill by aggressively lobbying House Democrats to back a program helping workers who lose their jobs because of trade. \nDemocrats usually are more supportive of Trade Adjustment Assistance, but they see an opportunity to kill fast-track trade legislation by voting against TAA. ADVERTISEMENT The reason has to do with the process through which the trade bills will be considered in the House.\nBoth the TAA and fast-track bills will have separate votes, but a defeat for either measure would cause the combined package to collapse. \nBecause many Republicans are expected to back fast-track but oppose TAA, Democrats opposed to fast-track might have their best chance of killing it by voting against the TAA bill. \nWhite House spokesman Josh Earnest warned Democratic lawmakers against the strategy as White House chief of staff Denis McDonough and Labor Secretary Tom Perez visited Capitol Hill. He noted that TAA will expire at the end of the year if it is not reauthorized. \n“You are adding your name to the death certificate of Trade Adjustment Assistance” if you oppose the legislation this week, Earnest told reporters Thursday. \nTreasury Secretary Jack Lew, who also met with Democrats during their caucus meeting Thursday, made a similar point. \n“We need to treat this moment for what it is: a life or death moment for TAA,\" he said, according to an aide familiar with the closed-door discussions. \nMcDonough argued the GOP Congress “will not give us another chance to reauthorize TAA if we don’t do it tomorrow,” the source said. \nKey Democrats who have backed TAA in the past have said they will vote against it on Friday. \nA spokesman for Rep. Sandy Levin (D-Mich.), the leader of House Democrats on trade, told The Washington Post’s Plum Line that he will vote against TAA. Levin confirmed his position to The Hill. \nRep. Louise Slaughter (D-N.Y.), a vocal opponent of fast-track, also said she would vote no on TAA. \nPro-fast-track Democrats criticized the maneuvering. \nRep. Jim Himes (D-Conn.) said the strategy of killing fast-track by voting against TAA “a terribly cynical gamble.” Another pro-trade Democrat, Rep. Ron Kind (Wis.), argued the level of anti-TAA sentiment was being overstated. \nDuring the Democratic caucus meeting, Rep. Luis Gutiérrez (D-Ill.) said he would vote for TAA but against fast-track, the aide familiar with the internal discussions said. \nFast-track would make it easier for Obama to send trade deals to Congress by preventing them from being amended. \nMcDonough, Perez, and other top officials attended a meeting with House Democrats on Thursday to make their pitch for backing the trade package. AFL-CIO President Richard Trumka, a staunch free-trade opponent, also made his case during the closed-door meeting. \nOne objection raised by Democratic Leader Nancy Pelosi (Calif.) is that the TAA program does not cover public sector union members. \nEarnest noted the last TAA measure passed in 2011 did not include specific protections for public sector workers, yet passed with unanimous Democratic support. \nPerez penned a letter to lawmakers imploring them to back the TAA measure. \n“While I appreciate there are differing views on trade promotion authority, the TAA program has always received strong support because it provides a critical lifeline to workers who need assistance and training to transition to new careers,\" Perez wrote. \n“This legislation provides the best — and possibly the only — plausible path to achieving a robust extension of TAA.” \nUpdated at 2:38 p.m.", "external_links": [], "published": "2015-06-11T21:10:00.000+03:00", "crawled": "2015-06-12T08:49:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}