{"organizations": [], "uuid": "7eb439d5ab38eb2d45499bd6807e015830f7277e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/pfieffer.jpg", "site_section": "http://thehill.com/taxonomy/term/48/feed#", "section_title": "The Hill: In The Know", "url": "http://thehill.com/blogs/in-the-know/243603-longtime-obama-aide-joins-cnn", "country": "US", "title": "Longtime Obama aide joins CNN", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Longtime Obama aide joins CNN", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-01T18:13:00.000+03:00", "replies_count": 0, "uuid": "7eb439d5ab38eb2d45499bd6807e015830f7277e"}, "author": "tlejeune@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/in-the-know/243603-longtime-obama-aide-joins-cnn", "ord_in_thread": 0, "title": "Longtime Obama aide joins CNN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 01, 2015, 11:13 am Longtime Obama aide joins CNN By Jesse Byrnes \nDan Pfeiffer, longtime aid to President Obama, has joined CNN as a political contributor, the network announced Monday. \nExcited to join @CNN as a political contributor. For my first act, I wrote an op ed on why a primary is good for Dems http://t.co/4vAe7QadPL — Dan Pfeiffer (@danpfeiffer) June 1, 2015 \nADVERTISEMENT Pfeiffer, 39, most recently served as the White House's senior adviser for strategy and communications until leaving in March.\nBefore that, he worked for Obama before his first presidential campaign, starting in 2007, and later served as communications director during the president's first term and senior adviser during his second. \nPfeiffer has played a major role in pushing for Obama to engage with newer forms of media, including appearances on YouTube, BuzzFeed and Vice. \nHe joins Jay Carney, who served as White House press secretary for Obama, at CNN. Carney joined the network last fall as a political commentator. \nOther former top Obama aides who have taken to the airwaves as political analysts include Robert Gibbs and David Axelrod. Past: 1 day Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-01T18:13:00.000+03:00", "crawled": "2015-06-01T22:20:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}