{"organizations": [], "uuid": "8236167288bf2112ddece6ab9cb3ee4f6ab22699", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/246039-obama-nominates-two-officials-to-epa-posts", "country": "US", "title": "Obama nominates two officials to EPA posts", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama nominates two officials to EPA posts", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-24T23:52:00.000+03:00", "replies_count": 0, "uuid": "8236167288bf2112ddece6ab9cb3ee4f6ab22699"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/246039-obama-nominates-two-officials-to-epa-posts", "ord_in_thread": 0, "title": "Obama nominates two officials to EPA posts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama nominates two officials to EPA posts By Devin Henry - 06/24/15 04:52 PM EDT \nPresident Obama has nominated two Environmental Protection Agency (EPA) officials to be full-time heads of the offices they currently lead. \nObama formally nominated Ken Kopocis and Janet McCabe to be assistant administrators of the EPA on Wednesday, asking the Senate to confirm regulators who have overseen offices that have formulated and implemented major and controversial agency rules. ADVERTISEMENT Kopocis has served as deputy assistant administrator for the agency’s Office of Water since last summer. In May, the EPA finalized its “waters of the U.S.” rule, which expands the definition of waterways that the federal government can regulate. Obama had nominated Kopocis to head the office in 2011 but he never received a vote in the Senate. \nMcCabe has led the Office of Air and Radiation on an interim basis as the agency finalizes a rule setting strict new limits on surface-level ozone concentration. She has been the Obama administration’s point person on both the ozone rule and the federal ethanol fuel mandate. \nObama had previously nominated McCabe to the post full-time, but like with Kopocis, the Senate never voted on her. \nCongressional Republicans have looked to block both the water rule and the ozone regulations, which will be finalized by this fall, and given their connections to the contentious EPA rules, Kopocis's and McCabe's nominations are likely to run into opposition in the Senate. \nSen. Dan Sullivan (R-Alaska), for one, has threatened to hold up three lower-profile nominations last month over his opposition to EPA rule-making, including the water rule, and the agency’s legal justification for its regulations. Tags:", "external_links": [], "published": "2015-06-24T23:52:00.000+03:00", "crawled": "2015-06-25T03:15:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}