{"organizations": [], "uuid": "14a7fab37817a78ffb7a6f6020beca54bca16194", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/Marijuana%20Workplace_Cham640360.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/16/colorado-court-rules-workers-can-be-fired-for-using-marijuana-off-duty/", "country": "US", "title": "Colorado court rules workers can be fired for using marijuana off duty", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Colorado court rules workers can be fired for using marijuana off duty", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-16T08:39:00.000+03:00", "replies_count": 0, "uuid": "14a7fab37817a78ffb7a6f6020beca54bca16194"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/16/colorado-court-rules-workers-can-be-fired-for-using-marijuana-off-duty/", "ord_in_thread": 0, "title": "Colorado court rules workers can be fired for using marijuana off duty", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Colorado court rules workers can be fired for using marijuana off duty Published June 16, 2015 June 15, 2015: Brandon Coats prepares to take questions from members of the media after the Colorado Supreme Court ruled against him, at his attorney's offices in Centennial, Colo. (AP Photo/Brennan Linsley) \nDENVER – Pot may be legal in Colorado, but you can still be fired for using it. \nThe state Supreme Court ruled 6-0 Monday that a medical marijuana patient who was fired after failing a drug test cannot get his job back. The case was being watched closely by employers and pot smokers in states that have legalized medical or recreational marijuana. \nColorado became at least the fourth state in which courts have ruled against medical marijuana patients fired for pot use. Supreme courts in California, Montana and Washington state have made similar rulings, and federal courts in Colorado and Michigan also have rejected such claims. \nThe Colorado worker, Brandon Coats, is a quadriplegic who was fired by Dish Network after failing a 2010 drug test. The company agreed that Coats wasn't high on the job but said it has a zero-tolerance drug policy. \nCoats argued that his pot smoking was allowed under a state law intended to protect employees from being fired for legal activities off the clock. Coats didn't use marijuana at work, but pot's intoxicating chemical, THC, can stay in the system for weeks. \nThe Colorado justices ruled that because marijuana is illegal under federal law, Coats' use of the drug couldn't be considered legal off-duty activity. \n\"There is no exception for marijuana use for medicinal purposes, or for marijuana use conducted in accordance with state law,\" the court wrote. \nCoats and his lawyers said the decision at least clarified the matter for workers. \n\"Although I'm very disappointed today, I hope that my case has brought the issue of use of medical marijuana and employment to light,\" Coats said in a statement. \nDish Network and other business groups applauded the ruling. \n\"As a national employer, Dish remains committed to a drug-free workplace and compliance with federal law,\" company spokesman John Hall said in a statement. \nTwenty-three states and Washington, D.C., allow people to use medical marijuana. Alaska, Colorado, Oregon, Washington state and Washington, D.C., have legalized recreational marijuana. \nThe Colorado Constitution specifically states that employers don't have to amend their policies to accommodate employees' marijuana use. \nCoats was paralyzed in a car crash as a teenager and has been a medical marijuana patient since 2009, when he discovered that pot helped calm violent muscle spasms. He was a telephone operator with Dish for three years before he failed a random drug test in 2010 and was fired. He said he told his supervisors in advance that he probably would fail the test. Advertisement", "external_links": [], "published": "2015-06-16T08:39:00.000+03:00", "crawled": "2015-06-16T08:49:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}