{"organizations": [], "uuid": "deb289ba8f13906452af3dc54f31ac4915ed0acc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/mccain2.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/243767-mccain-to-white-house-holding-defense-bill-hostage-would-be-a-deliberate-and", "country": "US", "title": "McCain to Obama: Holding defense bill hostage would be a 'deliberate and cynical failure'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McCain to Obama: Holding defense bill hostage would be a 'deliberate and cynical failure'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T20:54:00.000+03:00", "replies_count": 0, "uuid": "deb289ba8f13906452af3dc54f31ac4915ed0acc"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/243767-mccain-to-white-house-holding-defense-bill-hostage-would-be-a-deliberate-and", "ord_in_thread": 0, "title": "McCain to Obama: Holding defense bill hostage would be a 'deliberate and cynical failure'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McCain to Obama: Holding defense bill hostage would be a 'deliberate and cynical failure' CSPAN By Kristina Wong - 06/02/15 01:54 PM EDT Senate Armed Services Committee Chairman John McCain (R-Ariz.) on Tuesday blasted the White House for threatening to veto an annual defense bill that authorizes Pentagon spending. \"The [National Defense Authorization Act] is a policy bill. It does not spend a dollar. It provides the Department of Defense and our men and women in uniform with the authorities and support they need to defend the nation. It is not the place for fights over government spending,\" he said Tuesday at the American Action Forum. ADVERTISEMENT The defense act authorizes — but does not appropriate — $612 billion for the Pentagon in 2016, meeting the president's overall defense spending request. However, the president has threatened to veto it since it adheres to budget caps known as sequestration. The Armed Services Committee's bill would authorize $523 billion in base defense spending, but skirt the caps by boosting war funding to $89 billion. The president has requested that Congress lift those caps and spend $551 billion for base defense spending and $51 billion in war funding. \"Holding the [National Defense Authorization Act] hostage to force that solution would be a deliberate and cynical failure to meet our constitutional duty to provide for the common defense,\" McCain said. The Arizona Republica, who has previously called boosting war funding as a means to boost overall defense spending a \"gimmick,\" criticized the president for his \"intransigence.\" \"As a recent White House policy statement said, ‘the President has been very clear, he will not fix defense without fixing non-defense spending,'\" McCain said. \"Such intransigence reveals a troubling misalignment of priorities on the part of the White House. It is the first duty of the federal government to protect the nation.\" McCain conceded using the war funding account, known as \"Overseas Contingency Operations,\" to meet the president's request \"is not my preference.\" \"And it remains my highest priority as to solve sequestration and the Budget Control Act once and for all,\" he said. \"But in the absence of such an agreement, I refuse to ask the brave young Americans in our military to defend this nation with insufficient resources that would place their lives in unnecessary danger,\" he said. The bill could be considered by the Senate as early as this week, and could be conferenced with the House's version, which was passed last month, as early as this summer. The bill has passed for 53 consecutive years, and has typically garnered strong bipartisan support. The Senate's bill passed the Armed Services Committee 22 to 4, with four Democrats, including Ranking Member Jack Reed (D-R.I.), voting against it. The White House objects to a number of the bill's other provisions, such as extending current and restoring tougher restrictions on transferring Guantanamo Bay detainees. The Senate bill, however, does allow for the lifting of restrictions on transferring those detainees to the U.S. if the White House can present a plan that is approved by Congress. \"For 53 consecutive years, the Congress has passed an NDAA. This year should be no different,\" McCain said. Tags:", "external_links": [], "published": "2015-06-02T20:54:00.000+03:00", "crawled": "2015-06-03T06:12:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}