{"organizations": [], "uuid": "a03c3d1883f07127d18285cfc828dc2c1560c907", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaramadan_062315getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/245798-obama-laments-distorted-impression-of-muslims", "country": "", "title": "Obama laments 'distorted impression' of Muslims | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama laments 'distorted impression' of Muslims | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-23T16:31:00.000+03:00", "replies_count": 0, "uuid": "a03c3d1883f07127d18285cfc828dc2c1560c907"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/245798-obama-laments-distorted-impression-of-muslims", "ord_in_thread": 0, "title": "Obama laments 'distorted impression' of Muslims | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 23, 2015, 07:29 am Obama laments 'distorted impression' of Muslims Getty Images \nPresident Obama stressed religious tolerance during an Iftar dinner to celebrate the Muslim holiday of Ramadan, linking the murders of nine black Christians in South Carolina with the killings of three Muslims in North Carolina earlier this year. ADVERTISEMENT \"Our prayers remain with Charleston and Mother Emanuel church,\" Obama said Monday night, using the nickname of the historically black church in Charleston where nine people were killed Wednesday night after a gunman opened fire in a Bible study.\n\"As Americans, we insist that nobody should be targeted because of who they are, or what they look like, who they love, how they worship. We stand united against these hateful acts.\" \nObama lamented the \"distorted impression\" that many Americans have of Muslims. \n\"Here in America, many people personally don’t know someone who is Muslim. They mostly hear about Muslims in the news -- and that can obviously lead to a very distorted impression,\" Obama said. \nHe shared the story of protesters outside of an Arizona mosque who held up \"offensive signs against Islam and Muslims. But when the congregants invited the protesters in to pray, some completely changed their minds. \n\"One demonstrator, who accepted the invitation later, described how the experience changed him; how he finally saw the Muslim American community for what it is -- peaceful and welcoming,\" Obama said. \n\"That’s what can happen when we stop yelling and start listening. That’s why it’s so important always to lift up the stories and voices of proud Americans who are contributing to our country every day.\" \nSamantha Elauf, the woman at the center of the recent Supreme Court case about whether she could where a hijab as an Abercrombie & Fitch employee, attended the White House dinner. Elauf won her case in early June by an 8-1 vote. \n--This report was updated at 8:10 a.m. Tags: ", "external_links": [], "published": "2015-06-23T16:31:00.000+03:00", "crawled": "2015-06-23T16:42:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}