{"organizations": [], "uuid": "2e5fe61f02468f7fb712dba1d221f8247bf3eb7c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaextra.png", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/244815-obama-sits-down-with-cancer-surviving-anchor-during-healthcare-push", "country": "US", "title": "TV anchor thanks Obama for saving his life", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "TV anchor thanks Obama for saving his life", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-12T18:27:00.000+03:00", "replies_count": 0, "uuid": "2e5fe61f02468f7fb712dba1d221f8247bf3eb7c"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/244815-obama-sits-down-with-cancer-surviving-anchor-during-healthcare-push", "ord_in_thread": 0, "title": "TV anchor thanks Obama for saving his life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TV anchor thanks Obama for saving his life By Sarah Ferris - 06/12/15 11:27 AM EDT Capping a weeklong defense of the Affordable Care Act, President Obama sat down with a cancer-surviving \"Extra\" anchor who thanked the president for saving his life. “You pretty much saved my finances and my life,” Extra correspondent Jerry Penacoli, who suffered from stage 3 melanoma and early-stage thyroid cancer, told Obama in a rare Rose Garden interview. ADVERTISEMENT The interview marks Obama’s third appearance discussing the healthcare law this week, at a time when the Supreme Court could decide any day on a case that could disrupt coverage for millions. In the friendly exchange on Thursday, Obama described Penacoli as the “perfect example” of someone who has benefittted from the healthcare law. If not for the law, Penacoli would have hit the \"lifetime limits\" on his coverage and been forced to foot the bill for cancer treatments. “One of the things I try to remind people of — what we do here, what the Supreme Court does, what Congress does — these aren’t just abstractions,” Obama said. “These are things that really matter in people’s lives.” The White House's emotional appeal for ObamaCare comes at an uncertain time for the law. The Supreme Court’s decision on King v. Burwell , which could eliminate subsidies for 6.4 million people, is expected by late June. Public approval for the law also remains low, according to a poll released this week. Several of Obama’s remarks this week have contained subtle references to the Supreme Court, and Republicans have accused him of \"bullying\" the justices. The White House also released a website featuring dozens of people who have gained from the law. Though the case is likely long-settled, some experts say that justices could still be ironing out final details — particularly if the court plans to rule against the administration. They say that means there’s a chance the court could be paying attention to Obama’s remarks, though one veteran court-watcher warned that the government’s pleas to uphold the law could be taken the wrong way by the justices. “It has the real chance to backfire. The justices really don’t like being pressured into something,” Tom Goldstein, publisher of SCOTUSBlog, said Wednesday. “You start jumping up and down at them and the justices get their backs up.” White House spokesman Josh Earnest said Thursday that the administration is not trying to sway the court, and that it’s likely that that the justices have already “reached and written” their decision. Earnest said it wasn’t unusual for the president to celebrate the benefits of his healthcare law, and added that the decision to tout ObamaCare on an entertainment show \"is part of our sustained effort to try to use a variety of channels to communicate with the American public.\" As Penacoli began his interview, he acknowledged that his outlet didn't frequently get invited to sit down with the president in the Rose Garden.\" “I know this is rare,” Penacoli said. “It doesn’t happen very often.”", "external_links": [], "published": "2015-06-12T18:27:00.000+03:00", "crawled": "2015-06-13T01:47:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}