{"organizations": [], "uuid": "4b741b6d964720f6f6b2b6ec052874715bc6327c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/marijuana_201501getty_0.jpg", "site_section": "http://thehill.com/taxonomy/term/1157/feed", "section_title": "Healthcare", "url": "http://thehill.com/blogs/pundits-blog/healthcare/244252-the-fda-should-review-medical-marijuana", "country": "US", "title": "The FDA should review medical marijuana", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "The FDA should review medical marijuana", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-08T15:30:00.000+03:00", "replies_count": 0, "uuid": "4b741b6d964720f6f6b2b6ec052874715bc6327c"}, "author": "dperk1857@aol.com (Dan Perkins, contributor)", "url": "http://thehill.com/blogs/pundits-blog/healthcare/244252-the-fda-should-review-medical-marijuana", "ord_in_thread": 0, "title": "The FDA should review medical marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 08, 2015, 08:30 am The FDA should review medical marijuana By Dan Perkins,   \nMany states across the nation are considering the legalization of marijuana; some are talking about the medical uses for marijuana, while other states are talking about the fun derived from being high and also being high on the possible tax revenues to be gained through the open sale of this controlled substance. My home state of Florida last fall had a constitutional amendment on the ballot. That amendment would have made medical marijuana legal in the state. The proponents chose the route of trying to amend the state constitution to make marijuana legal in Florida; for those of you who don't know, the voters summarily rejected it. ADVERTISEMENT I do not consider myself the kind of person who would deny relief from a debilitating disease through the use of medical marijuana. But it seems to me, that for some reason, nobody who is in favor of medical marijuana can explain to me why it has not gone to the Food and Drug Administration (FDA) for approval. Why are we wasting significant amounts of time and money to get the drug legalized when we already have a process in place to make it legal? If marijuana is in fact a treatment for the side effects of several different diseases, then it seems to me it would be a pretty straightforward review by the FDA. The process could eliminate objections for its use in treating some illnesses and improve the quality of life for people all over the world.\nIf marijuana went through the review process of any drug that goes through the FDA, then the questions or at least the majority of questions about marijuana's effectiveness will be answered once and for all. I'm no great scientist, but as a professional investor I have invested in many pharmaceutical companies that have developed drugs to treat the symptoms of the disease. Not all drugs have been proven to be effective; in fact, some have failed the review process and never come to maket. Recently, Gilead Health Science released a drug that cures hepatitis C. The drug went through clinical trials to prove that it could cure people of hepatitis C; that process to a few years to complete. The company put up its own money to pay for all of the trials and all of the research. Let the supporters and detractors of marijuana set up a fund and pay for the research. \nWe have been talking about the legalization of marijuana for medical purposes for many years; it seems to me that it's about time to find out if all the representations of the great power of marijuana needs to be proved. The regulatory process used by drug companies to prove to the FDA that a drug does what the company says it can do must be once and for all applied to medical marijuana. Insurance companies and healthcare professionals will always be skeptical about the curative powers of marijuana without any reasonable scientific research to prove the claims. \nIt is true that, currently, there is no major pharmaceutical company willing to test the curative power of marijuana. I think the FDA must open a research study of its own into all of the claims people have made about the ability of marijuana to solve so many medical problems. It would be best if a company that is in the business of developing new drugs could run the program and submit it to the FDA for review. I realize that this research will take a number of years to complete; people with various afflictions will be necessary to test the effectiveness of the drug. Those people in the study must be exempt from any possible prosecution for the consumption of what is currently considered an illegal substance, at least at the federal level. \nOnly an objective study can bring out the truth about whether marijuana is a drug or just a weed. I wonder, when faced with the possibility of a true scrutiny test of the effectiveness of marijuana, will the proponents change their tune and argue against the FDA review? Will the supporters be willing to accept findings of analytical research, especially if it disapproves some or all of their contentions? By the same token, will those who are opposed to medical marijuana capitulate when scientific evidence is presented that says it does do what it has been purported to do? \nLet's put this issue to bed and call for the FDA to research medical marijuana once and for all. Let's stop wasting taxpayers money and clogging up the legal system on a state-by-state basis and let the scientists tell us the answer to the question. \nPerkins is a registered investment adviser with over 40 years of investment experience. He is also the author of the Brotherhood of the Red Nile trilogy and has appeared on over 400 radio and television shows during the last year as a commentator on current events. Tags:", "external_links": [], "published": "2015-06-08T15:30:00.000+03:00", "crawled": "2015-06-08T17:07:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}