{"organizations": [], "uuid": "799d7148112a88cd1315243b9c96754b47a2917e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3102640/images/o-PRESIDENT-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/jacob-devaney/obama-sides-with-climated_b_7650144.html", "country": "US", "title": "Obama Sides With Republican Climate Change Deniers on Trade Deal | Jacob Devaney", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Sides With Republican Climate Change Deniers on Trade Deal | Jacob Devaney", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-25T23:56:00.000+03:00", "replies_count": 0, "uuid": "799d7148112a88cd1315243b9c96754b47a2917e"}, "author": "Jacob Devaney", "url": "http://www.huffingtonpost.com/jacob-devaney/obama-sides-with-climated_b_7650144.html", "ord_in_thread": 0, "title": "Obama Sides With Republican Climate Change Deniers on Trade Deal | Jacob Devaney", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When I see the White House promote #actonclimate while President Obama is pushing the Trans Pacific Partnership that will reduce regulations on the worlds largest polluters, I get an awful feeling in my stomach. When Elizabeth Warren exposed the dangers of TPP's investor-state dispute settlement (ISDS) on working families, the environment, and public health, the president said, \"I take that personally.\" Obama still hasn't answered to these important issues yet Congress just voted to give him authority to negotiate the deal without oversight from the American people, environmental groups, health professionals, labor experts, or Congress. Instead he will be negotiating the TPP behind closed doors with many of the very corporations and banks that are responsible for our environmental and economic problems (for a list of 605 corporate insiders and advisors for TPP, visit here ). There is good reason that thousands of informed environmental groups, labor organizations and health professionals oppose the TPP.\nWhen I see this president buddying up with climate change-deniers like Boehner and McConnell to push this TPA and this trade deal through despite the fact that over 2,000 organizations comprised of environmental groups, public health professionals, retirees, corporate accountability, labor, and small businesses organizations oppose it. I would have to agree that this has gotten \"personal\". With over $200 million donated by corporate interests to buy \"yes\" votes for TPA, it HAS become personal to those of us who actually care about this country, it's people, and it's natural resources. It has become personal to those of us who expect our elected officials to represent the well-being of their constituents instead of wealthy private (corporate) interests. Climate change, social justice, economic equality are all entwined in our increasingly global society.\nThe TPP and other trade deals in the works are not about \"free trade\" that allow local businesses to sell abroad. They are about freeing multi-national corporations from government regulations that are necessary to protect the economy, the people and the environment. These un-democratic, secret trade deals are about preserving privatized monopolies and preventing competition from the public sector. They also move litigation offshore into private arbitrary tribunals. So if we pass local, state or national ballot initiatives to protect our water, air, or our workers, then our government (tax-payers) can be sued by courts outside of our jurisdiction for interfering with projected corporate profits.\nElizabeth Warren summed it up shortly after the Senate votes were tallied on Tuesday in a Boston Globe article :\nAnd here lies the double standard at the heart of our trade deals: Once they sign on, countries know that if they strengthen worker, health, or environmental standards, they invite corporate ISDS claims that can bleed taxpayers dry... While American negotiators ignore this problem, the rest of the world is waking up and fighting back. After Phillip Morris targeted it for billions in ISDS compensation, Australia began raising significant objections to ISDS. Negotiations with Europe over a massive new trade deal have stalled in part because of objections to ISDS, including from Germany and France. India is considering abandoning ISDS. So is South Africa, after being hit with an ISDS action challenging -- incredibly -- its postapartheid policies promoting minority ownership in its mining sector. Brazil has flatly refused to include ISDS in any of its trade agreements.\nThe presidents #actonclimate initiative is hollow when he is actively pushing to strip governments (and the people) of their ability to regulate climate-offenders by handing litigation over to corporate tribunals. The water we drink, the air we breathe, pesticides in our food, are environmental factors that directly impact our health. Environment, economy, and social justice are all entwined and must be represented in any trade deal. Jean Ross, RN, co-president of National Nurses United, stated :\nWall Street and the Chamber of Commerce hardly need more handouts. Nurses will continue to oppose the TPP and other disgraceful trade agreements, and send our own message to our elected representatives that they will have to answer to all Americans whether they stand with Wall Street, big corporations, or the American people.\nHere's a list of those who stand with corporations regarding the TPA. If they are in your state, you can leave them a message by requesting them at 202-224-3121. They are still yet to vote for TPP.\nSource: Senate.gov\nPublic Citizen, a trade watch organization, has done a whole lot to blow the lid off of this secret trade deal and educate Americans about what our elected officials are trying to do behind our backs. It is clearly a case of foxes watching the hen-house with a wolf-in-sheeps-clothing president parroting the hollow sentiment of caring about American workers and climate change. Robert Weissman, President of Public Citizen, stated :\nWhen the inexcusable and anti-democratic veil of secrecy surrounding the TPP is finally lifted, and the American people see what is actually in the agreement, they are going to force their representatives in Washington to vote that deal down. Members who fail to do so can expect their constituents to hold them accountable.\nI hope he's right! Will you join thousands of us as we call, tweet and make a loud rumble over this treachery? A recent article in the Atlantic questions if the TPP's ISDS provisions are unconstitutional. More importantly Alan B. Morrison, one of America's leading Constitutional lawyers, stated in a letter mailed to all members of the U.S. House of Representatives, \"The Investor-State Dispute Settlement Provisions in the Trans-Pacific Partnership Agreement Violate Article III of the United States Constitution\". He further added:\nGiven the importance of the ISDS provisions to the TPP, the Administration owes it to Congress and the American people to explain how the Constitution allows the United States to agree to submit the validity of its federal, state, and local laws to three private arbitrators, with no possibility of review by any U.S. court.\nPolitics are generally heartless and without conscience. Our Founding Fathers gave us a representative democracy that only works when citizens participate in it. If you are genuinely concerned about the environment, climate change, or social justice it is your job to hold our leaders accountable. It is the people who bring conscience and heart to our democracy. TPA has passed, now Congress only has an up or down vote on TPP, we still have time to stop the TPP. If the president truly wants us to #actonclimate, then we should be calling him and our representatives every day and telling them to vote NO on TPP. If TPP is so \"progressive\", then why is it being kept secret?\nFollow Jacob Devaney on Twitter: www.twitter.com/5cloudsdancing\nMore: Climate Change #ActonClimate Trans Pacific Partnership TPP Tpa Barack Obama Environment Trade This Blogger's Books and Other Items from... ABC's For A Better World\nby Elizabeth Newman, Jacob Devaney Giggle Bubble Dreams\nby Jacob Devaney", "external_links": ["http://www.flushthetpp.org/tpp-corporate-insiders/", "https://www.barackobama.com/climate-change-deniers/john-boehner-ohio/", "http://economyincrisis.org/content/almost-200-million-donated-to-representatives-to-buy-yea-votes-to-pass-tpa", "http://www.twitter.com/5cloudsdancing", "http://www.reuters.com/article/2015/04/24/us-usa-trade-obama-idUSKBN0NE2UW20150424", "http://www.citizenstrade.org/ctc/wp-content/uploads/2015/04/FastTrackOppositionLtr_042715.pdf", "http://robertreich.org/post/107257859130", "http://www.amazon.com/exec/obidos/ASIN/B007PYHJGW", "https://www.whitehouse.gov/climate-change", "http://www.senate.gov/legislative/LIS/roll_call_lists/roll_call_vote_cfm.cfm?congress=114&session=1&vote=00193#position", "http://www.amazon.com/exec/obidos/ASIN/B007Q2ZIH0", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.theatlantic.com/politics/archive/2015/06/tpp-isds-constitution/396389/", "http://www.citizen.org/documents/statement-weissman-fast-track-senate-vote.pdf", "http://www.nationalnursesunited.org/press/entry/nurses-senate-vote-on-fast-track-puts-public-health-at-risk/", "http://www.amazon.com/", "http://www.theguardian.com/commentisfree/2013/nov/19/trans-pacific-partnership-corporate-usurp-congress", "http://www.citizen.org/documents/Alan-Morrison-ISDS-letter.pdf", "http://www.bostonglobe.com/opinion/2015/06/23/warren/CJluXWm4B5VDTdUDsCkwEL/story.html?event=event25", "http://ecx.images-amazon.com/images/I/519EDxJTypL._SL160_.jpg", "http://ecx.images-amazon.com/images/I/61AbDxVyjXL._SL160_.jpg"], "published": "2015-06-25T23:56:00.000+03:00", "crawled": "2015-06-25T23:08:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}