{"organizations": [], "uuid": "9bf4a589c1551c878c808fa49249b85b8a5f6792", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/fiorinacarly05232015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/presidential-races/244381-fiorina-needles-obama-on-isis", "country": "US", "title": "Fiorina needles Obama on ISIS", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Fiorina needles Obama on ISIS", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-09T16:12:00.000+03:00", "replies_count": 0, "uuid": "9bf4a589c1551c878c808fa49249b85b8a5f6792"}, "author": "bkamisar@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/244381-fiorina-needles-obama-on-isis", "ord_in_thread": 0, "title": "Fiorina needles Obama on ISIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 09, 2015, 09:12 am Fiorina needles Obama on ISIS Getty Images \nRepublican presidential hopeful Carly Fiorina needled President Obama for saying the administration doesn’t have a “complete” plan to defeat militants from the Islamic State in Iraq and Syria, framing it as an example of his poor leadership. \n“It’s been clear that he doesn’t have a plan, it’s been equally clear that the Pentagon has been giving him options and, of course, our allies have been asking for very specific things to help us defeat ISIS,” she said Tuesday on Fox and Friends. ADVERTISEMENT She said that the Kurds have asked for arms and that the Jordanians have asked for bombs, but that President Obama hasn’t met those requests. \n“Instead of having a Camp David summit to talk our Arab allies into a bad deal with Iran, he should have had a Camp David Summit to ask them how we can support them in this fight,” she said about Obama’s May meeting about the burgeoning international nuclear deal with Iran. \nThe State Department has pushed back against similar characterizations of the President’s Monday statements, arguing that he was referring to the specific plan for arming the Iraqis, which must be done in concert with that government. \nFiorina agreed with the show’s hosts that Obama’s ISIS strategy is similar to his position on the Supreme Court’s case on Affordable Care Act subsidies, where he’s said he has no back-up plan because the law should be upheld. \n“What is really disappointing about this president is not just lack of leadership, but his tendency to always place the blame for his lack of leadership somewhere else,” she said. \n“In the case of ISIS, it’s apparently the Pentagon’s fault or the Iraqi’s fault. If his legislation doesn’t pass, it’s the Republicans’ fault,” she said. \n“That’s why I think the 2016 election is going to be about leadership.” \nFiorina, the former CEO of Hewlett Packard, is in the midst of her presidential bid, where she’s repeatedly criticized the leadership style of both Obama and Democratic frontrunner Hillary Clinton. She currently polls at about two percent in national polls and is looking to make a play into the top 10, where she would be eligible for the first GOP poll, hosted by Fox News. Tags: Past: 1 hour Obama: 'We don't yet have a... The president said Iraq must show a greater commitment to fighting ISIS. Republicans wield power of the... A bill to fund the Justice Department is the latest front in the battle... Boehner: We don't have votes yet... \"I don't think we're quite there yet,\" the Speaker said. GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-09T16:12:00.000+03:00", "crawled": "2015-06-09T19:46:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}