{"organizations": [], "uuid": "9701634e26e6ec025d33cff020684c01b229dd24", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/27/feed#", "section_title": "The Hill: Technology Policy", "url": "http://thehill.com/policy/technology/245237-obama-administration-knocks-net-neutrality-riders-in-funding-bill", "country": "US", "title": "Obama administration knocks net neutrality riders in funding bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama administration knocks net neutrality riders in funding bill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-17T15:47:00.000+03:00", "replies_count": 0, "uuid": "9701634e26e6ec025d33cff020684c01b229dd24"}, "author": "mtrujillo@thehill.com (Mario Trujillo)", "url": "http://thehill.com/policy/technology/245237-obama-administration-knocks-net-neutrality-riders-in-funding-bill", "ord_in_thread": 0, "title": "Obama administration knocks net neutrality riders in funding bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama administration knocks net neutrality riders in funding bill By Mario Trujillo - 06/17/15 08:47 AM EDT \nThe Obama administration on Tuesday night poked holes in a House appropriations bill that includes language to temporarily prevent the Federal Communications Commission from implementing new Internet rules. \nAhead of a scheduled markup on Wednesday, the Office of Management and Budget expressed “serious concerns” that the House’s Financial Services and General Government Appropriations bill contains “highly problematic ideological riders.” ADVERTISEMENT “The inclusion of these provisions threatens to undermine an orderly appropriations process,” OMB Director Shaun Donovan wrote in a letter to Appropriations Chairman Hal Rogers (R-Ky.). \nThe Federal Communications Commission’s funding and the net neutrality riders were only a sliver of the concerns outlined in the six-page letter, which also dealt with IRS funding, restrictions on some Cuba travel and provisions related to D.C.’s budget. \nThe administration stopped short of threatening a veto this early in the process but called for a number of improvements. \nDonovan described cuts to the FCC’s funding as unnecessary since it is funded by regulatory fees and auction funds. In addition to a blanket delay of the net neutrality order, the appropriations bill would prohibit “certain direct or indirect regulations that could independently prevent the order from being implemented,” according to the letter. \nThe appropriations bill would slash $25 million from the FCC funding compared to the 2015 fiscal year, even though the agency asked for a boost in funding in 2016 to move and consolidate its office building. \n“These cuts unnecessarily force the FCC to scale back important work on public safety, wireless spectrum, and universal service, while increasing overall costs for taxpayers,” according to the letter. \nTelecom companies are suing to kill the agency’s controversial net neutrality rules, which would reclassify Internet access as a telecommunications service, similar to authority governing traditional telephones. The appropriations bill would bar implementation of the rules until a final court ruling is handed down, which could be early next spring. \nIt would also require new FCC rules to be published for 21 days before any scheduled vote — a point of contention during the net neutrality debate. While FCC Chairman Tom Wheeler has said the agency is completely uninterested in regulating the rates that Internet providers charge consumers, the appropriations bill would specifically bar it. Tags:", "external_links": [], "published": "2015-06-17T15:47:00.000+03:00", "crawled": "2015-06-18T05:16:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}