{"organizations": [], "uuid": "e655c998538adde966cae80151e0ff885eb2346c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_medal060215_getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/243748-obama-awards-medal-of-honor-to-overlooked-black-jewish-wwi-soldiers", "country": "US", "title": "Obama awards Medal of Honor to overlooked black, Jewish WWI soldiers", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama awards Medal of Honor to overlooked black, Jewish WWI soldiers", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T19:31:00.000+03:00", "replies_count": 0, "uuid": "e655c998538adde966cae80151e0ff885eb2346c"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/243748-obama-awards-medal-of-honor-to-overlooked-black-jewish-wwi-soldiers", "ord_in_thread": 0, "title": "Obama awards Medal of Honor to overlooked black, Jewish WWI soldiers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama awards Medal of Honor to overlooked black, Jewish WWI soldiers Getty By Jordan Fabian - 06/02/15 12:31 PM EDT \nPresident Obama on Tuesday awarded the Medal of Honor to two World War I soldiers who were denied recognition in the past because of their race or ethnicity. \nThe president awarded the nation’s highest military honor to Sgt. William Shemin, who was Jewish, and Pvt. Henry Johnson, an African-American, nearly 100 years after fighting on the battlefields of France. \nObama said both men, who have long since passed away, committed heroic acts that saved the lives of their fellow service members. ADVERTISEMENT “We believe it’s never too late to say thank you,” Obama said. \nDuring a battle in August 1918, Shemin braved enemy fire three times to rescue wounded soldiers on the battlefield, suffering a shrapnel injury in the process. Days later, Shemin took command of his platoon due to the deaths of other officers, but he was wounded by a German bullet that left him hospitalized. \nJohnson served in the all-black 369th Army Infantry regiment. He was wounded multiple times in May 1918, when he singlehandedly fought off a German raiding squad to rescue a fellow solider who had been taken prisoner. \nShemin’s octogenarian daughters, Elise Shemin-Roth and Ina Bass, accepted the award on their father’s behalf. \nJohnson’s award was accepted by Command Sgt. Maj. Louis Wilson of the New York Army National Guard. \nObama said he would make similar efforts to acknowledge American veterans whose past gallantry has been overlooked. \n“It has taken a long time for Henry Johnson and William Shemin to receive the recognition they deserve,” he said. There are surely others whose heroism is unacknowledged. We have work to do as a nation to make sure all of our heroes' stories are told. We’ll keep at it, no matter how long it takes.” Tags: Past: 1 day Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-02T19:31:00.000+03:00", "crawled": "2015-06-02T19:35:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}