{"organizations": [], "uuid": "877970dae4e85e6959afd8496f396d73e13ca69e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/marijuanafarm06042015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/244535-dem-lawmaker-wants-to-defund-deas-marijuana-eradication-program", "country": "", "title": "Dem lawmaker wants to defund DEA's marijuana eradication program | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Dem lawmaker wants to defund DEA's marijuana eradication program | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "877970dae4e85e6959afd8496f396d73e13ca69e"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/244535-dem-lawmaker-wants-to-defund-deas-marijuana-eradication-program", "ord_in_thread": 0, "title": "Dem lawmaker wants to defund DEA's marijuana eradication program | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 10, 2015, 11:37 am Dem lawmaker wants to defund DEA's marijuana eradication program By Mark Hensch Getty Images \nDemocratic Rep. Ted Lieu (Calif.) is pushing legislation to end funding for the Drug Enforcement Administration's (DEA) marijuana eradication program. \n“This is a ridiculous waste of precious federal resources, especially when multiple states and jurisdictions have already legalized marijuana,” Lieu said in a statement on Wednesday, according to Fox News . \n“It is time for the federal government to stop making marijuana use or possession a federal crime,” he added. ADVERTISEMENT Lieu’s proposed amendment to a 2016 fiscal spending bill would halve the DEA’s $18 million budget for the program, according to the report.\nThe $9 million saved would be used to fund domestic and sexual abuse support programs for children. \nLieu said on Wednesday that he intends to end the DEA’s program entirely by fiscal 2017. \n“Next year, I will bring another amendment to eliminate the program completely,” he said. \nLieu said the DEA’s program is wasteful, given growing support for marijuana decriminalization nationwide. \nUnder the program, the DEA provides funding to state and local law enforcement agencies to burn confiscated marijuana plants. It eliminates both indoor and outdoor plants seized. \nDEA records show that 4.3 million marijuana plants were destroyed last year, according to Fox News. That followed 4.4 million plants in 2013 and 10.4 million in 2009, it added. \nThe DEA also arrested 6,310 people in relation to its cannabis eradication efforts last year, according to the report. \nLieu's amendment would redirect the $9 million taken from the DEA’s program to three other measures, including $4 million for the Youth-Oriented Program created by the Violence Against Women Act, and $4 million to the Victims of Child Abuse Program. \nMarijuana is currently illegal under federal law, but the Obama administration has respected state laws on the drug, declining to prosecute dealers and users in states where local laws do not criminalize pot. \nThe National Organization for the Reform of Marijuana Laws (NORML) says 17 states and the District of Columbia have decriminalized marijuana. \nThat means there is no prison time or criminal record for first-time possession of certain amounts for personal consumption, its website says. ", "external_links": [], "published": "2015-06-10T03:00:00.000+03:00", "crawled": "2015-06-11T00:17:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}