{"organizations": [], "uuid": "ef1f0b21bb9e741d7aaaf80faaf41fe1889b409b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/061815_sr_panel_640.jpg", "site_section": "http://news.google.com/news?ned=us&topic=t&output=rss", "section_title": "Sci/Tech - Google News", "url": "http://www.foxnews.com/politics/2015/06/18/gop-lawmakers-dismiss-obama-administration-praises-pope-francis-climate-message/", "country": "IL", "title": "Obama administration praises, GOP lawmakers dismiss pope's climate message - Fox News", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama administration praises, GOP lawmakers dismiss pope's climate message - Fox News", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-19T03:49:00.000+03:00", "replies_count": 0, "uuid": "ef1f0b21bb9e741d7aaaf80faaf41fe1889b409b"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/18/gop-lawmakers-dismiss-obama-administration-praises-pope-francis-climate-message/", "ord_in_thread": 0, "title": "Obama administration praises, GOP lawmakers dismiss pope's climate message - Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama administration praises, GOP lawmakers dismiss pope's climate message Published June 18, 2015 Facebook 0 Twitter 0 livefyre Email Print \nThe Obama administration and congressional Democrats welcomed Pope Francis' call for sweeping action against climate change Thursday, but the pontiff's message was swiftly dismissed by GOP lawmakers. \n\"I welcome His Holiness Pope Francis's encyclical, and deeply admire the Pope's decision to make the case - clearly, powerfully, and with the full moral authority of his position - for action on global climate change,\" President Obama said in a statement. \n\"As Pope Francis so eloquently stated this morning, we have a profound responsibility to protect our children, and our children's children, from the damaging impacts of climate change,\" Obama said. \nSecretary of State John Kerry also lauded the 78-year-old Argentinian's document on the environment released Thursday morning -- named \"Laudato Si\" (\"Praise Be To You\") -- calling his words \"powerful.\" \n\"The faith community – in the United States and abroad – has a long history of environmental stewardship and aiding the poor, and Pope Francis has thoughtfully applied those same values to the very real threat our planet is facing today,\" Kerry said. \nHowever, Republican lawmakers, both Catholic and non-Catholic, were open in their disagreement with the document that calls for a bold cultural revolution and a drastic reduction in the use of fossil fuels while framing climate change as an urgent moral issue that hurts the poor the most. \n\"I don't want to be disrespectful, but I don't consider him an expert on environmental issues,\" said Texas Rep. Joe Barton, a senior Republican on the Energy and Commerce Committee, in a comment echoed by a number of other Republicans. \nThe reactions suggested that the pontiff's desire to translate his climate views into real action to combat greenhouse gases could fall flat, at least as far as the American political system is concerned. \nHouse Speaker John Boehner, R-Ohio, a Catholic who invited the pontiff to address Congress later this year, said the pope is not afraid to challenge thinking on various issues. \"I respect his right to speak out on these important issues,\" Boehner said, but he demurred when asked whether Francis' views, made public in an encyclical released Thursday, might spur legislative action by the Republicans who run Congress. \n\"There's a lot of bills out there. I'm not sure where in the process these bills may be,\" Boehner said. \nFrancis is to address lawmakers in September in the first speech by a pope to Congress. \nThe Environmental Protection Agency also welcomed Francis' message: \n\"Today’s release of Pope Francis’s climate encyclical reaffirms his engagement with the issue of climate change, the need to act as stewards of the planet, and our moral obligation to protect the most vulnerable among us,\" Administrator Gina McCarthy said. \"I look forward to the agency’s continued work with the US Conference of Catholic Bishops and NGOs such as the Catholic Climate Covenant to highlight the importance of action and a continued focus on climate change.\" \nSome key Republicans, notably those running for president in 2016 such as Sens. Ted Cruz, R-Texas, and Rand Paul, R-Ky.,, chose not to comment on Francis' words. However, f ormer Florida Gov. Jeb Bush questioned the pope's foray into climate science when discussing the issue ahead of the encyclical's release. \n'I hope I’m not going to get castigated for saying this by my priest back home, but I don’t get economic policy from my bishops or my cardinals or my pope.\" Bush said Tuesday. \nA statement from a spokesman for former Texas Gov. Rick Perry did not directly mention Francis but said, \"Gov. Perry believes the climate is always changing, but it's not clear what role humans have in it.\" \nIt's not the first time the Catholic Church's teachings on political or social issues have created complications for Catholic lawmakers. House Democratic leader Nancy Pelosi of California, who is Catholic, was criticized in the run-up to the passage of ObamaCare over her support for abortion rights in light of the church's opposition. \nBut with his entry into the contentious politics of climate, and his attempt to reframe the issue in moral terms, Francis opened a new chapter in the long-running debate over the intersection of politics and religion. \nThe Associated Press contributed to this report. Advertisement", "external_links": [], "published": "2015-06-19T03:49:00.000+03:00", "crawled": "2015-06-19T04:29:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}