{"organizations": [], "uuid": "344f14858a795c2edf549eb83726e454b3366c84", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/anncoulter061715_getty.jpg", "site_section": "http://thehill.com/taxonomy/term/48/feed#", "section_title": "The Hill: In The Know", "url": "http://thehill.com/blogs/in-the-know/245249-ann-coulter-id-run-immigration-policy-like-tinder", "country": "US", "title": "Ann Coulter: I'd run immigration policy 'like Tinder'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ann Coulter: I'd run immigration policy 'like Tinder'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-17T17:34:00.000+03:00", "replies_count": 0, "uuid": "344f14858a795c2edf549eb83726e454b3366c84"}, "author": "mmali@thehill.com (Kate Hardiman)", "url": "http://thehill.com/blogs/in-the-know/245249-ann-coulter-id-run-immigration-policy-like-tinder", "ord_in_thread": 0, "title": "Ann Coulter: I'd run immigration policy 'like Tinder'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 17, 2015, 10:34 am Ann Coulter: I'd run immigration policy 'like Tinder' By Kate Hardiman Getty \nConservative commentator Ann Coulter is taking on immigration reform in her new book Adios America . \n\"I could do it like Tinder,\" Coulter joked about running the nation's immigration system, at a book signing hosted by Breitbart News on Tuesday. \n“I could decide like that about who to admit into this country. I would have it all decided before breakfast,\" she added. ADVERTISEMENT On Tinder, a popular dating app, users swipe right when they like a profile photo of another user. If they are not interested, they swipe left, allowing for quick dating decisions based on appearance.\n\"You will see in my book that our immigration officials aren’t really thinking when they’re admitting people into this country. What they consider a hard decision, I consider such an easy decision,” Coulter added. \nLawmakers and conservative stars joined Coulter to celebrate the new work, described as an exposé uncovering “the left’s plan to turn our country into a third-world hellhole.” \nReps. Mo Brooks (R-Ala.) and Steve King (R-Iowa), two staunch opponents of President Obama's immigration reforms, praised the firebrand pundit. \n“I think she’s spot on. ... She’s definitely a long-term thinker, but unfortunately, we have too many short term thinkers on Capitol Hill,” Brooks said. \nKing said that he and Coulter have been, “friends for years.” \n“She’s influenced the way I think about these issues in some ways the public will never know,” he added as praise. \nCoulter, though, expressed frustration that the book has not received more attention from what conservatives see as the mainstream media. \n“I can’t get an interview on ABC, NBC or CBS,” she stated. \nCoulter was interviewed by Fusion TV's Jorge Ramos, leading her to quip, “I finally got a Mexican to do a job an American wouldn’t do!” Tags:", "external_links": [], "published": "2015-06-17T17:34:00.000+03:00", "crawled": "2015-06-17T23:00:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}