{"organizations": [], "uuid": "8138f94530de721c5e2d0d59d75d2e1ef55368a3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaaddress0613.png", "site_section": "http://thehill.com/taxonomy/term/48/feed#", "section_title": "The Hill: In The Know", "url": "http://thehill.com/blogs/in-the-know/245552-obama-on-my-brothers-keeper-i-always-see-myself-in-them", "country": "US", "title": "Obama on My Brother's Keeper: 'I always see myself in them'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama on My Brother's Keeper: 'I always see myself in them'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-19T21:09:00.000+03:00", "replies_count": 0, "uuid": "8138f94530de721c5e2d0d59d75d2e1ef55368a3"}, "author": "tlejeune@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/in-the-know/245552-obama-on-my-brothers-keeper-i-always-see-myself-in-them", "ord_in_thread": 0, "title": "Obama on My Brother's Keeper: 'I always see myself in them'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 19, 2015, 02:09 pm Obama on My Brother's Keeper: 'I always see myself in them' By Mark Hensch \nPresident Obama reflects on his similarity to minority youth in a new documentary about his program to assist and elevate underprivileged young black men. \n“I always see myself in them,” Obama says in \"Rise: The Promise of My Brother’s Keeper,” which began streaming on Facebook Friday. It will additionally appear on the Discovery Channel and OWN, Oprah Winfrey’s network, on Sunday evening. \n“I want every young man who sees me to know I’m not that different from them,” he says. “I wasn’t born into wealth, I wasn’t born into fame. I made a lot of mistakes, but I kept at it.\" ADVERTISEMENT Obama recalls his past work as a community organizer and how it has influenced his views on urban poverty and youth outreach ever since.\n“My experiences in Chicago had taught me that there were young people all across this country — certainly in some of the poorest neighborhoods in Chicago — that were as talented as I was, as thoughtful, as strong, as capable, but were living in a much less forgiving environment, where I might have gotten a second or a third chance.” he says in the documentary. \n“They had no margin for error because so often these young men are seen only through the filter of stereotypes,\" he added. \nObama additionally argues that the My Brother’s Keeper program is important for the perspective and guidance it offers participants.“It’s useful for them to hear from somebody who has come out on the other side of it that the challenges they are going through are not that exceptional,” he says.“What also just strikes me is just how much of a difference it makes to have some adults in their lives and paying attention them saying, ‘You matter. You have talent. You have capacity. We’re going to help you,” he adds.“Rise\" states that more than 60 superintendents across the nation’s largest urban school districts, as well as 200 mayors, tribal leaders and county executives, have pledged their participation in My Brother’s Keeper going forward.Obama praises the determination of the film’s subjects during his remarks.“The amazing thing about kids is that they’re resilient,” he says. “And they can overcome just the worst of circumstances and with a little attention and a little love and some resources and ladder for them to climb they can succeed.”“If they succeed, we all succeed,” the president adds.", "external_links": [], "published": "2015-06-19T21:09:00.000+03:00", "crawled": "2015-06-20T05:16:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}