{"organizations": [], "uuid": "64d84c94cffb5826a1f19483a298009b29cfe367", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaclinton_012415getty.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed#", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/lawmaker-news/244166-obama-and-clinton-embody-american-exceptionalism", "country": "US", "title": "Obama and Clinton embody American exceptionalism", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama and Clinton embody American exceptionalism", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-05T23:00:00.000+03:00", "replies_count": 0, "uuid": "64d84c94cffb5826a1f19483a298009b29cfe367"}, "author": "brentbbi@webtv.net (Brent Budowsky, columnist, The Hill)", "url": "http://thehill.com/blogs/pundits-blog/lawmaker-news/244166-obama-and-clinton-embody-american-exceptionalism", "ord_in_thread": 0, "title": "Obama and Clinton embody American exceptionalism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 05, 2015, 04:00 pm Obama and Clinton embody American exceptionalism By Brent Budowsky, columnist, The Hill Getty Images \nA recent story in The Washington Post this week discussed the debate about the meaning of American exceptionalism. In his speech earlier this year at Selma, Ala. to commemorate the heroic leaders of the civil rights movement, President Obama spoke in panoramic and moving terms about the true greatness of the land we love. ADVERTISEMENT Nothing more dramatically illustrates the true exceptionalism of America than the marches in the 1960s for civil rights and voting rights to the inauguration of America's first black president, an achievement historians will remember centuries from today.\nIt will be an equally profound moment in the history of American exceptionalism if the marches that began with the marches of women's suffragettes for voting rights for women culminates in the election of Hillary Clinton, or any other female candidate, as the first woman president. \nAmerican exceptionalism transcends party, race, gender and and ideology. Anyone who claims otherwise — anyone who claims that Americans of a different race or gender or party affiliation do not share that American exceptionalism — does not understand American exceptionalism or the American idea. \nObama and Clinton are true patriots and exemplars of the American idea and American exceptionalism, as are 2012 Republican nominee Mitt Romney, Sen. Marco Rubio (R-Fla.) and countless candidates of different ideologies and parties who can stake an equal claim to being exemplars of the American Dream. \nPresidential campaigns should be about which candidate can best summon the exceptionalism of America, to lift the tide of equal opportunity for all Americans. \nThe great truth about American exceptionalism is that we are a large and diverse nation, a melting pot of citizens from diverse backgrounds and cultures who share a love of the values we stand for, a respect for all Americans who come from different backgrounds, and a belief that the dream of the nation should live for all of the people of the nation whomever they are, whatever background they come from. \nWhat Obama said at Selma embodies the height of Americanism, as did the civil rights champions he honored that day who we should honor every day. \nThe fact that Obama became the first black president represents a great achievement of American exceptionalism. His efforts to widen the doors of opportunity for all represents the height of Americanism. \nWhen Clinton eloquently champions voting rights for all Americans, she follows in the footsteps of the suffragettes who marched for voting rights for women and the civil rights champions who marched for voting rights in Selma and across the nation. \nWhen Clinton or a different woman is elected as the first woman president that, too, will be a crowning achievement of American exceptionalism. \nI found it interesting that when Jeb Bush was quoted in The Washington Post story as saying that the greatness of America since the World War II was that we lifted countless people out of poverty and towards freedom. Was he not praising iconic liberal Democratic presidents such as Franklin Roosevelt and Harry Truman, who led the fight to win the war and create the Marshall Plan, and John Kennedy and Lyndon Johnson, who lifted millions out of poverty with the New Frontier and the Great Society? \nBarack Obama and Hillary Clinton both embody the ideal of American exceptionalism and carry the baton for the great aspirations of the American Dream. Let the coming campaign be about the great truth that elections are a choice between which candidate best expresses the shared spirit of the American idea, not the big lie that political opponents do not have an equal stake in the exceptionalism that keeps us free. \nBudowsky was an aide to former Sen. Lloyd Bentsen (D-Texas) and former Rep. Bill Alexander (D-Ark.), who was then chief deputy majority whip of the House. He holds an LL.M. degree in international financial law from the London School of Economics. Contact him at brentbbi@webtv.net . Tags:", "external_links": [], "published": "2015-06-05T23:00:00.000+03:00", "crawled": "2015-06-06T08:18:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}