{"organizations": [], "uuid": "1a5fdad25123cdd5dbd7c81f0ccd79aa952eaddb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/foley.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/ballot-box/245834-obama-easing-us-hostage-policy", "country": "US", "title": "Obama easing US hostage policy", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama easing US hostage policy", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-23T18:59:00.000+03:00", "replies_count": 0, "uuid": "1a5fdad25123cdd5dbd7c81f0ccd79aa952eaddb"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/ballot-box/245834-obama-easing-us-hostage-policy", "ord_in_thread": 0, "title": "Obama easing US hostage policy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 23, 2015, 11:59 am Obama easing US hostage policy By Jordan Fabian \nPresident Obama will announce Wednesday that the U.S. will no longer threaten criminal prosecutions against American families who attempt to pay ransoms to extremist groups holding their relatives hostage. \nThe move is part of a long-awaited policy change in response to the death of U.S. hostages held by the Islamic State in Iraq and Syria (ISIS) and other militant groups. \nObama will make the changes through an executive order and presidential directive, White House press secretary Josh Earnest said Tuesday. The president will deliver a speech about the moves Wednesday and meet with families of hostages who participated in the review. Family members on Tuesday received a briefing on the details of the plan at the White House from senior administration officials. \nThe White House will create a new office, known as a hostage recovery fusion cell , to coordinate response efforts with the families of American captives, according to The Wall Street Journal . The office will be housed in the Federal Bureau of Investigation (FBI). \nThe State Department will also name a special presidential envoy for hostage affairs, according to Foreign Policy . The new official will help communicate with foreign governments involved in freeing U.S. hostages. \nThe administration has not yet selected individuals to lead the fusion cell or serve as special envoy, according to the report. \nWhile the new policy still prevents the U.S. from making concessions to hostage-takers, it will allow families and government officials to communicate with terrorist groups or other third-parties to help secure the release of hostages held overseas. \nThe Obama administration began a review of its hostage policies last November, following ISIS’s beheading of captive American citizens. \nFamilies of the slain Americans complained the federal government failed to communicate effectively with them while their relatives were held hostage. \nThe family of James Foley, the U.S. journalist killed by ISIS, said different agencies said different things with regard to paying a ransom and said the White House threatened them with prosecution if they decided to pay a ransom. \nThe family of Warren Weinstein, an American al Qaeda captive inadvertently killed in a drone strike earlier this year, praised the assistance they received from the FBI but said help from other elements of the U.S. government was “inconsistent and disappointing.\" \nThe FBI helped facilitate a ransom payment from the Weinstein family to al Qaeda in 2012, the Journal reported, but it was unsuccessful in leading to his release. \nOut of the 82 families the White House invited to participate in the hostage review, just 24 decided to so do, according to the Journal and Foreign Policy . \n”The White House has missed the opportunity to fix a problem that has affected far too many families,” a spokesman for the Weinstein family told the Journal .", "external_links": [], "published": "2015-06-23T18:59:00.000+03:00", "crawled": "2015-06-24T03:27:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}