{"organizations": [], "uuid": "9c617151a736a378cc2110cf44cd86147b7334bc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/clintonhillary_060415getty.png", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/presidential-races/245021-clinton-obama-should-use-trade-defeat-to-win-concessions", "country": "US", "title": "Clinton: Obama should use trade defeat to win concessions", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Clinton: Obama should use trade defeat to win concessions", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-15T23:04:00.000+03:00", "replies_count": 0, "uuid": "9c617151a736a378cc2110cf44cd86147b7334bc"}, "author": "iswanson@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/245021-clinton-obama-should-use-trade-defeat-to-win-concessions", "ord_in_thread": 0, "title": "Clinton: Obama should use trade defeat to win concessions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 15, 2015, 04:04 pm Clinton: Obama should use trade defeat to win concessions By Ben Kamisar \nPresident Obama should use Friday’s failed trade vote as leverage to win concessions from negotiating partners that would meet the demands of House Democrats, Hillary Clinton said Monday. \nClinton, who has come under pressure to oppose Obama’s request for fast-track trade authority and the Trans-Pacific Partnership, said Obama might win the congressional battle if he can get partner countries to offer concessions. ADVERTISEMENT “I believe that you take whatever happens to you in a negotiation and you try to leverage it,” she said during a news conference Monday.\n“One of the ways that the president could get fast track authority is to deal with the legitimate concerns of Democrats that are potential yes voters to see what within the negotiation or even within the existing framework agreement being drafted could be modified for changes,” she said. \nAddressing her past support of Obama’s “pivot to Asia,” Clinton said that it was “important for our country to be focused on that part of the world.” \nShe also added that, while she praised the Trans-Pacific Partnership trade deal in her 2014 book Hard Choices , she spoke out against the Investor-State Dispute Settlement, which works as an international arbiter for disputes under the treaty. \n“When I raised a little bit of an alarm in my book, Hard Choices, about the Investor-State Dispute Settlement, I did so because it is a fundamentally an anti-Democratic process,” she said. \n“I don’t think you’re at all walking away from or ignoring the economic and commercial aspects of our pivot by saying we want the best possible deal for the American people.” \nClinton has come under pressure from Sen. Bernie Sanders (I-Vt.), who is challenging her for the Democratic presidential nomination, to forcefully oppose the TPP. \nObama’s request for fast-track failed to move forward Friday in the House, after Democrats voted down a critical part of the package. \nClinton distanced herself from Obama and her husband, President Clinton, by reiterating her recent comments that she’s not running for either president’s third term. \nBut she defended Obama’s economic record as “extraordinary” and called on the media “who care about the facts” not to forget the economic situation he inherited. \n“When the president came into office, the debt was at the bottom of the abyss,” she said. \n“Let’s have a debate on what the evidence is, not act like yesterday never happened and the problems that we are dealing with just out of nowhere. No, there were reasons why we ended up in the Great Recession.” \nClinton’s last-minute press conference, the first of its kind for the campaign, came amid grumbling from the media that her campaign barred a reporter from joining the campaign. That reporter was shut out even though he was chosen by a group of national reporters to provide that day’s pool coverage of the campaign. Tags:", "external_links": [], "published": "2015-06-15T23:04:00.000+03:00", "crawled": "2015-06-16T01:13:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}