{"organizations": [], "uuid": "bb7f928751d08255942a4142015cf0ba941d26dc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamamichelle_052515getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/blogs/blog-briefing-room/news/244506-michelle-obama-tells-chicago-grads-to-stay-hungry", "country": "US", "title": "Michelle Obama tells Chicago grads to 'stay hungry'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Michelle Obama tells Chicago grads to 'stay hungry'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-10T15:35:00.000+03:00", "replies_count": 0, "uuid": "bb7f928751d08255942a4142015cf0ba941d26dc"}, "author": "kballuck@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/blog-briefing-room/news/244506-michelle-obama-tells-chicago-grads-to-stay-hungry", "ord_in_thread": 0, "title": "Michelle Obama tells Chicago grads to 'stay hungry'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 10, 2015, 08:35 am Michelle Obama tells Chicago grads to 'stay hungry' Getty Images \nFirst lady Michelle Obama told a crowd of high school students in Chicago on Tuesday night to \"stay hungry\" in their career aspirations following graduation. ADVERTISEMENT Obama shared her own parents’ efforts to make sure she and her brother got a good education, reflecting on the death of her father in 1991 following complications from multiple sclerosis while she was in her late twenties.\n\"Let me tell you, he is the hole in my heart. His loss is my scar. But let me tell you something, his memory drives me forward every single day of my life,\" Obama said at Martin Luther King Jr. Preparatory High School. \n\"Every day, I work to make him proud. Every day, I stay hungry, not just for myself, but for him and for my mom and for all the kids I grew up with who never had the opportunities that my family provided for me,\" she said. \nObama encouraged those in attendance to take a page from her book. \n\"I want to urge you all to do the same thing. There are so many folks in your school and in your families who believe in you, who have sacrificed for you, who have poured all of their love and hope and ambition into you. And you need to stay hungry for them,\" she said. \nObama addressed the school, which won an academic video contest. Last month, she addressed graduates at Oberlin College in Ohio as well as those at Tuskegee University, a historically black university in Alabama. \nShe spoke Tuesday to the graduating class of Hadiya Pendleton, the slain 15-year-old shooting victim in Chicago in 2013 whose parents attended President Obama's State of the Union address that year as the first lady's guests. \n\"There are so many young people who can only dream of the opportunities you’ve had at King College Prep –- young people in troubled parts of the world who never set foot in a classroom,\" Michelle Obama said Tuesday. \n\"Young people in this community who don’t have anyone to support them. Young people like Hadiya, who were taken from us too soon and can never become who they were meant to be. You need to stay hungry for them.\"", "external_links": [], "published": "2015-06-10T15:35:00.000+03:00", "crawled": "2015-06-10T18:23:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}