{"organizations": [], "uuid": "cb94d122a385201635d925ffe6c92adbaf08d043", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3058280/images/o-PREEMIE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/blog.xml", "section_title": "Women Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/david-a-grimes/abortion-and-prematurity-a-false-alarm_b_7511084.html", "country": "US", "title": "Abortion and Prematurity: A False Alarm | David A. Grimes", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "Abortion and Prematurity: A False Alarm | David A. Grimes", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-11T00:42:00.000+03:00", "replies_count": 1, "uuid": "91835c216b21ec750b7d43b3f147fac172b2651e"}, "author": "David A. Grimes", "url": "http://www.huffingtonpost.com/david-a-grimes/abortion-and-prematurity-a-false-alarm_b_7511084.html#post-0", "ord_in_thread": 0, "title": "Abortion and Prematurity: A False Alarm | David A. Grimes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo : Michael Johnson\nNo major medical or public health organization has concluded that abortion increases a woman's risk of preterm birth. However, impassioned (but naive) abortion opponents insist that abortion is causally related to prematurity. While some medical studies have found a weak association between the two events, they are not causally linked. These weak associations are caused by what in research is called selection bias and confounding . In lay terms, this means comparing apples with oranges and failing to account for distortion by other risk factors. A few simple examples explain how this works.\nComparing apples to apples\nA fundamental principle of research is comparing like with like . This is almost impossible in abortion research because women who choose abortion are fundamentally different than women who choose to continue their pregnancies. Women who elect abortion are more likely to be poor, single, abused, and challenged by medical and psychiatric illness. Examples include high blood pressure, diabetes, schizophrenia, and major depression. As common sense would suggest, the women described above are more likely than others to consider their life situation unfavorable for giving birth. In contrast, women who continue their pregnancies are more likely to be financially secure, married, and healthy (termed the \"healthy mother\" effect).\nApples and oranges\nA favorite citation of abortion opponents is a study from Finland. No significant relationship was seen between one or two abortions and later prematurity. Among women who had three or more induced abortions before a live birth, a 40 percent increase in the risk of prematurity was observed. Clearly, women whose reproductive careers begin with three or more abortions are atypical. Hence, one cannot extrapolate from their experience to that of other women.\n\" Post hoc ergo propter hoc \"\nAs noted above, women who choose abortion often have an increased risk of poor pregnancy outcomes, sometimes related to the underlying reason for the abortion request. Later in life, if these women decide to have children, their increased risk of adverse pregnancy outcomes often persists. To claim that the later poor outcome, such as premature birth, was caused by the abortion is an error in logic known as post hoc ergo propter hoc , or \"after the thing therefore on account of the thing.\" That prematurity follows an abortion indicates a temporal relationship but not necessarily a causal one.\nCorn flakes as the culprit\nFor example, assume that a woman has oatmeal for breakfast every day before going to work. Prompted by a television commercial, one morning she changes her routine and has corn flakes instead. That day she is involved in a car wreck on her morning commute. What could have caused the accident, she wonders? Ah, corn flakes must have caused the wreck! That was the only feature different in her morning routine. The car wreck followed consumption of corn flakes, so the corn flakes must have caused the accident.\nDistortion by other risk factors\nPrematurity has many known risk factors (abortion not being one of them). These include minority race, multiple fetuses (e.g., twins), vaginal bleeding in pregnancy, short interval between pregnancies, history of premature birth, stress, depression, and tobacco use. Trying to examine any putative effect of abortion is made difficult by the mixing or blurring with the effects of these multiple risk factors.\nYellow fingers and heart disease\nCigarette smoking provides a simple example (Figure 1). Women with yellow finger tips have an increased risk of heart attack. Do yellow fingers cause coronary disease? No. The observed relationship is due to the distorting effect of cigarette smoking. Holding burning cigarettes between fingers is linked with yellow fingers. Smoking cigarettes is related to an increased risk of heart attack. Thus, the association between yellow fingers and heart attack is caused by the third factor in the mix: smoking.\nFigure 1\nStudying any potential relationship between abortion and prematurity is very complex because of the large number of potentially distorting factors (Figure 2). Information about these multiple other factors is usually incomplete in research studies, and trying to control for their effects becomes nearly impossible.\nFigure 2\nConclusions of medical and public health organizations\nBecause prematurity is so common and its complications so serious, the potential relationship between abortion and prematurity has been intensively and extensively studied for four decades. All major medical organizations have concluded that no causal association exists. Here is a partial listing of organizations and their assessments:\nWorld Health Organization : suction curettage abortion unrelated to prematurity\nAmerican College of Obstetricians and Gynecologists : not a risk factor for prematurity\nRoyal College of Obstetricians and Gynaecologists : \" insufficient evidence to imply causality \"\nAmerican Academy of Pediatrics : \"legal abortion results in fewer deleterious sequelae [complications] for women compared with other possible outcomes of unwanted pregnancy.\"\nCenters for Disease Control and Prevention : no mention of abortion as risk factor for prematurity\nAmerican Public Health Organization : \"...one of the most common and safest gynecologic interventions in the United States\"\nMarch of Dimes : no mention of abortion as a risk factor for prematurity\nSumming up\nWomen at increased risk of poor obstetric outcomes disproportionately choose abortion. If they later have children, their increased risk often persists, independent of the abortion. If anything, the literature supports an inverse relationship between abortion and premature births and infant deaths.\nThe question of a causal link between abortion and prematurity was resolved in medical and public health circles decades ago. Those who still cling to the discredited theory that abortion increases the risk of prematurity are either unaware of the evidence or are driven by other considerations .\nFollow David A. Grimes on Twitter: www.twitter.com/drdavidagrimes\nMore: Abortion Civil Rights Premature Birth Prevent Prematurity Medical Research Research Bias Rcog American Public Health Association Acog March of Dimes This Blogger's Books and Other Items from... Every Third Woman in America: How Legal Abortion Transformed Our Nation\nby David A. Grimes The Lancet Handbook of Essential Concepts in Clinical Research (The Lancet Handbooks)\nby Kenneth Schulz PhD MBA, David A. Grimes MD", "external_links": ["http://ecx.images-amazon.com/images/I/41m9RvLsdtL._SL160_.jpg", "http://www.cdc.gov/reproductivehealth/MaternalInfantHealth/PretermBirth.htm", "http://www.ncbi.nlm.nih.gov/pubmed/8628623", "http://www.emfs.info/research/epidemiology/confounding/", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.twitter.com/drdavidagrimes", "http://www.ncbi.nlm.nih.gov/pubmed/11812579", "http://www.ncbi.nlm.nih.gov/pubmed/22933527", "https://www.rcog.org.uk/en/guidelines-research-services/guidelines/the-care-of-women-requesting-induced-abortion/", "http://www.marchofdimes.org/research/finding-the-causes-of-prematurity.aspx", "http://rhrealitycheck.org/false-witnesses/", "http://rhrealitycheck.org/false-witnesses/#james-c-anderson", "http://www.ncbi.nlm.nih.gov/pubmed/?term=22996110", "http://www.acog.org/Patients/FAQs/Preterm-Premature-Labor-and-Birth#risk", "http://www.amazon.com/exec/obidos/ASIN/0990833607", "http://www.ncbi.nlm.nih.gov/pubmed/84162", "http://www.amazon.com/", "http://www.amazon.com/exec/obidos/ASIN/0080448666", "http://upload.wikimedia.org/wikipedia/commons/a/a8/Apple_and_Orange_-_they_do_not_compare.jpg", "http://www.apha.org/policies-and-advocacy/public-health-policy-statements/policy-database/2014/07/28/16/00/provision-of-abortion-care-by-advanced-practice-nurses-and-physician-assistants", "http://www.ncbi.nlm.nih.gov/pubmed/18177778", "http://ecx.images-amazon.com/images/I/41Z4-msoyiL._SL160_.jpg"], "published": "2015-06-11T00:42:00.000+03:00", "crawled": "2015-06-11T17:22:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}