{"organizations": [], "uuid": "d7f1cec5f9e9d4339d10ba51ccfb46c56c8e80bc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/coalpowerplant_041515getty.jpg", "site_section": "http://thehill.com/blogs/e2-wire?format=feed&type=rss", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/243722-landmark-obama-climate-rule-enters-final-review-phase", "country": "US", "title": "Obama climate rule nearly complete", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama climate rule nearly complete", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T16:43:00.000+03:00", "replies_count": 0, "uuid": "d7f1cec5f9e9d4339d10ba51ccfb46c56c8e80bc"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/243722-landmark-obama-climate-rule-enters-final-review-phase", "ord_in_thread": 0, "title": "Obama climate rule nearly complete", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama climate rule nearly complete Getty Images By Timothy Cama - 06/02/15 09:43 AM EDT \nThe Obama administration is conducting the final review of its controversial rule to limit carbon emissions from power plants. \nThe White House Office of Management and Budget (OMB) said it is putting the regulation into the final review process after receiving the text on Monday from the Environmental Protection Agency. ADVERTISEMENT The OMB review, the last process before the plan can be made final, started nearly a year to the day since the EPA publicly released the proposed rule. The timing puts the rule on track for the August unveiling that the administration has been planning for.\n“Following President Obama’s call to issue carbon pollution guidelines for the power sector, EPA has submitted the final Clean Power Plan for existing power plants to the Office of Management and Budget for interagency review,” EPA spokeswoman Liz Purchia said in a statement. “The transmittal to OMB is the next step in the agency’s routine rulemaking process.” \nSending the rule to the OMB also allows stakeholders to request meetings with the White House and EPA officials. Under an executive order, officials are obligated to meet with most groups that ask. \nThe administration has not revealed what changes, if any, will be in the final rule when compared with the proposal released in June 2014. \nThe rule has become the Obama administration's most controversial environmental regulation and promises to become a main piece of the president's legacy. \nAs proposed under the Clean Air Act, the regulation aims to slash the power sector’s carbon output 30 percent by 2030, when compared with 2005 levels. \nIt would set specific goals for each state and ask the states to write plans to comply within a year of the August release date. \nOfficials are planning to unveil the climate rule at the same time as two other contentious power plant rules: limits on carbon emissions from newly built power plants and a proposed framework for how the EPA would force compliance upon states that do not write their own plans. \nRepublicans in both chambers of Congress have proposed legislation to delay and weaken the main climate rule, and efforts to repeal it legislatively are likely to ramp up once it is made final. \nEnergy companies and states have also sued in federal court to challenge the rule. Judges in the Court of Appeals for the District of Columbia Circuit indicated in April that they were reluctant to overturn a rule before it is made final, but that problem will be moot once the complete rule is published. Tags:", "external_links": [], "published": "2015-06-02T16:43:00.000+03:00", "crawled": "2015-06-03T01:11:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}