{"organizations": [], "uuid": "eced25124c68c15d6cde67a86df61614b201b27f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/chomskynoam06112015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/244731-noam-chomsky-obama-is-an-opportunist", "country": "US", "title": "Noam Chomsky: Obama is 'an opportunist'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Noam Chomsky: Obama is 'an opportunist'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-11T23:04:00.000+03:00", "replies_count": 0, "uuid": "eced25124c68c15d6cde67a86df61614b201b27f"}, "author": "dweaver@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/news/244731-noam-chomsky-obama-is-an-opportunist", "ord_in_thread": 0, "title": "Noam Chomsky: Obama is 'an opportunist'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 11, 2015, 04:04 pm Noam Chomsky: Obama is 'an opportunist' By Mark Hensch Getty Images \nLiberal academic and author Noam Chomsky on Thursday said President Obama is “an opportunist” and Hillary Clinton would follow his lead should she win the White House next year. \n“I wrote about him before the primaries in 2008, simply using his webpage — the way he was presenting himself — and he seemed to me like an opportunist,” Chomsky said of Obama, according to WND News . ADVERTISEMENT “His portrayed idealism could not be taken seriously,” he added of the president. “The policies he was proudest of I thought were awful.”\nChomsky argued on Thursday that Clinton, Obama’s former secretary of State, would not be an improvement should she take the Oval Office in 2016. \n“[Hillary would be] maybe a little more militant,” he said when asked how Clinton compares with Obama. \nChomsky said he dislikes many of Obama’s signature policies, including his use of drone strikes overseas. \n“A principle element of the Magna Carta was the establishment of the presumption of innocence — that a person is innocent until proven guilty through due process in a trial before their peers,” Chomsky said during an interview at his Massachusetts Institute of Technology (MIT) office in Cambridge. \n“With the drone assassination campaign, Obama has essentially rescinded this principle by officially designating a person as guilty if the White House decides that they might someday want to harm us,” he said. \n“If any other country were doing this, like Iran, we would consider it justification for nuclear war,” Chomsky added. \nAnother failing, he charged, was ObamaCare. \n“What the administration regards as their major achievement, the Affordable Care Act, is a small step toward dealing with what’s, in fact, an international scandal,” he said. \n“The U.S. healthcare system is outrageous,” Chomsky said. “It has about twice the cost of comparable systems, at least per capita, and some of the worst outcomes.” \nChomsky additionally slammed Obama as having expanded the surveillance powers of the National Security Agency during his time in office. \n“The whistleblower revelations have demonstrated that the state has gone to pretty extreme levels of surveillance in the effort to control the population,” he said. “I think all of that is unconscionable.” \nChomsky also attacked fast-track trading authority for the president and the Trans-Pacific Partnership (TPP) it could help authorize. \n“It’s called a free-trade agreement, but it’s not,” Chomsky said of the potential trade agreement among 12 Pacific Rim nations. \n“We don’t have the details, because it is essentially kept secret,” he said of the potential deal. “But from all indications, it’s like all the other agreements that are not free-trade agreements.” Tags:", "external_links": [], "published": "2015-06-11T23:04:00.000+03:00", "crawled": "2015-06-12T03:58:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}