{"organizations": [], "uuid": "714cc21d4196f3dcf416f0c1391c5e0cf7761900", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/trumpdonald_030614gn.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/in-the-know/245123-trump-in-bid-asks-obama-to-try-his-golf-courses", "country": "", "title": "Trump, in bid, asks Obama to try his golf courses | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Trump, in bid, asks Obama to try his golf courses | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "714cc21d4196f3dcf416f0c1391c5e0cf7761900"}, "author": "", "url": "http://thehill.com/blogs/in-the-know/245123-trump-in-bid-asks-obama-to-try-his-golf-courses", "ord_in_thread": 0, "title": "Trump, in bid, asks Obama to try his golf courses | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 16, 2015, 12:27 pm Trump, in bid, asks Obama to try his golf courses Greg Nash \nDonald Trump is offering President Obama a backhanded invitation to hit the links at one of his golf courses. ADVERTISEMENT “Remember, ObamaCare really kicks in in 2016,” the “Celebrity Apprentice” star told the crowd, as he launched his 2016 GOP presidential bid Tuesday in New York, “Obama is going to be out playing golf. He might even be on one of my courses, I would invite him.”Trump then proceeded to plug his Trump National Golf Club, saying, despite their politics, he’d welcome the commander in chief onto the fairways, “I have the best courses in the world, so I’d say, you know what, if he wants to.”“I have one right next to the White House, right on the Potomac” the real estate mogul said of the Trump National Golf Club, which is actually in Sterling, Va., about 25 miles from 1600 Pennsylvania Ave.Trump, 69, then upped the ante on his offer to Obama, an avid golfer whose favorite pastime has been fuel for some of the president’s critics: “If he’d like to play, that’s fine. In fact, I’d love for him to leave early and play. That’d be a very good thing.”\nWhite House spokesman Josh Earnest said he would \"refrain from commenting\" on Trump's campaign launch, but he called the golf remarks \"a generous and unexpected invitation.” \n— Jordan Fabian contributed. Past: 1 day Two states win approval for... Move sends a signal to dozens of states preparing for a high-stakes court... Scalia slips, refers to Justice '... The conservative justice had a slip of the tongue in court Monday. California lawmakers don't want a... Rep. Eric Swalwell tweeted that he hopes Golden State win the championship... Senator: 'Breathtaking' how far... Sen. Bob Corker is urging Obama to walk away from a \"bad deal.\" Poll finds Sanders closing in on... Sanders trails Clinton by 12 percentage points in a new online poll of... Gun groups denounce push for... The NRA slammed a Democratic bill as an attack on the Constitution. Widespread and systemic... Under pressure from the industry, the EPA began severely limiting the... Fiorina, Clinton top 2016 rich... The presidential contenders, ranked by personal wealth. Sanders wants details on DOD... The Vermont senator and presidential candidate wants an annual update from... Clinton calls for fixes to... She also said the Supreme Court should uphold the law's subsidies. House punts on trade The GOP-led House might not vote again until the end of July. Obama making bid to diversify... Rules in the works are drawing fire from critics who cry overreach. Clinton: 'Collective amnesia'... Clinton praised former President Clinton and President Obama in an... NAACP leader who lied about being... Rachel Dolezal said in a statement that the dialogue has shifted to her \"... White House defends private Prince... The Obamas paid for the concert themselves, a spokesman says. Feds eye small nuclear reactors... Federal officials are preparing for a future in which small nuclear... CIA releases secret report... The report claims to identify blind spots at intelligence agencies before... Judd Gregg: GOP must avoid... OPINION: A conservative win at the Supreme Court would place the GOP in a... ", "external_links": [], "published": "2015-06-16T03:00:00.000+03:00", "crawled": "2015-06-17T00:08:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}