{"organizations": [], "uuid": "c1abc1a0e2730cf5c97d768316bfb6f68970733c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/17/feed", "section_title": "The Hill: Congress Blog", "url": "http://thehill.com/blogs/congress-blog/economy-budget/245337-senate-leaders-should-follow-their-instinct-and-send-agoa", "country": "US", "title": "Senate leaders should follow their instinct and send AGOA renewal to President Obama without delay", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate leaders should follow their instinct and send AGOA renewal to President Obama without delay", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-18T01:02:00.000+03:00", "replies_count": 0, "uuid": "c1abc1a0e2730cf5c97d768316bfb6f68970733c"}, "author": "jennifery@thehill.com (Rep. Karen Bass (D-Calif.))", "url": "http://thehill.com/blogs/congress-blog/economy-budget/245337-senate-leaders-should-follow-their-instinct-and-send-agoa", "ord_in_thread": 0, "title": "Senate leaders should follow their instinct and send AGOA renewal to President Obama without delay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 17, 2015, 06:02 pm Senate leaders should follow their instinct and send AGOA renewal to President Obama without delay By Rep. Karen Bass (D-Calif.) \nEarlier this year the House of Representatives and the United States Senate demonstrated the very best of bipartisanship by voting overwhelmingly for a 10-year extension of the African Growth and Opportunity Act (AGOA). These votes were the result of years of work from senators and members of the House from both sides of the aisle, the African Diplomatic Corps, African heads of state, members of African governments, the Obama Administration and countless African Diaspora who organized and spoke with a powerful voice that AGOA needed to be reauthorized. However, AGOA may be caught up in the controversy around other trade legislation that has nothing to do with AGOA. The Senate had voted overwhelmingly in April to extend AGOA, and Senate Majority Leader Mitch McConnell promised after the House followed the Senate’s lead and approved AGOA on June 11 with minor amendments that “the Senate will work expeditiously to approve it [AGOA] and send it to the president’s desk.” ADVERTISEMENT The Senate should follow its initial instinct and approve the version of AGOA that the House passed this month so it can go to President Obama for his signature in order to benefit American businesses and the American workers whose jobs rely on it. After years of work by Democrats and Republicans in the House and the Senate as well as the Administration, we are now on the brink of a seamless, long-term renewal of AGOA that will strengthen the environment for trade and investment between the United States and the nations of Africa and benefit Americans and Africans alike. AGOA is a trade preference program that helps facilitate trade and investment between the U.S. and sub-Saharan Africa. It has been characterized as “the cornerstone\" of U.S.-Africa trade engagement, and it has consistently enjoyed broad bipartisan anf bicameral support. AGOA has helped to significantly increase African exports to the United States and led to jobs both on the African continent and in the United States. This law was crucial to the United States exporting $26.8 billion worth of American products in 2013 to African nations participating in the act. According to a 2013 study by the African diplomatic core, AGOA has generated approximately 100,000 jobs in the United States and 350,000 direct jobs and 1,000,000 indirect jobs in Sub-Saharan Africa. The countries on the African continent are vitally important to the world’s economy, and they are only growing more important each year. From 2000 to 2010, six of the world’s ten fastest-growing economies were in sub-Saharan African countries. And this economic growth is buttressed by growing regional economic cooperation across Africa. Africa’s middle class has tripled in size over the last 30 years--numbering 313 million people, greater than 34% of the population in the whole continent. AGOA is set to expire this September, which-- in business terms-- is just around the corner. American businesses in the clothing industry have negotiated deals as early as a year to nine months ago. In the absence of a reauthorized AGOA, many of these deals that could have gone to countries participating in AGOA did not, leading to job losses in some of Africa’s fastest growing economies and in the United States Last year I traveled to Africa with U.S. Commerce Secretary Penny Pritzker and 20 American companies, including two California companies, on an Energy Business Development trade mission to Nigeria. Following the trade mission, we traveled to Ethiopia. In conversations with these business leaders they relayed that the one thing they needed most when considering doing business with Africa was certainty. Congress delaying AGOA right as it is about to be signed takes away such certainty. The Senate sending the final version of AGOA to President Obama without delay can be a win-win for all concerned. It will send a robust message that Democrats and Republicans can work together and finish what we started to provide quality jobs in both the United States and African nations while telling the world that America values our relationship with African nations. \nRep. Karen Bass, D-Calif., is the ranking member on the House Foreign Affairs Subcommittee on Africa, Global Health, Global Human Rights, and International Organizations Tags:", "external_links": [], "published": "2015-06-18T01:02:00.000+03:00", "crawled": "2015-06-18T04:07:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}