{"organizations": [], "uuid": "be6de35bbc65cdcdeed1ab415c24437fb12de120", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarackiran_052915getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/economy-budget/244327-why-the-house-should-deny-obama-fast-track-for-tpp", "country": "US", "title": "Why the House should deny Obama fast-track for TPP", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Why the House should deny Obama fast-track for TPP", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-09T17:00:00.000+03:00", "replies_count": 0, "uuid": "be6de35bbc65cdcdeed1ab415c24437fb12de120"}, "author": "Peter Morici", "url": "http://thehill.com/blogs/congress-blog/economy-budget/244327-why-the-house-should-deny-obama-fast-track-for-tpp", "ord_in_thread": 0, "title": "Why the House should deny Obama fast-track for TPP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 09, 2015, 10:00 am Why the House should deny Obama fast-track for TPP By Peter Morici \nThe House of Representatives should deny President Obama authority to conclude a free trade agreement with Asian nations, because it would lower wages for ordinary Americans and increase income inequality. \nThe Trans-Pacific Partnership would include South Korea, Japan, Malaysia, Chile and eight other nations. If it successfully strengthens trade ties among the twelve, China, India and several other nations may petition to join. ADVERTISEMENT Obama wants fast track authority, granted by Congress to presidents since Gerald Ford, which would require the Senate and House to vote up or down but not amend any pact he ultimately negotiates.\nFree trade agreements can create jobs and raise incomes by permitting Americans to specialize and export goods and services that require highly skilled workers and large investments in R&D—like pharmaceuticals and software. Even workers displaced by imports could find better jobs in a more robust and faster growing economy, as the latter should boost wages generally. \nThe TPP is not likely to work out that way. \nThe United States negotiated a complex bilateral deal to permit China’s entry into the World Trade Organization, but American companies like GM, GE and Microsoft still must manufacture, form joint-ventures with local companies and undertake product development in the Middle Kingdom to sell there and obtain protection for their patents. \nMuch American intellectual property still gets ripped off, but the Obama Administration has been tepid in efforts to assert U.S. rights, and the $350 billion bilateral trade deficit costs American workers at least 3 million jobs and greatly suppresses wages. \nDespite numerous multilateral and bilateral efforts and agreements, whose goals are mirrored in Obama’s promises for the TPP, the Japanese and Korean markets for automobiles and many other products remain quite difficult to penetrate thanks to private collusion and government regulations, which past trade agreements were supposed to address. A condition the Obama White House chooses to ignore. \nOver the years, China, as a matter of policy, along with South Korea and Japan, has violated WTO and International Monetary Fund rules by purposefully undervaluing its currency to accomplish competitive advantages. However, the Obama administration has refused to even formally acknowledge those governments manipulate their currencies and bring complaints at the WTO and IMF—as often urged by affected businesses. \nA national currency that trades below its fair market value, which would put domestic costs and prices on a par with costs and prices denominated in dollars, effectively grants subsidies to all exports and imposes taxes on all imports. The scope of such currency manipulation could be expected to easily wipe out the benefits American businesses may expect from the TPP by eliminating foreign tariffs and reducing other regulatory barriers to trade. \nIn the face of pleas from prominent members of Congress, such as Sen. Charles Schumer (D-N.Y.), the president has said repeatedly Asian nations won’t enter into a trade agreement if it contains a discipline on currency manipulation. \nNo wonder, look at the advantage currency manipulation affords countries that cheat on the rules already in place. \nApplying data from the World Bank, which calculates what national currencies should be worth in the U.S. dollars to have comparable purchasing power, the yuan, won and yen currently appear to be at least 50, 25 and 15 percent undervalued, respectively. And those exchange rate practices compel other Asian trading nations to follow similar policies, lest they be shut out of markets by unfairly low priced Chinese, Korean and Japanese goods—for example, India’s rupee is only about one-fourth its fair market value. \nU.S. multinationals would still profit from the TPP—they will be able to more easily move production to Asia to advantage labor and other resources made cheaper by manipulated currencies. Rich shareholders would profit and smile but ordinary working Americans would face more unfairly advantaged foreign competitors, unemployment and more downward pressure on wages. \nThe richest 10 percent would get richer, working Americans would become poorer. \nAs the president has framed the TPP negotiations, it is simply a bad deal for ordinary Americans. \nMorici is an economist and business professor at the University of Maryland, and a national columnist. He tweets @pmorici1", "external_links": [], "published": "2015-06-09T17:00:00.000+03:00", "crawled": "2015-06-09T20:21:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}