{"organizations": [], "uuid": "1b731a067d4c0eec003689262d1f9e1557974c7b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamamichelle_090412getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1157/feed", "section_title": "Healthcare", "url": "http://thehill.com/blogs/pundits-blog/healthcare/243704-michelle-obama-is-shining-a-spotlight-on-mental-illness", "country": "US", "title": "Michelle Obama shines a spotlight on mental illness", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Michelle Obama shines a spotlight on mental illness", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T14:30:00.000+03:00", "replies_count": 0, "uuid": "1b731a067d4c0eec003689262d1f9e1557974c7b"}, "author": "tsonenshine@earthlink.net (Tara Sonenshine, contributor)", "url": "http://thehill.com/blogs/pundits-blog/healthcare/243704-michelle-obama-is-shining-a-spotlight-on-mental-illness", "ord_in_thread": 0, "title": "Michelle Obama shines a spotlight on mental illness", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 02, 2015, 07:30 am Michelle Obama shines a spotlight on mental illness By Tara Sonenshine, contributor Getty Images \nLeadership, in my view, is not only about tackling issues. It is also about taking on the hardest issues. First Lady Michelle Obama is doing exactly that with her recently announced campaign about mental health. Dubbed \"The Campaign to Change Direction,\" Obama is using her unique convening power to bring together experts to raise awareness about depression, anxiety and the range of mental illnesses that plague so many Americans. ADVERTISEMENT It is not surprising that the first lady is stepping up to the plate on a sensitive subject. She took on obesity. She has driven the dialogue around the need to support our military families. Now she is speaking to 40 million Americans — roughly one in five Americans — who experience a diagnosable mental health condition. Her coalition is releasing a list of signs and symptoms of depression and opening up the conversation about the spectrum of stress-related issues.\nNot every case of depression leads to a bad outcome. But many do. Each year, more than 40,000 Americans take their own lives, and in 2013, suicide rates were highest among people ages 45 to 64, according to the Centers for Disease Control and Prevention (CDC). Last year, a CDC study that looked at 2012 U.S. mortality data found that Americans expected to live longer than ever but that the rate for suicide increased 2.4 percent. We are experiencing, as a nation, the highest rates of suicide in more than 25 years. The suicide rate is now 12.6 suicide deaths per 100,000 Americans, which is close to the rate of 12.8 in 1987. \nWhat we also know from data is that anxiety, depression and suicide are disturbingly common among young people. Shockingly, suicide is the second leading cause of death among young people in the U.S., after unintentional injury. More specifically, according to the most recent data available, suicide is the second leading cause of death among people ages 15 to 34, and the third leading cause of death among people ages 10 to 14. Although young men between the ages of 10 and 24 are taking their own lives less often than they did 20 years ago, the suicide rate among young women is slightly higher than it was in 1994. \nStress, anxiety, depression and suicidal thoughts start early in life. About 17 percent of high school students in the U.S. say that they have seriously considered suicide, and 8 percent say that they have made an attempt. Overall, at least 25 percent of children and adolescents have suicidal thoughts at some point during their lives. \nAnxiety disorders often emerge during college years. More than half of students visiting college counseling centers or clinics report anxiety as their chief problem, according to a recent national study conducted at Penn State University. The American College Health Association reports that over the past year, nearly one in six college students has a diagnosis or treatment for anxiety. \nThere is a wide spectrum from anxiety to mental illness, but most experts agree that treatment is often most effective in the early stage of distress and depression. By putting a spotlight on mental illness, the first lady is helping to remove the stigma around emotional issues. Talking about depression is less taboo when the highest woman in the country is talks about it. \nThe Campaign to Change Direction takes an important detour. It will lead all of us down a healthier road. \nSonenshine is a frequent contributor. She is former under secretary of State for public diplomacy and public affairs and a lecturer at George Washington University. Tags:", "external_links": [], "published": "2015-06-02T14:30:00.000+03:00", "crawled": "2015-06-03T04:58:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}