{"organizations": [], "uuid": "18a4c43afae8519e92e059b76ea78c724fa6948e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/clintonhillary_052715getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/243678-ex-obama-aide-clinton-must-answer-legitimate-questions", "country": "US", "title": "Ex-Obama aide: Clinton must answer 'legitimate' questions", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ex-Obama aide: Clinton must answer 'legitimate' questions", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T01:24:00.000+03:00", "replies_count": 0, "uuid": "18a4c43afae8519e92e059b76ea78c724fa6948e"}, "author": "jbyrnes@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/blog-briefing-room/news/243678-ex-obama-aide-clinton-must-answer-legitimate-questions", "ord_in_thread": 0, "title": "Ex-Obama aide: Clinton must answer 'legitimate' questions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 01, 2015, 06:24 pm Ex-Obama aide: Clinton must answer 'legitimate' questions Getty Images \nHillary Clinton will have to answer a plethora of questions relating to her time in the Obama administration and regarding her position on a key administration issue, a former top aide to President Obama said Monday. \nDan Pfeiffer said Clinton would need to personally address questions about the Clinton Foundation, any violations of an ethics agreement with the White House and her position on a pending international trade deal. ADVERTISEMENT “There's no question those are legitimate questions,” Pfeiffer, a former White House senior adviser, said in his television debut as a CNN political contributor Monday afternoon on the network's “The Lead.”\n“She's gonna have to address all of those, and a lot more, over the course of this campaign,” Pfeiffer said. “She's probably going to have to do it sooner rather than later.” \nClinton, the 2016 Democratic presidential frontrunner, has been dogged by questions over foreign donations to the Clinton Foundation, which carried strict guidelines from the White House during her time as secretary of State. \nLast week, House Minority Leader Nancy Pelosi (D-Calif.) became one of the highest-profile members of her party to field a question about donations to the Clinton Foundation, saying , “the Clintons will have to answer for the foundation.” \nPelosi made the remark when asked about a report that former President Bill Clinton only agreed to accept a charity event award after its organizers promised at least $500,000 in proceeds for the Clinton Foundation. \nLiberals have also pushed Clinton to voice a position on the Trans-Pacific Partnership, a trade deal between the U.S. and 11 Pacific Rim nations that she supported as secretary of State but that unions and liberal groups strongly oppose. \nClinton's campaign announced Monday that she will hold her first campaign rally June 13 in New York. \n“I suspect that after that, her engagement with the press is going to have to increase,” Pfeiffer said on CNN. “But if she doesn't answer those questions, that will hurt her in the long run.” Tags:", "external_links": [], "published": "2015-06-02T01:24:00.000+03:00", "crawled": "2015-06-02T02:35:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}