{"organizations": [], "uuid": "13390a8a441cfe0c71bb31abe3c08e80e7f8364f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3019840/images/o-THORKILD-TYLLESKAR-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/david-a-grimes/mandatory-waiting-periods-for-abortion-defy-the-world-health-organization_b_7476962.html", "country": "US", "title": "Mandatory Waiting Periods for Abortion Defy the World Health Organization | David A. Grimes", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "Mandatory Waiting Periods for Abortion Defy the World Health Organization | David A. Grimes", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T01:12:00.000+03:00", "replies_count": 1, "uuid": "d4201cb553bd35b4f8ee82be2b47560b28270f3d"}, "author": "David A. Grimes", "url": "http://www.huffingtonpost.com/david-a-grimes/mandatory-waiting-periods-for-abortion-defy-the-world-health-organization_b_7476962.html#post-0", "ord_in_thread": 0, "title": "Mandatory Waiting Periods for Abortion Defy the World Health Organization | David A. Grimes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "World Health Organization Headquarters, Geneva, Switzerland\nSource: Thorkild Tylleskar\nRepublicans in my home state of North Carolina are trying to triple the existing harmful 24-hour delay before having an abortion (House Bill 465). The medical evidence has been clear for decades: delays of any source in obtaining an abortion, whether administrative, legal, financial or logistical, have the same net effect: they increase the risk and cost with no benefit to the woman.\nThe most recent advice from the World Health Organization is that abortion should be provided promptly upon request. Obviously, part-time politicians in Raleigh know more about best medical practices than the World Health Organization (WHO). Based in a small European country known for its chocolates, watches and nifty knives, the WHO is apparently unaware of \" American Exceptionalism .\" Women around the world are capable of making decisions about their health without delay, except in the U.S.\nWorld Health Organization recommendations\nHere are representative WHO statements about the importance of avoiding delay in obtaining abortion:\nOnce the decision is made by the woman, abortion should be provided as soon as is possible to do so.\nConstellation of services should always involve, at a minimum:\n--abortion services without delay.\nAre delays for seeking care minimized?\n-- no mandatory waiting periods.\nThese barriers contribute to unsafe abortion because they:\n-- cause delay in access to services, which may result in denial of services due to gestational limits on the legal grounds.\nMandatory waiting periods can have the effect of delaying care, which can jeopardize women's ability to access safe, legal abortion services and demeans women as competent decision-makers.\nRepublican \"rationale\" for a 72-hour mandatory waiting period\n1. Decision rescission?\nSen. Joyce Krawiec , a Tea Party activist who led the battle in the Senate, opined:\n\"We have a three-day right of rescission when I write a contract to sell a house. We have a three-day right for refinancing your car.\"\nSen. Krawiec, a realtor , seems unclear on the concept. In both examples, a woman can sign a sales contract and refinance her car without delay. North Carolina does not mandate a three-day delay for either.\n2. Medical advice from a realtor?\nSen. Krawiec made another startling medical announcement :\n\"I have counseled many post-aborted [sic] women, and one of the most common things that I hear is, 'I didn't have time to make a decision. I was rushed.'\"\nSen. Krawiec and her husband run J&R Ventures , a real-estate development firm in Kernersville, NC. The tabs at the top of the firm's web page include Home , Properties , Current Project , Who We Are and Contact Us . \" Abortion Counseling \" has no tab (or other mention). Just how many \"pre-aborted\" women have been seeking counseling from this commercial real estate office in a town of 24,000 remains unclear.\n3. Hyperbole and hubris\nSen. Krawiec claimed the following:\n\"For almost all important decisions in our life, we have a waiting period. When you're making life-changing decisions, time is always beneficial to all of us.\"\nBeneficial indeed! How about getting married in North Carolina? Get your marriage license today and marry today . Given the high frequency of regret ( 40 percent to 50 percent of all marriages end in divorce), Sen. Krawiec should consider proposing a 72-hour delay on marriage, not abortion.\nAbortion is common\nDr. Melinda Snyder , a member of the audience at the Judiciary II Committee meeting and who has worked in a state mental hospital, defended the bill: She reported that she often sees female patients with a history of abortion. Quite a revelation! Given that one out of every three women in America has had an abortion, the same can be said of women in offices, shopping malls, airports and football stadiums. And, yes, mental hospitals.\n\"Protect every life?\"\nHouse Bill 465 has nothing to do with the health of women and everything to do with partisan politics . If the GOP were truly concerned with the health of North Carolinians, it would address real problems. Sen. Krawiec pledged that, \"I will continue to do all in my power to protect every life.\" Meanwhile, her party continues to oppose Medicaid expansion for 350,000 uninsured citizens of our state. This policy is costly: North Carolina will lose $40 billion in federal funding through 2022. This policy is cruel as well: It condemns an estimated 455 to 1145 citizens of the state to premature death every year. Their lives apparently do not merit Sen. Krawiec's protection because they are poor .\nFollow David A. Grimes on Twitter: www.twitter.com/drdavidagrimes\nMore: Abortion Civil Rights Abortion Waiting Period Republican Party World Health Organization Tea Party War on Women Medicaid Expansion This Blogger's Books and Other Items from... Every Third Woman in America: How Legal Abortion Transformed Our Nation\nby David A. Grimes The Lancet Handbook of Essential Concepts in Clinical Research (The Lancet Handbooks)\nby Kenneth Schulz PhD MBA, David A. Grimes MD", "external_links": [], "published": "2015-06-02T01:12:00.000+03:00", "crawled": "2015-06-02T03:21:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}