{"organizations": [], "uuid": "5a3228fd0bdab0f9c3897ca51f9524b07e1c66ae", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/healthcare_medicaid_022113getty.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/245890-10-states-say-obama-threatens-them-to-expand-medicaid", "country": "US", "title": "GOP states say Obama threatening them to expand Medicaid", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP states say Obama threatening them to expand Medicaid", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-24T00:08:00.000+03:00", "replies_count": 0, "uuid": "5a3228fd0bdab0f9c3897ca51f9524b07e1c66ae"}, "author": "psullivan@thehill.com (Peter Sullivan)", "url": "http://thehill.com/policy/healthcare/245890-10-states-say-obama-threatens-them-to-expand-medicaid", "ord_in_thread": 0, "title": "GOP states say Obama threatening them to expand Medicaid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP states say Obama threatening them to expand Medicaid Getty Images By Peter Sullivan - 06/23/15 05:08 PM EDT \nTen GOP state attorneys general on Tuesday wrote to congressional Republicans, asking for help reining in the Obama administration’s alleged effort to force them to expand Medicaid under ObamaCare. \nThe letter stems from a lawsuit Florida Gov. Rick Scott (R) filed against the Obama administration in April. In that lawsuit, Scott argued that the administration was trying to force his state to expand Medicaid under ObamaCare by cutting off a separate federal program, known as the Low Income Pool (LIP), that funded care for the uninsured at hospitals in the state. \nThe ten attorneys general, in a letter to House Energy and Commerce Chairman Fred Upton (R-Mich.), say they are worried that they could be threatened with the loss of similar federal funds in their states in an effort to force them to expand Medicaid, too. The Energy and Commerce Committee is holding a hearing on the issue on Wednesday. ADVERTISEMENT “We welcome assistance from Congress in reigning-in CMS [the Centers for Medicare and Medicaid Services], an agency insistent upon trampling the rights of our sovereign states to make critical policy decisions regarding Medicaid and, in terminating funding for critical health services, imperiling the lives of our most vulnerable citizens,” the attorneys general write.\nHowever, the letter does not mention that in the time since Scott filed his lawsuit in April, his fight with the administration has largely been resolved. The Obama administration did not end up cutting off all LIP funding, but offered a reduced amount that it said was consistent with the principle that LIP funds should not be used to cover costs that would otherwise be covered by Medicaid expansion. The administration said all along that the state was free to decide for itself on Medicaid expansion. \nCMS and Florida announced an “agreement in principle” on the LIP funding earlier on Tuesday. The agreement includes the administration’s earlier offer of a reduced level of $1 billion in funding next year. It also includes a provision of the budget passed by the Florida legislature this month that uses $400 million in state funds to boost Medicaid payment rates to healthcare providers, drawing down $600 million in matching federal funds and helping to fill the hole left by the reduced LIP funding. \nScott’s lawsuit will still go forward, but it will take months to wind its way through court. \nStill, the attorneys general are worried about the situation in their states, which involves similar federal funding that falls under programs known as section 1115. CMS has said that while states are free to decide on Medicaid expansion, the same principle applies in states beyond Florida, namely that LIP programs should be tailored so that they do not cover costs that would otherwise be covered by Medicaid expansion. \n“Kansas, Tennessee, and Texas face similar threats regarding their uncompensated care pools and are experiencing increasing pressure from CMS to expand Medicaid in exchange for continued funding under Section 1115,” the attorneys general write. \n“And the stakes are high. If CMS does not approve funding Texas’ LIP program, which expires in 2017, Texas stands to lose potentially hundreds of millions of dollars overtime in funding for hospitals.” \nThe states represented in the letter are Texas, Kansas, Alabama, Florida, Georgia, Idaho, Louisiana, Nebraska, South Carolina and Utah. \nWhile it says it is not threatening any separate funds, the Obama administration has been calling publicly for more states to expand Medicaid, the government health insurance program for the poor, under ObamaCare. So far, 29 states have accepted the expansion, but some Republican-led states are still holding out. Tags:", "external_links": [], "published": "2015-06-24T00:08:00.000+03:00", "crawled": "2015-06-24T02:38:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}