{"organizations": [], "uuid": "6026fd0db508eaad23d4a7d0ad210e6050adc310", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/immigration02232015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed#", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/immigration/245671-congress-needs-to-pass-immigration-reform-before-2016", "country": "US", "title": "Congress needs to pass immigration reform before 2016", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Congress needs to pass immigration reform before 2016", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-22T13:00:00.000+03:00", "replies_count": 0, "uuid": "6026fd0db508eaad23d4a7d0ad210e6050adc310"}, "author": "cstenholm@ofwlaw.com (Former Rep. Charlie Stenholm (D-Texas), contributor)", "url": "http://thehill.com/blogs/pundits-blog/immigration/245671-congress-needs-to-pass-immigration-reform-before-2016", "ord_in_thread": 0, "title": "Congress needs to pass immigration reform before 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 22, 2015, 06:00 am Congress needs to pass immigration reform before 2016 By Former Rep. Charlie Stenholm (D-Texas), contributor Getty Images \nMost of us grow up hearing about how we should practice loving our neighbors. Well, Mexico is our neighbor; maybe we should start acting a bit more neighborly! The same can equally be said of Mexico. Why do both sides spend so much political rhetoric demonizing each other? ADVERTISEMENT I live in Texas, and, like most Texans, am darn proud of it. As it stands right now, I am a minority in my state. My answer to that is: so what? I was born in Texas as a minority: a Swede! But my mother and father were Americans first and never taught me Swedish — something I sometimes now regret, although I understand how important it was for me to be accepted into \"our\" country.\nGiven that there are 11 million undocumented workers in the United States today, Congress should stop demonizing them and their homeland, and do something to address the challenge. \nA few suggestions for Congress to consider: \n1. To some members of Congress, the answer seems to be, \"Round 'em up, lock 'em up and deport 'em.\" This is not a good plan when you consider that 70 percent of the U.S. agriculture workforce is undocumented. Do you want to see food disappear from grocery shelves overnight? Me neither. \n2. There are those who believe the only way to secure our borders is to build a fence from the Gulf of Mexico to the Pacific Ocean, putting a National Guardsman every quarter mile in guard towers, 24/7. That would secure our southern border, but we would spend billions we don't have, and then we would still have our northern, eastern, and western borders. Remember the old saying, \"Good fences make good neighbors?\" Well, try building a fence in your backyard that your neighbor does not want, and see how friendly the neighborhood becomes. \n3. On that note, it wouldn't hurt to spend a little more time working with our neighbor to the south to find better ways to fight the War on Drugs, secure our border and perhaps become energy independent in North America. This would create more jobs in both countries and provide for a safer U.S. and Mexico. \n4. Isn't it rather ironic that the \"do-nothing Senate\" over the last six years was able to pass an immigration reform bill, while all the House has done is talk about it? There are too many in Congress and too many running for president who seem resigned to lip service for now, leaving immigration as a political issue for 2016. Not a good idea! Too much can happen between now and then. \n5. Why not begin by acknowledging that 90 percent of the 11 million who are undocumented are working, paying Social Security taxes (unless their employer is breaking the law) and property taxes, having families and could use a raise to improve their living conditions — just like so many others. Many do not want to become citizens of the U.S., but if they do, there should be a way they can achieve that status, commensurate with the law of the United States and their being here illegally. Maybe their penalty should be something in between the $6.5 billion in fines and no jail time that some of our bankers received for contributing to our country's biggest recession since the Great Depression. \nJust as Congress has found a way to reestablish regular order, pass a budget and show faint signs of working across the aisle, the House of Representatives should use regular order to pass an immigration reform bill before the 2016 elections. It sure beats going to the courthouse every other day, and ultimately, it would be good for our country and good for our neighbor. Talk about a win-win! \nStenholm is a former U.S. representative from Texas, serving from 1979 to 2005. He is currently a senior policy adviser at Olsson Frank Weeda Terman Matz PC. Tags:", "external_links": [], "published": "2015-06-22T13:00:00.000+03:00", "crawled": "2015-06-23T19:21:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}