{"organizations": [], "uuid": "d7c8924895f6a1375bee3b15d9de2a5838000277", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama-netanyahu-benjamin_032013getty_2_0.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/243788-obama-netanyahu-undermines-israeli-credibility", "country": "US", "title": "Obama: Netanyahu undermines Israeli credibility 'as a whole'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Netanyahu undermines Israeli credibility 'as a whole'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T22:57:00.000+03:00", "replies_count": 0, "uuid": "d7c8924895f6a1375bee3b15d9de2a5838000277"}, "author": "tlejeune@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/243788-obama-netanyahu-undermines-israeli-credibility", "ord_in_thread": 0, "title": "Obama: Netanyahu undermines Israeli credibility 'as a whole'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 02, 2015, 03:57 pm Obama: Netanyahu undermines Israeli credibility 'as a whole' By Jordan Fabian \nPresident Obama says Israeli Prime Minister Benjamin Netanyahu’s position on Palestinian statehood undermines the credibility of his country. Netanyahu has recently expressed willingness to re-enter talks with Palestinians, but Obama said his stance contains “so many caveats, so many conditions, that it is not realistic to think that those conditions would be met any time in the near future.”“The danger here is that Israel as a whole loses credibility,” Obama said in an interview with Israel’s Channel 2 TV network that aired Tuesday. ADVERTISEMENT Obama’s comments could further escalate his long-running feud with Israel’s leader over the two-state solution and the U.S.’s pursuit of a nuclear deal with Iran. Netanyahu drew the ire of the White House, when he ruled out the creation of a Palestinian state during his reelection campaign in March. He later walked back those comments. The Israeli prime minister said this week he is committed to a two-state solution, but he wants the talks to start with Israel carving out settlement territory it seeks to keep in a peace agreement. Palestinian officials have dismissed Netanyahu’s offer.\"I remain committed to the idea that the only way we can achieve a lasting peace is through the concept of two states for two peoples — a demilitarized Palestinian state that recognizes the Jewish nation state of Israel,\" Netanyahu said Sunday.But the president suggested Palestinian officials and others might not see Netanyahu as a reliable negotiating partner. “Already, the international community does not believe that Israel is serious about a two-state solution,” Obama said. “The statement the prime minister made compounded that belief that there’s not a commitment there.”The president cast doubt on the possibility of a peace agreement between Israel and the Palestinians during his presidency. “I don’t see a likelihood of a framework agreement,” he said. Following Netanyahu’s reelection, Obama suggested the United States could re-evaluate its diplomatic position toward Israel. White House officials suggested the U.S. might not defend Israel against resolutions it deems hostile at the United Nations and other international bodies. The president said that position remains unchanged. “If, in fact, there’s no prospect of an actual peace process, if nobody believes there’s a peace process, then it becomes more difficult to argue with those who are concerned about settlement construction, those who are concerned about the current situation,” Obama said. But the president fended off accusations from some in Israel that a peace deal would put the country at risk because it would cede land the Israelis see as crucial to their security to a Palestinian state. \n“I have never suggested that Israel should ever trade away its security for the prospect of peace,” he said. “I’ve never suggested that it is inappropriate for Israel to insist on any two-state solution taking into account the risks that, what appears to be a peaceful government Palestinian Authority today could turn hostile.”The president also defended the nuclear deal with Iran as the best way to prevent Teheran from acquiring a nuclear weapon. He said a military strike would do little to destroy their nuclear facilities. “A military solution will not fix it, even if the United States participates. It would temporarily slow down an Iranian nuclear program, but it will not eliminate it,\" the president said. \nDespite their frequent public disagreements, Obama suggested there is little personal animosity between him and Netanyahu. \"When I’m with Bibi, we have good conversations,\" Obama said, referring to the Israeli leader by his nickname. \"They’re tough; they’re forceful; we disagree, but I enjoy jousting with him. I do.\"", "external_links": [], "published": "2015-06-02T22:57:00.000+03:00", "crawled": "2015-06-03T05:12:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}