{"organizations": [], "uuid": "ccd2e863d42c85f461e5610328502dd7c0f27e50", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/25397/feed", "section_title": "Overnight Defense", "url": "http://thehill.com/policy/defense/overnights/244615-overnight-defense-obama-orders-more-troops-to-iraq", "country": "US", "title": "OVERNIGHT DEFENSE: Obama orders more troops to Iraq", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT DEFENSE: Obama orders more troops to Iraq", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-11T02:04:00.000+03:00", "replies_count": 0, "uuid": "ccd2e863d42c85f461e5610328502dd7c0f27e50"}, "author": "mmali@thehill.com (Kristina Wong and Martin Matishak)", "url": "http://thehill.com/policy/defense/overnights/244615-overnight-defense-obama-orders-more-troops-to-iraq", "ord_in_thread": 0, "title": "OVERNIGHT DEFENSE: Obama orders more troops to Iraq", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT DEFENSE: Obama orders more troops to Iraq By Kristina Wong and Martin Matishak - 06/10/15 07:04 PM EDT \nTHE TOPLINE: The White House announced Wednesday it will send as many as 450 more troops to Iraq to train local forces fighting the Islamic State in Iraq and Syria (ISIS), reports The Hill's Jordan Fabian. \nU.S. forces will establish a new military base in Anbar Province, a hotbed of ISIS activity, and assist Iraqis in retaking the capital of Ramadi. \nThe troops will \"train, advise, and assist\" Iraqi forces fighting ISIS, White House spokesman Josh Earnest told reporters. ADVERTISEMENT There are currently about 3,100 troops deployed to Iraq to help train military forces there.\nThe new deployment comes after Ramadi fell to ISIS last month, a major victory for the terror group that sparked questions about the administration's strategy. \nThe administration's new plans did not appear to put those concerns to rest. \n\"It's a step in the right direction, but as the president admitted the other day, he has no strategy to win,\" Speaker John Boehner (R-Ohio) said , referencing Obama's recent comments that there is not yet a \"complete strategy\" for ISIS. \nDemocratic Rep. Chris Van Hollen (Md.) said he supports the training mission, but had \"grave concern\" more troops would lead to \"mission creep.\" \nSen. Joe Manchin (D-W.Va.) a member of the Senate Armed Forces Committee, even floated the idea of dividing Iraq into three separate countries. \n\"Past results have not been very good,\" he said on MSNBC. \"Insanity is doing the same thing over and over and thinking you're going to change and have a different result.\" \nDEFENSE SPENDING FIGHT HEATS UP. The battle over Pentagon spending ratcheted up Wednesday with House Minority Leader Nancy Pelosi (D-Calif.) urging Democrats to vote against the GOP's funding bill. \n\"Once again, I am writing to underscore the urgent need for House Democrats to support the President's path to lifting the sequester by urging a 'No' vote on the Republican Defense Appropriations bill,\" Pelosi wrote in a letter. \nHouse lawmakers began consideration of the bill Wednesday, with a final vote expected by the end of the week. The White House issued a veto threat on the measure Tuesday. \n\"House Democrats' sustaining of the President's veto on unacceptably damaging appropriations bills will more forcefully bring Republicans to the table,\" Pelosi said. \nIn the Senate, Democrats are also vowing to block appropriations bills in hopes of forcing Republicans into budget talks to lift sequester spending caps. \nDemocrats and the White House oppose Republican efforts to circumvent those caps by boosting a Pentagon war fund. \nSENATE FIGHT OVER POLICY BILL: Senators continued to hammer out their version of the national defense authorization act (NDAA) on Wednesday, with the fight between Democrats and Republicans heating up. \nSenate Majority Leader Mitch McConnell (R-Ky.) accused Democrats of treating soldiers as chess pieces in the larger fight over $38 billion in additional war funding included in the bill. \n\"Democrat leaders think it's a good idea to hold brave servicemen and brave servicewomen hostage to partisan demands for more waste at the IRS and bigger congressional office budgets for themselves,\" he said from the Senate floor. \nMeanwhile, an attempt by Sen. Tom Cotton (R-Ark.) to cap the Obama administration's funds to reduce the nation's nuclear weapons stockpile was blocked. \nHis proposed amendment would have limited spending on dismantling old or obsolete nuclear weapons to $50 million per year for the next five years. \nSen. Dianne Feinstein (D-Calif.) objected to Cotton's measure. \n2016 contender Sen. Bernie Sanders (I-Vt.) also said he plans to submit an amendment to the defense policy bill that would require Congress to pay for any spending in the Pentagon's war fund with new revenues. \nHOUSE MEMBERS DEMAND ANTHRAX ANSWERS . Leaders of the House Armed Services Committee are demanding answers from the Pentagon about how the Army accidentally shipped live anthrax to 70 research facilities around the world. \n\"We need to take this where the facts lead us. Obviously there's a significant problem here and we all need to know why,\" Chairman Mac Thornberry (R-Texas) said before a closed-door session on the Pentagon's probe. \nPotential live samples of anthrax from a military lab in Utah may have been sent to 68 facilities in 19 states, Washington D.C., and four countries, including the United Kingdom. \nThornberry said the Pentagon has taken no disciplinary action yet because it is focused on \"preventative action to keep any further mishandlings from happening.\" \n\"You don't mess around with this,\" he added. \"This is serious business.\" \nSENATORS TRY TO JUMP-START ISIS DEBATE: Two senators are hoping to renew debate on authorizing the fight against ISI, reports The Hill's Jordain Carney. \nSens. Jeff Flake (R-Ariz.) and Tim Kaine (D-Va.) have proposed an authorization for the use of force (AUMF). \n\"[We're] basically trying to prod Congress to take action that we think is highly desirable and necessary,\" Kaine said Wednesday. \"It's not the beginning of the end. It might be the end of the beginning. At least we're going to take a step forward.\" \nTheir push comes as President Obama authorized the deployment of up to 450 more troops to Iraq to train local forces in the fight. \nKaine said the new deployments highlighted the need for an authorization. \n\"This is not going away anytime soon. It's not going to be short,\" he said. \"It's not going to be easy.\" \nThe U.S.-led campaign against ISIS has gone on for 10 months without a new authorization. President Obama's proposed measure found little support in Congress, with Republicans saying it limited military commanders and Democrats seeing it as too expansive. \n  \n-- GOP lawmaker says '50-50' chances he will run for Reid's Senate seat \n-- Democrat seeks to force vote on authorizing force against ISIS \n-- Giuliani: Obama's Iraq withdrawal 'worst decision' of 21st century \n-- Boehner backs Obama's Iraq deployment \n-- McConnell: Dems treating troops as chess pieces \nPlease send tips and comments to Kristina Wong, kwong@thehill.com , and Martin Matishak, mmatishak@thehill.com .", "external_links": [], "published": "2015-06-11T02:04:00.000+03:00", "crawled": "2015-06-11T07:53:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}