{"organizations": [], "uuid": "61e80eb86ca2694311be0118f43c5e58f2def258", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/civil-rights/246041-end-immigration-detention-of-lgbtq", "country": "US", "title": "End immigration detention of LGBTQ", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "End immigration detention of LGBTQ", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-25T23:30:00.000+03:00", "replies_count": 0, "uuid": "61e80eb86ca2694311be0118f43c5e58f2def258"}, "author": "Christina Fialho and Kris Hayashi", "url": "http://thehill.com/blogs/congress-blog/civil-rights/246041-end-immigration-detention-of-lgbtq", "ord_in_thread": 0, "title": "End immigration detention of LGBTQ", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 25, 2015, 04:30 pm End immigration detention of LGBTQ By Christina Fialho and Kris Hayashi \nThis week, Reps. Michael Honda (D-Calif.), Raúl Grijalva (D-Ariz.), and 30 other congressional representatives called on the federal government to end the practice of detaining vulnerable groups such as lesbian, gay, bisexual, and transgender (LGBT) immigrants. Honda and Grijalva explain in their letter on June 23, 2015, to the Department of Homeland Security that the prevalence of sexual abuse against LGBT immigrants who are in U.S. Immigration and Customs Enforcement (ICE) custody is alarming. Transgender immigrants reported 20 percent of sexual assaults in ICE custody, according to a November 2013 report from the Government Accountability Office. Community Initiatives for Visiting Immigrants in Confinement (CIVIC) and Transgender Law Center (TLC) are official endorsers of the congressional letter, and we have long argued for alternatives to detention for this vulnerable population. Trans women are especially vulnerable to abuse. We have received first-hand accounts and documented incidents in immigration detention across the country where detention facility employees have sexually humiliated trans women through forced nudity, strip searches by male guards, and showers with men. Trans immigrants are routinely denied necessary and life-saving transition-related medical care. Cruelly, some trans women are even denied bras or razors to shave their faces. ADVERTISEMENT LGBT immigrants often are held in solitary confinement, and they are told that this form of torture is for their own protection. Some GBT immigrants are transferred to the Santa Ana City Jail in California, which includes the only official “dedicated protective custody unit” for gay and transgender immigrants. “Immigration detention leaves you scars, a lot of emotional and mental scars,” explains Victoria Villalba, a transgender Latina woman who spent three and a half months at the Santa Ana City Jail and Otay Detention Facility. “We are trying to pretty much crawl so we can stand up again, emotionally and mentally.” \"Our trans communities continue to face disproportionate amounts of transphobic violence outside of detention walls,” says Isa Noyola, a Program Manager at Transgender Law Center and leader in the movement to end violence against transgender women and immigrants. “ICE and DHS is participating in this transphobic violence by not responding to the demands of the community. We are asking for the release of our trans communities housed in ICE detention centers because of how the system not only marginalizes us within their paperwork and processing but also the physical and brutal treatment from guards and other detainees.\" In recent months, makeshift GBT pods at the Otay Detention Facility, Joe Corley Detention Facility, Eloy Detention Center, and the Elizabeth Detention Center have been used with more frequency, and for the first time, LGBT immigrants may be detained at the Adelanto Detention Center starting next month. Expanding GBT pods is not the solution. According to results of a California Public Record Act request filed by CIVIC, ICE rarely if ever reached its detention capacity at the Santa Ana City Jail pod. In the last twelve months for which data is available, the average number of GBT immigrants detained in the pod was between 39 and 40 people. ICE contracts with the City of Santa Ana to maintain 64 beds in the GBT pod, but the number of people in the pod never rose above 46 people in the last twelve months. Clearly, there is no need to create a new GBT pod at the Adelanto Detention Center. Instead, ICE should be releasing these individuals and promoting alternatives to detention for all immigrants. Honda and Grijalva’s letter urges ICE to “act swiftly” and implement alternatives to detention, including community placements. The average daily cost of community-based alternatives to detention programs is $10.55, as detailed in a recent report from the U.S. Conference of Catholic Bishops and the Center for Migration Studies. On the other hand, detention costs on average $165 per person per day. According to CIVIC’s public record results, the City of Santa Ana alone received over $5.5 million in 2014 and $6.3 million in 2013 from ICE. Ending immigration detention of LGBT would not only save taxpayer dollars, but it would send a clear message to the world that the United States protects the human rights of LGBT persons.\nFialho is an attorney and the co-founder/executive director of CIVIC. Hayashi is the executive director of the Transgender Law Center.", "external_links": [], "published": "2015-06-25T23:30:00.000+03:00", "crawled": "2015-06-25T23:35:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}