{"organizations": [], "uuid": "af8f7bc527d7381f28ca77b8cb5f351b3ef5b951", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3091112/images/o-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/blog.xml", "section_title": "Women Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/bustle/9-ancient-abortion-method_b_7612760.html", "country": "US", "title": "9 Ancient Abortion Methods So Terrible You'll Be Even More Grateful For The Right To Choose | Bustle", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "9 Ancient Abortion Methods So Terrible You'll Be Even More Grateful For The Right To Choose | Bustle", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-18T23:33:00.000+03:00", "replies_count": 0, "uuid": "af8f7bc527d7381f28ca77b8cb5f351b3ef5b951"}, "author": "Bustle", "url": "http://www.huffingtonpost.com/bustle/9-ancient-abortion-method_b_7612760.html", "ord_in_thread": 0, "title": "9 Ancient Abortion Methods So Terrible You'll Be Even More Grateful For The Right To Choose | Bustle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This post originally appeared on Bustle .\nBy steps over a viper , she will be sure to miscarry,\" he advised in his Natural History -- which was presumably meant to be an accident, but may have also been a hidden piece of advice. Crow's eggs were also meant to induce miscarriage if you stepped over one. Not very effective.\n4. Jumping And Kicking Yourself In The Buttocks\nHippocrates, the famous Greek physician, was largely against abortion, but a text supposedly by him recommended a technique that became popular throughout the ages: \" jump up and down , touching her buttocks with her heels at each leap\" until the embryo became \"loose\" and fell out. This later became known as the Lacedaemonian Leap . Agitating the foetus through mild physical activity is not thought to cause abortion . Those poor women.\n5. Sitting Over A Pot Of Hot Onions\nOne very ancient method of birth control can be dated back to an 8th-century Sanskrit manuscript: sitting over a pot of boiling water or steaming onions . According to Kathleen London, author of The History Of Birth Control, this is still in use in some communities in New York's Lower East Side. This is also ineffective.\n6. Camel Saliva, Ants, And Deer Hair\nLondon also identifies a spectacularly horrible-sounding abortifacient preparation from some point in history, but not where it's from. Probably best not to know, as, according to her, the recipe included \"paste of mashed ants, foam from camels' mouths, [and] tail hairs of blacktail deer dissolved in bear fat\". This may have worked -- particularly if it were inserted into the uterus -- because it possibly would have caused a septic abortion via the introduction of infectious bacteria. Which is just as horrible and life-threatening for the woman as it sounds.\n7. Honey, Salt, And Mouse Dung Suppositories\nThe famous Greek doctor Hippocrates, or texts attributed to him, recorded a lot of abortifacients -- and, interestingly, his books also reveal that the Greeks had figured out the connection between copper and contraception that we still use today in copper IUDs. But one recipe stands out: It calls for mouse dung, honey, Egyptian salt, wild colocynth, and resin to be made into a suppository and put into the uterus. Septic abortion strikes again: the possibility for infection just skyrockets.\n(If wild colocynth doesn't ring a bell, it's a bitter desert plant with a long medicinal history -- including being recommended for curing werewolves in the 16th century -- and probably worked quite well as an early abortion drug. Why? It made you throw up so hard you'd miscarry. Not pleasant.)\n8. Opium\nThe use of opium as an abortion drug can be traced back centuries. In Contraception And Abortion From The Ancient World To The Renaissance , John Riddle points out an abortion recipe from Scribonis Largus , court doctor for the Emperor Claudius, which involves opium and a bunch of other horrific ingredients. The opium was meant to be served alongside mandrake root, Queen Anne's Lace ( a known birth control herb ), the gum resin opopanax , and various types of peppers. It would likely work, but the after-effects would not be nice.\nScibonius appeared to think he was writing down a remedy for the suffering after an abortion, but it's pretty clear that the recipe was actually to start the process, not end it. And it's still hanging around: there was a report in 2011 that women in Pakistan are resorting to opium \"bombs\" in the uterus to help unwanted pregnancy.\n9. Being Shaken Or Beaten\nGreek physicians had a range of ideas for women wishing to discontinue their pregnancies. Alongside the usual list of abortifacient herbs -- like myrrh, rue and juniper -- Soranus of Ephesus , now known as one of the first gynecological experts in history, wrote that women also induced their abortions by being \"shaken ,\" riding horses, or carrying heavy objects.\nThis was actually a tricky way out of a dilemma: the Hippocratic Oath technically prevented doctors from helping women to procure abortions, but it only mentioned the more traditional methods by name, so advising them to abort using other tactics (like being beaten) was OK. Right.\nAs a current horrific case in Texas testifies, serious body injury will indeed cause an abortion -- but just being shaken won't do it on its own.\nImages: Wikimedia Commons (1), Getty\nMore from Bustle: Yes, Men Struggle With Body Image Issues, Too: Here's My Story Is Picky Eating an Eating Disorder? Living With Selective Eating Disorder and No Vegetables Thyroid Symptoms in Women are Hard to Catch, But They Sure Messed Up My Life\nALSO ON HUFFPOST: Close  Abortion Protests Around The Nation of   FILE - In this July 12, 2013 file photo, anti-abortion rights supporter Katherine Aguilar holds a crucifix and prays while opponents and supporters of abortion rights gather in the State Capitol rotunda in Austin, Texas. Nearly three-quarters of Texas' 18 abortion facilities would be forced to close by the end of Aug. 2014 if one of the nation's toughest new anti-abortion laws is allowed to take effect, attorneys for clinics challenging the law told a federal judge Monday, Aug. 4, 2014. (AP Photo/Tamir Kalifa, File)\nDemonstrators rally against Colorado Senate Bill 175, in a protest led by Archbishop of Denver Samuel J. Aquila, on the steps of the state capitol in Denver, Tuesday April 15, 2014. The bill up for debate Tuesday is described as a guarantee that state or local policies won't interfere with reproductive decisions such as abortion and contraception. Democratic sponsors say the measure is needed to protect women's rights. (AP Photo/Brennan Linsley)\nGeorgia Sen. Donzella James, D-Atlanta, left, and Sen. Valencia Seay, D-Riverdale, right, hold up coat hangers with pictures of the Statue of Liberty attached while protesting against an abortion bill sponsored by Sen. Judson Hill, RâMarietta, rear, on the Senate floor, Monday, March 3, 2014, in Atlanta. The Georgia Senate has voted to approve a bill restricting abortion coverage in plans available through the state health insurance exchange.State senators voted 35-18 to advance the bill, which now heads to the House for consideration. The federal health care law allows states to draft legislation prohibiting abortion coverage in qualified health plans offered through an exchange. Supporters of the Georgia effort say 24 states have done so. Democrats opposed the bill, calling it a continuation of a \"war on women\" and saying it infringes on a woman's right to choose. (AP Photo/David Goldman)\nFILE - This Feb. 20, 2013 file photo shows a protester outside the Red River Valley Women's Clinic, the state's sole abortion provider, in Fargo, N.D. The clinic has entered into settlement talks on a lawsuit it filed last year against a new law that requires doctors who perform abortions to obtain hospital-admitting privileges. (AP Photo/Dave Kolpack, File)\nEllie Schilling, center, a lawyer representing Louisiana abortion clinics, speaks at a protest outside the Department of Health and Hospitals building on Tuesday, Feb. 4, 2013, in Baton Rouge, La. Abortion rights supporters say DHH issued rules that would have shut down all of the state's abortion clinics. The department rescinded the rules this week. (AP Photo/Melinda Deslatte)\nAbortion opponents gather in San Francisco's Civic Center for the \"Walk for Life\" rally and march, Saturday, Jan. 25, 2014, in San Francisco. Thousands of abortion opponents marched through downtown San Francisco for the 10th annual \"Walk for Life West Coast.\" The protesters rallied at Civic Center Plaza in front of City Hall before marching down Market Street to Justin Herman Plaza. (AP Photo/Beck Diefenbach)\nAbortion opponents from across Kansas rally outside the Statehouse, Wednesday, Jan. 22, 2014, in Topeka, Kan. Hundreds marked the anniversary of the U.S. Supreme Court decision legalizing abortion nationwide. (AP Photo/John Hanna)\nAnti-abortion demonstrators rally at the annual March for Life on the National Mall in Washington, Wednesday, Jan. 22, 2014. Thousands of anti-abortion demonstrators are gathering in Washington for an annual march to protest the Supreme Court's landmark 1973 decision that declared a constitutional right to abortion. (AP Photo/Charles Dharapak)\nPro-choice demonstrators rally outside the Supreme Court in Washington, Wednesday, Jan. 22, 2014. Thousands of abortion opponents are facing wind chills in the single digits to rally and march on Capitol Hill to protest legalized abortion, with a signal of support from Pope Francis. (AP Photo/Susan Walsh)\nFILE - In this March 25, 2013, file photo Kris Kitko, left, leads chants of protest at an abortion-rights rally at the state Capitol in Bismarck, N.D. Abortion-rights advocates filed a lawsuit in federal court June 25, 2013, in Bismarck, N.D., challenging two new North Dakota laws that impose the nation's toughest abortion restrictions. (AP Photo/James MacPherson, File)\nBOSTON - JUNE 28: Congregants from Immaculate Conception Parish in Everett, Mass. recited the rosary outside Planned Parenthood in Boston, Mass. on June 28 2014. (Photo by Wendy Maeda/The Boston Globe via Getty Images)\nFILE - This Nov. 21, 2013 file photo shows abortion support signs outside of the Jackson Women's Health Organization clinic in Jackson, Miss. A federal appeals court panel ruled Tuesday, July 29, 2014 that a Mississippi law that would close the state's only abortion clinic is unconstitutional. (AP Photo/Rogelio V. Solis, File)\nDemonstrators gather outside the Alabama Statehouse in Montgomery, Ala., Tuesday, April 2, 2013. About 100 Pro-Choice demonstrators gathered to voice their opinions to lawmakers who were gathering inside the Statehouse for the second half of the regular legislative session. (AP Photo/Dave Martin)\nAbortion-rights supporters Dina van der Zalm, right, and Allyson Junker stand on the steps of the Missouri Capitol Wednesday, Sept. 10, 2014, in Jefferson City, Mo. Missouri lawmakers are expected to consider whether to override a veto by Gov. Jay Nixon of legislation requiring a 72-hour waiting period for abortions, one of the longest mandatory delays in the nation, during a special legislative session that begins Wednesday. (AP Photo/Jeff Roberson)\nOpponents to expanded abortion rights in New York state hold signs at the Capitol on Wednesday, June 12, 2013, in Albany, N.Y. Part of Gov. Andrew Cuomo's 10-point women's rights legislation aims to codify the federal Roe v. Wade decision on abortion rights into state law. (AP Photo/Mike Groll)\nRuth Bromer, 63 of Raleigh, North Carolina (foreground) and Jennifer Hesse, 34, of Cary (center) shout slogans on the BiCentennial Plaza across from the Legislative Building as the North Carolina Senate gave its approval to a series of abortion restrictions Wednesday, July 3, 2013 in Raleigh, North Carolina. The bill, when originally introduced prohibited the recognition of foreign law, such as Islamic Sharia law, in family courts, was changed Tuesday with little public notice and the new bill titled the Family, Faith and Freedom Protection Act, added anti-abortion legislation. Senators voted 29-12 to approve House Bill 695. (Chuck Liddy/Raleigh News & Observer/MCT via Getty Images)\nThe Senate gallery is already at capacity before session starts Wednesday July 3, 2013, in Raleigh, North Carolina. House bill 695, when originally introduced prohibited the recognition of foreign law, such as Islamic Sharia law, in family courts, was changed Tuesday with little public notice and the new bill titled the Family, Faith and Freedom Protection Act, added anti-abortion legislation. Senators voted 29-12 to approve House Bill 695. (Chuck Liddy/Raleigh News & Observer/MCT via Getty Images)\n Share  Tweet  &#10006 Advertisement Share this &#10006 close Current Slide Follow Bustle on Twitter: www.twitter.com/Bustle\nMore: Abortion Birth Control Women's Health Women's Rights Reproductive Rights Health", "external_links": ["http://www.theatlantic.com/magazine/archive/1997/05/abortion-in-american-history/376851/", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731258_sq50.jpg", "http://www.ucsfhealth.org/treatments/surgical_abortion_first_trimester/", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731080_sq50.jpg", "http://www.bustle.com/articles/88626-9-ancient-abortion-methods-so-terrible-youll-be-even-more-grateful-for-the-right-to-choose?utm_source=huffpost&utm_medium=syndication&utm_campaign=mar", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731114_sq50.jpg", "http://www.usnews.com/news/articles/2015/06/03/teenage-girl-beaten-by-relatives-to-induce-abortion-police-say", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731120_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731130_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731070_sq50.jpg", "http://facts.randomhistory.com/2008/12/14_abortion.html", "http://www.twitter.com/Bustle", "https://books.google.co.uk/books?id=1vS85LtlsnIC&pg=PA105&lpg=PA105&dq=opium+as+abortion+medicine&source=bl&ots=fyPCQkieAs&sig=Z-54vJ3HxKz5LsE8_V_wRWej7DM&hl=en&sa=X&ei=rox1VZHXB4PiUcaQgMgH&ved=0CD4Q6AEwBQ#v=onepage&q=opium%20as%20abortion%20medicine&f=false", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731078_sq50.jpg", "https://books.google.co.uk/books?id=oBOwCQAAQBAJ&pg=PA291&lpg=PA291&dq=hippocrates+copper+ore&source=bl&ots=5HQkJldNbq&sig=yjxATLl8f8MAqBduReCISFS5Wrk&hl=en&sa=X&ei=pI51VbCZC8b0UOz9gsAC&ved=0CDQQ6AEwBA#v=onepage&q=hippocrates%20copper%20ore&f=false", "http://www.dailymail.co.uk/tvshowbiz/article-12540/When-crocodile-dung-contraception.html", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731180_sq50.jpg", "http://www.drugs.com/npp/pennyroyal.html", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731106_sq50.jpg", "https://en.wikipedia.org/wiki/Citrullus_colocynthis#Uses", "https://books.google.co.uk/books?id=8pXhAQAAQBAJ&pg=PA1&dq=abortion+ancient+greece&hl=en&sa=X&ei=ctR2Va_RBMH1UurqgbAE&ved=0CCoQ6AEwAA#v=onepage&q=abortion%20ancient%20greece&f=false", "http://www.dw.de/the-abortion-debate-a-womans-right-to-choose/a-6666628", "http://thinkprogress.org/health/2014/06/12/3447897/beyond-pro-choice-pro-life/", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731098_sq50.jpg", "https://books.google.co.uk/books?id=HaX733MnZZ4C&pg=PA369&lpg=PA369&dq=Lacedaemonian+Leap&source=bl&ots=MBsxsUHhOq&sig=9qfYY66UMdUnZkH40a9o0VnZL-k&hl=en&sa=X&ei=Zc52VcbKAsPsUo39gfgL&ved=0CC0Q6AEwAQ#v=onepage&q=Lacedaemonian%20Leap&f=false", "http://perseus.uchicago.edu/perseus-cgi/citequery3.pl?dbname=PerseusLatinTexts&getid=1&query=Plin.%20Nat.%2030.43", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731086_sq50.jpg", "http://www.bustle.com/articles/16676-is-picky-eating-an-eating-disorder-living-with-selective-eating-disorder-and-no-vegetables?utm_source=huffpost&utm_medium=syndication&utm_campaign=mar", "http://www.healthcentral.com/encyclopedia/408/626.html", "http://www.bustle.com/articles/16532-thyroid-symptoms-in-women-are-hard-to-catch-but-they-sure-messed-up-my-life?utm_source=huffpost&utm_medium=syndication&utm_campaign=mar", "http://www.stoa.org/diotima/anthology/wlgr/wlgr-medicine341.shtml", "http://www.plannedparenthood.org/learn/abortion/the-abortion-pill", "http://www.yale.edu/ynhti/curriculum/units/1982/6/82.06.03.x.html", "http://civilliberty.about.com/od/abortion/f/When-Did-Abortion-Begin.htm", "https://en.wikipedia.org/wiki/History_of_abortion", "http://www.botanical.com/botanical/mgmh/p/pennyr23.html", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731074_sq50.jpg", "https://en.wikipedia.org/wiki/Opopanax", "https://books.google.co.uk/books?id=1vS85LtlsnIC&pg=PA69&lpg=PA69&dq=kahun+papyrus+crocodile+dough&source=bl&ots=fyPCRijitu&sig=fX1lA_dMEZywgqrRCzfw6ifktcI&hl=en&sa=X&ei=Ycp2VYCEIoTWU9_sgegB&ved=0CCgQ6AEwAQ#v=onepage&q=kahun%20papyrus%20crocodile%20dough&f=false", "http://herbalisl.blogspot.co.uk/2009/11/queen-annes-lace-conscious-choice-for.html", "https://books.google.co.uk/books?id=Xfx1VaSIOgQC&pg=PA109&lpg=PA109&dq=galen+abortion+shake&source=bl&ots=D7dreRxYgt&sig=vBFy0JflEiEHd1al_9oYGKnVnhU&hl=en&sa=X&ei=FdN2VZX-I4T1UrOUgcgP&ved=0CC4Q6AEwAg#v=onepage&q=galen%20abortion%20shake&f=false", "http://www.bustle.com/articles/21031-yes-men-struggle-with-body-image-issues-too-heres-my-story?utm_source=huffpost&utm_medium=syndication&utm_campaign=mar", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731076_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731112_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731092_sq50.jpg", "https://en.wikipedia.org/wiki/Scribonius_Largus", "http://www.academia.edu/10297925/Abortion_in_ancient_Greece", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731084_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/390286/slide_390286_4731254_sq50.jpg", "http://www.bustle.com/authors/315-jr-thorpe", "https://books.google.co.uk/books?id=XuX-MGTZnJoC&pg=PA19&lpg=PA19&dq=ancient+chinese+abortion+mercury&source=bl&ots=bWvpB9hJBv&sig=XHzTz_Dqc-4HF-P-mWl9dBSADEw&hl=en&sa=X&ei=JdJ2VdrKCoX_UtTrgLAB&ved=0CDoQ6AEwBA#v=onepage&q=ancient%20chinese%20abortion%20mercury&f=false", "https://books.google.co.uk/books?id=2y1qghNDdBoC&printsec=frontcover&dq=history+abortion&hl=en&sa=X&ei=hXB1Vaz9LabW7Qb9voLoCw&redir_esc=y#v=onepage&q=pennyroyal&f=false", "https://en.wikipedia.org/wiki/Septic_abortion"], "published": "2015-06-18T23:33:00.000+03:00", "crawled": "2015-06-18T23:55:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}