{"organizations": [], "uuid": "41ce5911fd79e6cd8e54c9a269f53b3ea2e97840", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/gay-voices/blog.xml", "section_title": "Gay Voices Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/katie-sgarro/the-truth-about-immigrati_b_7558342.html", "country": "US", "title": "The Truth About Immigration Detention in the U.S. | Katie Sgarro", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The Truth About Immigration Detention in the U.S. | Katie Sgarro", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-11T23:34:00.000+03:00", "replies_count": 0, "uuid": "41ce5911fd79e6cd8e54c9a269f53b3ea2e97840"}, "author": "Katie Sgarro", "url": "http://www.huffingtonpost.com/katie-sgarro/the-truth-about-immigrati_b_7558342.html", "ord_in_thread": 0, "title": "The Truth About Immigration Detention in the U.S. | Katie Sgarro", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration detention centers are a nightmare for LGBTQ asylum seekers in the United States. Immigration detention is not a criminal system. Yet the ugly truth is that immigration detention centers remain largely indistinguishable from prisons. Like convicted criminals, detainees possess no freedom of movement: they too are confined behind bars, shackled, and forced to wear jumpsuits.\nWhile immigration detention is unsafe for all individuals, detention is especially dangerous for LGBTQ asylum seekers. The U.S. government recognizes LGBTQ asylum seekers may have valid claims to asylum because of persecution based on their sexual orientation or gender identity. However, the U.S. continues to house these vulnerable individuals in a fundamentally unsafe environment. LGBTQ asylum seekers face persecution in detention comparable to the very persecution they fled from (such as physical violence, sexual assault and stigma). The U.S. government continues to ignore the irony and inhumanness of incarcerating LGBTQ asylum seekers in immigration detention facilities.\nLGBTQ asylum seekers face unique challenges in immigration detention. They are frequently harassed and mistreated by homophobic and transphobic staff members and fellow detainees. Transgender detainees are almost always confined with the sex they were designated at birth (i.e. transgender women are detained with men) as opposed to with their gender identity. In addition to causing extreme psychological harm, this policy also imposes significant barriers to LGBTQ detainees applying for asylum.\nAccording to Immigration Equality, the biggest LGBTQ organization with a staff of immigration attorneys in the U.S., one of the major problems for LGBTQ asylum seekers in detention is producing evidence for their cases. Due to fundamentally unsafe conditions, LGBTQ detainees often do not want their identities disclosed to other detainees. This reality forces Immigration Equality to take creative measures to protect client confidentiality in detention settings. For example, when on the phone with clients, attorneys often resort to having clients use code words for 'gay' or 'transgender' so that other detainees within earshot do not learn of their sexual orientation or gender identity. Additionally, transgender detainees often conceal their gender identity while in detention (a transgender woman may decide to cut her hair short or wear an oversized jumpsuit to hide her body). They feel compelled to do so in order to stay safe. Unfortunately, these are the very characteristics transgender detainees might wish to present to a judge in order to effectively explain why it is so dangerous for them to return to their home country.\nU.S. Immigration and Customs Enforcement (ICE) attempts to mitigate harm to LGBTQ people by detaining them in separate housing units. These separate housing units, also known as 'GBT pods' (lesbians are not housed in them), are separate sections of detention centers that are reserved for LGBTQ-identified detainees.\nProponents of these housing units contend that they instill a sense of solidarity among LGBTQ detainees. However, in practice, this policy often has undesired outcomes, such as making LGBTQ detainees easy targets for harassment and abuse. In reality, segregated housing often places LGBTQ detainees at risk for increased isolation and stigma as well as restricts their access to the already limited resources available in detention (such as the law library and recreation facilities).\nIt is also important to note that detaining LGBTQ people in separate housing units is uncommon in the U.S. There is no formal list specifying which detention centers have these housing units but the number is estimated to be only a handful out of the U.S.'s approximately 250 immigration detention centers. Currently, there is not one facility devoted entirely to housing LGBTQ detainees.\nSegregated housing is not a solution - it is merely one method for mitigating danger to LGBTQ detainees. The most humane way to treat LGBTQ detainees remains to release them. As Immigration Equality states:\nDetention should always be a last resort for any individual. The dysfunctional detention system is particularly dangerous for LGBT immigrants. LGBT people should not be in detention, and it is fundamentally unsafe for transgender women who are thrown into male detention facilities. Simply put: The government cannot house LGBT people safely, and so it should not house them at all.\nToday, detention contracting has transformed immigration detention into a business. In addition to centers run by the federal government, detention facilities are run by private companies operating on contract as well as by local jails that rent out space to ICE. Legislators conveniently ignore the reality that the act of confining people has become intertwined with a for-profit motive: centers benefit from maintaining a steady flow of detainees. This makes it increasingly difficult to advocate for immigration reform.\nHowever, this is not a satisfactory excuse. It is time for the U.S. government to acknowledge that the nation's current immigration laws and standards do not make sense. There is a gaping chasm between the idealism inflating immigration policy and the dangerous on the ground reality endured by LGBTQ detainees locked in these facilities.\nMany of Immigration Equality's clients spend months in these treacherous institutions. However, time spent in detention varies widely and can span years. This inability to identify a likely date of release only adds to LGBTQ detainees' intense psychological distress. Currently, conditions in immigration detention facilities are so unbearable that many detainees actually choose to give up on their cases and forgo their right to seek asylum in the U.S. This results in deportation (a likely death sentence for many LGBTQ detainees).\nTherefore, it is crucial for the U.S. government to rectify this flawed system. If the purpose of immigration detention is to ensure that asylum seekers comply with the requirements of applying for asylum (such as keeping appointments), why must detainees be treated as if they are being punished for a crime? The reality is that there is no need for detainment. LGBTQ asylum seekers already have very strong incentives to show up to immigration court.\nThe U.S. remains in desperate need of immigration reform. The President and all members of Congress, regardless of political affiliation, have the authority and the responsibility to identify and eliminate the grossly unjust policies that allow for LGBTQ asylum seekers to remain trapped in immigration detention.\nLGBTQ asylum seekers leave everything - their homes, families, employment - in order to end a lifetime of persecution. They are shocked and traumatized when nearly as soon as they arrive on U.S. soil, they are thrown into immigration detention facilities that replicate the very persecution they gave up so much to escape.\nWhen will the persecution stop?\nThe information in this post is based on the expertise of Immigration Equality.\nImmigration Equality is a national organization that works to end discrimination in U.S. immigration law, to reduce the negative impact of that law on the lives of lesbian, gay, bisexual, transgender and HIV-positive people, and to help obtain asylum for those persecuted in their home country based on their sexual orientation, transgender identity or HIV-status.\nTake action today. Sign Immigration Equality's petition calling for the Department of Homeland Security (DHS) to end detaining trans immigrant women in male facilities: https://actionnetwork.org/petitions/breakthecage-stop-the-detention-deportation-of-lgbtq-immigrants/?source=ImEq\nFollow Katie Sgarro on Twitter: www.twitter.com/katiesgarro\nMore: Immigration Reform LGBT VOICES Asylum Seekers Immigration Equality", "external_links": ["http://www.twitter.com/katiesgarro", "https://actionnetwork.org/petitions/breakthecage-stop-the-detention-deportation-of-lgbtq-immigrants/?source=ImEq", "http://www.immigrationequality.org/"], "published": "2015-06-11T23:34:00.000+03:00", "crawled": "2015-06-12T01:56:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}