{"organizations": [], "uuid": "dba5d3f6716e3d74378f1bc65be14b9775010d95", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obergefellcall062615.png", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/246268-obama-calls-plaintiff-in-same-sex-marriage-case", "country": "US", "title": "Obama calls plaintiff in gay marriage case", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama calls plaintiff in gay marriage case", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-26T20:04:00.000+03:00", "replies_count": 0, "uuid": "dba5d3f6716e3d74378f1bc65be14b9775010d95"}, "author": "mmali@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/246268-obama-calls-plaintiff-in-same-sex-marriage-case", "ord_in_thread": 0, "title": "Obama calls plaintiff in gay marriage case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 26, 2015, 01:04 pm Obama calls plaintiff in gay marriage case By Mark Hensch \nPresident Obama called the plaintiff in Friday's Supreme Court case on same-sex marriage to congratulate him on the ruling in his favor. \nJim Obergefell took a call from Obama outside the Supreme Court following a landmark decision legalizing same-sex marriage nationwide. \n“I figured when I saw you we would be hoping for some good news – I just want to say congratulations,” Obama told Obergefell on the call, which was caught on a live CNN broadcast. “Your leadership on this, you know, has changed the country.\" ADVERTISEMENT “I appreciate that, Mr. President,” Obergefell responded. “It really has been an honor for me to be involved in this fight and have been able to fight for my marriage and live up to my commitments to my husband.\n“I appreciate everything you have done for the LGBT community and it is really an honor to become a part of that fight,” Obergefell added. \n“I’m really proud of you,” Obama said. “Not only have you been a great example for people, you are going to make a lasting change in this country. \n“That’s pretty rare when that happens,” he added. “I couldn’t be prouder for you and your husband. God bless you.” \nThe Supreme Court ruled on Friday that states can't prohibit same-sex marriage in a historic 5-4 decision. \nJustice Anthony Kennedy was the swing vote and authored the 34-page decision. \n“It is demeaning to lock same-sex couples out of a central institution of the nation’s society, for they too may aspire to the transcendent purposes of marriage,” he wrote. \nKennedy added that marriage is a “keystone of the nation’s social order” and that there is “no difference between same- and opposite-sex couples with respect to this principle.” \nObama praised the justices’ decision in a Rose Garden address. \n“They’ve reaffirmed that all Americans are entitled to the equal protection of the law, that all people should be treated equally,” he said. \n“Sometimes, there are days like this, when that slow, steady effort is rewarded with justice that arrives like a thunderbolt,” he added. \nObergefell was the plaintiff in the initial case over same-sex marriage, then- Obergefell v. Kasich , filed in 2013 in Cincinnati. \nIn that suit he argued that Ohio was discriminating against him and his partner John Arthur by not recognizing their out-of-state marriage. It eventually made its way to the Supreme Court along with other cases on same-sex marriage. \nArthur was terminally ill with amyotrophic lateral sclerosis (ALS) when the lawsuit was first filed. He died on October 22, 2013. \nThis story was updated at 1:19 p.m.", "external_links": [], "published": "2015-06-26T20:04:00.000+03:00", "crawled": "2015-06-26T23:30:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}