{"organizations": [], "uuid": "c5f7b0495ce49423c9159c2f4e9b02b6b3e94202", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_060815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/defense/244961-on-isis-obama-puts-tactical-cart-in-front-of-strategic-horse", "country": "US", "title": "On ISIS, Obama puts tactical cart in front of strategic horse", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "On ISIS, Obama puts tactical cart in front of strategic horse", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-15T17:00:00.000+03:00", "replies_count": 0, "uuid": "c5f7b0495ce49423c9159c2f4e9b02b6b3e94202"}, "author": "cedricleighton@mac.com (Cedric Leighton, contributor)", "url": "http://thehill.com/blogs/pundits-blog/defense/244961-on-isis-obama-puts-tactical-cart-in-front-of-strategic-horse", "ord_in_thread": 0, "title": "On ISIS, Obama puts tactical cart in front of strategic horse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 15, 2015, 10:00 am On ISIS, Obama puts tactical cart in front of strategic horse By Cedric Leighton, contributor Getty Images \nThe remarks were extraordinary for their frankness. At a press conference on June 8 at the G7 summit in Germany, President Obama spoke about Iraq and the strategy for defeating the Islamic State in Iraq and Syria (ISIS). \"We don't have a complete strategy because it requires commitments on the part of the Iraqis,\" he said. The president then mentioned that he was waiting for the Pentagon to provide him with a strategy that could be implemented. With those comments, the president officially put the tactical cart in front of the strategic horse. ADVERTISEMENT Perhaps to correct an impression of inaction, the White House and Pentagon then unveiled a plan to send 450 more U.S. trainers to Iraq using a \"lily pad\" basing concept that would bring those trainers to the Iraqi soldiers and militiamen needing the extra help — and drawing U.S. troops closer into the fight against ISIS. Many in Washington lauded this new initiative as a change in strategy. That assessment is incorrect. At best, it is a change in U.S. tactics and we ended the week still in need of an effective overarching strategy to combat the scourge that is ISIS.\nWe seem to have forgotten that strategy is about the big picture. Strategy is not about the minutiae of exactly how the Iraqi military is going to be trained. That's a tactical decision that implements a broader strategic goal. Strategy is about achieving desired end states. The quicker you achieve those desired end states, the better off you are. Lily pads are only incremental steps. \nIt's actually the president's job to outline the strategy he wants to implement. It's the Pentagon's job (and the State Department's) to tell him what needs to be done to implement his strategy. \nIf our strategic goal is still to \"degrade and defeat\" ISIS, then we need to undertake far more decisive action to achieve it. There are plenty of historical lessons to tell us what can happen when we don't act decisively. \nIn early 1862, President Lincoln was confronted with the very real prospect of the Union losing the Civil War. The same is true for the Iraqi government in Baghdad today. The current inaction has helped make the seemingly unthinkable — an ISIS encirclement, even a takeover, of Baghdad — a possibility. In Lincoln's time, a seemingly invincible South had built upon a string of victories and threatened to besiege Washington itself. In the midst of this existential threat, Lincoln convened his top generals — save one — to decide the Union's future military strategy. \nThe absent general was George McClellan, commander of the Army of the Potomac and general-in-chief of all Union armies. Although new in his commands, McClellan had already earned a reputation for slowness and indecisiveness. He could build a force and train his troops magnificently, but he seldom pressed his advantage. He believed greatly exaggerated intelligence estimates of enemy strength and seldom levied his actual numerical superiority against his Confederate foes. On that January day in 1862, a frustrated Lincoln told his generals: \"If General McClellan does not want to use the Army, I would like to borrow it for a time.\" \nObama often invokes Lincoln in his oratory. He sees himself as the heir to the Great Emancipator, but the comparison hinges on the ultimate result of the Civil War — the freeing of the slaves — and not on Lincoln's hard-fought slog to achieve that desired end state. Perhaps our current president would do well to study the hard-fought slog part of Lincoln's odyssey to inform his decisions in today's crisis-riven world. Mr. President, if you continue to play the role of McClellan, we should like to borrow our Army for a time. \nLeighton is a retired career Air Force intelligence officer and is currently chairman of Cedric Leighton International Strategies. Tags:", "external_links": [], "published": "2015-06-15T17:00:00.000+03:00", "crawled": "2015-06-15T22:19:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}