{"organizations": [], "uuid": "f3479c18f9b19d103504d6d6222eb5a611feedf1", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_060215getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/245628-obama-laments-nras-grip-on-congress", "country": "US", "title": "Obama laments NRA’s ‘grip’ on Congress", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama laments NRA’s ‘grip’ on Congress", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-20T03:49:00.000+03:00", "replies_count": 0, "uuid": "f3479c18f9b19d103504d6d6222eb5a611feedf1"}, "author": "Elliot Smilowitz", "url": "http://thehill.com/blogs/blog-briefing-room/news/245628-obama-laments-nras-grip-on-congress", "ord_in_thread": 0, "title": "Obama laments NRA’s ‘grip’ on Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 19, 2015, 08:49 pm Obama laments NRA’s ‘grip’ on Congress By Elliot Smilowitz Greg Nash President Obama lamented the power of the National Rifle Association on gun-rights issues in Congress in an interview Friday with comedian Marc Maron. In a snippet from the podcast “WTF With Marc Maron,” which will be released in full Monday, Obama said there are many steps to go before meaningful change in gun laws. “Unfortunately, the grip of the NRA on Congress is extremely strong,” he said. “I don’t foresee any legislative action being taken by this Congress.” The president went on to explain how he believes change could occur. “I don’t foresee any real action being taken until the American public feels a sufficient sense of urgency and they say to themselves, this is not normal,” he said. “If you don’t have that kind of public and voter pressure, then its not going to change from the inside.” Obama noted he’s not totally unsympathetic to those who support gun rights. “It is important for folks to understand how hunting and sportsmanship around firearms is really important to a lot of people,” he said. “It’s part of how they grew up. … It evokes all kinds of memories and traditions. I think you have to be respectful of that.” “The question is just, is there a way of accommodating that legitimate set of traditions with some common-sense stuff that prevents a 21-year-old who’s angry about something — or confused about something, or is racist, or is deranged — from going into a gun store, and suddenly he’s packing and can do enormous harm?” he asked. In a lighter topic, the president responded to Maron’s question about his favorite comedians. “[Richard] Pryor was the number one,” he said. “Dick Gregory when he was really on the edge.” Obama also gave props to Louis C.K. “He’s wonderful in such a self-deprecating but edgy kind of way. There’s a goodness about him that comes through,” he said. Past: 1 day House approves fast-track 218-208... The House took a first step toward resuscitating the White House’s trade... Trump to Stephanopoulos: 'You... “You shouldn’t be talking to me about that, in all fairness,” Trump said. New $10 bill to feature a woman Obama administration officials are seeking advice nationwide on who to... Gun owners not likely to use... A new study attempts to debunk the claim that gun owners rely on... Lindsey Graham's niece went to... \"He was quiet, strange, very unsocial,\" Graham's niece said of Dylann Roof. FBI identifies Dylann Roof, 21, as... FBI spokeswoman tells Charleston paper the suspect is from Columbia, S.C... Obama: Shooting should be wake-up... “This type of mass violence doesn’t happen in other countries,” he said. Court rules Bush officials can be... The split decision comes after more than a decade of litigation. Hillary Clinton crafts defense on... Hillary Clinton has started to formulate a strategy on one of the... Issa escorted out of Benghazi... Rep. Trey Gowdy escorted the California Republican from the closed-door... Charleston shooting suspect... Dylann Storm Roof, 21, was apprehended on Thursday morning in Shelby, N.C. New ObamaCare plan emerges in House The plan would give states the option of keeping ObamaCare subsidies. Charleston shooting suspect told... “I have to do it,” the shooter said, according to a witness account. Justice Thomas sides with liberals... The court sided with Texas after the state rejected a Confederate vanity... Nine dead in mass shooting at... \"This is an unfathomable and unspeakable act,\" Charleston's mayor said. Supreme Court sides with church in... The justices ruled 9-0 that an Arizona town's sign code violated the First... GOP lawmakers: We’re fine with... Republicans on Capitol Hill argue Trump will be a welcome addition to the... Trump paid actors to cheer his... The new contender reportedly paid extras $50 to participate in his... Carson: 'Racial based hate is... Charleston shootings are a reminder that hate is \"very much alive,\" says... Meet the ex-spy behind the... Tyler Drumheller may be called in to testify before the Benghazi panel. Issa on outside looking in on... Issa made headlines for being escorted out of a closed-door briefing. Clinton: Americans must face 'hard... Hillary called for prayer and action in response to the “horrific massacre... OPM tells lawmakers their... Members of Congress have started receiving notice from the Office of...", "external_links": [], "published": "2015-06-20T03:49:00.000+03:00", "crawled": "2015-06-20T04:07:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}