{"organizations": [], "uuid": "78c5ea7004ed232cf9bcd57a17c27ef237d6f58b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/grahamlindsey_040114getty.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/244686-graham-introduces-20-week-abortion-ban", "country": "US", "title": "Graham introduces 20-week abortion ban", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Graham introduces 20-week abortion ban", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-11T19:50:00.000+03:00", "replies_count": 0, "uuid": "78c5ea7004ed232cf9bcd57a17c27ef237d6f58b"}, "author": "psullivan@thehill.com (Peter Sullivan)", "url": "http://thehill.com/policy/healthcare/244686-graham-introduces-20-week-abortion-ban", "ord_in_thread": 0, "title": "Graham introduces 20-week abortion ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Graham introduces 20-week abortion ban Getty Images By Peter Sullivan - 06/11/15 12:50 PM EDT \nSen. Lindsey Graham (R-S.C.) on Thursday introduced a ban on abortions after 20 weeks of pregnancy, seeking to bring the bill to the Senate after it passed the House last month. \nGraham, a Republican presidential hopeful, said he wanted to spur a debate on the issue of abortion, even if the new restrictions might not get through the Senate and would not be signed by President Obama. ADVERTISEMENT “How many votes will it get, I don’t know,” he said at a press conference. “Here’s what I will predict: Over time, we will win.”\nHe challenged Democrats and opponents of the bill to “tell me the upside” of abortions after 20 weeks. \n“I hope to have a discussion in America as to when do you become who you are?” he said. “If you have a soul, when do you have it?” \nA vote for the legislation could be used against Republicans who are vulnerable in the 2016 elections. \nAsked about this potential problem, Graham replied, “Don’t get in politics if you don’t want to talk about things like this.” \nThe bill has 42 Republican co-sponsors, including Senate Majority Leader Mitch McConnell (R-Ky.) \n“He is very favorable to this bill. I think he’s a co-sponsor,” Graham said of McConnell. “And we’ll find time on the calendar. I can promise you a debate in 2015 and a vote.” \nIf the bill ever does make it into law, it has a challenging future in the courts. A federal appeals court last month struck down a similar 20-week abortion ban in Idaho for violating Supreme Court precedent protecting abortions up to the point of viability, considered to be around 24 weeks. \nAn Arizona ban was also struck down in 2013, and the Supreme Court declined to hear an appeal of that decision. \nTen states currently have 20-week abortion bans, according to the pro-abortion rights Guttmacher Institute. \nBut Graham expressed confidence a court would uphold the law. “I think science is on our side, and I think law will be on our side,” he said. \nSince Roe v. Wade in 1973, Graham said, science has advanced and can now recognize that there should be a legally compelling interest for the government to ban abortions at the point where a fetus can feel pain. \nNARAL Pro-Choice America President Ilyse Hogue accused Graham of using the bill to further his presidential bid. \n“He is choosing to use his position in the Senate to advance an abortion ban to bolster his long-shot White House bid in a shameless play to early-state ultra-conservative voters,” she said. “We have seen this playbook over and over from anti-choice Republicans up and down the ballot.” Tags:", "external_links": [], "published": "2015-06-11T19:50:00.000+03:00", "crawled": "2015-06-12T02:31:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}