{"organizations": [], "uuid": "b0190a791e746c3477276b216f6d836668054071", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/iraqusarmy_041215getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/244633-obama-pulls-us-deeper-into-iraq", "country": "US", "title": "Obama pulls US deeper into Iraq", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama pulls US deeper into Iraq", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-11T03:35:00.000+03:00", "replies_count": 0, "uuid": "b0190a791e746c3477276b216f6d836668054071"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/244633-obama-pulls-us-deeper-into-iraq", "ord_in_thread": 0, "title": "Obama pulls US deeper into Iraq", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama pulls US deeper into Iraq By Jordan Fabian - 06/10/15 08:35 PM EDT \nPresident Obama is deepening U.S. military involvement in Iraq as he searches for a “complete strategy” to train local fighters against the Islamic State in Iraq and Syria (ISIS). \nObama will send as many as 450 military personnel to train and assist Iraqi soldiers and militia forces at Taqaddum military base in eastern Anbar province, part of a broader effort to retake the provincial capital of Ramadi. ADVERTISEMENT The deployment would bring the number of U.S. troops in Iraq to 3,550, though the White House stresses that none will be fighting as “boots on the ground.” \n“These new advisers will work to build capacity of Iraqi forces, including local tribal fighters, to improve their ability to plan, lead and conduct operations,” White House spokesman Josh Earnest said. \nObama is stepping up assistance to Iraq a month after the fall of Ramadi, a major victory for ISIS that called into question the capabilities of the Iraqi forces, who apparently fled after putting up little resistance. \nCritics question whether Obama’s strategy can succeed, and several lawmakers on Wednesday appeared skeptical that the addition of new trainers would be enough to turn the tide. \nThe additional U.S. troops will not be going into the field to assist with ground combat operations or identify targets for airstrikes. Concerns also linger that sectarian strife will hinder the Iraqi government’s ability to fill the ranks of the conventional military and the Sunni militias. \nRep. Adam Smith (Wash.), the top Democrat on the House Armed Services Committee, said many Sunnis do not trust the Iraqi government led by Prime Minister Haider al-Abadi, a Shiite. \nSmith said training people who are willing to fight ISIS is “an important part of the mission,” but he does not think sending just 450 more troops “changes the equation that dramatically.” \n“My larger concern is continuing to rely on the Baghdad government as sort of the center of our fight against ISIS,” Smith told The Hill. “I know it’s not going to be easy, but we need to find Sunni allies, and I just don’t think we’re going to find many backing al-Abadi and a Shiite government in Baghdad that has done so much to push the Sunnis out.” \nHawkish Republican lawmakers scoffed at the latest deployment as a half measure and called for U.S. troops to serve in combat roles, something the White House has repeatedly ruled out. \nRep. Duncan Hunter (R-Calif.), a former Marine and Iraq War veteran, criticized the administration for “throwing people” at the problem and characterized it as an effort to make up for withdrawing U.S. forces in 2011. \nHe said special operations forces should embed with Iraqi ground troops to bolster their combat operations. \n“It’s too late, man,” he said. “They’re just trying to plug the dyke with their fingers right now.” \nThe escalation in Iraq makes it increasingly likely that American forces will be stationed there when Obama leaves the White House, an unexpected turn of events for a president who championed ending the war during his rise to power. \nEarnest would not specify a timeline for retaking Ramadi, and shifting the focus to Anbar province could delay plans to launch an offensive to retake the northern city of Mosul from ISIS. \nDemocrats, such as Rep. Chris Van Hollen (Md.), have expressed fears that increased involvement in Iraq could lead to “mission creep,” ultimately pulling the United States into another ground war. \nEarnest said a “large-scale ground combat operation inside of Iraq” is off the table, though he would not rule out adding “spotters” to help guide airstrikes in the future. \nObama announced his intention to accelerate the training and shipments of equipment and weapons to Iraqi forces on Monday during the Group of Seven summit of leading democracies in Germany. \nBut he acknowledged the U.S. and its coalition partners are concerned about the Iraqi government’s ability to recruit fighters in Anbar province, which is dominated by Sunnis. \nDefense Secretary Ashton Carter last month said the Iraqi forces who were defeated at Ramadi lacked the “will to fight.” But tribal fighters in Iraq had complained of not receiving any training or equipment from the central government. \nThe White House hopes that opening a training facility in their backyard will spur recruitment and boost morale. U.S. officials said 3,000 positions in the Iraqi security forces in Anbar could be opened by removing deserters off the rolls. \n“We are hoping to get more of those Sunni tribes invested in the fight against ISIL to have a greater recruiting base for the effort against ISIL in Anbar province,” said deputy national security adviser Ben Rhodes, using an alternate acronym for the group. The U.S. wants to ensure “the people who have the most at stake in this part of Iraq are fully invested in this effort.” \nU.S. personnel have trained more than 9,000 Iraqi troops and an additional 3,000 are currently in training, according to the White House. \nKristina Wong and Martin Matishak contributed. Tags:", "external_links": [], "published": "2015-06-11T03:35:00.000+03:00", "crawled": "2015-06-11T04:20:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}