{"organizations": [], "uuid": "f1af810bb448c79fe250291d6bfad43023bfa42f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obama_042315getty.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed#", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/finance/243689-granting-obama-fast-track-authority-reinforces-bad-behavior", "country": "US", "title": "Granting Obama fast-track authority reinforces bad behavior", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Granting Obama fast-track authority reinforces bad behavior", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T13:00:00.000+03:00", "replies_count": 0, "uuid": "f1af810bb448c79fe250291d6bfad43023bfa42f"}, "author": "neil@hilltopadvocacy.com (Neil Siefring, contributor)", "url": "http://thehill.com/blogs/pundits-blog/finance/243689-granting-obama-fast-track-authority-reinforces-bad-behavior", "ord_in_thread": 0, "title": "Granting Obama fast-track authority reinforces bad behavior", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 02, 2015, 06:00 am Granting Obama fast-track authority reinforces bad behavior By Neil Siefring, contributor Getty Images \nGranting President Obama trade promotion authority (TPA) as the Senate has, and the House may, is a poor idea. It reinforces bad behavior — the president's continued unchecked circumvention of the Constitution — and perpetuates the erosion of Congress' autonomy and self-respect by facilitating the president's issues with constitutional authority. ADVERTISEMENT Free trade is good for the American economy, helps grow jobs and increases our gross domestic product. But giving trade promotion authority to Obama, who has flouted the Constitution, would harm the legislative branch's credibility and our system of government. That potential damage outweighs the benefits of passing TPA now. After all, we know what Obama can do with executive actions and prosecutorial discretion.\nTPA would let the president negotiate trade agreements and have Congress consider legislation to enter into these trade agreements \" under expedited legislative procedures .\" There are legal obligations the president would have to meet when negotiating trade deals. TPA isn't on paper a blank check to let the president do anything he wants in trade negotiations, like the blank check Speaker John Boehner (R-Ohio) and then-Senate Majority Leader Harry Reid (D-Nev.) gave Obama on the debt ceiling last year. \nTPA power has been granted by Congress to presidents since 1974. Authority for TPA expired in 2007 (Obama was able to finish some free trade deals since the negotiations had started before the authority expired). Obama hopes to have the legislation granting TPA done for him to conclude the Trans-Pacific Partnership (TPP) trade deal with a number of countries in the Pacific region. The current legislation to reauthorize TPA passed the Senate 62-37 , and is on its way to the House for consideration. \nIf TPA becomes law, each chamber will have little input before an up-or-down vote on passage of presidentially negotiated trade deals. The House and Senate won't be able to debate and vote on amendments in their respective chambers. \nIt is unlikely that members of the House or Senate will vote down a trade agreement if TPA becomes law. They would face incredible pressure not to turn down a deal that proponents say will increase jobs in the United States. Few politicians are willing to face that kind of withering attack to preserve the integrity of the House and the Senate in the face of repeated presidential overreach. \nAs Rep. Paul Ryan (R-Wis.), chairman of the powerful House Ways and Means Committee and an advocate of TPA, has explained , the TPA legislation has specific objectives that the president has to follow, and creates congressional advisory groups \" to oversee the talks and receive regular briefings ,\" and the president must give to Congress a plan about how he would implement a proposed trade agreement if Congress approves it. \nUnder TPA, the administration will also have to consult with members of Congress about trade negotiations and meet with members of Congress about them. Consultation by the administration with Congress would be an entirely new venture for an administration that has ignored and sidelined Congress for years. The historical record provides no evidence to support the belief that Obama would honor the letter, let alone the spirit, of these requirements. \nRyan went on to explain, in an op-ed he co-authored in The Wall Street Journal with Sen. Ted Cruz (R-Texas), that trade promotion authority will help Congress hold the president accountable to arrive at good trade deals. With this president, we run the risk that he will circumnavigate TPA to pursue global trade deals that don't quite meet TPA requirements. Policymakers in Congress must learn and apply the lessons of six years of Obama's use of prosecutorial discretion, executive orders, executive actions and signing statements to understand that he will not respect Congress. \nWhen Obama issued his illegal order on executive amnesty in November of last year, Boehner explained that \"[y]ou can't ask the elected representatives of the people to trust you to enforce the law if you're constantly demonstrating that you can't be trusted to enforce the law.\" The Speaker is correct, as is his lawsuit against the president for executive overreach on ObamaCare — and the lawsuit by 26 states against his November constitutional surprise on illegal immigration. \nTPA is an important tool to help improve the American economy after six years of poor performance under Obama's failed policies. But this has to be weighed against degrading the health of our constitutional form of government by giving TPA authority to a president acknowledged by many to operate in an extraconstitutional fashion. TPP would result in increased trade with a group of nations which accounts for almost 40 percent of the world's gross domestic product . But granting TPA now to get to TPP would represent a loss of congressional self-respect that would difficult to measure. \nCongress should wait two years and then revisit TPA. Free trade matters tremendously and can help our ailing economy. But the Constitution and rule of law matter even more. \nSiefring is president of Hilltop Advocacy, LLC and a former Republican House staffer. Follow him on Twitter @NeilSiefring . Tags:", "external_links": [], "published": "2015-06-02T13:00:00.000+03:00", "crawled": "2015-06-03T06:10:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}