{"organizations": [], "uuid": "8da7c4927425b52908d9c507463e511f7f311b23", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/abortionprotests_032015getty.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/244424-appeals-court-upholds-texas-abortion-restrictions", "country": "US", "title": "Appeals court upholds Texas abortion limits", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Appeals court upholds Texas abortion limits", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-09T20:53:00.000+03:00", "replies_count": 0, "uuid": "8da7c4927425b52908d9c507463e511f7f311b23"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/244424-appeals-court-upholds-texas-abortion-restrictions", "ord_in_thread": 0, "title": "Appeals court upholds Texas abortion limits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Appeals court upholds Texas abortion limits Getty Images By Sarah Ferris - 06/09/15 01:53 PM EDT A federal appeals court on Tuesday upheld major pieces of Texas’s controversial abortion law, delivering another win for the state’s conservative leaders. The 5th Circuit Court of Appeals ruled that two of the law’s requirements — that abortion providers must seek admitting privileges to nearby hospitals and that facilities must be upgraded to meet the standards of an outpatient surgical center — can go into effect for all but one facility. ADVERTISEMENT “In plain terms, H.B. 2 and its provisions may be applied throughout Texas,” the 5th Circuit Court wrote about the law. In the 50-page decision, the judges said it was “disingenuous” for the plaintiffs to claim that they couldn’t previously challenge the requirements because it hadn’t seen the precise regulations. \nThe Center for Reproductive Rights, which represented the plaintiffs in the case, condemned the ruling, warning that it would put “all but seven abortion clinics” in Texas at risk of closing. \n“Not since before Roe v. Wade has a law or court decision had the potential to devastate access to reproductive health care on such a sweeping scale,” Nancy Northup, president and CEO of the Center for Reproductive Rights, wrote in a statement. The Texas legislation, which was first passed in 2013, has been subject to intense legal scrutiny. It is considered one of the toughest laws against abortion currently on the books and made headlines after then-state Sen. Wendy Davis staged a 13-hour filibuster against it. \nThe 5th Circuit's decision — which could still be appealed to the Supreme Court — could have implications for dozens of other states that have recently tightened abortion laws. \nFive states require doctors who perform abortions to have admitting privileges to local hospitals, according to the Guttmacher Institute . \nA total of 22 states require abortion facilities to meet standards for \"ambulatory surgical centers\" — a rule that has been repeatedly condemned by reproductive rights groups who argue that abortion is a \"procedure\" not a \"surgery.\" \nMore than a dozen abortion clinics in Texas have closed because their doctors do not have admitting privileges at local hospitals. \nAmericans United for Life, which filed an amicus brief in the case, cheered Tuesday's decision as a step toward \"safeguarding maternal health and protecting women from substandard abortion facilities and practices.\" \n“Texas has struck a decisive blow for women’s health and safety against a predatory abortion industry,” Dr. Charmaine Yoest, the group's president and CEO, wrote in a statement. \nThe 5th Circuit panel — which has already voted to uphold pieces of the Texas abortion law — has been described by the ABA Journal as the “most divisive, controversial and conservative appeals court.” Out of 15 appointees, six were appointed by the George W. Bush administration.", "external_links": [], "published": "2015-06-09T20:53:00.000+03:00", "crawled": "2015-06-10T00:32:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}