{"organizations": [], "uuid": "7771c68c1a9917c364b151d889b764f795f59ba3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/243822-obama-hits-local-tv-to-sell-wavering-democrats-on-trade", "country": "US", "title": "Obama hits local TV to sell wavering Democrats on trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama hits local TV to sell wavering Democrats on trade", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-03T01:10:00.000+03:00", "replies_count": 0, "uuid": "7771c68c1a9917c364b151d889b764f795f59ba3"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/finance/243822-obama-hits-local-tv-to-sell-wavering-democrats-on-trade", "ord_in_thread": 0, "title": "Obama hits local TV to sell wavering Democrats on trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama hits local TV to sell wavering Democrats on trade By Jordan Fabian - 06/02/15 06:10 PM EDT \nPresident Obama will try to sway House Democrats into supporting trade legislation with a series of local TV interviews that will air in their districts. The plan is for the president to bring his case for new trade deals directly to the voters of members who are on the fence about trade promotion authority (TPA) legislation. \nObama on Wednesday will sit down with local anchors from San Diego, Sacramento, Seattle, Dallas and El Paso. ADVERTISEMENT The latter is the hometown of Rep. Beto O’Rourke (D-Texas), who is undecided on the fast-track trade legislation that could be voted on in the House this month. Obama will “talk about how trade legislation would benefit the economy of the communities where they broadcast” White House press secretary Josh Earnest said. The White House will also release data showing how free-trade deals would help boost job growth and exports in each metro area where Obama's interviews air.The interviews are part of the White House’s broader strategy to rally Democratic vote s to pass the fast-track bill.The measure is critical to advancing a sweeping 12-nation trade agreement with Pacific Rim nations, which is at the top of Obama’s second-term agenda.But it faces an uphill climb in the House, where Republicans are skeptical of granting Obama trade powers and liberal Democrats are fiercely opposed, fearing new trade deals could ship American jobs overseas. Earnest said Obama has told undecided members he can provide political cover against attacks from labor unions and liberal groups if they side with him and vote for the trade bill.“He’ll stand with the Democrats who stand with him,” the spokesman said.The White House’s pledge comes as labor groups, most notably the AFL-CIO, have ramped up pressure on Democrats to oppose the fast-track bill ahead of the 2016 elections. The labor coalition last week launched an ad campaign against Rep. Ami Bera (Calif.), a swing-district Democrat from the Sacramento area who came out in support of the measure.\nEarnest said Obama “there is ample data” showing Obama has significant influence among Democratic voters. “Having the strong support of the most popular figure in Democratic politics for your reelection, I think most Democrats are going to find beneficial to their congressional campaigns,” he said. \n- Updated at 8:03 p.m. Paul joins crusade to expose... The Bush administration blacked out 28 pages extracted from a... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-03T01:10:00.000+03:00", "crawled": "2015-06-03T09:39:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}