{"organizations": [], "uuid": "bb26ae53049b7854847dd8ef5956fe44716e0643", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/245138-we-see-what-obama-does-yet-none-dare-call-it-treason", "country": "US", "title": "We see what Obama does yet ‘none dare call it treason’", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "We see what Obama does yet ‘none dare call it treason’", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-17T13:00:00.000+03:00", "replies_count": 0, "uuid": "bb26ae53049b7854847dd8ef5956fe44716e0643"}, "author": "USMC Lt. Col. James G. Zumwalt (ret.)", "url": "http://thehill.com/blogs/congress-blog/245138-we-see-what-obama-does-yet-none-dare-call-it-treason", "ord_in_thread": 0, "title": "We see what Obama does yet ‘none dare call it treason’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 17, 2015, 06:00 am We see what Obama does yet ‘none dare call it treason’ By USMC Lt. Col. James G. Zumwalt (ret.) \nFor those of us born and raised in the U.S., we tend to be less cognizant about what has made America the great nation it is. We tend to lose sight of the “glue” that has held us together for so long and which now seems to be losing its adhesive quality. \nThe insights of foreign visitors who have resided in the U.S. long enough to appreciate this nation’s greatness can sometimes be most revealing. ADVERTISEMENT An online video shares just such an insight. A Harvard business professor relates a conversation he had with a Marxist economist Fulbright scholar from China, having asked him if there was anything unexpected he learned about America. \nWithout hesitation, the scholar said he had no idea how critical religion is to the functioning of a democracy. As told by the professor, the scholar explained democracy works “not because the government was designed to oversee what everybody does, but rather democracy works because most people most of the time voluntarily choose to obey the law…Americans follow these rules because they were not just accountable to society; they were accountable to God.” \nThe professor then offered his concern that, “as religion loses its influence over the lives of Americans, what will happen to our democracy? Where are the institutions that are going to teach the next generation of Americans that they too must voluntarily choose to obey the law? Because if you take away religion, you can’t hire enough police.” \nAs a republic, America has always been a nation of laws. And, as this Chinese scholar recognized, religion has been the glue holding it all together, voluntarily causing us to adhere to those laws for the common good. \nThough the originator is still debated, the late 18 th /early 19 th century Scottish historian Alexander Tytler most likely conceived of the “Fatal Sequence” concept, describing the process by which democracies are born, thrive but ultimately die. \nTytler surmised democracies cannot survive much longer than two centuries as voters discover “they can vote themselves generous gifts from the public treasury” resulting in a majority that “always votes for the candidates who promise the most benefits.” \nIn the end, Tytler predicted, the “loose fiscal policy” of voters continually fed at the public trough would prove democracy’s downfall. \nAt the bottom of a pyramid, the Sequence starts with “bondage,” which gives rise to “spiritual faith” which, in turn, gives rise to “great courage,” which begets “liberty,” and, at the pyramid’s peak, results in “abundance.” But then a downward slide takes place with “abundance” yielding to “selfishness,” which gives way to “complacency,” continuing down to “apathy,” followed by “dependency” and, ultimately, returning back to “bondage.” \nTytler cited the Christian religion as the seed from which democracy first begins to blossom. \nWith religion becoming less and less of a factor in the life of the average American, it is clear our country is on the down side of the Fatal Sequence. \nSuffering from a sense of entitlement, we reject the religion that originally put us on the path to abundance in favor of a religion centering on self. \nFifty years ago, Baptist minister John Stormer wrote “None Dare Call It Treason”—a book in which he sought to awaken Americans to the threat of communism both inside and outside our borders. He believed one’s faith to be a critical factor in defeating any such threat. \nThe message in Stormer’s book was a clarion call to action for Americans to become more involved in what our government does. He cautioned against relying upon a left-leaning media, citing its earlier assurances to Americans before the Cuban government fell in 1959 that Fidel Castro was “an agrarian reformer” and not a communist. Stormer’s call was ultimately heard by millions as his book became the best selling political paperback of all time. \nJust as a nation of people practicing their Christian religion empowered them to rise up and defeat Soviet communism, so too should Americans today embrace a spiritual revival to confront the numerous challenges placing us on the downside of the Fatal Sequence. \nSuch a revival is particularly challenging as we are led by a President whose own spiritual compass is questionable. Astonishingly, this President suggests ours is not a Christian nation. And, at a time Christians are under attack in parts of the world unlike ever before, he does nothing to assist them. Meanwhile, he aggressively speaks out to protect those adhering to a religion, in Islam, that seeks world domination—an outcome only possible through Christianity’s destruction. \nThe title for Stormer’s book emanated from a quote by the late 16th/early 17 th century English writer Sir John Harrington, “Treason doth never prosper, what’s the reason? For if it prosper, none dare call it treason.” \nCould President Obama’s actions, ushering America down the Fatal Sequence path, be succeeding because “none dare call it treason?” \nZumwalt is a retired Marine infantry officer who served in the Vietnam war, the U.S. invasion of Panama and the first Gulf war.", "external_links": [], "published": "2015-06-17T13:00:00.000+03:00", "crawled": "2015-06-17T14:00:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}