{"organizations": [], "uuid": "7db633964321d4d75084dd02c40edb52a6be4ead", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3058118/images/o-GREG-ABBOTT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/blog.xml", "section_title": "Women Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/miranda-blue/the-texas-abortion-decision_b_7554986.html", "country": "US", "title": "The Texas Abortion Decision and the Right's 'Women's Health' Gambit | Miranda Blue", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The Texas Abortion Decision and the Right's 'Women's Health' Gambit | Miranda Blue", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-10T22:19:00.000+03:00", "replies_count": 0, "uuid": "7db633964321d4d75084dd02c40edb52a6be4ead"}, "author": "Miranda Blue", "url": "http://www.huffingtonpost.com/miranda-blue/the-texas-abortion-decision_b_7554986.html", "ord_in_thread": 0, "title": "The Texas Abortion Decision and the Right's 'Women's Health' Gambit | Miranda Blue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Last month, Wisconsin Gov. Scott Walker met with a group of social conservative leaders in Washington in an attempt to sell them on his presidential candidacy. One issue that came up was a campaign ad Walker ran last year touting a bill he had signed requiring abortion providers to obtain \"admitting privileges\" from nearby hospitals and mandating that a woman seeking an abortion first undergo an ultrasound. In the ad, Walker hardly sounds like an anti-choice crusader: He says that the measures he signed \"increase safety and provide more information for a woman considering her options,\" but ultimately leave \"the final decision to a woman and her doctor.\"\nMarjorie Dannenfelser, head of the anti-choice group Susan B. Anthony List, was at the meeting with Walker. She told the Weekly Standard that the governor had set her at ease about the ad, explaining \"that using the language of the other side to support our own position is a good thing.\" Dannenfelser approved, telling another reporter, \"To the extent that we use the other side's rhetoric to undermine their positions, we're better off.\"\nWalker wouldn't have needed to sell Dannenfelser on this idea. In fact, using \"the other side's rhetoric to undermine their positions\" is a core part of the anti-choice movement's strategy to chip away at abortion rights by passing bills like Walker's that make it more difficult and more expensive to obtain abortion care - all in the name of \"women's health.\"\nThis strategy achieved a huge victory yesterday when a three-judge panel on the Fifth Circuit Court of Appeals upheld a Texas law that threatens to regulate all but a few of the state's abortion providers out of existence. The decision is bad for Texas women: If the law takes effect, it could close more than half of the state's abortion clinics . But it also threatens abortion rights for women throughout the country. In the likely event that the Supreme Court considers the Texas case, Whole Woman's Health v. Cole , it will have the opportunity to further undermine Roe v. Wade by maintaining the legal right to abortion while enabling states to render that right meaningless.\nThis -- closing abortion clinics while chipping away at Roe in the courts -- is the goal of legislation like that in Texas. But, of course, Republican leaders aren't mentioning in this in their praise of the Fifth Circuit's decision. Instead, Attorney General Ken Paxton reacted to the ruling by calling it \"a victory for life and women's health\" and Gov. Greg Abbot called it \"a vindication of the careful deliberation by the Texas legislature to craft a law to protect the health and safety of Texas women.\" Both are doing exactly what Dannenfelser would like them to do -- using the rhetoric of \"women's health\" to promote positions that undermine abortion rights.\nThis strategy is hardly a secret. Ever since the Supreme Court in Planned Parenthood v. Casey upheld the core abortion protection of Roe but gave states the latitude to impose abortion restrictions that do not put what the court called an \"undue burden\" on women, anti-choice groups have been seeking to push the limits as far as they will go. \"Women's health\" rhetoric is a key part of this strategy. The anti-choice legal group Americans United for Life (AUL) offers model bills to state legislators with titles like the \"Abortion Patients' Enhanced Safety Act,\" which suggests restrictions similar to those imposed in Texas. (AUL says it worked with Texas legislators to draft the bill .) In fact, a district court judge striking down part of Texas' law last year called out the law's proponents for attempting to hide its true purpose.\nAUL has even taken to claiming that it is fighting \"back-alley\" abortions, using a term synonymous with the dangerous world of illegal abortions before Roe to justify its attacks on legal abortion providers. They claim that laws like that in Texas will shut down unscrupulous providers like Philadelphia's notorious Kermit Gosnell . What they don't say is that every safe clinic they shut down creates an opening for criminals like Gosnell and could even lead desperate women to attempt abortions on themselves, like the woman in Georgia who was arrested for murder this week after trying to terminate her own pregnancy.\nWhat these self-proclaimed \"women's health\" advocates want is a return to a world where no woman can access safe and legal abortion. But in the meantime, they'll settle for eliminating access for those who don't have the means to afford it. Yesterday's decision in Texas puts them one more step along the way.\nFollow Miranda Blue on Twitter: www.twitter.com/bluemir\nMore: Civil Rights Abortion Reproductive Rights Roe v. Wade Whole Women's Health v. Cole", "external_links": ["http://www.rightwingwatch.org/content/scott-walker-tells-anti-choice-leaders-he-didnt-mean-what-he-said-about-abortion-being-betwe", "http://www.salon.com/2013/04/12/there_is_no_gosnell_coverup/", "http://www.aul.org/2015/06/5th-circuit-protects-womens-health-with-ruling-holding-texas-abortionists-to-real-medical-standards/", "http://www.pfaw.org/rww-in-focus/chipping-away-choice-five-growing-threats-women-s-healthcare-access-and-autonomy", "http://www.youtube.com/watch?v=PyHAZVPEiL4", "http://www.dallasnews.com/news/state/headlines/20150609-federal-court-ruling-could-close-half-of-texas-abortion-clinics.ece", "http://www.csmonitor.com/USA/Justice/2015/0609/Ruling-on-Texas-abortion-law-sets-up-potential-Supreme-Court-showdown-video", "http://thinkprogress.org/justice/2014/08/29/3477589/a-federal-judge-just-called-out-the-big-lie-behind-texass-latest-abortion-restriction/", "http://www.aul.org/defending-life-2015/", "http://www.thedailybeast.com/articles/2015/05/20/can-scott-walker-convert-the-christian-right.html", "http://www.nytimes.com/2015/06/10/us/court-upholds-texas-law-criticized-as-blocking-access-to-abortions.html?_r=0", "https://www.weeklystandard.com/blogs/scott-walker-woos-conservative-leaders-private-meeting-capitol-hill_950856.html", "http://www.twitter.com/bluemir", "http://www.slate.com/blogs/the_slatest/2015/06/09/georgia_woman_charged_with_murder_for_taking_abortion_pill.html5", "http://thinkprogress.org/justice/2013/12/04/2919111/supreme-court-roe-wade-exists/", "https://www.guttmacher.org/pubs/tgr/06/1/gr060108.html"], "published": "2015-06-10T22:19:00.000+03:00", "crawled": "2015-06-11T00:05:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}