{"organizations": [], "uuid": "38e313190cc138ee2771aae1fb57c3d77704b782", "thread": {"site_full": "radio.foxnews.com", "main_image": "http://radio.foxnews.com/wp-content/uploads/2015/06/ROBETSOBAMA.jpg", "site_section": "http://radio.foxnews.com/feed/rss/", "section_title": "FOX News Radio", "url": "http://radio.foxnews.com/2015/06/25/did-scotus-save-obama-or-republicans-spoiler-alert-republicans/", "country": "IL", "title": "DID SCOTUS SAVE OBAMA? OR REPUBLICANS? (SPOILER ALERT: REPUBLICANS)", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "DID SCOTUS SAVE OBAMA? OR REPUBLICANS? (SPOILER ALERT: REPUBLICANS)", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-25T18:35:00.000+03:00", "replies_count": 0, "uuid": "38e313190cc138ee2771aae1fb57c3d77704b782"}, "author": "John Gibson", "url": "http://radio.foxnews.com/2015/06/25/did-scotus-save-obama-or-republicans-spoiler-alert-republicans/", "ord_in_thread": 0, "title": "DID SCOTUS SAVE OBAMA? OR REPUBLICANS? (SPOILER ALERT: REPUBLICANS)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Whew! Seriously. Who Would Want To Try To Fix This Thing? \nby John Gibson \nFollow on Twitter , Facebook , listen free/live on foxnewsradio app \nFace it. SCOTUS saved Republicans from having to save millions of people who would have lost health care subsidies had the Supreme Court of The United States rendered the opposite decision on Obamacare today. \nSure, President Obama is busy thumping his chest, and bragging that the law has been saved, and privately (I’m sure) high-fiving about his ability to bully the Supreme Court. But I also think he is cursing the lost opportunity to bash Republicans and the Court had the Health Care subsidies been cancelled. \nObama and the Libs like to brag about all the people who have health care insurance who didn’t have it before. They tend to ignore the many millions more whose health care insurance is vastly more expensive and clearly inferior coverage. There has to be winners and losers under Obamacare, and the way its supporters see it the losers just have to be losers and get used to it. \nBut the losers get to vote. And that fact, coupled with polls which show the law is still very unpopular, virtually screams that Obamacare will be a good Republican issue in the 2016 election, and will be not much for Hillary and her Libs. Eat your spinach is not going to be a good campaign message to the millions who suffer from Obamacare. Those people know how much more they are paying and know how little they are getting in return. The fact that a smaller number of millions has something at the expense of others is cold comfort. \nHad the decision gone the other way, Republicans would be on the spot to fix it so that millions wouldn’t lose their subsidies. That was always going to be a huge problem. Messy, Ugly. Not good for Republicans. \nSo they have been saved. And they are breathing a sigh of relief.", "external_links": [], "published": "2015-06-25T18:35:00.000+03:00", "crawled": "2015-06-25T19:31:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}