{"organizations": [], "uuid": "852afe57e3f4c036840047eb088bf03f5f86ba14", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/iftar06172015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed", "section_title": "The Hill: International Policy", "url": "http://thehill.com/blogs/ballot-box/245338-obama-wishes-muslims-a-happy-ramadan", "country": "US", "title": "Obama wishes Muslims a happy Ramadan", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama wishes Muslims a happy Ramadan", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-18T01:03:00.000+03:00", "replies_count": 0, "uuid": "852afe57e3f4c036840047eb088bf03f5f86ba14"}, "author": "tlejeune@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/ballot-box/245338-obama-wishes-muslims-a-happy-ramadan", "ord_in_thread": 0, "title": "Obama wishes Muslims a happy Ramadan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 17, 2015, 06:03 pm Obama wishes Muslims a happy Ramadan By Jordan Fabian Getty Images \nPresident Obama marked the beginning of the Muslim holy month of Ramadan on Wednesday, offering his “warmest greetings” to those celebrating in the United States and abroad. \n“Muslims honor each day of Ramadan as a day of patient endurance through fasting, and each night as a night of gratitude through prayers,” Obama said in a statement. “It is a time to reinforce faith, compassion and forgiveness, and perseverance through adversity.” ADVERTISEMENT The president added that during Ramadan, “Muslims around the globe reach out to assist those afflicted by conflict, hunger, poverty and disease,” a nod to the violent conflict raging in the Middle East.\nThe advance of the Islamic State in Iraq and Syria and the Syrian civil war have forced millions of people from their homes. A Global Peace Index report found a third of the world’s refugees come from those two countries, according to The Atlantic . \nA U.S.-led coalition is fighting the group, assisting Iraqi ground forces with training, equipment and airstrikes. The Obama administration has also pledged more than $400 million in aid to displaced Iraqis since last year. \nObama said he will welcome American Muslims to the White House for an annual iftar dinner at the conclusion of the holy month. \n“Here in the United States, American Muslims join their fellow citizens to serve the less fortunate, hosting inter-faith activities that build understanding and remind us that we stand together as one American family,” the president said. “The diversity and patriotism of America’s religious communities give strength to all of us, and our freedom to worship reminds us of the values we share.”", "external_links": [], "published": "2015-06-18T01:03:00.000+03:00", "crawled": "2015-06-18T02:42:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}