{"organizations": [], "uuid": "8be9991dd2c080611fea1f58ec7634ccc90ce8cc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/alaska_arctic_040404getty.jpg", "site_section": "http://arcticfocus.com/feed/", "section_title": "Arctic Focus", "url": "http://thehill.com/policy/energy-environment/245125-gop-dems-blast-obama-on-arctic-drilling", "country": "US", "title": "Obama takes heat from both parties on Arctic drilling regulations – The Hill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama takes heat from both parties on Arctic drilling regulations – The Hill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-16T20:06:00.000+03:00", "replies_count": 0, "uuid": "8be9991dd2c080611fea1f58ec7634ccc90ce8cc"}, "author": "arctic - Google News", "url": "http://thehill.com/policy/energy-environment/245125-gop-dems-blast-obama-on-arctic-drilling", "ord_in_thread": 0, "title": "Obama takes heat from both parties on Arctic drilling regulations – The Hill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama takes heat from both parties on Arctic drilling regulations Getty Images By Timothy Cama - 06/16/15 12:39 PM EDT \nThe Obama administration fielded heavy criticism from both the right and the left Tuesday over its policies on oil and natural gas drilling in the Arctic Ocean. \nIn a House hearing, Republicans accused President Obama of trying to stifle development with unattainable rules and restrictions. Democrats, on the other hand, said the president is going out of his way to allow unsafe exploration. ADVERTISEMENT The Interior Department’s regulations for offshore drilling in the Arctic, proposed earlier this year, were a main focus of the hearing, along with a report from the industry-backed National Petroleum Council that called for more Arctic drilling.\n“We have an Arctic rule published by the Department of the Interior — largely prescriptive in nature — that could significantly slow exploration and development and possibly curtail industry interest in future offshore lease sales that are currently scheduled,” Rep. Doug Lamborn, chairman of the House Natural Resources subcommittee with jurisdiction over offshore drilling, said at the hearing. \n“The rule, which was published just weeks before the final release of the NPC study, does not take into account many of the well-thought-out conclusions of the study — the most striking being that most of the U.S. Arctic offshore oil and gas potential could be developed today using existing, field proven technology,” he continued. \nThe controversial rule includes requirements that a driller have a rig in the Arctic ready to make a relief well in the case of a blowout. It also restricts the drilling season to avoid ice and requires Arctic-specific plans. \nRep. Don Young (R-Alaska) accused the administration of “hysteria” with its Arctic rules. \n“The problem I have is, I believe the administration has a ‘mother may I’ approach. I don’t think that really will work,” he said. \nYoung asked Brian Salerno, director of Interior’s Bureau of Safety and Environmental Enforcement, if he had considered the low pressure in the Arctic Ocean when developing the rule, since the risk of well blowouts is lower. \n“I’ve heard the word blowout, blowout, blowout,” he said. “It will not happen at that pressure.” \n“We do agree that the risk is low,” Salerno responded. “But it’s not zero.” \nWhile Democrats welcomed the rule, they criticized the approval last month of Royal Dutch Shell’s exploratory drilling permit, less than three years after its last error-prone attempt. \nThey also criticized drillers who said the rules are too strict. \n“The majority points out that there are so-called barriers to development in the Arctic,” said Rep. Alan Lowenthal (D-Calif.), the top Democrat on the panel. \n“But I don’t see it. Instead, it seems to me that the administration is supporting Arctic development, and I think that’s a mistake.” \nHe said the United States should set an international example and declare that the Arctic is too fragile for drilling. \n“But unfortunately, the administration continues to move forward with the plans to allow additional onshore and offshore drilling in the Arctic,” he said. “The oil and gas industry should be exceptionally grateful for this opportunity that they’re being given, that even after Shell’s failure of three years ago, they are being given the chance to try to drill again.” \nSalerno focused mostly on the proposed rules, and said that they are reasonable, given the particular weather, remoteness and other concerns in the Arctic. \n“The proposed rule is intended to provide the clarity needed to pursue these resources safely,” he said. \n“In our view, these requirements are necessary to provide the assurance that drilling can be managed safely, and that emergencies can be effectively addressed.” \nWhile Shell will not be subject to the rules for its planned drilling this summer, the Interior Department has put similar requirements on Shell’s drilling approval. Tags:", "external_links": [], "published": "2015-06-16T20:06:00.000+03:00", "crawled": "2015-06-16T22:26:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}