{"organizations": [], "uuid": "98c2a6c5d0c4780ce24ad45de594713279ebae57", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2738322/images/o-SEX-TRAFFICKING-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/religion/blog.xml", "section_title": "Religion Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/rev-dr-nancy-wilson/rape-incest-health-risksa_b_7537994.html", "country": "US", "title": "Rape, Incest, Health Risk -- Safe Abortions Are a Must! | Rev. Dr. Nancy Wilson", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Rape, Incest, Health Risk -- Safe Abortions Are a Must! | Rev. Dr. Nancy Wilson", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-10T23:16:00.000+03:00", "replies_count": 0, "uuid": "98c2a6c5d0c4780ce24ad45de594713279ebae57"}, "author": "Rev. Dr. Nancy Wilson", "url": "http://www.huffingtonpost.com/rev-dr-nancy-wilson/rape-incest-health-risksa_b_7537994.html", "ord_in_thread": 0, "title": "Rape, Incest, Health Risk -- Safe Abortions Are a Must! | Rev. Dr. Nancy Wilson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shoulder to shoulder, religious and civic leaders took a stand in our nation's capital to make funding available across the world for women and girls who need safe abortions. Whether pregnant from rape as a weapon of war, trafficked for sex, victims of incest, or facing health issues from a problem pregnancy, women who need safe abortions often do not receive the medical services they need because of a United States policy from the Nixon era, sponsored by arch conservative, Jesse Helms.\nThe Center for Health and Gender Equity and the Religious Coalition for Reproductive Choice convened Christian, Muslim, and Jewish leaders to urge President Obama to act. Last year, I was among many religious leaders and women's advocates who signed a letter to President Obama stating that the way policies are being implemented is \"immoral.\" Leaders in the White House could have taken action to protect women around the world--but they did not.\nIt is time for politicians to stop using the bodies of women and girls as chips in a game of global domination. Many lives depend on it. In 1973, Roe v. Wade gave women the right to safe abortions and stopped criminalizing women's reproductive health needs in the United States. Frustrated U.S. conservative politicians and religious leaders wasted no time before they targeted women around the world with the Helms amendment.\nEnacted by Congress in 1973, just months after Roe v. Wade, the Helms amendment tied U.S. foreign aid to blocking funding for specific, reproductive services. The Helms amendment states that no funds can be used for the \"performance of abortion as a method of family planning\" or to \"motivate or coerce any person to practice abortions.\" The amendment struck fear in the hearts of international partners, and many health care clinics for women fell into shambles because programs were reduced or eliminated to overcompensate for U.S. colonial demands for control over reproduction.\nInterpretations of the Helms amendment that create sweeping blocks to reproductive services must be rejected as shards of broken and harmful practices. Until we do, women, girls, and their families are hostages in a cynical game of global politics. It is time to open our eyes to the falsehoods of the Helms amendment. Abortions are not a \"method of family planning,\" birth control methods are. Medical practitioners are not forced to \"practice abortions,\" they are trained as reproductive health providers.\nSweeping bans on abortion funding have victimized women and girls around the world for too many years. In the United States, federal funding supports safe abortions from rape, incest, for the woman's life and health. The effective ban on reproductive services for women in other countries impacts poor women of color is war zones the most. It is the worst kind of ugly colonialism and victimization.\nI am the Rev. Dr. Nancy Wilson, global leader of Metropolitan Community Churches. I know about victimization. Many of our church members around the world are subjected to laws and discriminatory practices that cost them their lives, their jobs, and their families because they are lesbian, gay, bisexual, transgender, intersex, queer, or supportive allies. I know about victimization because I see how mass incarceration of Black and Hispanic brothers and sisters dehumanizes all of us.\nI know about victimization because I am a witness to the millions of women and children trafficked across all boarders for the sex industry without any reproductive health care whatsoever. They are abducted, sold, and raped. Their pimps and owners subject them to multiple, unsafe abortions.\nOne professional in the anti-trafficking field told me, \"It is an essential part of the restoration of a trafficking victim to have full access to reproductive health care choices, including contraception and abortion. These women may no longer be able to carry a healthy pregnancy to term because of what they have been through. The health risks for these women, in terms of pregnancy, are very high.\"\nGuttmacher Institute says, \"...imposing abortion bans does not stop nor necessarily even lower abortion rates.... Rather, the major impact of criminalizing abortion is to force women to undergo unsafe and clandestine procedures to terminate their unwanted pregnancies, which results in death and disability.\"\nWe call on President Obama and his administration to use all means to provide the full range of reproductive health care needed by women, girls, and their families throughout the world. Don't let broken policy practices continue to harm the health of women.\nFollow Rev. Dr. Nancy Wilson on Twitter: www.twitter.com/RevNancyWilson\nMore: Safe Abortions Helms Amendment Jesse Helms Rev. Dr. Nancy Wilson Sex Trafficking Rape as Weapon of War Center for Health and Gender Equity Religious Coalition for Reproductive Choice Roe v Wade Guttmacher Institute Outing the Bible: Queer Folks, God, Jesus, and the Christian Scriptures\nby Rev. Dr. Nancy Wilson Outing the Church: 40 Years in the Queer Christian Movement\nby Rev. Dr. Nancy Wilson", "external_links": ["http://ecx.images-amazon.com/images/I/51qUwNcLzGL._SL160_.jpg", "http://www.amazon.com/exec/obidos/ASIN/0989493903", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.amazon.com/exec/obidos/ASIN/0971929696", "http://www.amazon.com/", "http://ecx.images-amazon.com/images/I/51iynbJcg4L._SL160_.jpg", "http://www.twitter.com/RevNancyWilson"], "published": "2015-06-10T23:16:00.000+03:00", "crawled": "2015-06-11T00:39:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}