{"organizations": [], "uuid": "e0713162fd456a44810ce35b495f8fbb66ba0cc0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/netanyahubenjamin_obamabarack_093013getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/245816-ex-israeli-ambassador-obama-intentionally-drove-wedge-between", "country": "US", "title": "Ex-Israeli ambassador: Obama drove wedge between countries", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ex-Israeli ambassador: Obama drove wedge between countries", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-23T17:22:00.000+03:00", "replies_count": 0, "uuid": "e0713162fd456a44810ce35b495f8fbb66ba0cc0"}, "author": "bkamisar@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/blog-briefing-room/news/245816-ex-israeli-ambassador-obama-intentionally-drove-wedge-between", "ord_in_thread": 0, "title": "Ex-Israeli ambassador: Obama drove wedge between countries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 23, 2015, 10:22 am Ex-Israeli ambassador: Obama drove wedge between countries Getty Images \nA former Israeli ambassador to the U.S. is accusing President Obama of intentionally driving a wedge between the two nations and warns against the president's push for a nuclear deal with Iran. \nFormer Ambassador Michael Oren said he timed the release of his new book, Ally: My Journey Across the American-Israeli Divide to raise questions about the negotiations days before their deadline. ADVERTISEMENT \"This book comes out now for a reason,\" he said on MSNBC's \"Morning Joe.\" \"I wanted this book to come out now precisely because of the Iranian issue because the essence of trust is what this is all about.\"\nOren said Israel made some mistakes that damaged U.S. ties, including announcing a new settlement during Vice President Biden's trip to the country in 2010. But he characterized Israel's conduct as well-meaning, a contrast to his view of the Obama administration. \n\"What I distinguished, and is an important distinction, are mistakes that are made honestly, perhaps sometimes unintelligently and prudently, and mistakes that are made as a matter of policy,\" Oren said. \n\"The president said openly that he was going to put daylight between Israel and the United States. Which means in the past, where we had disagreements with Clinton, with Bush, we tended to try to keep them behind closed doors. These were put out front,\" he added. \nOren questioned the burgeoning deal with Iran over its nuclear programs, with negotiators left with just one week to iron out the final language to the framework they adopted earlier this year. \nHe said that too many are framing the deal as a \"binary notion\" between the current deal and no deal at all. Oren encouraged Americans and Israelis to punt on the current deal's language and force leaders to seek better terms where \"Iran changes its behavior\" and reduces its ability to develop nuclear weapons even further. \nHe criticized the international negotiators for giving Iran too many concessions in fear of the nation walking away. \n\"If I were an Iranian negotiator, I wouldn’t sign it either because the Iranians have learned over the years that the longer they wait, the better the deal they get,\" he said. \nWhite House press secretary Josh Earnest dismissed Oren's criticism during a Monday news briefing. \n\"I think in the case of Ambassador Oren, I think it's pretty clear we're just talking about another politician trying to sell books,\" he said. \n\"I'm not particularly concerned about that.\" \nOren also repeated his opposition to Prime Minister Benjamin Netanyahu's speech to the House in March, which came at the request of Republican congressional leaders who didn't run the visit by the White House. The administration at the time slammed the visit as a political move, and a number of Democratic lawmakers boycotted it. \n— This story was updated at 11:53 a.m.", "external_links": [], "published": "2015-06-23T17:22:00.000+03:00", "crawled": "2015-06-24T03:27:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}