{"organizations": [], "uuid": "e59e57228edbddc8316c4e5350f5f2c5add8db2c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3043658/images/o-ISIS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/blog.xml", "section_title": "WorldPost Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/michael-brenner/obama-rolls-the-dice-in-_b_7587134.html", "country": "US", "title": "Obama Rolls the Dice in Iraq -- Sort of | Michael Brenner", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Rolls the Dice in Iraq -- Sort of | Michael Brenner", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-15T21:11:00.000+03:00", "replies_count": 0, "uuid": "e59e57228edbddc8316c4e5350f5f2c5add8db2c"}, "author": "Michael Brenner", "url": "http://www.huffingtonpost.com/michael-brenner/obama-rolls-the-dice-in-_b_7587134.html", "ord_in_thread": 0, "title": "Obama Rolls the Dice in Iraq -- Sort of | Michael Brenner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama's decision to launch a major new training cum advising project in Iraq to be augmented by up to 1,000 more American troops is revealing of how his administration's thinking about Iraq/ISIL/Syria is oriented. Clearly, there remains no coherent strategy; clearly, the incongruities and contradictions among of the various bits and pieces of policy also remain unresolved. There are a few valuable insights to be garnered from this latest move, nonetheless.\n1. Washington still is wedded to the idea that it can push back ISIL in Iraq without the cooperation of the Shi'ite militias. They receive no mention in the new-old plan. All the stress is placed on expanded recruiting and training for the Iraqi National Army and the arming of those Sunni tribal militias ready to fight ISIL. There are hints that Washington is considering by-passing the Iraqi government to arm the tribes directly although it publicly pledges not to. In addition, it intends to build a new base for operations in Anbar province despite the current low utilization rate for existing bases. Due emphasis is placed on airpower but no explanation is given for the minimal use of airstrikes to date.\n2. By implication, Obama et al see the objective of containing Iranian influence in Iraq as on a par with the aim of stymying ISIL. This interlocks with its fostering of the Saudi-Israeli conception of the Middle East's big strategic picture and corresponds with blanket support for the bombing of the Houthis in Yemen. In other words, the increase in influence of any Shi'ite group anywhere in the region is to be resisted. Whether Washington shares this view wholly, or is caught in the mind warp of giving precedence to placating Riyadh and Jerusalem on expedient grounds (themselves not clear), makes little practical difference since either interpretation leads to the same policy outcomes.\n3. Much of Washington's foreign policy Establishment never has abandoned the aspiration to \"win\" in Iraq. In today's context, that means exercising more influence in Baghdad than does Iran, keeping in power a US-friendly leadership, and maintaining a network of bases manned by between 10,000-20,000 American troops supplemented by highly placed advisers in the INA and Defense Ministry\n4. This was the picture envisaged back in 2008 when the SOFA (Status Of Forces Agreement) was being negotiated with al-Maliki. Its rejection caught us by surprise as al-Maliki used the ploy of asking a recalcitrant parliament for permission to exempt American personnel from Iraqi law while knowing full well that they would reject it. Obama backed fully the goal of a strong residual American presence in Iraq, and withdrew US forces at the end of 2011 only because he legally had no choice\n5. Locating the new base in Anbar province between insurgent held Ramadi and Falluja conforms to this scheme. For that location makes sense only if the American troops there foresaw some kind of combat role. Training, in theory, could occur anywhere in the country. The new advisers will be stationed at Taqaddum, an Iraqi base near the city of Habbaniya. It will supplement the American teams operating at another nearby Anbar location, al-Asad. This large air base already is in a vulnerable position being surrounded by ISIL controlled territory.\n6. General Martin Dempsey, chairman of the Joint Chiefs of Staff, now has made explicit what was only implied in the original announcement. Dempsey delineated a strategy that entails a string of what he called \"lily pads\" -- American military bases around the country designed to fragment and weaken ISIL forces. \"You could see one in the corridor from Baghdad to Tikrit to Kirkuk to Mosul.\" General Dempsey acknowledged that such sites would require many more troops than those already authorized.\n7. This deployment mode increases the already high likelihood that the American forces soon will shooting and being shot. The most compelling argument for this shift to combat activities is the imperative to defend American lives. Let us recall that this was the original justification for the initial air strikes to protect American citizens threatened by ISIL near Kirkuk last summer -- and the intense reaction to the beheading of James Foley\n8. Such an arrangement, if viable in terms of Iraqi politics, means an open-ended American presence in Iraq engaged in an open-ended counter insurgency against ISIL. The Pentagon speaks of putting off a campaign to recapture Mosul until 2016; Raqqah in 2017? General Dempsey gave the game away in admitting that if the \"game changers\" don't come from the Iraqi government, Washington will \"have to look for other avenues....and other partners.\" Shi'ite militias seem to be ruled out. The only other available partner to the US Army is the US Marine Corps. Back to the future.\n9. A number of things could derail this plan: the continued ineptitude of the INA; pressure on Prime Minister al-Abadi from those associated with and in political alliance with the Shi'ite militias and their Iranian backers; pressure from Tehran; a coup by shi'ite hard-liners. The latter will not accept a return to American domination of Mesopotamia lying down\n10. This path parallels the one Obama has taken in Afghanistan almost exactly. There, all American combat troops were supposed to be gone by the end of 2014 (there was a formal ceremony on the White House lawn in December marking that phantom milestone). But: that date has been pushed back indefinitely, the mission has been redefined to include combat support and most recently Special Forces combat missions, goals are obscure, no measures of success have been stipulated, and \"progress\" is non-existent.\n11. As to Syria, Obama's reflections have yet to yield a strategy that links it to Iraq. It should be pretty obvious that a prominent variable in the long war against ISIL in Iraq is its strength next door in Syria. That does not appear obvious to the White House's deep thinkers. Within Syria, the administration looks to being slowly buying into that other Saudi-Israeli fictional narrative, i.e. that al-Nusra/Army of Conquest is a different sort of beast from ISIL. That means giving a silent benediction to the former's lending its indirect and indirect support and welcoming the ultimate collapse of the Assad regime. The repercussions from that across the region do not seem to have gotten a hard look -- at least, there is no sign as to how Obama would handle that eventuality as registered in Iraq and elsewhere. Meanwhile, the slow-motion training of \"moderate\" Syrian opposition forces in Jordan proceeds at a snail's pace -- a mute recognition that Syria's post-Assad future will feature a power struggle between ISIL and al-Nusra.\n12. Turkey: Post- election, the big open question insofar as American interests are concerned is what the election results mean for Turkey's role vis a vis ISIL and \"The Army of Conquest\" - aka al-Nusra & Assoc. Perusal of \"expert\" commentaries reveals a vague consensus that Erdogan's dreams are now just vain fantasies. Can we accept that facile conclusion, though? Erdogan personally seems to have invested so much of himself in the project to Ottomanize Syria, and seems to be so seriously unbalanced, that he likely will do all within his still considerable power to achieve his ambition. His self-aggrandizing plans abroad, indeed, may take on greater urgency in light of his domestic plans foundering. And doesn't the high degree of control that he has established over Turkey's security agencies and bureaucracies leave him in a position to prolong support for the Islamists he's been backing regardless of political changes in Ankara (short of a second election producing an opposition government).\nAs to al-Nusra specifically, moreover, he is in a partnership with Saudi Arabia and the Gulfies - a partnership that has received some sort of approval from Obama. So he has substantial support and political coverage on that front and little disincentive to draw back. As to ISIL, since we know so little about the extent and modalities of Turkey's connivance with them, it is much harder to assess the implications of the election. Still, circumstantial logic suggests caution before judging that much will change.\nThe Obama White House is on a path to nowhere in a maze with no outlet. Timing and sequence of its various disconnected moves matter little.\nMore: Iraq Islamic State", "external_links": [], "published": "2015-06-15T21:11:00.000+03:00", "crawled": "2015-06-15T20:29:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}