{"organizations": [], "uuid": "c2f2facf1b8e3d2216916a7b64406bef7be16580", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaaddress0606.png", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/blogs/blog-briefing-room/news/244198-obama-vows-to-keep-fighting-for-undocumented-immigrants", "country": "US", "title": "Obama vows to keep fighting for undocumented immigrants", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama vows to keep fighting for undocumented immigrants", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-06T13:00:00.000+03:00", "replies_count": 0, "uuid": "c2f2facf1b8e3d2216916a7b64406bef7be16580"}, "author": "Rebecca Shabad", "url": "http://thehill.com/blogs/blog-briefing-room/news/244198-obama-vows-to-keep-fighting-for-undocumented-immigrants", "ord_in_thread": 0, "title": "Obama vows to keep fighting for undocumented immigrants", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 06, 2015, 06:00 am Obama vows to keep fighting for undocumented immigrants President Obama vowed Saturday to keep fighting for undocumented immigrants despite actions by Republicans and some judges to derail his executive orders. “I’m going to keep doing everything I can to make our immigration system more just and more fair,” Obama said in his weekly address Saturday, marking Immigrant Heritage Month. Obama said he took action last November to provide more resources for border security and to modernize the legal immigration system to bring illegal immigrants “out of the shadows.” ADVERTISEMENT “Some folks are still fighting against these actions,” he said. “I’m going to keep fighting for them. Because the law is on our side. It’s the right thing to do. And it will make America stronger.” Obama ridiculed House Republican leaders for refusing to allow a vote on a Senate-passed immigration bill from 2013. “For nearly two years, Republican leaders in the House have refused to even allow a vote on it,” he said. The president invited the members of the public to share their or their families’ stories of immigration on the White House website. Obama recounted how his mother’s side of the family was originally from England, Ireland and other countries. “Of course, we can’t just celebrate this heritage, we have to defend it – by fixing our broken immigration system,” he said. Late last month, a federal appeals court panel refused to lift a Texas judge’s injunction that prevents Obama’s immigration plan from being implemented. Obama's orders would defer deportations for as many as five million people who are in the United States illegally. The Justice Department said it plans to appeal the decision in early July. When a Texas judge initially blocked the executive actions in February, congressional Republicans were also waging their own campaign against Obama’s plan on Capitol Hill. They tied his executive actions to a bill funding the Department of Homeland Security. The GOP, however, gave up on the fight just hours before a possible partial government shutdown. Tags: Past: 1 day Republicans wield power of the... A bill to fund the Justice Department is the latest front in the battle... Boehner: We don't have votes yet... \"I don't think we're quite there yet,\" the Speaker said. GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-06T13:00:00.000+03:00", "crawled": "2015-06-06T13:52:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}