{"organizations": [], "uuid": "f2aed8f0b5126f94e004c3eb957a2f4aa047feea", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/denver/blog.xml", "section_title": "Denver Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/jason-salzman/coffmans-smoke-and-mirror_b_7512700.html?utm_hp_ref=denver&ir=Denver", "country": "US", "title": "Coffman's Smoke and Mirrors on Immigration Reform", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Coffman's Smoke and Mirrors on Immigration Reform", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-04T20:46:00.000+03:00", "replies_count": 0, "uuid": "f2aed8f0b5126f94e004c3eb957a2f4aa047feea"}, "author": "Jason Salzman", "url": "http://www.huffingtonpost.com/jason-salzman/coffmans-smoke-and-mirror_b_7512700.html?utm_hp_ref=denver&ir=Denver", "ord_in_thread": 0, "title": "Coffman's Smoke and Mirrors on Immigration Reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nIn response to my recent post urging reporters to spotlight Mike Coffman's weak advocacy for immigration reform , Coffman's spokesman Tyler Sandberg told me via Twitter that \"Google is Your Friend,\" and directed me to an instance when Coffman said he was \"deeply disappointed\" with House opposition to a resolution allowing young immigrants to gain citizenship via military service. \nGoogle is my friend, and it confirms my larger point that Coffman does little to promote immigration reform besides create the appearance of seriousness without the much substance at all. \nCoffman has expressed disappointment, yes, but he hasn't seriously challenged Boehner, who's arguably been the biggest obstacle to immigration reform in the country. \nWhere was Coffman's disappointment when the Senate's bipartisan immigration legislation, with Marco Rubio's name on it, died in the House. Coffman didn't even support a vote on the bipartisan and comprehensive bill, despite Coffman's public statements in favor of comprehensive immigration reform. \nAnd what did he do instead? Nothing on comprehensive reform, except scrub his website of the phrase \"comprehensive immigration reform\" and to tell the Aurora Sentinel , \"What Boehner has said, and I agree with, is that a comprehensive approach doesn't have to be a comprehensive bill.\" \nCoffman's legislation for young immigrants and his alleged support for a guest worker program fall short of comprehensive reform no matter how you wordsmith it, and they've failed, in part, because Coffman goes to a fundraiser with Boehner at the Brown Palace and doesn't talk about immigration on the same day Coffman's bill is being killed by Republican leadership in Washington . \nVia Twitter, I asked Coffman's spokesman Sandberg to write a blog post explaining how his boss has pushed Boehner for serious immigration reform--and better yet, to show us how it's done. \nThere's no public record of the kind of effort we've seen from Coffman on other issues. Nothing close. Google it. \nFollow Jason Salzman on Twitter: www.twitter.com/BigMediaBlog More:", "external_links": [], "published": "2015-06-04T20:46:00.000+03:00", "crawled": "2015-06-05T03:51:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}