{"organizations": [], "uuid": "55ab851d89e9102b92562c4246f0fb98d5a44574", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_061215fr2.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed#", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/the-administration/245351-the-two-faces-of-obama", "country": "US", "title": "The two faces of Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "The two faces of Obama", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-18T17:00:00.000+03:00", "replies_count": 0, "uuid": "55ab851d89e9102b92562c4246f0fb98d5a44574"}, "author": "dr@covehill.biz (David Russell, contributor)", "url": "http://thehill.com/blogs/pundits-blog/the-administration/245351-the-two-faces-of-obama", "ord_in_thread": 0, "title": "The two faces of Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 18, 2015, 10:00 am The two faces of Obama By David Russell, contributor Francis Rivera \nThe possible rebuff to the president over fast-track authority for the Trans-Pacific Partnership (TPP) by his own party simply highlights the trouble virtually everyone has in assessing this president. His seeming indifference to his party's concern for potential job losses is conjoined with his support for a higher minimum wage, equal pay and education. It all speaks to the man and the fact that he, like many of us, compartmentalizes issues and sometimes forgets the requirements of leadership. \nIt has been said of President Obama, throughout his tenure, that he has a tin ear when it comes to certain issues one would normally associate with a Democrat. Why has he been so incredibly hard on whistle-blowers, journalists and deportation of immigrants? Why has he failed to bring Wall Street players to trial for bringing the economy to its knees? Why would he offer to cheapen Social Security when it is the one legacy from the New Deal-era that has clearly benefited the elderly? Why has he not pilloried the prior administration for its unprovoked attack on another country? Why has he failed to articulate an American foreign policy, but allowed himself to be sucked back into wars that have no national security value for the United States? Why authorize more offshore oil drilling while supporting renewable energy? Why allow over 600 corporate advisers to have open access the terms of TPP and prevent the U.S. citizenry from access? ADVERTISEMENT On the other hand, there are all those Democratic issues he has supported while defying a hostile Congress. He has promoted equal pay and wage increases, created some semblance of immigration policy reform, spent essentially all of his political capital on healthcare reform, advocated for gun control, defended net neutrality, supported environmental laws and an empowered Environmental Protection Agency, opposed the Keystone XL Pipeline, supported marriage equality, Planned Parenthood and education reform.\nAs Howard Dean Democrats are wont to say, \"Well, we are fiscally conservative and social policy liberals.\" But this is not a differentiation just between finance and social welfare; it is much more like retail politics and superpower preservation. The U.S. is strong, and the presidency is at an imperial peak, but the U.S. is strong only because of the size of its economy and the perceived strength of its military. \nThe inheritance from the George W. Bush administration was more of a disaster than has yet been chronicled. The wake of President Bush's policies created unprecedented federal deficits, an economy that could have been ossified with a failed banking system and the disaster of an overtaxed military fighting unwarranted wars. \nWhile one can understand that these transcendent issues might turn a former Harvard Law professor and community activist to the Clinton-era minions for ideas on how to preserve the economy and allow for dithering on withdrawal from foreign misadventures, that doesn't adequately explain Obama. It was — and is — a matter of his timidity that Obama turned his back on a New Deal type of approach to fiscal stimulus, exacting a higher price and convictions from the business community, or his failure to resort to more than conventional foreign policy expertise to \"reboot\" a new American vision. It was his mindset that made him a mockery as he tried to negotiate in a bipartisan manner, when that was such an inappropriate choice of tactics. It was an absence of strong leadership and persuasiveness that allowed him to be intimidated by the conservative members of his own caucus. \nThe presidency has a weighty expectation that the office be preserved with all its rights and privileges, the economy remain strong and growing, and the U.S. military leadership — especially in an age as superpower — sustains a coherent image of strength. Obama has had to confront the mess he inherited with fear, loathing, reverence, pragmatism, conviction or any combination of which might supersede whatever liberal or populist inclinations he might have had. \nOne can wonder, when it comes to the TPP negotiations, why a \"liberal\" president wouldn't invite labor and similarly concerned Democrats to advise, in the same way that business had been invited into the fray? Why wasn't his approach to this new initiative influenced by the fact that a previous Democratic president had championed NAFTA and it did, in fact, result in lost American jobs? It seems such a simple matter, and yet, as of this writing, he still insists on secrecy and exclusion of the very people who are his historic allies. Why do that? \nIt seems simple enough. Obama is erring on the side of transcendent issues when it comes to TPP. Not only does TPP open and enhance trade prospects for American businesses, which speaks to the issue of a strong economy, but it provides a strategic bulwark against the expansion of Chinese power in the region, which speaks to the role as a superpower. Obama's perspective is quite understandable. The U.S.'s image as a military power has been diminished by its Mideast misadventures. That diminished image creates vulnerability as can be seen evoking China's claim to more control over the South China Sea. He can enhance the future U.S. economic position in the region, give cover for the military claims to hegemony and do it all at a relatively small cost (or so he says) to American wage earners. \nIf you think of the president as having focused in on the strength of the economy and the military requirements as a superpower, it is a lot easier to understand what is transpiring. If you understand what it takes to be truly successful in his presidency, you will note that President Obama has once again demonstrated an inability to integrate tactics and issues in such a way that he succeeds and preserves the liberal imagery one suspects he would prefer. How many times have you found yourself saying, \"FDR would have been more aggressive,\" or \"LBJ wouldn't have lost that congressional battle\"? There is a reason. \nRussell is managing director of Cove Hill Advisory Services. Tags:", "external_links": [], "published": "2015-06-18T17:00:00.000+03:00", "crawled": "2015-06-20T01:40:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}