{"organizations": [], "uuid": "d957a1726f620944c41ad12c13ef4691a6e2cc8a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/scotus_062614gn.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/244722-obama-isnt-trying-to-sway-supreme-court-white-house-says", "country": "US", "title": "Obama isn't trying to sway Supreme Court, White House says", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama isn't trying to sway Supreme Court, White House says", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-11T22:19:00.000+03:00", "replies_count": 0, "uuid": "d957a1726f620944c41ad12c13ef4691a6e2cc8a"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/244722-obama-isnt-trying-to-sway-supreme-court-white-house-says", "ord_in_thread": 0, "title": "Obama isn't trying to sway Supreme Court, White House says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 11, 2015, 03:19 pm Obama isn't trying to sway Supreme Court, White House says By Jordan Fabian \nPresident Obama is not attempting to sway the Supreme Court as it prepares a ruling that could unravel his signature healthcare law, the White House said Thursday. Obama has stepped up his defense of the Affordable Care Act just weeks before the court is expected to rule in the King v. Burwell case, which is expected to decide whether subsidies for buying insurance can be distributed through the federal exchange. ADVERTISEMENT Critics have accused the president of trying to pressure the justices to rule in his favor. White House press secretary Josh Earnest on Thursday noted it’s likely that that the justices have already made their decision, however.“In all likelihood, the decision in the case has already been reached and written,” he told reporters. Earnest said the president has made clear in his speeches defending ObamaCare that the court decision will be “made by a separate but equal branch of government.” Although the White House intensified its efforts to promote its healthcare law this week, Earnest said it’s not unusual for Obama to champion it in public.“I think the president views this as a significant achievement of his presidency; it has had an impact on millions of Americans,” he said. “Even if there are no more Supreme Court cases between now and January 2017, I would anticipate you’ll hear the president make that case at least one more time.”Obama made some of his bluntest comments to date on the case Monday, saying the Supreme Court should have never taken it up. The next day, he spoke to the Catholic Health Association, where he decried legal challenges and political attacks intended to upend the law. The president will sit down for an interview with the entertainment news program “Extra” on Thursday to make the case the law has helped save lives. The interview will be conducted by Jerry Penacoli, a TV correspondent and former actor who says ObamaCare helped him receive life-saving cancer treatment. “This is part of our sustained effort to try to use a variety of channels to communicate with the American public,” Earnest said. “This is an opportunity for the president to deliver a message about how valuable the Affordable Care Act has been” for millions of Americans. Past: 1 day House Democrat says Obama has lost... Rep. Brad Sherman said opponents of the trade bill \"don’t live in a... Obama smoking? President caught on... President Obama may have been caught on camera holding a pack of... Fast talk from the fast-track... Some GOP members say that TPA will \"constrain the president,\" but it's... Bill would require trade deals to... A House trade vote could come as soon as this week. Sanders blasts Internet 'nonsense... “That’s some of the nonsense that goes on in the Internet,” Sanders said... Dems set budget trap for GOP Dems say they will block spending bills without a summit. Republicans fear they will win... Republicans in Congress are worried the Supreme Court will hand them a... Last-second objections threaten... Democrats want a Medicare fix attached to the must-pass bill. Benghazi chairman pushes back... Trey Gowdy has been accused of using the Benghazi investigation to raise... Michelle Obama tells Chicago grads... Obama encouraged those in attendance to take a page from her book. Sanders wants war spending paid for The 2016 contender is attaching the issue to an annual defense policy bill... White House: Obama wasn't holding... A spokesman did not identify the object Obama is holding in widely... Rubio revels in 'media attacks' Rubio’s quest for the Republican presidential nomination is getting an... Bernie Sanders's great idea: Free... Nothing would do more to bring opportunity to young men and women... Senators vote to block Obama’s... The GOP-backed measure cleared a key panel on a party-line vote. House passes funding for... Lawmakers approved the $55.3 billion measure in a 216-210 vote. Bill Press: Why not Joe for 2016? OPINION | Why isn’t Vice President Joe Biden at the top of the list of... White House: 'Prudent' for Texas... Images of the McKinney, Texas, incident “have a detrimental impact,\" Josh... Obama admin OK with Alaska... The Obama administration “does not object” to changing the name of North... Fast-track holdouts play ‘let’s... Dozens of votes could be in play for the right deal. Top Senate Dem warns GOP: Deal now... \"Republicans have a choice,\" Sen. Patty Murray said Wednesday. Senator reveals Parkinson's... Johnny Isakson said the disease won't impact his run for reelection in... The Hill's Whip List: Trade bill... Over 100 Democrats are opposing fast-track in the House. Bachelor Graham hints at 'rotating... “Well, I've got a sister. She could play that role if necessary,” Graham...", "external_links": [], "published": "2015-06-11T22:19:00.000+03:00", "crawled": "2015-06-12T03:58:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}