{"organizations": [], "uuid": "7387d1dc82a090ea2fecc172c802c9718b03ef48", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/blogs/e2-wire?format=feed&type=rss", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/245410-dems-obama-officials-praise-popes-climate-change-letter", "country": "US", "title": "Dems, Obama officials praise Pope’s climate change letter", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Dems, Obama officials praise Pope’s climate change letter", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-18T18:38:00.000+03:00", "replies_count": 0, "uuid": "7387d1dc82a090ea2fecc172c802c9718b03ef48"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/245410-dems-obama-officials-praise-popes-climate-change-letter", "ord_in_thread": 0, "title": "Dems, Obama officials praise Pope’s climate change letter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dems, Obama officials praise Pope’s climate change letter By Timothy Cama - 06/18/15 11:38 AM EDT \nCongressional Democrats are praising Pope Francis for saying humans are responsible for climate change and calling on the world to fight it. \nDemocrats highlighted the pope's encyclical shortly after its release to call on people to support efforts to cut greenhouse gas emissions. ADVERTISEMENT “Pope Francis writes with beauty, with clarity and with moral force,” House Minority Leader Nancy Pelosi (D-Calif.) told reporters.\n“This encyclical stance is an urgent call for governments, to industry and the whole community to honor their responsibility to preserve God's creation,” she said, adding that the letter makes it clear the climate fight is about protecting the poor. \nPelosi used the encyclical to slam House Republicans for voting for an amendment to limit the Obama administration’s ability to include climate provisions in negotiating trade agreements. \n“In giving us his message to protect our common home, Pope Francis also has given us a common goal — we must act now to stop climate change,” Sen. Ed Markey (D-Mass.) said in a statement. \n“Pope Francis’s encyclical offers all people of conscience the opportunity to examine their own lives, their relationship to the planet and its people, and their duty to take action,” said Markey, who, as a House member in 2009, sponsored a bill to institute a cap-and-trade program for carbon dioxide. \nSen. Sheldon Whitehouse (D-R.I.), one of the most vocal climate activists in the Senate, called the encyclical “an inspiring call for action — and a reminder of how harshly our carelessness will fall on the world’s poor.” \n“Pope Francis gives voice to the moral urgency of caring better for our home planet,” he said. \nIn a joint statement, the all-Democratic House Sustainable Energy and Environmental Coalition said the encyclical makes it clear that Francis agrees with Democrats on the science of climate change. \n“For those unmoved by the science of climate change, we hope that Pope Francis’ encyclical demonstrates the virtue and moral imperative for action,” they said. “Today’s announcement further aligns the scientific and moral case for climate action, yet the political will of many is still askew.” \nRep. Paul Tonko (D-N.Y.) applauded Francis for framing climate change as a matter of protecting the future. \n“It is a moral imperative to act as a good steward of the environment and the gifts we have been given,” he said. \nSecretary of State John Kerry told Time that he welcomes Francis’s attention to the poor and the effects of climate change has on them. \n“The Pope’s powerful encyclical calls for a common response to the critical threat climate change poses to our common home,” he said. “His plea for all religions to work together reflects the urgency of the challenge.” \nEnergy Secretary Ernest Moniz was similarly thankful. \n“Pope Francis’ call to action on climate change is an important milestone in the global effort on this issue,” he said. “His is not just a powerful moral voice, he also graduated as a chemical engineer and understands the consensus of climate scientists that accumulating man-made pollution endangers our planet and people around the world.” \nSen. James Inhofe (R-Okla.), chairman of the Environment and Public Works Committee and an outspoken skeptic of climate change, said he disagreed with Francis. \n“I am concerned that his encyclical will be used by global warming alarmists to advocate for policies that will equate to the largest, most regressive tax increase in our nation’s history,” he said. “Climate science isn’t settled.” Tags:", "external_links": [], "published": "2015-06-18T18:38:00.000+03:00", "crawled": "2015-06-19T11:38:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}