{"organizations": [], "uuid": "1cc1a7a96c57daaa552308627e8583c528aec425", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_060915getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/245681-obama-uses-n-word-while-arguing-us-is-not-cured-of-racism", "country": "US", "title": "Obama uses N-word while arguing US is not 'cured' of racism", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama uses N-word while arguing US is not 'cured' of racism", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-22T14:45:00.000+03:00", "replies_count": 0, "uuid": "1cc1a7a96c57daaa552308627e8583c528aec425"}, "author": "Ben Kamisar", "url": "http://thehill.com/homenews/administration/245681-obama-uses-n-word-while-arguing-us-is-not-cured-of-racism", "ord_in_thread": 0, "title": "Obama uses N-word while arguing US is not 'cured' of racism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama uses N-word while arguing US is not 'cured' of racism By Ben Kamisar - 06/22/15 07:45 AM EDT \nPresident Obama is warning that America is not \"cured\" of racism in the wake of a shooting in a historically black church in South Carolina, driving home his point by evoking a racial slur to argue that attitudes on slurs don't mean prejudice is gone. ADVERTISEMENT \"The legacy of slavery, Jim Crow, discrimination—in in almost every institution of our lives—that casts a long shadow, that’s still part of our DNA, that's passed on,\" Obama said on an episode of the Marc Maron \"WTF Podcast\" released Monday.\n\"Racism, we are not cured of it. And it's not just a matter of it not being polite to say nigger in public. That's not the measure of whether racism still exists or not. It's not just a matter of overt discrimination. Societies don't, overnight, completely erase everything that happened 200 to 300 years prior.\" \nHe lamented that mass shootings are \"unique to our country,\" noting how countries like Australia have made drastic reforms to their gun policies in the wake of shootings. And while noting that the \"grip of the NRA on Congress is extremely strong,\" he said that he doesn't believe Congress will take any action until Americans believe that mass shootings should not be treated as \"normal.\" \n\"The grieving that the country feels is real, the sympathy, the prioritizing, comforting the families, all that is important,\" he said. \n\"It's not enough just to feel bad, there are actions that could be taken to make events like this less likely. One of those actions we could take is to enhance basic, common-sense, gun safety laws that by the way, the majority of gun owners support.\" \nObama spoke Friday on the comedian's podcast , which typically doesn't shy away from harsh language. He reasoned through his rebellious stage early in his life and how he balanced his mixed-race heritage without the presence of his black father in his life. He said he began \"absorbing a lot of stereotypes\" and \"trying on different hats\" about being a \"black man in America.\" \n\"A lot of the ideas I had taken on about being a rebel or a tough guy or being cool were really not me. They were just things I was trying on because I was insecure or I was a kid,\" \n\"After a couple years of college, I started realizing that there were some things that were important to me, having an impact on social justice issues, having something to say about poverty or race.\" \nObama added that he had \"contradictions I had to work out\" in order to learn how to \"be both an African American, but also somebody that affirms the white side of my family.\"", "external_links": [], "published": "2015-06-22T14:45:00.000+03:00", "crawled": "2015-06-22T14:56:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}