{"organizations": [], "uuid": "93f74fa9f701d8532b5a346180efd61ab7602dc7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/schumerdurbinobama_060415gn.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/senate/244108-white-house-urging-dems-to-back-possible-obama-defense-veto", "country": "US", "title": "White House urging Dems to back possible Obama defense veto", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "White House urging Dems to back possible Obama defense veto", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-05T13:00:00.000+03:00", "replies_count": 0, "uuid": "93f74fa9f701d8532b5a346180efd61ab7602dc7"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/senate/244108-white-house-urging-dems-to-back-possible-obama-defense-veto", "ord_in_thread": 0, "title": "White House urging Dems to back possible Obama defense veto", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "White House urging Dems to back possible Obama defense veto Greg Nash By Alexander Bolton - 06/05/15 06:00 AM EDT \nThe White House is urging Senate Democrats to uphold a possible veto by President Obama of the annual defense authorization bill. \nThe legislation has emerged as a flashpoint in the battle between the administration and congressional Republicans over government funding. ADVERTISEMENT The White House is seeking to get Republicans to lift spending ceilings imposed under sequestration, and objects to the GOP adding funds to a separate war account for the Pentagon while the rest of the government’s spending is curbed.\nWhite House chief of staff Denis McDonough urged Democrats at a private meeting Tuesday to oppose the authorization measure because it would allow the use of the war fund, known as the Overseas Contingency Operations account, to boost defense spending while leaving cuts to social programs intact. \nMcDonough made it clear the administration was not calling for Senate Democrats to filibuster the Defense bill, which is now being considered on the Senate floor. \nInstead, he signaled the White House is looking for support after a veto. \n“He said we need 34 Democrats to vote against it,” said a Democratic senator who attended the meeting. \nSenate Majority Leader Mitch McConnell (R-Ky.) needs 67 votes — including 13 Democrats if all of the Senate Republicans vote to override Obama — to win the showdown. \nA senior Democratic aide said the administration initially had hoped Senate Democrats would block progress on the bill, but that its strategy fell apart after centrist Democrats balked at the plan. \nThe Democrats were worried it would be politically dangerous to be seen as blocking the annual defense bill, which has traditionally been approved with bipartisan support. \n“It unraveled when centrists like [Sen.] Claire McCaskill [D-Mo.] said they were not going to vote against the authorization,” the aide said. \nMcCaskill was one of eight Democrats who voted to pass the authorization out of the Armed Services Committee. \nDemocrats signaled a shift in strategy earlier on Thursday by signaling they planned to block any spending bills from reaching the Senate floor as a way of protesting the GOP’s opposition to lifting spending ceilings. \nSen. Charles Schumer (N.Y.), the chairman of the Democratic Policy and Communications Center, said that Senate Democrats will block motions to proceed to any appropriations bill “until Republicans have sat down at the table and figured out with us how we’re going to properly fund the Defense Department and key priorities that help families, fuel economic growth and keep us safe and strong at home.” \nDemocrats stopped short of saying they would vote to advance the defense bill, saying that would depend on what amendments are added to the bill. \nSenate Democratic Leader Harry Reid (Nev.) hedged when asked Tuesday whether Democrats might attempt to block the authorization. \nDemocrats agreed to proceed to the bill promptly but Reid warned, “That doesn't mean we're going to get off the bill once we get on it.” \nA Democratic leadership aide said Thursday the caucus discussed a filibuster but Reid and other leaders did not whip them in favor of one. \nMcConnell hopes to have a final vote on the measure by the end of last week. \nBut it appears clear their strategy is to allow the defense bill to move forward, and possibly make a stand if Obama vetoes the bill. \nCentrist Democrats signaled support for their leadership’s strategy of blocking the spending bills. \n“I will make a very strong statement about how unwilling I am to begin considering appropriations until we get to a table of compromise and sanity about the fractured fairytale that’s known as their budget,” McCaskill said Thursday. \nThe defense bill could be the first real test of whether Senate Democrats will support Obama on a veto. \nObama has vetoed only four bills during his presidency and Congress has not reversed any of those decisions. He vetoed legislation authorizing construction of the Keystone XL pipeline in February and a resolution overturning a National Labor Board rule for union elections in March. \nA veto of the defense bill, however, has the potential to be more politically controversial — as evidenced by the reluctance of Democrats to filibuster the measure. \nA Democratic leadership aide said it was clear last month when the Armed Services Committee passed the authorization that it would be difficult to muster enough Democratic votes to block it from getting to Obama’s desk. \nMany Democrats don’t want to be accused of not supporting the military at a time when polls show growing concern over terrorism and the Islamic State in Iraq and Syria. \nMcConnell, for his part, wants to put Democrats on the spot this month by holding votes on the defense authorization and appropriations measures. \n“We think it's important to focus on the national defense because of all the threats that are occurring these days, which is a very, very high threat level,” he said Tuesday.", "external_links": [], "published": "2015-06-05T13:00:00.000+03:00", "crawled": "2015-06-05T13:22:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}