{"organizations": [], "uuid": "5d6688459b2c1fe0ae94fe97e536ddbd233dbc27", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/blogs/e2-wire?format=feed&type=rss", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/overnights/244599-overnight-energy-obama-targets-airplanes-for-climate", "country": "US", "title": "OVERNIGHT ENERGY: Obama targets airplanes for climate rules", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT ENERGY: Obama targets airplanes for climate rules", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-11T01:00:00.000+03:00", "replies_count": 0, "uuid": "5d6688459b2c1fe0ae94fe97e536ddbd233dbc27"}, "author": "dhenry@thehill.com (Timothy Cama and Devin Henry)", "url": "http://thehill.com/policy/energy-environment/overnights/244599-overnight-energy-obama-targets-airplanes-for-climate", "ord_in_thread": 0, "title": "OVERNIGHT ENERGY: Obama targets airplanes for climate rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT ENERGY: Obama targets airplanes for climate rules By Timothy Cama and Devin Henry - 06/10/15 06:00 PM EDT \nThe Obama administration said Wednesday that it wants to formally declare carbon emissions from airplanes to be harmful, setting off obligatory regulations to limit them. \n\"Today we are proposing to find that greenhouse gas emissions from engines used primarily on commercial aircraft contribute to the pollution that causes climate change, setting the stage to potentially limit greenhouse gas emissions in future standards,\" Christopher Grundler, the top transportation emissions regulator at the Environmental Protection Agency (EPA), told reporters. ADVERTISEMENT The EPA also asked for input on what those potential regulations would look like.\nThe administration made it clear that it wants to match its standards to those that the International Civil Aviation Authority is developing, due to come out in February 2016. \nBut the timeline is working against President Obama. Grundler estimated that the potential rules would not be made final until 2018, when Obama will be long gone from the White House. \nEnvironmental groups applauded the action, but urged the EPA to go beyond the international rules. \nRepublicans blasted the EPA, with Rep. Lamar Smith (R-Texas) declaring it \"the next leg of a nonstop journey by the EPA to control how Americans live, work and travel.\" \nRead more here . \nON TAP THURSDAY I: The Senate Environment and Public Works Committee will hear testimony from three nominees for top EPA positions subject to Senate confirmation: Jane Nishida, Ann Dunkin and Thomas Burke. \nON TAP THURSDAY II: The House Natural Resources Committee will vote on seven land use bills, including one requiring more natural gas pipelines on federal land. \nRest of Thursday's agenda ... \nThe House Agriculture Committee's conservation and forestry subcommittee will hold a hearing on the implementation of the 2014 Farm Bill's conservation programs. Jason Weller, chief of the Department of Agriculture's Natural Resource Conservation Service; and Val Dolcini, the USDA's Farm Service Agency administrator, are scheduled to testify . \nThe Heartland Institute's International Climate Change Conference will begin. Sen. Jim Inhofe (R-Okla.), chairman of the Environment and Public Works Committee, will give Thursday's keynotes . \nReps. Randy Hultgren (R-Ill.), Dan Lipinski (D-Ill.) and Paul Tonko (D-N.Y.) will speak at a Bipartisan Policy Center event on battery technology for vehicles and the electric grid. \nNEWS BITE: The Obama administration announced Wednesday a series of measures aimed at improving clean energy and reducing greenhouse gases in rural and agricultural areas. \nOne of the announcements is for $7 million in funding for nearly 550 clean energy projects for rural areas through the U.S. Department of Agriculture. \nThe White House also held a roundtable discussion Wednesday with representatives of various agricultural sector and related companies like Cargill Inc. and General Mills Inc. on the importance of reducing greenhouse gases. \nAlong with the Wednesday announcements, various major companies made climate pledges. They include Unilever promising to source all of its U.S. soy sustainably by 2017, Walmart pledging to partner with agricultural suppliers to cut emissions and PepsiCo. expanding its sustainable farming initiative. \nAROUND THE WEB: \nExxonMobil Corp. is telling Texas regulators that its operations, including wastewater injection from hydraulic fracturing, is not causing earthquakes in the Dallas-Fort Worth area, the Wall Street Journal reports . \nNorth Carolina is ordering Duke Energy Corp. to fix the problems causing coal ash dumps outside Wilmington to leak, the Associated Press reports . \nThe head of French oil giant Total warned the new liberal government of Alberta, Canada, that new taxes on the area's oil sands industry could drive out investment, the Globe and Mail reports . \nIN CASE YOU MISSED IT: \nCheck out Wednesday's stories... \n-Obama administration OK with Alaska mountain name change -Dems propose carbon tax -Obama to seek climate rules for airplanes -Lawmakers spar over EPA's water rule -House panel approves bill cutting EPA funding -Senators vote to block Obama's water rule -Feds expand two California marine sanctuaries -White House approves EPA's airplane emissions plan -GOP readies assault on Obama's climate agenda \nPlease send tips and comments to Timothy Cama, tcama@thehill.com ; and Devin Henry, dhenry@thehill.com . Follow us on Twitter: @Timothy_Cama , @dhenry , @thehill", "external_links": [], "published": "2015-06-11T01:00:00.000+03:00", "crawled": "2015-06-11T17:54:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}