{"organizations": [], "uuid": "5aea03657e0b23d5265cee018268db6d91b0c586", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3001620/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/blog.xml", "section_title": "WorldPost Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/vincent-intondi/nuclear-disarmament-the-most-important-but-of-the-obama-presidency_b_7475474.html", "country": "US", "title": "Nuclear Disarmament: The Most Important \"But\" of the Obama Presidency | Vincent Intondi", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Nuclear Disarmament: The Most Important \"But\" of the Obama Presidency | Vincent Intondi", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-01T20:33:00.000+03:00", "replies_count": 0, "uuid": "5aea03657e0b23d5265cee018268db6d91b0c586"}, "author": "Vincent Intondi", "url": "http://www.huffingtonpost.com/vincent-intondi/nuclear-disarmament-the-most-important-but-of-the-obama-presidency_b_7475474.html", "ord_in_thread": 0, "title": "Nuclear Disarmament: The Most Important \"But\" of the Obama Presidency | Vincent Intondi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For many progressives, the Obama presidency has become a battle of trying to figure out how to celebrate historic achievements while at the same time dealing with disappointment. As a historian, I am routinely asked about Obama's legacy. I often explain that it is far too early to evaluate Obama, but the one constant in these last six years has been the \"but\" factor. It also happens to be the most frustrating aspect for supporters of the Obama presidency.\nThere are many explanations as to why Obama has made certain decisions as president. Some argue that his supporters had it wrong from the start and Obama has always been a \"wolf in sheep's clothing.\" Others contend he was never a far left candidate, but a centrist liberal. Many supporters also make clear that the historic obstructionism of Republicans and conservative Democrats in Congress has prevented Obama from becoming the president they envisioned. Perhaps it is a combination of all of the above.\nBut one should not dismiss the role of the American people. Obama never said, \"Yes I can.\" It was always \"Yes, we can.\" That said, once Obama was elected, many progressives now had to figure out what to do. For so long, we were \"against the man,\" but now our guy was \"the man.\" Moreover, the Right attacked Obama so viciously that many supporters immediately went into defense mode and perhaps unwisely gave Obama a pass on issues that we would surely have protested if the president was Bush, McCain, or Romney.\nBut the most frustrating and perplexing aspect of the Obama presidency has been the \"but\" factor: Obama passed healthcare reform, but gave up the public option. Obama acted boldly on immigration, but deported more people than any president in U.S. history. Obama killed the Keystone Pipeline, but just allowed Shell to start drilling in the Arctic . Obama ended the war in Iraq, but continues his use of drones and maintains many of the Bush era policies in the Middle East.\nWhile all of these \"buts\" have had major consequences on millions of lives, one could argue the single, most important \"but\" of the Obama presidency is nuclear disarmament. As a student, candidate, and president, Obama has spoken out against nuclear weapons. In his first term, Obama began the march towards disarmament. He delivered one of the most anti-nuclear speeches in presidential history in Prague, signed and ratified the new START treaty with Russia, convinced numerous countries to give up their bomb making materials, and perhaps the most impressive, through diplomacy, President Obama has to date prevented Iran from building a nuclear weapon.\nThere is of course a \"but.\" Obama's budgets have actually taken money out of nonproliferation programs and put it into building new nuclear weapons, including spending a trillion dollars over the next 30 years on the nuclear arsenal. He continues to support Shinzo Abe, Japan's extreme right-wing prime minister, who has expressed his desire to remilitarize Japan, downplays wartime atrocities against China, and wants to expand the U.S. military base in Okinawa. Most recently, the Obama administration blocked the adoption of the Nuclear Nonproliferation Review Conference's consensus statement , which called for a nuclear weapons free Middle East, because that would also include Israel.\nOver the last few weeks I have met with various hibakusha (atomic bomb survivors). They have all asked me the same question: \"Will President Obama visit Hiroshima this year?\" It is no secret that for the last two years I have been publicly calling on Obama to visit Hiroshima as a gesture and step in moving towards nuclear disarmament. This year marks the 70th anniversary of the atomic bombings of Hiroshima and Nagasaki. Former ambassador John Roos stated that he thought Obama would visit Hiroshima before his presidency was over. The average age of the hibakusha is 79. The world is arguably more dangerous than ever. In short, the time is now.\nPresident Obama often comments that he carries a checklist of what he wants to accomplish. Is fulfilling his pledge at Prague to eliminate nuclear weapons on that list? Years from now we will evaluate and debate the Obama era studying all of his accomplishments and disappointments. However, that will not be the case if he does not act, or we do not make him act on nuclear weapons. For the biggest threat to our future and that of our children is a sentence that reads: \"Obama began to act on nuclear weapons, but ...\"\nFollow Vincent Intondi on Twitter: www.twitter.com/vincentintondi\nMore: Nuclear Disarmament START Treaty Barack Obama Nuclear Weapons Iran Nuclear Weapons Hiroshima Atomic Bomb", "external_links": [], "published": "2015-06-01T20:33:00.000+03:00", "crawled": "2015-06-01T20:30:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}