{"organizations": [], "uuid": "7c82afe9a905da97309c88371d7fb48c33865f4a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/eric-mann/president-obama-no-cars-i_b_7472886.html", "country": "US", "title": "President Obama: No Cars in L.A. and the U.S., No Tanks in L.A. and the U.S. | Eric Mann", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "President Obama: No Cars in L.A. and the U.S., No Tanks in L.A. and the U.S. | Eric Mann", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-01T00:15:00.000+03:00", "replies_count": 0, "uuid": "7c82afe9a905da97309c88371d7fb48c33865f4a"}, "author": "Eric Mann", "url": "http://www.huffingtonpost.com/eric-mann/president-obama-no-cars-i_b_7472886.html", "ord_in_thread": 0, "title": "President Obama: No Cars in L.A. and the U.S., No Tanks in L.A. and the U.S. | Eric Mann", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On May 19 in front of Augustus Hawkins High School in South Los Angeles -- on the 90th anniversary of Malcolm X's birthday -- 100 Black and Latino high school students, bus riders, security guards, hotel workers chanted, \"President Obama: No Tanks in LA, No Cars in L.A.\" Initiated by the Labor/Community Strategy Center and its Fight for the Soul of the Cities, we called on the president to end the Department of Defense's 1033 Program that gives \"surplus\" military grade weapons to local police forces all over the United States -- including the Los Angeles School Police Department and to go to the December 2015 United Nations Climate Change Conference in Paris with an \"frontloaded\" \"verifiable\" \"enforceable\" plan\" to cut U.S. emissions by 50 percent of 1990 levels by 2015 -- starting today! But how can 100 people talking about No Tanks and No Cars in LA expect to get the president of the United States to make radical changes in national and international military and climate policies? Obviously there is no guarantee but the line between delusional and visionary can only be determined in retrospect and we have a real plan to win.\nAll great social movements begin with an unassailable and irrefutable moral argument. U.S. policies are burning up our own cities and the planet.\nToday in every urban center in the U.S. Black and Latino communities are under a permanent military siege by the police and surveillance state with the express policy objective of beating back the revolutionary ideologies and achievements of the great revolution of what I call \"The Two Decades of the Sixties\" -- from the Montgomery Bus Boycott and the Bandung Conference of Non-Aligned Nations in 1955 to the defeat of the U.S. invasion of Vietnam in 1975. The ruling language of \"counter-insurgency\" shapes why there are 2.5 million people in U.S. prisons 1 million of whom are Black and 500,000 of whom are Latino. Ending the \"war on drugs\" \"war on crime\" \"war on gangs\" will never work until the U.S. ends it war on Blacks and Latinos. The Defense Department's 1033 program gives tanks, rocket launchers, assault rifles, MRAPs and M-16 rifles to local police forces all over the country and the application form says, \"If you want it you can have it.\" The Los Angeles Unified School District has 61 M-16s and the LAPD 1600 M-16s. (The International Red Cross has called the M-16 an inhumane weapon...) The goal, to shoot down protesting students, parents, teachers, community residents who rise up in anger demanding radical changes in our society. We are calling on the Los Angeles Unified School Board and the Los Angeles Police and Sheriff's Departments to relinquish all their weapons from the 1033 program and \"burn them, don't return them\" so they can't be used on others inside our outside the U.S. Recently the president announced \"modifications\" to the program that restrict some of the weapons (and yes, the tanks) and create administrative procedures for the use of other weapons. But the police are still allowed many lethal weapons from the program and can kill people with impunity and then will deal with any sanctions after the fact. President Obama must end the 1033 program down to its last bullet.\nThe president's climate policies so far, have been marked by moments of inspiration followed by lethargy and a lack of will. Nature is not impressed as we approach the 10th anniversary of the Katrina climate catastrophe and the last ten years of federal inaction in the face of deteriorating permafrost, floods, droughts, melting coral reefs, and extreme weather events as the U.S. fiddles as the planet burns. The 2015 United Nations Climate Change conference is a big world stage event where governments try to finally grasp the enormity of the rapidly escalating rise of the earth and water's temperature towards 2 degrees Celsius and beyond. But spoiler alert. Unless reversed, the conference is headed for a disaster because the ground rules of the UNCCC, unless reversed, allow each government to set its own policies, to have no mandated international inspections of emissions, and no penalties for non-compliance of goals that can't be verified in the first place. The president recently signed a climate agreement with the Chinese government in which he pledged to cut U.S. emissions by 28 percent over the next 10 years. Many Beltway environmental groups have praised the president while not challenging the vague nature of the commitment or the inadequate goal of only a 28 percent reduction. Senate Majority Leader Mitch McConnell said that while he is not clear about exactly what the president is saying he is clear he opposes it.\nSo, as a social movement we begin by setting the terms of the debate and hoping that one key demand from U.S. organizations can at least push the U.S. and the UN governments into a debate about one clear, enforceable demand. We are proposing that President Obama go to Paris with a plan to cut U.S. emissions to 50 percent of 1990 levels by 2025 -- starting now! Here's how he can do it. Cut U.S. auto production and consumption by 50 percent immediately. Cut U.S. gas, coal, oil production and consumption by 50 percent immediately Support the Strategy Center's No Cars in L.A. Campaign of dramatic restriction in auto use through auto free zones, auto-free rush hours and days in every city in the U.S. and making a major investment in a 5,000 zero-emission bus fleet, running 24/7, and yes, free public transportation through direct transfers of funds from the military budget to mandated bus systems all over the U.S. (The fiasco of the L.A. \"rail\" system and it raids on the L.A. bus system is the subject of the successful civil rights law suit we brought against the Los Angeles MTA-and the 2,500 new compressed natural gas buses were won were only a down payment on what is needed. This bus-centered system could be up and running now with dramatic expansion of buses on the streets in 18 months to 3 years. ) I am on my way, along with Barbara Lott-Holland, Associate Director of the Strategy Center, to Bonn, Germany for preparatory meetings of the United Nations Climate Change Conference where we will be part of the broad governmental and NGO movement to make the Paris UNCCC the greatest success possible.In that international imperative, the president should issue every executive order under the sun to radically reduce emissions -- and rally popular support around his proposals. But of course, here is where \"organizing\" and \"movement building\" come in.\nThe 100 people at the rally are organizers not spectators; We are going door to door in South Los Angeles with 2,000 lawn signs with pictures of President Obama \"No Cars in LA, No Tanks\" in L.A. meeting with 100 new churches, labor unions, and community groups in the next 60 days -- speaking at UCLA, USC, community colleges, and groups of liberal Democrats.\nWe are reaching out to Black and Latino communities, civil rights and social justice organization, teachers and janitors unions, and the environmental justice movement in every city in the US. to call for \"No Cars, No Tanks in Detroit, Philadelphia, Chicago, Houston, Ferguson, Harlem, Baltimore\" They are excited about our call for \"the social welfare state not the police state -- the climate justice state not the warfare state\" and want to join a national campaign whose demands can be fought for and won strengthening our national movement.\nAll great campaigns start with an unequivocal moral argument and as Frederick Douglass taught, making very clear demands on those in power. So, President Obama must end the 1033 Program now and put forth a plan to reduce U.S. carbon emissions to 50 percent of 1990 levels by 2025 -- now. Do you agree? If you do then the No Cars, No Tanks campaign has already picked up one new organizer.\nEric Mann, a veteran of the Congress of Racial Equality, Students for a Democratic Society, and the United Auto Workers is the director of the Labor/Community Strategy Center and its Fight for the Soul of the Cities campaign. He is the author of Playbook for Progressives: 16 Qualities of the Successful Organizer and the host of KPFK/Pacifica's Voices from the Frontlines--Your National Movement Building Show. He welcomes comments at eric@voicesfromthefrontlines.com\nFollow Eric Mann on Twitter: www.twitter.com/EricMannSpeaks\nMore: No Cars President Paris Justice", "external_links": [], "published": "2015-06-01T00:15:00.000+03:00", "crawled": "2015-06-01T02:12:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}