{"organizations": [], "uuid": "424e659dbedc18f00bea7f2d8514a02d0ff69d3f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/bushjeb_051415getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/ballot-box/presidential-races/244898-progressives-bush-bad-on-immigration", "country": "", "title": "Group launches Spanish-language ad attacking Bush on immigration | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Group launches Spanish-language ad attacking Bush on immigration | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "424e659dbedc18f00bea7f2d8514a02d0ff69d3f"}, "author": "", "url": "http://thehill.com/blogs/ballot-box/presidential-races/244898-progressives-bush-bad-on-immigration", "ord_in_thread": 0, "title": "Group launches Spanish-language ad attacking Bush on immigration | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 15, 2015, 12:08 am Group launches Spanish-language ad attacking Bush on immigration By Jordain Carney Getty Images A progressive outside group is hitting former Florida Gov. Jeb Bush ahead of an expected presidential announcement Monday, slamming his immigration views. People for the American Way launched a Spanish-language digital ad against Bush, which will air in Colorado, Virginia, North Carolina and Florida. ADVERTISEMENT \"The Republican presidential candidate Jeb Bush is out of touch with our community. His immigration policies would condemn undocumented immigrants to a second class status without the option of becoming citizens,\" the ad says, according to an English translation. The outside group's ad comes as Bush is expected to announce his bid for the Republican presidential nomination in Miami. Bush said earlier this year during an interview on Fox News' \"The Kelly File\" that \"we need to enforce the laws of our country for sure — enforce the border. … But a practical solution of getting to fixing the legal system is also allowing for a path to legalized status — not necessarily citizenship.\" The outside group also hit Bush on the minimum wage, saying that as governor, \"he fought increases in the minimum wage many times, blocking us from a better life.\" The group cites a 2005 CNN article reading, \"Bush opposed a state referendum to increase the state's minimum wage.\" The issue of immigration is a personal one for Bush, whose wife, Columba, was born in Mexico and became a U.S. citizen in 1979. The group also targeted Sen. Marco Rubio (R-Fla.), who is also running for president, with an ad ahead of his presidential announcement, suggesting Rubio is bad for middle-class families. Tags: Past: 1 day Bush: You need 'boots on the... The former president suggested U.S. troops will have to fight ISIS. CIA releases secret report... The report claims to identify blind spots at intelligence agencies before... Warren: 'I fully understand'... Warren was biting back at JPMorgan Chase CEO Jamie Dimon. Obama making bid to diversify... Rules in the works are drawing fire from critics who cry overreach. Behind Pelosi's break with Obama... The president probably knew his plan was doomed hours before the first... Clinton formally launches White... The former secretary of State formally launched her bid to become... House deals humiliating blow to... Defying Obama, Democrats rallied to vote down trade legislation. NAACP chapter president 'disguised... The 37-year-old is allegedly of Czech, Swedish and German origins. Sanders: 'The good side won' on... “Our trade policies over the last 40 years … have been a disaster,”... Shaking off Obama, Pelosi stuns... \"She gave no indication of what she was going to do,\" said Rep. Mike... Dallas police headquarters... At least one gunman opened fire at officers and planted at least two... Why Bernie Sanders excites... Students and young people are becoming increasingly engaged politically. White House battles back at... Questions about Obama's clout are reverberating after a stunning defeat on... Rubio mocks Clinton’s campaign... Rubio transitions Clinton's Beatles quote into a Fleetwood Mac reference. Cruz, Paul push for ban on... The two are part of a coalition pushing the ban in an annual defense... White House, GOP try to pick up... The House is expected to vote on the TAA bill against early next week. Boeing shows off 'Dreamliner'... Airplane manufacturer Boeing is showing off its 787 \"Dreamliner\" model in... Administration preps new gun... The Justice department is moving forward with a flurry of new rules. New major hack hits spy agencies,... Chinese-based hackers have apparently gained access to security clearance... The empires strike back The two most famous names in the 2016 race are hosting their biggest... Tech glitch at State Dept. halts... Officials ruled out a cyber attack as the cause of the outage. Russian military plane buzzes NATO... A Russian surveillance aircraft skimmed above four NATO warships in the... ", "external_links": [], "published": "2015-06-15T03:00:00.000+03:00", "crawled": "2015-06-15T10:13:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}