{"organizations": [], "uuid": "e6bedc7e7d412fa82d1f31ae16c896c553062a20", "thread": {"site_full": "edition.cnn.com", "main_image": "http://www.theblaze.com/wp-content/uploads/2015/06/Obama-Israel-Ch-2-620x426.jpg", "site_section": "http://lincolnreport.com/feed", "section_title": "Lincoln Report", "url": "http://edition.cnn.com/2015/06/02/travel/phoenix-sues-faa-airplane-noise/index.html", "country": "US", "title": "Obama Tells Israelis He Understands Their ‘Fears’ and ‘Concerns,’ but Iran Deal Is the ‘Best Way to Prevent’ Nuclear Weapon", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Obama Tells Israelis He Understands Their ‘Fears’ and ‘Concerns,’ but Iran Deal Is the ‘Best Way to Prevent’ Nuclear Weapon", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T08:45:00.000+03:00", "replies_count": 0, "uuid": "1f7dc848410a4e57ec58e1ab8b4987e40738d73e"}, "author": "Sharona Schwartz", "url": "http://www.theblaze.com/stories/2015/06/02/obama-tells-israelis-he-understands-their-fears-and-concerns-but-iran-deal-is-the-best-way-to-prevent-nuclear-weapon/", "ord_in_thread": 0, "title": "Obama Tells Israelis He Understands Their ‘Fears’ and ‘Concerns,’ but Iran Deal Is the ‘Best Way to Prevent’ Nuclear Weapon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Tells Israelis He Understands Their ‘Fears’ and ‘Concerns,’ but Iran Deal Is the ‘Best Way to Prevent’ Nuclear Weapon Jun. 2, 2015 1:45am Tweet This Email this story to a friend \nPresident Barack Obama told Israel’s Channel 2 television that while he understands the “concerns” and “fears” of Israelis, he believes the best path to preventing an Iranian nuclear weapon is through a “verifiable, tough agreement.” \n“I can, I think, demonstrate, not based on any hope but on facts and evidence and analysis, that the best way to prevent Iran from having a nuclear weapon is a verifiable, tough agreement,” Obama said in an excerpt of the interview with Channel 2’s news magazine “Uvda” that was broadcast Monday night. \n“A military solution will not fix it. Even if the United States participates, it would temporarily slow down an Iranian nuclear program but it will not eliminate it,” Obama said. President Barack Obama said about the Iranian nuclear challenge: “A military solution will not fix it.” (Image source: Channel 2) \nAmid tensions between Obama and Prime Minister Benjamin Netanyahu over the framework agreement between Iran, the U.S. and five world powers – which the Israeli leader has called a “bad deal” – Obama and other administration officials have found ways to address the Israeli public directly to try to allay concerns that a negotiated agreement will thwart the efforts of a country that has vowed to annihilate Israel from obtaining a doomsday weapon. \nAsked if he could imagine a scenario in which Netanyahu, after the signing of a permanent agreement with Iran, were to launch a military strike on nuclear facilities without first alerting him as U.S. president, Obama said, “I won’t speculate on that. What I can say is, to the Israeli people: I understand your concerns and I understand your fears.” \nChannel 2 will broadcast the entire 40-minute interview Tuesday night. \nThe interviewer, Ilana Dayan, a well-known television news personality in Israel, reported that during 40-minute interview Obama expressed his deep commitment to Israel’s security but said that without an Israeli-Palestinian peace process underway it would be difficult for the U.S. to defend Israel in international organizations. \nThe U.S., Iran and the five powers are working to meet a self-imposed June 30 deadline to reach a final agreement over Iran’s nuclear program. \nNetanyahu on Sunday called Iran’s effort to develop nuclear weapons “the greatest threat to Israel’s security, to the stability of the region and to the peace of the world.” \nThe English excerpt begins at 55 seconds into the clip: Other Must-Read Stories", "external_links": [], "published": "2015-06-02T08:45:00.000+03:00", "crawled": "2015-06-02T10:16:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}