{"organizations": [], "uuid": "3bc19f364ce1ff5198eca2ffbb29864f6ea6e57a", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/245546-corporate-influence-on-both-sides-of-the-immigration", "country": "US", "title": "Corporate influence on both sides of the immigration policy debate", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Corporate influence on both sides of the immigration policy debate", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-22T16:00:00.000+03:00", "replies_count": 0, "uuid": "3bc19f364ce1ff5198eca2ffbb29864f6ea6e57a"}, "author": "Ian M. Smith", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/245546-corporate-influence-on-both-sides-of-the-immigration", "ord_in_thread": 0, "title": "Corporate influence on both sides of the immigration policy debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 22, 2015, 09:00 am Corporate influence on both sides of the immigration policy debate By Ian M. Smith \n“What about Ag?” As a veteran Capitol Hill staffer recently told me, that’s the question invariably asked of members of Congress whenever they put their support behind a bill promising for better immigration enforcement or stronger border security. The power of the ‘Big Ag’ lobby (‘Ag’ is short for ‘Agriculture’) was put on display recently when it came out in full force against Rep. Lamar Smith’s Legal Workforce Act, a bill that would make mandatory the monumentally sensible and wildly popular E-Verify program—Sen. Grassley introduce its companion bill last month—Although a major player, Big Ag’s certainly not the only lobby with outsized influence over immigration policy; they’re merely in the top ten. \nPerhaps no other policy area is so thoroughly dominated by such a juggernaut of special interests as immigration. From the corporate lobbyists, like the Chamber of Commerce, the Big Tech firms and the National Association of Homebuilders, to the religious and ethnic lobbies, like the U.S. Conference of Catholic Bishops and the National Council for La Raza, it’s little wonder the gap between what the American people want versus what they get on immigration policy is wide enough to drive a truck through. ADVERTISEMENT Traditionally, lobbying’s been a greater concern for liberals and on occasion they do take aim at the corporate influence on immigration policy. Unfortunately, it’s usually from one side. This was observed recently by an immigration expansionist outfit called ‘Grassroots Leadership.’ In their new report , Payoff: How Congress Ensures Private Prison Profit with an Immigrant Detention Quota, the group attempts to document how private prison corporations have “profited handsomely” from Homeland Security’s mandatory detention quotas because, as they allege, the industry contributes millions of dollars in lobbying expenditures and campaign contributions “to ensure their interests are met.” Assuming there’s a connection between detention quotas and lobbying dollars, any honest immigration analyst knows it would be mere trifles compared to the real immigration profiteers. \nCombing through FEC data between 2008 and 2012, the transparency group the Sunlight Foundation found that other industry lobbyists Grassroots Leadership neglected to report on—e.g. Big Ag, Big Tech, and the construction industry—spent $1.5 billion pushing Congress to implement immigration expansionist measures of various kinds. And as the Sunlight Foundation points out, this $1.5 billion figure was spent in an off period for immigration activity; right in-between the demise of the McCain-Kennedy legalization bill of 2007 and the follow-up bill that was pushed by the Gang of Eight throughout most of 2013. In the four-year span, just for immigration, there were 6,712 quarterly lobbying reports filed by 678 lobbying organizations in 170 sectors mentioning 987 unique bills. \nThe influence game in immigration might be big; but that it could be dominated by a few private prison companies that want more detentions (which, it should be added, means they probably want porous , not secure, borders) instead of the corporate employers that want lower labor costs any fourth grader knowledgeable of the basic facts would find totally absurd. \nThat Sunlight’s finding went nowhere with liberal lobbying critics should eviscerate anyone’s faith in the power of persuasion on the immigration issue. How could Democrats not believe that mass immigration grinds down American wages given such a financial assault mounted by Big Business? Corporate lobbying in this area, immigration economist George Borjas calls , “the best piece of evidence” needed to show that wages drop when immigration rises. As he says, “why would employers tend to go to Washington and expend their resources lobbying for something that doesn’t benefit them?” \nFor decades now, America’s been developing an immigration industrial complex: a self-perpetuating machine whose gears are greased with lobbying funds forever topped up by slashed labor costs and increased consumption spurred on by record high and rising population growth. Whenever pro-enforcement bills manage to push through the tide, they’re either defunded or ignored . Take the 2006 Secure Fence Act that promised 700 miles of fencing along the southern border but never got the funding. Since then, both Saudi Arabia and Israel installed giant border fence projects to deter illegal immigration mostly from Yemen and Eritrea, respectively. The introduction and implementation stages for both projects were quick, seamless and uncontroversial. \nIn America, for veteran pro-enforcement folks concerned about the dwindling middle class, it’s been, as the saying goes, like two sides negotiating how to divide a pizza while one continues to eat it. \nThe negative effects of mass immigration and the interests behind them need to be better understood among the American elite as well as the general public. Other nationalities are apparently far ahead. Last month, Bank of England chief, Mark Carney, said it was indeed high immigration rates that have explained subdued salary increases in the UK. In Vancouver, Canada (my hometown), locals recently took to the streets to protest record-high property prices, which analysts have pinned down to huge flows of new immigrants from mainland China. Varying levels of anger have also been witnessed in Hong Kong , Singapore and Sydney for the same reason. Australia’s former Treasury Secretary, John Stone, had this to say following two reports on immigration he wrote while in power: [I]mmigration does not improve average Australians’ living standards, and that long-standing argument for it has no substance. Our corporate chieftains—including importantly those controlling our media—find that conclusion unacceptable. More immigrants mean more demand for their products, whether widgets or newspapers. Thus, when the latter editorialise about the need for large (and preferably larger) immigration programs “in the national interest”, they should declare their own. \nFor public officials in this country, Stone’s sentiment echoes the late Rep. Barbara Jordan (D-Texas), who while leading the 1994 U.S. Commission on Immigration Reform, wrote , \"Immigration, like foreign policy, ought to be a place where the national interest comes first, last, and always.” That, right there, should be the real bottom line for America. \nSmith is an investigative associate with the Immigration Reform Law Institute.", "external_links": [], "published": "2015-06-22T16:00:00.000+03:00", "crawled": "2015-06-22T18:23:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}