{"organizations": [], "uuid": "fb13ca04737302bcf37026c1ae635f5765b8712a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/clinton_061415screengrab.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/presidential-races/244953-clinton-obama-has-amazing-opportunity-on-trade", "country": "US", "title": "Clinton: Obama has 'amazing opportunity' on trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Clinton: Obama has 'amazing opportunity' on trade", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-14T21:33:00.000+03:00", "replies_count": 0, "uuid": "fb13ca04737302bcf37026c1ae635f5765b8712a"}, "author": "kballuck@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/244953-clinton-obama-has-amazing-opportunity-on-trade", "ord_in_thread": 0, "title": "Clinton: Obama has 'amazing opportunity' on trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 14, 2015, 02:33 pm Clinton: Obama has 'amazing opportunity' on trade By Mark Hensch Screengrab \nDemocratic presidential candidate Hillary Clinton said on Sunday that President Obama should use last Friday's defeat of his trade agenda to make it stronger. ADVERTISEMENT “The president has this amazing opportunity right now,” Clinton said at a rally in Iowa.\n“There are some specifics in there that can and should be changed,” she said of the Trans-Pacific Partnership (TPP). \n“Let’s take the lemons and turn it into lemonade,” Clinton added. “Let’s find out what’s in it and make it as good as it can be.” \nHouse Democrats stunned the Obama administration on Friday by rejecting his trade agenda. \nClinton urged Obama on Sunday to revisit TPP and strengthen the proposed agreement. \n“The president should listen to and work with his allies in Congress, especially Nancy Pelosi,” she said of House Minority Leader Nancy Pelosi (D-Calif.) \n“If I were in the White House, that’s what I’d be doing right now,” Clinton added. \nClinton said any sound trade deal must protect U.S. workers, raise wages and income and safeguard American national security. \nClinton additionally said that if she takes the Oval Office next year, she would defend the prosperity of America’s labor force in any future trade pacts. \n“No president would be a tougher negotiator on behalf of American workers with our trading partners and Republicans on Capitol Hill than I would be,” she said. \nRepublicans jumped on Clinton’s comments. \nAmerica Rising, a political action committee that conducts opposition research on Democrats, criticized Clinton as overly cautious. \n“Hillary Clinton’s failure to actually take a position on trade is yet another indication she’s running an overly cautious campaign that’s terrified of upsetting the far-left of her party,” said Jeff Bechdel, America Rising’s communications director. \n“Blandly stating that President Obama should work with Congress and turn lemons into lemonade is frankly embarrassing for someone who advocated for the Trans-Pacific Partnership just a few years ago,” he added. \n“By waffling on a trade deal she helped negotiate and once called a ‘gold standard,’ Hillary Clinton continues to show why voters overwhelmingly see her as dishonest and untrustworthy,” said Michael Short, spokesman for the Republican National Committee (RNC). \n“Unfortunately for Hillary Clinton, voters are much smarter than she thinks,” he added. \nClinton additionally advocated a number of domestic economic policies during her address on Sunday. \n“I will restore America to the cutting edge of innovation,” she said. “I will work to unleash a new generation of entrepreneurs and small business owners.” \n“I will rewrite the tax code so that it rewards hard work and investment at home rather than quick profits stashed overseas,” Clinton said. \n“It is way past time to end the outrage of many women earning less then men on the same job,” she added. “This isn’t a woman’s issue, it’s a family issue.” \n--This report was updated at 4:20 p.m.", "external_links": [], "published": "2015-06-14T21:33:00.000+03:00", "crawled": "2015-06-15T02:01:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}