{"organizations": [], "uuid": "c7998c799e34f1357355a7c1fa65f25298736c02", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/060815_an_corke_640.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/08/game-changer-hastert-accuser-transforms-coverage-sexual-abuse-allegations/", "country": "US", "title": "Obama under fire for saying no ‘complete strategy’ yet for training Iraqis", "performance_score": 8, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama under fire for saying no ‘complete strategy’ yet for training Iraqis", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-08T22:33:00.000+03:00", "replies_count": 0, "uuid": "3310d1ee0490463e13c7459111c2f5d9baf0247f"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/08/obama-under-fire-for-saying-no-complete-strategy-yet-for-training-iraqis/", "ord_in_thread": 0, "title": "Obama under fire for saying no ‘complete strategy’ yet for training Iraqis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama under fire for saying no ‘complete strategy’ yet for training Iraqis Published June 08, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama took heat Monday for admitting he doesn't yet have a \"complete strategy\" in hand for training Iraqis to fight the Islamic State -- months into the coordinated campaign to defeat the deadly terrorist network. \n\"When a finalized plan is presented to me by the Pentagon, then I will share it with the American people,\" Obama said, adding, \"We don't yet have a complete strategy.\" \nThe Republican National Committee reportedly said in a statement: \"What has President Obama been doing for the last 10 months?\" \nThe president addressed the ISIS fight during a press conference on the sidelines of the G7 summit in Germany. He appeared to be speaking specifically to a new strategy for accelerating the training and equipping of Iraqi security forces. \"We're reviewing a range of plans for how we might do that,\" Obama said. \nA U.S. official afterward stressed to Fox News that Obama was indeed talking only about optimizing that train-and-equip mission, \"including integration of Sunni fighters,\" and not \"overall strategy.\" State Department spokesman Jeff Rathke also said Obama was not speaking to overall strategy. \nBut the comments nevertheless fueled critics' concerns about the direction of the U.S. mission, particularly on the heels of ISIS gains in Ramadi, and the ancient city of Palmyra in Syria. \nSen. John McCain, R-Ariz., tweeted: \"Pres Obama admits: 'We don't yet have a complete strategy' to combat #ISIS\" \nA military official also took issue with Obama's claim that he was waiting for options from the Pentagon. \"What the f--- was that? We have given him lots of options, he just hasn't acted on them,\" the official told Fox News. \nObama, similarly, said last August that the U.S. did not \"have a strategy yet\" for confronting ISIS in Syria. The administration later approved airstrikes in Syria. \nUnderscoring the work to be done training Iraqi forces, a Pentagon official told Fox News that zero soldiers are being trained at the al-Asad Air Base in Anbar -- the province where ISIS seized the city of Ramadi last month. \nHowever, the Pentagon says 2,598 are in training at other locations in Iraq. And 8,920 Iraqi soldiers have been trained to date by the U.S. military. \nPentagon spokesman Col. Steve Warren backed up the president on his assertion he was still awaiting a \"finalized plan\" from the Pentagon. He said Defense Secretary Ash Carter has assembled a group of \"experts\" to develop courses of action to \"increase support\" to Iraqi forces. Warren would not give a timeline on when this \"finalized plan\" would be presented to the White House. \nA separate defense official told Fox News that any potential increases in the size of the U.S. military presence would likely be in the \"train-and-equip\" mission and not tactical air controllers to call in close air support against ISIS forces by U.S. aircraft flying overhead. \nEchoing the president, the official said, \"the problem is the number of recruits\" that the U.S. military can train. \"We are sending weapons as quickly as we can to Iraq, I don't think we can send anymore,\" he said. \nObama put some of the responsibility on the Iraqi themselves, urging them to be more inclusive. Speaking Monday, shortly after meeting with Iraqi Prime Minister Haider al-Abadi, Obama said a \"big part\" of the solution is \"outreach to Sunni tribes.\" \n\"We've seen Sunni tribes who are not only willing and prepared to fight ISIL, but have been successful at rebuffing ISIL. But it has not been happening as fast as it needs to,\" he said. \"And so, one of the efforts that I'm hoping to see out of Prime Minister Abadi and the Iraqi legislature when they're in session is to move forward on a national guard law that would help to devolve some of the security efforts in places like Anbar to local folks and to get those Sunni tribes involved more rapidly.\" \nFox News' Lucas Tomlinson contributed to this report. Fox News Politics", "external_links": [], "published": "2015-06-08T22:33:00.000+03:00", "crawled": "2015-06-08T23:12:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}