{"organizations": [], "uuid": "7df95ebcf7971a382ea52854ddb4cabfad7b874c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3117932/images/o-JAMES-FOLEY-PARENTS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/blog.xml", "section_title": "WorldPost Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/the-groundtruth-project/as-obama-shifts-hostage-p_b_7662378.html", "country": "US", "title": "As Obama Shifts Hostage Policy, the Foleys Remain Voices of Reason | The GroundTruth Project", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "As Obama Shifts Hostage Policy, the Foleys Remain Voices of Reason | The GroundTruth Project", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-25T18:46:00.000+03:00", "replies_count": 1, "uuid": "1c34840e20736a64a3f0cc8e23846fce31293ef3"}, "author": "The GroundTruth Project", "url": "http://www.huffingtonpost.com/the-groundtruth-project/as-obama-shifts-hostage-p_b_7662378.html#post-0", "ord_in_thread": 0, "title": "As Obama Shifts Hostage Policy, the Foleys Remain Voices of Reason | The GroundTruth Project", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Charles M. Sennott\nIn the aftermath of the nightmare video of James Foley's beheading at the hands of a masked leader of the Islamic State, his mother, Diane, stood strong before a forest of television cameras and reporters scratching notes.\nDon Emmerata/AFP/Getty\nShe showed an amazing grace, a beam of light that cut through the darkness of the Islamic State and the way they took her son's life last August.\nAnd ever since, she has consistently offered faith in the idea that her son died doing what he believed in as an American freelance journalist trying to tell the story of people suffering through the tragedy of war in Syria. She refused to allow hatred and bitterness to consume her.\nAnd when she was asked hard questions about culpability, she has offered the kind of quiet, constructive observation that a mother of five children has a chance to perfect over time.\nAt one point in the fall, she was asked about the White House, the State Department and the FBI and the collective failed response they provided amid a confusing and chaotic set of policies for families suffering through a hostage situation.\nShe replied, \"We can do better.\"\nWhen she was asked by students at the Medill School of Journalism, where her son studied in 2007, about the role of sometimes exploitative news organizations that rely on underpaid freelancers at a time of unprecedented peril for reporters in conflict zones, she had some similarly quiet but effective observations there as well, saying, \"I feel strongly that we can do better. The American press can do better.\"\nWe, as a country, can do better to help the families of hostages.\nAnd that was the message yesterday that President Obama offered in his briefing on a long-overdue, seven-month review of what the White House itself conceded was a broken policy. The president even recognized Diane Foley's own words, saying, \"Diane Foley, whose son Jim was killed by ISIL last year, said as Americans, we can do better. I totally agree. We must do better.\"\n\"These families have already suffered enough and should never feel ignored or victimized by their own government,\" Obama said.\nObama unveiled a new policy that he said was a direct result of the recommendations made by hostage families. Most of the families of other journalists and aid workers who have been held hostage by ISIS and other terrorist organizations have offered frustrations over the last year, similar to those of the Foleys, that the government was not responsive to their needs during their ordeal. Some, such as the Foleys, said officials were even threatening them with prosecution if they tried to negotiate the release of their son and offered to pay the ransom.\nThat policy was changed yesterday, and the president made it clear that no families would be prosecuted for opening up dialogue or trying to arrange to pay ransom for their loved ones.\nAmong the changes are: setting up a new hostage response group, a hub of senior officials that will be accountable to the president; naming a senior diplomat as a special envoy for ensuring that every effort is made to return hostages home; and establishing a coordinator for families, who will share information with them and be their voice in government.\n\"I'm making it clear that these families are to be treated like what they are: our trusted partners, and active partners in the recovery of their loved ones,\" said Obama.\nBut one thing that President Obama said will not change is that the United States government will not make concessions, such as paying ransom, to terrorist groups holding American hostages.\nIt's a long-standing policy and one that certainly seems rational from the point of view of the government and its desire not to create incentives for terrorist organizations to undertake more kidnapping, effectively funding their operations.\nMany European countries have in fact done this, paying ransom to the terrorists and saving the lives of their fellow countrymen. There are experts in this area who say it has in fact had the impact of encouraging more kidnapping, as the terrorist organizations know they will be paid for the release.\nBut as a parent, I don't think there are many of us who would not try to do everything in our power to bring our sons or daughters home, no matter what the cost or the long-term policy implications. And that is where Diane and her husband John Foley drive home the point of just how complex an issue this is for all of us. The apocalyptic nature of terrorism has changed the world, and inevitably we have to respond to the threats in new ways.\nYesterday, the country took a step toward doing better on this issue, but we still have a long way to go.\nAnd at the end of the day, the only way to ensure that these policy changes are effective is to make sure they are implemented. The proof that this change is genuine will be when the government actually offers better support to a family going through this ordeal or, more to the point, actually saves the life of an American being held hostage.\nAnd the government is not the only institution to be held accountable. Aid organizations have to be more careful in deployments to conflict zones, and media organizations have to completely rethink risk assessments when assigning any journalist to a place where kidnapping is a possibility and do more to ensure that young journalists have proper training, financial support and insurance.\nIn coordination with Diane Foley, a group of veteran journalists from a mix of news organizations, wire services and advocacy groups have sought to respond to James Foley's murder and an unprecedented level of violence directed against not just Western journalists but local journalists in many corners of the world who represent the vast majority of kidnappings and murders of journalists trying to do their jobs.\nOur response has been to try to put forward a new culture of safety for reporters through a shared set of protocols. This initiative, \" A Call for Global Safety Principles and Practices ,\" has been signed on to by more than 70 news organizations now, including the Associated Press, Reuters, and the BBC as well as USA Today and the Miami Herald and smaller news organizations such as GlobalPost and The GroundTruth Project.\nThe Foleys and the other families have every right to be skeptical that these changes to government policy announced by the White House will actually happen and every right to question whether news organizations will live up to the new culture of safety that we are trying to establish.\nAs always, we need to live up to the promises. We, as a country, owe it to the families who have lost loved ones to be sure all of these new policy changes are acted upon. We can definitely do better, and now we have to be sure we do.\nCharles Sennott is Executive Director of The GroundTruth Project, a nonprofit that trains and supports the next generation of international correspondents. He is also the co-founder of GlobalPost, where James Foley worked as a freelancer.\nFollow The GroundTruth Project on Twitter: www.twitter.com/GroundTruth\nMore: Islamic State Hostages Foreign Affairs James Foley Diane Foley", "external_links": ["http://www.twitter.com/GroundTruth", "http://dartcenter.org/content/call-for-global-safety-principles-and-practices#.VYwSFGTBzRY", "http://www.nytimes.com/2015/06/25/world/middleeast/obama-softens-policy-on-hostage-negotiations-with-terrorist-groups.html?_r=0"], "published": "2015-06-25T18:46:00.000+03:00", "crawled": "2015-06-25T23:21:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}