{"organizations": [], "uuid": "cc757a604fef83e15b5a15e62dc974334ec3ea72", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/0613%20gitmo%20transfers.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/14/navy-ship-christened-for-gabrielle-giffords-wounded-in-2011-shooting/", "country": "US", "title": "Obama transfers six more Gitmo detainees, including alleged bin Laden bodyguards", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama transfers six more Gitmo detainees, including alleged bin Laden bodyguards", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-14T07:00:00.000+03:00", "replies_count": 0, "uuid": "d3a94efbf95432e2175101709c3cef8bf8eda069"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/14/6-gitmo-detainees-sent-to-oman-signaling-restart-in-transfers/", "ord_in_thread": 0, "title": "Obama transfers six more Gitmo detainees, including alleged bin Laden bodyguards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama transfers six more Gitmo detainees, including alleged bin Laden bodyguards Published June 13, 2015   Email Print June 24, 2010: the entrance to Camp Delta at Guantanamo Bay. (AP) \nSix detainees at the Guantanamo Bay detention center, including two alleged Usama bin Laden bodyguards, have been transferred to Oman, the Pentagon said Saturday. \nThe terror-related detainees are all from neighboring and embattled Yemen. They departed Friday from the U.S. detention center, at a Naval base in Guantanamo Bay, Cuba, created in the aftermath of the 9/11 attacks to get terror suspects off battlefields. \nThis is the first time in roughly the past five months that Guantanamo suspects have been transferred, as Congress considers new restrictions on such moves. \nPresident Obama campaigned in 2008 to close the facility. The new transfers mark the departure of more than half of the 242 detainees who were at the facility when Obama was sworn into office in 2009. The number is now 116. \nNational Security Council spokesman Ned Price on Saturday repeated the Obama administration’s argument that keeping open the facility weakens national security by draining resources, damages U.S. relations with key allies and partners and emboldens violent extremists. \n“As the president has repeatedly made clear, the administration is determined to close the” facility, he said. “We are taking all possible steps to reduce the detainee population at Guantanamo and to close the detention facility in a responsible manner.” \nCongressional Republicans and other critics of releasing detainees argue they have the strong potential to return to the battlefield or commit other acts of terror. \n“It’s extremely troubling that the Obama administration has sent six dangerous terrorists to Oman, which borders Yemen -- a country engulfed in civil war and that serves as the headquarters for al Qaeda’s most dangerous affiliate,\" said New Hampshire GOP Sen. Kelly Ayotte, a member of the Senate Armed Services Committee. \n\"Even more disturbing is the fact that the administration has not provided sufficient assurances to Congress or to the public that these terrorists will not return to the battlefield. If they are not securely detained, no one should be surprised if they travel to Yemen and re-engage in terrorist activities,\" she said. \n2016 GOP presidential candidate and Florida Sen. Marco Rubio said: \"President Obama is once again putting his legacy above the safety and security of Americans. We need an effective detention program, not continued transfers of prisoners to countries without clear requirements for their monitoring to ensure they don't return to the battlefield.\" \nEach of six the new transferees was unanimously approved through the 2009 Executive Order Task Force. And they were approved by six federal departments or agencies -- the departments of Defense, State, Justice and Homeland Security, the Office of the Director of National Intelligence and the Joint Chiefs of Staff. Still, Obama remains far from achieving his closure goal, with just a year and a half left in office and as Capitol Hill lawmakers threaten to make the movement of prisoners even harder. \nThe transfers to Oman are the first to be given final approve by Defense Secretary Ash Carter, who has been on the job four months. \nThe six new transfers are Emad Abdullah Hassan, who has been on hunger strikes since 2007 in protest of his confinement without charge since 2002. \nAccording to court documents, Hassan said detainees have been force-fed up to a gallon at a time of nutrients and water. \nHe is accused of being one of many bodyguards for bin Laden, who led the al Qaeda terror group until killed by U.S. forces in 2011. Hassan also was allegedly part of a group planning to attack NATO and American troops in response to the 2001 invasion of Afghanistan. \nThe five other detainees sent to Oman were identified by the Pentagon as: \n-- Idris Ahmad 'Abd Al Qadir Idris and Jalal Salam Awad Awad, also both alleged bodyguards to bin Laden; \n-- Sharaf Ahmad Muhammad Mas'ud, whom the United States said fought American soldiers at Tora Bora before his capture in Pakistan; \n-- Saa'd Nasser Moqbil Al Azani, a religious teacher whom the U.S. believes had ties to bin Laden's religious adviser; and \n-- Muhammad Ali Salem Al Zarnuki, who allegedly arrived in Afghanistan as early as 1998 to fight and support the Taliban. \nThe Defense Department said it is grateful to the government of Oman for its “humanitarian gesture and willingness to support ongoing U.S. efforts to close the Guantanamo Bay” and that the U.S. coordinated with the Oman government to ensure the transfers took place consistent with “appropriate security and humane treatment measures.\" \nThe Oman News Agency reported early Saturday that the men would be living there “temporarily,” without elaborating. Sultan Qaboos bin Said approved the men being in the country to aid the U.S. while also taking into account the men’s “humanitarian circumstances,” the agency reported. \nOman's decision to accept the men comes as it has played an increasingly important role in mediations between the U.S. and Iran as world powers try to strike a nuclear deal over the Islamic Republic's contested atomic program. \nAll of the 11 detainees transferred this year have been from Yemen. At least 43 of the remaining 51 approved for transfer this year are from Yemen. \nThe administration won't send them home due to instability in Yemen, which has seen Shiite rebels known as Houthis take the capital, Sanaa, and other areas despite a campaign of Saudi-led airstrikes targeting them. \nAl Qaeda in the Arabian Peninsula, Yemen's local branch of the terror network that the U.S. considers to be the world's most dangerous offshoot of the group, also remains active in the country. \n\"We are working feverishly to transfer each of the 51 detainees currently approved for transfer,\" said Ian Moss, who works on detainee transfers at the State Department. \"It is not in our national security interest to continue to detain individuals if we as a government have determined that they can be transferred from Guantanamo responsibly.\" \nSome lawmakers want to impose stiffer requirements for transferring Guantanamo detainees to other countries. Obama has threatened to veto a House bill in part because of the Guantanamo restrictions. \nAn administration official said Oman agreed to accept the six Yemeni detainees about a year ago. But the defense secretary must give final approval to the move, and that has been a slow process at the Pentagon. \nThe U.S. administration official, speaking on a condition of anonymity without authorization to go on the record, told The Associated Press the Pentagon has sent no further transfer notification to Congress, which is required 30 days before detainees can be moved. \nThe Associated Press contributed to this report", "external_links": [], "published": "2015-06-14T07:00:00.000+03:00", "crawled": "2015-06-14T09:12:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}