{"organizations": [], "uuid": "489c1c80325eed65c08361a6f663e84bd6fc0237", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/fiorinacarly05232015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1625/feed", "section_title": "Presidential races", "url": "http://thehill.com/blogs/ballot-box/presidential-races/245672-fiorina-obama-has-burned-bridges-of-trust", "country": "US", "title": "Fiorina: Obama has 'burned bridges of trust'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Fiorina: Obama has 'burned bridges of trust'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-21T21:16:00.000+03:00", "replies_count": 0, "uuid": "489c1c80325eed65c08361a6f663e84bd6fc0237"}, "author": "kballuck@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/245672-fiorina-obama-has-burned-bridges-of-trust", "ord_in_thread": 0, "title": "Fiorina: Obama has 'burned bridges of trust'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 21, 2015, 02:16 pm Fiorina: Obama has 'burned bridges of trust' By Mark Hensch Getty Images \nGOP presidential candidate Carly Fiorina said in an interview broadcast Sunday that Americans should remain skeptical of President Obama’s trade agenda until they see concrete details. \n“Unfortunately, the president has demonstrated his ability to talk at a very high level about goals we can all agree on and then it turns out that the devil that is in the details is so different from those goals,” Fiorina told host John Catsimatidis on “The Cats Roundtable” on New York’s AM 970. ADVERTISEMENT “This president has burned bridges of trust with the American people,” she said.\n“Talk to us about this trade agreement, what’s in it and why it’s good for America,” Fiorina added. \nFiorina said she would continue opposing Obama’s proposed trading legislation until she learns more about it. \n“It is a complicated, multi-party agreement that has been negotiated in secret over years,” she said of the Trans-Pacific Partnership (TPP), a proposed trading pact with 12 Pacific Rim nations. \n“We don’t really know what’s in it,” she added. “The president hasn’t told us, and neither have the Republicans and Democrats who are pushing it.” \nFiorina said that one issue needing attention is what rules will govern international trading partners involved in the final deal. \n“I’m a big believer in free and fair trade, but I also know that we have trading partners like China violate trading agreements all the time,” the former Hewlett-Packard CEO said. \nFiorina argued on Sunday that the opaqueness surrounding TPP is a symptom of the federal government’s overall lack of accountability. \n“Our government has become so complicated only the wealthy and powerful can handle it,” she said. “Our government is one big, bloated bureaucracy.”", "external_links": [], "published": "2015-06-21T21:16:00.000+03:00", "crawled": "2015-06-22T03:34:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}