{"organizations": [], "uuid": "396839b653c6e7710feb18a2189941af66f919a4", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/25397/feed", "section_title": "Overnight Defense", "url": "http://thehill.com/policy/defense/overnights/246074-overnight-defense-obama-rolls-out-new-hostage-policy", "country": "US", "title": "Overnight Defense: Obama rolls out new hostage policy", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Defense: Obama rolls out new hostage policy", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-25T01:44:00.000+03:00", "replies_count": 0, "uuid": "396839b653c6e7710feb18a2189941af66f919a4"}, "author": "mmali@thehill.com (Martin Matishak and Kristina Wong)", "url": "http://thehill.com/policy/defense/overnights/246074-overnight-defense-obama-rolls-out-new-hostage-policy", "ord_in_thread": 0, "title": "Overnight Defense: Obama rolls out new hostage policy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Defense: Obama rolls out new hostage policy By Martin Matishak and Kristina Wong - 06/24/15 06:44 PM EDT \nTHE TOPLINE. President Obama on Wednesday announced a policy shift in dealing with hostages, allowing families of American hostages to offer ransom payments to their captors without the threat of prosecution, reports The Hill's Jordan Fabian. \nThe government will be able to help families communicate with terrorist groups and other organizations to help secure the release of hostages held overseas, but will not make concessions or ransom payments itself. \nObama's shift came after a wave of executions of American hostages by the Islamic   (ISIS), including journalists James Foley and Steven Sotloff, and aid worker Kayla Mueller. ADVERTISEMENT Victims' families have long accused the government of treating them poorly or giving them conflicting information about how they can help their relatives.\n\"Many of the families told us that they at times felt like an afterthought or a distraction,\" Obama said. \"That ends today. I'm making it clear that these families are to be treated like what they are -- our trusted partners and active partners in the recovery of their loved ones.\" \nThe policy changes include the creation of a new interagency office headquartered at the FBI, known as a hostage recovery fusion cell, to better coordinate response efforts with captives' families. \nThe State Department will also name a special presidential envoy for hostage affairs to communicate with foreign governments involved in freeing U.S. hostages. \nThere are more than 30 Americans still being held hostage abroad, the president's top counterterrorism adviser, Lisa Monaco, said reporters Wednesday. She said the policy changes were intended to create a \"partnered approach\" with families to rescue their loved ones. \nCritics in Congress said giving families tacit approval to make private ransom payments could provide further incentive for terror groups to kidnap American citizens. \n\"I've been very concerned that the president's posture has not only encouraged negotiation with terrorists but has had the United States negotiating with terrorists,\" Rep. Michael Turner (R-Ohio), a member of the House Armed Services and Intelligence committees, told The Hill. \"It's bad precedent.\" \n\nGOP BRACES FOR IRAN DEAL. As the final deadline nears for a nuclear deal with Iran, Republicans appear to be setting up for a vote on the agreement. \nThe Hill's Jordain Carney reports that Republican senators are raising their rhetoric against the deal on Iran's nuclear program with just days for negotiators to finalize a long-term agreement. \nRepublicans slammed the Obama administration for backsliding on demands over the course of negotiations. \n\"It seems to me that using the term 'negotiation' is a stretch,\" Sen. Roy Blunt (R-Mo.), the vice chairman of the Senate Republican conference, said Wednesday from the Senate floor. \n\"Two years ago, we said things that we would insist on. Two years later, none of those things appear to be things that are still being discussed in these Iranian so-called negotiations,\" he added. \nAnd Sen. Ron Johnson (R-Wis.) cast doubt on the deal, citing Iran's opposition to allowing any military sites to be inspected, \"I think we're being played. \n\"I think a deal at this point would be very destabilizing. It would not be a good deal,\" he said. \nThe administration is required to submit the deal to Congress by July 9 for review, under legislation passed earlier this year. Under the bill, Senate Majority Leader Mitch McConnell (R-Ky.) can either bring up a resolution of approval, disapproval or do nothing. \nThere was plenty of skepticism in the House over the nearing Iran deal, as well. \nHouse Foreign Affairs Committee Chairman Ed Royce (R-Calif.) is questioned whether the White House was making too many concessions to Iran. \n\"The Obama Administration is dropping its bottom-line by the day,\" Royce said in a statement Wednesday, citing media reports that Iran will use its underground nuclear reactor in Fordo for isotope production. \n\"While we once demanded that this hardened mountain-top facility be shut, we are now on the verge of accepting technology there that can quickly be re-engineered for bomb-making fuel,\" according to Royce. \n\nDOD: NO CHANGES FOR BASES WITH CONFEDERATE NAMES. The Defense Department said there has been \"no discussion\" on renaming U.S. military bases that honor Confederate officers. \n\"As of now, there's no discussion of adjusting our current naming policies,\" said Army Col. Steve Warren, a Pentagon spokesman. \nSome lawmakers and government officials have called for Confederate flags and other symbols to be removed from government properties in the wake of a mass shooting at a historic black church in Charleston, S.C. \nThe outcry has prompted questions over whether the Army should rename several of its military installations named after Confederate generals and a colonel. \nThe installations include some of the most well known Army installations: Fort Benning in Georgia, Fort Bragg in North Carolina and Fort Hood in Texas. \nWarren said the naming of military installations is up to the individual services. \n\"The services are ultimately responsible for naming their own military installations, and as of now, there are no current plans to change policies regarding how installations are named.\" \nThe Army issued a statement later on Wednesday explaining the use of the names, but did not indicate whether any changes would be coming. \n\"Every Army installation is named for a soldier who holds a place in our military history,\" according to Army Chief of Public Affairs Brig. Gen. Malcolm B. Frost. \n\nBENGHAZI DEMS WANT VOTE ON DEPOSITION. Democratic members of the House panel investigating the 2012 attacks in Benghazi, Libya, called for a vote on releasing the deposition of Hillary Clinton confidant Sidney Blumenthal. \nIn a letter to House Select Committee on Benghazi Chairman Trey Gowdy (R-S.C.), the panel's five Democrats invoked the procedures that were adopted by the House when the panel was established last year to demand a vote. \n\"The chair and the ranking minority member shall consult regarding the release of depositions,\" the Democrats wrote. \"If either objects in writing to a proposed release of a deposition or a portion thereof, the matter shall be promptly referred to the Select Committee for resolution.\" \n\"It appears that all of these prerequisites have been fulfilled,\" they said. \nIn their letter, Democrats charge that Gowdy and his fellow Republicans have already treated Blumenthal differently because he was brought in under subpoena and the select committee has already released his emails to and from Clinton. \n\"Chairman Gowdy attempted to schedule a meeting so Members could discuss this matter but the Democrats chose to send out a press release instead. They remain uniquely focused on anything other than substantively advancing the Benghazi investigation,\" committee spokesman Jamal Ware said in a statement. \n\n-- US aim for ' zero civilian casualties ' draws criticism \n-- Obama does damage control with France over NSA spying \n-- Clinton calls Charleston shooting 'racist terrorism' \n-- DHS to clear out immigrant families from detention centers \n-- French outraged over news of NSA spying", "external_links": [], "published": "2015-06-25T01:44:00.000+03:00", "crawled": "2015-06-25T10:36:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}