{"organizations": [], "uuid": "ef315a93a06b2d8bac4afa27117993018a9f3f8e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/travel/blog.xml", "section_title": "Travel Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/bob-schulman/mexico-debuts-quickie-imm_b_7520038.html", "country": "US", "title": "Mexico Debuts Quickie Immigration Clearance for Some Arrivals at Popular Airports | Bob Schulman", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 5, "title_full": "Mexico Debuts Quickie Immigration Clearance for Some Arrivals at Popular Airports | Bob Schulman", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-05T20:10:00.000+03:00", "replies_count": 4, "uuid": "0f62418d653cf30021014f2a1535a6ab9ee2c255"}, "author": "Bob Schulman", "url": "http://www.huffingtonpost.com/bob-schulman/mexico-debuts-quickie-imm_b_7520038.html#post-0", "ord_in_thread": 0, "title": "Mexico Debuts Quickie Immigration Clearance for Some Arrivals at Popular Airports | Bob Schulman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Do the immigration lines at airports serving Mexico's big beach resorts seem to be getting longer and longer? Actually they are, because our neighbor south of the border is enjoying double-digit upturns in tourism - and the lines will likely get even longer next year when current caps on transborder flight frequencies are tossed out.\nTravelers pack a Mexican resort airport. Photo by Bob Schulman.\nBut now some travelers can skirt those lines. U.S. citizens who belong to the nation's Global Entry Program (which lets incoming member passengers zip through automated kiosks at America's international airports) can apply for membership in a new Mexican program called Programa Viajero Confiable (Trusted Traveler Program).\nPhoto courtesy of U.S. Customs and Border Protection/Josh Denmark.\nThe Mexican program - also available to Mexican citizens - is already up and running at three terminals: the airport serving Cancun and the Riviera Maya, the airport at Los Cabos (Cabo San Lucas and San Jose del Cabo) and at Mexico City's Benito Juarez International Airport.\nWhat's more, according to Mexico's Secretariat of the Interior, the program is expected to debut shortly at 10 more Mexican terminals.\nLike the U.S. program, the Mexican version requires wanna-be members to fill out an online application, then pay a fee (in pesos, roughly equivalent to US$100) on their credit cards.\nAfter that, applicants have six months to schedule an in-person interview to complete the process. If you vet out OK, you're approved for a five-year period.\nKeep in mind, the interview has to be at one of the participating Mexican airports. If you've booked a stay at a resort in, say, Cancun for a week in August, and there's an opening that week for your airport appointment, you're OK - as long as nothing happens to scuttle your trip down south. If it does, you'll need to make another date for the appointment on a later trip.\n'Trusted Travelers' arriving in Mexico get to the beaches much quicker. Photo by Bob Schulman.\nDuring your interview the Mexican examiner will check your passport, shoot a picture of you and take your fingerprints and an iris scan. Unless there's a hitch in the vetting process, the next time you fly south of the border you'll be able to simply slip your passport into a kiosk slot, look at the camera and put your fingers on a glass scanning device - then head off to the beach while non-member visitors are still standing on those snaking lines to the immigration desks.\nYou'll find the locations of the appointment rooms at the Mexican airports and everything else you'll need to sign up for the program on its website, http://www.viajeroconfiable.inm.gob.mx/index.php/home/.\nMore: Travel to Mexico Cancun Riviera Maya Los Cabos Mexico City Global Entry", "external_links": [], "published": "2015-06-05T20:10:00.000+03:00", "crawled": "2015-06-07T20:15:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}