{"organizations": [], "uuid": "765c3e7c2146e01de1541c10a911356189cfb25d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/entertainment/blog.xml", "section_title": "Entertainment Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/marc-hershon/podcast-review-wtf-with-g_b_7670544.html", "country": "US", "title": "Podcast Review: WTF With Guest President Obama | Marc Hershon", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Podcast Review: WTF With Guest President Obama | Marc Hershon", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-26T16:39:00.000+03:00", "replies_count": 0, "uuid": "765c3e7c2146e01de1541c10a911356189cfb25d"}, "author": "Marc Hershon", "url": "http://www.huffingtonpost.com/marc-hershon/podcast-review-wtf-with-g_b_7670544.html", "ord_in_thread": 0, "title": "Podcast Review: WTF With Guest President Obama | Marc Hershon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yes, Obama said the N-word. But I'll get to that in a minute. The main thing is that it feels like podcasting just leveled up this week. Not that President Obama hasn't ever been on a podcast before. Heck, he started out having his own when he first got into the White House. But this week he crosses a threshold -- literally -- when he steps into Marc Maron's garage.\nWith his appearance on WTF this week, it's like the President is sitting down on the set of comedy podcasting's version of The Daily Show . To be fair, Maron modifies his usual \"thing\" a bit. There's no opening litany of listener types, portmanteaus that all start with the F-word. And there's no busting of balls that can happen when the host is particularly comfortable with his guest (contrast Obama's appearance to last week's show with guest Godfrey.)\nMaron is properly respectful and maintains his cool, regardless of how much he talks about almost losing it preparing for this episode. Obama comes across, as is his style, very personable and friendly, but I'm not sure we learn anything new about the man from this appearance. Again, the significance is more in where he's appearing and what that means in regards to the prominence and importance of podcasting as a medium.\nThe President is a facile speaker and his answers to Maron's questions are smooth and fairly lengthy. (I kept imagining Obama in a mock up of Maron's garage at the White House, with a staffer peppering him in advance with Maronesque questions, prepping for the show.)\nNow, about that N-word. Naturally, the fact that the President utters it has mostly been taken out of context: \"Obama said the n-word!\" Frankly, in the way it's being used -- as a reference, really -- there's been a lot more made of it than needed. See for yourself: \"Racism, we are not cured of it. And it's not just a matter of it not being polite to say 'nigger' in public. That's not the measure of whether racism still exists or not.\" More like a teachable moment than something deserving of great hue and cry.\nKudos to Maron for landing a great milestone guest and, by the simple act of having POTUS sitting in his garage, it's likely that the importance of podcasting as a mass communication medium, has taken a big step forward. (Libsyn, the podcasting network that distributes WTF, reported more than 700,000 downloads in the first 24 hours after the show dropped early Monday morning.)\nNot to mention sending up a signal flare to politicians everywhere that -- in podcasting -- they now have a new outlet from which to campaign.\nTHE AFTERMATH : Want to hear Marc Maron's thoughts and feelings on having played host to The President? His followup episode, WTF #614 , dropped Thursday. It features Maron and his producer, Brendan McDonald, chatting about the visit, how the interview came about in the first place, and the amazing preparations that led up to making sure \"The Garage\" was ready to receive the leader of the free world.\n--\nOther podcasts I'm listening to this week: Think Again with Jason Silva; and Doug Loves Movies with Geoff Tate, Amy Miller & Sean Jordan.\n--\nThe WTF review originally posted as part of This Week In Comedy Podcasts on Splitsider.com.\nMarc Hershon is the host and executive producer of Succotash , The Comedy Podcast Podcast, featuring clips from comedy podcasts from across the Internet as well as interviews with podcasters, comedians, and assorted show biz folk.\nFollow Marc Hershon on Twitter: www.twitter.com/hershco\nMore: Marc Maron Barack Obama President WTF Marc Hershon Succotash Comedy Podcast Think Again Doug Loves Movies This Blogger's Books and Other Items from... I Hate People!: Kick Loose from the Overbearing and Underhanded Jerks at Work and Get What You Want Out of Your Job\nby Jonathan Littman, Marc Hershon", "external_links": ["http://bigthink.com/think-again-nil-a-big-think-podcast/think-again-podcast-episode-1-art-feat-jason-silva", "http://www.wtfpod.com/podcast/episodes/episode_613_-_president_barack_obama", "http://ecx.images-amazon.com/images/I/41CWwuEsECL._SL160_.jpg", "https://www.whitehouse.gov/podcast", "http://splitsider.com/2015/06/this-week-in-comedy-podcasts-president-obama-visits-marc-maron-on-wtf/", "http://dlm.libsyn.com/geoff-tate-amy-miller-and-sean-jordan-guest", "http://www.twitter.com/hershco", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.amazon.com/", "http://www.amazon.com/exec/obidos/ASIN/0316032298", "http://www.wtfpod.com/podcast/episodes/episode_614_-_the_president_was_here"], "published": "2015-06-26T16:39:00.000+03:00", "crawled": "2015-06-26T16:14:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}