{"organizations": [], "uuid": "617a340e93f3a8a4889a4cf14b05e94d1aaa751e", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/presidential-races/246186-pro-rubio-group-pans-obama-on-iran", "country": "US", "title": "Pro-Rubio group pans Obama on Iran", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Pro-Rubio group pans Obama on Iran", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-25T22:56:00.000+03:00", "replies_count": 0, "uuid": "617a340e93f3a8a4889a4cf14b05e94d1aaa751e"}, "author": "dweaver@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/246186-pro-rubio-group-pans-obama-on-iran", "ord_in_thread": 0, "title": "Pro-Rubio group pans Obama on Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 25, 2015, 03:56 pm Pro-Rubio group pans Obama on Iran By Ben Kamisar \nA group tied to Sen. Marco Rubio is hitting the airwaves with a new ad campaign characterizing the Florida senator as the key opponent of “Obama’s bad Iran nuclear deal.” \nThe new spot is from the Conservative Solutions Project, a nonprofit linked to J. Warren Tompkins, the leader of the Conservative Solutions super-PAC that is backing Rubio’s presidential bid. The nonprofit told The Washington Post that it will spend more than $1 million to wage the Iran campaign on television, radio and the Internet. ADVERTISEMENT “President Obama is negotiating a bad deal with Iran. Sen. Marco Rubio is fighting to stop it,” the narrator says, as the ad transitions to clips of Rubio and Israeli Prime Minister Benjamin Netanyahu blasting the deal.\n“Tell your senators to join Marco Rubio, vote against Obama’s deal and stop Iran from getting the bomb.” \nThe clips show Rubio eviscerating the negotiations with Iran over its nuclear program. A group of six nations, including the United States, have until June 30 to iron out the remaining terms of the deal after agreeing to a framework earlier this year. \n“In 2003 the world told Iran ‘You cannot have any enrichment capability.’ Then it became ‘OK, you can enrich, but only up to 20 percent.’ Then it became ‘OK you can enrich over 20 percent, but you have to ship it overseas.’ Now it’s ‘OK you can enrich at 20 percent, but you can only use it to a research reactor,’” Rubio is seen saying in a clip from a Freedom Partners summit earlier this year. \n“At this pace, in five years we are going to build the bomb for them.” \nAs a non-profit, the Conservative Solutions Project doesn’t have to disclose its donors, unlike the related super-PAC. \nConservative Solutions PAC spokesman Jeff Sadosky told National Journal in May that the two groups are “related” but entirely separate. That’s likely for election law reasons and why the ad doesn’t mention Rubio’s presidential ambitions but instead only focuses on him in relation to the Iran policy. \n“They are separate and distinct entities,” Sadosky said. \n“One is focused on supporting Marco Rubio's potential presidential campaign, and one is focused on issue education.\"", "external_links": [], "published": "2015-06-25T22:56:00.000+03:00", "crawled": "2015-06-26T13:19:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}