{"organizations": [], "uuid": "5f6bb4a9ab103d6db76f1a33683a40888ef29840", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1150546/images/o-MEDICAL-MARIJUANA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/new-york/blog.xml", "section_title": "New York Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/eden-g-fromberg-do/farmtodispensary-medical-_b_7654382.html", "country": "US", "title": "Farm-to-Dispensary Medical Marijuana in New York: Grass Roots and Black Dirt | Eden G. Fromberg, DO", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "Farm-to-Dispensary Medical Marijuana in New York: Grass Roots and Black Dirt | Eden G. Fromberg, DO", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-26T19:54:00.000+03:00", "replies_count": 1, "uuid": "806ce71dd90435d29f409378bb1c436121fd4049"}, "author": "Eden G. Fromberg, DO", "url": "http://www.huffingtonpost.com/eden-g-fromberg-do/farmtodispensary-medical-_b_7654382.html#post-0", "ord_in_thread": 0, "title": "Farm-to-Dispensary Medical Marijuana in New York: Grass Roots and Black Dirt | Eden G. Fromberg, DO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At last, New Yorkers with serious medical conditions including cancer, HIV, Parkinson's disease, epilepsy, inflammatory bowel disease, neuropathies, MS, and severe chronic pain will be able to access medical marijuana . Sponsored by NYS Senator Diane Savino, New York State's Compassionate Care Act , passed on June 23, 2014, and the recent passage of the emergency access bill accelerates the original January, 2016 implementation date. With the alleys of Wall Street already known for years to be fragrant with the scent of cannabis, it's no surprise that big business has been sniffing around to see where they can gain advantage.\nWith New York City leading the way with its revolutionary Smoke Free Air Act of 2002 , updated in 2009 to include hospitals, and the New York State Clean Indoor Air Act of 2003 , it makes sense that the Compassionate Care Act specifically prohibits smoking and instead mandates that marijuana extracts be ingested in vapor, oil or pill forms. With New York State's abundant agricultural bounty, growing marijuana locally, farmer's market style for those of us in the city, makes perfect sense. It would follow that the excellent doctors of New York State with proven experience prescribing botanical medicine and controlled substances in clinical and research settings in the management of intractable conditions be at the forefront of medical marijuana. But when there's money involved, and with health care and marijuana becoming industries, how could it be so simple? In 2016 alone, medical marijuana revenues statewide are estimated to reach 239 million, and by 2020, over 1.2 billion, generating generous state tax revenues. Investors, venture capitalists, hopeful speculators, and Wall Streeters are circling like vultures, attending food service courses and $900 a plate expos hosted by tanning salon entrepreneurs . Only 5 licenses to grow and process medical marijuana will be granted, each license providing for 4 dispensaries, a total of only 20 for all of New York State.\nAs a doctor, my first question is: Shouldn't doctors, not entrepreneurs , be leading the way? At least doctors, even doctor entrepreneurs, are ethically bound to act in the best interests of patients and are presumably already doing so. My next question: shouldn't New York State residents have a leg up on the license application process? We already live and do business here, after all. Yet big money interests outside of New York have apparently been able to sweet talk their way through the New York State legislature and become welcomed applicants for the coveted 5 medical marijuana licenses. New Yorkers, particularly those of us in the city, are accustomed to having the freedom to do things our way, with our nondiscrimanatory, hard edged yet endearing (it grows on you), entirely multicultural and multiethnic New York combination of street smarts and sophistication. And our doctors and medical infrastructure are among the best in the nation. The last thing we need to do is outsource the incredible resources that we already have right here to out of state and nonmedical interests who have money ahead of our own best interests in mind.\nGrow facility\nSome people compare New York City to various European cities , and New York State, with its agricultural bounty and wine regions, to the French countryside. Even the most savvy pot entrepreneur from Colorado would have to spend a few growing seasons experiencing New York State's unique agricultural conditions to truly understand and get a feel. We are blessed with some of the best soil in the nation. New York's unofficial State soil, Honeyoye in the Iroquois language, is fertile and deep, with origins in glacial tills rich in limestone and shale, comprising approximately a half million acres. But New York State has some even better soil than that. Only an hour outside of New York City, in Orange County, is the nation's only Black Dirt region outside of the Florida Everglades. Known locally as \"muck soil\", the Black Dirt region of no more than 26,000 acres, spanning Orange County into Northern New Jersey represents an ancient glacial lake bed filled with more mastodon fossils found than anywhere in the world. While most soil contains at best 10% organic matter, Black Dirt, rich in sulfur and nitrogen, contains, according to an Orange County agricultural extension agent, \"...30 to 50 percent and sometimes up to 90 percent organic matter. It's basically a giant bowl of compost.\" In the Orange County Town of Goshen, in the heart of the Black Dirt region , on May 14, 2015, the town council voted unanimously to approve medical marijuana facility in an existing structure intended to be renovated by local contractors and employ local residents. The facility is owned and operated by Scientific Herbal Advances, a top contender for one of the coveted five licenses to be issued by New York State.\nDr. Ramesh Sawhney\nScientific Herbal Advances is poised to take advantage of some of the most nutrient-rich soil in the nation to grow medical marijuana in Goshen, New York. Grass roots if not salt of the earth is the best way to describe this doctor-owned and operated business. At the helm of Scientific Herbal Advances are Dr. Ramesh Sawhney, a Board Certified anesthesiologist and Ayurvedic pain management specialist with over 25 years of experience in conventional and botanical medicine, and his wife, Dr. Nina Bhardwaj, with both an MD and PhD from New York University School of Medicine, and an award-winning expert in neuroimmunology. They are working with a team of scientists and experts to make medical marijuana in New York State more of a farm-to-table, organic, holistic, patient-centered experience. Patient care, not money, comes first. In spite of ambitious plans to open dispensaries not only in Manhattan, not far from the legendary Union Square Farmer's Market, but also in Mineola, Rochester, and Binghamton, NY, the facilities will offer a slid scale to provide qualified patients with low cost medicine and involve no big business funding to influence their decisions. Dr. Sawhney has observed the positive benefits of medical marijuana with his own mother, who resides in California and has Alzheimer's disease. Medical marijuana had such a positive effect on Dr. Sawhney's mother's cognitive abilities that he feels a calling to help patients with a range of conditions experience the clinically evident benefits. Dr. Bharadwaj, upon investigation, immediately saw the connection between her own research and the potential clinical benefits of cannabinoids in the treatment of cancer, and believes that further research and development are essential. Scientists working with the doctors believe that, based on comparative analysis of food crops, a higher concentration of essential oils containing medicinal compounds can be achieved through growing in Goshen's nutrient dense and mineral-rich black dirt, fueling vigorous plant growth, maximum foliage development, superior flower size and weight, and natural resistance to root fungus and mold. A team of doctors, scientists, and researchers is poised to study the medicines once they are manufactured, and will gear them toward specific illnesses and unique patient needs, such as cancer, ALS, and childhood epilepsy.\nWith New Yorkers finally on the brink of medical marijuana patient access, it is exciting to me as a New York State licensed physician to see doctors and herbalists - like Drs. Sawhney and Bharadwaj, with a background in medical research and clinical practice already embodying the compassion and the care - be at the forefront of the implementation of the Compassionate Care Act. It is in patients' best interest.\nhttp://www.nysenate.gov/video/2014/jun/23/senator-diane-savino-announces-passage-compassionate-care-act-new-york-state-senat\nhttp://www.nyc.gov/html/doh/html/environmental/smoke-law.shtml\nhttps://www.health.ny.gov/prevention/tobacco_control/clean_indoor_air_act/\nhttps://www.health.ny.gov/regulations/medical_marijuana/\nhttp://nypost.com/2015/05/03/hundreds-vie-for-just-5-ny-medical-marijuana-licenses/\nhttp://mjbizdaily.com/companies-laying-groundwork-for-new-york-mmj-industry/\nhttp://www.nytimes.com/2014/11/02/nyregion/a-competition-to-get-a-medical-marijuana-license-in-new-york.html?_r=0\nhttp://mjbizdaily.com/companies-laying-groundwork-for-new-york-mmj-industry/\nhttp://www.huffingtonpost.com/2014/03/03/15-nyc-neighborhoods_n_4440240.html\nhttp://www.nrcs.usda.gov/wps/portal/nrcs/detail/ny/soils/?cid=nrcs144p2_027281\nhttp://www.nytimes.com/2007/10/24/dining/24onio.html?_r=0\nhttps://en.m.wikipedia.org/wiki/Black_Dirt_Region\nhttp://www.reuters.com/article/2015/06/01/sci-herbal-advances-idUSnPn9drk3f+80+PRN20150601\nMore: Medical Marijuana Marijuana Marijuana Chronic Pain Cáncer Inflammatory Bowel Disease", "external_links": ["https://www.health.ny.gov/regulations/medical_marijuana/", "http://www.nytimes.com/2007/10/24/dining/24onio.html?_r=0", "http://www.nrcs.usda.gov/wps/portal/nrcs/detail/ny/soils/?cid=nrcs144p2_027281", "http://www.nytimes.com/2014/11/02/nyregion/a-competition-to-get-a-medical-marijuana-license-in-new-york.html?_r=0", "http://www.nysenate.gov/video/2014/jun/23/senator-diane-savino-announces-passage-compassionate-care-act-new-york-state-senat", "http://mjbizdaily.com/companies-laying-groundwork-for-new-york-mmj-industry/", "https://www.health.ny.gov/prevention/tobacco_control/clean_indoor_air_act/", "http://nypost.com/2015/05/03/hundreds-vie-for-just-5-ny-medical-marijuana-licenses/", "http://www.reuters.com/article/2015/06/01/sci-herbal-advances-idUSnPn9drk3f+80+PRN20150601", "https://en.m.wikipedia.org/wiki/Black_Dirt_Region", "http://www.nyc.gov/html/doh/html/environmental/smoke-law.shtml"], "published": "2015-06-26T19:54:00.000+03:00", "crawled": "2015-06-28T04:01:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}