{"organizations": [], "uuid": "f09ee03ebf5b1043956a0a4f60f345231cc050c3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/pelosinancy_061115gn.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/policy/finance/244858-shaking-off-obama-pelosi-stuns-the-house", "country": "US", "title": "Shaking off Obama, Pelosi stuns House", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Shaking off Obama, Pelosi stuns House", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-12T22:39:00.000+03:00", "replies_count": 0, "uuid": "f09ee03ebf5b1043956a0a4f60f345231cc050c3"}, "author": "Peter Schroeder", "url": "http://thehill.com/policy/finance/244858-shaking-off-obama-pelosi-stuns-the-house", "ord_in_thread": 0, "title": "Shaking off Obama, Pelosi stuns House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shaking off Obama, Pelosi stuns House Greg Nash By Peter Schroeder - 06/12/15 03:39 PM EDT \nThe death knell for President Obama’s push to pass a set of trade bills on Friday came from an unlikely source: House Minority Leader Nancy Pelosi (D-Calif.). \nJust hours after Obama huddled privately with Pelosi, one of his closest allies in Congress, she joined a liberal uprising that defeated a critical trade assistance bill and halted progress on a legislative package that the White House desperately wants lawmakers to pass. \n“We want a better deal for American workers,” Pelosi said from the House floor. ADVERTISEMENT Many members believed Pelosi, like most in of her caucus, would vote against fast-track legislation that would help finalize the Trans-Pacific Partnership. What few people knew was that she would also oppose Trade Adjustment Assistance (TAA), a worker retraining program long favored by Democrats and labor unions.Liberals mounted a last-minute revolt against the TAA bill, scuttling it in a 302-126 vote that placed the entire package in limbo.According to members, Pelosi had been mum on how she would come down on the matter, caught between a president she has steadfastly supported and a left wing in open revolt.\nWhen she announced her opposition to TAA in a floor speech minutes before the vote, there were gasps in the House chamber, followed by applause from liberal colleagues.Pelosi argued that voting against the worker training bill was the best chance to slow down the fast-track legislation and, by extension, the trade pact that labor unions and liberals had hotly criticized.AFL-CIO President Richard Trumka praised Pelosi as being “instrumental” in defeating the legislation.“She stood up against corporate interests and as always put first the people who are too often left out of trade agreement discussions,” he said in a statement. “I applaud Rep. Pelosi’s bravery and leadership on this and look forward to working with her on good trade bills.”Pro-trade Democrats said they were stunned by Pelosi’s announcement.“She gave no indication of what she was going to do,” said Rep. Mike Quigley (D-Ill.), who called her decision “disappointing.”Rep. John Delaney (D-Md.) said he was particularly surprised because Pelosi had spent much of the week haggling with Speaker John Boehner (R-Ohio) over TAA to win over Democrats. First she worked to replace the way the bill's costs were offset and then won a change in voting procedure.“I was surprised,” said Delaney. “She had been so successful in reformulating TAA to be a much better bill. It was really her bill.”Pelosi even said at a Thursday press conference that the matter had been fixed, but still she declined to say how she would vote.While Pelosi’s opposition was a high-profile rebuke of Obama’s agenda, members were skeptical that she pushed Democrats away from the bill. Instead, they said, her stance was likely a recognition of where her caucus had already arrived.“In the end, leadership has a tendency to recognize where its membership is,” said Rep. Danny Davis (D-Ill.). “If people aren’t there, then leadership mirrors [that.]” Following the vote, the White House declined to criticize Pelosi, as press secretary Josh Earnest said the president had a “long, warm and productive relationship” with her.In a letter to Democrats following the vote, Pelosi argued Friday’s proceedings were a \"clear indication\" Republicans needed to rework the fast-track bill with Democrats. She suggested the odds for that bill would \"greatly increase with the passage of a robust highway bill,\" suggesting there were additional ways to attract Democratic support. Jordan Fabian contributed.", "external_links": [], "published": "2015-06-12T22:39:00.000+03:00", "crawled": "2015-06-13T00:51:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}