{"organizations": [], "uuid": "1d4d049523f6595848db036f5e29dd76cf903dde", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamafuneral_060615.png", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/244206-hundreds-gather-for-beau-bidens-funeral", "country": "US", "title": "Obama honors Beau Biden’s ‘life of meaning’ in eulogy", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama honors Beau Biden’s ‘life of meaning’ in eulogy", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-06T17:55:00.000+03:00", "replies_count": 0, "uuid": "1d4d049523f6595848db036f5e29dd76cf903dde"}, "author": "esmilowitz@thehill.com (Rebecca Shabad)", "url": "http://thehill.com/blogs/blog-briefing-room/news/244206-hundreds-gather-for-beau-bidens-funeral", "ord_in_thread": 0, "title": "Obama honors Beau Biden’s ‘life of meaning’ in eulogy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 06, 2015, 10:55 am Obama honors Beau Biden’s ‘life of meaning’ in eulogy President Obama on Saturday said Beau Biden lived “a life of meaning” and a “life for others” in a eulogy at a packed funeral service at St. Anthony of Padua church in Wilmington, Del. “He was a sign of an incredible family who brushed away the possibility of privilege for the harder, better reward of earning his own life,” Obama said. “He was a soldier who dodged glory and exuded true humility. A prosecutor who defended the defenseless. The rare politician who collected more fans than foes and the rare public figure who prioritized his private life above all else.” ADVERTISEMENT Beau Biden, who died at 46 a weekago, was Vice President Joe Biden’s oldest son. He served as attorney general of Delaware and had been eyeing a run for governor. “He did in 46 years what most of us couldn’t do in 146,” Obama said. “It’s no secret that a lot of what made Beau the way he was is just how much he loved and admired his dad.” Beau Biden studied law like his dad at the same law school, and both went into public service, Obama recounted. “He learned how to make everybody else feel like we matter because his dad taught him that everybody matters. He even looked and sounded like Joe,” Obama said. “Although I think Joe would be the first to admit that Beau was an upgrade: Joe 2.0,” he said, drawing laughs from the crowd. Before he finished his roughly 20-minute eulogy, Obama said his family are “honorary members” of the Bidens now. “Joe you are my brother,” Obama said. “I’m grateful every day that you’ve got such a big heart, and a big soul, and those broad shoulders. I couldn’t admire you more.” Gen. Raymond Odierno also eulogized Biden, who served in Iraq when Odierno was the commanding general there. Odierno presented a military award known as the Legion of Merit in his memory. “Beau possessed the traits I have witnessed only in the greatest leaders: inspirational, humble, intelligent, insightful, always building a team and a man of incredible moral and personal courage,” Odierno said. “Frankly, he was selfless to a fault.” Beau Biden’s siblings Hunter and Ashley also shared memories about their brother. First lady Michelle Obama, their daughter Sasha and the first lady’s mother also traveled to Wilmington for the service. Other senior White House officials are in attendance as well. Along the Obamas’ motorcade route, people held up signs saying “God bless the Biden family” and “God bless Beau and Joe,” a White House pool report said. Chris Martin, lead singer of Coldplay, performed at the service as a soloist, singing “Til Kingdom Come.” Martin heard through a family friend that Beau Biden loved Coldplay and volunteered to attend the service. Ciaran Sheehan also performed as well as a soloist, along with cellist Jesus Morales and trumpeter Sgt. First Class Roger Blanchard. Former President Bill Clinton and Democratic presidential candidate Hillary Clinton attended the service, as well as members of Obama’s cabinet and members of Congress. Some members of Congress present are: Senate Majority Leader Mitch McConnell (R-Ky.), Senate Minority Leader Harry Reid (D-Nev.), House Minority Leader Nancy Pelosi (D-Calif.), House Democratic Whip Steny Hoyer (D-Md.) and Sens. Patrick Leahy (D-Vt.), Joe Manchin (D-W.Va.), Tom Carper (D-Del.) and Chris Coons (D-Del.). Reps. Steve Israel (D-N.Y.), Chris Van Hollen (D-Md.), Sheila Jackson Lee (D-Texas), Debbie Wasserman Schultz (D-Fla.), Dutch Ruppersberger (D-Md), Niki Tsongas (D-Calif.), David Cicilline (D-R.I.) and John Carney (D-Del.) also attended. Caroline Kennedy, U.S. ambassador to Japan and daughter of the late President John F. Kennedy, attended the service, as did former Attorney General Eric Holder. Vicki Kennedy, the widow of the late Sen. Ted Kennedy (D-Mass.), who also died of brain cancer, was at the service. The mass comes after two days of services and public viewings for Beau Biden. On Friday, the Bidens greeted every mourner that came through the church — for 10 hours — from 1 p.m. until 11 p.m., according to a White House pool report. Beau Biden is not the first close family member the vice president has lost. In 1972, Joe Biden lost his first wife and their infant daughter in a car crash. The accident injured Beau and Hunter Biden. In May, Beau Biden was hospitalized at Walter Reed Medical Center and was receiving treatment for an unknown medical issue. In August 2013, he had been diagnosed with brain cancer and lesion was removed as a medical center in Houston, Texas. His health, however, soon improved.", "external_links": [], "published": "2015-06-06T17:55:00.000+03:00", "crawled": "2015-06-07T05:04:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}