{"organizations": [], "uuid": "06f276116d8882dead1e2945b32026a3b3e2cfa5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/ali-jahangiri/investment-immigration-pr_b_7658336.html", "country": "US", "title": "Investment Immigration Programs Compete with EB-5 | Ali Jahangiri", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Investment Immigration Programs Compete with EB-5 | Ali Jahangiri", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-26T20:06:00.000+03:00", "replies_count": 0, "uuid": "06f276116d8882dead1e2945b32026a3b3e2cfa5"}, "author": "Ali Jahangiri", "url": "http://www.huffingtonpost.com/ali-jahangiri/investment-immigration-pr_b_7658336.html", "ord_in_thread": 0, "title": "Investment Immigration Programs Compete with EB-5 | Ali Jahangiri", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After spending the past few months traveling around China, I have witnessed firsthand a proliferation of foreign programs. These investment immigration programs are aimed at attracting foreign capital in exchange for permanent residency or even just a passport.\nThis industry is certainly not new, as investor immigration programs have existed for more than 30 years. However, there is little doubt that the number and popularity of these programs have increased tremendously in recent years as countries vie for foreign capital. Approximately half of the European Union members have immigration investor programs. Throw in Australia, New Zealand and the United States' EB-5 investor visa program , and the marketplace looks surprisingly crowded.\nOn any given weekend in China, banks and migration agents hold numerous seminars to promote these global investment immigration programs. I recently visited a large migration office with more than 100 cubicles, along with a large, illuminated picture of the world covering one entire wall. Just around the corner was a conference room stocked with brochures for countries such as Portugal, Greece, Spain, the United Kingdom, Antigua and countless others. A willing investor can pick a destination and relocate his family to many of these countries as easily as booking a vacation.\nThe EB-5 program, which is uniquely demanding for its job creation requirement and at-risk nature, has been a strong player recently with the Chinese hitting their EB-5 visa cap for the past two fiscal years. U.S. dominance in this arena is not a given, however; we have major competition.\nIn 2012, Australia launched its Significant Investor Visa program requiring an investment of $5 million (AUD). The program yielded just 65 visas in 2013, 91 percent of which were granted to Chinese nationals . However, this has increased to 1,679 applications submitted and 751 visas approved as of March 2015 . Similarly, Portugal's Golden Residence Permit program, in which an immigrant investor may simply acquire properties above 500,000 euros in total, grew from two investors in 2012 to 1,526 in 2014 .\nBelow is a partial list of the more prominent international investor immigration programs, with the lowest qualifying investment amounts listed:\n• Australia ($5 million AUD)\n• Netherlands (€1.250 million)\n• Singapore (S$2.5 million)\n• United States ($500,000 USD)\n• Greece (€250,000)\n• Portugal (€500,000)\n• Spain (€500,000)\n• Antigua & Barbuda ($200,000 USD)\n• Dominica ($100,000 USD)\n• Malta (€880,000)\n• St. Kitts & Nevis ($250,000 USD)\n• Ireland (€400,000)\n• New Zealand (NZ$1.5 million)\n• United Kingdom (£2 million)\nThese programs, including EB-5, are all competing for foreign capital. In the midst of this competition, despite widespread support for the EB-5 program , negative commentary continues to abound from fringe groups arguing that \"people are buying their way into the country,\" and that \"EB-5 creates an avenue for terrorists to enter the United States.\" Such statements are simply not accurate when you take a step back and examine the facts.\nFirst, critics often lose sight of the EB-5 program's size and purpose. In 2013, the United States granted 990,553 individuals lawful permanent residence . EB-5 is allotted just 10,000 visas per fiscal year. Thus, at most, 1% percent of those aforementioned individuals earned residency through EB-5. In short, EB-5 is intended to be an immigration program directly tied to economic stimulation (creation of US jobs) - a requirement not found in most other investor visa programs.\nThis country does a great job of welcoming a diverse group of families, students, asylum seekers and investors alike. There is room under the tent for all visa categories. Because EB-5 involves an investment, people tend to view it as flashy or sensational, and they lose the big-picture perspective of the program's job creation aspect.\nMoreover, if critics of the program had the opportunity to meet an EB-5 investor, they would see that immigrant investors embody the American dream. For example, while in Shanghai my colleague and I met Mr. Yao, an investor who successfully obtained his U.S. permanent residence via an EB-5 visa. He started his career as a high-tech equipment sales agent and eventually opened his own company in 1995.\nFor nearly three years, he carefully considered various immigration routes and the countries he could move to with his family. He decided on the United States in 2006 - the same year his daughter started high school. Mr. Yao wanted her to have the best post-secondary education possible and for his family to stay together.\nHe was worried about the at-risk nature of his EB-5 investment, but ultimately decided that this risk was worth it to move to the United States. \"I took a lot of time to really study the program's legislation, to make sure the program is real and promising,\" he said.\nPeople like Mr. Yao, whose story is representative of many immigrant investors, have plenty of choices for immigration through investment, and more such programs will likely join the mix in coming years. The question is: would you prefer that investors like him purchase a home in Portugal, or that they make an investment in the United States that must create at least 10 US jobs? I know my immediate answer is the latter.\nEB-5 is not the only option for investment immigration consumers around the world. Both Portugal (offering European regional access) and Australia have achieved tremendous growth this past year and will soon take a majority of the market share. Accordingly, we should work together with our legislators to achieve improvements in the US EB-5 program in order to keep it competitive. Otherwise, the United States risks losing this category of foreign capital, as well as a powerful job creation tool.\nFollow Ali Jahangiri on Twitter: www.twitter.com/eb5visaportal\nMore: Eb 5 Eb 5 Visa Immigration Reform Immigration China Investment Immigration EB 5 Program", "external_links": ["http://www.exteriores.gob.es/Embajadas/CANBERRA/en/InformacionParaExtranjeros/Pages/Prueba.aspx", "http://www.ibtimes.com/chinese-immigrants-dominate-australias-significant-investor-visa-program-invest-288m-australia", "http://www.sef.pt/documentos/56/Mapa_ARI_EN_till30apr2015.pdf", "http://iip.gov.mt/wp-content/uploads/2014/07/IIP-Brochure-v1.2_updated.pdf", "http://cip.gov.ag/investment-options/ndf/", "http://www.loc.gov/law/help/investor-visas/investor-visas.pdf", "http://cbiu.gov.dm/citizenship/", "http://www.inis.gov.ie/en/INIS/Pages/New", "http://www.austrade.gov.au/invest/significant-investor-visa-and-premium-investor-visa-programmes", "http://www.twitter.com/eb5visaportal", "http://www.edb.gov.sg/content/dam/edb/en/why", "http://www.uscis.gov/eb-5", "http://www.eb5investors.com/eb5-basics/what-is-eb5", "http://www.immi.gov.au/pub-res/Pages/statistics/significant-investor-visa-statistics.aspx", "http://ciu.gov.kn/?q=node/13", "http://www.investingreece.gov.gr/default.asp?pid=225&la=1", "https://ind.nl/EN/individuals/residence-wizard/wealthy-foreign-national", "http://www.ccpi.pt/pages/portugal-golden-residence-permit_8", "https://www.newzealandnow.govt.nz/move-to-nz/new-zealand-visa/visas-to-invest/investor-visa", "http://www.cnn.com/2013/11/06/us/immigration-statistics-fast-facts/", "https://www.gov.uk/tier-1-investor/overview", "http://money.cnn.com/2015/04/15/news/economy/china-us-visa-eb5-immigrant-investor/", "http://www.eb5investors.com/blog/polis-amodei-introduce-bipartisan-legislation-to-permanently-authorize-investor-visa-program"], "published": "2015-06-26T20:06:00.000+03:00", "crawled": "2015-06-26T20:26:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}