{"organizations": [], "uuid": "e453143a18f3f35a1ea7f628fa66b0211b9b7ac0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/mccainjohn_031015fr.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/246125-mccain-obama-turns-blind-eye-to-violence-against-christians", "country": "US", "title": "McCain: Obama turns blind eye to violence against Christians", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McCain: Obama turns blind eye to violence against Christians", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-25T18:36:00.000+03:00", "replies_count": 0, "uuid": "e453143a18f3f35a1ea7f628fa66b0211b9b7ac0"}, "author": "mhensch@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/news/246125-mccain-obama-turns-blind-eye-to-violence-against-christians", "ord_in_thread": 0, "title": "McCain: Obama turns blind eye to violence against Christians", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 25, 2015, 11:36 am McCain: Obama turns blind eye to violence against Christians By Mark Hensch \nSen. John McCain (R-Ariz.) said on Thursday that President Obama is turning a blind eye to extremist violence against Christians overseas. \nMcCain argued in an op-ed published that morning that the Obama administration is particularly ignoring those persecuted by the Islamic State in Iraq and Syria (ISIS). ADVERTISEMENT “The Obama administration has repeatedly refused to defend religious freedom abroad and continues to ignore its devastating cost to those religious communities targeted by terrorists because of their religious beliefs,” McCain wrote in a “Fox News” article titled “Christianity under attack: US must do more to promote religious freedom.” \n“While the world has been rightly outraged by the violence waged by ISIS against people of all sects, ethnicities and religions, the United States, Europe and other key allies have done little to end ISIS’s systematic efforts to drive-out and eradicate entire religious communities from their historic and sacred homelands,” he added in the article co-authored with Tony Perkins, president of the Family Research Council. \nMcCain said that Christianity had especially suffered under the rise of ISIS and other radical Islamist groups like it. \n“Throughout the Middle East and North Africa today, Christianity is under attack,” he said. \n“Terrorist organizations such as [ISIS] are destroying some of the oldest and most sacred Christian communities and relics in the world on the very lands where Christianity was born and first took root,” McCain said. \n“They are committing brutal atrocities against Christian communities in Syria and Iraq, persecuting religious minorities and destroying entire towns and local economies,” he added. \nThe senator urged Obama to make defending Christianity and other religions persecuted by terrorist groups a key part of his counterterrorism strategy. \nDoing so, he argued, would eliminate the economic, political and social causes of extremism abroad. \n“As a nation founded in the pursuit of religious freedom, America can and must do more to root-out the religious intolerance that is helping to foster much of the political instability and violence we see today,” McCain said. \n“Properly designed and implemented, a U.S. foreign policy committed to religious freedom can advance our national security interests, stabilize and consolidate the spread of democracy across the globe, help sustain economic growth and promote the equality of men and women,” he added. \nThe Arizona lawmaker additionally said that preserving freedom of religion is important given its crucial role in American history. \n“Finally, we must remain committed to religious freedom because of the special distinction religious freedom holds as a fundamental human right — a belief that is shared by democratic countries across the globe and protected by numerous international treaties and agreements,” McCain said. Tags:", "external_links": [], "published": "2015-06-25T18:36:00.000+03:00", "crawled": "2015-06-26T02:36:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}