{"organizations": [], "uuid": "56df9b119e9e9a5b6e50862cc9a0f2122a568365", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/2013-02-15-gn-himes_jim-1.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/243863-obama-says-he-has-20-dem-votes-on-fast-track", "country": "US", "title": "Obama says he has 20 Dem votes on fast-track", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama says he has 20 Dem votes on fast-track", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-03T16:42:00.000+03:00", "replies_count": 0, "uuid": "56df9b119e9e9a5b6e50862cc9a0f2122a568365"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/243863-obama-says-he-has-20-dem-votes-on-fast-track", "ord_in_thread": 0, "title": "Obama says he has 20 Dem votes on fast-track", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 03, 2015, 09:42 am Obama says he has 20 Dem votes on fast-track By Jordan Fabian Greg Nash \nPresident Obama believes he has 20 Democratic votes in the House for a bill to grant him fast-track authority to negotiate new trade deals. \nThe president revealed his whip count to Rep. Jim Himes (Conn.) during a phone call intended to talk the undecided Democrat into backing the legislation. Himes said he spoke to Obama as recently as Monday, according to The Wall Street Journal . ADVERTISEMENT Obama’s estimate puts him closer to the number of votes needed to pass the fast-track bill through the House. \nIt is higher than other counts, including The Hill ’s, which show as few as 14 House Democrats would vote for the legislation. \nIt’s not clear exactly how many Democratic votes the president will need, but it could be more than 20 due to opposition from Republican lawmakers who generally back free trade but are reluctant to grant Obama more power. \nIf Speaker John Boehner (R-Ohio) can muster 200 votes from his conference, Obama would need 18 Democrats to back him. \nThe fast-track measure is critical to advancing a sweeping 12-nation trade agreement with Pacific Rim nations, which is at the top of Obama’s second-term agenda. \nObama is making an aggressive effort to sway undecided Democrats, who are also facing pressure to oppose the bill from labor unions and liberal groups that fear new free trade agreements would cost Americans jobs. \nHimes told the Journal he spoke to the president on the phone Monday, and took calls from White House officials last week. \n“He asked me: do you really think — based on my record — do you really think I would be fighting for something that would hurt the American middle class?” Himes said. “I’ve got to try to see what he sees.” \nDemocrats are also looking for assurances from the president that he will offer political support from organized labor, which has already launched ad campaigns against lawmakers who back the fast-track bill. \nThe White House said Tuesday the president has told lawmakers he is prepared to offer political cover if they side with him. \n“The president has been clear that he’ll stand with the Democrats who stand with him on this issue,” said press secretary Josh Earnest. Tags: Paul joins crusade to expose... The Bush administration blacked out 28 pages extracted from a... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-03T16:42:00.000+03:00", "crawled": "2015-06-04T02:09:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}