{"organizations": [], "uuid": "c29c6a7729bf852645345c51513589944b0c1911", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/overnights/245046-overnight-finance-feds-overstepped-on-aig-obama-gop-look-to-save", "country": "US", "title": "OVERNIGHT FINANCE: Feds overstepped on AIG; Obama, GOP look to save trade bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT FINANCE: Feds overstepped on AIG; Obama, GOP look to save trade bill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-16T01:53:00.000+03:00", "replies_count": 0, "uuid": "c29c6a7729bf852645345c51513589944b0c1911"}, "author": "mmali@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/overnights/245046-overnight-finance-feds-overstepped-on-aig-obama-gop-look-to-save", "ord_in_thread": 0, "title": "OVERNIGHT FINANCE: Feds overstepped on AIG; Obama, GOP look to save trade bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT FINANCE: Feds overstepped on AIG; Obama, GOP look to save trade bill By Kevin Cirilli - 06/15/15 06:53 PM EDT \nTOMORROW STARTS TONIGHT: JEB BUSH LAUNCHES CAMPAIGN. From The Hill's Jesse Byrnes: Jeb Bush formally announced his bid for the White House on Monday with a speech that sought to tie Hillary Clinton closely to Barack Obama and his policies... Bush suggested that Clinton would be untested in the Democratic primary, and that if she won her party's nomination she would represent President Obama's third term... Bush is joining an extremely crowded field of candidates pursuing the nomination, and the former Florida governor has stumbled since announcing he would explore a bid for the White House late last year.\" http://bit.ly/1JQEBCc \n1.) WHAT JEB SAID: \"The presidency should not be passed on from one liberal to the next... The party now in the White House is planning a no-suspense primary, for a no-change election to hold onto power.\" ADVERTISEMENT 2.) NYT: \"As the third member of his family to seek the nation's highest office, he brings to the race a last name that at once burnishes and tarnishes, evoking the nobility of public service and a deep distrust of political entitlement.\" http://nyti.ms/1IEXd52 \n3.) TEA PARTY SLAMS BUSH , via Greg Richter for right-leaning Newsmax: \"Bush's positions on education and immigration are 'a nonstarter with many conservatives,' Tea Party Patriots co-founder Mark Meckler told The Associated Press. 'There are two political dynasties eyeing 2016 and before conservatives try to beat Hillary, they first need to beat Bush.'\" http://nws.mx/1IZlGFd \nTHIS IS OVERNIGHT FINANCE. I hope everyone had a great weekend. I had an awesome time back home in Delco with my family. I'll be on Capital Insider on NC8tonight at 8pm. Thanks to THE Neil Cavuto for having me on Fox Business Network earlier today. Tweet: @kevcirilli ; email: kcirilli@thehill.com ; and subscribe: http://thehill.com/signup/48 . \nBIG DEAL - - JUDGE: FEDS 'NO RIGHT' TO RUN A COMPANY. Pete Schroeder: \"A court ruled Monday that the federal government was 'unduly harsh' in its takeover of AIG during the financial crisis, but refused to award the company's former head any damages. The ruling draws to a close the high-profile lawsuit against the federal government, brought by Maurice Greenberg, the former head of the insurance giant, and other AIG shareholders under the umbrella of Starr International.\" Pete's story: http://bit.ly/1FXYbWV \nTwo takeaways: \n1.) The government violated the constitution in taking over the company, according to the ruling. Schroeder : \"In his ruling, Judge Thomas Wheeler determined the federal government violated the Constitution by stepping in and effectively seizing the insurance company during the crisis, even if the takeover was intended to save the company from imminent bankruptcy.\" \n2.) This was a largely symbolic ruling. Schroeder: \"Since AIG would have ceased to exist almost immediately had the government not stepped in, the judge also determined that Greenberg and the shareholders were not due the billions of dollars in damages sought.\" http://bit.ly/1C99tpu \n-- HOW IT PLAYED: \"WSJ: Former AIG Chief Hank Greenberg Wins Moral Victory in Bailout Trial.\" Read the ruling: http://bit.ly/1BiDwQs \nLEGISLATIVE DAYS UNTIL EX-IM CHARTER EXPIRES: 7. Center-right American Action Forum's Andy Winkler in a blog post: \"Ex-Im reauthorization should include sensible reforms to limit distortionary economic effects, add greater transparency and accountability, and protect taxpayers. But wholesale elimination of Ex-Im would ignore the international context in which Ex-Im operates and disadvantage American companies.\" http://bit.ly/1R1rL31 \nFIDUCIARY FIGHT: CHAMBER ASSAILS OBAMA PROPOSAL. Tom Donohue, CEO of The Chamber of Commerce, in a blog post: \"Good intentions do not guarantee good regulations. Unintended consequences often eclipse the improvements a rule aims to make, ultimately causing more harm than good. Such is the case with the Department of Labor's (DOL's) proposed fiduciary duty rule, which purports to protect consumers but could actually limit their access to retirement services or lock them out of the retirement market altogether.\" http://uscham.com/1G7N3pu \nHOUSE GOP: 'WE'VE GOT OPTIONS' ON TRADE. Cristina Marcos: \"House Republicans have made no decisions on how to move a trade package forward following a colossal defeat on the floor at the end of last week. House Majority Leader Kevin McCarthy (R-Calif.) repeatedly dodged questions on Monday about the GOP's next steps, even as he said time is running out.\" http://bit.ly/1JTJlWc \n-- Meanwhile, The Hill's Jordan Fabian is reporting that \"President Obama will likely speak to Speaker John Boehner (R-Ohio) on Monday to find a path forward on a stalled trade package, the White House said.\" http://bit.ly/1dGOzbk \nON TAP FOR THE WEEK. My exclusive sneak-peak at what's driving the week in Washington for financial services wonks: http://bit.ly/1LboJdP \nQUOTABLE, former 2012 presidential nominee Mitt Romney on Hillary Clinton: \"When you see her on stage or when she comes into a room full of people, she's smiling with her mouth but her eyes are saying, 'Where's my latte?'\" he said on MSNBC's Morning Joe . Story: http://bit.ly/1MEu0YL Watch the Vine: https://vine.co/v/eep0MglmvTE \nWHY IS THE GOP BASHING WALL STREET? My piece from yesterday: \"Republican presidential candidates are increasingly adopting anti-Wall Street rhetoric, as they assail Democrats' tactics to rein in big banks and appeal to voters' distrust of the financial sector. \n\"In recent weeks, former Texas Gov. Rick Perry declared he is 'fed up' with Wall Street's antics, Sen. Ted Cruz (R-Texas) slammed Goldman Sachs and Ohio Gov. John Kasich derided the banking industry as rife with greed. \n\"The fiery language comes as the landmark 2010 Dodd-Frank financial reform law nears its fifth anniversary next month. The Democrat-backed statute, Congress's response to the 2008 economic crisis, put into place hundreds of new regulations, including new designations for 'systemically important' financial institutions.\" http://bit.ly/1Sf8HRi", "external_links": [], "published": "2015-06-16T01:53:00.000+03:00", "crawled": "2015-06-16T17:38:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}