{"organizations": [], "uuid": "c56bc34a8a497b07878edd931b16f425d0fa6dba", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/243657-obama-calls-for-transparent-legal-process-for-malaysias-ibrahim", "country": "US", "title": "Obama calls for transparent legal process for Malaysia's Ibrahim", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama calls for transparent legal process for Malaysia's Ibrahim", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-02T00:03:00.000+03:00", "replies_count": 0, "uuid": "c56bc34a8a497b07878edd931b16f425d0fa6dba"}, "author": "Jordan Fabian", "url": "http://thehill.com/blogs/blog-briefing-room/news/243657-obama-calls-for-transparent-legal-process-for-malaysias-ibrahim", "ord_in_thread": 0, "title": "Obama calls for transparent legal process for Malaysia's Ibrahim", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "June 01, 2015, 05:03 pm Obama calls for transparent legal process for Malaysia's Ibrahim By Jordan Fabian \nPresident Obama on Monday urged Malaysia to ensure the prosecution of a well-known opposition leader does not trample on democratic rights. \nDuring an event with young Asian leaders at the White House, Obama was asked about the controversial conviction of Anwar Ibrahim on sodomy charges. Ibrahim has dismissed his conviction as a politically motivated attack by the government. ADVERTISEMENT Obama said it is essential for the legal process not to have a “chilling effect” on political opposition in the southeast Asian nation. \n“As I always point out: democracy is hard,” Obama said. “I think that any of the things that are said about me are terribly unfair. But the reason American democracy has survived for so long is because people, even if they’re wrong, have the right to say what they think.” \nThe president called on Malaysia to maintain an open and transparent legal process in Ibrahim’s case. \n“What you don’t want is a situation in which the legitimacy of the process is questioned, that has an adverse impact on democracy as a whole,” the president said. \nEarlier this year, a Malaysian court upheld a five-year sentence for Ibrahim, who was convicted on charges of having sex with a male former staffer in his political party. \nIbrahim in February said the case was part of “a political conspiracy to stop my career.” The U.S. and other Western government have also been critical of his conviction. \nIn order for a democracy to function, “you have to respect the rights of people you disagree most with,” Obama said. \nDuring the event, the president also touted his foreign policy accomplishments as a central part of how he will be judged after he leaves office. \nThe president said he has helped restore international respect for the United States by focusing on diplomacy. He cited his efforts to restore relations with Cuba, reach a nuclear deal with Iran and promote democracy in Myanmar. \nObama’s defense of his record came as Republican presidential candidates, such as Sen. Lindsey Graham (R-S.C.), have argued his policies have made the world less safe. \n“People don’t remember, when I came into office, the United States in world opinion ranked below China and just barely above Russia,” Obama said. “And today, once again, the United States is the most respected country on earth.” \nThe president said that in part “because of the work we did to reengage the world and say that we want to work with you as partners with mutual interest and mutual respect.” \n“I think we’ve been able to put our relationships on a stronger footing,” he added.", "external_links": [], "published": "2015-06-02T00:03:00.000+03:00", "crawled": "2015-06-02T00:14:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}