{"organizations": [], "uuid": "929539dbf8fbd114f11d4a06e0f8a549a1f571fd", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/overnights/244357-overnight-defense-gop-slams-obama-over-isis", "country": "US", "title": "OVERNIGHT DEFENSE: GOP slams Obama over ISIS", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT DEFENSE: GOP slams Obama over ISIS", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-09T02:01:00.000+03:00", "replies_count": 0, "uuid": "929539dbf8fbd114f11d4a06e0f8a549a1f571fd"}, "author": "mmali@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/overnights/244357-overnight-defense-gop-slams-obama-over-isis", "ord_in_thread": 0, "title": "OVERNIGHT DEFENSE: GOP slams Obama over ISIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT DEFENSE: GOP slams Obama over ISIS By Kristina Wong - 06/08/15 07:01 PM EDT \nRepublicans blasted President Obama on Monday after he said the U.S. did not have a \"complete strategy\" against ISIS yet. \n\"We don't yet have a complete strategy,\" Obama told reporters during the G-7 summit in Germany, reported The Hill's Jordan Fabian. \nObama was referring to efforts to train and arm local Iraqi forces to reclaim territory lost to the Islamic State in Iraq and Syria (ISIS). ADVERTISEMENT \"The details of that are not yet worked out,\" he said. \nBut Republicans pounced on his remarks, which came 10 months after the start of the U.S.-lead fight against ISIS. \n\"The threat posed by ISIL is growing exponentially, and President Obama's lack of a strategy is Commander-in-Chief malpractice,\" said Sen. Lindsey Graham (R-S.C.), a 2016 contender, using an alternate name for the terror group. \n\"It's long past time we upped our game to confront this dangerous and growing threat to the American homeland,\" he added. \n\"It is no surprise this Administration does not have a 'complete strategy' for training Iraqis to fight ISIS,\" said House Homeland Security Committee Chairman Michael McCaul (R-Texas). \"What is surprising is that the President admitted it.\" \nTRAINING TROUBLES: Obama also pressed Iraqi Prime Minister Haider Al-Abadi to speed up the development of local forces. \nDefense officials told The Hill on Monday that the training mission has stalled at one of five coalition training sites because Baghdad has not sent any new recruits. \nThe U.S. is currently training 2,601 Iraqi forces, but none of them are at the Al Asad site, officials said. \n\"Al Asad has zero. And Al Asad has had zero now for some time,\" said a defense official on background. \nThe training and equipping of Sunni tribal fighters became more urgent after the fall last month of Ramadi, the capital of Anbar Province, a region known as the \"Sunni heartland.\" \nSunni forces who were defending the city said they had not received any training or equipment from the central government, which is dominated by Iraqi Shiites. \nThe U.S. has resisted directly training or equipping Sunni forces out of concern it could undermine Baghdad, which views the Sunni minority population with mistrust. \nNEW ISIS WAR MEASURE: Sens. Tim Kaine (D-Va.) and Jeff Flake (R-Ariz.) introduced a measure on Monday that would authorize military force against the Islamic State in Iraq and Syria . \nThe measure, offered as an amendment to a State Department policy bill being considered this week, comes 10 months after the U.S. began its military campaign against the terrorist group in Iraq. The two senators are hoping to revive the largely stalled discussion on the authorization, which has been hampered by partisan disagreement. The White House sent over draft language for an authorization for use of military force (AUMF) in February, but Republicans said it was too restrictive, and Democrats said it was not restrictive enough. The White House's measure would limit authorization to three years and repeal the 2002 AUMF for the Iraq War. It would leave in place the 2001 AUMF that's being used against ISIS and ban \"enduring offensive ground combat operations.\" Kaine and Flake said they hoped their measure, which would also sunset in three years and repeal the 2002 AUMF, would be a \"starting point for debate.\" The Kaine-Flake measure has a clause making the AUMF the sole statutory authority for U.S. military action against ISIS. It would also specify that the \"use of significant U.S. ground troops in combat\" -- except to protect U.S. citizens from imminent threat -- would be inconsistent with the use of force. \"It's inexcusable that Congress has let 10 months of war go by without authorizing the U.S. mission against ISIL,\" said Kaine, who has been a leading voice calling for an authorization of force. \"Our military has been waging war against ISIL since last September, and Congress has been appropriating funds to pay for those operations. It's past time for Congress to formally voice its support of the mission itself,\" added Flake. \nARMY WEBSITE HACKED BY SYRIA? The Army's website was breached on Monday by the group known as the Syrian Electronic Army, reported The Hill's David McCabe. \n\"Today an element of the Army.mil service provider's content was compromised,\" Brig. Gen. Malcolm B. Frost said in a statement about the hack. \"After this came to our attention, the Army took appropriate preventive measures to ensure there was no breach of Army data by taking down the website temporarily.\" Ars Technica reported that the group had left a message claiming responsibility. \n\"Your commanders admit they are training the people they have sent you to die fighting,\" the group said. \nThe website of U.S. Strategic Command also seemed to experience a disruption, but was still accessible around 4:00 p.m. ET. Lieutenant Colonel Martin L. O'Donnell, a spokesperson for U.S. Strategic Command, said that he was unaware of any issues with their website. The reported attack echoes other incidents involving the group. In May, they claimed responsibility for vandalizing The Washington Post's mobile website. \nThe group supports Syrian President Bashar Assad and targets outlets it believes treat him unfairly. \nRUBIO TRIES TO BLOCK GITMO TRANSFERS: Sen. Marco Rubio (R-Fla.) is hoping to use an annual defense bill to limit President Obama's ability to close the Guantanamo Bay prison, reported The Hill's Jordain Carney. \nThe 2016 contender filed an amendment to the National Defense Authorization Act (NDAA) that would block funds from being used on a program to close the detention facility. Rubio also filed a separate amendment establishing requirements that must be met before the United States could hand back the Guantanamo naval station to Cuba. Rubio is the latest Republican to offer language meant to block President Obama from closing the prison. \nThe defense bill spearheaded by Sen. John McCain (R-Ariz.) would allow the administration to close the prison if Congress approves of a plan for doing so. \nIN CASE YOU MISSED IT: \n-- US hits paydirt with ISIS raid \n-- US, allies flex military muscle in Baltic region \n-- Army secretary to step down \n-- Week ahead: Showdown looms over defense spending \n-- Obama: Hacking is going to get worse", "external_links": [], "published": "2015-06-09T02:01:00.000+03:00", "crawled": "2015-06-09T15:42:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}