{"organizations": [], "uuid": "35bac62605ff19baffd30d6db2ba20310a527683", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/120213-d-tt977-063_0.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/budget-appropriations/244081-former-pentagon-comptroller-expects-obama-to-veto", "country": "US", "title": "Ex-Pentagon official: Obama isn't bluffing about Defense bill veto", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ex-Pentagon official: Obama isn't bluffing about Defense bill veto", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-05T00:00:00.000+03:00", "replies_count": 0, "uuid": "35bac62605ff19baffd30d6db2ba20310a527683"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/budget-appropriations/244081-former-pentagon-comptroller-expects-obama-to-veto", "ord_in_thread": 0, "title": "Ex-Pentagon official: Obama isn't bluffing about Defense bill veto", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ex-Pentagon official: Obama isn't bluffing about Defense bill veto Credit: U.S. Navy/Chad McNeeley By Kristina Wong - 06/04/15 05:00 PM EDT President Obama is likely to follow through on his threat to veto spending bills that lock in federal spending caps, including a defense policy bill the Senate is now considering, said the administration's former Pentagon comptroller, Bob Hale. \"The president's been pretty adamant that he won't accept it and he will veto the bills. He just issued a strong veto threat on the Senate Armed Services Committee's authorization bill,\" Hale said Thursday in an interview with The Hill. ADVERTISEMENT \"It was quite clear,\" he said, referring to an Office of Management and Budget statement issued Tuesday that said \"senior advisors would recommend to the President that he veto\" the bill if the bill is presented in its current form. \"They're not tying his hands, but it's a pretty strong statement,\" added Hale, who served as the Pentagon comptroller from 2009 through last June, and is now a fellow at Booz Allen. White House press secretary Josh Earnest also reiterated the president's opposition on Thursday during a briefing. \"The president has made clear he is not going to sign legislation that adheres to those sequester levels,\" he said. Republicans are currently trying to advance spending bills that adhere to the caps but boost defense spending by stuffing additional money in a war fund not subject to the caps. Democrats object to the move, and say the caps should be lifted for non-defense spending, too. Hale said it's unlikely that Republicans would have enough votes to override the veto, which would take all 54 Republicans and at least 13 Democrats. Although eight Democrats on the Senate Armed Services Committee voted for the bill in committee, it is unclear whether Republicans could hold on to those eight votes or find five additional votes to override the veto, especially with strong Democratic opposition. The committee's ranking member, Sen. Jack Reed (D-R.I.), voted against the bill in committee, as did three other Democrats. \"I think it'll be tough to override a veto, so I would guess they need to look for a different deal,\" Hale said. \"I don't want to tell you I can predict with certainty, but it seems to me it's a tough hill to climb.\" \nHale said knowing that a veto likely won't be overcome, the White House is now trying to put pressure on Republicans to start discussions on a deal to lift those caps on both defense and non-defense spending. Earnest said the White House is in favor of conversations on a deal \"starting sooner rather than later.\" \"What the president will, however, be supportive of is a process that members of Congress engaged in a couple of years ago where Democrats and Republicans sat down at the negotiating table and were able to work in bipartisan fashion to raise those caps in a way that raised funding for our national security priorities, but also for priorities that are critical for the success of our economy,\" he said. Earnest said members of the president's economic team would \"play an active role\" to facilitate the agreement. He said he was not aware of any conversations that have begun, but that House Speaker John Boehner has indicated \"at least an openness to that kind of process this year.\" \"But we’ll have to see if that’s how members of Congress decide that’s how they’re going to handle their business,\" he added. Tags:", "external_links": [], "published": "2015-06-05T00:00:00.000+03:00", "crawled": "2015-06-07T09:49:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}