{"organizations": [], "uuid": "1372b053e9cdcdc617c620d2f2e3e360120b5f0f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3029526/images/o-MARIJUANA-BUD-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/russ-belville/ohio-marijuana-legalization_b_7647454.html", "country": "US", "title": "Does ResponsibleOhio Suck Worse Than Marijuana Prohibition? | Russ Belville", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Does ResponsibleOhio Suck Worse Than Marijuana Prohibition? | Russ Belville", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-24T01:16:00.000+03:00", "replies_count": 0, "uuid": "1372b053e9cdcdc617c620d2f2e3e360120b5f0f"}, "author": "Russ Belville", "url": "http://www.huffingtonpost.com/russ-belville/ohio-marijuana-legalization_b_7647454.html", "ord_in_thread": 0, "title": "Does ResponsibleOhio Suck Worse Than Marijuana Prohibition? | Russ Belville", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IrresponsibleOhio Will Legalize Before California\nMy friend Jon Gettman has written an excellent analysis on HIGH TIMES' website of the plan to legalize marijuana in Ohio. This article is now being forwarded to me via social media by folks who hate the ResponsibleOhio legalization plan for 2015 and hate more the fact that I'm telling people to vote for it.\nLet's catch everyone up: ResponsibleOhio is a group that has collected far more signatures than necessary to place marijuana legalization on the 2015 ballot. Not 2016, but this very November, about six months from now, Ohio could become a legal marijuana state before California. Who would have ever predicted that?\nAs Gettman explains it, \"The group has proposed that marijuana be legalized in Ohio in a three-tiered commercial system consisting of retail outlets, manufacturers of cannabis products and a limited number of wholesalers--that is, them. Only them.\" And he's right, only the ten rich investor groups would be written in the constitution as the sole wholesalers of commercial marijuana.\nThis setup has forced cannabis aficionados to learn the word \" oligopoly \". Essentially what is proposed here is a marijuana cultivation oligopoly for the state of Ohio. And the idea that just ten rich guys are going to be the only legal commercial growers of cannabis has activists inside and outside Ohio frothing at the mouth in denunciation of legalizing marijuana in Ohio in 2015.\nTo me, it all sounds like campaigning to continue locking up mostly-black-and-brown marijuana consumers in Ohio because not enough cannabis growers will get rich.\nThe Shittiest Legalization I'd Vote For\nI'm really torn about this proposal; from a business standpoint, it's the shittiest form of legalization yet proposed. But from a civil rights standpoint, it's long past time to remove this means of oppression from the toolkit of brutal, racist police . The primary reasons I support ResponsibleOhio is that its good parts are decent marijuana legalization and its bad part sucks less than marijuana prohibition.\nI try to think about this from the point of view of all the stakeholders in Ohio legalization. Let's start with the consumer who just wants to smoke herb and not be busted. Today in Ohio , possession of up to 100 grams (3.5 ounces) is a minor misdemeanor. This is popularly called decriminalization, and NORML's website says that \"a minor misdemeanor does not create a criminal record in Ohio.\"\nHowever, that doesn't seem to be the case. As Ohio Expungement Law writes, \"A conviction from a minor misdemeanor offense in Ohio does not result in jail time, but rather, these charges are punishable by fine only, and in a few cases, a license suspension.... However, we regularly receive phone calls from people who have been convicted of a minor misdemeanor in their past but now that old conviction is creating serious problems for their career.\"\nSo today, our consumer caught with personal amounts of weed is going to be fined $150, and another $150 for paraphernalia, lose driving privileges for at least six months, and have a record of a drug conviction that affects career prospects and will take time and money to get expunged. A similar punishment exists for sharing 20 grams or less with an adult friend. Get caught sharing a second time and you get 30 days in jail; share more than 20 grams and you're looking at a felony with a year in prison.\nBut when ResponsibleOhio passes, an ounce of marijuana is legal. That means it is no longer contraband, which means the smell or sight of it is no longer a probable cause for police to begin detaining and searching our consumer in the first place. It means pot-sniffing dogs get retired, just like in Colorado , Washington , Oregon , and Alaska . It means our consumer can use paraphernalia and share up to an ounce with adult friends with no penalty whatsoever. I also find nothing in the amendment that revokes the current Ohio minor misdemeanor for amounts between an ounce and 100 grams.\nEven better, ResponsibleOhio defines hashish and extracts within its one ounce (28.4 grams) legal possession limit. Currently, possession of just ten grams of extract in Ohio is a felony that gets our consumer a year in prison and a $2,500 fine. Five grams will get our consumer a 30-day misdemeanor and less than five grams gets our consumer the same minor misdemeanor currently set for up to 100 grams of herb.\nOvergrow the Government\nBut what if our consumer wants to grow cannabis at home? Currently under Ohio law, cultivation is treated as possession, with the weight of your plants triggering the punishment. So, if our consumer has a little seedling weighing less than 100 grams, it's a minor misdemeanor. A 200 gram plant is a 30-day misdemeanor. Over 200 grams in plants is a felony that ranges from 6 months to 8 years, depending on total plant weight.\nUnder ResponsibleOhio, our consumer can get a home grow license for fifty bucks and be free to grow four cannabis plants (that's still illegal in Washington) and produce and possess up to eight ounces of marijuana (just like Oregon) at home. Our consumer can freely share those eight ounces with other adults. It also means that the various clues revealing cannabis production - a skunky smell, trips to the grow shop, purchases of lights, stems and leaves in the garbage, electric bills, infrared scans, etc. - are no longer probable cause for cops to obtain search warrants.\nI don't like the requirement of getting a home grow license, but I like it more than SWAT teams breaking down the door and shooting the family pets. And for those who'd continue their clandestine commercial grows without getting the license, passing ResponsibleOhio removes many of the probable cause risks. It certainly doesn't make illegal growing more risky - who's going to know that you have more than four plants in your enclosed, locked grow that's out of public view and how would they find out any easier than they can find your illegal grow now?\nFor decades now, growing any cannabis plants for any purpose was strictly forbidden by the state of Ohio. Any grower is risking serious prison time. Even Gettman agrees with me that mandating ten legal cartel growers won't stop illegal grows any more than prohibition did. \"Criminal law has been unable to restrict cultivation activity,\" Gettman writes, \"how can anyone argue that any sort of closed market can successfully monopolize marijuana cultivation?\"\nGetting in on the Green Rush\nOur consumer is covered for possessing and sharing marijuana and concentrates and cultivating personal cannabis plants. But what about getting in on the Green Rush and starting a marijuana business? ResponsibleOhio opens up the entire spectrum of legally licensed business opportunities, including Marijuana Product Manufacturing (\"MPM\") facilities, Retail Marijuana Stores (\"RMS\"), and Marijuana Testing Facilities (\"MTF\"). Almost any consumer would be welcomed to apply for such business licenses, so long as the consumer comes up with the $25,000 fee for an MPM or the $10,000 fee for the RMS or MTF.\nResponsibleOhio creates medical marijuana, too. There will be not-for-profit Medical Marijuana Dispensaries (\"MMD\") that serve patients. The typical eight conditions will qualify - cancer, HIV+/AIDS, glaucoma, and conditions causing cachexia, spasms, seizures, nausea, and pain - as well as PTSD, Crohn's, Hep C, and sickle-cell that are only covered in a few of the 23 medical marijuana states. Patients will be able to grow their own medicine, something forbidden in eleven medical marijuana states. Patients will be able to smoke or vaporize marijuana, something forbidden in the last three states to have passed medical marijuana. Medical marijuana wouldn't be taxed, it must be sold at lowest wholesale price, and taxes from recreational marijuana would help fund a program to provide medicine to the indigent. It would be the most liberal medical marijuana law passed since Michigan's in 2008, even allowing patients to administer their medicine at their workplace, which no other state has allowed!\nIn Summary, Legalization Trumps Prohibition Every Time...\nPassage of the ResponsibleOhio legalization plan would create legalized marijuana possession equal to Colorado, Washington, Oregon, and Alaska.\nIt would create legalized home-grow unlike Washington, equal to Oregon, and less than Colorado and Alaska, but with a licensing provision.\nIt would create legalized home possession greater than Washington, equal to Oregon, and less than Colorado and Alaska, but with a licensing provision.\nIt would create legalized extract possession greater than Washington and equal to Oregon, Colorado, and Alaska.\nIt would end the use of drug dogs for cannabis and eliminate most probable cause to harass consumers and growers, just like Washington, Colorado, Oregon, and Alaska.\nIt would create legal retail shops for purchase of cannabis, extracts, edibles, and tinctures, just like Washington, Colorado, Oregon, and Alaska.\nIt would create business opportunities to run a retail shop, a processing facility, or a testing facility, with fees greater than Oregon, Alaska, and Washington, and somewhat similar to Colorado.\nIt would create a medical marijuana program with more qualifying conditions than Washington, Oregon, Colorado, and Alaska; greater cultivation allowances than Colorado and Washington; and greater home possession allowances than Washington and Alaska and equal to Oregon.\nIt would leave intact a system to criminally punish illegal growers who sell that is no worse than the situation now and enormously better from the perspective of hiding one's illegal activity.\nWould you pass all that up simply because only ten companies get to sell marijuana wholesale? There's no other choice but maintaining prohibition on the 2015 ballot; the two currently competing initiatives have given up for 2015 .\nMaybe you're banking on 2016 and figure that another 19,000 possession arrests that are four times more likely to be black people is a small price you likely won't have to pay in order to get \"True Legalization™\". Good luck with that. I don't know that I could look a cancer patient in the eye and tell her to wait another year... if she can.\nLegalization costs money, period. Who are going to be the big funders of legalization in Ohio in 2016 when there will have been a high-profile legalization failure in Ohio the year before? Why will these big funders choose to get behind the Ohio groups they've never funded before when Nevada and likely California and Arizona are also on the 2016 ballot needing big funders? How will voters, funders, volunteers, and activists choose which of the four competitors for 2016 to back, assuming they don't all split those limited resources and ruin all their chances?\nIn 2015 in Ohio, you don't get to vote for the legalization you may want. You get to vote to end prohibition with ResponsibleOhio or to vote with the cops, courts, prisons, and rehabs that want to keep prohibition. Don't pass up the chance to legalize, Ohio; if it's as awful as Gettman predicts, those realities will force amendments to the constitution in the future. In the meantime, thousands of Ohioans will avoid punishment over marijuana.\nFollow Russ Belville on Twitter: www.twitter.com/RadicalRuss\nMore: Ohio Marijuana Marijuana Responsibleohio", "external_links": ["http://ohioexpungementlaw.com/minor-misdemeanor-expungement-ohio/", "http://www.twitter.com/RadicalRuss", "http://www.opb.org/news/article/what-happens-to-drug-sniffing-dogs-when-pot-becomes-legal/", "http://www.cleveland.com/open/index.ssf/2015/06/two_groups_postpone_marijuana.html", "http://www.cleveland.com/forcing-change/index.ssf/2015/01/forcing_change_a_decade_of_civ.html", "http://en.wikipedia.org/wiki/Oligopoly", "http://norml.org/laws/item/ohio-penalties-2", "http://www.komonews.com/news/local/Legal-pot-means-big-changes-for-states-drug-sniffing-dogs-199043431.html", "http://www.hightimes.com/read/irresponsibleohio-group-aims-monopolize-legal-marijuana-market", "http://medicalmarijuana.procon.org/view.resource.php?resourceID=000881", "http://www.westword.com/news/marijuana-amendment-64-causes-problems-for-drug-dogs-with-a-nose-for-pot-5892248", "https://www.aclu.org/report/war-marijuana-black-and-white", "http://www.myfox28columbus.com/news/features/top-stories/stories/NEW-Responsible-Ohio-Says-They-Obtained-Desired-55-000-Signatures-146918.shtml#.VXnSYPm6eUk", "http://www.adn.com/article/20150130/pot-legalization-puts-alaska-drug-sniffing-dogs-out-work"], "published": "2015-06-24T01:16:00.000+03:00", "crawled": "2015-06-24T00:54:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}