{"organizations": [], "uuid": "d2cd2fb90bd807bb24a5924a14cd826113637f99", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/raghida-dergham/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/blog.xml", "section_title": "The Huffington Post | Full Blog Feed", "url": "http://www.huffingtonpost.com/raghida-dergham/rebuilding-us-policy-post_b_7668150.html", "country": "US", "title": "Rebuilding U.S. policy post-Obama", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Rebuilding U.S. policy post-Obama", "spam_score": 0.0, "site_type": "blogs", "published": "2015-06-26T05:49:00.000+03:00", "replies_count": 0, "uuid": "d2cd2fb90bd807bb24a5924a14cd826113637f99"}, "author": "Raghida Dergham", "url": "http://www.huffingtonpost.com/raghida-dergham/rebuilding-us-policy-post_b_7668150.html", "ord_in_thread": 0, "title": "Rebuilding U.S. policy post-Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nRaghida Dergham http://alhayat.com/Opinion/Raghida-Dergham/9649015/%D8%A5%D8%B9%D8%A7%D8%AF%D8%A9-%D8%A8%D9%86%D8%A7%D8%A1-%D8%A7%D9%84%D8%B3%D9%8A%D8%A7%D8%B3%D8%A9-%D8%A7%D9%84%D8%A3%D9%85%D9%8A%D8%B1%D9%83%D9%8A%D8%A9-%D8%A8%D8%B9%D8%AF-%D8%A3%D9%88%D8%A8%D8%A7%D9%85%D8%A7 As part of the brainstorming sessions in US intellectual and political circles, much is being said about how the United States could coexist with the Islamic Republic of Iran when it is radically empowered under a final nuclear deal and an upgraded bilateral relationship like the one being sought by the Obama administration. One of the clear consequences of Obama's insistence on a deal with Tehran is perpetuating unprecedented division in the United States: One faction focuses on appeasement of Iran considering that there is no alternative to a nuclear deal, even if it is full of loopholes, and that American-Iranian rapprochement will co-opt the mullahs of Iran, embolden moderates, rein in hardliners, and undermine Iran's regional expansion plans. The other faction sees that the nuclear agreement will not curb the nuclear ambitions of the Iranian theocracy, and that at best, it would delay an Iranian nuclear bomb by a decade. This faction also believes that lifting the sanctions on Iran would practically allow it to execute its nuclear plans, which would launch a nuclear arms race in the Gulf and invalidate the Nuclear Non-Proliferation Treaty (NPT). This factions sees that the primary beneficiary of such an outcome would not be the moderate forces but the Revolutionary Guards, they key sponsor of Iran's regional expansion from Iraq, Syria, and Lebanon to Yemen, establishing militias that undermine the states in these countries--mirroring the Islamic State group (ISIS) whose doctrine is the destruction of nation states in the Arab region to establish its caliphate. The first faction embraces the US pivot away from traditional allies, including in the Arab region, and closer to Iran. It sees this as a wise policy, based on its interpretation of 9/11 which blames Arab actors for the terrorist attacks. The second faction stresses that it was Iran and its allies that killed the largest number of Americans, and not the Arab countries or even al-Qaeda and ISIS. For this reason, senior members of the second faction want to redesign US policy in the Middle East post-Obama, and they have ideas worth pausing at as part of the necessary brainstorming that the Arab region must take part in. Under the title \"The realignment of the Arab region in the international arena: Beyond politics, economics, and security threats\", an Arab-regional-international workshop will be held in October to discuss the options available and come up with recommendations on how to overcome various challenges. The Beirut Institute, an Arab think-tank founded by the author of this article, will convene the Beirut Institute Summit in Abu Dhabi as an opportunity to come up with positive and practical ideas. Some of the participants have already started submitting proposals, including figures closely involved in long-term US policymaking. The autumn scheduling is meant to coincide with the start of the US presidential election campaigns. The idea is that the Arab region must start thinking seriously about the future, instead of remaining fixated on what Barack Obama is doing. By this autumn, the Arab region in all likelihood will have to start accepting the new reality of the American-Iranian relationship built by Barack Obama. And regardless of who the next president will be, be it a Democrat or a Republican, US policy in the Middle East will be shaped by the ties with Iran and the putative nuclear deal and its implementation. The American strategist who was involved in decision-making for decades believes rebuilding the US Middle East policy post-Obama is not difficult, and says this will depend on three things the new US president will have to do: First, reestablishing the alliance with Egypt, not just verbally, but also by doubling US military aid to $3 billion a year and inviting President Sisi to the White House, to reaffirm the Camp David accords and restore defensive ties. This alone, he says, can reassure Egypt and stop it from seeking alternative partners including Russia. This, he argues, cannot be achieved as long as there are American restrictions on Egypt. Egypt is crucial in the war on ISIS, especially in Libya, and is a key partner in broader US-Arab relations, especially in the light of the firm strategic alliance among Egypt, Saudi Arabia, and the United Arab Emirates. Second, Libya needs an intervention similar to the NATO-led intervention in the past, in support of the legitimate government in Tobruk. Hesitation and complacency will allow ISIS and similar extremist groups in Libya to grow and threaten other North African nations. The positions of Saudi Arabia, the UAE, and Egypt must get real support from Washington, and there is no option but to defeat the Tripoli-based government and ISIS in Libya. This requires supporting Khalifa Haftar's forces, which are fighting both al-Qaeda and ISIS. Third, always according to the US strategist, political and military decisions concerning Kurdistan should be made: Sending military aid directly to Erbil and not via Baghdad, and declaring that the United States does not mind for Kurdistan to export oil and even welcome Kurdish oil in US energy markets, as this would help Kurdistan fund its war with ISIS. These are the views of veteran US policymaker, meant to prevent the deterioration of US influence in the Middle East. Some may agree with them, others may not, but they are strategic ideas and not just a diagnosis followed by surrender. And this is exactly what's needed: Pragmatic ideas to take US policy into a new approach following recent shifts in its policy. Some may protest the idea of allowing the Kurds to secede from Iraq, which is implicit in the qualitative shift in US-Kurdish relations. In fact, the moderates are in Sulaymaniyah as they are in Amman, and a million Kurds have been displaced. There is a need for the Arab countries, led by Saudi Arabia, to reassess. Kurds in the Arab region as part of the Arab fabric just like Shiite Arabs are. It is time for a new and radically different relationship with both components, and it is crucial to correct the impression that only Sunni Arabs are Arabs as in the Saudi perception. Kurds and Shiites in the Arab countries are an essential part of the multiethnic, multiconfessional mosaic, and the Arab interest requires addressing this problem. The Arab interest also requires practical ideas in light of the nuclear deal and the upgrading of the American-Iranian bilateral relationship. There is a dire need for a change in strategy from Yemen to Lebanon. In Yemen, there is no alternative to choosing between an exit strategy, one that would secure the Saudi-Yemeni border, and escalating militarily to secure Aden, Hodeidah, and Taiz, with measures in Sanaa. The options boil down to securing the cities and gradually clawing back territory, or withdrawing from Yemen in an organized international framework supported by a Marshall plan to rescue Yemen economically and humanitarianly. The aerial bombardment campaigns will not achieve anything more, and it would be best to reduce air strikes and focus them as part of a new strategy. In Syria, the Kurds do have a place in a new military strategy based on bringing the Kurdish forces together with moderate rebel forces. This, in turn, would require a shift in how Syria is dealt with. The Gulf countries need to think profoundly about the subject, especially in light of the possible lifting of the sanctions on Iran. Economists speak of a golden age in Iran if the sanctions are lifted under a nuclear deal. They say Iran's oil exports could increase from 1 million barrels per day to 2 million barrels, worth $75 million a day or $2.2 billion a month. This would be enough cash for the Revolutionary Guard to finance its plans. The Revolutionary Guard already used Iraq's budget to finance its war in Syria in the past, when former Iraqi PM Nuri al-Maliki made the Iraqi treasury the equivalent to an ATM to finance the adventures of the Revolutionary Guard in Syria. After the sanctions are lifted, Tehran will be able to pump money not only into its war in Syria, but also into Hezbollah in Lebanon, which in turn will radically alter the path and fate of Lebanon. Since Lebanon is in a state of complete vacuum, Hezbollah would be able to impose its demands there. ISIS is being used as a pretext in Lebanon, since Hezbollah and ISIS are fighting in Syria. But if the Arab strategy wants to be wise, it must give Lebanon due attention before it is too late. Because while ISIS wants Damascus and Baghdad, and not Beirut, it could be lured into Lebanon. Losing Lebanon to Hezbollah or ISIS would be a major loss for Arab strategy and for the United States, whether under Obama or a new occupant of the White House. The Obama administration does not want to pay attention to such \"trivial\" issues standing in its way towards a legacy represented by a deal with Iran. The administration is in a willful coma, it seems. However, the United States is not bound by its administration. True, major US policies are developed in their broad outlines for the long term on a strategic basis, and various administrations implement them with some changes here or amendments there. However, policies are not detached from reality, and all this shapes decision-making. For this reason, it is possible to see institutions operating for years and decades to shape decision making. Think-tanks and workshops are part of the dynamic of influencing strategic decision-making, which is what the Arab region needs. The picture appears bleak in the context of the nuclear deal with Tehran. Ali Khamenei has dictated seven near-impossible conditions he dubbed \"red lines\". These could be part of the art of negotiations but they could lead to detonating the entire nuclear talks. Logically, there is no room today for an agreement. Khamenei made it clear that Tehran insists on having the US and international sanctions lifted as soon as a deal is concluded, before Iran dismantles any nuclear capabilities. He said nuclear research would not be frozen and military sites would be off-limits. As for the issue of reimposing sanctions in the event Tehran fails to abide by its commitments, Russia and China will be there to guarantee any such bid would be vetoed. But politically, it seems illogical that we have reached this point in the negotiations only for them to fail. Ultimately, it is more important to develop strategies in preparation for any outcome. Once again, an Arab collective brainstorming is crucial and urgent. This article was translated from Arabic by Karim Traboulsi \nFollow Raghida Dergham on Twitter: www.twitter.com/raghidadergham More: Click here to view Conversations Conversations", "external_links": [], "published": "2015-06-26T05:49:00.000+03:00", "crawled": "2015-06-26T06:55:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}