{"organizations": ["Fox News Latino Deported"], "uuid": "814a6b081624b375fcaaaf8f0126b6c6f47820ef", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/694940094001_4283507902001_obama-immigration.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/08/obama-are-being-as-aggressive-as-possible-on-immigration-executive-actions/", "country": "", "title": "Obama said he's not giving up immigration fight: 'We are being as aggressive' as possible | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama said he's not giving up immigration fight: 'We are being as aggressive' as possible | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T19:15:00.000+03:00", "replies_count": 0, "uuid": "814a6b081624b375fcaaaf8f0126b6c6f47820ef"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/08/obama-are-being-as-aggressive-as-possible-on-immigration-executive-actions/", "ord_in_thread": 0, "title": "Obama said he's not giving up immigration fight: 'We are being as aggressive' as possible | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Deported vets push to be part of Obama's executive action \nPresident Barack Obama said he was “frustrated” by a recent district court’s ruling regarding his executive action on immigration – but he’s not done fighting. \nSpeaking at a press conference at the G7 meeting in Germany of state leaders, told reporters that, “we are being as aggressive as we can legally, to appeal the district court ruling and then to implement those actions on executive actions that were not challenged in court.” \nObama was responding to a Washington Post report , published on Sunday, stating that legal setbacks “have halted the government’s intensive preparations” to extend detention protection to millions of people who entered the country illegally. \nThe article said rented office space still sits empty and positions have not been filled that were intended to handle the extra cases and paperwork. \n“I made a decision,” Obama explained at a press conference after his meeting with the prime minister of Iraq, “which I think is the right one, that we should not accept applications until the legal status of this is clarified.” \nBut, he noted, that did not mean he was giving up his fight. \n“One of the key provisions for me was to let undocumented people get legal status after background checks. That requires an administrative apparatus,” he said. \nLast November, Obama announced a series of executive actions on immigration, one of the key provisions of which was to extend the deportation protection for so called “Dreamers” — people who arrived in the United States illegally as children – under the Deferred of Action for Childhood Arrivals (DACA). \nThe actions also granted that protection to the parents of citizens or of children with legal residence in the United States. All together, an estimated 4 to 5 million people would be affected by the program. \nIn December, Texas filed a lawsuit against Obama’s action, and was eventually joined by 24 other states. \nIn February, a U.S. district court judge in Texas issued an injunction against the U.S. government moving forward with the program while the lawsuit is being decided. \nDuring the press conference, Obama said that, “One of the key provisions for me was to let undocumented people get legal status after background checks. That requires an administrative apparatus.” \nLike us on Facebook ", "external_links": [], "published": "2015-06-08T19:15:00.000+03:00", "crawled": "2015-06-08T20:51:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}