{"organizations": [], "uuid": "ce29fa8f410a0314957d9f619a845a72a2c319d8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3132000/images/o-IMMIGRATION-REFORM-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/gay-voices/index.xml", "section_title": "Gay Voices - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/29/transgender-immigrant-detainees_n_7692550.html?utm_hp_ref=gay-voices&ir=Gay+Voices", "country": "US", "title": "Immigration Officials May Begin Considering Gender Identity When Housing Transgender Detainees", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Immigration Officials May Begin Considering Gender Identity When Housing Transgender Detainees", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T03:52:00.000+03:00", "replies_count": 0, "uuid": "ce29fa8f410a0314957d9f619a845a72a2c319d8"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/2015/06/29/transgender-immigrant-detainees_n_7692550.html?utm_hp_ref=gay-voices&ir=Gay+Voices", "ord_in_thread": 0, "title": "Immigration Officials May Begin Considering Gender Identity When Housing Transgender Detainees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration Officials May Begin Considering Gender Identity When Housing Transgender Detainees Posted: reddit \nSANTA ANA, Calif. (AP) — Immigration authorities will consider housing transgender detainees based on the gender they identify with in the wake of criticism about detention conditions for the population, officials said on Monday. \nDetention staff should consider transgender detainees' preferences when making decisions about housing and clothing and what pronouns should be used, Immigration and Customs Enforcement said in new guidelines for the treatment of transgender detainees. \nThe agency will start tracking data for transgender detainees, train detention staff and draft individual detention plans for transgender detainees to deal with issues ranging from hormone therapy to safety, said Andrew Lorenzen-Strait, ICE's deputy assistant director of custody programs. \n\"ICE will allow for the placement of a transgender woman consistent with their gender identity, meaning that a transgender woman could be with biological females,\" said Lorenzen-Strait, who was also appointed as a national coordinator for issues related to gay, lesbian and transgender detainees. \nThe move did little to quell criticism from advocates who have urged the agency to release more transgender immigration detainees, citing their increased risk of sexual assault in detention. Last week, a heckler interrupted President Barack Obama's remarks at a gay pride event in Washington to protest the detention and deportation of gay, lesbian and transgender immigrants. \n\"This is all interesting on paper, to say the least, but we need to see how this actually plays out,\" said Raffi Freedman-Gurspan, a policy adviser for the National Center for Transgender Equality. \"We don't think these folks should be in detention centers, period.\" \nThe guidance comes three years after the Department of Justice issued similar rules for transgender inmates. But even now many jails and prisons aren't following the rules and continue to house transgender inmates based on their genitalia or place them in solitary confinement purportedly for their protection, said Carl Takei, a staff attorney at the American Civil Liberties Union's National Prison Project. \n\"Most prisons and jails are still in the Dark Ages about these issues,\" Takei said. \nGetting the rules put into practice may be tough for immigration officials, who house most detainees at contract facilities, Takei said. \nICE currently has about 60 transgender detainees. About 25 are housed in a special unit in Santa Ana, California, for transgender women and gay men. The rest are housed in different facilities across the country, mostly with the general population and consistent with their biological sex, Lorenzen-Strait said. \nThe agency currently houses about 31,000 detainees a day, he said. \nUnder the latest guidance, the agency said officials should consider a host of factors before detaining an individual, including transgender identity. \nGiven the population's small numbers and increased risk, transgender immigrants should be offered alternatives to detention, said Aaron Morris, legal director of Immigration Equality. \n\"When you're thinking about who should absolutely be released, pregnant women, people with severe health problems, transgender individuals, there are certain populations that weigh so heavily in favor of release that it is dumbfounding the knee-jerk reaction is always to detain,\" Morris said. \"It's not in anyone's best interest.\" \nBut immigration enforcement advocate Jessica Vaughan, who is director of policy studies at the Center for Immigration Studies, said she worries that gender identity could trump other factors, such as flight risk, when making decisions about detention. \n\"In practice, this could become a double standard for transgender individuals that seems unprecedented,\" Vaughan wrote in an email. Also on HuffPost:", "external_links": [], "published": "2015-06-30T03:52:00.000+03:00", "crawled": "2015-06-30T06:25:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}