{"organizations": [], "uuid": "12b6df86a339951e07d98da4e042deb679c1b2cf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3096188/images/o-BERNIE-SANDERS-IMMIGRATION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/immigration-reform/feed", "section_title": "Immigration Reform on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/19/bernie-sanders-immigration_n_7624086.html", "country": "US", "title": "Bernie Sanders: It's Time For Immigration Reform", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Bernie Sanders: It's Time For Immigration Reform", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T19:22:00.000+03:00", "replies_count": 0, "uuid": "12b6df86a339951e07d98da4e042deb679c1b2cf"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/19/bernie-sanders-immigration_n_7624086.html", "ord_in_thread": 0, "title": "Bernie Sanders: It's Time For Immigration Reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bernie Sanders: It's Time For Immigration Reform Posted: reddit \nAfter being criticized for staying quiet about immigration, Sen. Bernie Sanders (I-Vt.) vowed on Friday that if elected president, he would push for immigration reform and go even further than President Barack Obama in expanding deportation relief. \n\"Despite the central role that undocumented workers play in our economy and in our daily lives, these workers are too often reviled by many for political gain and shunted into the shadows,\" Sanders, who is running for the Democratic presidential nomination, said in Las Vegas at the National Association of Latino Elected Officials conference . \n\"Let me be very clear as to where I stand,\" he continued. \"It is time for this disgraceful situation to end.\" \nImmigration hasn't been one of Sanders' central issues, and he hasn't discussed it much on the campaign trail. Rep. Luis Gutierrez (D-Ill.), one of the leaders on immigration reform in the House, said earlier this month that he doesn't know if Sanders \"likes immigrants, because he doesn't seem to talk about immigrants.\" \n\"I hope he likes immigrants,\" Gutierrez said at the time. \"I haven’t heard him say anything. He’s been kind of quiet and silent.\" \nAt the NALEO conference, Sanders noted that he supported the comprehensive immigration reform bill that passed the Senate in 2013, as well as the never-passed Dream Act to provide legal status to undocumented young people who came to the U.S. as children. \nSanders said that as president, if Congress did not pass immigration reform, he would use executive action to give deportation relief to the parents of U.S. citizens, legal permanent residents and so-called Dreamers, the would-be beneficiaries of the Dream Act. \nFormer Secretary of State Hillary Clinton and former Maryland Gov. Martin O'Malley, two of Sanders' rivals for the Democratic nomination, have also promised to push for immigration reform and expand deportation relief if necessary. \nObama announced plans last November to allow some parents of U.S. citizens and legal permanent residents to work legally on a temporary basis, but he excluded the parents of Dreamers, saying that such a move was beyond his authority. The relief program is currently blocked in the courts. \nSanders has previously criticized certain aspects of immigration reform efforts -- particularly guest worker programs that he said could cost Americans their jobs and lead to lower wages. \nHe spoke out against proposals for guest worker programs on Friday, too, but focused more on the exploitation of immigrants who \"have been routinely cheated out of wages, held virtually captive by employers who have seized their documents, forced to live in unspeakably inhumane conditions and denied medical benefits for on-the-job injuries.\" \nSanders said another of his priorities is to ensure that workers are not exploited by employers who think their undocumented status will prevent them from speaking out. He recalled a visit to Immokalee, Florida, in 2008, where he said he saw workers in tomato fields \"being paid starvation wages, living in severely substandard housing and subjected to abusive labor practices.\" \n\"The injustice in the lives of the workers was overwhelming,\" he said. \"In fact, the situation was so bad that on the day I visited, two men were indicted for human slavery. Slavery, in the 21st century, in the United States of America.\" Also on HuffPost:", "external_links": [], "published": "2015-06-19T19:22:00.000+03:00", "crawled": "2015-06-20T01:17:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}