{"organizations": [], "uuid": "f9db83e96b1bb1330f081c1c091f5fd5b36343a4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1934211/images/o-LINCOLN-NEBRASKA-CITY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/politics/feed", "section_title": "Politics on Huffington Post", "url": "http://www.huffingtonpost.com/juan-escalante/immigration-victory-in-ne_b_7469888.html", "country": "US", "title": "Juan Escalante: Immigration Victory In Nebraska Deals Another Blow to GOP", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Juan Escalante: Immigration Victory In Nebraska Deals Another Blow to GOP", "spam_score": 0.0, "site_type": "news", "published": "2015-06-01T16:30:00.000+03:00", "replies_count": 0, "uuid": "f9db83e96b1bb1330f081c1c091f5fd5b36343a4"}, "author": "Juan Escalante", "url": "http://www.huffingtonpost.com/juan-escalante/immigration-victory-in-ne_b_7469888.html", "ord_in_thread": 0, "title": "Juan Escalante: Immigration Victory In Nebraska Deals Another Blow to GOP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nEarlier this week, the unicameral legislature in Nebraska passed a bill that lifted the ban on driver's licenses for the beneficiaries of President Obama's original DACA program. This made Nebraska the last state to take that action. \nThis was a significant victory for the immigrant community and its allies. Not only did the bill, known as LB623, pass with an overwhelming bipartisan majority -- but it overcame a last minute gubernatorial veto, bringing Nebraska up to speed with the rest of the nation. \nFor some reason or another, it is victories like this one, that encapsulate the immigrant rights movement so well. Or at least a pattern within the movement. \nA victory is claimed, in this case by lifting the ban on an non-issue that Republicans continue to push back on, and then, like clockwork, Republicans continue to kick and scream until they mount a roadblock that they know will eventually be circumvented. \nIt took almost three years for Nebraska to get to this point in time. Starting back in 2012, when former Governor Dave Heineman announced that he would follow the lead of the state of Arizona, and blocked DACA beneficiaries from applying for driver's licenses: \nThe state of Nebraska will continue its practice of not issuing driver's licenses, welfare benefits or other public benefits to illegal immigrants unless specifically authorized by Nebraska statute. \nA long term delay, that not even Nebraska's current governor , Pete Ricketts, also a Republican, could uphold. \nSee the issue with this? \nThe original DACA program allowed the federal government to distribute work authorization cards, along with social security numbers, to those who qualified. However, it remained up to the states to provide individuals with the adequate identification and driver's licenses. \nIf you have not been following this particular chapter closely, you might have assumed that the roll out of DACA went by flawlessly. An assumption that would be correct, were it not for Republican governors mounting their own opposition in the only way they could - denying driver's licenses to beneficiaries from the program. \nPrior to Nebraska's overturning its self-imposed ban, it was Arizona who led the charge by denying driver's licenses to DACA beneficiaries. Earlier this year, a federal judge ordered the infamous \"show me your papers\" state to begin granting driver's licenses to undocumented immigrants - much to the dismay of former governor Jan Brewer. \nNow that Nebraska's LB623 is law, it marks the precise moment where the original DACA is 100 percent operational. Again, almost three years from when the program was first launched. Now all DACA beneficiaries can count on receiving driver's licenses across all 50 states. \nWere the roadblocks for driver's licenses intentional? Absolutely. Stalling is the type of strategy anyone would employ when they know that they are on the losing side of an argument. And, ironically enough, it is the same strategy being used to delay the implementation of the DAPA program. \nWe all know that President Obama's most recent actions on immigration, an expansion of the DACA program and DAPA, are currently caught up in a legal mess thanks to a politically charged lawsuit led by Republican governors. What a surprise! \nBecause of their inability to let this issue go, and their willingness to continue to demonstrate that immigration will be the defining issue of 2016, Republicans have resorted -- once again -- to stall the inevitable. \nThe recent developments from the 5th Circuit are certainly disappointment . There really is no denying that. For many, this means another delay in the relief that they thought would have been provided for them already -- countless individuals who just want to contribute back to their communities. \nHowever, if the driver's licenses saga is any indication of what is to come - then it will be worth the wait. \nWe are currently experiencing some very interesting times when it comes to the fight for immigration reform. Yes, the road has been long, and we are reminded on a daily basis that we must wait yet again. \nBut take a look as to how far we have come! Undocumented youth in Nebraska waited three whole years to obtain a plastic card that was granted other DACA beneficiaries since day one. They organized, found solutions and still came out on top. \nThe way we win DACA+ and DAPA is through our communities - by telling the same people who once sought to deny us driver's licenses that we will not be pawns in their political stunts. The DACA+ and DAPA programs may be stalled, but you and I already know how this fight will play out. \nFollow Juan Escalante on Twitter: www.twitter.com/JuanSaaa More:", "external_links": [], "published": "2015-06-01T16:30:00.000+03:00", "crawled": "2015-06-01T20:45:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}