{"organizations": ["NSA", "Ninth Circuit", "Justice Department", "TSA", "Justice", "5th Circuit Court of Appeals", "Clinton Foundation", "Supreme Court", "EPA", "FBI", "U.S. Court of Appeals", "Senate", "D.C. Circuit", "GOP", "Maricopa County Superior Court", "Kentucky"], "uuid": "33a170612abdfdc2744ceb6638cd3001502a1608", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/immigration_borderpatrol_072314getty_2.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/regulation/court-battles/243630-supreme-court-rejects-appeal-to-reinstate-immigration-law", "country": "", "title": "SCOTUS rejects appeal to reinstate immigration law | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "SCOTUS rejects appeal to reinstate immigration law | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "33a170612abdfdc2744ceb6638cd3001502a1608"}, "author": "", "url": "http://thehill.com/regulation/court-battles/243630-supreme-court-rejects-appeal-to-reinstate-immigration-law", "ord_in_thread": 0, "title": "SCOTUS rejects appeal to reinstate immigration law | TheHill", "locations": ["Maricopa County", "The Hill", "U.S.", "Yorkville", "Maricopa County Attorney", "Arizona", "New Orleans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul", "Martin O’Malley", "Walker", "Arpaio", "Obama", "Sanders", "Hillary Clinton", "Blumenthal", "Dennis Hastert", "Lydia Wheeler", "Hastert", "Clarence Thomas", "Thomas", "Juan Williams", "Graham", "Lopez-Valenzuela", "Samuel Alito", "Cruz", "Isaac Castro-Armenta", "Joseph Arpaio", "Sidney Blumenthal", "Antonin Scalia", "McCain"], "text": "SCOTUS rejects appeal to reinstate immigration law Getty Images By Lydia Wheeler - 06/01/15 01:50 PM EDT In denying to hear an appeal from Arizona Sheriff Joseph Arpaio, the Supreme Court on Monday left in place a lower court’s decision to strike down a state immigration law. In October, the U.S. Court of Appeals for the Ninth Circuit struck down a law Arizona voters had passed in 2006 that made illegal immigrants charged with “serious” felonies ineligible for bail. In a divided panel, the court of appeals held that the law was unconstitutional because it violated the 14th Amendment’s due process clause by imposing punishment before trial. ADVERTISEMENT The case — Lopez-Valenzuela v. Arpaio — stemmed from the class action complaint Maricopa County inmates Angel Valenzuela and Isaac Castro-Armenta filed against Maricopa County, Sheriff Joseph Arpaio, the Maricopa County Attorney and the presiding judge of the Maricopa County Superior Court in 2008. On Monday, six members of the Supreme Court denied to hear an Arpaio’s appeal from Arpaio, overruling the more conservative members of the Supreme Court – Justices Clarence Thomas, Antonin Scalia and Samuel Alito ­— who said they would have heard the case. “It is disheartening that there are not four members of this court who would even review the decision below,” Thomas wrote in his dissenting opinion. “As I previously explained, states deserve our careful consideration when lower courts invalidate their constitutional provisions.” Arpaio is currently challenging Obama’s executive actions on immigration in the nation’s second more influential court. The outspoken lawman has asked the U.S. Court of Appeals for the D.C. Circuit to overturn U.S. district court’s December 2014 and stop the president from giving legal status and work permits to nearly five million illegal immigrants. During arguments last month, the panel of three justices appeared skeptical of the case as they questioned whether Arpaio has legal standing to challenge the president’s actions. Tags: Past: 1 day Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat. ", "external_links": [], "published": "2015-06-01T03:00:00.000+03:00", "crawled": "2015-06-02T03:03:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}