{"organizations": [], "uuid": "202697f1085e74d4e04f0d30b59934e04b17f684", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss\r", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/10/secret-service-officers-reportedly-posted-at-white-house-without-proper/", "country": "", "title": "Court upholds key parts of Texas' strict anti-abortion law", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Court upholds key parts of Texas' strict anti-abortion law", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T07:00:00.000+03:00", "replies_count": 0, "uuid": "8b5edb36cb4497649c06855b9cfdb37bc43602a1"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/10/court-upholds-key-parts-texas-strict-anti-abortion-law/", "ord_in_thread": 0, "title": "Court upholds key parts of Texas' strict anti-abortion law", "locations": ["Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Court upholds key parts of Texas' strict anti-abortion law Published June 09, 2015   Email Print \nAUSTIN, Texas – A federal appeals court on Tuesday upheld Texas' strict abortion restrictions that could soon leave only seven abortion clinics open in a state of 27 million people. \nThe decision by the 5th U.S. Circuit Court of Appeals allows Texas to enforce Republican-backed restrictions that require abortion clinics to meet hospital-level operating standards, a checklist that includes rules on minimum room sizes, staffing levels and air ventilation systems. The restrictions, approved in 2013, are among the toughest in the nation. \nOwners of traditional abortion clinics, which resemble doctor's offices more than hospitals, say they would be forced to close because the new rules demand millions of dollars in upgrades they can't afford. That would mark the second large wave of closures in as many years in Texas, which had 41 abortion clinics in 2012, before other new restrictions took effect that require doctor admitting privileges. \n\"Not since before Roe v. Wade has a law or court decision had the potential to devastate access to reproductive health care on such a sweeping scale,\" said Nancy Northrop, president and CEO of the Center for Reproductive Rights. \"We now look to the Justices to stop the sham laws that are shutting clinics down and placing countless women at risk of serious harm.\" \nTexas will be able to start enforcing the restrictions in about three weeks unless the U.S. Supreme Court agrees to halt the decision, said Stephanie Toti, an attorney for the center. Only seven abortion facilities in Texas, including four operated by Planned Parenthood, meet the more robust requirements. \nAbortion-rights groups said they will appeal to the U.S. Supreme Court, which temporarily sidelined the law last year. \nIf the law takes effect, some women in the state would live hundreds of miles away from a Texas abortion provider. But that argument didn't sway the three-judge panel making the decision for the New Orleans-based appeals court, which is considered one of the most conservative in the nation. The judges noted that a New Mexico abortion clinic was just across the Texas border, and said clinic owners in Texas failed to prove that a \"large fraction\" of women would be burdened. \nRepublican Texas Attorney General Ken Paxton, whose office argued before the appeals court in January, praised Tuesday's ruling. \n\"Abortion practitioners should have no right to operate their businesses from sub-standard facilities and with doctors who lack admitting privileges at a hospital,\" Paxton said. \nRepublican Gov. Greg Abbott and other conservatives say the standards protect women's health. But abortion-rights supports say the law is a thinly veiled attempt to block access to abortions in Texas, which has been the site of one of the nation's largest abortion fights for two years. Toti said roughly a half-dozen other states require similar standards for abortion clinics, but unlike in those states, the Texas law doesn't allow clinics to be grandfathered or seek waivers. \nAbout 18 abortion clinics are currently open in Texas, though the number fluctuates depending on whether a facility has a doctor with hospital admitting privileges. \nUnder the new restrictions, the only remaining abortion facilities in Texas would be in major cities. One exception would be a Whole Woman's Health clinic in McAllen, near the Texas-Mexico border, which the 5th Circuit exempted from some restrictions — but Toti said even those exemptions are so limited that it may not be practical to keep that clinic open. \nFor women in El Paso, the closest abortion provider in Texas would require a 1,200-mile round trip to San Antonio, or they would have to cross state lines. The appeals court found that option suitable, noting that a clinic was just across the border in Santa Teresa, New Mexico. \n\"Although the nearest abortion facility in Texas is 550 miles away from El Paso, there is evidence that women in El Paso can travel the short distance to Santa Teresa to obtain an abortion and, indeed, the evidence is that many did just that,\" the court wrote. \nAttorneys for the state also dismissed opponents' arguments about women being burdened by fewer abortion facilities, saying that nearly 9 in 10 women in Texas would still live within 150 miles of a provider. \nThe restrictions are the same ones that Democrat Wendy Davis temporarily blocked with a 13-hour filibuster in the Texas Legislature in 2013, which attracted national attention and propelled her to an unsuccessful run for governor. Advertisement", "external_links": [], "published": "2015-06-10T07:00:00.000+03:00", "crawled": "2015-06-10T09:03:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}