{"organizations": ["Senate", "Congress", "Emanuel African Methodist Episcopal Church", "Sandy Hook Elementary School"], "uuid": "c8f5a3e169e2609e8738011a26378aa67069e204", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150619104147-obama-shooting-speech-june-18-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/06/26/us/new-york-prison-break-timeline/index.html", "country": "US", "title": "Obama on gun control: 'We need a change in attitude'", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama on gun control: 'We need a change in attitude'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T22:45:00.000+03:00", "replies_count": 0, "uuid": "422cd453de38f0162e0aa86d6050f56fac3090e6"}, "author": "", "url": "http://edition.cnn.com/2015/06/19/politics/obama-gun-control-change-in-attitude/index.html", "ord_in_thread": 0, "title": "Obama on gun control: 'We need a change in attitude'", "locations": ["Shelby", "Newtown", "Washington", "Aurora", "South Carolina", "Calhoun Street", "Charleston", "North Carolina", "Texas", "Dylann Roof"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Calhoun Street", "Roof", "Obama"], "text": "How Obama responds to shooting attacks 02:08 PLAY VIDEO But he said on Friday he wasn't resigned to inaction in Congress. \"We have to move public opinion,\" Obama said. \"We have to feel a sense of urgency. Ultimately Congress will follow the people.\" RELATED: Obama, Clinton press for greater gun restrictions in wake of church massacre Obama last made a push to tighten gun control laws in the aftermath of the shooting at Sandy Hook Elementary School in 2012. A measure that would have expanded background checks during gun sales gained bipartisan support, but ultimately failed to surpass a filibuster in the Senate. While the Obama administration enacted nearly two dozen executive actions meant to improve gun safety, the issue has largely been dormant on Capitol Hill since. On Friday, Obama said the lack of action in Washington wasn't an excuse to ignore a problem he noted took the lives of 11,000 Americans in 2013 alone. \"I refuse to act as if this is the new normal or to pretend that it's simply sufficient to grieve and that any mention of us doing something to stop it is somehow politicizing the problem,\" he said. The President suggested that tighter gun laws can be passed despite a lack of bipartisan support from Congress. Charleston church shooting 17 photos Charleston church shooting 17 photos In this image from the video uplink from the detention center to the courtroom, Dylann Roof appears at a bond hearing Friday, June 19, in South Carolina. Roof is charged with nine counts of murder and firearms charges in the shooting deaths at Emanuel African Methodist Episcopal Church in Charleston, South Carolina on June 17. Hide Caption 1 of 17 Charleston church shooting 17 photos Dylann Roof, the 21-year-old charged with murdering nine people in a church shooting on Wednesday, June 17, is escorted by police in Shelby, North Carolina, on Thursday, June 18. Hide Caption 2 of 17 Charleston church shooting 17 photos Law enforcement officers in Charleston, South Carolina, stand guard near the scene of the shooting at Emanuel African Methodist Episcopal Church. Hide Caption Charleston church shooting 17 photos A police officer directs a police vehicle in front of the church on June 18. Hide Caption 4 of 17 Charleston church shooting 17 photos Two law enforcement officials said Roof confessed. Roof said he wanted to start a race war, one of the officials said. Hide Caption 5 of 17 Charleston church shooting 17 photos Police in Charleston close off a section of Calhoun Street early on June 18, after the shooting. The steeple of the church is visible in the background. Hide Caption Charleston church shooting 17 photos Charleston police officers search for the shooting suspect outside the church on Wednesday, June 17. Hide Caption Charleston church shooting 17 photos People in Charleston pray following the shooting on June 17. Hide Caption Charleston church shooting 17 photos A woman joins a prayer circle on June 17. Hide Caption 9 of 17 Charleston church shooting 17 photos A man kneels across the street from where police gathered outside the church on June 17. Hide Caption 10 of 17 Charleston church shooting 17 photos Police gather at the scene of the shooting on June 17. The church was formed in 1816. Hide Caption 11 of 17 Charleston church shooting 17 photos People pray in a hotel parking lot across the street from the scene of the shooting on June 17. Every Wednesday evening, the church holds a Bible study in its basement. Hide Caption Charleston church shooting 17 photos An armed police officer moves up Calhoun Street on June 17. Hide Caption Charleston church shooting 17 photos People gather after the shooting. Hide Caption Charleston church shooting 17 photos Police stand outside the church. Hide Caption Charleston church shooting 17 photos Police close off a section of Calhoun Street near the scene of the shooting. Hide Caption 16 of 17 Charleston church shooting 17 photos Police in Charleston released this security-camera image that they say shows Roof entering the Emanuel African Methodist Episcopal Church. Hide Caption 17 of 17 EXPAND GALLERY \"We have to shift how we think about this issue and we have the capacity to change, but we have to build a sense of urgency about it,\" he said. \"That's how we honor those families (in Charleston). That's how we honor the families of Newtown, and that's how we honor the families in Aurora.\" In his speech to mayors, the President acknowledged the racist motivations of Dylann Roof , who sources say admitted to shooting nine people at the historic Emanuel African Methodist Episcopal Church on Wednesday night. Roof, according to witnesses, told his victims that he came to \"shoot up black people.\" \"The apparent motivations of the shooter remind us that racism remains a blight that we have to combat,\" Obama said on Friday. \"We have made great progress, but we have to be vigilant because it still lingers.\" Violent acts -- often committed by young people -- \"betrays our ideals and tears our democracy apart,\" he said, adding later that other countries, despite confronting similar mental health problems, \"don't see murder on this kind of scale, with this kind of frequency.\" \"At some point as a country, we have to reckon with what happens. It is not good enough simply to show sympathy,\" he said. The President's comments came on the same day he issued a statement on the 150th anniversary of Juneteenth, when the abolition of slavery was announced in Texas. JUST WATCHED", "external_links": [], "published": "2015-06-30T22:45:00.000+03:00", "crawled": "2015-06-30T23:24:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}