{"organizations": ["Senate Judiciary Committee", "Senate", "St. Anthony of Padua Roman Catholic Church", "NBC", "Senate Foreign Relations Committee", "Delaware Democratic Party", "Egyptian-Israeli Peace Treaty", "Supreme Court"], "uuid": "93c4f4117353d6581b080af034a8731df0d27a5b", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/02/politics/beau-biden-funeral/index.html", "country": "", "title": "Obama set to eulogize Beau Biden - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Obama set to eulogize Beau Biden - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T22:13:00.000+03:00", "replies_count": 0, "uuid": "93c4f4117353d6581b080af034a8731df0d27a5b"}, "author": "", "url": "http://www.cnn.com/2015/06/02/politics/beau-biden-funeral/index.html", "ord_in_thread": 0, "title": "Obama set to eulogize Beau Biden - CNNPolitics.com", "locations": ["United States", "U.S.", "Delaware", "Washington", "Wilmington", "Kabul", "South Carolina", "Orangeburg", "Dover", "St. Anthony of Padua", "Chicago", "Baghdad", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jimmy Carter", "Beau", "John Edwards", "Frank Church", "Naomi", "Joe Biden", "Barack Obama", "Anwar Sadat", "Carter", "Obama", "Jill", "Sonia Sotomayor", "Hillary Clinton", "Neilia", "Neilia Biden", "Beau Biden", "Jeanne", "Sherman W. Tribbitt", "Biden"], "text": "Beau Biden: Dad 'most loyal person' Washington (CNN) President Barack Obama will remember Beau Biden , the late son of Vice President Joe Biden, during a funeral Mass in Delaware on Saturday, the White House says. Obama will deliver the eulogy for the younger Biden, the former attorney general of Delaware, who died Saturday at 46. He had battled brain cancer. In a statement Saturday night, Obama called Beau Biden a friend and \"one of the strongest men we've ever known.\" Photos: Vice President Joe Biden 14 photos Photos: Vice President Joe Biden 14 photos U.S. Vice President Joe Biden began his career in politics in 1972, winning election to the Senate at the age of 29 (he was 30 when he took office). The Delaware Democrat was reelected to the Senate six times, including 2008, before becoming the 47th vice president of the United States. Hide Caption 1 of 14 Photos: Vice President Joe Biden 14 photos Biden is sworn in for his second term as vice president by Supreme Court Justice Sonia Sotomayor, with his wife, Jill, and son, Beau, by his side, on January 21, 2013, in Washington. Hide Caption 2 of 14 Photos: Vice President Joe Biden 14 photos Biden presides over a ceremony in Baghdad to formally mark the end of the U.S. combat mission in Iraq on September 1, 2010. Hide Caption 3 of 14 Photos: Vice President Joe Biden 14 photos Biden and President-elect Barack Obama wave to the crowd at their election night party at Grant Park in Chicago on November 4, 2008. Hide Caption 4 of 14 Photos: Vice President Joe Biden 14 photos Biden speaks after being introduced as Obama's running mate while campaigning together after the Democratic National Convention in 2008. Hide Caption 5 of 14 Photos: Vice President Joe Biden 14 photos From left, former Sen. John Edwards, Biden, Obama and Sen. Hillary Clinton at a debate of Democratic presidential candidates on April 26, 2007, in Orangeburg, South Carolina. Hide Caption Photos: Vice President Joe Biden 14 photos Biden releases his memoir, \"Promises to Keep: On Life and Politics,\" in 2007. Hide Caption 7 of 14 Photos: Vice President Joe Biden 14 photos As a ranking member of the Senate Foreign Relations Committee, Biden is interviewed on NBC's \"Meet the Press,\" concerning the war in Iraq on August 14, 2005. Hide Caption 8 of 14 Photos: Vice President Joe Biden 14 photos While chairman of the Senate Foreign Relations Committee, Biden meets Afghan students during a visit to Kabul in 2002. Hide Caption Photos: Vice President Joe Biden 14 photos Biden is welcomed back after undergoing surgery for an aneurysm in 1988. Hide Caption 10 of 14 Photos: Vice President Joe Biden 14 photos Biden announces his candidacy for the Democratic presidential nomination in 1988. After three months he drops out, following reports of plagiarism and false claims about his academic record. Hide Caption 11 of 14 Photos: Vice President Joe Biden 14 photos While on the Senate Judiciary Committee, Biden meets with Sen. Frank Church, center, and Egyptian President Anwar Sadat after the signing of the Egyptian-Israeli Peace Treaty in 1979. Hide Caption 12 of 14 Photos: Vice President Joe Biden 14 photos President Jimmy Carter and Biden attend a reception for the Delaware Democratic Party in 1978. Biden was the first senator to endorse Carter's presidential candidacy two years earlier. Hide Caption 13 of 14 Photos: Vice President Joe Biden 14 photos At a convention in 1972, Biden and his first wife, Neilia, and his two sons take a photo with Delaware Gov.-elect Sherman W. Tribbitt and his wife Jeanne. Neilia Biden died in a car accident a few months later, after his first election to the Senate, along with their infant daughter, Naomi. Hide Caption 14 of 14 EXPAND GALLERY \"Like his dad, Beau was a good, big-hearted, devoutly Catholic and deeply faithful man who made a difference in the lives of all he touched -- and he lives on in their hearts,\" Obama said. \"But for all that Beau Biden achieved in his life, nothing made him prouder; nothing made him happier; nothing claimed a fuller focus of his love and devotion than his family.\" Biden, an Iraq War veteran who left behind two young children, has been remembered since his death as a committed prosecutor who also inherited his father's commitment to family and public service. In his own words: Joe Biden on his son, Beau The funeral Mass is set for Saturday morning at the St. Anthony of Padua Roman Catholic Church in Wilmington, where the Biden family has been gathering since Beau's death this weekend. Ahead of the service, Beau Biden will lie in honor at the Legislative Hall in Dover. A public viewing and wake will take place Friday at the St. Anthony of Padua church. ", "external_links": [], "published": "2015-06-02T22:13:00.000+03:00", "crawled": "2015-06-02T22:13:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}