{"organizations": [], "uuid": "09cb4a5f8474cace48dd2cf6214e1fda6b3e3c24", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/06/16/WE01220910/3623123/0jpg-3623123_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1250053", "country": "", "title": "President Obama urged to ‘pause’ Iran nuclear talks ( AHAD NIL CNN IREPORTER FROM SYLHET - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "President Obama urged to ‘pause’ Iran nuclear talks ( AHAD NIL CNN IREPORTER FROM SYLHET - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "09cb4a5f8474cace48dd2cf6214e1fda6b3e3c24"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1250053", "ord_in_thread": 0, "title": "President Obama urged to ‘pause’ Iran nuclear talks ( AHAD NIL CNN IREPORTER FROM SYLHET - CNN iReport", "locations": ["Iran", "SYLHET"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "\nCNN PRODUCER NOTE Tell us your storyUS Republican Senator Bob Corker has called on President Barack Obama to stop the nuclear negotiations with Iran and not to make a “bad deal” with the country. Corker in a letter on Monday asked the US president to “please pause and consider rethinking the entire approach.” “Walking away from a bad deal at this point would take courage, but it would be the best thing for the United States, the region and the world,” the chairman of the Senate Foreign Relations Committee claimed. Washington and its negotiating partners are in talks with Tehran in order to finalize a comprehensive nuclear agreement by the end of this month. Critics in the United States accuse the Obama administration of trying to reach a “bad deal” with Iran over the country's nuclear energy program. “I understand the dynamics that can develop when a group believes they are close to a deal and how your aides may view this as a major legacy accomplishment. However, as you know, the stakes here are incredibly high and the security implications of these negotiations are difficult to overstate,” Corker said in his letter to Obama.(AHAD NIL CNN IREPORTER FROM SYLHET BANGLADESH TAGS: breaking_news What do you think of this story? Select one of the options below. Your feedback will help tell CNN producers what to do with this iReport. If you'd like, you can explain your choice in the comments below. Be and editor! Choose an option below: ", "external_links": [], "published": "2015-06-16T03:00:00.000+03:00", "crawled": "2015-06-17T03:12:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}