{"organizations": [], "uuid": "f3542587bb355921f931e990d0b0fc752843b59a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3099438/images/o-JUDY-MOZES-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/21/israeli-minister-wife-tweet_n_7632202.html", "country": "", "title": "Wife Of Israeli Interior Minister Silvan Shalom Apologizes For Obama Tweet", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Wife Of Israeli Interior Minister Silvan Shalom Apologizes For Obama Tweet", "spam_score": 0.0, "site_type": "news", "published": "2015-06-22T00:18:00.000+03:00", "replies_count": 0, "uuid": "f3542587bb355921f931e990d0b0fc752843b59a"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/21/israeli-minister-wife-tweet_n_7632202.html", "ord_in_thread": 0, "title": "Wife Of Israeli Interior Minister Silvan Shalom Apologizes For Obama Tweet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "french", "persons": [], "text": "  Israeli Prime Minister Benjamin Netanyahu greets supporters at the party's election headquarters In Tel Aviv. Wednesday, March 18, 2015. (AP Photo/Dan Balilty) Zionist Union party co-leader Isaac Herzog arrives at the party's election headquarters in Tel Aviv, Israel, Wednesday, March 18, 2015. (AP Photo/Ariel Schalit) Ultra-Orthodox Jews line up to vote in Bnei Brak, Israel, March 17, 2015. An Israeli soldier votes at a military base in the settlement of Gush Etzion, West Bank, March 17, 2015. Bedouin women wait to cast their votes at a polling station in the town of Rahat, Mar. 17, 2015. Israeli Prime Minister Benjamin Netanyahu casts his vote during Israel's parliamentary elections in Jerusalem, March 17, 2015. Zionist Union leader Isaac Herzog accompanied by his wife Michal casts his vote in Tel Aviv, Israel, March 17, 2015. An Israeli settler poses for a picture next to a poster of leader of the Jewish Home party Naftali Bennett outside a polling station on election day on March 17, 2015 in the Jewish settelment of Ofra, West Bank. An Israeli border policeman votes in Hebron, West Bank, March 17, 2015. An Israeli settler votes, with the help of a child, in the settlement of Efrat, West Bank, March 17, 2015. An Arab Israeli woman and child are seen outside a polling station on election day on March 17, 2015 in Abu Gush, Israel. A poster of Israeli Prime Minister Benjamin Netanyahu is seen next to Israel's West Bank barrier on election day on March 17, 2015, next to the Palestinian village of Hizme, West Bank. An Israeli settler and her son cast their ballot at a polling station on election day on March 17, 2015 in the Jewish settelment of Ofra, West Bank. An Ultra Orthodox Jew casts his vote at a polling statin in Mea Shearim neighborhood during legislative election in Jerusalem, Israel on March 17, 2015.  Share ", "external_links": [], "published": "2015-06-22T00:18:00.000+03:00", "crawled": "2015-06-22T00:18:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}