{"organizations": [], "uuid": "6183d81ec4f26dbcc89e61b68354e785f5a27c52", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/pelosinancy_060415gn3.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/244033-pelosi-not-my-responsibility-to-find-the-votes-for-obama-trade-bill", "country": "US", "title": "Pelosi: 'Not my responsibility' to find votes for Obama trade bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Pelosi: 'Not my responsibility' to find votes for Obama trade bill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T19:12:00.000+03:00", "replies_count": 0, "uuid": "6183d81ec4f26dbcc89e61b68354e785f5a27c52"}, "author": "dweaver@thehill.com (Mike Lillis and Scott Wong)", "url": "http://thehill.com/policy/finance/244033-pelosi-not-my-responsibility-to-find-the-votes-for-obama-trade-bill", "ord_in_thread": 0, "title": "Pelosi: 'Not my responsibility' to find votes for Obama trade bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pelosi: 'Not my responsibility' to find votes for Obama trade bill By Mike Lillis and Scott Wong - 06/04/15 12:12 PM EDT \nHouse Minority Leader Nancy Pelosi (D-Calif.) on Thursday said the onus is squarely on Republicans to find the votes to pass a central piece of President Obama’s trade agenda.\"It's absolutely the Speaker's responsibility,\" Pelosi said. \"Every time we had a bill that came to the floor when I was Speaker he said it was a test of my leadership. It's a test of his. \n\"I have confidence in him,\" she added. \"I believe he can deliver 200 of his members, but it's not my responsibility.\" ADVERTISEMENT The Republicans control an overwhelming 245 seats in the lower chamber; they need only 218 to pass the trade promotion authority (TPA) legislation they're championing. But a large number of conservatives oppose the notion of granting any new powers to a president they've long accused of abusing his executive authority, leaving GOP leaders scrambling to rally Republican votes while the White House races to shore up more support on the Democratic side.At least 15 Democrats have said they'll vote in favor of the bill when it hits the House floor, which as expected as early as next week. Pelosi declined to say how she herself would vote, but suggested that number won't top 20. \"They need 218, they have probably have … a dozen and a half on the Democratic side — I don't know where everybody is — the Speaker should be able to deliver 200 votes,\" Pelosi said during a press briefing in the Capitol. \"I don't know why — they want this so much, they have the majority — why there's even any question they can deliver their vote,\" she added.\nSpeaker John Boehner (R-Ohio) has rejected the notion that it's the Republicans' responsibility to get the TPA bill through the House, arguing that more Democrats should be willing to back the top economic priority of their ally in the White House. \nSpeaking to reporters after Pelosi's press conference, Boehner dodged a question about the Democratic leader’s 200-vote challenge.“I’m not the whip, so I don’t get into vote counts,” Boehner said. “We’re working to get trade promotion authority finished.” The White House agreed with Pelosi, saying it has \"no reason to disagree with her assessment\" that Republicans will need to shoulder the load for passing fast-track through the House. “There is no one who is a better, more effective and more accurate vote counter on Capitol Hill than Nancy Pelosi,\" press secretary Josh Earnest said. Earnest said the onus is on Boehner to deliver the bulk of the votes for the fast-track bill. “We would expect he would use that substantial majority” to win support for the bill, Earnest said of the Speaker. The president is personally lobbying House Democrats to back the measure and Earnest said that effort will continue \"right up until the vote occurs.\" \nIn recent days, Boehner has been meeting with undecided Republicans to sway their vote on TPA. \nOn Wednesday, the Speaker led a TPA rally in the Capitol’s basement with more than 200 pro-trade allies from the manufacturing, agriculture, shipping and other industries. He also spoke by phone with Obama to compare notes on the trade bill.“He’s got some work to do too,” Boehner said of the president.Taking up the bill “sooner is better than later,” the Speaker added. “If we don’t get it done in June, I don’t know why you’d think we can get it done in July.”\"We need to get this finished. We’re gonna get it done.” \nWays and Means Chairman Paul Ryan (R-Wis.), briefing reporters on Thursday, acknowledged that supporters didn't have the votes yet to pass TPA but called it a \"very good week\" for the effort.\"We're picking up votes every day,\" including several votes on the House floor during a vote series on Thursday, Ryan said. \"The undecideds are falling the right way.\"\"I have not been as confident as I am right now,\" he added. \nObama has been hitting the phones to lobby members who are on the fence, and this week taped a series of local media interviews on trade that are airing in the districts of key Democrats. \n“I’m pretty confident that we are going to be able to get this done,” Obama said during an interview with Seattle NBC affiliate KING. \nThe president reportedly told Rep. Jim Himes (D-Conn.), a TPA supporter, that he has at least 20 Democratic votes for the trade bill so far. \nBut the trade bill is no easy sell for the White House, with Democrats feeling heavy pressure from labor unions and liberal groups to oppose it. \nWhile Obama argues he is negotiating the “most progressive” trade deal in history, many Democrats are skeptical, fearing the agreement will ultimately backfire on American workers. \n“I take the president at his word that he believes ... the argument he’s making, but I think he’s wrong,” Rep. David Cicilline (D-R.I.) said Wednesday. \n“It’s clear that this will, in the long term, not result in the growth of American jobs and an increase in wages,” he added. \n— This story was last updated at 1:22 p.m. \nScott Wong and Jordan Fabian contributed to this piece.", "external_links": [], "published": "2015-06-04T19:12:00.000+03:00", "crawled": "2015-06-04T22:35:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}