{"organizations": [], "uuid": "ebaf26be01d767db10ee008b9206c350ff8e3ff6", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/06/21/judy-mozes.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/06/21/un-tuit-sobre-obama-pone-en-jaque-a-un-politico-israeli", "country": "", "title": "Un tuit sobre Obama pone 'en jaque' a un político israelí", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Un tuit sobre Obama pone 'en jaque' a un político israelí", "spam_score": 0.0, "site_type": "news", "published": "2015-06-22T03:25:00.000+03:00", "replies_count": 0, "uuid": "ebaf26be01d767db10ee008b9206c350ff8e3ff6"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/06/21/un-tuit-sobre-obama-pone-en-jaque-a-un-politico-israeli", "ord_in_thread": 0, "title": "Un tuit sobre Obama pone 'en jaque' a un político israelí", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Un tuit sobre Obama pone 'en jaque' a un político israelí Judy Mozes, la esposa de un alto funcionario del partido Likud, se disculpó luego de llamar al presidente de EU \"negro y débil\" en Twitter Domingo, 21 de junio de 2015 a las 19:25 Judy Mozes se disculpó varias veces vía Twitter por haber publicado una broma sobre Obama (Getty Images/Archivo). Lo más importante La mujer se disculpó por 'bromear' sobre Obama Mozes borró el comentario y se disculpó luego de que los medios exhibieran su tuit Temas relacionados Israelíes arrasan con plantación palestina de olivos \n(CNN) — Judy Mozes, la esposa de un alto funcionario del partido Likud en Israel, Silvan Shalom, se disculpó el domingo luego de llamar al presidente de Estados Unidos \"negro y débil\" en Twitter. \nMozes dijo que estaba repitiendo una broma, pero poco después de publicar \"¿Sabes cómo es el café de Obama? Negro y débil\", borró el mensaje. \nEl tuit de Mozes llegó a los titulares israelíes. Posteriormente, la mujer escribió: \"Me disculpo, fue una broma estúpida que alguien me contó\". \nLee: EU e Israel: los países desarrollados más desiguales \nPero no era el final: Mozes siguió con las disculpas. \n\"Presidente Obama, no debí haber escrito la broma inapropiada que escuché. Me gusta la gente sin importar su color o religión\", escribió. \nLas publicaciones en Twitter llegaron en medio de las tensiones entre el primer ministro israelí, Benjamín Netanyahu, y Barack Obama por el acuerdo nuclear con Irán . \nAmbos líderes han aclarado que la cooperación estratégica y militar continúa. \nMozes es una columnista ocasional para el diario israelí Yediot Ahronot y conductora de televisión. Su esposo, Silvan Shalom, es ministro del Interior. \nNetanyahu se acercó a Shalom para liderar el proceso de paz entre israelíes y palestinos. \nRecomendamos: Israel suspende programa piloto de segregación de palestinos en autobuses Encuentra este artículo con: obama, negro, debil, judio, israel, judy mozes, silvan shalom Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"3959eaf17edc42c0a16f992517f74d7b\", \"time\": \"2015-06-22T00:25:47.520Z\" } Video ", "external_links": [], "published": "2015-06-22T03:25:00.000+03:00", "crawled": "2015-06-22T03:25:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}