{"organizations": [], "uuid": "8a4e1523da98624fee68fac280933a893fd58b56", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3020146/images/o-BARNEY-FRANK-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/barack-obama/feed", "section_title": "Barack Obama on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/01/barney-frank-tpp-mistake_n_7488796.html", "country": "US", "title": "Barney Frank: Obama Is Making 'A Big Mistake' On TPP", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Barney Frank: Obama Is Making 'A Big Mistake' On TPP", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T00:24:00.000+03:00", "replies_count": 0, "uuid": "8a4e1523da98624fee68fac280933a893fd58b56"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/01/barney-frank-tpp-mistake_n_7488796.html", "ord_in_thread": 0, "title": "Barney Frank: Obama Is Making 'A Big Mistake' On TPP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Rep. Frederica Wilson (D-Fla.) is rarely seen without one of her signature, colorful, wide-brimmed hats. She's even said she has hundreds of hats in her collection. Boozman hears his constituents loud and clear. The Arkansas senator has some of the most distinctive ears in the House. CORRECTION: This slideshow originally identified Boozman as a member of the House. We have updated to reflect he is a Senator from Arkansas. Though political opponents, including Sen. John McCain (R-Ariz.), have attempted to use Grijalva's mustache against him, he and his facial hair have risen above their enemies. Rep. DeLauro's short, dark hairdo makes her stand out. She's also known to wear some distinctive glasses and dynamic outfits. Some would even say she's a \"hipster.\" Lankford's bright red hair stands out in the sea of salt-and-pepper congressmen. Boehner's striking blue eyes are perhaps the most unusual pair in Congress. Also, his skin is orange. Wasserman Schultz's curly blonde hair can't be missed. An October 2012 Vogue makeover called attention to the Florida representative's style. King has made some eyebrow-raising remarks, so it's a good thing his brows are some of the most memorable in all of Congress. Most of the men in Congress opt for the clean-shaven look. While the few with facial hair favor the mustache, Green goes all out. Rep. Duckworth is the first Asian-American woman elected to Congress in Illinois, the first member of Congress born in Thailand and the first woman with disabilities to be elected to the U.S. House of Representatives. For many reasons she's one of the strongest and most recognizable members of the House. Noem is more than just a pretty face. Last year, after getting voted hottest freshman in congress, she brushed off the accolade, saying she'd rather the attention be given to her lawmaking skills. Rep. Engel has donned the same mustache since he was first elected to Congress in the early 1990s, making his facial hair the most reliable and recognizable in the House. Gabbard stands out from the crowd as the first American Samoan and the first Hindu member of Congress. Kennedy looks strikingly like his famous family members and political predecessors.  Share", "external_links": [], "published": "2015-06-02T00:24:00.000+03:00", "crawled": "2015-06-02T05:55:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}