{"organizations": [], "uuid": "ea59eb44f25ce3b5c531edf46d183d559572db62", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/Abortion_zone.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/21/texas-abortion-law-teed-up-for-supreme-court-review/", "country": "US", "title": "Texas abortion law teed up for Supreme Court review", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Texas abortion law teed up for Supreme Court review | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "ea59eb44f25ce3b5c531edf46d183d559572db62"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/06/21/texas-abortion-law-teed-up-for-supreme-court-review/", "ord_in_thread": 0, "title": "Texas abortion law teed up for Supreme Court review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 21, 2015 Associated Press Email Print FILE: Jan. 15, 2014: Alan Hoyle, of Lincolnton, N.C., outside the Supreme Court in Washington, D.C. (AP)\nAbortion is back before the Supreme Court, and the justices could signal by the end of June whether they are likely to take up the biggest case on the hot-button subject in nearly a quarter-century.\nIf the court steps in, the hearing and the eventual ruling would come amid the 2016 presidential campaign.\nThe court is considering an emergency appeal from abortion providers in Texas, who want the justices to block two provisions of a state law that already has forced the closure of roughly half the licensed abortion clinics in the state. Ten of the remaining 19 clinics will have to shut their doors by July 1, without an order from the Supreme Court.\nThe Texas law is among a wave of state measures in recent years that have placed restrictions on when in a pregnancy abortions may be performed, imposed limits on abortions using drugs instead of surgery and increased standards for clinics and the doctors who work in them.\nThe Texas case involves the last of these categories. The provisions at issue require clinics to meet hospital-like surgical standards and also call on doctors who work in the clinics to have admitting privileges at a nearby hospital. Republican presidential candidate Rick Perry signed the law in 2013 when he was the state's governor.\nBackers of the law say those are common-sense measures intended to protect women. Abortion rights groups say the regulations have only one aim: to make it harder, if not impossible, for women to get abortions in Texas.\nThe case could be attractive to the justices because it might allow them to give more definition to the key phrase from their last big abortion ruling, Planned Parenthood v. Casey, in 1992. States generally can regulate abortion unless doing so places \"an undue burden\" on a woman's right to get an abortion.\n\"Courts have been fumbling for years about what does it mean to be undue under Casey,\" said Priscilla Smith, a Yale Law School professor and defender of abortion rights.\nSome abortion opponents also see the case as a strong candidate for Supreme Court review. \"The likelihood of this case getting to the Supreme Court is very high and I think that's a good thing,\" said Mike Norton, senior counsel for Alliance Defending Freedom, a Christian-oriented public interest law firm.\nThe justices blocked the two provisions once before, in November 2014 while the New Orleans-based 5th U.S. Circuit Court of Appeals was weighing whether those parts of the law violate a woman's right to an abortion. The appeals court upheld the provisions on June 9 and has since refused to put its ruling on hold while the clinics ready their appeal to the Supreme Court.\nIn 2013, four justices -- enough to hear an appeal -- said the high court probably would want to weigh in. In an earlier phase of the same case, Justice Stephen Breyer wrote that the court probably would take up the controversial provisions.\nThe constitutionality of the new law is a difficult question, Breyer wrote. \"It is a question, I believe, that at least four members of this court will wish to consider irrespective of the 5th Circuit's ultimate decision,\" he said in an opinion that was joined by the other three liberal justices.\nSince then, a different set of judges from the same appeals court has prevented Mississippi from enforcing its own admitting privileges requirement because doing so would close the last abortion clinic in the state. In that case, the court said that Mississippi could not force women to cross state lines to get an abortion.\nThe state already was seeking Supreme Court review and the justices could say as early as Monday whether they will weigh in, although the Texas case could cause the justices to defer action in Mississippi.\nIn Texas, women in the El Paso area in the western part of the state would have to cross into New Mexico to reach the nearest clinic. The appeals court said that wasn't a problem because many Texas women in that part of the state already do so.\nJustice Anthony Kennedy's views are likely to determine the outcome in this case, as in so many other divisive issues.\nKennedy was one of the three authors of the Casey opinion that reaffirmed a woman's right to an abortion and struck down a Pennsylvania requirement that women tell their husbands before getting an abortion. But he also wrote the 2007 opinion that upheld a federal ban on an abortion procedure that opponents call partial-birth abortion.\nLegal experts on both sides of the issue said there is no indication that Kennedy might abandon his support for abortion rights altogether. But they differ on how Kennedy will view the clinic restrictions.\n\"I think he's quite devoted to the Casey standard and to the sense of Casey as compromised,\" said Smith, who argued the 2007 case at the Supreme Court.\nBut Carter Snead, a Notre Dame University law professor and abortion opponent, said Kennedy generally has been willing to sustain legal restrictions on abortion.\n\"In fact, during his tenure on the court, he has only struck down one abortion restriction, namely, the spousal notification provision at issue in Planned Parenthood v. Casey,\" Snead said.\nAdvertisement\nTrending in Politics 1 Charleston church tragedy sparks feud between Clinton, Trump camps 2 Perry: 'American people are going to see a very different candidate' 3 Texas abortion law teed up for Supreme Court review 4 No Texas Planned Parenthood facilities in works as more restrictions loom 5 Church killings reignite debate on South Carolina flying Confederate battle flag ", "external_links": ["http://www.ap.org/"], "published": "2015-06-21T03:00:00.000+03:00", "crawled": "2015-06-21T20:06:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}