{"organizations": ["Fox News White House", "Obamas", "White House", "Facebook", "Twitter"], "uuid": "3921cba639c4beb8791731bfb932b871e82938eb", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/061615_dcl_prince_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/06/16/white-house-tight-lipped-on-private-party/", "country": "", "title": "White House claims Obamas picked up tab for private party featuring Prince | Fox News", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "White House claims Obamas picked up tab for private party featuring Prince | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-17T03:50:00.000+03:00", "replies_count": 0, "uuid": "3921cba639c4beb8791731bfb932b871e82938eb"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/16/white-house-tight-lipped-on-private-party/", "ord_in_thread": 0, "title": "White House claims Obamas picked up tab for private party featuring Prince | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "White House claims Obamas picked up tab for private party featuring Prince Published June 16, 2015 Facebook 0 Twitter 0 livefyre Email Print \nThe White House declined comment Monday on a private weekend party for 500 featuring Prince but claimed the Obamas picked up the tab. \nReporters began raising questions on Monday with Press Secretary Josh Earnest, after word of the event, which also included live music by Stevie Wonder, surfaced on social media. Unlike previous private White House events, this one had not been listed on the president's schedule. \n“Leaving the White House party w/POTUS and FLOTUS. Awesome to see Prince and Stevie Wonder on keyboards together. Unbelievable experience,” tweeted the Rev. Al Sharpton, also an MSNBC host. \nEarnest confirmed the event occurred and said the Obamas \"paid for the event\" with their own money -- but he did not release a guest list or reveal what the cost was. \n“Given the private nature of the event, I don't have a lot details to discuss from here,\" he said. \nEllen Ratner, White House correspondent for the Talk Radio News Service, said Tuesday the names of the attendees eventually will be known when the Secret Service releases the list of people allowed into the building. \n“But did [the Obamas] pay for it, or did the Democratic National Committee pay for it?” Ratner asked on FoxNews.com's “Strategy Room.” \nPrince was in Washington playing two shows at the Warner Theatre, just several blocks from the White House. \nThe New York Post reported the party included Seattle Seahawks quarterback Russell Wilson and his date, singer Ciara; musician Jon Bon Jovi; actress and Angela Bassett; television anchor Gayle King; Wall Street executive Robert Wolf; American Express chief executive Ken Chenault; National Security Adviser Susan Rice and Education Secretary Arne Duncan. \nWhen a reporter suggested that not posting the event conflicts with the president’s commitment to transparency, Earnest replied, “The fact that we're talking about a private event and the fact that details of this are known is an indication that the president is committed to being transparent. \n\"At the same time, the president and first lady are going to reserve the right to host private parties at the White House, and they did it on their own dime. I think that's consistent with the kinds of values that they have talked about.\" \nAdam Goodman, of the communication strategy firm the Victory Group, told \"Strategy Room\" that the president “simply cannot chose when to go on and off the grid.” \n“I think this is an example of that,” he continued. “And it raises, unnecessarily, a lot of questions about who paid for [the event] and why so secret.” Advertisement ", "external_links": [], "published": "2015-06-17T03:50:00.000+03:00", "crawled": "2015-06-17T03:50:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}