{"organizations": [], "uuid": "acd06e8b95d4fb5aebf84476932852a8958ef3aa", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/06/18/what-if-hillary-clinton-and-barack-obama-are-hiding-truth-about-libya-and-syria0/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1434568227429.jpg?ve=1&tl=1", "site_section": "http://feeds.foxnews.com/foxnews/opinion", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2015/06/19/how-my-dad-helped-set-me-up-for-success.html", "country": "US", "title": "What if Hillary Clinton and Barack Obama are hiding the truth about Libya, Syria?", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "What if Hillary Clinton and Barack Obama are hiding the truth about Libya, Syria?", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T13:00:00.000+03:00", "replies_count": 0, "uuid": "814309c8fd8a0b39227e733f56048ded80a6dd7a"}, "author": "Andrew Napolitano", "url": "http://www.foxnews.com/opinion/2015/06/18/what-if-hillary-clinton-and-barack-obama-are-hiding-truth-about-libya-and-syria0.html", "ord_in_thread": 0, "title": "What if Hillary Clinton and Barack Obama are hiding the truth about Libya, Syria?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Email Print (REUTERS) \nWhat if President Obama secretly agreed with others in the government in 2011 to provide arms to rebels in Libya and Syria? What if the scheme called for American arms merchants to sell serious American military hardware to the government of Qatar, which would and did transfer it to rebel groups? What if the U.S. Department of State and the U.S. Department of the Treasury approved those sales? \nWhat if the approvals were kept secret because some of those rebel groups were characterized by the same Departments of State and Treasury as terrorist organizations? What if the ultimate recipients of those arms were the militants and monsters in al-Qaida and ISIS who have slain and tortured innocents? \nWhat if this scheme is defined in federal law as providing material assistance to terrorist organizations? What if that’s a felony? What if that’s the same felony for which the U.S Department of Justice has prosecuted dozens of persons merely for attempting? What if this scheme was not a mere attempt, but an actual arming of terrorists? \nWhat if this scheme was approved not only by the president, but also by Secretary of State Hillary Clinton? What if the idea of doing this was hers? What if congressional leaders in both houses of Congress and from both parties signed off on this? What if the remaining members of Congress and the American people were kept in the dark about this scheme? What if those who agreed to permit this scheme knew that the arms were destined for terrorist organizations and they were flirting with a criminal conspiracy to violate federal law? \nWhat if President Obama secretly agreed with others in the government in 2011 to provide arms to rebels in Libya and Syria? What if this scheme was approved not only by the president, but also by Secretary of State Hillary Clinton? What if the idea of doing this was hers? What if congressional leaders in both houses of Congress and from both parties signed off on this? \nWhat if Clinton was asked by senators while under oath about the delivery of arms made by American manufacturers to ports in the Middle East and she denied knowing anything about it? What if she knew she had personally approved the deliveries but falsely claimed she had no knowledge? \nWhat if this arms-to-terrorists scheme began to unravel? What if the rebels were really bad guys? What if there are many rebel/terrorist groups with varying degrees of hatred for the United States? What if some of the groups that received American arms are so hateful of the U.S. that they will bite the hands that fed them? \nWhat if Clinton’s job was to prevent American arms from slipping into the hands of terrorists?What if she secretly did the opposite of what her job required? What if she and the president and the other conspirators viewed themselves as being above the law? What if they thought the terrorist groups they were arming would overthrow the Gadhafi government in Libya and the Assad government in Syria? What if they believed those revolutions would be greeted with cheers in the West? What if they hoped the cheers would be for them? \nWhat if their goal of regime change succeeded in Libya, and yet the result was chaos? What if under Col. Gadhafi Libya had been a stable U.S. ally? What if today there is no central government in Libya and it is ruled by gangs and tribes and militias? \nWhat if the American assistance to Syrian rebels became known to the Russians? What if that knowledge prompted Russian President Putin to help his ally, President Assad of Syria? What if the American and Russian introduction of heavy military hardware into the Syrian civil war has resulted in prolonged war and more deaths of innocents and destruction of property, not less? \nWhat if one of the terrorist groups that received American arms from this scheme attacked the American consulate in Benghazi, Libya, because it wanted more arms from the U.S. and it knew arms were stored there? What if that attack killed U.S. Ambassador to Libya Chris Stevens and three of his colleagues? What if this was a nightmare scenario for the conspirators? What if the conspirators now fear that the truth of their plot will become known? \nWhat if the tragedy at Benghazi was unwelcome but not unforeseen? What if the conspirators knew of the risks to innocent lives attendant upon breaking the law by giving arms to madmen? What if members of Congress who were kept in the dark about the arms-to-terrorists scheme were outraged over Benghazi? What if leaders of the House of Representatives, some of whom were conspirators, formed a committee to investigate how the murder of Stevens came about? \nWhat if some members of that committee already know that Stevens and the others were murdered with U.S. weapons illegally given to U.S. enemies secretly by U.S. government officials? What if the stated purpose of the committee -- to seek the truth about Benghazi -- is not the true purpose? What if the real purpose of that committee is to suppress the truth so that the president and Clinton and the other conspirators do not get indicted? What if the truth is the last thing the conspirators want to see come out? \nWhat do we do about lawless government by secrecy? What do we do about government officials who act as if they are above the law? What do we do if one of them lives in the White House and controls all federal prosecutions? What do we do if another of them is presently on her way there? \nAndrew P. Napolitano, a former judge of the Superior Court of New Jersey, is the senior judicial analyst at Fox News Channel.", "external_links": [], "published": "2015-06-18T13:00:00.000+03:00", "crawled": "2015-06-18T15:40:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}