{"organizations": [], "uuid": "6373996448db4c116f5be5d181fd2862bce791ac", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/061215_obama_arrives_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/12/obama-pleads-with-dems-to-keep-trade-agenda-afloat-ahead-critical-vote/", "country": "US", "title": "Obama pleads with Dems to keep trade agenda afloat ahead of critical vote", "performance_score": 7, "site": "foxnews.com", "participants_count": 14, "title_full": "Obama pleads with Dems to keep trade agenda afloat ahead of critical vote | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T03:00:00.000+03:00", "replies_count": 22, "uuid": "cba6f4c97f8e9cfdb17f59dcf225a8179bfd96ee"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/12/obama-pleads-with-dems-to-keep-trade-agenda-afloat-ahead-critical-vote/#post-0", "ord_in_thread": 0, "title": "Obama pleads with Dems to keep trade agenda afloat ahead of critical vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 12, 2015 FoxNews.com livefyre Email Print\nPresident Obama pleaded Friday with congressional Democrats not to derail a key component of his second-term trade agenda, trying to calm arguably the biggest flare-up with his own party since taking office.\nThe president paid a rare Capitol Hill visit ahead of a critical vote Friday morning, meeting with Democrats in a bid to ease their concerns. Obama has been dealing with an all-out rebellion in the ranks, on an issue that has created unusual alliances -- with congressional Republican leaders now his biggest defenders on trade, and rank-and-file Democrats his biggest foes.\nIt's unclear whether Obama's visit made the difference.\n\"I think he may have changed some votes,\" Rep. Steve Israel, D-N.Y., said after the meeting.\nBut other Democrats took to the floor to rail against the agenda, worried about the impact on U.S. jobs.\n\"Stand up for the working people,\" Rep. John Lewis, D-Ga., bellowed on the floor.\nThe first upcoming House vote on Friday is on the so-called Trade Adjustment Assistance bill -- a program that retrains workers displaced by trade.\nDemocrats support that program, and it was put on the floor only as a way to win support for the marquee item -- a bill giving Obama so-called \"fast track\" authority to negotiate trade deals that Congress could approve or reject, but not amend. He hopes to use the authority, already agreed to by the Senate, to complete a sweeping pact with 11 other Pacific Rim nations which would constitute the economic centerpiece of his second term.\nDemocrats, though, have been threatening to oppose even the TAA, as a way to derail everything.\nIf that bill goes down, the entire trade push could unravel. If the bill is approved, the House moves on to the \"fast-track\" item, known as Trade Promotion Authority.\nObama needs that to push the Pacific trade pact. Obama says such a pact with Japan, Mexico, Singapore and other nations constituting 40 percent of the global economy would open up critical new markets for American products.\nRepublicans continued to stand in Obama's corner on Friday.\n\"Is America going to shape the global economy, or is it going to shape us?\" said Rep. Paul Ryan, the Wisconsin Republican who is head of the House Ways and Means Committee and a GOP pointman on an issue that scrambled the normal party alignment in divided government.\nBut Rep. Sander Levin, D-Mich., countered that the legislation heading toward a showdown vote included \"no meaningful protections whatever against currency manipulation\" by some of America's trading partners, whose actions he said have \"ruined millions of middle class jobs.\"\nThe president's last-minute visit to Capitol Hill marked a bid to stave off a humiliating defeat at the hands of his own party on a top second-term priority.\nThe move caught the GOP off-guard. House Republicans, already in the awkward position of allying themselves with Obama, found themselves being asked by their leaders to vote for a worker retraining program that most have long opposed as wasteful. Many were reluctant to do so, leaving the fate of the entire package up in the air, and Obama facing the prospect of a brutal loss -- unless he can eke out what all predict would be the narrowest of wins.\n\"If we have to pass something that's a Democratic ideal with all Republicans to get the whole thing to go,\" said Rep. Tom Rooney, R-Fla., \"we could be in trouble.\"\nFox News' Chad Pergram and The Associated Press contributed to this report.\n Politics 1 Iowa GOP officials cancel straw poll after candidate snubs 2 DOJ stirs free-speech fight after demanding libertarian site turn over info on commenters 3 Obama pleads with Dems to keep trade agenda afloat ahead of critical vote 4 Obama makes last-ditch plea to Dems ahead of showdown vote on trade 5 Sorry, no Scooby Doo-over for Hillary ", "external_links": [], "published": "2015-06-12T03:00:00.000+03:00", "crawled": "2015-06-12T20:03:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}