{"organizations": [], "uuid": "53b9b2991e6ef295f1c10c22582d04e6f9881050", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/murkowskilisa_052014gn_0.jpg", "site_section": "http://thehill.com/taxonomy/term/2003/feed", "section_title": "The Hill: Energy & Environment Regulation", "url": "http://thehill.com/policy/energy-environment/245167-senate-gop-moves-against-obamas-climate-water-rules-through", "country": "US", "title": "Senate GOP moves against Obama green agenda via spending", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate GOP moves against Obama green agenda via spending", "spam_score": 0.0, "site_type": "news", "published": "2015-06-17T00:04:00.000+03:00", "replies_count": 0, "uuid": "53b9b2991e6ef295f1c10c22582d04e6f9881050"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/245167-senate-gop-moves-against-obamas-climate-water-rules-through", "ord_in_thread": 0, "title": "Senate GOP moves against Obama green agenda via spending", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate GOP moves against Obama green agenda via spending Greg Nash By Timothy Cama - 06/16/15 05:04 PM EDT \nA Senate spending panel voted Tuesday to block or weaken key Obama administration environmental rules on climate change, water and other subjects. \nThe bill would fund the Environmental Protection Agency (EPA), the Interior Department and other related agencies at $30.01 billion for the 2016 fiscal year, about $400 million less than what Congress passed for this year. ADVERTISEMENT It would overturn the EPA’s rule asserting power over small waterways like wetlands and streams and prevent it from writing a strict new rule on ground-level ozone pollution.\nUnder the bill, administration officials would not be allowed to enforce the EPA’s carbon limits for power plants in states that object, or enforce the Interior Department’s regulations on hydraulic fracturing in states that already have such rules. \nIt is the first time the Senate has passed an Interior and EPA spending bill through subcommittee in six years. \n“This bill aggressively deals with the EPA’s regulatory overreach on both the funding end and the sensible policy provisions,” Sen. Lisa Murkowski (R-Alaska), chairwoman of the subcommittee responsible for writing the bill, said at the Tuesday meetings to consider it. \nThe panel did not release the entire language of the bill, though lawmakers announced some of the major provisions and funding levels. \nThe legislation aims to significantly cut so-called “fire borrowing,” in which federal agencies take funds from other programs to meet wildfire needs that exceed their budgets. \nIt also slashes funding for the EPA’s legal departments, which Murkowski accused of “finding creative justifications for writing rules that go far beyond what Congress intended when important environmental laws like the Clean Air Act and Clean Water Act were enacted,” including the rules that the bill would block or weaken. \nThe bill would also force the Interior Department to allow construction of a 10-mile road through Izembek National Wildlife Refuge in Alaska, a road that Murkowski has fought to build for years in order to help residents of King Cove reach the nearest port. \nSen. Tom Udall (D-N.M.) castigated the Republicans for what he called “ideological” policy provisions that do not belong in spending legislation. \n“This bill takes dead aim at core environmental laws that for decades protected the health of our communities, our families and our environment, and were for decades bipartisan,” Udall said. “It weakens the Clean Air Act, the Clean Water Act and other important laws, and would weaken them permanently.” \nBut Republicans applauded Murkowski’s provisions. \n“I voted for most of the clean air provisions in the Senate, but the Clean Power Plan strikes me as extremely arbitrary,” Sen. Lamar Alexander (R-Tenn.) said of the carbon rules for power plants. \nHe said the ozone rule from the EPA is “like moving the goalposts just as you’re about to get to the goal line.” \nSen. John Hoeven (R-N.D.) applauded blocking the water rule. \n“I think there really is bipartisan support that that provision be defunded, and that it truly is a problem as has been proposed by the EPA,” he said. \nThe Senate panel approved its bill by voice vote, and Udall said that although he wants to try to remove the environmental regulation provisions, he will withhold those amendments until the full Appropriations Committee votes on the bill. \nEarlier in the day, the House Appropriations Committee voted to approve its version of the Interior and EPA bill, with some similar policy provisions and a slightly higher funding level. Tags:", "external_links": [], "published": "2015-06-17T00:04:00.000+03:00", "crawled": "2015-06-17T01:18:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}