{"organizations": [], "uuid": "aabb6af14180a8d8ab7855e1a12acd38111591dd", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamacaresigning_032310getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/healthcare/245128-obama-healthcaregov-a-well-documented-disaster", "country": "", "title": "Obama: HealthCare.gov 'a well-documented disaster' | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama: HealthCare.gov 'a well-documented disaster' | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "aabb6af14180a8d8ab7855e1a12acd38111591dd"}, "author": "", "url": "http://thehill.com/policy/healthcare/245128-obama-healthcaregov-a-well-documented-disaster", "ord_in_thread": 0, "title": "Obama: HealthCare.gov 'a well-documented disaster' | TheHill", "locations": ["Jordan Fabian"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama: HealthCare.gov 'a well-documented disaster' Getty Images By Jordan Fabian - 06/16/15 12:56 PM EDT \nPresident Obama admits HealthCare.gov was a “well-documented disaster,” but says it helped the federal government better understand how to handle technology. \n“With all the crises we were dealing with — the economy collapsing, the auto industry on the verge of collapse, winding down wars — this did not get the kind of laser-focused attention until ­HealthCare.gov, which was a well-­documented disaster, but ended up anyways being the catalyst for us saying, ‘Okay, we have to completely revamp how we do things,’ ” Obama said in an interview with Fast Company published Monday. ADVERTISEMENT Obama’s comments come as he’s trying to promote his administration’s efforts to overhaul the government’s ancient technology infrastructure. \nThe president said outdated procurement rules and a lack of technological expertise hampered large-scale government projects, such as HealthCare.gov. But he said his administration has adopted new rules and recruited staffers from Google, Facebook and Twitter to beef up its tech efforts. \n“If we are able through the U.S. digital team to recruit a baseline of talent and create a — pipeline — on a regular basis ... what I do believe will happen is the government as a whole will start thinking about its relationship to citizens differently,” Obama said. \nHealthCare.gov, which suffered from major glitches, was a black mark on the president’s signature healthcare law. Obama in 2013 announced a “tech surge” to fix issues that prevented people from signing up for insurance through online exchanges. \n“No one is madder than me that the website isn't working as it should — which means it's going to get fixed,” he said at the time. \nThroughout the last year, he touted improvements to the site and personally urged Americans to sign up for insurance during the open enrollment period. \nObama is now confronting a massive hack that may have compromised personal information for up to 14 million federal employees and others, the largest data breach ever at the federal government. \nThe president said in the interview, which was conducted before the hack was made public, that there is still work to do to upgrade the federal government’s technology. \n“Part of what we’re going to have to do is just change culture, change administrative habits, and get everybody thinking in a different way,” Obama said. Tags: ", "external_links": [], "published": "2015-06-16T03:00:00.000+03:00", "crawled": "2015-06-17T00:08:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}