{"organizations": [], "uuid": "3f376093cacfc698f3ac933f0c8e6094dc307769", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/cash_061915getty.jpg", "site_section": "http://thehill.com/taxonomy/term/2005/feed#", "section_title": "The Hill: Finance Regulation", "url": "http://thehill.com/regulation/finance/245857-dems-to-obama-finalize-executive-order-on-campaign-spending", "country": "US", "title": "Dems to Obama: Issue executive order on campaign spending", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Dems to Obama: Issue executive order on campaign spending", "spam_score": 0.0, "site_type": "news", "published": "2015-06-23T20:59:00.000+03:00", "replies_count": 0, "uuid": "3f376093cacfc698f3ac933f0c8e6094dc307769"}, "author": "lwheeler@thehill.com (Lydia Wheeler)", "url": "http://thehill.com/regulation/finance/245857-dems-to-obama-finalize-executive-order-on-campaign-spending", "ord_in_thread": 0, "title": "Dems to Obama: Issue executive order on campaign spending", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dems to Obama: Issue executive order on campaign spending By Lydia Wheeler - 06/23/15 01:59 PM EDT Democrats in both chambers of Congress are calling on President Obama to finalize an executive order that would force federal contractors to disclose their political spending. The letter from members of the House was signed by 104 lawmakers, including Reps. Anna Eshoo (D-Calif.), Steve Israel (D-N.Y.), Michael Capuano (D-Mass.) and Donna Edwards (D-Md.), and asks Obama to re-propose and finalize a draft executive order that dates back to 2011. “Taxpayers have a right to know where their money is spent and you have the power to ensure that the American people can obtain this information,” the letter said. “With public funds come public responsibilities, and any company receiving federal tax dollars should be required by Executive Order to fully disclose their political spending in a timely and accessible manner.” The draft executive order, titled “Disclosure of Political Spending by Government Contractors,” would have required any entity bidding for a federal contract to full disclose its political spending. The lawmakers said in the two elections since the draft was released, nearly half a billion dollars of undisclosed money has flooded into U.S. elections. Reviving the executive order wouldn't solve the problem, but 26 Senate Democrats argued in a separate letter to Obama that it would be a step in the right direction. “Political spending by government contractors is a problem you can address without congressional authorization,\" said the letter led by Sen. Sheldon Whitehouse (D-R.I.). “You would be on solid legal ground if you were to issue an executive order requiring disclosure of political spending by entities that have been awarded government contracts and their senior leadership.” New York Attorney General Eric Schneiderman is also calling on Obama to “end the secret payments from federal contractors seeking to sway our elections once and for all\" this week. In an op-ed in Politico on Monday, Schneiderman said the campaign finance system was improving until the Supreme Court stuck down limits on third-party spending on campaigns and candidates in the case known as Citizens United v. FEC. “The Center for Responsive Politics estimates that dark money accounted for more than $600 million in spending in the last three federal elections,” he said. “We know that industrial giants, military suppliers and other major government contractors spend disproportionately on lobbying and political action committees — for good reason.” Schneiderman said from 2000 to 2013, the top 10 federal contractors netted $1.5 trillion from the federal government. Though PAC contributions, lobbying fees and federal contracts are public record, he said dark money is not. A coaliton of 50 organizations has also called on Obama to finalize the executive order. The White House pushed the draft executive order, which sparked outcry from GOP leaders, to the backburner in 2012 and has yet to reconsider the issue. Republicans have been largely against further campaign disclosure rules. Tags:", "external_links": [], "published": "2015-06-23T20:59:00.000+03:00", "crawled": "2015-06-24T04:53:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}