{"organizations": [], "uuid": "852e1146f6d12b6416699349ba9bd3349e62f83c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3029526/images/o-MARIJUANA-BUD-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/medical-marijuana/feed", "section_title": "Medical Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/03/congress-medical-marijuana_n_7505066.html", "country": "US", "title": "House Votes In Favor Of Medical Marijuana Protections", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "House Votes In Favor Of Medical Marijuana Protections", "spam_score": 0.0, "site_type": "news", "published": "2015-06-03T19:26:00.000+03:00", "replies_count": 0, "uuid": "852e1146f6d12b6416699349ba9bd3349e62f83c"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/03/congress-medical-marijuana_n_7505066.html", "ord_in_thread": 0, "title": "House Votes In Favor Of Medical Marijuana Protections", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House Votes In Favor Of Medical Marijuana Protections Posted: Updated: 22 minutes ago LOS ANGELES, CA - OCTOBER 19: Dave Warden, a bud tender at Private Organic Therapy (P.O.T.), a non-profit co-operative medical marijuana dispensary, displays various types of marijuana available to patients on October 19, 2009 in Los Angeles, California. Attorney General Eric Holder announced new guidelines today for federal prosecutors in states where the use of marijuana for medicinal purposes is allowed under state law. Federal prosecutors will no longer trump the state with raids on the sou | David McNew via Getty Images reddit \nWASHINGTON -- The House of Representatives voted Wednesday to reauthorize an amendment that would protect medical marijuana operations from federal interference in states where the drug is legal, siding with a majority of Americans who say that medical marijuana is an issue best left to the states . \nThe amendment, offered by Reps. Dana Rohrabacher (R-Calif.) and Sam Farr (D-Calif.) to the fiscal year 2016 Commerce, Justice, Science and Related Agencies appropriations bill, passed 242 to 186. It blocks the Justice Department, including the Drug Enforcement Administration, from using funds to undermine state-legal medical marijuana programs. \n\"Our founding fathers didn't want criminal justice to be handled by the federal government,\" Rohrabacher said passionately during debate on the legislation in the early hours of Wednesday morning. \"This is absolutely absurd that the federal government is going to mandate all these things even though the people of the states and many doctors would like to have the right to prescribe to their patients what they think will alleviate their suffering. This is states' rights issue. Our founding fathers didn't want a police force that can bust down people's doors. They wanted individual freedom.\" \nSome of Rorhrabacher's passion was directed toward Louisiana Rep. John Fleming (R), who spoke in opposition to the measure Wednesday and characterized medical marijuana as \"a big joke,\" and simply a path to full legalization. \nThe same amendment passed in the U.S. House last year, and it ultimately made it into the final federal spending bill signed into law by President Barack Obama in December . Unless Congress renews the medical marijuana provision, however, it will expire later this year because it is part of an annual funding bill. \nThe Senate will likely consider its own appropriations bill for the DEA, and the House amendment would have to survive a joint conference before it could go into effect. \nReps. Jared Polis (D-Colo.) and Tom McClintock (R-Calif.) offered a similar amendment, but one that extends protections to states that have legalized marijuana for all purposes, be it medical or recreational. That amendment, which failed narrowly by a vote of 206 to 222, would have stopped the federal government from interfering with businesses that are in compliance with their state marijuana laws. \nTo date, Colorado, Washington, Alaska, Oregon and the District of Columbia have legalized marijuana for recreational purposes. Twenty-three states and D.C. have legalized medical marijuana, and 15 others have legalized the limited use of low-THC marijuana for medical purposes. Still, the federal government continues to ban the plant, classifying it as one of the \" most dangerous \" drugs alongside heroin and LSD. \nThe states that have legalized have only been able to do so because of federal guidance urging prosecutors to refrain from targeting state-legal marijuana operations. However, states that have legalized have seen an aggressive crackdown under the Obama administration, with hundreds of raids on dispensaries in places such as California and Colorado . Many of the targeted dispensaries were operating in compliance with state law. \nA second medical marijuana amendment from Rep. Scott Perry (R-Penn.) passed 297 to 130, protecting states that have legalized the limited use of refined marijuana oils for medicinal use. \nHouse lawmakers also extended protections to industrial hemp. An amendment offered by Reps. Thomas Massie (R-Ky.) and Suzanne Bonamici (D-Ore.) prohibits the DEA from interfering with state-legal hemp programs. It passed 282 to 146. \nThe same plant species as marijuana, cannabis sativa, hemp contains little to no THC, the psychoactive ingredient found in marijuana associated with the “high” sensation. The farm bill that President Barack Obama signed into law in 2014 legalized industrial hemp production for research purposes in states that permit it. \nOn Tuesday, lawmakers passed multiple amendments on voice votes aimed at moving millions of dollars out of the DEA’s budget to fund police reform and community relations programs. \n“Votes in support of rolling back the federal government’s war on medical marijuana are beginning to become routine,” said Dan Riffle, director of federal policies for the Marijuana Policy Project, in a statement, “Last year, passing this amendment was unprecedented. This year, it was predictable. Medical marijuana has gone from ‘controversial’ to ‘conventional’ on Capitol Hill.” Also on HuffPost:", "external_links": [], "published": "2015-06-03T19:26:00.000+03:00", "crawled": "2015-06-04T00:25:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}