{"organizations": [], "uuid": "0885e72fac51d069ec37d0a52e85ddb0fd3495c3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3113694/images/o-CHRIS-MURPHY-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/24/chris-murphy-trade_n_7656222.html", "country": "", "title": "Sen. Chris Murphy: Obama Has Been Pushing Foreign Policy Through Trade All Wrong", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Sen. Chris Murphy: Obama Has Been Pushing Foreign Policy Through Trade All Wrong", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T01:11:00.000+03:00", "replies_count": 0, "uuid": "0885e72fac51d069ec37d0a52e85ddb0fd3495c3"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/24/chris-murphy-trade_n_7656222.html", "ord_in_thread": 0, "title": "Sen. Chris Murphy: Obama Has Been Pushing Foreign Policy Through Trade All Wrong", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chris Murphy", "Obama"], "text": "Sen. Chris Murphy: Obama Has Been Pushing Foreign Policy Through Trade All Wrong Posted: reddit \nWASHINGTON -- Hours after it became clear that President Barack Obama's trade agenda would make it through Congress, a top Democratic voice on foreign policy told The Huffington Post that while he respected the Obama administration's foreign policy goals, it was pursuing them in a dangerous fashion with its current approach to international trade. \n\"I think the president is compelling in that there's an economic element to statecraft ... but the question here is whether the potential benefits when it comes to America's economic and diplomatic relationships in the region are worth the potential job loss back here at home,\" said Sen. Chris Murphy (D-Conn.), a member of the Senate Foreign Relations Committee. \"Many of us, when we balance the two together, just don't find a compelling reason to harm a lot of our constituents who we believe would lose jobs because of this.\" \nMurphy was one of 37 senators on Tuesday to vote against a motion that paved the way for the Senate to approve Trade Promotion Authority, also known as fast-track, on Wednesday. \nThe senator is one of the few fast-track opponents to take on a key claim of the Trade Promotion Authority advocates : the idea that if Congress were not to pass the measure, the U.S. would become a significantly weaker global player because it would lack a critical trade presence in Asia and Europe. That concern is linked to worries about China and Russia flexing their muscles with smaller neighbors who often then call for greater U.S. support. \nAntony Blinken, the deputy secretary of state, referenced that argument on June 16, telling an audience of businesspeople invested in Southeast Asia that the president was \"absolutely committed\" to gaining both Trade Promotion Authority and a partner program called Trade Adjustment Assistance so that the administration can rapidly conclude a major trade deal with 11 other Pacific Rim nations this year. The pending Trans-Pacific Partnership, Blinken suggested, would renew U.S. commitment to the region. \nThe TPP \"will set a rock-solid foundation for constructive engagement in the region,\" Blinken said. He added that it \"offers a rare and sizable opportunity to fundamentally advance our values and solidify an economic arena where every participant -- however big, however small -- complies with safe labor standards, utilizes environmental safeguards, and agrees to fight trade-related bribery and corruption.\" \nOpponents of the deal -- including a number of Democrats, unions and environmental groups -- argue that's untrue. According to them, the TPP will reward human rights violators , while its potential international relations value will be offset by lower incomes for thousands of American workers. \nSpeaking to HuffPost, Murphy also made a more subtle point that may prove more appealing to colleagues who generally support the TPP: There should be a way to reach key trade deals, but the approach currently being pushed by the White House and congressional Republicans isn't it. \n\"I completely, wholeheartedly, accept the argument that closer economic ties between the United States and countries on China's periphery is smart foreign policy,\" Murphy told HuffPost. \"But there has to be an answer for the concerns that many of us have about job loss here in the United States or the evisceration of consumer protections for American consumers and citizens.\" \nBut granting fast-track authority to the president makes it more difficult for lawmakers to demand such answers in relation to specific deals. Under a fast-track system, Congress is barred from making any changes to a trade pact that the president has sent to the Hill, and lawmakers are given only a month to vote up or down on the pact. \nThe freshman senator said preventing that kind of questioning just for trade deals is \"a strange way to conduct policy.\" \n\"I object to the notion that we are going to grease the wheels of the legislative process for trade agreements and nothing else. From an international relations perspective, I can make the argument that there are lots of other things that Congress should be passing that would have much greater impact on America's place in the world,\" Murphy said. \"For instance, there is potentially no greater long-term threat to the world than climate change, and America's ability to lead is somewhat dependent on Congress' ability to show support for either domestic climate change legislation or an ultimate international agreement.But we don't create a separate process to pass climate change legislation.\" \n\"It creates a strange double standard,\" he said. \nEven as he stands opposed to Trade Promotion Authority for the president, Murphy said he has yet to decide whether he supports two actual deals to which it would apply: the TPP and another massive free-trade agreement being negotiated with Europe. \"I'm going to evaluate the agreement and weigh it between the economic benefits or detriment to my constituents versus the international relations benefit and make a decision,\" he told HuffPost. \nMurphy is among three younger Democratic senators currently pushing for a more progressive approach to foreign policy . They support engagement with partner nations -- including through trade pacts and increased U.S. assistance -- but urge that policymakers give more thought to the United States' own economic limitations. \nThe fast-track legislation passed the Senate on Wednesday and now heads to the president's desk. More: ", "external_links": [], "published": "2015-06-25T01:11:00.000+03:00", "crawled": "2015-06-25T01:13:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}