{"organizations": [], "uuid": "527ad1d5a6b30c0dd132c857c3d76c36c117098c", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/06/29/planta-elctrica-contaminacin.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/planetacnn/2015/06/29/la-corte-suprema-da-reves-a-ley-de-obama-sobre-emisiones-toxicas", "country": "", "title": "La Corte Suprema da revés a ley de Obama sobre emisiones tóxicas", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "La Corte Suprema da revés a ley de Obama sobre emisiones tóxicas", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T01:30:00.000+03:00", "replies_count": 0, "uuid": "527ad1d5a6b30c0dd132c857c3d76c36c117098c"}, "author": "", "url": "http://mexico.cnn.com/planetacnn/2015/06/29/la-corte-suprema-da-reves-a-ley-de-obama-sobre-emisiones-toxicas", "ord_in_thread": 0, "title": "La Corte Suprema da revés a ley de Obama sobre emisiones tóxicas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía La Corte Suprema da revés a ley de Obama sobre emisiones tóxicas El máximo tribunal determinó que el gobierno malinterpretó la ley al establecer límites para los gases tóxicos de las plantas eléctricas Por Ariane de Vogue Lunes, 29 de junio de 2015 a las 13:07 Los opositores de la industria argumentaron que los consumidores deberían pagar más por los servicios eléctricos debido a la regulación (Getty Images/Archivo). Lo más importante La Corte Suprema determinó que la Agencia de Protección Ambiental malinterpretó la Ley de Aire Limpio La ley establece que la agencia puede regular los contaminantes que produce la industria eléctrica La Corte determinó que debió considerar antes el costo que tendría para la industria eléctrica Temas relacionados OPINIÓN: La sequía en California, pesadilla de Asia \nWASHINGTON (CNN) — En una pérdida para la administración de Obama, la Corte Suprema de Justicia de Estados Unidos señaló que el gobierno interpretó de forma errónea la ley cuando decidió establecer límites a las emisiones de gases tóxicos de plantas de energía sin considerar antes el costo que tendría para la industria. \nLa Corte Suprema determinó con una votación 5-4 que la Agencia de Protección Ambiental de Estados Unidos (EPA, por sus siglas en inglés) malinterpretó la Ley de Aire Limpio, la cual señala que esa dependencia debe regular los contaminantes de las plantas de energía si estás medidas son consideradas “apropiadas y necesarias”. \nObama utilizó su autoridad ejecutiva en junio de 2014 para permitir que la EPA pudiera regular las emisiones de carbono de las plantas de energía. El presidente argumentó que los contaminantes del aire, como mercurio y arsénico, están asociados con defectos en el nacimiento, cáncer y otros riesgos, especialmente para las mujeres embarazadas y niños. \nY que las centrales energéticas alimentadas por petróleo y carbón son el principal factor de contaminación por mercurio en lagos y ríos. \nEl tema que se debatía era si la EPA violó la Ley de Aire Limpio cuando declinó considerar los costos que tomaría regular los contaminantes. 23 estados y algunos miembros de la industria argumentaron que la agencia debió considerarlos. \nLeer: Las reglas eran un 'respiro' para EU \n“La decisión de la EPA de que es apropiado ganar de 4 a 6 millones de dólares en beneficios de salud a un costo de 9,600 millones de dólares no es razonable, impone grandes gastos para los consumidores y amenaza con poner a servicios eléctricos fuera del negocio”, dijeron abogados de Michigan y otros 22 estados, según los documentos de la Corte Suprema. \nLos opositores de la industria argumentaron que bajo la dirección de la EPA serían obligados a gastar miles de millones de dólares en regular contaminantes convencionales que ya están reglamentados en otros programas de la Ley de Aire Limpio. \n“EPA hizo exactamente lo que la ley requiere”, aseguró Neil Gormley, un abogado de la organización ambiental Earthjustice DC. “La agencia de forma correcta se enfocó en la salud pública en un inicio y consideró los costos una vez que tuvo la información que necesitaba”. \n\"Los beneficios a la salud empequeñecen los costos para la industria. El público obtiene 9 dólares en beneficios de salud por cada dólar que la industria gasta”, agregó. Encuentra este artículo con: estados unidos, corte suprema, decision, ambiente, regulacion, gases, industria, epa, emisiones, ley del aire limpio Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"fe48a3c7ff714b4dac00ab4a80c5ee28\", \"time\": \"2015-06-29T22:31:20.877Z\" } Lo más popular ", "external_links": [], "published": "2015-06-30T01:30:00.000+03:00", "crawled": "2015-06-30T01:31:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}