{"organizations": [], "uuid": "d2f10a530bd1c4e967268097167eed0fda2c73b8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/061515_hn_edson_640.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/18/breakup-obama-gop-roll-dice-in-bid-to-defeat-anti-trade-dems/", "country": "US", "title": "The Breakup: Obama, GOP roll dice in bid to defeat anti-trade Dems", "performance_score": 1, "site": "foxnews.com", "participants_count": 21, "title_full": "The Breakup: Obama, GOP roll dice in bid to defeat anti-trade Dems | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T03:00:00.000+03:00", "replies_count": 22, "uuid": "0f120729a2e84927b463c9b6749e95c592213b5e"}, "author": "Chad Pergram", "url": "http://www.foxnews.com/politics/2015/06/18/breakup-obama-gop-roll-dice-in-bid-to-defeat-anti-trade-dems/#post-0", "ord_in_thread": 0, "title": "The Breakup: Obama, GOP roll dice in bid to defeat anti-trade Dems", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Chad Pergram \n  FoxNews.com Facebook 0 Twitter 0 livefyre Email Print \nBalladeer Neil Sedaka was onto something with his 1962 No. 1 hit \"Breaking Up Is Hard to Do.\"\nSedaka's sage wisdom speaks to what could stand in the way of President Obama scoring his big trade package -- an item once again before the House on Thursday, after the effort imploded last week.\nIf Obama's trade effort is to succeed, the House and Senate this time are going to have to break up two trade bills which are essential to finishing the accord. That tactic may be the only way to settle this. And the strategy might not work in the U.S. Senate.\nSome background:\nThe Senate approved two trade measures several weeks ago: Trade Promotion Authority (TPA) and Trade Adjustment Assistance (TAA). TPA is the legislative tool necessary to help the president finalize his sought-after trade deal with Pacific nations. TAA is an important side-car to Democrats. TAA helps ease adverse impacts from trade agreements for some businesses and workers. In order to earn Senate adoption of the package, GOP leaders had to wed the two measures together.\nBut that was not thought to be the case in the House. Most Democrats didn't want to approve TPA. Most Republicans rejected TAA. So the House Republican brass cleaved those bills in an effort to mirror the Senate. If the House approved the bills separately, lawmakers would then meld the plans together later and send the package to Obama.\nThe contingency didn't work. The House couldn't pass the bills, despite the decoupling. House Democrats voted in droves against TAA last Friday, despite a last-minute, personal plea from Obama. Still, there was an upside for trade supporters: the House OK'd TPP, 219-211. One-hundreds and ninety-one Republicans joined 28 Democrats to approve the plan -- even though the issue was then moot.\nBut the vote proved something: the House indeed had the votes to pass TPA. That buoyed the House Republican leadership. Democrats may not have coughed up the votes for TAA. But most Republicans and just enough Democrats formed a coalition to adopt the package.\n\"We're committed to moving forward as soon as possible,\" said House Speaker John Boehner, R-Ohio, on Tuesday.\nThe White House worked the phones and invited key House and Senate Democrats to the White House Wednesday to lock in those votes. And the GOP forged ahead with a plan.\n\"[The president] reiterated his commitment to working with leaders in Congress to pass both TPA and TAA and made clear he will only back a path forward that sends both bills to his desk,\" said the White House in a statement. \"The president reinforced that Congress must pass TAA, which will expire soon.\"\nThe House GOP leadership made a calculated decision to slightly roll the dice -- break away the TPA bill from the TAA measure, and put the former on the floor solo. This decision is key for trade advocates. They know the calls are pouring in from people outraged about the trade pact on both sides. Conservative lawmakers are fielding calls from Tea Party loyalists, characterizing the trade package as \"Obama-trade.\" There's concern that TPA supporters could grow wobbly if this sits out there too long. A quote from Ben Franklin lurks in the backs of their minds: \"Guests, like fish, begin to smell after three days.\"\nThe trade issue is lingering much longer than that.\nSo GOP leaders are pulling the trigger - believing the TPA coalition remains in tact.\nOn Tuesday evening, Rep. Ron Kind, D-Wis., the biggest advocate for TPA in the House, huddled with House Minority Whip Steve Scalise, R-La. Kind urged Scalise to hold off on scheduling a TPA vote. Kind then headed to the Senate to see if pro-trade Democrats could handle the split-bill approach. Kind met with his fellow \"Gang of 28\" Democrats Wednesday afternoon in the basement of the Capitol Visitor's Center.\n\"We've already voted for the TPA,\" said Rep. Kurt Schrader, D-Ore. \"I don't think the phone calls are going to change a heckuva lot.\"\nBut it wasn't just keeping Democrats together. Democrats also worried if Republicans would help them approve TAA as well.\n\"They have problems within their own ranks. But they're pledging to do everything they can to get TAA reauthorized,\" said Kind.\nRep. Gerry Connolly, D-Va., was more emphatic, saying Boehner guaranteed a TAA vote.\n\"And he stated declaratively TAA will pass,\" noted Connolly.\nA rare, joint statement materialized a while later from Boehner and Senate Majority Leader Mitch McConnell, R-Ky.\n\"We're committed to ensuring both TPA and TAA get votes in the House and Senate and are sent to the President for signature,\" said the duo.\nBut that involves fileting the bills. It's an issue for Sen. Chris Coons, D-Del., who spoke with Obama by phone and went to the White House to talk with the president in person. A Coons spokesman signaled that the Delaware Democrat \"would oppose TPA without assurances that TAA would also pass.\"\nCoons' reservation about TAA wasn't lost on Rep. Alcee Hastings, D-Fla., when the House Rules Committee convened to prep the TPA bill for debate late Wednesday afternoon.\n\"Do they have the assurances that the White House will sign this (TPA) without TAA?\" asked the Florida Democrat of Rules Committee Chairman Pete Sessions, R-Texas.\n\"I don't know,\" replied Sessions.\nBut Sessions exuded confidence everyone would get what they wanted in the end, whether they supported TPA or TAA.\n\"I think they measured three times and maybe sawed once,\" noted Sessions.\nOf course, this wouldn't have been an issue had Democrats not bucked their own president and voted for TAA last week -- a measure which they support on its merits. They voted no because they knew failure could imperil TPA.\nIf the House successfully advances the measure Thursday, the issue will lie in the Senate. Senators approved the combined TPA/TAA package 62-37. Fourteen Democrats voted yea. But unbuckling the bills is risky. Senate Democrats could balk. They could either outright defeat the legislation or block the bill from even getting to final passage. Sixty votes is necessary to vault the final procedural hurdle in the Senate.\nAfter all, breaking up is hard to do.\nDemocrats and Republicans congregated on the South Lawn of the White House Wednesday evening for the annual congressional picnic. Obama addressed the throng, barely touching on politics.\n\"Obviously democracy can be contentious,\" the president said during his brief remarks. He added that the American system was often \"frustrating and messy.\"\nJust like all breakups.\nCapitol Attitude is a weekly column written by members of the Fox News Capitol Hill team. Their articles take you inside the halls of Congress, and cover the spectrum of policy issues being introduced, debated and voted on there. \n  Cruz   3   4   Documents challenge Clinton claim no classified intel on personal emails  ", "external_links": [], "published": "2015-06-18T03:00:00.000+03:00", "crawled": "2015-06-18T18:08:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}