{"organizations": [], "uuid": "3dce076ede9e8fafd3a95677b423fd31b4fc36ad", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3120664/images/o-HEALTH-CARE-SUPREME-COURT-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/26/the-morning-email_n_7670120.html", "country": "", "title": "Friday's Morning Email: With Health Care Win, Obama Cements Legacy", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Friday's Morning Email: With Health Care Win, Obama Cements Legacy", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T15:20:00.000+03:00", "replies_count": 0, "uuid": "3dce076ede9e8fafd3a95677b423fd31b4fc36ad"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/26/the-morning-email_n_7670120.html", "ord_in_thread": 0, "title": "Friday's Morning Email: With Health Care Win, Obama Cements Legacy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Friday's Morning Email: With Health Care Win, Obama Cements Legacy Posted: \nTOP STORIES \nTo get The Morning Email, HuffPost's daily roundup of the news, in your inbox, sign up here. \nWITH HEALTH CARE WIN, OBAMA SEALS LEGACY With the Supreme Court's rejection of the Obamacare challenge yesterday, millions kept their health insurance while President Obama kept his health care legacy . The win was a \"vindication of policy priorities \" that \"has become the crowning domestic initiative of his tenure.\" [ Jonathan Cohn and Jeffrey Young, HuffPost ] SUSPECTED TERRORIST ATTACK ROCKS FRANCE \"One person was beheaded Friday in an attack and explosion at a gas factory in southeastern France that left multiple people wounded, two officials said. Banners with Arabic writing were found near the body, one of the officials said.\" [ AP ] \nWHAT'S LEFT FOR THE SUPREME COURT THIS SESSION Same-sex marriage, lethal injection, congressional redistricting, EPA emissions regulations and criminal gun law remain on the docket. [ Andrew Hart, Kelly Chen and Paige Lavender, HuffPost ] \nUN: ISIS ATTACK IN SYRIA DISPLACES 60,000 The UN warned that the ongoing attack by ISIS on Hasaka could displace up to 200,000 people. [ Reuters ] \nTHE STATE DEPARTMENT EMAILS HILLARY DIDN'T HAND OVER \"The State Department said on Thursday that 15 emails sent or received by Hillary Rodham Clinton were missing from records that she has turned over, raising new questions about whether she deleted work-related emails from the private account she used exclusively while in office.\" [ NYT ] \nGREEK BAILOUT DISCUSSIONS PUSHED TO WEEKEND Greece has until Tuesday before it defaults. European stocks are falling , but here's why a potential \"Grexit\" isn't as financially ruinous as it once was for the world. [ WSJ ] \nWHAT’S BREWING \nALL THE NBA PICKS But more importantly, all the outfits! [ HuffPost ] \nBRISTOL PALIN ANNOUNCES PREGNANCY \"Palin wrote that the pregnancy 'has been, and will be, a huge disappointment to my family' and asked for privacy. 'Honestly, I’ve been trying my hardest to keep my chin up on this one,' Palin wrote. 'At the end of the day there’s nothing I can’t do with God by my side, and I know I am fully capable of handling anything that is put in front of me with dignity and grace.'\" [ HuffPost ] \nWATCH OUT AT YOUR NEXT DOCTOR'S APPOINTMENT You could be reading a fake magazine. [ Daily Dot ] \n'STROMO' IS NOT A THING \"On Thursday, The Hollywood Reporter tried to make 'stromo' happen , with an article about 'straight white male stars going gay (ish).' After chucking their laptops into the sea, HuffPost Entertainment editors Matthew Jacobs and Lauren Duca got new laptops so that they could discuss what this means for society.\" [ HuffPost ] \nDISNEY PRINCESSES' EYES ARE LARGER THAN THEIR STOMACHS No, but really. It's horrifying. [ HuffPost ] \nCLIMB YOSEMITE FROM YOUR LAPTOP With the help of Google maps, you too can be climbing from your couch. [ Google ] \nDIVORCE WHERE IT'S ILLEGAL \"I had finally gotten out of my long-dead marriage in the devoutly Catholic Philippines, the only country in the world (other than Vatican City) where divorce is not legal. Two people can voluntarily choose to love, honor, and remain faithful to each other, but in the Philippines it is pretty much only through death, or the torturously long process of annulment, that they can part.\" [ The Atlantic ] \nWHAT'S WORKING \nTHE STARTUP TACKLING GREECE'S BLOOD DONOR PROBLEM \"Natalia Kritsali and Natalia Bougadellis came to realize the vast shortcomings of Greece’s blood donation process when they experienced immense difficulty finding a donor for Natalia Bougadellis's grandmother. They decided to put their frustration to good use and created Blood-e, a startup that seeks to increase Greece’s number of voluntary blood donors, as well as increase blood donation in general.\" [ HuffPost ] \nON THE BLOG \nUK EXECUTIVE EDITOR: TALKING ABOUT MY HUSBAND'S SUICIDE \"We must make it easier for people to reach out when the blackness threatens to swallow them whole. We must give men the space, voice and understanding to be scared and vulnerable and not see it as weakness. We must say that mental health desperately needs funding, that it should be as top a priority as tackling obesity or cancer. I'm not saying any of these things would have saved you. But I am saying that I refuse to remember you in anger and shame, when what we had was immense love.\" [ HuffPost ] \nBEFORE YOU GO ", "external_links": [], "published": "2015-06-26T15:20:00.000+03:00", "crawled": "2015-06-26T15:21:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}