{"organizations": ["Congress", "Trade Vote Reuters"], "uuid": "200d038251c9ce3c6301c12136d8558eda55c8f3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3063832/images/o-OBAMA-CONGRESSIONAL-BASEBALL-GAME-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/11/obama-congressional-baseball-game_n_7566366.html", "country": "", "title": "Obama Drops In On Congressional Baseball Game On Eve Of Trade Vote", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Drops In On Congressional Baseball Game On Eve Of Trade Vote", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T06:26:00.000+03:00", "replies_count": 0, "uuid": "200d038251c9ce3c6301c12136d8558eda55c8f3"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/11/obama-congressional-baseball-game_n_7566366.html", "ord_in_thread": 0, "title": "Obama Drops In On Congressional Baseball Game On Eve Of Trade Vote", "locations": ["Nationals Park", "US", "Washington", "DC"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "SAUL LOEB", "Obama"], "text": "Obama Drops In On Congressional Baseball Game On Eve Of Trade Vote Reuters Updated: 29 minutes ago US President Barack Obama greets members of the Democratic team during the annual Congressional Baseball Game between the Democrats and Republicans in Congress at Nationals Park in Washington, DC, June 11, 2015. AFP PHOTO / SAUL LOEB (Photo credit should read SAUL LOEB/AFP/Getty Images) | SAUL LOEB via Getty Images reddit \nBy Susan CornwellWASHINGTON, June 11 (Reuters) - On the eve of a vote in Congress that could determine the fate of his Pacific Rim trade pact, President Barack Obama put in a surprise appearance on Thursday night at the annual congressional ball game between Republicans and Democrats.Obama brought along beer to be awarded to the winning team and watched part of the contest on a muggy night at the ballpark that is home to Major League Baseball's Washington Nationals.The president, who has sometimes been criticized for not reaching out to members of Congress, made no formal remarks but greeted players in both the Democratic and Republican dugouts. Fans cheered his appearance.Obama may have brought some luck to fellow Democrats, who led 3-1 when he left the game and eventually won 5-2.Democrats and Republicans have played each other once a year since 1909, with the two sides winning an equal share of games going into Thursday's contest, according to the organizers' website.In an age of partisan division when many lawmakers fly home every weekend, the game is one of the few congressional traditions left from years ago when lawmakers were a more social bunch.\"Everybody's always running to an airport. There are so few opportunities where you're able to just engage your colleagues without suits on and debating,\" Democratic Representative Mike Doyle of Pennsylvania said in a C-SPAN interview before the showdown.In a city obsessed with massaging and spinning information, some tried to dampen expectations ahead of the game.\"I haven't played since grade school and I was terrible there,\" said Republican Mick Mulvaney of South Carolina, who started playing shortstop at the event two years ago. \"I haven't completely embarrassed myself yet.\"(Additional reporting by Patricia Zengerle and Jeff Mason; Writing by Kevin Drawbaugh and Peter Cooney; Editing by Eric Beech) Also on HuffPost: ", "external_links": [], "published": "2015-06-12T06:26:00.000+03:00", "crawled": "2015-06-12T06:29:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}