{"organizations": [], "uuid": "1db2ce00a25563357e8a4f302870d1935661d5c5", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/2014-05-01-gn-froman_michael-3.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/245132-pro-trade-dems-secrecy-hurting-obama", "country": "", "title": "Pro-trade Dems: Secrecy hurting Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Pro-trade Dems: Secrecy hurting Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "1db2ce00a25563357e8a4f302870d1935661d5c5"}, "author": "", "url": "http://thehill.com/policy/finance/245132-pro-trade-dems-secrecy-hurting-obama", "ord_in_thread": 0, "title": "Pro-trade Dems: Secrecy hurting Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama Greg Nash", "Obama", "Mike Lillis"], "text": "Pro-trade Dems: Secrecy hurting Obama Greg Nash By Mike Lillis - 06/16/15 01:11 PM EDT \nPro-trade Democrats are pressing the Obama administration to be more up-front about the details of an emerging Pacific Rim accord.Huddled in the Capitol with top administration officials Tuesday morning, the lawmakers — most of them members of the centrist New Democrat Coalition — argued that a lack of transparency has made it much tougher to move President Obama's ambitious trade agenda through Congress. ADVERTISEMENT The lawmakers said they told Michael Froman, the U.S. trade representative, and Jeffrey Zients, head of the National Economic Council, to release more details of the trade pact, a strategy they think will assuage many of the concerns.\"The sense today was that the administration can up the ante a bit and give the public a little bit more comfort that these issues of the environment and lawsuits and intellectual property and workers' rights are being addressed,\" Rep. Brad Ashford (D-Neb.) said as he left the meeting.\n\"In some sense, it's process, but in some sense, it's confidence by the American people … that their government is addressing these very matters. \"They realize that, and they understand that,\" Ashford said of the officials. \"[They're] asking us, 'How do we best get that message across?' \"Rep. Earl Blumenauer (Ore.), another pro-trade Democrat, echoed that message, arguing negotiators have made progress that should be trumpeted to Congress and the public alike.\"One of the things that I've been deeply concerned with is that too much of this has been cloaked in secrecy, and it doesn't need to be. There's progress, while not finalized, that could be talked about more openly,\" he said. \"There's no deal that's final until it's final. But there's been extraordinary progress, and I feel that it would be useful for that to be able to be more widely discussed publicly.\"The comments arrive as Obama and pro-trade lawmakers on Capitol Hill scramble to salvage the president's trade agenda following Friday's stunning House vote to block a critical part of the package. House GOP leaders had split the Senate-passed bill in hopes it would ease passage in the lower chamber, where lawmakers on both sides of the aisle have stood in staunch opposition to different parts of the package. Among the many criticisms, particularly among Democrats, is that the Trans-Pacific Partnership (TPP), a sweeping deal with 11 Pacific Rim countries, has been negotiated out of the public eye to the benefit of corporate interests. The split-vote strategy fell apart when Democrats, behind House Minority Leader Nancy Pelosi (Calif.), voted against the Trade Adjustment Assistance (TAA) portion, which provides help to workers who lose their jobs as a consequence of trade deals. Under the current House rule, the TAA proposal must pass to send trade-promotion authority (TPA) legislation to Obama's desk.The TPA bill, known as fast-track, is seen as necessary if Obama is to finalize the TPP.What happens next remains unclear. Obama and GOP leaders could try again to pass the TAA, although they face a steep climb considering Friday's lopsided 126-302 vote against it. \nThey could also take up the Senate-passed bill, which combines the TAA and the TPA into a one-vote package. Or they could vote on a stand-alone TPA bill and send it back to the Senate, where Majority Leader Mitch McConnell (R-Ky.) would face Democratic pressure to reattach the TAA language. Some pro-trade Democrats think taking up the Senate-passed bill presents the best chance of passing the package. \"If you look at the number of Republicans who voted for TPA and TAA, it was very high, and none of them are getting a hard time about [it],\" Rep. John Delaney (D-Md.) said following Tuesday's meeting with Froman and Zients. \"So it seems to me [that] a combined TPA/TAA ought to pass the House. \"I don't know why it was ever split to begin with,\" Delaney added. \"That's a question I think people will increasingly start asking.\" ", "external_links": [], "published": "2015-06-16T03:00:00.000+03:00", "crawled": "2015-06-17T00:07:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}