{"organizations": [], "uuid": "d3391450e9b9c05bf8410fc98840c360cfcbd3fe", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2015/06/01/chinese-immigration-to-us-surges/", "country": "IL", "title": "Chinese immigration to U.S. surges", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Chinese immigration to U.S. surges", "spam_score": 0.0, "site_type": "news", "published": "2015-06-01T18:36:00.000+03:00", "replies_count": 0, "uuid": "d3391450e9b9c05bf8410fc98840c360cfcbd3fe"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/06/01/chinese-immigration-to-us-surges/", "ord_in_thread": 0, "title": "Chinese immigration to U.S. surges", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chinese immigration to U.S. surges   EFE \nBy Jairo Mejia. \nFirst came the Europeans, the rich, the poor and the persecuted in search of a New World; later came Latin Americans, architects of a powerful demographic change in the U.S.; and now it is Asians who are leading the creation of a new immigration paradigm. \nThe year 2013 was the first time that Asians, with the Chinese in the lead, surged into first place as the largest group of immigrants in the United States, ahead of Latin Americans. \nLatinos have gone from representing 47 percent of those arrivals in 2000 to 30 percent in 2013, according to new U.S. Census figures presented this month at the annual Population Association of America conference. \nWhile fewer of America's neighbors to the south are immigrating to this country, one out of every two \"recent immigrants\" - defined as those who a year ago lived abroad, regardless of their legal status - were Asians in 2013, principally Chinese and Indians. \nThis year, immigrants from China and India topped Mexicans for the first time as the dominant groups of new immigrants. \nBut Asian immigrants enter the country differently. They don't cross land borders and risk deportation in the same way, but rather in many cases attend the most expensive universities in the country or are taken on as employees by Silicon Valley multinationals. \n\"In the last decade alone, the number of recent Chinese immigrants has nearly tripled, while Indian immigration has more than doubled,\" the Migration Policy Institute said this week in an analysis. \nThough Hispanics are the leading minority in the United States with 17 percent, the number of new immigrant arrivals from Latin America has gradually declined even as the number of incoming Asians has shot up. \nThe Hispanic demographic continues to grow in the United States, but that is no longer due to new arrivals but to second and third generations born and raised in the United States and who consider Spanish a second language. \nOnly a third of Hispanics living in the United States were born elsewhere, compared with two-thirds of Asians. \n\"There are many reasons why someone decides to emigrate (family, income, education). Our research shows a fairly consistent trend between 2000 and 2013 among Asians, though we can't be sure it will continue,\" Eric Jensen, author of the study and demographer for the U.S. Census, told Efe. \nOf the 1.2 million immigrants who came to the United States in 2013, 147,000 were Chinese, 129,000 were Indians and 125,000 were Mexicans, a statistic that includes those who came with a permanent residence permit, or Green Card, workers with non-immigrant visas, students and the undocumented. EFE", "external_links": [], "published": "2015-06-01T18:36:00.000+03:00", "crawled": "2015-06-01T19:50:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}