{"organizations": ["Colorado's Supreme Court"], "uuid": "3ebb954cf082c0e0f594972bc0fd0d877b3b24b2", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150615072026-brandon-coats-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_topstories.rss\r", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/06/16/smallbusiness/richard-branson-pitch-to-rich-finalists/index.html", "country": "US", "title": "Medical Marijuana", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Medical Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T17:50:00.000+03:00", "replies_count": 0, "uuid": "79edafc2cd64b7464108591989bda6e441fc2a5b"}, "author": "", "url": "http://money.cnn.com/2015/06/15/news/companies/dish-employee-firing-marijuana-colorado-court/", "ord_in_thread": 0, "title": "Medical Marijuana", "locations": ["Colorado"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chris Isidore"], "text": "Colorado top court says Dish worker can be fired for medical marijuana By Chris Isidore @CNNMoney Colorado governor: Pot hasn't been an economic miracle Colorado's Supreme Court ruled Monday that employers can fire workers who use marijuana for medical reasons, even though it's legal in that state. \nThe case involved Brandon Coats , a quadriplegic who was fired by Dish Network ( DISH ) in 2010 after he failed a company drug test for pot. \nCoats had a doctor's authorization to smoke medical marijuana, which has been legal in Colorado since 2000. Coats says that he never used the drug -- or was under its influence -- at work, facts that Dish Network does not dispute. \nRelated: Nine things to know about legal pot \nBut the company says it has a zero-tolerance drug policy, and notes that medical marijuana is still illegal on the federal level. Therefore, Dish says the use of the drug for any reason is cause for termination. \nThere is a Colorado law that protects employees from being discharged for \"lawful activities,\" but the court ruled the law refers only to activities which are legal under both state and federal law. \nRelated: Smoke pot legally? You can still get fired \n\"Therefore, employees who engage in an activity such as medical marijuana use that is permitted by state law but unlawful under federal law are not protected by the statute,\" said the court's decision. \nColorado has since legalized marijuana for recreational use , although that law states that businesses can still prohibit marijuana use by their employees. \nWhile the case applies only to Colorado, it could have broader legal implications for other states moving to legalize the drug for either medical or recreational use despite federal law. \nCoats and his lawyer say it is now up to the Colorado legislature to provide protections to people who use marijuana in a way that is legal under Colorado law, particularly for those who need it for medical purposes. \n\"Although I'm very disappointed today, I hope that my case has brought the issue of use of medical marijuana and employment to light,\" said Coats. \"If we're making marijuana legal for medical purposes we need to address issues that come along with it such as employment.\" CNNMoney (New York) June 15, 2015: 2:26 PM ET", "external_links": [], "published": "2015-06-16T17:50:00.000+03:00", "crawled": "2015-06-16T22:40:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}