{"organizations": [], "uuid": "ff067bebe04516a4517601875b56793b6e905592", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/marijuana_getty.jpg", "site_section": "http://thehill.com/taxonomy/term/36/feed#", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/regulation/legislation/243978-lawmakers-weed-through-marijuana-vote-a-rama", "country": "US", "title": "'Marijuana vote-a-rama' has pot advocates optimistic", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "'Marijuana vote-a-rama' has pot advocates optimistic", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T02:36:00.000+03:00", "replies_count": 0, "uuid": "ff067bebe04516a4517601875b56793b6e905592"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/legislation/243978-lawmakers-weed-through-marijuana-vote-a-rama", "ord_in_thread": 0, "title": "'Marijuana vote-a-rama' has pot advocates optimistic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Marijuana vote-a-rama' has pot advocates optimistic Getty Images By Tim Devaney - 06/03/15 07:36 PM EDT Marijuana advocates have their sights set on legalization after lawmakers approved a number of pot-friendly measures Wednesday in a government spending bill. The marijuana vote-a-rama was capped off by a provision that would prohibit the Department of Justice (DOJ) from interfering with state medical marijuana laws. But it’s a marijuana amendment that was rejected that has pot advocates even more excited. A provision that would have blocked the Justice Department from interfering with state laws permitting the use of recreational marijuana came just a few votes shy of passing. ADVERTISEMENT The measure would have essentially ended the federal prohibition on pot, advocates say. \"We’re really, really close to having the votes to end marijuana prohibition,” said Dan Riffle, director of federal policies at the Marijuana Policy Project. These marijuana provisions were included in a bill to fund the Justice Department, which the House passed late Wednesday by a vote of 242-183. The amendments that passed stipulate the Justice Department cannot use any of the money to interfere with certain state marijuana laws. Pot advocates say this is evidence of growing support among lawmakers for marijuana reform. “The politics continue to shift in favor of marijuana law reform,” said Tom Angell, chairman of the Marijuana Majority. \"For a long time, lawmakers treated marijuana as a third-rail issue that was too dangerous to touch,” he added. \"But now that polling shows a growing majority of voters supports ending prohibition, more and more elected officials are starting to realize that demonstrating leadership on this issue has political benefits instead of harms.” Congress approved the medical marijuana measure backed by a pair of California lawmakers — Reps. Dana Rohrabacher (R) and Sam Farr (D) — for the first time last year, but it garnered 23 more votes this time around and passed 242-186. These measures must be renewed each year when the DOJ’s spending bill expires. “The majority of the states have said they want medical marijuana patients to have access to the medicine they need without fear of prosecution,” Farr said. “For the second year in a row, the people’s House has listened to the will of the people and voted to give them that access.” “This vote shows the growing recognition that the only responsible course of action is for the federal government to leave state medical cannabis programs alone and let them provide their citizens with this much needed medical option,” said said Mike Liszewski, government affairs director at Americans for Safe Access. Lawmakers approved another measure from Rep. Suzanne Bonamici (D-Ore.) that would protect state hemp laws from DOJ interference by a vote of 282-146. This would pave the way for farmers to grow hemp in the United States. Several other pot amendments also snuck into the funding bill, including one that would shift millions of dollars in the Drug Enforcement Administration’s budget away from enforcing marijuana laws. But some lawmakers sought to push the boundaries even further. An amendment from Reps. Tom McClintock (R-Calif.) and Jared Polis (D-Colo.) would have blocked the DOJ from interfering with any state marijuana law, including laws that permit the recreational use of pot. The provision failed, but not before garnering 206 votes, just a handful shy of the number needed to be approved. Considering the growing support for marijuana reform, pot advocates expects the amendment to pass within the next year or two. \"Congress showed more support today than ever before, making this the latest victory in a quiet revolution underway across America to reform and modernize our marijuana laws,” said Rep. Earl Blumenauer (D-Ore.) Tags:", "external_links": [], "published": "2015-06-04T02:36:00.000+03:00", "crawled": "2015-06-04T08:47:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}