{"organizations": [], "uuid": "f0dc0164ed10cfea6836f16cd57085ce8712dcd3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/abortion/feed", "section_title": "Abortion on Huffington Post", "url": "http://www.huffingtonpost.com/julie-burkhart/access-to-contraception-a_b_7595654.html", "country": "US", "title": "Julie Burkhart: Access to Contraception and Comprehensive Sex Education Reduce Need for Abortions", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Julie Burkhart: Access to Contraception and Comprehensive Sex Education Reduce Need for Abortions", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T14:48:00.000+03:00", "replies_count": 0, "uuid": "f0dc0164ed10cfea6836f16cd57085ce8712dcd3"}, "author": "Julie Burkhart", "url": "http://www.huffingtonpost.com/julie-burkhart/access-to-contraception-a_b_7595654.html", "ord_in_thread": 0, "title": "Julie Burkhart: Access to Contraception and Comprehensive Sex Education Reduce Need for Abortions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThe Associated Press recently released survey data on abortion rates, indicating a 12 percent decline in abortions since 2010 nationally. There are a number of factors at play here -- many of which support policies and practices that educate young people and trust women to make unrestricted decisions about their own health care and lives. \nSome of the sharpest drops in abortion rates occurred in states that are supportive of women's reproductive rights, such as Washington State, New York and Oregon. These states do not restrict access to abortion, and they do prioritize improving access to health care more broadly. The Affordable Care Act has helped young and lower-income women obtain birth control with fewer hurdles and costs. It's also made it easier for women to choose the birth control that best fits their lifestyle, including IUDs and other long-term, highly effective methods. As a result, women can take control of their health care and choose whether and when to become pregnant. \nFurthermore, one of the overarching contributors to the abortion rate decline is a consistent decrease in teen pregnancies. The combination of improved access to contraception and comprehensive sex education are two crucial pieces to continuing this trend. When young people are given factual resources on sex and reducing the risk of unintended pregnancies, they are better prepared to make informed decisions. \nWhat about those states where women have seen increasing and severe restrictions to their health care access? States like Missouri, Ohio and Oklahoma (just to name a few) continue to hurl one restriction after the next at women who are seeking necessary health care. Instead of supporting women and families, these states are pushing women to travel across state lines or carry an unwanted pregnancy to term. \nThe only two states with sizable increases in abortion rates were Louisiana and Michigan - both of which have seen an uptick in women crossing the border from Texas and Ohio, respectively, to seek abortion services. As the CEO of Trust Women, a foundation that operates clinics in underserved communities, I know these women all too well. Take Cathy, for example, a woman from a small Texas town who recently came to our clinic in Wichita, Kansas. \nCathy was laid off from her job in 2011 due to the economic downturn and spent the next couple of years searching for steady work. She lost her medical benefits and her emergency unemployment support. \nWhen she learned of her unplanned pregnancy, Cathy knew it was not the right time to have a child. She went to the nearest clinic to her in Dallas, but severe weather closed the clinic. She continued on to a clinic in Oklahoma, where she was told she was 17 weeks into her pregnancy and thus unable to receive the care she needed, despite the fact that she had previously been confirmed at 11 weeks. \nWith time and money not on her side, Cathy drove to Wichita to obtain an abortion at our clinic, the South Wind Women's Center. After eight days of travel, time away from her family and unforeseen expenses, Cathy finally received the medical care she needed. \nCathy's story is one of many around the country that exemplifies why forcing women out of their own state for a safe, legal medical procedure is unethical and cruel. We must support women and families and put an end to the ever-growing list of abortion restrictions. \nWhen politicians impose barriers on women's access to abortion, they do not decrease the number of unintended pregnancies. Instead, they make women jump through hoops (or more literally cross state lines) to receive health services. Forcing women to wait days between an initial consultation and an abortion; limiting the type of medical procedure physicians can perform (even when it is the standard of care); banning insurance coverage for abortions; and requiring shaming and nonscientific literature to be shared with patients are just a few of the barriers women are up against. \nWomen deserve access to make their own medical decisions and to create the lives and the families they want. We can all agree that a declining abortion rate is a positive statistic. But more important than the number is how we get there. It is only through expanded access to contraception, comprehensive sex education and equal access to abortion services that we can celebrate these numbers nationwide. \nFollow Julie Burkhart on Twitter: www.twitter.com/JulieBurkhart More:", "external_links": [], "published": "2015-06-18T14:48:00.000+03:00", "crawled": "2015-06-18T19:44:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}