{"organizations": [], "uuid": "7c40c7ecc2f22054c610c703c26f59ecbb5a9571", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/airplane_102913thinkstock.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/244550-obama-to-seek-climate-rules-for-airplanes", "country": "US", "title": "Obama to seek climate rules for airplanes", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to seek climate rules for airplanes", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T20:05:00.000+03:00", "replies_count": 0, "uuid": "7c40c7ecc2f22054c610c703c26f59ecbb5a9571"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/244550-obama-to-seek-climate-rules-for-airplanes", "ord_in_thread": 0, "title": "Obama to seek climate rules for airplanes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to seek climate rules for airplanes By Timothy Cama - 06/10/15 01:05 PM EDT \nThe Obama administration wants to declare that greenhouse gas emissions from airplanes are harmful, which would set up regulations to limit the pollution. \nThe Environmental Protection Agency (EPA) released a proposed “endangerment finding” Wednesday, which would formally conclude that carbon dioxide and any other greenhouse gases from commercial airplanes contribute to climate change and harm the public health and welfare. ADVERTISEMENT The move is a major win for environmentalists, since aircraft are the largest source of greenhouse gases that the EPA is not either regulating or planning to regulate.\nBut the EPA’s proposed solution to the airplane climate problem — adopting upcoming international standards for aircraft — received quick condemnation from environmentalists who predict the worldwide rules will be weak. \nAnd Republicans were immediately skeptical of the Obama administration extending its climate regulations over another major sector. \nAlong with the proposed endangerment finding, the EPA set the stage Wednesday for eventually writing a formal regulation limiting airplanes’ emissions, which it said would likely align with International Commercial Aviation Organization (ICAO) rules due out in February 2016. ICAO, a United Nations agency, is the main regulatory body for international air travel. \nAirplanes in the United States emit about 11 percent of the transportation sector’s carbon, or about 29 percent of the carbon from the worldwide aviation industry. But their emissions are only 3 percent of the total greenhouse gases in the country. \nThe EPA’s action mirrors similar endangerment findings it made starting in 2009 regarding greenhouse gases from cars, trucks and power plants. \nThe early action from the EPA did not set any particular targets for reducing planes’ carbon output, nor clarify what measures could be used to cut it. \nEnvironment America applauded the move, but urged stronger standards than the international ones. \n“Since today’s announcement will likely cause a fight in Congress, we hope the president makes this a fight worth having by requiring real cuts in airplane pollution,” Anna Aurilio, director of the group’s global warming program, said in a statement. “Bold action on climate should solve the problem of pollution from airplanes, not just acknowledge it.” \nRep. Mike Pompeo (R-Kan.) blasted the EPA’s action. \n“If there is any endangerment finding that needs to be released it is on the danger the EPA poses to the American economy,” he said in a statement. “This regulation will only serve to hurt Kansas aviation workers and their families, while doing nothing to achieve any measurable reduction in carbon emissions.” Tags:", "external_links": [], "published": "2015-06-10T20:05:00.000+03:00", "crawled": "2015-06-10T21:14:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}