{"organizations": [], "uuid": "b52b94d67bdf549eac4382e9cfbacc44d85613f9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3022606/images/o-TEXAS-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/civil-rights/feed", "section_title": "Civil Rights on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/02/texas-abortion-laws-_n_7492962.html", "country": "US", "title": "In Conservative Texas Legislature, Fewer Abortion Bills Passed", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "In Conservative Texas Legislature, Fewer Abortion Bills Passed", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T13:35:00.000+03:00", "replies_count": 0, "uuid": "b52b94d67bdf549eac4382e9cfbacc44d85613f9"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/02/texas-abortion-laws-_n_7492962.html", "ord_in_thread": 0, "title": "In Conservative Texas Legislature, Fewer Abortion Bills Passed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In Conservative Texas Legislature, Fewer Abortion Bills Passed Texas Tribune | By Alexa Ura Posted: Updated: 58 minutes ago Supporters of Texas women's right to reproductive decisions rallied at the Texas State capitol on July 1, 2013 in Austin, Texas. | Erich Schlegel via Getty Images reddit Two years after passing some of the strictest abortion regulations in the country — and with a state Legislature considered even more conservative than in years past — Republican lawmakers are leaving their 2015 session having passed just one piece of legislation to further restrict the procedure. Some attributed it to a lack of interest in such a divisive social issue from top leadership in the chambers. Others think there was some fatigue on the issue after the sweeping measures that passed in 2013 — some of which are still tangled up in court. \"If we look back at the 2013 session, [abortion opponents] were so successful that there was almost no room for additional success this session,\" said Mark P. Jones, a political scientist at Rice University. \" So they were left with trying to reduce the number of abortions at the very margins, which then became far more symbolic than anything else.\" The measure that made it out of both chambers this year is House Bill 3994 , which tightens the requirements on “judicial bypass,” the legal process that allows minors to obtain court approval for an abortion if asking their parents for permission could endanger them. That measure, heralded as a huge win by abortion opponents, is headed to Gov. Greg Abbott ’s desk. But more than 20 other bills that would have further restricted the procedure in Texas failed somewhere along the legislative process. One of those measures would have prohibited abortion based on the sex of an unborn child. Another would have tightened the reporting requirements for abortion providers. Among the most controversial proposals was a bill that would have banned abortions after 20 weeks of gestation in cases of severe fetal abnormalities. When those bills went nowhere in committee, Republicans attempted to tack them onto other bills as amendments. In one case, that maneuver derailed the consideration of an otherwise innocuous bill reforming the Department of State Health Services; a heated floor fight eventually knocked the bill off of the House floor. But perhaps the most notable abortion legislation that flamed out was Senate Bill 575 , which would have prohibited coverage of the procedure on certain health insurance plans. After the bill stalled in the House State Affairs Committee, Republican state Rep. Jonathan Stickland of Bedford helped spur it forward by threatening a floor vote on the fetal abnormality abortion ban, which he had filed as an amendment to another bill. But after lawmakers moved the watered-down abortion insurance bill out of committee, it eventually died in the House against a legislative deadline. A day later, Stickland blamed House leadership for not prioritizing abortion legislation in the lower chamber. “I will tell you this: I blame leadership for the death of SB 575,” Stickland said. “It was mismanaged from the start.” He also pointed to a House version of the bill that never even got a committee hearing, and a similar abortion bill that was voted out too late in the legislative session to have a shot. Indeed, most abortion-related legislation in both the House and the Senate sat idle in committees for months — to the frustration of some conservatives. It wasn’t until late April that the Legislature picked up its pace on those bills. \nThe anti-abortion group Texas Right to Life echoed Stickland’s frustration, claiming the abortion insurance bill was “sabotaged” and that other measures didn’t move fast enough to make it onto Abbott’s desk. “Those in the Texas House who fought valiantly to stand for the lives of pre-born Texans are to be commended and share Texas Right to Life’s dismay that their pro-life values and those of their constituents were stifled by the ruling class,” Texas Right to Life spokeswoman Melissa Conway said in a statement. Though Democrats were proud that they fought off most of the abortion-related legislation — using parliamentary tricks and stall tactics at the end of the session — state Rep. Donna Howard , D-Austin, said she was displeased that any further restrictions to abortion were even considered. “I’m extremely disappointed that the issue was even addressed at all after last session,” Howard said. “It seems to clearly be more about political issues — Republican primary elections — because last session so much was done. It felt like hitting someone while they’re down to come back to it this session.” Any additional restrictions on abortion this session would have come while last session's measures are still being considered by a three-judge panel of a federal appellate court. Among those restrictions, collectively known as HB 2, is a provision that requires facilities that perform abortions to meet the same hospital-like standards of ambulatory surgical centers, like certain sizing for rooms and doorways. With its other provisions — including a requirement that doctors who perform abortions have admitting privileges at a hospital within 30 miles of an abortion clinic — HB 2 has led to the closure of dozens of clinics in the state. Critics warn it could leave Texas with fewer than 10 clinics statewide — all in major metropolitan areas — if the abortion law holds up in court. A decision could come any day, but the legal fight is likely far from over. If abortion advocates lose, they could still appeal the decision to the full appellate court or the U.S. Supreme Court. Though few abortion restrictions passed this legislative session, opponents of abortion claimed a victory in the state’s budget, which ousted Planned Parenthood from a joint state-federal cancer screening program and cut off the last bit of taxpayer money the organization received. Planned Parenthood clinics that previously received those dollars for cancer screening were already prohibited from performing abortions. Joe Pojman, executive director of the anti-abortion group Texas Alliance for Life, said it was “sensational” session for his group. He added that it was understandable that the Legislature was taking a more piecemeal approach to abortion legislation after the restrictions on abortion it enacted in 2013. “For us, that was the bill of the century,” Pojman said. “I don’t think I’ll live for another bill of that magnitude.” Disclosure: Planned Parenthood was a corporate sponsor of The Texas Tribune in 2011. A complete list of Tribune donors and sponsors can be viewed here . Also on HuffPost: Ruth Bader Ginsburg's Best Quotes of   On women serving on the Supreme Court: \"People ask me sometimes... When will there be enough women on the Court? And my answer is: When there are nine.\" On perceptions of gender balance: “So now the perception is, yes, women are here to stay. And when I’m sometimes asked when will there be enough [women on the Supreme Court]? And I say when there are nine, people are shocked. But there’d been nine men, and nobody’s ever raised a question about that.” On the Notorious RBG meme, parodying the name of rapper Notorious BIG: \"I think a law clerk told me about this Tumblr and also explained to me what Notorious RBG was a parody on. And now my grandchildren love it and I try to keep abreast of the latest that’s on the Tumblr. … [I]n fact I think I gave you a Notorious RBG [T-shirts]. I have quite a large supply.\" On Supreme Court dissents: \"Dissents speak to a future age. It's not simply to say, 'My colleagues are wrong and I would do it this way.' But the greatest dissents do become court opinions and gradually over time their views become the dominant view. So that's the dissenter's hope: that they are writing not for today but for tomorrow.\" On the gay rights movement: “In recent years, people have said, ‘This is the way I am.’ And others looked around, and we discovered it’s our next-door neighbor -- we’re very fond of them or it’s our child’s best friend, or even our child. I think that as more and more people came out [as gay] and said that ‘this is who I am,’ the rest of us recognized that they are one of us.” On social change for women: \"The women of my generation and my daughter’s generation, they were very active in moving along the social change that would result in equal citizenship stature for men and women. One thing that concerns me is that today’s young women don’t seem to care that we have a fundamental instrument of government that makes no express statement about the equal citizenship stature of men and women. They know there are no closed doors anymore, and they may take for granted the rights that they have.\" On women's liberation: \"It is not women's liberation, it is women's and men's liberation.\" On the evolution of legal opinions: \"Justices continue to think and can change. They have wives. They have daughters. By the way, I think daughters can change the perception of their fathers. I am ever hopeful that if the Court has a blind spot today, its eyes will be open tomorrow.\" Explaining why she fell asleep at the 2015 State of the Union: \"I vowed this year just sparkling water -- stay away from the wine -- but the dinner was so delicious it needed wine.\" On major portions of the Voting Rights Act being getting overturned by the Supreme Court in 2013: \"Throwing out [the Voting Rights Act] when it has worked and is continuing to work to stop discriminatory changes is like throwing away your umbrella in a rainstorm because you are not getting wet.\" On trying to have it all in life: \"Who -- man or woman -- has it all, all at once? Over my lifespan I think I have had it all. But in different periods of time, things were rough. And if you have a caring life partner, you help the other person when that person needs it.\" On women's equality: \"Women will only have true equality when men share with them the responsibility of bringing up the next generation.\" On having children: \"The decision of whether or not to bear a child is central to a woman's life, her well-being, and her dignity.\" On her dream job: \"People ask me, 'If you could be whatever you wanted to be, what would you be?' My first answer is not 'a great lawyer.' It is, 'I would be a great diva.' But I totally lacked that talent, so the next best thing is the law.\" On feminism: \"Feminism … I think the simplest explanation, and one that captures the idea, is a song that Marlo Thomas sang, 'Free to be You and Me.' Free to be, if you were a girl -- doctor, lawyer, Indian chief. Anything you want to be. And if you’re a boy, and you like teaching, you like nursing, you would like to have a doll, that’s OK too. That notion that we should each be free to develop our own talents, whatever they may be, and not be held back by artificial barriers -- manmade barriers, certainly not heaven sent.\" On marriage: \"In every good marriage, it pays sometimes to be a little deaf.\" On a 2014 Supreme Court decision ruling that businesses such as Hobby Lobby have the right to withhold birth control from their employees' health insurance: \"I should emphasize that none of us questioned the genuineness of the Hobby Lobby owners’ belief. That was a given. But no one who is in business for profit can foist his or her beliefs on a workforce that includes many people who do not share those beliefs.\" On Citizens United and campaign finance: \"If there was one decision I would overrule, it would be Citizens United. I think the notion that we have all the democracy that money can buy strays so far from what our democracy is supposed to be. So that’s number one on my list.\" On same-sex marriage: \"All of the incentives, all of the benefits that marriage affords would still be available. So you're not taking away anything from heterosexual couples. They would have the very same incentive to marry, all the benefits that come with marriage that they do now.\" On generational differences: “My mother told me two things constantly. One was to be a lady, and the other was to be independent. The study of law was unusual for women of my generation. For most girls growing up in the ’40s, the most important degree was not your B.A., but your M.R.S.” On her Supreme Court colleague and frequent ideological opponent Antonin Scalia: \"So there we are on a very elegant elephant. My feminist friends say, ‘Why are you riding on the back of the elephant? and I said, ‘Because of the distribution of weight, we needed to have Scalia in the front.’”  Share", "external_links": [], "published": "2015-06-02T13:35:00.000+03:00", "crawled": "2015-06-02T18:58:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}