{"organizations": ["Foundry United Methodist Church", "Dartmouth College", "GOP-led House Ways and Means Committee", "Wellesley College", "Judiciary Committee", "Southern New Hampshire University in Manchester", "state", "CNN", "Senate", "House", "NATO", "Osama bin Laden", "U.N.", "George Washington University", "Congress", "Victoria Mxenge Housing Project", "Unity Rally in Unity", "Senate Education and Labor Committee", "Association of Southeast Asian Nations", "ABC", "Senate Foreign Relations Committee", "White House", "Rodino Committee", "Congressional", "State Department", "CBS"], "uuid": "43e03dd457730987afb0249e58388da8305bb8de", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/14/politics/hillary-clinton-trade-tpp-pelosi-obama/index.html", "country": "", "title": "Clinton backs Pelosi over Obama on trade - CNNPolitics.com", "performance_score": 4, "site": "cnn.com", "participants_count": 0, "title_full": "Clinton backs Pelosi over Obama on trade - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "43e03dd457730987afb0249e58388da8305bb8de"}, "author": "", "url": "http://www.cnn.com/2015/06/14/politics/hillary-clinton-trade-tpp-pelosi-obama/index.html", "ord_in_thread": 0, "title": "Clinton backs Pelosi over Obama on trade - CNNPolitics.com", "locations": ["Portugal", "United States", "Rhinebeck", "Kabul", "Portsmouth", "Cape Town", "Philippi", "Wellesley", "North Korea", "Israel", "Afghanistan", "Dhaka", "Colombia", "Iowa", "Vietnam", "Hopkinton", "California", "New Hampshire", "Massachusetts", "New England", "Australia", "South Africa", "Cambridge", "Bangladesh", "Ohio", "Myanmar", "Hanoi", "Washington", "Libya", "Ben Gurion International Airport", "Roosevelt Island", "Malta", "Vermont", "Hanover", "Cairo", "New York City", "Queens", "Lisbon", "New York", "U.S.", "Mexico", "Canada", "Denver", "Cartagena", "Alaska", "Contoocook", "Japan", "Arkansas", "Los Angeles", "Manchester"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["William", "Hillary Rodham Clinton", "Barack Obama", "Monica Lewinsky", "Charles Schumer", "Robby Mook", "Lewinsky", "Bill Clinton", "Andrew Cuomo", "Dorothy Rodham", "Marc Mezvinsky", "Ashley Codianni", "Rosalynn Carter", "John Kerry", "Hillary Clinton", "Chelsea", "Pelosi", "John Doar", "Suu Kyi", "Aung San Suu Kyi", "Hamid Karzai", "Mike Gravel", "Joe Biden", "Bernie Sanders", "Don Hewitt", "Eliot Spitzer", "Hillary Rodham", "Richard Nixon", "Al Gore", "Hugh Rodham", "Felipe Bravo", "Joel Benenson", "Nancy Pelosi", "Obama", "Tipper Gore", "Stephen Collinson", "Clinton", "Bill", "Catherine", "Dennis Kucinich", "Brendan Buck", "Hillary", "Tyler", "Christian Caraballo", "Ahmet Davutoglu"], "text": "Here's why the TPP is such a big deal 03:24 PLAY VIDEO RELATED: 8 things we've learned about Hillary Clinton's campaign She cited House Minority Leader Nancy Pelosi by name twice. However, Clinton didn't weigh in at all on the bill the California Democrat maneuvered to block last week: so-called \"trade promotion authority.\" It's a measure that guarantees trade deals straight up-or-down votes without amendments -- key, negotiators say, to getting foreign leaders to take the political risks of making their best offers and signing off on a final agreement. That bill -- not the Trans-Pacific Partnership itself -- is what pitted Pelosi against Obama last week. And if the party succeeds in killing trade promotion authority, Democrats would close the door on the Pacific deal before it's even finalized. The intra-party resistance to Obama's trade efforts was laid bare on Friday when Pelosi-led congressional Democrats stunned the White House and turned against a bill they typically support, which aids displaced workers, because rejecting that bill had the procedural effect of also thwarting Republicans' push to grant Obama trade promotion authority. Clinton said that Democratic opposition should strengthen the Obama administration's hand in talks with the other countries involved in the Trans-Pacific Partnership, including Japan, Australia, Canada and Mexico. \"There are some specifics in there that could and should be changed. So I am hoping that's what happens now -- let's take the lemons and turn it into lemonade,\" Clinton said. But unless Congress grants Obama trade promotion authority, even the most optimistic free trade advocates admit, the Trans-Pacific Partnership negotiations have no path forward. Brendan Buck, spokesman for the GOP-led House Ways and Means Committee, tweeted: \"Either Clinton isn't familiar with the very basics of [trade promotion authority] debate or she is being incredibly disingenuous.\" Either Clinton isn't familiar with the very basics of TPA debate or she is being incredibly disingenuous. Or she's just trying to mess w me. — Brendan Buck (@BrendanBuck) June 14, 2015 Clinton aides on Sunday downplayed the importance of trade promotion authority, which could come up for another vote in the House this week. Chief strategist and pollster Joel Benenson said on ABC's \"This Week\" that trade promotion authority is \"Washington inside baseball about how we get there.\" Campaign manager Robby Mook told CBS's \"Face the Nation\" that debate over the bill is \"procedures and parliamentary this and that.\" RELATED: Democrats reject Obama on trade Clinton's comments on trade came at her first campaign rally in Iowa after shifting her campaign away from small roundtables and toward bigger events, starting a day earlier in New York City . Clinton has taken fire from liberal opponents like Vermont Sen. Bernie Sanders for her lack of clarity on the issue. The former first lady said any trade deal should protect U.S. jobs, increase wages and improve the nation's security. \"In order to get a deal that meets these high standards, the President should listen to and work with his allies in Congress, starting with Nancy Pelosi, who have expressed their concerns about the impact that a weak agreement would have on our workers, to make sure we get the best, strongest deal possible,\" she said. \"And if we don't get it, there should be no deal.\" She said that there are \"voices, you've heard them, that are for the deal no matter what's in it,\" and those whose opposition is unmoving. \"I kind of fall in the group that says let's find out what's in it and let's make it as good as it can be, and then let's make a decision,\" she said. In the past, Clinton has offered several more specific critiques of the deal. Hillary Clinton's career in the spotlight 50 photos Former Secretary of State Hillary Clinton, pictured here on Tuesday, March 3, has become one of the most powerful people in Washington. Here's a look at her life and career through the years. Hide Caption 1 of 50 Hillary Clinton's career in the spotlight 50 photos Before she married Bill Clinton, she was Hillary Rodham. Here, Rodham talks about student protests in 1969, which she supported in her commencement speech at Wellesley College in Wellesley, Massachusetts. Hide Caption 2 of 50 Hillary Clinton's career in the spotlight 50 photos Rodham, center, a lawyer for the Rodino Committee, and John Doar, left, chief counsel for the committee, bring impeachment charges against President Richard Nixon in the Judiciary Committee hearing room at the U.S. Capitol in 1974. Hide Caption 3 of 50 Hillary Clinton's career in the spotlight 50 photos Arkansas Gov. Bill Clinton helps first lady Rosalynn Carter on a campaign swing through Arkansas in June 1979. Also seen in the photo is Hillary Clinton, center background. Hide Caption 4 of 50 Hillary Clinton's career in the spotlight 50 photos Bill Clinton embraces his wife shortly after a stage light fell near her on January 26, 1992. They talk to Don Hewitt, producer of the CBS show \"60 Minutes.\" Hide Caption 5 of 50 Hillary Clinton's career in the spotlight 50 photos With Hillary, Democratic presidential candidate Bill Clinton waves to the crowd at his victory party after winning the Illinois primary on March 17, 1992. Hide Caption 6 of 50 Hillary Clinton's career in the spotlight 50 photos Al Gore, Tipper Gore, Bill Clinton and Hillary Clinton wave to supporters at the Chautauqua Institution in Chautauqua, New York, after they gave speeches on family values on August 23, 1992. Hide Caption 7 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton gestures at a campaign rally November 3, 1992, in Denver. After taking office, President Clinton chose his wife to head a special commission on health care reform, the most significant public policy initiative of his first year in office. Hide Caption Hillary Clinton's career in the spotlight 50 photos Bill and Hillary Clinton have a laugh together on Capitol Hill in 1993. Hide Caption 9 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton pours herself a cup of tea in 1993 while testifying to the Senate Education and Labor Committee about health care reform. Hide Caption 10 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton speaks at George Washington University on September 10, 1993, in Washington during her husband's first term. Hide Caption 11 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton waves to the media on January 26, 1996, as she arrives at federal court in Washington for an appearance before a grand jury. The first lady was subpoenaed to testify as a witness in the investigation of the Whitewater land deal in Arkansas. Hide Caption 12 of 50 Hillary Clinton's career in the spotlight 50 photos Hillary Clinton looks on as President Clinton discusses the Monica Lewinsky scandal in the Roosevelt Room of the White House on January 26, 1998. Hide Caption 13 of 50 Hillary Clinton's career in the spotlight 50 photos Hillary and Bill Clinton arrive at Foundry United Methodist Church on August 16, 1998, in Washington. He became the first sitting president to testify before a grand jury when he testified via satellite about the Lewinsky matter. Hide Caption 14 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton shakes hands during a St. Patrick's Day parade in the Sunnyside neighborhood of Queens, New York, on March 5, 2000. Hide Caption 15 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton waves to the crowd as she arrives on the stage at the Democratic National Convention on August 14, 2000, in Los Angeles. Hide Caption 16 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton campaigns for a Senate seat October 25, 2000, at Grand Central Station in New York. Hide Caption 17 of 50 Hillary Clinton's career in the spotlight 50 photos Hillary Clinton is sworn in as a senator of New York in a re-enactment ceremony with, from left, President Clinton, nephew Tyler, daughter Chelsea, brother Hugh Rodham, mother Dorothy Rodham and Vice President Al Gore on January 3, 2001, in Washington. Hide Caption 18 of 50 Hillary Clinton's career in the spotlight 50 photos Andrew Cuomo, Eliot Spitzer and Clinton celebrate with a crowd of Democratic supporters after their wins in various races November 7, 2006, in New York. Hide Caption 19 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton speaks during a post-primary rally on January 8, 2007, at Southern New Hampshire University in Manchester, New Hampshire. Hide Caption 20 of 50 Hillary Clinton's career in the spotlight 50 photos The Clintons pay a visit to the 92nd annual Hopkinton State Fair in Contoocook, New Hampshire, on September 2, 2007. Hide Caption 21 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton speaks at a campaign rally September 2, 2007, in Portsmouth, New Hampshire. She was running for the Democratic presidential nomination. Hide Caption 22 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton addresses a question during a debate with other Democratic presidential candidate at Dartmouth College in Hanover, New Hampshire, on September 26, 2007. Also pictured are U.S. Rep. Dennis Kucinich of Ohio, left, and former U.S. Sen. Mike Gravel of Alaska. Hide Caption 23 of 50 Hillary Clinton's career in the spotlight 50 photos Felipe Bravo, left, and Christian Caraballo are covered with Hillary Clinton stickers in downtown Manchester, New Hampshire, on January 8, 2008. Hide Caption 24 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton campaigns in Council Bluffs, Iowa, with her daughter, Chelsea, on January 1, 2008, two days ahead of the January 3 state caucus. Hide Caption 25 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton waves as she speaks to supporters at the National Building Museum on June 7, 2008, in Washington. After pulling out of the presidential race, Clinton thanked her supporters and urged them to back Barack Obama to be the next president of the United States. Hide Caption 26 of 50 Hillary Clinton's career in the spotlight 50 photos Obama and Clinton talk on the plane on their way to a Unity Rally in Unity, New Hampshire, on June 27, 2008. Hide Caption 27 of 50 Hillary Clinton's career in the spotlight 50 photos Obama watches Clinton address the Democratic National Convention on August 26, 2008. The two endured a long, heated contest for the 2008 nomination. Hide Caption 28 of 50 Hillary Clinton's career in the spotlight 50 photos Sen. Charles Schumer, left, looks toward Secretary of State designate Clinton as Senate Foreign Relations Committee chairman Sen. John Kerry, center, looks on during nomination hearings January 13, 2009, on Capitol Hill. Hide Caption 29 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton testifies during her confirmation hearing for secretary of state on January 13, 2009, in Washington. Hide Caption 30 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton, as secretary of state, dances with a local choir while visiting the Victoria Mxenge Housing Project in Philippi, a township on the outskirts of Cape Town, South Africa, on August 8, 2009. Hide Caption 31 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton looks through binoculars toward North Korea during a visit to an observation post July 21, 2010, at the demilitarized zone separating the two Koreas. Hide Caption 32 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton walks up the steps to her aircraft as she leaves a meeting of the Association of Southeast Asian Nations on July 23, 2010, in Hanoi, Vietnam. Hide Caption 33 of 50 Hillary Clinton's career in the spotlight 50 photos Hillary and Bill Clinton pose on the day of their daughter's wedding to Marc Mezvinsky on July 31, 2010, in Rhinebeck, New York. Hide Caption 34 of 50 Hillary Clinton's career in the spotlight 50 photos U.S. President Barack Obama and Clinton observe a moment of silence before a NATO meeting November 19, 2010, in Lisbon, Portugal. Hide Caption 35 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton listens as Turkish Foreign Minister Ahmet Davutoglu makes a brief statement November 29, 2010, before a bilateral meeting at the State Department in Washington. Hide Caption 36 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton shakes hands with a child during an unannounced walk through Tahrir Square in Cairo on March 16, 2011. Hide Caption 37 of 50 Hillary Clinton's career in the spotlight 50 photos Obama, Vice President Joe Biden, Clinton and members of Obama's national security team receive an update on the Osama bin Laden mission May 1, 2011, in the Situation Room of the White House. Hide Caption Hillary Clinton's career in the spotlight 50 photos Clinton checks her personal digital assistant prior to departing Malta on October 18, 2011. Hide Caption Hillary Clinton's career in the spotlight 50 photos Clinton dances while in Cartagena, Colombia, on April 15, 2012. Hide Caption Hillary Clinton's career in the spotlight 50 photos Clinton enjoys a beer at Cafe Havana in Cartagena, Colombia, on April 15, 2012. Hide Caption 41 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton appears with little makeup during an event in Dhaka, Bangladesh, on May 6, 2012. She tells CNN, \"I feel so relieved to be at the stage I'm at in my life right now ... Because you know if I want to wear my glasses, I'm wearing my glasses. If I want to wear my hair back I'm pulling my hair back. You know at some point it's just not something that deserves a lot of time and attention.\" Hide Caption 42 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton speaks as Afghanistan President Hamid Karzai listens during a news conference at the presidential palace in Kabul, Afghanistan, on July 7, 2012. Hide Caption Hillary Clinton's career in the spotlight 50 photos Clinton arrives at Ben Gurion International Airport in Israel on July 15, 2012. Hide Caption 44 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton looks on as Obama makes a statement in response to the attack at the U.S. Consulate in Libya on September 12, 2012. Hide Caption 45 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton applauds Myanmar opposition leader Aung San Suu Kyi during a ceremony where Suu Kyi was presented with the Congressional Gold Medal on September 19, 2012. Hide Caption 46 of 50 Hillary Clinton's career in the spotlight 50 photos Bill Clinton kisses his wife after introducing her at the Clinton Global Initiative annual meeting on September 24, 2012, in New York City. Hide Caption 47 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton shakes hands with Catherine, the Duchess of Cambridge, while attending a reception with Prince William, second from right, in New York in December. Hide Caption 48 of 50 Hillary Clinton's career in the spotlight 50 photos Clinton speaks to reporters at U.N. headquarters on Tuesday, March 10, addressing her use of private email for official work as secretary of state. She said she used a private domain out of \"convenience\" but admitted in retrospect \"it would have been better\" to use multiple emails. Hide Caption 49 of 50 Hillary Clinton's career in the spotlight 50 photos Democratic presidential candidate, former Secretary of State Hillary Rodham Clinton gestures before speaking to supporters Saturday, June 13 on Roosevelt Island in New York, in a speech promoted as her formal presidential campaign debut. Hide Caption 50 of 50 She's said it should include a crackdown on countries that devalue their own currencies to give their exports a price advantage -- which the Obama administration says won't be included in the Trans-Pacific Partnership. And she has criticized a chapter that allows companies to ask an international arbiter to rule on whether countries' laws and regulations violate those countries' obligations under the trade deal. \"I am willing to try now to see whether you can push to get rid of the objectionable parts, to drive a harder bargain on some of the other parts and to provide transparency so the American people can see what would be in a proposed final deal,\" Clinton said Sunday. \"If I were in the White House, that's what I would be doing right now,\" she said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Politics Originals Story by Stephen Collinson and video by Ashley Codianni It wouldn't be the first time a revolution sparked in New England changed the world. ", "external_links": [], "published": "2015-06-14T03:00:00.000+03:00", "crawled": "2015-06-15T00:04:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}