{"organizations": [], "uuid": "0c5509f9ff80180468b53d0881978bfe6dac5312", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3045462/images/o-OBAMA-BIDEN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/06/08/obama-biden-luto-vinculo-personal_n_7534704.html", "country": "", "title": "Entre el luto, Obama y Biden muestran su vínculo personal", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Entre el luto, Obama y Biden muestran su vínculo personal", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T20:09:00.000+03:00", "replies_count": 0, "uuid": "0c5509f9ff80180468b53d0881978bfe6dac5312"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/06/08/obama-biden-luto-vinculo-personal_n_7534704.html", "ord_in_thread": 0, "title": "Entre el luto, Obama y Biden muestran su vínculo personal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Entre el luto, Obama y Biden muestran su vínculo personal | Por Julie Pace reddit \nWASHINGTON (AP) — Pocas relaciones en Washington son tan complejas como la de un presidente y el vicepresidente, una sociedad forjada a partir de las necesidades políticas y a menudo definida por una rivalidad e intereses propios compitiendo. \nEl presidente Barack Obama y el vicepresidente Joe Biden han tenido momentos complicados desde que tomaron el poder hace más de seis años. Pero la muerte reciente del hijo de Biden, Beau, ha magnificado ese llamativo vínculo personal entre Obama y Joe Biden, dos hombres de diferentes generaciones y entornos. \n\"Joe, eres mi hermano\", dijo Obama en un discurso sumamente personal en el funeral de Beau Biden el sábado en Delaware. \"Cada día agradezco que tengas tan buen corazón y alma, y esa enorme entereza\". \nLa voz de Obama se desquebrajaba en medio de sus palabras, un inusual despliegue de emociones para un presidente que con frecuencia muestra aplomo. Biden, por otro lado, despliega todo tipo de emociones incluso en el más banal de los eventos de la Casa Blanca. Close Obama en el funeral del hijo de Biden de ✖ cerrar Esta imagen \nObama de 53 años, y su vicepresidente de 72 coincidieron durante algunos años en el Senado, pero no eran precisamente cercanos. Luego de obtener la nominación presidencial de partido demócrata en 2008, Obama eligió a Biden como su compañero de fórmula debido, en parte, a que esperaba que los 36 años del senador de Delaware en Washington compensaran su propia inexperiencia. \nUna vez en el poder, Obama mostró su confianza en Biden, colocándolo a cargo de asuntos importantes, incluyendo la política en Irak y los estímulos económicos. Biden también llegó a convertirse en la persona responsable de temas como Ucrania y el control de armas. \nEn los últimos días de 2012, cuando la Casa Blanca y el Congreso se enfilaban rumbo a la fecha límite en las negociaciones sobre un incremento fiscal, fue Biden quien utilizó sus relaciones en el Capitolio para evitar una crisis, llenando el vacío de un presidente que ha batallado con el toque personal que parece tan sencillo en el vicepresidente. \nPero el liberal estilo de Biden también le ha provocado dolores de cabeza a la Casa Blanca, el más notorio cuando convenció al presidente sobre la postura con respecto al matrimonio gay adoptada meses antes de las elecciones de 2012. Biden dijo en una entrevista televisiva que estaba \"absolutamente cómodo\" con las parejas homosexuales. Esas declaraciones se dieron en un momento en el que Obama había admitido que seguía \"evolucionando\" con ese tema. \n\"Creo que (Obama) entendió antes que mucha gente que el valor de tener a Joe Biden en tu equipo opaca cualquier debate menor si él llega a decir algo que no es del todo político\", dijo Jay Carney, quien trabajó tanto para Obama como para Biden en la Casa Blanca, antes de dejar el cargo el año pasado. \n___ \nJulie Pace está en Twitter como: http://twitter.com/jpaceDC También en HuffPost Voces ", "external_links": [], "published": "2015-06-08T20:09:00.000+03:00", "crawled": "2015-06-08T22:27:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}