{"organizations": ["Arizona", "Fox News Latino Critics"], "uuid": "10f3623da4dbafc217fb78803f25bf197522153d", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Arpaio%20Facts.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/06/critics-say-that-arizona-immigration-law-aimed-to-protect-arpaio-patrols/", "country": "", "title": "Critics say that Arizona's immigration law aimed to protect Arpaio's patrols | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Critics say that Arizona's immigration law aimed to protect Arpaio's patrols | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-06T22:39:00.000+03:00", "replies_count": 0, "uuid": "10f3623da4dbafc217fb78803f25bf197522153d"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/06/critics-say-that-arizona-immigration-law-aimed-to-protect-arpaio-patrols/", "ord_in_thread": 0, "title": "Critics say that Arizona's immigration law aimed to protect Arpaio's patrols | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Arpaio", "D. Franklin", "Arpaio"], "text": "Critics say that Arizona's immigration law aimed to protect Arpaio's patrols Published June 06, 2015 Fox News Latino Maricopa County Sheriff Joe Arpaio. (AP Photo/Ross D. Franklin) \nNewly released emails reveal conversations between the main players who wrote Arizona's landmark law cracking down on immigration, including discussions about doing the bidding of Sheriff Joe Arpaio and language that critics say played on immigration stereotypes. \nThe emails emerged in a court case in which civil rights groups are seeking to have the remaining parts of the law thrown out on the grounds that it is discriminatory. \nThey alleged the law known as SB1070 was motivated by a desire to discriminate against Latinos and Mexicans. \nLawyers challenging the law say it was aimed at protecting the contentious immigration crackdowns carried out by Arpaio. They cite emails involving the architect of the bill, Kris Kobach, then an adviser to the sheriff, and the bill's legislative sponsor, then-Sen. Russell Pearce. \nAn email unearthed in the challenge shows Kobach told Pearce in November 2009 that he was working to help defend Arpaio's office against the American Civil Liberties Union and the U.S. Justice Department. \"To that end, there is one more sentence that needs to be added to the bill,\" Kobach wrote. \nKobach then advocated for a provision that would let police arrest people without warrants in cases where the arrested person has committed an offense that makes them eligible to be deported from the United States. \nThe attorneys challenging the law also said Kobach repeatedly suggested a provision that would let police officers legally stop drivers if they have reasonable suspicion to believe the drivers are in violation of civil traffic laws. \nMessages left for Kobach, Pearce and Arpaio's office weren't immediately returned Friday. \n\"I think the legislators who were behind SB1070 wanted to use Arpaio's model around the state and mandate it around the state,\" said Cecillia Wang, an American Civil Liberties Union lawyer who is among the attorneys pushing the challenge. \nCoalition lawyers also cited an April 2010 email from Kobach to Pearce that they said played on stereotypes of immigrants. Kobach is currently the secretary of state in Kansas. \nThe email in question shows Pearce and Kobach were talking about including provisions in the 2010 law that would have made it a misdemeanor to have an overcrowded vehicle and let police start inquiries of people who had cars on blocks in their yards or had too many people into a rental home. Neither provision was enacted into law. \nArpaio is known for his immigration crackdowns but walked away from the last vestiges of his immigration enforcement late last year as his actions have been repeatedly repudiated by the courts. \nIn 2010, Kobach served as an immigration-enforcement training adviser to Arpaio's office and helped Pearce write the 2010 law. \nThe courts have upheld SB1070's contentious requirement that police, while enforcing other laws, must question people's immigration status if they are suspected of being in the country illegally. But much of the law has been gutted by the courts, including a requirement that immigrants carry registration papers and a ban on immigrants soliciting work in a public place. \nLike us on Facebook ", "external_links": [], "published": "2015-06-06T22:39:00.000+03:00", "crawled": "2015-06-06T22:40:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}