{"organizations": [], "uuid": "464d4855270e796a02d868fbb02ef3a2064310aa", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/060715_FF_Corke_640.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/07/at-g7-summit-obama-finds-support-unity-for-trade-deals-russian-sanctions/", "country": "US", "title": "At G7 summit, Obama finds support, unity for trade deals, Russian sanctions", "performance_score": 6, "site": "foxnews.com", "participants_count": 1, "title_full": "At G7 summit, Obama finds support, unity for trade deals, Russian sanctions | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "464d4855270e796a02d868fbb02ef3a2064310aa"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/07/at-g7-summit-obama-finds-support-unity-for-trade-deals-russian-sanctions/", "ord_in_thread": 0, "title": "At G7 summit, Obama finds support, unity for trade deals, Russian sanctions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama on Sunday talked in person with European allies on such key issues as the pending U.S. trade deal, the growing Islamic State threat and Russian aggression, with the White House suggesting that forcing Russia to leave Ukraine’s Crimea peninsula in not a diplomatic objective.\nPress Secretary Josh Earnest said Obama and German Chancellor Angela Merkel devoted much of their meeting at the Group of Seven summit in Elmau, Germany, talking about the need for the allies to “show unity in confronting Russia over actions in Ukraine.”\nEarnest said whether to keep or impose additional economic sanctions against Russia will depend on whether the country decides to keep its end of the so-called Minsk agreement, updated after Moscow annexed Crimea last year, not whether it returns the peninsula.\n“Russia has essentially thumbed their nose at commitments made at (the) agreement,” Earnest said after the start of the two-day summit.\nHe also said that the Obama administration has already made clear the sanctions imposed were “in the context of the Minsk negotiations.”\nAt most, leaders hope to emerge from the talks with an agreement to keep U.S. and European Union sanctions against Russia in place and perhaps a pledge to enact deeper economic penalties if the crisis escalates.\nThe world leaders also spent more than an hour Sunday privately discussing trade issues, as Capitol Hill lawmakers debate whether to give Obama the authority to move trade agreements through Congress more quickly.\nObama and his advisers voiced confidence about the trade-authority deal to Merkel, British Prime Minister David Cameron and the other world economic leaders, at Schloss Elmau, a one-time German artist retreat turned luxury spa.\nBut their efforts face a deeply uncertain future.\nThe president's own Democratic Party is largely opposed to legislation that allows Congress to reject or approve, but not change, trade deals negotiated by the administration. In an unusual political role reversal, the president's reservoir of support has come from his Republican opponents.\nIf Obama succeeds, it would boost the prospects for Congress eventually ratifying the Trans-Pacific Partnership pact, a 12-nation consortium that includes G-7 partners Japan and Canada. The other G-7 nations -- Britain, France, Germany, and Italy -- have a stake in a U.S.-European Union trade deal that is on a slower course.\nEarnest told reporters on Sunday that he had yet to receive a summary of the talks but that several key topics on the issue were being discussed.  \nWhile the Senate already has sided with Obama, the House is another matter. Just 18 Democrats have expressed support publicly, and that is short of what the White House is believed to need to supplement affirmative GOP votes.\nFour of those lawmakers traveled with Obama to Germany: Democratic Reps. Gerry Connolly of Virginia, Jim Himes of Connecticut, Eddie Bernice Johnson of Texas and Mike Quigley of Illinois.\nDemocrats are under intense pressure from labor unions, liberal organizations and others opposed to the Asia-Pacific pact because they believe it would hurt U.S. workers and weaken environmental standards. Anti-free trade demonstrators were among the groups protesting near the summit site.\nNegotiations over the Asia-Pacific pact are nearing a conclusion, but the U.S.-European Union talks have proceeded more slowly and could well slip beyond Obama's presidency. The presidential trade authority, if approved, probably still would apply, given that it would have a six-year lifespan.\nBritish officials said Cameron was pushing G-7 leaders to reach a deal by year's end. Merkel, in an interview with German television, said she wanted to work on the agreement \"at top speed.\"\nThe summit marks the second year in a row that leaders from the United States, Canada, Britain, France, Germany, Italy and Japan assembled without Putin.\nAfter Russia annexed Crimea, the world powers kicked Russia out of what had been called the Group of Eight, a move aimed at isolating Putin and signaling the West's united opposition to his provocative actions.\nYet Putin remains a major player on pressing issues.\nRussia is a partner of the U.S. and other nations in the nuclear talks with Iran, an Obama priority.\nAnd Putin is a linchpin in any discussions on resolving the civil war in Syria, given Russia's status as President Bashar Assad's biggest benefactor.\nEarnest said Sunday that the participation of Iraqi Prime Minister Haider Al Abadi is the fight against the Islamic State is key and will allow the G7 group to reiterate its support for the coalition fighting the terror group.\nHe also said each nation an economic and national security interest in stopping the extremist group’s foray into Iraq and Syria.\nThe Associated Press contributed to this report. \n    3 Kansas   4   5 Lindsey Graham wants Caitlyn Jenner's vote  ", "external_links": [], "published": "2015-06-07T03:00:00.000+03:00", "crawled": "2015-06-08T00:02:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}