{"organizations": [], "uuid": "782d46f44e8b3630fb8245877bdd65dafc2d3868", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3072942/images/o-IMMIGRATION-DEFERRED-TEXAS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/index.xml", "section_title": "Business - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/15/texas-immigration-report_n_7584212.html?utm_hp_ref=business&ir=Business", "country": "US", "title": "Report Finds Texas Could Gain Big From Immigration Changes", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Report Finds Texas Could Gain Big From Immigration Changes", "spam_score": 0.0, "site_type": "news", "published": "2015-06-15T15:30:00.000+03:00", "replies_count": 0, "uuid": "782d46f44e8b3630fb8245877bdd65dafc2d3868"}, "author": "Roque Planas", "url": "http://www.huffingtonpost.com/2015/06/15/texas-immigration-report_n_7584212.html?utm_hp_ref=business&ir=Business", "ord_in_thread": 0, "title": "Report Finds Texas Could Gain Big From Immigration Changes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report Finds Texas Could Gain Big From Immigration Changes Posted: Updated: 17 minutes ago Immigrants prepare to fill out forms for Deferred Action for Childhood Arrivals (DACA), at a workshop on Feb. 18, 2015, in New York City. | John Moore via Getty Images reddit \nThe states that are suing the Obama administration to block the implementation of ambitious plans to shield millions of undocumented immigrants from deportation stand to gain economically if the plans move forward , according to an analysis published Monday by the Center for American Progress. \nThe administration has twice implemented major \"deferred action\" programs, which exempt qualified undocumented immigrants from deportation for a defined, renewable period -- usually two to three years. Those who qualify also receive work authorization. Monday marks the third anniversary of the first of those programs, Deferred Action for Childhood Arrivals, or DACA, which applies to immigrants who arrived illegally as minors. \nWhile DACA has been implemented, a second, farther-reaching program announced in November called Deferred Action for Parents of Americans was enjoined following a lawsuit. Courts are now assessing the president's constitutional authority to create the program without Congress. An injunction also halted an expansion of DACA, announced in November. That expansion would provide deportation relief to as many as an estimated 4.4 million people . \nTexas, which is leading a coalition of 26 states to block the implementation of DAPA and the expansion of DACA, would see the second-largest economic growth if the programs were implemented, according to the report. With 746,000 people potentially eligible for the programs, the progressive group estimated that Texas' state GDP could grow by $38.3 billion over a decade. The analysis also found that Texas would gain 4,800 jobs per year if all the deferred action programs were implemented. \nCourtesy of the Center for American Progress. \nThose figures are higher than any state except California, which did not join the lawsuit. California, where the country's largest undocumented population resides, would see a $75.8 billion bump to its GDP over the next decade if the changes were allowed to move forward, the report says. It would also see 9,500 new jobs created annually. \n“It’s very straightforward,” Silva Mathema, a policy analyst at the Center for American Progress, told The Huffington Post. “Temporary work permits mean that wages for undocumented immigrants will go up -- our estimate is by about 8.5 percent on average. ... Having more wages means they’ll have more income to spend on basically everything, from cars to clothes to everything else, because they are consumers as well. It will create jobs for everyone in the state.” \nThe data breakdown found gains for all 37 states measured, along with the District of Columbia. The Center for American Progress estimates that unimpeded deferred action would boost the GDP of the country as a whole by $230 billion over the next 10 years, as wages for undocumented immigrants rise. \n“Deferred action produces much-needed economic benefits for our states,” Mathema added. “People will be allowed to contribute even more than they do right now.” \nThe lawsuit against DAPA and the expansion of DACA argues that President Barack Obama overstepped his constitutional authority by using executive action to move the plan forward in the face of congressional inaction. \nMany legal scholars, however, view deferred action as a solidly accepted concept, and expect courts to ultimately allow the expansion . More:", "external_links": [], "published": "2015-06-15T15:30:00.000+03:00", "crawled": "2015-06-15T15:50:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}