{"organizations": ["NSA", "EPA", "FBI", "Senate", "Justice Department", "TSA", "GOP", "Kentucky", "Justice", "5th Circuit Court of Appeals", "Clinton Foundation", "Supreme Court"], "uuid": "1655fcc61cafe0bd3f8d25ad05f8757d8de00806", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/marijuanafarm06042015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/regulation/court-battles/244024-marijuana-farmer-facing-life-in-prison-for-murdering-immigrant", "country": "", "title": "Marijuana farmer gets life sentence for murdering illegal immigrant | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Marijuana farmer gets life sentence for murdering illegal immigrant | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "1655fcc61cafe0bd3f8d25ad05f8757d8de00806"}, "author": "", "url": "http://thehill.com/regulation/court-battles/244024-marijuana-farmer-facing-life-in-prison-for-murdering-immigrant", "ord_in_thread": 0, "title": "Marijuana farmer gets life sentence for murdering illegal immigrant | TheHill", "locations": ["The Hill", "Yorkville", "Kneeland", "Calif", "New Orleans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul", "Martin O’Malley", "Mario Roberto Juarez-Madrid", "Bush", "Wilde", "Walker", "Obama", "Pedro Fernando Lopez-Paz", "Sanders", "Hillary Clinton", "Blumenthal", "Dennis Hastert", "Hastert", "Tim Devaney", "Juan Williams", "Graham", "Cruz", "Mikal Wilde", "Sidney Blumenthal", "McCain"], "text": "Marijuana farmer gets life sentence for murdering illegal immigrant Getty Images By Tim Devaney - 06/04/15 11:37 AM EDT A marijuana farmer will spend the rest of his life in prison after murdering one of his immigrant workers and shooting another so he wouldn’t have to pay them. Mikal Wilde, 33, was sentenced Thursday after he was convicted earlier this year for murder and drug trafficking. Federal prosecutors accused Wilde of a “belief that [the immigrant workers] were expendable, not in a position to complain.” “The defendant preyed on their status and viewed them as free labor that could not stand up to him,” prosecutors charged. In summer 2010, Wilde opened a marijuana farm that spanned 800 acres and included 1,500 plants in Kneeland, Calif. He hired three immigrants to cultivate the pot. His rampage began after three of his immigrant workers tried to quit and sought payment for the work they had done. Rather than pay them, the marijuana farmer hunted down one of the workers, Mario Roberto Juarez-Madrid, and shot him three times, including once in the back of the head. The marijuana farmer also shot another immigrant worker, Pedro Fernando Lopez-Paz, in the face, but he survived. The third worker escaped unscathed. Past: 1 day Paul joins crusade to expose... The Bush administration blacked out 28 pages extracted from a... GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat. ", "external_links": [], "published": "2015-06-04T03:00:00.000+03:00", "crawled": "2015-06-05T03:32:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}