{"organizations": [], "uuid": "2749326f7f8d12a2fb2f2676478ca7efc236c2e5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3090486/images/o-MARCO-RUBIO-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/immigration-reform/feed", "section_title": "Immigration Reform on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/18/marco-rubio-immigration-protesters_n_7614344.html", "country": "US", "title": "Marco Rubio Heckled By Immigration Protesters", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Marco Rubio Heckled By Immigration Protesters", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T16:51:00.000+03:00", "replies_count": 0, "uuid": "2749326f7f8d12a2fb2f2676478ca7efc236c2e5"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/18/marco-rubio-immigration-protesters_n_7614344.html", "ord_in_thread": 0, "title": "Marco Rubio Heckled By Immigration Protesters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marco Rubio Heckled By Immigration Protesters Posted: Updated: 3 hours ago WASHINGTON, DC - MAY 20: Republican presidential candidate Sen. Marco Rubio (R-FL) questions Assistant U.S. Secretary of State for Western Hemisphere Affairs Roberta Jacobson as she testifies before the Senate Foreign Relations Committee May 20, 2015 in Washington, DC. The committee heard testimony on the topic of 'U.S. Cuban Relations - The Way Forward.' (Photo by Win McNamee/Getty Images) | Win McNamee via Getty Images reddit \nWASHINGTON -- Immigration activists interrupted Sen. Marco Rubio's (R-Fla.) speech at an annual conference of conservatives in the nation's capital on Thursday, demanding that he shield federal programs that would protect undocumented immigrations from deportation. \n\"Implement DAPA! Protect DACA!\" two activists repeatedly shouted at the Faith & Freedom conference, referring to Deferred Action for Parents of Americans and Deferred Action for Childhood Arrivals, Obama administration programs that would offer deportation relief to certain young undocumented immigrants and their parents. Both programs have been challenged in court and are currently on hold. \nThe junior senator from Florida, who is running for president, responded to the protesters by acknowledging their right to stand up and be heard. \n\"If you do that in another country, you'd be in jail tonight,\" Rubio said to applause. \"They have a right to be rude and they have a right to be wrong. We live in a free society.\" \nEvent organizers escorted the activists out of the room shortly after, but they could still be heard shouting outside the room as Rubio continued his speech. \nThe senator has a tenuous history with immigration reform. Earlier this year, as he was weighing a run for the White House, Rubio told a crowd of conservatives that he made a mistake in supporting a bipartisan Senate bill that included a pathway to citizenship for undocumented immigrants. He now maintains that the U.S. must first bolster security on its southern border before addressing comprehensive immigration reform, a position more in line with the conservative wing of his party. \nRubio isn't the only presidential contender to draw heat over his position on immigration. Activists interrupted former Florida Gov. Jeb Bush (R) as he announced his campaign for president earlier this week in a speech at Miami-Dade College. Unlike Rubio, however, Bush favors granting undocumented immigrants \"legal status\" -- a more moderate position, but one immigration activists say still does not go far enough. Also on HuffPost:   Florida Senator Marco Rubio addresses the Republican National Convention in Tampa, Fla., on Thursday, Aug. 30, 2012. (AP Photo/J. Scott Applewhite) Sen. Marco Rubio, R-Fla., is surrounded by reporters during a tour of the convention floor at the Republican National Convention in Tampa, Fla., on Wednesday, Aug. 29, 2012. (AP Photo/J. Scott Applewhite) IN FLIGHT, FL - AUGUST 13: U.S. Sen. Marco Rubio (R-FL) pretends to throw an orange as Republican presidential candidate and former Massachusetts Governor Mitt Romney looks on aboard his campaign plane on August 13, 2012 en route to Miami, Florida. Mitt Romney continues his multi state bus tour after announcing Rep. Paul Ryan (R-WI) as his running mate. (Photo by Justin Sullivan/Getty Images) WASHINGTON, DC - JULY 24: (L-R) U.S. Senator Marco Rubio (R-FL), UNAIDS Executive Director Michel Sidibe, and Sir Elton John meet after The Elton John AIDS Foundation and UNAIDS breakfast at the Russell Senate Office Building on July 24, 2012 in Washington, DC. (Photo by Michael Kovac/Getty Images for The Elton John AIDS Foundation) Sen. Marco Rubio, R-Fla., signs a Romney sign for a supporter at a rally for presidential candidate Mitt Romney at C.C. Ronnow Elementary School in Las Vegas Saturday, July 28, 2012. (AP Photo/Las Vegas Review-Journal, John Locher) LOCAL TV OUT; LOCAL INTERNET OUT; LAS VEGAS SUN OUT Former Sen. Mel Martinez, left, R-Fla., greets Sen. Marco Rubio, R-Fla., after he introduced him at the NALEO (National Association of Latino Elected and Appointed Officials) conference, Friday, June 22, 2012, in Lake Buena Vista, Fla. (AP Photo/John Raoux) Rep. Barbara Lee, D-Calif., accompanied by Sen. Marco Rubio, R-Fla., speaks during a session entitled: 'The U.S. Congress and the Global AIDS Epidemic\" Wednesday, July 25, 2012, at the XIX International AIDS Conference in Washington. (AP Photo/Carolyn Kaster) US Senator Marco Rubio, R-FL, speaks at the Council on Foreign Relations May 31, 2012 in New York. AFP PHOTO/Stan HONDA (Photo credit should read STAN HONDA/AFP/GettyImages) WASHINGTON, DC - MAY 23: Sen. Marco Rubio (R-FL) speaks to the Latino Coalition's annual economic summitt on May 23, 2012 in Washington, DC. Rubio spoke after Republican presidential candidate Mitt Romney addressed the same group. (Photo by Win McNamee/Getty Images) WASHINGTON, DC - MAY 22: Sen. Marco Rubio (R-FL) (C) speaks during news conference with America Online co-founder and member of the President's Council on Jobs & Competitiveness Steve Case (L) and Sen. Jerry Moran (R-KS) at the U.S. Capitol May 22, 2012 in Washington, DC. Cas and the senators held a press conference to unveil the bipartisan Startup Act 2.0. (Photo by Chip Somodevilla/Getty Images) WASHINGTON - APRIL 25: Brookings guest scholar Marvin Kalb (L) questions Sen. Marco Rubio (R-FL) after an address on American foreign policy at the Brookings Institution on April 25, 2012 in Washington, DC. Rubio is widely considered to be a possible running mate for Republican presidential candidate Mitt Romney. (Photo by Brendan Hoffman/Getty Images) ASTON, PA - APRIL 23: Republican presidential candidate and former Massachusetts Gov. Mitt Romney (R) arrives before a town hall during a campaign stop with Florida Sen. Marco Rubio (L) at Mustang Expediting April 23, 2012 in Aston, Pennsylvania. Romney continues his campaign as the presumptive GOP candidate the day before the Pennsylvania primary. (Photo by Jessica Kourkounis/Getty Images) MIAMI, FL - APRIL 09: Caterina De Quesada and other supporters of Trayvon Martin gather for a rally in front of Florida Senator Marco Rubio's (R-FL) office to ask him to retract his support for Florida's so called 'Stand Your Ground' gun law following the Trayvon Martin killing on April 9, 2012 in Miami, Florida. Martin was killed by George Michael Zimmerman on February 26th while Zimmerman was on neighborhood watch patrol in the gated community of The Retreat at Twin Lakes, Florida. (Photo by Joe Raedle/Getty Images) Felipe Matos(C), a college student from Miami, Florida along with other protesters denounces Republican Senator Marco Rubio, a possible vice presidential candidate running with Mitt Romney, outside the US Capitol building in Washington, DC on March 1, 2012, for Rubio's policies that they say are too tough on immigrants. As Republican presidential frontrunner Mitt Romney secured his lead this week with primary wins in Michigan and Arizona, Rubio is emerging as his most likely vice presidential candidate. Rubio, (R-FL) supports laws that would crack down on illegal immigration. AFP PHOTO/TOM RAMSTACK (Photo credit should read Tom Ramstack/AFP/Getty Images) WASHINGTON, DC - MARCH 27: Sen. Marco Rubio (R-FL) (L) and Florida Attorney General Pam Bondi participate in a news conference about the Supreme Court's second day of hearings on the constitutionality of the Patient Protection and Affordable Care Act March 27, 2012 in Washington, DC. Bondi and 25 other attorneys general brought the case before the Supreme Court. Both Republicans and Democrats paid close attention to the questions and statements by Justice Anthony Kennedy during the court proceedings. (Photo by Chip Somodevilla/Getty Images) WASHINGTON, DC - FEBRUARY 28: Senate Foreign Relations Committee members Sen. Marco Rubio (R-FL) and Sen. James Risch (R-ID) talk while U.S. Secretary of State Hillary Clinton testifies before the committee about the department's FY2013 international affairs budget February 28, 2012 in Washington, DC. Clinton faced questions ranging from the cost of embassies in Iraq and the Middle East to the START Treaty with Russia. (Photo by Chip Somodevilla/Getty Images) WASHINGTON, DC - FEBRUARY 09: Sen. Marco Rubio (R-FL) delivers a speech titled, 'Is America Still an Exceptional Nation?' during the annual Conservative Political Action Conference (CPAC) February 9, 2012 in Washington, DC. Thousands of conservative activists are expected to attend the annual gathering in the nation's capital. (Photo by Win McNamee/Getty Images) Sen. Marco Rubio, R-Fla. is greeted at the Latino Coalition annual economic summit, Wednesday, May 23, 2012, at the U.S. Chamber of Commerce in Washington. (AP Photo/Evan Vucci) FILE - In this Republican U.S. Senate candidate Marco Rubio, left, talks to reporters as David Rivera, Republican candidate for Congress, right, looks on in Miami. Rubio's relationship with fellow freshman lawmaker Rivera, now facing a federal probe into tax evasion, and a credit card controversy surfaced during his 2010 Senate campaign and didn't have much effect. But that doesn't mean the country as a whole would overlook such eyebrow-raising issues, if Rubio were to show interest in the No. 2 slot on the presidential ticket this year. (AP Photo/Alan Diaz, File) WASHINGTON - JANUARY 5: Senator Marco Rubio (R-FL) waits with his mother-in-law Maria Elena Fleites (L), son Anthony (2L), daughter Amanda (2R) and son Domonick (R) for the Senate Subway after a ceremonial swearing-in in the Old Senate Chamber of Capitol Hill January 5, 2011 in Washington, DC. Returning Senators and freshman were sworn in today as the 112th Congress began its session after the 2010 midterm elections. (Photo by Brendan Smialowski/Getty Images) WASHINGTON - MAY 11: U.S. U.S. Sen. Marco Rubio (R-FL) (L) listens to Sen. John McCain (R-AZ) (R) speak during a news conference about the crisis in Syria May 11, 2011 on Capitol Hill in Washington, DC. Lieberman and Rubio will introduce a resolution to calling on the U.S. government to have a tougher stance in the crisis in Syria. (Photo by Alex Wong/Getty Images) WASHINGTON, DC - MAY 10: Sen. Marco Rubio (R-FL) (2nd L) answers reporters' questions during a news conference to introduce a balanced budget proposal with (L-R) Sen. Mike Lee (R-UT), Sen. Jim DeMint (R_SC), Sen. Ron Johnson (R-WI), and nd Sen. Pat Toomey (R-PA) at the U.S. Capitol May 10, 2011 in Washington, DC. Toomey said the proposal will balance the federal budget by 2020. (Photo by Chip Somodevilla/Getty Images)  Share", "external_links": [], "published": "2015-06-18T16:51:00.000+03:00", "crawled": "2015-06-19T00:34:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}