{"organizations": [], "uuid": "fea1dec352c94ba14b8e47d53118e8aa6b105259", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/29/obama-signs-trade-worker-assistance-bills-into-law/", "country": "US", "title": "Obama signs trade, worker assistance bills into law", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama signs trade, worker assistance bills into law | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "fea1dec352c94ba14b8e47d53118e8aa6b105259"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/06/29/obama-signs-trade-worker-assistance-bills-into-law/", "ord_in_thread": 0, "title": "Obama signs trade, worker assistance bills into law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print In a rare bipartisan scene at the White House, President Obama on Monday signed into law two hard-fought bills giving him greater authority to negotiate international trade deals and providing aid to workers whose jobs are displaced by such pacts.\nThe measures were politically linked to secure bipartisan support for the trade legislation and they set the stage for the Obama administration to conclude negotiations on a 12-nation Pacific Rim economic pact.\n\"I thought I'd start off the week with something we should do more often, a truly bipartisan bill signing,\" Obama said in a crowded East Room ceremony. Five Democratic and two Republican members of Congress watched over as Obama affixed his name to the two bills.\nThe trade bill gives Congress the right to approve or reject trade agreements, but not change or delay them. Obama defied the wishes of most members of his Democratic Party and frayed relations with organized labor to push the legislation.\nThe worker assistance was part of a broader trade preferences bill that extends a measure easing trade between the U.S. and sub-Saharan Africa.\n\"I think it's fair to say that getting these bills through Congress has not been easy,\" Obama said. \"They've been declared dead more than once. They have inspired long and passionate debates and that's entirely appropriate for our democracy.\"\nBut he said they will ultimately be good for American workers and for American business.\nObama used the event to push for further bipartisan legislation, particularly for a massive infrastructure bill that would help build new highways, airports and shipping ports.\nTensions within the Democratic Party were visible throughout the debate on the legislation and prompted warnings from labor leaders that Democrats who supported the bill could be targeted for defeat.\nAs Obama signed the legislation, he declared: \"This is so much fun we should do it again.\"\nBut one of the lawmakers on stage with him, perhaps reflecting the bitter infighting, replied: \"No thank you.\"\n ", "external_links": [], "published": "2015-06-29T03:00:00.000+03:00", "crawled": "2015-06-29T23:49:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}