{"organizations": [], "uuid": "57794f04e05b39cd375c628224b84ac8c541cab6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3076182/images/o-JEB-BUSH-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/immigration/feed", "section_title": "Immigration on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/15/jeb-bush-immigration_n_7589310.html", "country": "US", "title": "Jeb Bush Goes Off Script To Promise Immigration Reform", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Jeb Bush Goes Off Script To Promise Immigration Reform", "spam_score": 0.0, "site_type": "news", "published": "2015-06-15T20:55:00.000+03:00", "replies_count": 0, "uuid": "57794f04e05b39cd375c628224b84ac8c541cab6"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/15/jeb-bush-immigration_n_7589310.html", "ord_in_thread": 0, "title": "Jeb Bush Goes Off Script To Promise Immigration Reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jeb Bush Goes Off Script To Promise Immigration Reform Posted: reddit \nNewly announced GOP presidential candidate Jeb Bush went off script on Monday to pledge to pass immigration reform, in one of the most surprising moments of his announcement speech. \nHe wasn't initially planning to mention immigration, which underscores how difficult an issue it is for him in the primary, as he tries to avoid charges of supporting \"amnesty\" without backing away from his record and being seen as a flip-flopper. The 2,000-word prepared remarks don't include \"immigration\" at all. \nA group of immigration advocates attended the speech in Miami wearing yellow shirts that spelled out \"legal status is not enough.\" \nAs Bush was talking about his family, he broke away from his prepared speech to address them. \n\"By the way, just so that our friends know, the next president of the United States will pass meaningful immigration reform so that that will be solved -- not by executive order,\" Bush said, to applause. \nBush's statement was a reference to President Barack Obama's deportation relief policies that came in lieu of action from Congress. The president's first deportation relief program, the Deferred Action for Childhood Arrivals program, or DACA, was announced exactly three years ago. The program has allowed more than 660,000 undocumented young people who came to the U.S. as children to stay and work legally on a temporary basis. \nObama announced plans last November to expand DACA to some older undocumented immigrants who came to the U.S. as children, and to create a new program to grant similar benefits to parents of U.S. citizens and legal permanent residents. Both the expanded DACA and the new deferred action program have been temporarily blocked in the courts. \nBush has said he opposes Obama's actions, but said he wanted to replace them with immigration reform legislation. He has also backed away somewhat from his past support for a path to citizenship for undocumented immigrants, instead saying he supports \"a path to legalized status,\" which could allow them to eventually obtain citizenship. \nAccording to a statement , the immigration advocates who interrupted Bush's speech were from the groups Homestead ERA, United We Dream, GetEQUAL Florida, Dreamers Mom’s, Alliance for Citizenship, United Families, Farm-Workers Association, the American Friends Service Committee and WeCount. \nMariana Martinez, a member of the group Homestead ERA, said they protested because Bush \"has been all over the map on immigration.\" \n“He’s also stated his support of reform with legalization for the undocumented community, but of any immigration reform we demand full and equal citizenship that doesn’t leave millions of our loved ones in a permanent second class status,\" she said. \nOther GOP presidential candidates have not devoted much time to immigration in their early speeches. Sen. Lindsey Graham (R-S.C.), who helped draft a comprehensive immigration reform bill that passed the Senate in 2013, didn't discuss it . Sen. Marco Rubio (R-Fla.) gave it only a cursory mention . \nSen. Ted Cruz (R-Texas) asked his supporters to \"imagine a president that finally, finally, finally secures the borders,\" criticizing Obama's \"lawlessness and the president’s unconstitutional executive amnesty.\" More:", "external_links": [], "published": "2015-06-15T20:55:00.000+03:00", "crawled": "2015-06-16T01:10:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}