{"organizations": [], "uuid": "3d1de95e6c634f20133cd6b005b57e348930eaf4", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/39/feed", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/overnights/245899-overnight-defense-obama-to-revamp-hostage-policies", "country": "US", "title": "Overnight Defense: Obama to revamp hostage policies", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Defense: Obama to revamp hostage policies", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T00:59:00.000+03:00", "replies_count": 0, "uuid": "3d1de95e6c634f20133cd6b005b57e348930eaf4"}, "author": "mmali@thehill.com (Martin Matishak and Kristina Wong)", "url": "http://thehill.com/policy/defense/overnights/245899-overnight-defense-obama-to-revamp-hostage-policies", "ord_in_thread": 0, "title": "Overnight Defense: Obama to revamp hostage policies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Defense: Obama to revamp hostage policies By Martin Matishak and Kristina Wong - 06/23/15 05:59 PM EDT \nTHE TOPLINE. President Obama on Wednesday will detail sweeping changes to U.S. hostage guidelines, including allowing American families to communicate with captors and pay ransoms without facing federal prosecution. \nObama will make the changes through an executive order and presidential directive, White House press secretary Josh Earnest said Tuesday. \nThe announcement caps a policy review the administration launched in November after the Islamic State in Iraq and Syria (ISIS) released several grisly Internet videos showing the beheading of American captives. ADVERTISEMENT The administration will also establish a new office with the Federal Bureau of Investigation, dubbed the hostage recovery fusion cell, to coordinate response efforts with the families of American captives.\nThe president will deliver a speech about the changes Wednesday and meet with families of hostages who took part in the months-long review. \nThe proposed changes, though, aren't enough for Rep. Duncan Hunter (R-Calif.) who derided them as \"window dressing.\" \n\"The changes offered up by the White House prove that neither the right questions were asked nor were any lessons learned,\" said Hunter, a member of the House Armed Services Committee, in a statement. \"Wholesale changes are needed, but what's being put forward is nothing more than window dressing, I fear.\" \nHe argued the Defense Department, \"with its assets, intel and global reach,\" should be in the lead of reviewing hostage policies. \n\"Among all the issues I believed the White House could get right, this was one. I was wrong,\" Hunter said. \nCARTER 'NOT CONFIDENT' GITMO CLOSING. Defense Secretary Ashton Carter cast doubt Tuesday on whether the Guantanamo Bay detention facility can be closed before President Obama leaves office. \n\"I'm not confident, but I am hopeful,\" Carter said in an exclusive interview with CBS News. The closure of the U.S. military prison in Cuba was a campaign promise Obama made in 2008, but Congress has imposed restrictions on detainee releases through annual defense policy bills. Carter said earlier this month he was working on a proposal to send to Sen. John McCain (R-Ariz.), chairman of the Armed Services Committee. \nMcCain included a provision in the 2016 National Defense Authorization Act to close the facility if the administration submits a plan to lawmakers. \n\"I think we'll have a good proposal, and I think we're hoping it wins the support it needs in Congress so that we can move forward,\" Carter said. He added that not every detainee in Guantanamo can be freed, indicating some would have to be transferred to the U.S. or to another detention facility.\"We have to be very clear. There are people in Guantanamo Bay who cannot and should not be released because they will return to the terrorist fight,\" Carter said. \"And therefore we need a place where we can detain them in the long term. We have been forbidden to create such a place in U.S. territory.\" McCain told reporters on Tuesday that Carter may be worried that Congress would not approve the plan, but said he could help argue in favor of it if certain conditions were met. \n\"If I can show that it's a secure place that is run by [the Defense Department] ... I think I have a strong argument with my colleagues,\" he said. \nDOD: IRAN-BACKED FORCES SHARE BASE WITH US TROOPS. The Pentagon acknowledged Tuesday that a \"handful\" of Iran-backed Shiite militia fighters are sharing an Iraqi base in Anbar province where U.S. troops are also stationed. \nPentagon spokesman Army Col. Steve Warren said the number of militiamen at the Taqaddum air base in Anbar is in the \"low double digits\" and they have no interaction with American forces. \"There are some individuals who are working, serving in sort of a liaison capacity, who are members of Shia militias,\" Warren said Tuesday. The comments come a day after Bloomberg View reported that the Iran-backed forces and U.S. military were sharing a base and that senior U.S. officials were worried about the risk to American troops. The Obama administration announced earlier this month that 450 U.S. troops would be deployed to the base to help recruit Sunni forces after the fall of Ramadi, the capital of Anbar, to the Islamic State in Iraq and Syria (ISIS). Warren said that units of Shiite militia fighters at the base were asked to leave as a pre-condition for basing U.S. troops there. Those Shiite forces are now situated just outside the camp and banned from the base. \nThose fighters are part of Iraq's \"popular mobilization\" forces, groups outside of the Iraqi government that are assisting in the battle against ISIS. Warren called the Bloomberg report \"over-torqued\" but said the request for Shiite militias to leave the base was made \"in the interest of the safety of our personnel.\" Sen. Tom Cotton (R-Ark.), an Iraq War veteran, in a statement Monday called it \"deeply troubling that the President now finds it acceptable to share a military base with this enemy, even while we are attempting to negotiate a deal to keep Iran from obtaining nuclear weapons.\" \nHe said the Bloomberg report was a \"stark and nearly absurd\" demonstration of the Obama administration's \"tacit accommodation of Iran's strategic aim of extending its influence in Iraq.\" \n\"It echoes the president's tacit accommodation of Iran's wish to maintain [President] Bashar al-Assad in Syria and his explicit accommodation of Iran's nuclear ambitions,\" Cotton said. \nBENGHAZI CHAIR: STATE DIDN'T COUGH UP EMAILS. The leader of the House Select Committee on Benghazi said the State Department failed to meet a deadline to turn over emails between Hillary Clinton and Sidney Blumenthal. \n\"This is a straightforward question -- State Department either has them or they do not,\" Chairman Trey Gowdy (R-S.C.) said in a statement on Tuesday. \n\"State should immediately produce to the committee emails that should have been produced months ago or explain why it is not in possession of these emails from Secretary Clinton,\" he added. \"Either response has ramifications toward a full public record. This should be neither complicated nor time consuming.\" \nGowdy criticized the department the day after his panel released nearly 60 emails Blumenthal turned over to the select committee earlier this month. \nHe challenged the State Department to determine whether or not the agency already possessed them, giving the agency until close of business Monday to respond. \n\"We're still going through that,\" State Department spokesman John Kirby told reporters during a press briefing. \nGowdy chided the agency over the delay. \n\"Every request to State is met with delay, a request for extension and pleading to narrow the scope,\" he said. \"The reality is the State Department under both Secretaries [John] Kerry and Clinton has failed in its obligation to provide transparency for the American people and congressional investigators.\" \nMeanwhile, Media Matters founder David Brock demanded to know why panel members asked an estimated 45 questions about Blumenthal's role with liberal organizations, including Media Matters, and Brock-founded super-PACs, American Bridge and Correct The Record, during a nine-hour deposition last week. \n\"So how did the House Select Committee on Benghazi suddenly morph into the House Select Committee on Media Matters?\" Brock asked in an open letter. \nIN CASE YOU MISSED IT: \n- House Armed Services chairman: Russia is an 'existential threat' to US \n- McCain: US 'scrambling' ahead of Iran deadline \n- Bill would lift ban on transgender troops \n- In first, woman headed to lead national security lab \n- Iranian nuke deal won't lead to immediate windfall, think tank asserts", "external_links": [], "published": "2015-06-24T00:59:00.000+03:00", "crawled": "2015-06-24T07:27:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}