{"organizations": [], "uuid": "d1429b422ab6a3ca3baac93f363e4a7cc96f4ab7", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3040970/images/o-OBAMA-MERKEL-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/06/obama-g7-summit_n_7525760.html?utm_hp_ref=politics&ir=Politics", "country": "US", "title": "Obama Faces New Dynamic With Europe At G7 Summit", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Faces New Dynamic With Europe At G7 Summit", "spam_score": 0.0, "site_type": "news", "published": "2015-06-06T18:50:00.000+03:00", "replies_count": 0, "uuid": "d1429b422ab6a3ca3baac93f363e4a7cc96f4ab7"}, "author": "Mollie Reilly", "url": "http://www.huffingtonpost.com/2015/06/06/obama-g7-summit_n_7525760.html?utm_hp_ref=politics&ir=Politics", "ord_in_thread": 0, "title": "Obama Faces New Dynamic With Europe At G7 Summit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Faces New Dynamic With Europe At G7 Summit Reuters reddit \nBy Jeff Mason \nWASHINGTON, June 6 (Reuters) - When President Barack Obama attends the Group of Seven summit in Germany on Sunday, he will join fellow leaders who are growing accustomed to a new dynamic in the transatlantic relationship: less direction from Washington, more demands on Europe. \nIn responding to Russia's intervention in Ukraine, the crisis in Libya and efforts to advance Middle East peace, European leaders have stepped up their role after a real or perceived sense that the United States was drawing back. \nThe shift has created both annoyance and satisfaction among European officials. \nSome privately express frustration at what they view as reluctance by the Obama administration to get involved. \nThey contrast a \"leading from behind\" strategy in the Middle East and Europe with the more proactive U.S. stance in Asia, where Obama is acting diplomatically and militarily to counter growing Chinese influence. \nFrance has publicly berated the U.S. administration for not launching air strikes in 2013 against Syrian President Bashar al-Assad. It said that the decision caused irreparable damage to the Syrian opposition on the ground and emboldened Russian President Vladimir Putin on the international scene. \n\"At the heart of what's going on is that the Americans themselves don't want to be on the front line in this region\" a senior French official said. The phrase \"leading from behind\" grew out of the 2011 NATO intervention in Libya when Washington let France and Britain do most of the heavy military lifting. \nDIVISION OF LABOR \nOther diplomats and U.S. officials say France and Germany's leading role in talks between Moscow and Kiev, which led to a shaky ceasefire deal in eastern Ukraine, was appropriate for a crisis that hits them closer to home. \n\"It's not a question of ceding responsibility, it's the natural division of labor between us,\" said David O'Sullivan, the European Union's ambassador to the United States. \nOther areas, however, have been hurt by a lack of U.S. leadership, foreign policy analysts said. \nStephen Hadley, Republican President George W. Bush's national security adviser, said it was very attractive to Russia not to have the United States at the table in the Ukraine ceasefire talks. He noted that Europeans were eyeing a new approach to peace between Israelis and Palestinians by potentially backing a U.N. resolution for a Palestinian state. \n\"Overhanging this, of course, is this perception of American disengagement and stepping back from leadership on a lot of problems in the world, which is a perception that our Arab friends and allies have in the Middle East and, you know, I think is very much prevalent in Europe,\" he said. \n\"STRONG ALIGNMENT\" \nThe White House rejects that charge, which is voiced by many Republican critics. It points to U.S.-European unity on Iran's nuclear program, global climate change negotiations, strikes against Islamic State militants, and sanctions against Russia. \n\"If you look at the president's key foreign policy priorities, every single one of them, just about, is supported by these key European partners,\" Obama's deputy national security adviser Ben Rhodes said. \"I think this is a moment of very strong alignment with Europe.\" \nThat alignment has not translated into pro-American sentiment in Germany, which is hosting the G7 summit. Germans remain angry at U.S. spying practices, an issue German Chancellor Angela Merkel has raised repeatedly with Obama. \nIn an effort to set a more positive tone, Obama and Merkel will spend some public time together before the summit on Sunday, walking around a small village and sampling local food. \nThe United States has openly talked about the need for Europe to step up militarily and has recently reiterated a long-standing message that its NATO partners must boost their military spending. (Additional reporting by John Irish in Paris and Louis Charbonneau in New York; Editing by Mark Trevelyan) Also on HuffPost: Obama's Handshakes Around The World of   In this image from TV, US President Barack Obama shakes hands with Cuban President Raul Castro at the FNB Stadium in Soweto, South Africa, in the rain for a memorial service for former South African President Nelson Mandela, Tuesday Dec. 10, 2013. (AP Photo/SABC Pool) President Barack Obama meets with Argentina's President Cristina Fernandez at the G20 Summit in Cannes, France, Friday, Nov. 4, 2011. (AP Photo/Charles Dharapak) Afghanistan President Hamid Karzai (L) and U.S. President Barack Obama shake hands after a joint news conference in the East Room of the White House on January 11, 2013 in Washington, D.C. (Photo by Chip Somodevilla/Getty Images) U.S. President Barack Obama (L) and Australian Prime Minister Julia Gillard shake hands during a bilateral meeting at Parliament House in Canberra on November 16, 2011. (JIM WATSON/AFP/Getty Images) U.S. President Barack Obama (L) shakes hands with Brazilian President Dilma Vana Rousseff (R) during a joint press conference at Palacio do Planalto in Brasilia on March 19, 2011. (JIM WATSON/AFP/Getty Images) CORRECTION: The title of this slide initially referred to Dilma Rousseff as the prime minister of Brazil. In fact, she is the president of Brazil. U.S. President Barack Obama (L) and Cambodian Prime Minister Hun Sen (R) reach out to shake hands on arrival at the Peace Palace for the Association of Southeast Asian Nations (ASEAN) and US summit in Phnom Penh on November 19, 2012 following the 21st ASEAN Leaders Summit. (ROMEO GACAD/AFP/Getty Images) President Barack Obama shakes hands with Canadas Prime Minister Stephen Harper in bilateral meeting during the G20 Summit, Tuesday, June 19, 2012, in Los Cabos, Mexico. (AP Photo/Carolyn Kaster) U.S. President Barack Obama greets Chilean President Sebastian Pinera before a dinner at the Washington Convention Center during the Nuclear Security Summit in Washington, DC, on April 12, 2010. (JEWEL SAMAD/AFP/Getty Images) U.S. President Barack Obama shakes hands with then-Chinese Vice President Xi Jinping during meetings in the Oval Office of the White House in Washington, DC, February 14, 2012. (SAUL LOEB/AFP/Getty Images) Colombia President Juan Manuel Santos (R) and U.S. President Barack Obama shake hands during a joint press conference in the framework of the VI Summit of the Americas at Casa de Huespedes in Cartagena, Colombia, on April 15, 2012. (SAUL LOEB/AFP/Getty Images) President Barack Obama and Costa Rica's President Laura Chinchilla shake hands at the end of their joint press conference in San Jose, Costa Rica, Friday, May 3, 2013. (AP Photo/Moises Castillo) President Barack Obama shakes hands with French President Francois Hollande on arrival for the G8 Summit Friday, May 18, 2012 at Camp David, Md. (AP Photo/Charles Dharapak) U.S. President Barack Obama (R) shakes hands with German Chancellor Angela Merkel looks after a joint press conference following their meeting in the East Room of the White House in Washington, D.C., on June 7, 2011. (JEWEL SAMAD/AFP/Getty Images) President Barack Obama shakes hands with Italian President Giorgio Napolitano during their meeting in the Oval Office of the White House in Washington, Friday, Feb. 15, 2013. (AP Photo/Jacquelyn Martin) President Barack Obama shakes hands with Japan's Prime Minister Shinzo Abe in the Oval Office of the White House in Washington, Friday, Feb. 22, 2013. (AP Photo/Charles Dharapak) President Barack Obama and South Korea President Park Geun-Hye shake hands at the conclusion of their joint news conference in the East Room of the White House in Washington, Tuesday, May 7, 2013. (AP Photo/Pablo Martinez Monsivais) President Barack Obama, left, and Mexico President Enrique Pena Nieto, right, shake hands following a news conference at the Palacio Nacional in Mexico City, Thursday, May 2, 2013. (AP Photo/Pablo Martinez Monsivais) U.S. President Barack Obama (R) shakes hands with President Benigno Aquino of the Philippines in the Oval Office at the White House on June 8, 2012 in Washington, D.C. (Photo by Kevin Dietsch-Pool/Getty Images) Polish Prime Minister Donald Tusk (R) shake hands with U.S. President Barack Obama (L) during their meeting in Warsaw on May 28, 2011. (JANEK SKARZYNSKI/AFP/Getty Images) President Barack Obama shakes hands with Sheik Hamad bin Khalifa Al Thani of Qatar during their meeting in the Oval Office of the White House in Washington, Tuesday, April 23, 2013. (AP Photo/Pablo Martinez Monsivais) U.S. President Barack Obama (R) greets Romania's President Traian Basescu before a dinner at the US Ambassador's residence in Prague on April 8, 2010. (JEWEL SAMAD/AFP/Getty Images) President Barack Obama shakes hands with Russias President Vladimir Putin in a bilateral meeting during the G20 Summit, Monday, June 18, 2012, in Los Cabos, Mexico. (AP Photo/Carolyn Kaster) U.S. President Barack Obama shakes hands with King Abdullah bin Abdulaziz Al Saud of Saudi Arabia during meetings in the Oval Office at the White House in Washington, DC, June 29, 2010. (SAUL LOEB/AFP/Getty Images) President Barack Obama shakes hands with with Singapore Prime Minister Lee Hsien Loong during their meeting in the Oval Office of the White House in Washington, Tuesday, April, 2, 2013. (AP Photo/Pablo Martinez Monsivais) U.S. President Barack Obama shakes hands with Sweden's Prime Minister Fredrik Reinfeldt (L) during meetings in the Oval Office of the White House in Washington, DC, November 2, 2009. (SAUL LOEB/AFP/Getty Images) U.S. President Barack Obama, left, and Thai Prime Minister Yingluck Shinawatra shake hands following the conclusion of their joint news conference at Thai Government House in Bangkok, Thailand, Sunday, Nov. 18, 2012. (AP Photo/Pablo Martinez Monsivais) FILE - In this March 22, 2013, file photo, President Barack Obama, left, and Jordan's King Abdullah II, right, shake hands following their joint new conference at the King's Palace in Amman, Jordan. (AP Photo/Pablo Martinez Monsivais, File) U.S. President Barack Obama (R) shakes hands with Turkish Prime Minister Recep Tayyip Erdogan after their bilateral meeting in Seoul on March 25, 2012 on the eve of the 2012 Seoul Nuclear Security Summit. (JEWEL SAMAD/AFP/Getty Images) President Barack Obama shakes hands with Britain's Prime Minister David Cameron on arrival for the G8 Summit Friday, May 18, 2012 at Camp David, Md. (AP Photo/Charles Dharapak) Venezuelan President Hugo Chavez (R) gives a book, 'The Open Veins of Latin America' of Uruguayan writer Eduardo Galeano to US President Barack Obama (L) during a multilateral meeting to begin during the Summit of the Americas at the Hyatt Regency in Port of Spain, Trinidad April 18, 2009. (JIM WATSON/AFP/Getty Images)  Share", "external_links": [], "published": "2015-06-06T18:50:00.000+03:00", "crawled": "2015-06-06T19:01:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}