{"organizations": [], "uuid": "220f1c2808d69e5b338d9988b7d05264ae84af34", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150513170933-overtime-pay-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_pf.rss", "section_title": "Personal finance news - CNNMoney.com", "url": "http://money.cnn.com/2015/06/29/pf/obama-overtime-rule-changes-proposed/index.html", "country": "US", "title": "Obama wants to make 5 million more workers eligible for overtime", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Obama wants to make 5 million more workers eligible for overtime", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T06:29:00.000+03:00", "replies_count": 0, "uuid": "220f1c2808d69e5b338d9988b7d05264ae84af34"}, "author": "", "url": "http://money.cnn.com/2015/06/29/pf/obama-overtime-rule-changes-proposed/index.html", "ord_in_thread": 0, "title": "Obama wants to make 5 million more workers eligible for overtime", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeanne Sahadi", "Obama"], "text": "Obama wants to make 5 million more workers eligible for overtime By Jeanne Sahadi @CNNMoney An estimated 5 million more salaried workers may soon become automatically eligible for overtime pay, thanks to a pending federal rule change. \nThat's according to President Obama, who on Monday evening previewed a key part of a proposed change to overtime rules. \nLater this week, the Labor Department is expected to propose nearly doubling the income threshold below which workers will automatically qualify for overtime pay. \nToday, the only way you're automatically guaranteed time and a half after logging 40 hours a week is if you earn less than $23,660 a year ($455 a week). \nThe DOL will propose raising it to roughly $50,400 ($969 a week). The increase would only be the second one since 1975. \n\"That's good for workers who want fair pay, and it's good for business owners who are already paying their employees what they deserve -- since those who are doing right by their employees are undercut by competitors who aren't,\" Obama wrote in an op-ed in the Huffington Post . \nWhile advocates for the change see a big win for workers, the business community sees the issue differently. \nA report from the National Retail Federation, for instance, contends that implementation of the new rules will cost retailers and restaurants millions of dollars, and they will \"hollow out\" low- and mid-level management positions, curtailing career advancement for middle class workers, especially in rural states. \nToday, salaried employees who make more than $23,600, but less than $50,000, are not eligible for overtime if they perform so-called \"exempt\" managerial duties. Under the new rules, they will be. \nRelated: 4 ways the new overtime rules may affect your paycheck \nThe change in the income threshold will require employers to reclassify millions of salaried workers as hourly workers -- and that could cause them to lose some benefits, said Tammy McCutchen, who used to run the DOL's Wage and Labor Division and is now a management-side lawyer with Littler Mendelson. \n\"The higher up you go in the corporate structure, the more the market demands better benefits,\" McCutchen said. And hourly workers are considered on a lower level than salaried ones. \nSome companies, for instance, offer merit-based bonuses to salaried workers but not to hourly ones. Or they may be put on a different vesting schedule for vacation days. \nRelated: The death of the 40-hour workweek \nTheir morale could suffer too. \nFor instance, while salaried workers have some latitude to schedule their day, hourly workers may see pay docked or have to use vacation time for things like midday doctor's appointments \nThe proposed rule changes - which will be subject to public comment before being finalized -- may not necessarily mean more money for the workers affected. \nIt will for some, of course. \nBut for others, it could mean their employers will insist that they not work more than 40 hours a week so they don't have to pay them overtime. \nOr some employees may still work the same long hours they do today but not get paid a dime more. That would happen if their employers lower their base pay to offset any overtime they will be owed. \nThe new rules are aimed at addressing what the White House says is an erosion of the rules that established the 40-hour workweek -- a \"linchpin of the middle class.\" CNNMoney (New York) June 29, 2015: 11:29 PM ET", "external_links": [], "published": "2015-06-30T06:29:00.000+03:00", "crawled": "2015-06-30T06:47:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}