{"organizations": [], "uuid": "77a738a69af1e0fd216c1d31a71f94dc55a1501c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3030350/images/o-MARTIN-OMALLEY-IMMIGRATION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/news.xml", "section_title": "Latino Voices News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/03/martin-omalley-immigration_n_7506658.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "country": "US", "title": "Martin O'Malley Sees A Clinton Weak Spot On Immigration. Can He Get Anyone Else To Notice?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Martin O'Malley Sees A Clinton Weak Spot On Immigration. Can He Get Anyone Else To Notice?", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T04:39:00.000+03:00", "replies_count": 0, "uuid": "77a738a69af1e0fd216c1d31a71f94dc55a1501c"}, "author": "Elise Foley", "url": "http://www.huffingtonpost.com/2015/06/03/martin-omalley-immigration_n_7506658.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "ord_in_thread": 0, "title": "Martin O'Malley Sees A Clinton Weak Spot On Immigration. Can He Get Anyone Else To Notice?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Martin O'Malley Sees A Clinton Weak Spot On Immigration. Can He Get Anyone Else To Notice? Posted: Updated: 5 hours ago U.S. Democratic presidential candidate and former Maryland Gov. Martin O'Malley speaks at the U.S. Hispanic Chamber of Commerce June 3, 2015 in Washington, DC. The event was O'Malley's first public engagement as a presidential candidate. (Photo by Win McNamee/Getty Images) | Win McNamee via Getty Images reddit \nWASHINGTON -- The Martin O'Malley campaign knows most voters don't know who Martin O'Malley is. \nSo O'Malley, the former Maryland governor who entered the Democratic presidential primary on Saturday, is putting his record on immigration front and center. \nThe calculation is twofold. The Latino community is a growing portion of the Democratic electorate and an important one to court, and immigration is a gateway issue for many Latino voters. But, more than that, O'Malley's team views immigration as a way to contrast his position with that of Hillary Clinton, the Democratic front-runner who has been trying to tout her own immigration-reform bona fides. \nThe challenge for O'Malley is one that he's bound to confront on other issues as well. Put simply, many of his positions aren't that different from Clinton's. Both Democrats support limiting deportations and allowing undocumented immigrants to stay in the U.S. Both have vowed to push for immigration reform in Congress and to continue President Barack Obama's deportation-relief policies. \nO'Malley is banking that a strong record of immigration reform accomplishments will trump what is, for Clinton, largely a series of far-reaching policy declarations. But he has to find a way to make sure Latino voters hear his case. \n\"He definitely has the stances and he definitely has the accomplishments,\" said Jose Parra, a Democratic strategist with the consulting firm ProsperoLatino. \"It's just making sure that people known about them. At this point, he is an unknown quantity for a vast majority of Latino voters. Secretary Clinton is a household name and has been one for a long time.\" \nIn the days since his presidential announcement, O'Malley has made a concerted effort to target Latino voters, including an interview with Univision and an appearance at the U.S. Hispanic Chamber of Commerce, one of his first since becoming an official candidate. \nAt the event, he touted his achievements on immigration, vowed to push for reform in Congress within the first 100 days of his presidency and pledged that \"deportations should be limited to the public safety imperative.\" \nBut he didn't go after Clinton directly. Asked at the Hispanic chamber event whether he is \"ready for Hillary,\" and how he would trump Clinton on immigration, O'Malley stuck to his script. \n\"I am the only one with 15 years of executive experience,\" he told Hispanic Chamber of Commerce President Javier Palomarez. \"And one of the greatest indicators of a person's future actions will be how they acted in the past when they had the power.\" \nWhether O'Malley can walk the difficult line of contrasting his record with Clinton's without directly attacking her could end up determining the viability of his run. Unlike on economic policy, where Sen. Bernie Sanders (I-Vt.) appears to be setting the tempo for the 2016 Democratic field, immigration policy presents O'Malley with a fresh political opening. \nAn aide to the former governor, who requested anonymity to avoid overshadowing his remarks, said on Wednesday that O'Malley will talk about immigration not just at Latino-focused events, but in front of national audiences. The comparison, as the aide noted, was again to Clinton, who spoke about immigration reform in detail at a roundtable in Las Vegas last month, but hasn't discussed it much while campaigning in Iowa and New Hampshire. The Clinton campaign did not respond to a request for comment. \n\"Obviously we think that there's an opening,\" the O'Malley aide said. \nOthers aren't so sure. Clinton, after all, was more popular than Obama with Latino voters in 2008. And Fernand Amandi, principal at the polling and strategy firm Bendixen & Amandi International, said that without \"a lot of daylight between\" O'Malley and Clinton's stances on immigration, O'Malley would need to \"make a strategic decision that physically places him in the community,\" such as going to events, being \"ubiquitous on Spanish-language television\" and meeting with leaders. \n\"That's no guarantee either, if he does all that work,\" Amandi said. \"It's a strategic, calculated risk that he could put on all that work and still not win that group of voters over.\" \nIn the months ahead, the O'Malley campaign will seek to spotlight specific immigration policies to help their action-versus-talk case. O'Malley referenced several on Wednesday, such as his criticism of the treatment of unaccompanied minors who crossed the border illegally last year. Clinton said last year that children \"should be sent back\" to their native countries, while O'Malley was getting flack from the White House for saying quick deportations would be sending them \"back to certain death.\" He lamented on Wednesday that the U.S. had not treated the children \"with the dignity and respect that we should have as Americans.\" \nO'Malley also mentioned his work to expand driver's licenses for undocumented immigrants, which Clinton once opposed but now supports . He noted that he had signed the law granting in-state tuition to undocumented young people in Maryland, and approved a measure to limit the state's cooperation with federal immigration enforcers. \nThere is a receptive audience for this type of pitch. Immigration reform advocate Cesar Vargas of the Dream Action Coalition said Sunday that while Clinton has good positions, \"she has no record.\" \n\"The only person who I see that has had a proven record when there was no election is Gov. O'Malley,\" Vargas said on Latino Rebels Radio. \nRegardless of whether O'Malley can convince more people of this over the next few months, there will be a benefit for Latino voters and others who support immigration reform. On a scale unlike previous elections, their community is being courted and their issues addressed. \n\"At the end of the day, what I think it does is it creates a very good brand for the Democratic Party because you have two candidates who are competing to show the Latino community they stand with them,\" Parra said. Also on HuffPost:", "external_links": [], "published": "2015-06-04T04:39:00.000+03:00", "crawled": "2015-06-04T10:14:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}