{"organizations": [], "uuid": "3136a021c4e9e5c40dc75ab6894ea4b6a2e61755", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/hannity_coulter_060115.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/transcript/2015/06/02/ann-coulter-sounds-off-on-immigration-policies-in-new-book-adios-america/", "country": "US", "title": "Ann Coulter sounds off on immigration policies in new book 'Adios, America'", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Ann Coulter sounds off on immigration policies in new book 'Adios, America' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "3136a021c4e9e5c40dc75ab6894ea4b6a2e61755"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/06/02/ann-coulter-sounds-off-on-immigration-policies-in-new-book-adios-america/", "ord_in_thread": 0, "title": "Ann Coulter sounds off on immigration policies in new book 'Adios, America'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com\nThis is a rush transcript from \"Hannity,\" June 1, 2015. This copy may not be in its final form and may be updated.\nSEAN HANNITY, HOST: The wait is finally over. Ann Coulter's brand new book is finally out in bookstores today. It's on Amazon.com. It's called \"Adios, America: The Left's Plan to Turn Our Country into a Third World Hellhole.\" Here she is, author, bestseller, Ann Coulter. I will tell you this, and people that dismiss you are wrong. They don't read your books because if they did, this is extraordinarily well-researched. This is a much bigger issue than the southern border, northern border.\nANN COULTER, AUTHOR, \"ADIOS, AMERICA\": Right.\nHANNITY: And you go into great detail. The cost is enormous, and we have two parties that don't want to solve the problem. Otherwise, the fence that works at the White House and in gated communities, as you point out, would be built.\nCOULTER: Right. Not only that, there would be a change to the legal immigration. That was the point I was making with you on radio today. This is so much bigger than -- other than the first chapter, my book is about legal immigration. The Somalis leaving to fight with ISIS, those are legal immigrants. The (INAUDIBLE) immigrants raping little girls, those are legal immigrants. The immigrants going on welfare at rates far above the native rate, committing crimes at what appears to be far above the native rate -- the government won't tell us. Never has a country been transformed like this, never in world history.\nAnd it is being done as an express plan by the left because they want voters more favorable to liberal policies. It's striking how all of the most avid immigration activists -- and there are hundreds, probably thousands of groups just working overtime to bring in the poorest of the poor to live in America. There are always the people who don't particularly like America. They call us racists, sexists, homophobic. Why are they bringing these poor third-worlders here? It's because they want to transform America, because they hate America. And Republicans aren't stopping them because the big donors want the cheap labor.\nHANNITY: In other words, corporate America.\nAll right -- but this is really important, that we have no scrutiny of the people we allow into this country. And that is as big a problem as the southern border where somebody wants a job and ISIS has the ability to walk across at will.\nCOULTER: Yes. And the shocking part that I found out, which is why this book became this book -- I wasn't going write a book about immigration. I was going to have a few chapters on immigration, and I had already written two chapters for the book I was planning on writing. Then I go to look up some basic, obvious facts that most Americans will be shocked the government refuses to tell us, like how many foreign born are in our prisons? How many are in state prison, how many are in federal prison, and what crimes are they in for, and what countries do they come from? Oh, no, no, no, no, read chapter seven and you will see it was written through tears of frustration and rage. That was when I called my publisher and said this is going to be a different book. You can't believe what I'm finding here.\nThe way they hide the information, for example, counting both legal and illegal immigrants in federal prison, only illegal immigrants in state prison. Well, that's where most prisoners are. Mexicans for many years, for most years are counted as white.\nBut I do, I mean, I eventually have to go to the ancillary facts. Of course they do not count nationalized citizens at all. Isn't that worse? It's one thing for the government to miss criminals who are running across the border. That's bad enough. How about the ones the government looked over and said, you'll make a fine addition to this country. And then they're blowing up the Boston Marathon. It doesn't occur to Americans that we have any control over this. This is being done to your country. It is government policy. This is not a natural result of the way people would immigrate.\nFirst world countries, developed countries, country where the immigrants do not go on welfare and commit crimes, they are specifically being discriminated against so we can drag in all of the poorest of the poor to instantly go on welfare.\nHANNITY: You will, you know you will be called racist for this.\nCOULTER: As I say, that's the only argument they have. They prefer not to debate me at all, but if they have to, they'll call me that.\nHANNITY: Do you really believe that this is a thought out plan where America as we know it will be forever altered and never be the same?\nCOULTER: Oh, absolutely. I just hope we are not already past the tipping point, but I wouldn't have written this book if I thought we were past the tipping point. We need immediately action. We need an absolute immigration moratorium mostly just to shut these immigration groups down, because as I go through toward the end, coming up with solutions, I mean, you would think you could just pass a law saying if you're a criminal, you go home and we will prosecute marriage frauds, and we will prosecute people who lie about meeting refugee status.\nHANNITY: What country does this? Australia.\nCOULTER: Well, all of these laws have been passed in the United States. They all get ignored, overturned. The INS says we're not going to do it. A federal judge says we're not going to do it. You have industry capture where the immigration judges come from the exact same anti-American immigration groups. They're running the immigration system. You need an absolute moratorium. You need a fence around the border. You need --\nHANNITY: You mean gates work?\nCOULTER: Apparently, some work, too, and wheels work. That's breaking news.\nWe need to end the insane policy of anchor babies, illegal aliens running across the border or arriving, flying in from China, and staying in immigration hotels, giving birth specifically to get American citizenship. By the way, those kids, when they commit crimes and go to prison, they are not counted as immigrants in prison.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\nhannity Hannity , hosted by Sean Hannity, airs on Weekdays at 10PM ET on Fox News Channel.\nMore on this show Advertisement\nAdvertisement", "external_links": [], "published": "2015-06-02T03:00:00.000+03:00", "crawled": "2015-06-03T00:03:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}