{"organizations": ["GOP"], "uuid": "13fdb76ee6906be3a863ea3ff37be6794f549222", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/trafficcarsautoshighway_052015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/transportation/243724-obama-threatens-to-veto-gop-transportation-housing-bill", "country": "", "title": "Obama threatens to veto GOP spending bill for transportation, housing | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama threatens to veto GOP spending bill for transportation, housing | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T18:34:00.000+03:00", "replies_count": 0, "uuid": "13fdb76ee6906be3a863ea3ff37be6794f549222"}, "author": "", "url": "http://thehill.com/policy/transportation/243724-obama-threatens-to-veto-gop-transportation-housing-bill", "ord_in_thread": 0, "title": "Obama threatens to veto GOP spending bill for transportation, housing | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Keith Laing", "Obama"], "text": "Obama threatens to veto GOP spending bill for transportation, housing Getty Images By Keith Laing - 06/02/15 10:00 AM EDT \nPresident Obama is threatening to veto a $55 billion Republican funding bill for the departments of Transportation and Housing and Urban Development. \nThe White House said Tuesday that Obama would reject the measure, which is known as THUD, on the grounds that it underfunds federal transportation and housing programs and includes a number of policy riders involving travel restrictions between the U.S.-Cuba and truck driver scheduling. ADVERTISEMENT “The bill freezes or cuts critical investment in transportation that creates jobs, helps to grow the economy, and improves America's roads, bridges, transit infrastructure, and aviation systems, benefiting towns and cities across the United States, as well as investments in ending homelessness, strengthening communities, and providing rental housing assistance for poor and vulnerable families,” the White House said in a policy statement. \nThe GOP measure, which was approved by the House Appropriations Committee in May, provides $55.3 billion in funding the departments of Transportation and Housing and Urban Development. The bill provides $1.5 billion more than the current 2015 spending level, but $9.7 billion less than President Obama’s request. \nDemocrats have attacked Republicans for attaching a number of non-budgetary issues to the appropriation bill, such as placing restrictions on the Obama administration’s efforts to begin normalizing the nation’s relations with Cuba. Policy \"riders\" are typically a source of friction between the parties in the appropriations process. \nTruck safety groups have accused GOP lawmakers of using the appropriations process to undo a series of trucking regulations they say makes U.S. roads safer, including limits on the length and weight of trucks that have been opposed by trucking companies for years. \nThe White House said Tuesday that it also has objections to the measure’s provisions that are related to the Department of Housing and Urban Development. \n“At a time when only one in four families who are eligible for housing assistance actually receives it, the bill would set back efforts to end homelessness and shortchange housing support for very low-income households, including families with children, the elderly, and the disabled,” the policy statement said. \n“The bill also reduces funding for other vulnerable populations, such as low-income children at risk of lead poisoning, and for programs that invest in public housing to revitalize distressed communities,” the statement continued. “Furthermore, the legislation includes highly objectionable provisions, including provisions that would restrict travel to Cuba, undercut public safety, and limit state and local choices to enhance passenger rail.” Tags: ", "external_links": [], "published": "2015-06-02T18:34:00.000+03:00", "crawled": "2015-06-02T18:34:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}