{"organizations": ["Univision"], "uuid": "e5ac5ec02bc7099a99aadd7fed15319b32df420d", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/RAW-FOXNEWSLATINO-2TQ7GFHA_FNC_062515_15-41.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/06/25/trans-woman-who-heckled-obama-feels-betrayed-by-lgbt-community/", "country": "", "title": "Trans woman who heckled Obama feels betrayed by the LGBT community | Fox News Latino", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Trans woman who heckled Obama feels betrayed by the LGBT community | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T02:49:00.000+03:00", "replies_count": 0, "uuid": "e5ac5ec02bc7099a99aadd7fed15319b32df420d"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/06/25/trans-woman-who-heckled-obama-feels-betrayed-by-lgbt-community/", "ord_in_thread": 0, "title": "Trans woman who heckled Obama feels betrayed by the LGBT community | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Obama"], "text": "Donald Trump threatens to sue Univision \nThe transgender immigrant activist who heckled President Obama at a White House event celebrating L.G.B.T.Q Pride on Wednesday – amid a chorus of boos and jeers – said she feels sold out by the gay community in attendance who turned its back on her. \nJennicet Gutiérrez, an undocumented trans woman immigrant from Mexico, interrupted the president at the beginning of his address shouting for him to “release all LGBTQ immigrants from detention and stop all deportations” Obama fired back, to the the sound of applause from annoyed White House guests, and told her, “You’re in my house” and “Shame on you” before having her escorted out of the premises. \n“By booing me and not letting me be clear on the message, yeah, it seemed like they don’t care; to me it was very hurtful and heartbreaking to see my own community turning a back on me,” Gutierrez said to Fox News Latino referring to the crowd at the White House. \n“It seemed like they were more concerned to be firing up social media with selfies and knowing they were at the White House with the president,\" she added. \"To me that is not an issue. An issue is the violence that we are facing in these detention centers,” she said. \nGutierrez said she was simply trying to call attention to the abuse and violence LGBT immigrants suffer in detention centers across the country and called for the release of some 75 transgender immigrants currently being held in facilities operated by Immigration and Customs Enforcement. \n“Absolutely, I am not embarrassed,” she said of the heckling incident. “My community, which is supposed to be behind me and support me, should be embarrassed, because we cannot be making progress for some and leave others behind,” said Gutierrez, who is a member of the activist groups QTLM and GetEQUAL. \nOther LGBT activists are denouncing Gutierrez for her inappropriate approach. \n\"It was meant to embarrass the president, which is inappropriate,\" said Joseph Falk, an Obama fundraiser and former board chairman of the South Florida LGBT-rights group SAVE, to the Miami Herald. \"If there ever was a president who was a champion for us, this is the guy. He doesn't need to defend himself as far as LGBT rights is concerned.\" \nThirty-five members of Congress wrote a letter to the Secretary of Homeland Security Tuesday urging Jeh Johnson to end the practice of detaining LGBT immigrants citing statistics from the Government Accountability Office that show that transgender immigrants reported 20 percent of sexual assaults in ICE custody but are estimated to be less than 1 percent of the general population. \nActivists believe LGBT immigrants, particularly transgender individuals, should be released pending their immigration court dates. \n“There’s no need to have our sisters in detention because of this kind of abuse,” Gutierrez told FNL. “No matter which side of the argument you are on it’s very crucial for people to know what’s happening in these detention centers. Join the conversation, Let the community speak, don’t shut the community, especially when the community is part of you.” \nAs for the prospect of never being invited back to the White House, Gutierrez isn’t fazed. \n“That’s the least of my concerns,” Guitierrez said. “My concern is to continue to fight for the rights and the humane treatment of immigrant transwomen.” \nBryan Llenas currently serves as a New York-based correspondent for Fox News Channel (FNC) and a reporter for Fox News Latino (FNL). Click here for more information on Bryan Llenas . Follow him on Twitter @BryanLlenas . \nLike us on Facebook ", "external_links": [], "published": "2015-06-26T02:49:00.000+03:00", "crawled": "2015-06-26T02:49:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}