{"organizations": [], "uuid": "1e1ad5f15d11cdfb8af34541bf43a91c3cda3e07", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/061015_an_troops_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/10/obama-approves-sending-up-to-450-more-us-troops-to-iraq/", "country": "US", "title": "Obama approves sending up to 450 more US troops to Iraq", "performance_score": 6, "site": "foxnews.com", "participants_count": 12, "title_full": "Obama approves sending up to 450 more US troops to Iraq | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T03:00:00.000+03:00", "replies_count": 25, "uuid": "c478f47d8a0fe65826364e450f10466a050e182f"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/10/obama-approves-sending-up-to-450-more-us-troops-to-iraq/#post-0", "ord_in_thread": 0, "title": "Obama approves sending up to 450 more US troops to Iraq", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 10, 2015 FoxNews.com livefyre Email Print\nThe White House announced Wednesday that President Obama has approved sending up to 450 additional U.S. troops to Iraq, in a bid to boost local forces fighting the Islamic State's advances.\nThe troops will be sent to help train, advise and assist Iraqi security forces, at a base in eastern Anbar province.\n\"The President made this decision after a request from Prime Minister Haider Al-Abadi and upon the recommendation\" of top U.S. military officials, the White House said in a statement.\nThe decision comes after recent ISIS gains, most significantly the takeover of the Anbar capital of Ramadi. Obama came under criticism earlier this week for saying his administration still did not have a \"complete\" strategy for ramping up training of Iraqi troops.\nWhile the decision to send more trainers won praise in some corners -- House Speaker John Boehner called it a step in the right direction -- the administration continues to face accusations that its strategy in the region is rudderless.\nSen. John McCain of Arizona, the Republican chairman of the Armed Services Committee, was dismissive of Wednesday's decision. \"This is incremental-ism at its best or worst, depending on how you describe it,\" McCain said.\nEven Obama's former military intelligence chief, retired Lt. Gen. Michael Flynn, said in Capitol Hill testimony Wednesday that there's \"no clear U.S. policy\" in Iraq and Syria.\nObama continues to resist demands for combat troops or for more U.S. soldiers on the ground to call in air strikes.\nUnder the latest plan, the number of U.S. training sites in Iraq would increase from four to five, enabling a larger number of Iraqis to join the fight against the Islamic militant group. Most of the fighters would be Sunni tribal volunteers, under the plan.\nThe Defense Department stressed in a written statement that the decision \"does not represent a change in mission,\" but provides another location for DOD personnel.\nThe additional U.S. troops would join the roughly 3,100 U.S. troops already in Iraq. They are currently training about 3,000 Iraqi fighters.\nISIS' gains, though, have raised pressing questions about the ability of the Iraqis to blunt the terror network's advances. The Iraqi government, and the U.S., face the immediate challenge of recruiting enough Sunni fighters, to battle the Sunni-aligned terror group.\nMost of those currently being trained are Kurds or Shiite Muslims.\nObama earlier this week urged Iraq's Shiite-dominated government to allow more of the nation's Sunnis to join the campaign against the violent militant group.\nChairman of the Joint Chiefs of Staff Gen. Martin Dempsey said recommendations on how to improve and accelerate the Iraq training efforts were discussed at a White House meeting last week and said follow-up questions were asked about how the proposed changes would be implemented and what risks they would pose to U.S. troops and to U.S. commitments elsewhere in the world.\nWhite House Press Secretary Josh Earnest indicated the plans could continue to develop, and said the engagement is not a \"short-term proposition.\" He predicted some U.S. military personnel would still be in Iraq when Obama leaves office.\nThe Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Records from government data breach surface on 'darknet,' says expert 2 Bill Clinton contradicts Hillary on email claims 3 Secret Service agent working Michelle Obama event on leave after lewd text claims 4 HHS to Congress on ObamaCare court ruling: It’s your problem 5 EPA calls for regulating emissions from US airliners See all Trends Advertisement", "external_links": [], "published": "2015-06-10T03:00:00.000+03:00", "crawled": "2015-06-11T02:00:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}