{"organizations": ["National Journal", "Senate", "GOP", "Congress", "White House", "APEC"], "uuid": "714ef6f082b71cae8d34b1c5f913daa8ec96f829", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150521154438-obama-mcconell-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/06/24/us/charleston-church-shooting-main/index.html", "country": "US", "title": "Bipartisan trade bill is no sure victory for Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Bipartisan trade bill is no sure victory for Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T01:59:00.000+03:00", "replies_count": 0, "uuid": "b3ffe2144292173b7517e265a4da27d20bc7515c"}, "author": "", "url": "http://edition.cnn.com/2015/06/24/politics/trade-bill-obama-clinton-mcconnell/index.html", "ord_in_thread": 0, "title": "Bipartisan trade bill is no sure victory for Obama", "locations": ["Washington", "U.S.", "Pacific", "Capitol Hill", "Asia", "Japan", "Midwest"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Hillary Clinton", "Mireya Solis", "McConnell", "Obama Key", "Obama"], "text": "Key trade bill passes the Senate 01:12 PLAY VIDEO Privately, there was satisfaction among White House aides that just a few days after many in the media wrote obituaries for Obama's trade agenda and, not for the first time, proclaimed him a lame duck, he was able to wrack up another big victory for presidential power. Had the fast-track provision crashed, U.S. partners in the Pacific, including Japan, would never have accepted tough political concessions on market access required by the TPP and the deal would have died, likely taking U.S. credibility in Asia and Obama's pivot to the region with it. Now, Obama's trade negotiators can pursue a final agreement on a deal involving 12 nations accounting for 40 percent of global GDP that would significantly enhance his political legacy. The deal's survival also means Obama will be at center stage in Washington fighting for a major legislative priority right until the waning months of his second term, at a time when many presidents have already run out of steam and domestic clout. He will have little choice but to wage an intense campaign to convince the American people of the TPP's merits. Still, final passage of any TPP deal is no sure thing -- and not just because Obama will be low on leverage at the end of his mandate. Vote on trade deal could come in 2016 Supporters of the TPP hoped that they could get Congress to sign off on the pact before the notion of global trade gets caught in the inevitable election-year backlash against Wall Street, corporations and low-wage economies overseas that have syphoned jobs from rust belt swing states in the Midwest and elsewhere. But now, lawmakers will be asked to take a tough vote that could expose them to attacks from opponents of the deal. TPP nations may ink a final agreement at a ministerial meeting this summer and could present the deal as the highlight of the Asia Pacific Economic Cooperation (APEC) forum later this year. But there's no guarantee the fragile coalition assembled by Obama and McConnell -- mostly Republican but bolstered by pro-trade Democrats -- will survive. And the clock is ticking. \"I am very doubtful we can have a ratification vote before the end of this year,\" said Mireya Solis, a specialist on Japanese economic policy at the Brookings Institution. \"We are thinking this is going to spill over to 2016 and this opens up all kinds of interesting possibilities.\" READ: How secretive is the Trans-Pacific Partnership? Between now and then, Obama must work hard to repair ties with Democrats on Capitol Hill. More mastery of Senate procedure will also likely be required from McConnell, who secured support for the fast-track authority only after promising to adopt a workers' assistance bill Republicans largely disparaged but Democrats demanded. The wily Senate leader's normal antipathy to Obama's priorities was overcome because Republicans generally still firmly back free trade -- and he was keen to use the fast-track vote to convince voters in 2016 that the GOP has delivered results and deserves to keep its slim Senate majority. \"I've enjoyed working with the president on this issue,\" McConnell said on Tuesday in an incongruous show of warmth, five years after he told National Journal the most important GOP achievement would be \"for President Obama to be a one-term president.\" \"Hopefully, we can find some other things that we can agree on to work on together during his remaining year-and-a-half in office. \" Few in Washington will be holding their breath, given the scorched-earth policy McConnell has adopted towards Obama and the president's own clear disdain for Congress as a whole -- not just the Republicans who run it. Peril for Hillary Clinton While Obama and McConnell can claim a share of the spoils, the big loser could be Hillary Clinton. The debate over fast-track has put Clinton in a dicey political spot given her past support for the TPP, which she once called the \"gold standard\" of trade agreements. Since then Clinton, already facing suspicion among Democratic primary voters about her links to Wall Street and big business, has rowed back -- insisting that Congress should use the fast-track authority as leverage to getting a better TPP arrangement. If a final TPP deal is agreed to, the lengthy ratification process will likely mean Clinton is stuck with the issue through the Democratic primary season. Wherever she comes down on TPP, she would be open to dreaded charges of flip-flopping by Republicans, which could exacerbate questions of trust in her character that have emerged in recent opinion polls. JUST WATCHED", "external_links": [], "published": "2015-06-25T01:59:00.000+03:00", "crawled": "2015-06-25T02:15:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}