{"organizations": ["CNN", "Supreme Court"], "uuid": "c235a6f0e54754a0e95aadf18df7e3766a2d6dee", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/26/politics/obama-calls-gay-marriage-ruling-plaintiff-jim-obergefell/index.html", "country": "", "title": "Obama calls gay marriage case plaintiff - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama calls gay marriage case plaintiff - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T22:05:00.000+03:00", "replies_count": 0, "uuid": "c235a6f0e54754a0e95aadf18df7e3766a2d6dee"}, "author": "", "url": "http://www.cnn.com/2015/06/26/politics/obama-calls-gay-marriage-ruling-plaintiff-jim-obergefell/index.html", "ord_in_thread": 0, "title": "Obama calls gay marriage case plaintiff - CNNPolitics.com", "locations": ["America", "Pennsylvania Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jim Obergefell", "Pamela Brown", "Barack Obama", "Obergefell", "Obama"], "text": "Same-sex marriages begin in Pennsylvania Washington (CNN) Moments after the Supreme Court backed a national right to same-sex marriage, President Barack Obama called the lead plaintiff in the case to congratulate him and thank him for his efforts. \"We're really proud of you,\" Obama could be heard saying over speaker phone, while plaintiff Jim Obergefell was being interviewed by CNN's Pamela Brown on the steps of the Supreme Court. \"Just know that, you know, not only have you been a great example for people, but you're also going to bring about a lasting change in this country. And it's pretty rare where that happens. So I couldn't be prouder of you and your husband. God bless you.\" Visibly flustered, Obergefell expressed his appreciation for Obama's support. \"I really appreciate that, Mr. President. It's really been an honor for me to be involved in this fight and to have been able to, you know, fight for my marriage and live up to my commitments to my husband,\" he said. Minutes later, Obama gave more official remarks celebrating the ruling from the White House Rose Garden. All Americans must have equal opportunities under the law for true equality to exist in this country, he said. \"If we are truly created equal than truly the love we commit to one another must be equal as well,\" Obama said. \"This ruling will strengthen all of our communities by offering to all same sex couples the dignity of marriage across this great land.\" Friday's ruling made the law fall in line with many Americans existing values, the President said. \"This decision confirms what millions of Americans already believe in their hearts,\" he said. \"It's a victory for the allies friends and supporters that worked for years praying for change to come.\" The President took time to list his administration's accomplishments for gay rights -- but acknowledged that the fight on behalf of the gay community has not been without its bumps. \"Progress on this journey often comes in small increments sometimes two steps forward one step back,\" he said. \"Sometimes there are days like this where that slow steady effort is rewarded with justice.\" Obama acknowledged all of those who have fought for gay rights who are no longer alive to witness this day. \"Those countless often anonymous heroes deserve our thanks. They should be very proud. America should be very proud,\" he said. He challenged those who are encouraged by this ruling to reach back to those who do. \"Those who have come so far on their journey to equality have a responsibility to reach back and help others on their journey,\" he said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-06-26T22:05:00.000+03:00", "crawled": "2015-06-26T22:06:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}