{"organizations": ["Fox News GOP", "GOP", "Facebook", "Twitter"], "uuid": "8c02def3110091df0f4727283033e02510634398", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/062315_an_herridge_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/06/26/gop-lawmakers-ask-obama-to-fire-opm-chief-after-massive-data-breach/", "country": "", "title": "GOP lawmakers call on Obama to fire OPM chief after massive data breach | Fox News", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "GOP lawmakers call on Obama to fire OPM chief after massive data breach | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T23:10:00.000+03:00", "replies_count": 0, "uuid": "8c02def3110091df0f4727283033e02510634398"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/26/gop-lawmakers-ask-obama-to-fire-opm-chief-after-massive-data-breach/", "ord_in_thread": 0, "title": "GOP lawmakers call on Obama to fire OPM chief after massive data breach | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "GOP lawmakers call on Obama to fire OPM chief after massive data breach Published June 26, 2015 Facebook 0 Twitter 0 livefyre Email Print \nWASHINGTON – House Oversight and Government Reform Committee Chairman Jason Chaffetz, along with 17 other Republican lawmakers, on Friday called on President Obama to fire the embattled officials whose agency fell victim to a massive hack exposing federal employee data and security clearance information. \nEchoing statements he recently made at a House hearing, Chaffetz and the other lawmakers blamed Katherine Archuleta, director of the Office of Personnel Management, for the breach that’s been described as one of the worst in U.S. history. Chief Information Officer Donna Seymour should also be dismissed, the letter states . \n“Simply put, the recent breach was entirely foreseeable, and Director Archuleta and CIO Donna Seymour failed to take steps to prevent it from happening despite repeated warnings,” the two-page letter states. \nOfficials are still exploring the extent of the breach. Though it was initially reported that about 4 million people were affected, lawmakers have since been told a pair of hacks are expected to affect at least 18 million -- and as many as 30 million. \nAccording to the Inspector General’s FY 2014 audit, 11 out of 47 major information systems at OPM lacked proper security authorization. Five of those systems were under Seymour. \n“Ms. Seymour acknowledged in the hearing the risks inherent in operating systems without valid authorizations, yet continued to defend her decision to ignore the Inspector General and operate important systems without authorizations in place,” the letter stated. “That decision alone is, in our opinion, disqualifying.” \nAt a recent House hearing, Chaffetz, R-Utah, told Archuleta he had no confidence in her ability to lead the agency. \n“I think you are part of the problem,” Chaffetz said. “That hurricane has come and blown this building down, and I don’t want to hear about putting boards up on windows (now). It’s time for you to go.” Advertisement ", "external_links": [], "published": "2015-06-26T23:10:00.000+03:00", "crawled": "2015-06-26T23:12:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}