{"organizations": ["Fox News Latino Immigration"], "uuid": "2b04edbad224100d0c70443982e2e1d0dca95eaa", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/cecilia%20munoz%202.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/12/immigration-lawyers-group-bitterly-divided-over-cecilia-munoz-pick-as-keynote/", "country": "", "title": "Immigration lawyers group bitterly divided over Cecilia Muñoz's pick as keynote speaker | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration lawyers group bitterly divided over Cecilia Muñoz's pick as keynote speaker | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T22:29:00.000+03:00", "replies_count": 0, "uuid": "2b04edbad224100d0c70443982e2e1d0dca95eaa"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/12/immigration-lawyers-group-bitterly-divided-over-cecilia-munoz-pick-as-keynote/", "ord_in_thread": 0, "title": "Immigration lawyers group bitterly divided over Cecilia Muñoz's pick as keynote speaker | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cecilia Muñoz"], "text": "Immigration lawyers group bitterly divided over Cecilia Muñoz's pick as keynote speaker Published June 12, 2015 Fox News Latino Cecilia Muñoz, director of the White House Domestic Policy Council, in a 2012 file photo. Getty \nMore than a dozen members of the American Immigration Lawyers Association (AILA) are demanding that White House official Cecilia Muñoz be dropped as the keynote speaker for the group's annual conference next week. \nThey claim Muñoz, who is the White House Domestic Policy Council Director, represents an administration whose policies have been hostile and harmful to immigrants. \nBut AILA Executive Director Crystal Williams said on an online posting that she will keep Muñoz as the keynote speaker at the conference, which is scheduled to take place from June 17 to June 20. \nMuñoz often has been the target of backlash by immigrant advocacy groups angry over the Obama administration’s record number of deportations, as well as moves to expedite the removal of unaccompanied minors who have come by the thousands from Central America back to their homelands. Her critics say she is often an apologist or defender for administration policies that take an excessively hard line against immigrants. \n\"[Muñoz is] one of the principal architects of shocking, widespread, and ongoing human rights violations against vulnerable children fleeing Central America. As such, she should not be elevated or rewarded with the most prominent speech at AILA’s annual conference,\" read the letter authored by ALIA members Bryan S. Johnson and Ala Amoachi and signed by 17 other attorneys. \n\"Ms. Muñoz has fully backed President Obama’s multi-pronged policy to prevent Central American children from escaping death, severe bodily or mental harm, and rape,\" it continued. \nMuñoz, the letter said, \"is directly responsible for causing children to suffer severe and prolonged physical and mental harm in detention centers in Artesia, New Mexico; Leesport, Pennsylvania; Karnes City, Texas; and Dilley, Texas.\" \nIn her response, Williams said keynote speakers are not meant to be chosen based on popularity, but on their positions and responsibilities in government, particularly in relation to immigration issues. \n“So, no, we will not be disinviting Ms. Muñoz,” ALIA's director wrote. “We will have her come and speak to our conference. We will behave professionally, but we will also challenge her to account for the Administration’s actions. Our mission as an organization requires no less.” \n“What matters is that she holds senior office in the White House, and thus can stand in front of a room of immigration lawyers and speak for the White House,\" she wrote, adding: \"And the White House must be held accountable for what it has done.” \nLike us on Facebook ", "external_links": [], "published": "2015-06-12T22:29:00.000+03:00", "crawled": "2015-06-12T22:58:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}