{"organizations": [], "uuid": "dc01cd948434435049d94c4b2b9b02c0c962fc7a", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/24/white-house-blames-white-male-resentment-for-obama-failures-on-guns-race/", "country": "US", "title": "White House blames white male resentment for Obama failures on guns, race", "performance_score": 5, "site": "foxnews.com", "participants_count": 26, "title_full": "White House blames white male resentment for Obama failures on guns, race | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T03:00:00.000+03:00", "replies_count": 30, "uuid": "552fa4757e812293f1f8d84e79b06cddf70e54cd"}, "author": "Chris Stirewalt", "url": "http://www.foxnews.com/politics/2015/06/24/white-house-blames-white-male-resentment-for-obama-failures-on-guns-race/#post-0", "ord_in_thread": 0, "title": "White House blames white male resentment for Obama failures on guns, race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Chris Stirewalt\nPublished June 24, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print **Want FOX News First in your inbox every day? Sign up here. **\nBuzz Cut:\n• White House blames white male resentment for Obama failures on guns, race\n• ‘Clinton Cash’ author goes nuclear over Hillary uranium claim\n• Pence ‘will not comply’ with Obama EPA regs\n• Media stumbles over Jindal’s Indian heritage\n• What did you expect? KFC?\nWHITE HOUSE BLAMES WHITE MALE RESENTMENT FOR OBAMA FAILURES ON GUNS, RACE\nIt is perfectly emblematic of the empty, hashtagging political era that the primary role of government after a mass murder would be as a semiotic interpreter for the nation.\nAs governor of Arkansas, Bill Clinton celebrated his state’s Confederate heritage with a special star in his state’s flag. Now his wife is running for president as an ardent foe of Confederate remembrance. The GOP consensus of 20 years ago was that the display of the Confederate battle flag was up to the ones displaying it. Now they are falling over each other to denounce its public display.\nNone of it makes much difference in the lives of Americans or on the question of good governance.\nThese are things that politicians do not as part of leadership but of followership – public cues intended to show voters that a candidate is “one of them.” But they do not do much to shape outcomes. Quite the opposite. These are things you do when you can’t do anything real.\nIs racism a problem in America? Not nearly what it was, but of course it is. Is it something that the federal government is going to be able to remedy? Not a chance. Are mass killings, regardless of the ideological fixation of the killer, an ongoing problem? America ranks fourth in the world for mass-shooting fatalities, so there’s certainly a problem. Is it likely to be fixed by legislation? Almost certainly not.\nSo what’s with all the focus on the flag?\nWe get an insight into the thinking of the president and his party from a WaPo piece on his many frustrations with his administration’s failures on gun control and race relations:\n“‘If you are a white man in America, this country is changing dramatically. You have always been in charge,’ said a senior administration official who spoke on the condition of anonymity [to] be candid. ‘So there is something to white men feeling like something has been taken away from them.’”\nNot one in 1,000 white males cares about the presence of a Confederate war monument on the grounds of the South Carolina statehouse. Not one in 1 million would share the racist worldview of the Charleston killer. The overwhelming majority are focused on keeping themselves and their families afloat in the face of enormous challenges.\nBut focusing on them as villains is revealing and attributing the resistance to gun control and other issues as a personal response to Obama’s African heritage is an unintentionally damning revelation.\nThere’s nothing the president can do about the real issues, so finding and blaming a boogeyman becomes job one.\nCulture mulchers - “This generation seems to excel at inventing controversies, weighing in on those invented controversies, and then patting itself on the back for being so courageous and open-minded.” – The Federalist’s Mollie Hemingway in a column .\nGun control backers plot path - How will efforts to revive gun-control legislation fare? Sens. Joe Manchin , D-W.Va., and Pat Toomey , R-Pa., tell WaPo they’re going to try again on some kind of expanded background check legislation… very carefully.\n‘CLINTON CASH’ AUTHOR GOES NUCLEAR OVER HILLARY URANIUM CLAIM\nHillary Clinton whiffed in her first-ever response to allegations that she authorized a deal that transferred control of a fifth of U.S. uranium production to Russia to benefit one of her family’s largest patrons. And the author of the book that makes the corruption claim is calling her out today in a NYP op-ed . Author Peter Schweizer writes that Clinton’s claim to have been ignorant of the deal is either “grave incompetence or brazen dishonesty.”\n[Clinton has fundraisers in New York today including a concert at the Plaza Hotel featuring performers Tony Bennett and Lady Gaga .]\nLinc and Jeb played preppy ping pong - Chafee went to high school with another presidential candidate former Gov. Jeb Bush , R-Fla. In an interview with the Skimm, Chafee said about Bush , “We had some spirited games of Ping-Pong and our paths have not crossed much since high school, but I think we still consider each other friends.”\nOBAMA SOFTENING HOSTAGE POLICY\nUsing executive orders and a presidential directive, President Obama will announce sweeping changes today in U.S. policy that will allow the government to communicate and negotiate with hostage takers. In a speech, the president will also say that the U.S. will no longer threaten criminal prosecutions against American families who attempt to contact and pay ransoms to extremist groups holding their relatives hostage. The moves are part of a long-awaited policy review in response to the death of U.S. hostages held by ISIS and other militant groups. Obama is quickly coming under fire , with critics claiming the policy overhaul will give terrorists an incentive to kidnap.\n“This doesn’t fix anything, this doesn’t fix a thing…I mean, you’re going to have to have the government now facilitating payments from the families here to the terrorists there, while at the same time we have troops on the ground in Iraq and Syria fighting the same people that we’re paying money to.” – Rep. Duncan Hunter , R-Calif., on “Fox and Friends”\nUntold Stories - Detailing the stories that have prompted the White House’s change in U.S. hostage policy, The New Yorker’s Lawrence Wright writes “Five Hostages: Families whose children were held captive in Syria felt that U.S. officials had abandoned them. So they secretly joined forces.”\n[ Watch Fox: Megyn Kelly has an exclusive interview with the woman who was nearly beheaded in an Oklahoma food plant last year. After avoiding the media spotlight for nearly a year, she tells her story to Megyn tonight on “The Kelly File” at 9 p.m. ET .]\nSENATE SET TO PASS OBAMA TRADE MEASURE TODAY\nAfter weeks of machinations the Senate is expected to vote on and pass President Obama ’s long sought trade authority today. The final package will then go to the president’s desk. Fox News : The Senate voted [Tuesday], 60-37, to cut off debate and move toward a final vote. The result is a big win for the White House and Republican congressional leaders who allied with the president on the package -- an issue that has created unusual alliances and stirred deep tensions within the Democratic caucus. The bill itself would allow Obama to obtain ‘fast track’ authority on trade deals, which would let him negotiate deals that Congress can ratify or reject, but not change. He wants that power to move the so-called Trans-Pacific Partnership with Japan, Mexico, Canada and several other countries.\nWarren says it’s a raw deal - In a Boston Globe OpEd, Sen. Elizabeth Warren , D-Mass., says flawed enforcement mechanisms in trade deals like TPA make corporations big winners and workers losers: “America’s current trade policy makes it nearly impossible to enforce rules that protect hard-working families, but very easy to enforce rules that favor multinational corporations.”\n[ Watch Fox: Chief Congressional Correspondent Mike Emanuel tracks the multi-part trade deal as part one hits the Senate today. ]\nEx-Im’s thorny patch - WashEx’s David Drucker details how Texas Sen. Ted Cruz ’s about-face vote on trade spotlights a GOP split on the Export-Import Bank and how the little-known federal commercial lender is riling up the party’s base.\n[ Watch Fox: Sen. Ted Cruz , R-Texas, takes the center seat and takes questions from the All-Star Panel tonight on “Special Report with Bret Baier ” at 6 p.m. ET. ]\nSuits them - After a long-unanswered FOIA request to the Export-Import Bank from watchdog group Cause of Action, a spokeswoman for the group says it will file a legal complaint today.\nHAGAN OUT, DEMS STILL SEARCHING FOR N.C. SENATE PICK\nRoll Call: “Former North Carolina Sen. Kay Hagan will not be mounting a challenge to her former GOP colleague, Sen. Richard M. Burr . Hagan, who was defeated by Thom Tillis in 2014, has been making calls to inform donors she will not be running for the seat that comes up in 2016, two sources familiar with the calls told Roll Call.”\nWITH YOUR SECOND CUP OF COFFEE…\nTrends like overalls and neon are making a comeback, but it’s an obscure item that is really tugging at the heartstrings of millennials. A paper cup with a turquoise and purple design (if you’re scratching your head wondering what this design looks like click here for your aha moment) drove reporter Thomas Goulney of the Springfield, Mo. News-Leader to find out the origin of this famous design . Gina Ekiss , a Missouri native, was working in the design department at a local plant in 1987 after graduating from school. The plant needed a new ambiguous design that could still look good if the machines messed up the pattern, and was appropriate for both parties and hospitals. Ekiss went to work picking her two favorite colors, purple and teal, and calling the design ‘Jazz.’ When she left the company in 2002 Ekiss was told her design was the ‘top-grossing stock design’ in history.\nGot a TIP from the RIGHT or the LEFT ? Email FoxNewsFirst@FOXNEWS.COM\nPOLL CHECK\nReal Clear Politics Averages\nObama Job Approval: Approve – 44.4 percent//Disapprove – 50.9\nDirections of Country: Right Direction – 28.2 percent//Wrong Track – 63.0 Percent\n[ Watch Fox: New Fox News poll results on the 2016 presidential primaries with head to head matchups, questions on Hillary Clinton’s trustworthiness and the Iran nuclear deal. All out tonight on “Special Report with Bret Baier ” at 6 p.m. ET ]\nFIRST IN FOX NEWS FIRST: PENCE ‘WILL NOT COMPLY’ WITH OBAMA EPA REGS\nIndiana Gov. Mike Pence will announce today his intention to not comply with new EPA clean air regulations if implemented as drafted. The Indiana Republican’s team tells Fox News First, he will make his intentions known in a speech today in Evansville, the heart of coal country. Pence is the first governor to say his state will not comply with the new rules, which he calls “ill-conceived and poorly constructed.” In a letter to President Obama , Pence writes: “My administration continues to believe the plan should be withdrawn because it will raise electricity costs on Hoosiers, result in less reliable electricity and impede economic growth and prosperity in Indiana and the rest of the country. If your administration proceeds to finalize the Clean Power Plan, and the final rule has not demonstrably and significantly improved from the proposed rule, Indiana will not comply. Our state will also reserve the right to use any legal means available to block the rule from being implemented.”\nMEDIA STUMBLES OVER JINDAL’S INDIAN HERITAGE\nWashEx: “Louisiana Gov. Bobby Jindal has assimilated to American culture so well that there’s barely a trace of his Indian heritage left, a Washington Post article suggested Tuesday. ‘Jindal’s status as a conservative of color helped propel his meteoric rise in the Republican Party — from an early post in the George W. Bush administration to two terms in Congress and now a second term as Louisiana governor — and donors from Indian American groups fueled his first forays into politics…Yet many see him as a man who has spent a lifetime distancing himself from his Indian roots,’ the [WaPo] report added. The governor’s office was unimpressed with the Post’s many insinuations…Jindal spokesman Kyle Plotkin told the Washington Examiner’s media desk. ‘Liberals are fixated on race…Governor Jindal is proud of his heritage. He believes we need to stop fixating on race and hyphenated Americans. We are all Americans,’ he said.”\nPelican dive - NPR: “Though [Jindal’s] approval ratings in the Bayou State have dropped dramatically amid budget fights, he has still tried to keep a high national profile by hitting the cattle-call circuit to build up his White House chances. Jindal’s best shot at catching fire in 2016 is to appeal to religious conservatives, especially in the early states of Iowa and South Carolina. But that's a crowded space this time around.”\n[ Watch Fox: Chief Political Correspondent Campaign Carl Cameron reports on Jindal’s announcement from Louisiana. ]\nFaith a tricky topic for Jeb in New Hampshire - National Journal: “Bush said he would wait to read [Pope Francis ’ encyclical on climate change] before commenting further. And then he added: ‘I think religion ought to be about making us better as people and less about things that end up getting into the political realm.’ That line drew loud and sustained applause—which was unsurprising, given the famously secular makeup of New Hampshire's electorate. (Only 24 percent of its residents described themselves as ‘very religious’ in a 2014 Gallup survey, making it the second-least religious state behind Vermont.) … Bush’s remark, a political winner in New Hampshire, ran counter to his record in Florida—where he established a blueprint for faith-based governing by repeatedly intervening where he saw a moral imperative at stake…[Bush] invested significant political capital in the losing fight to keep Terri Schiavo alive—an effort that flowed, he acknowledged, from his Catholic worldview.”\nWalker signs new gun laws lifting restrictions - WaPo: “Wisconsin Gov. Scott Walker (R) plans to sign two new laws on Wednesday that expand the rights of gun owners by removing a 48-hour waiting period for those looking to purchase a firearm and allowing off-duty or retired police officers to carry concealed weapons at public schools. This action will come one week after a suspected gunman shot and killed nine people in an African American church in South Carolina, yet again prompting a national discussion about gun laws in the U.S.”\nRubio helps passage of trade - Tampa Bay Times: “Florida Sens. Bill Nelson and Marco Rubio helped a key trade bill clear a hurdle today, setting it up for final passage. Both faced opposition. Nelson was facing pressure from liberals and employee unions to oppose the deal for fear of hurting jobs and wages in the U.S. Rubio was urged to oppose the deal from at least one tea party group in Florida.”\nPawn star says Rubio ‘good investment’ - Team Rubio released a video featuring reality television star Rick Harrison from the show Pawn Star with his endorsement.\nChristie hits a new low - Asbury [New Jersey] Park Press: “Gov. Chris Christie ’s approval rating is down to a new low in the latest public-opinion poll…Results released by Fairleigh Dickinson University show that 30 percent of New Jersey registered voters approve of the job Christie is doing and 55 percent disapprove. That's down from 36 percent approving and 50 percent disapproving in the FDU PublicMind poll in April.”\nKasich says he will hit Iowa after all - Des Moines Register: “[Indiana Gov. John Kasich ] so far has ignored Iowa, instead saying his likely White House bid will hinge on whether he can secure a victory in New Hampshire, the Cincinnati Enquirer has reported. ‘It has yet to be decided as to how much we'll put into Iowa,’ he said. ‘But I’m coming to Iowa because I want to show respect to the people of Iowa.’ A recent Iowa Poll shows a majority of likely GOP caucusgoers — 59 percent — don't know enough about Kasich to form an opinion of him.”\n[Kasich has events in Des Moines and Council Bluffs, Iowa, today.]\nSpeaking of polls - A Suffolk University poll of New Hampshire GOP voters puts Donald Trump in second place behind Jeb Bush. Among those who identified as ‘conservative’ Trump tops the list as their choice nominee, while Bush crushes those who identify as ‘moderate.’ Trump moves back down to the bottom, however, when asked who should be on the debate stage in August coming in 11 th place behind former Sen. Rick Santorum , R-Pa.\nTHE JUDGE TAKES THE DAILY SHOW\nFox News Senior Judicial Analyst Judge Andrew Napolitano hits the “The Daily Show” with host Jon Stewart tonight. The Judge is there to discuss his new book “Suicide Pact,” which traces national security’s roots from the American Revolutionary War until the present day. Check back tomorrow for a clip.\nWHAT DID YOU EXPECT? KFC?\nThe [Lakeland, Fla.] Ledger: “ Eliut Juse Serrano Hernandez , 38, of Winter Haven was arrested Monday after a delivery driver called the Polk County Sheriff's Office to anonymously report witnessing a rooster fight Friday…‘We really appreciate this pizza delivery driver calling us. Frankly, I can’t understand why someone would ask for a pizza delivery during an ­illegal cock-fight,’ Sheriff Grady Judd said in a news release today’…Deputies found a cockfighting ring, with feathers inside from previous fights, and a table used to trim off rooster spurs, Wilder said. In a refrigerator, deputies found bottles of medication from Mexico that were clearly marked for rooster fighting. They also found plastic rooster boxing gloves, used to cover the rooster's spurs and train the bird to fight without inflicting injury, and several ceramic spurs.”\nAND NOW A WORD FROM CHARLES…\n“The Chinese response is to say the premier said, decision makers in both countries must always remember confrontation is a negative sum game. In other words, you challenge us, you make us responsible, we’re going to challenge you and we’re going to hit you back. Who is the dominant superpower here and who is the supplicant? The weakness of this response is simply astonishing.” – Charles Krauthammer on “Special Report with Bret Baier ” Watch here.\nChris Stirewalt is digital politics editor for Fox News. Want FOX News First in your inbox every day? Sign up here.\nChris Stirewalt joined Fox News Channel (FNC) in July of 2010 and serves as digital politics editor based in Washington, D.C. Additionally, he authors the daily \"Fox News First” political news note and hosts “Power Play,” a feature video series, on FoxNews.com. Stirewalt makes frequent appearances on the network, including \"The Kelly File,\" \"Special Report with Bret Baier,\" and \"Fox News Sunday with Chris Wallace.” He also provides expert political analysis for Fox News coverage of state, congressional and presidential elections.\n Politics 1 Enriching the Enemy? Administration under fire for opening door to terror ransoms 2 Alabama governor orders Confederate flags removed from state Capitol grounds 3 Senators reportedly considering new gun control push after Charleston shooting 4 White House blames white male resentment for Obama failures on guns, race 5 Editor says he owes GOP sources ‘an apology’ after new Gruber emails See all Trends Advertisement", "external_links": ["https://urldefense.proofpoint.com/v2/url?u=http-3A__www.washingtonexaminer.com_cruz-2Ddeepens-2D2016-2Dtrade-2Dsplit_article_2566899&d=BQMFaQ&c=cnx1hdOQtepEQkpermZGwQ&r=3EWdtrsignpzHoDaQBozcy5mFVVJzlZzT9gshzwbjIA&m=nAyny3oddf0xseRFrzr6q06Yt_EFU0z4l2iYKei0DNM&s=0kKXb15v9cLTRWbQhzT2jyXBgJA79D8gX1wnev9UZwg&e=", "https://www.google.com/search?q=jazz+dixie+cup&espv=2&biw=1280&bih=935&tbm=isch&imgil=-14w0wJzfOu0FM%253A%253Bx4drTxiNowMWRM%253Bhttp%25253A%25252F%25252Fwww.amazon.com%25252FR10NN-00055-Design-Treated-Coated-Paper%25252Fdp%25252FB0040ZP376&source=iu&pf=m&fir=-14w0wJzfOu0FM%253A%252Cx4drTxiNowMWRM%252C_&usg=__20psQBiWZLE3y5QZSNd9qveFQHU%3D&ved=0CDAQyjc&ei=y6aKVYvjO4qwggT4wIK4Bw#imgrc=-14w0wJzfOu0FM%253A%3Bx4drTxiNowMWRM%3Bhttp%253A%252F%252Fecx.images-amazon.com%252Fimages%2", "http://thefederalist.com/2015/06/23/congratulations-you-oppose-the-confederate-flag-now-what/", "http://www.bostonglobe.com/opinion/2015/06/23/warren/CJluXWm4B5VDTdUDsCkwEL/story.html", "http://www.tampabay.com/blogs/the-buzz-florida-politics/bill-nelson-and-marco-rubio-vote-to-advance-obama-trade-bill/2234738", "http://www.wmur.com/politics/hillary-clinton-facing-questions-over-involvement-in-uranium-one-sale/33737328", "http://www.theledger.com/article/20150623/newschief/150629775?p=1&tc=pg", "http://www.desmoinesregister.com/story/news/elections/presidential/caucus/2015/06/23/john-kasich-coming-iowa-want-show-respect/29191257/", "http://www.app.com/story/news/politics/new-jersey/chris-christie/2015/06/23/chris-christie-fdu-poll/29149881/", "http://www.washingtonpost.com/blogs/post-politics/wp/2015/06/24/scott-walker-to-sign-legislation-expanding-gun-rights-in-wisconsin/", "http://www.newyorker.com/magazine/2015/07/06/five-hostages", "http://www.npr.org/sections/itsallpolitics/2015/06/24/416990332/5-things-you-should-know-about-bobby-jindal", "http://www.washingtonpost.com/politics/obama-after-charleston-from-anger-to-regret/2015/06/23/179971a6-19aa-11e5-ab92-c75ae6ab94b5_story.html?hpid=z1", "http://www.nationaljournal.com/2016-elections/is-jeb-bush-deliberately-downplaying-his-faith-in-new-hampshire-20150623", "http://www.washingtonexaminer.com/not-much-indian-left-in-bobby-jindal-the-washington-post-explores/article/2566872", "http://atr.rollcall.com/kay-hagan-wont-challenge-richard-burr-2016/", "http://nypost.com/2015/06/22/clinton-cash-author-demolishes-hillarys-self-defense/", "http://www.theskimm.com/skimm-your-candidate/lincoln-chafee", "http://www.news-leader.com/longform/news/local/ozarks/2015/06/17/internet-looking-designed-cup-springfield/28881969/", "https://www.suffolk.edu/news/60149.php", "http://www.washingtonpost.com/news/powerpost/wp/2015/06/23/manchin-toomey-both-interested-in-reviving-gun-control-push/", "http://www.youtube.com/watch?v=txUo5wFveas"], "published": "2015-06-24T03:00:00.000+03:00", "crawled": "2015-06-24T20:05:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}