{"organizations": ["ISIS", "CIA"], "uuid": "1d3801e6f07eccb83c6f57505d9c1f16dafc491b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/crumptonhenry_070914getty.jpg.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/policy-strategy/243694-former-cia-spy-obama-doing-lousy-job-in-fight-against-isis", "country": "", "title": "Former CIA spy: Obama doing ‘lousy job’ in fight against ISIS | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Former CIA spy: Obama doing ‘lousy job’ in fight against ISIS | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T19:28:00.000+03:00", "replies_count": 0, "uuid": "1d3801e6f07eccb83c6f57505d9c1f16dafc491b"}, "author": "", "url": "http://thehill.com/policy/defense/policy-strategy/243694-former-cia-spy-obama-doing-lousy-job-in-fight-against-isis", "ord_in_thread": 0, "title": "Former CIA spy: Obama doing ‘lousy job’ in fight against ISIS | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kristina Wong", "Obama"], "text": "Former CIA spy: Obama doing ‘lousy job’ in fight against ISIS By Kristina Wong - 06/02/15 06:00 AM EDT \nHenry “Hank” Crumpton, the former CIA official who led a covert team of operators in Afghanistan after 9/11, believes the Obama administration is doing a “lousy job” in the fight against the Islamic State in Iraq and Syria (ISIS). \n“I don’t think they understand the kind of war they need to fight,” Crumpton told The Hill in a recent interview. \n“They’re waging the war they want to fight but not the one that will lead to success.” \n“It’s very safe politically; they want to control everything in Washington,” said the 58-year-old former spy who says he was able to mastermind the overthrow of the Taliban in 90 days after 9/11. \nCrumpton, who joined the CIA in 1981 and spent nearly a quarter century fighting terrorism, advocates a field-based approach to fighting terrorists, rather than the risk-averse, Washington-centric approach pursued today. \nHe believes that getting more intelligence agents out in the field and empowering local Iraqi communities is crucial to defeating ISIS. \n“You have to have an intelligence presence on the ground. It really is a question of deep intelligence and empathy.” \nThat way, you can understand and undermine the enemy strategy, and not just attack the enemy on the battlefield, said Crumpton, who served as deputy director of the CIA Counterterrorism Center from 1999 to 2001. \nThe Obama administration is currently pursuing a political and military strategy that’s centered on empowering the Shia-dominated central government in Baghdad to fight ISIS. \nTo that end, it’s routing all military assistance through the central government and refraining from training or equipping Sunnis and Kurds out of concern that could lead to sectarian war. \nCrumpton said that strategy “does not reflect reality on the ground.” \n“We want to wage a war and have engagement in a diplomatic sense with Baghdad,” he said, but the idea that Iraq is a “functioning, viable sovereign state is a fiction.” \n“I can understand the reluctance to undermine the concept of Iraq as a nation, [but] we’ve allowed the enemy to gain traction,” he said. \n“We are in a defensive crouch, trying to counter their message. [We need to] counter what they’re doing on the ground.” \nCrumpton has formulated his views on how to fight terrorism over roughly a decade of overseas assignments with the CIA. He’s also served as chief of the CIA’s secretive National Resources Division. \nCrumpton believes the fight against ISIS requires boosting intelligence assets on the ground and empowering local communities, but also empowering U.S. officials overseas. \n“What works is when we’ve had good leadership overseas, with the authorities and the resources and the political backing to do the job,” said Crumpton, who also served at the rank of ambassador-at-large and as the State Department’s coordinator for counterterrorism. \nHe cites successful efforts against Jemaah Islamiyah in Southeast Asia and against the Revolutionary Armed Forces of Colombia. Another example he cites is the effort he spearheaded in Afghanistan against al Qaeda in 2001 and 2002. \n“That was an extreme case of a field bias, where we selected some terrific team leaders working with [Gen.] Tommy Franks, and then [Joint Special Operations Command], and that worked,” he said. \nAnd to some degree, the surge in Iraq is another example, he said. Retired Gen. David Petraeus’s “force of personality” helped but so did the fact that he was given the “authorities and resources to do the job.” \nA “bad case” of empowering American diplomats is reflected in 2012 attacks in Benghazi, Libya, he said. \n“Why in the world would you have a U.S. ambassador even having to ask for extra security or even having a discussion about it? Why wouldn’t he have the resources and the authority to make that decision?” he asked. “Yet you’ve got D.C. awash in defense funding.” \nCrumpton said the tendency to find Washington-centric counterterrorism strategies is not necessarily unique to the Obama administration but is a symptom of the “national security establishment.” \nFor example, he said, the Bush administration created new agencies in Washington after 9/11, including the Office of the Director of National Intelligence, the National Counterterrorism Center and the Department of Homeland Security. \nHe believes there is a general misunderstanding of intelligence by policymakers across the political spectrum, which prompted him to write a best-selling book in 2012, The Art of Intelligence . \nBut Crumpton does fault the Obama administration for plenty of things. \n“Our credibility has been eroded since the president did not adhere to the line in the sand for [President Bashar] Assad,” he said, referring to the president’s last-minute decision in 2013 not to conduct airstrikes against the Syrian regime for using chemical weapons. \n“That really was a watershed moment. I had several foreign friends, senior officials in allied governments, just express, first disbelief then disgust,” he said. “Their reaction to that was, was really I think enduring. That hasn’t gone away.” \nHe also said the administration’s decisions to shutter embassies in Libya and Yemen has also hurt the U.S.’s credibility. \nNot only does it hurt U.S. on intelligence collection, working with local populations and military programs dependent on embassies, it broadcasts a message of retreat to U.S. enemies, he said. \n“They believe that we’re in retreat, and that’s had an impact on the battlefield. That’s how ISIS has gained so much traction — a narrative of gains on the battlefield and in cyberspace,” he said. \n“I give the president credit for the [Osama] bin Laden raid … but if you look where ISIS is and you look at al Qaeda, they are far from defeated. They are taking advantage of this narrative of success.” \nCrumpton, who left government eight years ago and is now the president of the Crumpton Group, remains a part of the counterterrorism discussion and continues to impress upon Washington the importance of intelligence in the field. \n“In this type of war, the value of intelligence will continue to grow, and not merely to find or kill targets. Intelligence provides a map of the human terrain, helps illuminate and develop alliances, and informs decisions about enduring political solutions,” he wrote in a February op-ed in The Wall Street Journal . \nFor Crumpton, the consequences couldn’t be clearer. \n“When 9/11 happened, we had 100 clandestine sources throughout Afghanistan. We had built those networks,” he said. “Now, in comparison, we had two predator drones in the air in Benghazi.” ", "external_links": [], "published": "2015-06-02T19:28:00.000+03:00", "crawled": "2015-06-02T19:28:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}