{"organizations": [], "uuid": "ae14a72fd7f5f117b917828c1acc0933232bcba1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3038098/images/o-JOHN-CUSACK-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/05/john-cusack-obama-worse-than-bush_n_7520366.html", "country": "", "title": "John Cusack's Comments On Obama Being 'Worse Than Bush' Taken Out Of Context", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "John Cusack's Comments On Obama Being 'Worse Than Bush' Taken Out Of Context", "spam_score": 0.0, "site_type": "news", "published": "2015-06-06T03:45:00.000+03:00", "replies_count": 0, "uuid": "ae14a72fd7f5f117b917828c1acc0933232bcba1"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/05/john-cusack-obama-worse-than-bush_n_7520366.html", "ord_in_thread": 0, "title": "John Cusack's Comments On Obama Being 'Worse Than Bush' Taken Out Of Context", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Cusack", "Bush", "Obama"], "text": "reddit \nDon't believe the headlines. \nIn a wide-ranging interview with the Daily Beast to promote his new film \"Love & Mercy,\" John Cusack said that, in some ways, on matters of national security and foreign policy, President Barack Obama is actually \"worse than [George W.] Bush.\" \nBut headlines sparked by the interview oversimplified and distorted his statements. Here are a few examples: Fox News: John Cusack: President Obama is 'as bad or worse than' George W. Bush \nRaw Story : John Cusack: Obama is worse than Bush and more conservative than Nixon \nThe Guardian: John Cusack: Barack Obama is 'as bad or worse' than George W Bush \nHere's the full context of what Cusack said: \nWell, Obama has certainly extended and hardened the cement on a lot of Bush’s post-9/11 Terror Inc. policies, so he’s very similar to Bush in every way that way. His domestic policy is a bit different, but when you talk about drones, the American Empire, the NSA, civil liberties, attacks on journalism and whistleblowers, he’s as bad or worse than Bush. He hasn’t started as many wars, but he’s extended the ones we had, and I don’t even think Dick Cheney or Richard Nixon would say the president has the right to unilaterally decide whom he can kill around the world. On Tuesdays, the president can just decide whom he wants to kill, and you know, since 9/11 there are magic words like “terror,” and if you use magic words, you can justify any power grab you want. \nJohn Cusack attends Official Academy Screening of \"Love & Mercy\" hosted by The Academy of Motion Picture Arts and Sciences at The Academy Theatre at Lighthouse International on Thursday in New York City. (Photo by Rob Kim/Getty Images for The Academy of Motion Picture Arts and Sciences) \nThose comments are far less controversial and have been voiced by various journalists and commentators for years. \nAmong other things, Obama's national security critics point to the president's vast expansion of drone strikes, his decision to order the death of an American citizen without a trial, his unprecedented prosecution of leaks and his decision to launch a military campaign in Iraq and Syria that, White House officials said, will last at least three years. \nCusack responded to the misleading headlines on Twitter: the headlines are full of shit - https://t.co/07peDBENAh \n— John Cusack (@johncusack) June 4, 2015 \nA representative for Cusack did not immediately return a request for comment from The Huffington Post. \nCusack arrives at the premiere of 'Love & Mercy' during the 2015 SXSW Music, Film + Interactive Festival at the Paramount Theatre on March 15 in Austin, Texas. (Photo by Michael Buckner/Getty Images for SXSW) Also on HuffPost: ", "external_links": [], "published": "2015-06-06T03:45:00.000+03:00", "crawled": "2015-06-06T03:45:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}