{"organizations": ["Baraki Sellers", "Mother Emanuel African Methodist Episcopal Church", "South Carolina GOP", "Civil Rights Movement", "Charleston Post", "Congress", "House of Representatives", "CNN", "Rock Hill Herald", "Democratic Party"], "uuid": "27a356e9106b161e3dcc14688696b73ecd96c7a1", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/18/politics/south-carolina-church-shooting-clementa-pinckney/index.html", "country": "", "title": "Clementa Pinckney: Church shooting victim Obama named - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Clementa Pinckney: Church shooting victim Obama named - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T06:16:00.000+03:00", "replies_count": 0, "uuid": "27a356e9106b161e3dcc14688696b73ecd96c7a1"}, "author": "", "url": "http://www.cnn.com/2015/06/18/politics/south-carolina-church-shooting-clementa-pinckney/index.html", "ord_in_thread": 0, "title": "Clementa Pinckney: Church shooting victim Obama named - CNNPolitics.com", "locations": ["U.S.", "Washington", "North Charleston", "South Carolina", "Columbia", "Charleston", "South Carolina Pinckney"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jim Clyburn", "Sanford", "Barack Obama", "Michelle", "Clyburn", "Courier", "Pickney", "John C. West", "Obama", "Clementa", "Hillary Clinton", "Pinckney", "Emanuel", "Clementa Pinckney", "Mark Sanford", "Martin Luther King"], "text": "Nine killed, three survived 'hate crime' attack (CNN) South Carolina lost a pillar of its political and religious communities Wednesday when a gunman opened fire on a Charleston church. Clementa Pinckney, the pastor of Mother Emanuel African Methodist Episcopal Church, is among the nine people who were killed in a massacre Wednesday night. His death is rocking Democratic political circles from Charleston to Washington and Columbia, where he was a member of the state House of Representatives. \"Michelle and I know several members of the Emanuel AME church,\" President Barack Obama said Thursday. \"We knew their pastor, Rev. Clementa Pinckney who, along with eight others, gathered in prayer and fellowship and was murdered last night. And to say our thoughts and prayers are with them and their families and their community doesn't say enough to convey the heartache and sadness and the anger that we feel.\" Prominent Republicans were also shocked by Pinckney's death. During an emotional interview, U.S. Rep. Mark Sanford, whose congressional district includes the Charleston area, remembered Pickney, a 41-year-old married father of two, as a \"remarkable human being.\" \"I cannot say enough good things about Clementa,\" Sanford, who is also a former South Carolina GOP governor, told CNN's New Day. Pinckney's death comes as South Carolina politics heat up in advance of the state's crucial presidential primary early next year. Pinckney was an Obama surrogate in 2012. Gearing up for the next race, Hillary Clinton was in nearby North Charleston on Wednesday, though it's unclear that she crossed paths with Pinckney. Baraki Sellers, who served in the legislature with Pinckney, said the pastor was especially interested in presidential candidates addressing income inequality heading into 2016. RELATED: Charleston shootings: 2016 on hold in South Carolina Pinckney was also pressing to get a port built in his district. \"It would have brought jobs to the region and the economic impact would have changed the course of history for that area,\" Sellers said. \"It would have lifted generations out of poverty.\" The legacies of both Pinckney and Emanuel's -- as the church is known -- are rich with the use of faith to influence policy. According to the Charleston Post and Courier, Pinckney comes from four generations of pastors including an uncle who sued Gov. John C. West over voting rights and a great grandfather who sued the state Democratic Party to end whites-only primaries. Emanuel hosted Dr. Martin Luther King, Jr. during the height of the Civil Rights Movement and the Church was founded by former slaves following an unsuccessful slave revolt. Pinckney was close with South Carolina Rep. Jim Clyburn who is the highest ranking African-American member of Congress. They teamed up to bring stimulus money to the Charleston area in 2009. \"This money is really a godsend,\" Pinckney told the Rock Hill Herald newspaper. \"I am extremely grateful that Congressman Clyburn thought of our area.\" On Thursday, Clyburn said his \"heart goes out to the victims,\" including Pinckney. \"I am distraught that this kind of hate still exists in our country and specifically in my home state of South Carolina.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-06-19T06:16:00.000+03:00", "crawled": "2015-06-19T07:19:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}