{"organizations": [], "uuid": "918449dac2b7f80ecab72864037a83027f56b5e0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/guantanamo_060415getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/national-security/244273-brits-feel-slap-in-the-face-from-obama-over-guantanamo-detainee", "country": "US", "title": "Brits feel 'slap in the face’ from Obama over Guantanamo detainee", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Brits feel 'slap in the face’ from Obama over Guantanamo detainee", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T18:02:00.000+03:00", "replies_count": 0, "uuid": "918449dac2b7f80ecab72864037a83027f56b5e0"}, "author": "jhattem@thehill.com (Julian Hattem)", "url": "http://thehill.com/policy/national-security/244273-brits-feel-slap-in-the-face-from-obama-over-guantanamo-detainee", "ord_in_thread": 0, "title": "Brits feel 'slap in the face’ from Obama over Guantanamo detainee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brits feel 'slap in the face’ from Obama over Guantanamo detainee Getty By Julian Hattem - 06/08/15 11:02 AM EDT \nTop leaders of the British government are throwing barbs at the Obama administration for stonewalling their attempts to free a detainee held at Guantanamo Bay for the last 13 years. \nDespite repeated pleas for the White House to release Shaker Aamer into British custody, the 48-year-old Saudi citizen remains confined at the U.S. detention facility. ADVERTISEMENT Prime Minister David Cameron reportedly personally pressed President Obama on the matter during a global summit in Germany this weekend.\nOn Sunday, four members of British Parliament also took to the pages of The New York Times to make their case. \n“It is difficult for us to shake off the depressing notion that the Obama administration is indifferent to the repeated requests of the British government,\" Jeremy Corbyn, Andy Slaughter, David Davis and Andrew Mitchell wrote in an op-ed . Corbyn and Slaughter and members of the Labour Party, while Davis and Mitchell are Conservatives. \n“It is a slap in the face for America’s staunchest friend.” \nAamer, a former U.K. resident, was arrested in Afghanistan in 2001, and was “brutally tortured” at Afghanistan’s Bagram Prison, the British lawmakers wrote. In 2002, he was transferred to the detention facility at Guantanamo Bay. \nHe has been cleared for release twice but never released, despite the pleas from Cameron and a March motion in the House of Commons. He has never been charged with a crime and has spent much of his 13 years at Guantanamo in solitary confinement. \nCorbyn, Slaughter, Davis and Mitchell recently traveled to the U.S. to press their case, but found themselves repeatedly stonewalled. \nSpecial envoys at both the State and Defense departments “were unable to adequately answer our questions regarding a timeline for Mr. Aamer’s transfer,\" they wrote. Members of Congress, meanwhile, demonstrated a “lack of knowledge” about the case, which “indicates a troubling failure by the White House to communicate the importance of it.” \nAamer’s wife and four children live in London, and the British government maintains it could safely keep watch over him. \n“There is simply no reason, domestic or international, for the United States to keep Mr. Aamer in custody,” the four concluded. \nDuring a summit for the Group of Seven (G7) in Germany this weekend, Cameron again reiterated the point. \n“We are very clear we need to find a resolution to the case of Shaker Aamer,” Cameron told Obama during a 50-minute meeting on the sidelines of the summit, a source within 10 Downing Street told the Daily Mail . Tags: Past: 1 day Obama: 'We don't yet have a... The president said Iraq must show a greater commitment to fighting ISIS. Republicans wield power of the... A bill to fund the Justice Department is the latest front in the battle... Boehner: We don't have votes yet... \"I don't think we're quite there yet,\" the Speaker said. GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-08T18:02:00.000+03:00", "crawled": "2015-06-09T00:29:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}