{"organizations": ["Federal Appeals Court Upholds Texas Abortion Restrictions", "Federal Appeals Court", "Texas State"], "uuid": "a77d6766a74910e8459f17609604972aa3f8924f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3052342/images/o-TEXAS-ABORTION-2013-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/09/texas-abortion-law-_n_7545710.html", "country": "", "title": "Many Clinics Likely To Close As Federal Appeals Court Upholds Texas Abortion Restrictions", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Many Clinics Likely To Close As Federal Appeals Court Upholds Texas Abortion Restrictions", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T01:55:00.000+03:00", "replies_count": 0, "uuid": "a77d6766a74910e8459f17609604972aa3f8924f"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/09/texas-abortion-law-_n_7545710.html", "ord_in_thread": 0, "title": "Many Clinics Likely To Close As Federal Appeals Court Upholds Texas Abortion Restrictions", "locations": ["Austin", "AUSTIN", "TX", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Erich Schlegel", "Erich", "Rick Perry"], "text": "Many Clinics Likely To Close As Federal Appeals Court Upholds Texas Abortion Restrictions Posted: Updated: 32 minutes ago AUSTIN, TX - JULY 01: People rally in support of Texas women's right to reproductive decisions at the Texas State capitol on July 1, 2013 in Austin, Texas. This is first day of a second legislative special session called by Texas Gov. Rick Perry to pass an restrictive abortion law through the Texas legislature. The first attempt was defeated after opponents of the law were able to stall the vote until after first special session had ended. (Photo by Erich Schlegel/Getty Images) | Erich Schlegel via Getty Images reddit \nWASHINGTON -- A three-judge panel of the 5th U.S. Circuit Court of Appeals has upheld some of the most onerous parts of a Texas abortion law, which is likely to cause most of the state's abortion clinics to close. \nThe ruling , released Tuesday, allowed provisions requiring clinics to meet hospital-level operating standards and requiring providers to have admitting privileges at local hospitals to go into effect. It did exempt the last open clinic in the state's Rio Grande Valley from the provisions, which were passed by the Republican-controlled state legislature and signed by former Gov. Rick Perry (R) two years ago. In court, attorneys opposing the law said it could close all but eight clinics in Texas. \n\"In plain terms, H.B. 2 and its provisions may be applied throughout Texas, except that Supreme Court precedent requires us to partially uphold the district court’s injunction of the [ambulatory surgical center] requirement as applied to the Whole Woman’s Health abortion facility in McAllen, Texas, and to uphold the district court’s injunction of the admitting privileges requirement as applied to Dr. Lynn when he is working at the McAllen facility,\" the ruling read. \nThe ambulatory surgical center standards include minimum sizes for rooms, hallways and doorways, ventilation systems and other structural and aesthetic elements. While supporters of the law say it is meant to promote safety, its opponents say it places undue burdens on patients and is a veiled attempt to make the procedure inaccessible. The cost of meeting the ambulatory surgical center requirements is prohibitive for many clinics, and doctors often find it impossible to obtain admitting privileges from nearby hospitals, which may be Catholic or afraid of backlash if they offer those privileges. \nThe plaintiffs had challenged the law's admitting privileges requirement as applied to clinics in McAllen and El Paso, on the basis that women living near those cities would have to travel over 200 miles to access the procedure in larger urban areas like San Antonio or Houston. The court modified the injunction \"to apply to the McAllen facility until such time as another licensed abortion facility becomes available to provide abortions at a location nearer to the Rio Grande Valley than San Antonio.\" \nThe court said women in El Paso could simply leave the state and travel to New Mexico if they wanted to have the procedure. \n\"The closest Texas abortion facility that will remain open is in San Antonio, over 550 miles away,\" the court wrote. \"There is an abortion facility approximately twelve miles away in Santa Teresa, New Mexico. Prior to H.B. 2, more than half of the women who obtained abortions at the Santa Teresa facility were from El Paso. The State argues the closure of the El Paso abortion facility will not impose an undue burden because women in this area can travel to the Santa Teresa facility.\" \nA different 5th Circuit panel had previously ruled that Mississippi could not enforce its admitting privileges law because enforcement would cause the state's only abortion clinic to close. The court said it was unconstitutional for the state to delegate constitutional rights to its neighbors. In the Texas decision, the court said the Texas and Mississippi cases were \"distinguishable\" because the former would still have multiple clinics in operation if the admitting privileges provision was in effect. \nThe court heavily relied on the Supreme Court's 1992 decision in Planned Parenthood v. Casey, which said states can limit abortion access if restrictions are \"reasonably related\" to a \"legitimate state interest.\" \nAlmost immediately after the court's decision was announced, reproductive rights advocates said they would take their case against the law's provisions to the Supreme Court. \n“Once again, women across the state of Texas face the near total elimination of safe and legal options for ending a pregnancy, and the denial of their constitutional rights,\" Nancy Northup, the president and CEO of the Center for Reproductive Rights, said in a statement. Her group had filed the lawsuit against the 2013 bill. \nThey may have a cause for concern at the Supreme Court. As msnbc's Irin Carmon pointed out , Justice Anthony Kennedy, who often serves as the court's swing vote, wrote for the majority in a recent abortion-related decision that \"medical uncertainty\" does not prevent \"the exercise of legislative power in the abortion context any more than it does in other contexts.” \nResearchers and reproductive health advocates say Texans are starting to cross the border into Mexico to seek back-alley abortions, given the difficulties associated with obtaining the procedure in their state. \nThe law, which sparked massive protests at the state capitol and the now-famous filibuster by former Democratic state Sen. Wendy Davis (D), also banned abortions after 20 weeks of pregnancy. That provision hasn't yet been challenged in court. \nThough a federal district court judge found in 2014 that the law's provisions created \"an impossible obstacle\" for patients trying to access the procedure and that the law was intended to block women’s access to abortion, the appeals court bought the Texas legislature's stated justifications for the legislation. \nTexas Governor Greg Abbott (R), whose office defended the abortion restrictions in court when he was the state’s attorney general, praised the court's ruling in a Tuesday statement. \n“I am pleased with the Fifth Circuit’s decision to uphold HB 2 and the State of Texas will continue to fight for higher-quality healthcare standards for women while protecting our most vulnerable -- the unborn,” Abbott said. \nIn August 2013, before the abortion restrictions went into effect, the state had 40 licensed abortion providers. After the Supreme Court in October 2014 blocked an earlier 5th Circuit ruling that had allowed Texas to fully enforce the law, the state had 16 legal abortion providers. There are now expected to be just seven or eight . Also on HuffPost: ", "external_links": [], "published": "2015-06-10T01:55:00.000+03:00", "crawled": "2015-06-10T01:55:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}