{"organizations": ["Congress", "Emanuel African Methodist Episcopal Church", "State House", "South Carolina State House"], "uuid": "9804cbefda6954fd35cb91e78cb9a5e8bc36ee43", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150626161202-barack-obama-eulogy-june-26-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/06/29/health/hospice-fast-facts/index.html", "country": "US", "title": "Obama sings Amazing Grace in Clementa Pinckney eulogy", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama sings Amazing Grace in Clementa Pinckney eulogy", "spam_score": 0.0, "site_type": "news", "published": "2015-06-29T15:45:00.000+03:00", "replies_count": 0, "uuid": "3bc70548dbe9535d7685259955df078a24ce9703"}, "author": "", "url": "http://edition.cnn.com/2015/06/26/politics/obama-charleston-eulogy-pastor/index.html", "ord_in_thread": 0, "title": "Obama sings Amazing Grace in Clementa Pinckney eulogy", "locations": ["America", "Washington", "South Carolina", "Columbia", "Charleston", "Malana", "Clementa Pinckney"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Joe Biden", "Jennifer", "Joseph Riley", "Barack Obama", "Pinckney", "Thomas Rose", "Eliana", "Doris Simmons", "Clementa Pinckney", "Nikki Haley", "Obama", "Michelle Obama"], "text": "Funerals begin for Charleston massacre victims Charleston, South Carolina (CNN) President Barack Obama delivered a touching eulogy, a rousing political speech and a thoughtful meditation on race in America when he traveled to Charleston, South Carolina on Friday to speak at the funeral of the Rev. Clementa Pinckney, who was gunned down last week by a racist terrorist during Bible study. But the President's speech will be remembered for a moment at the end when he launched into a solo of \"Amazing Grace,\" that at first stunned the mourners and then brought them to their feet as they joined him in song. Remembering Sen. Clementa Pinckney 22 photos Remembering Sen. Clementa Pinckney 22 photos President Barack Obama delivers the eulogy for South Carolina state Sen. Clementa Pinckney on Friday, June 26. Pinckney was a pastor at the Charleston, South Carolina, church where he and eight other people were fatally shot on June 17. Pinckney was 41 years old. \"We are here today to remember a man of God who lived by faith,\" Obama said. \"A man who believed in things not seen. A man who believed there were better days ahead, off in the distance. A man of service who persevered knowing full well he would not receive all those things he was promised, because he believed his efforts would provide a better life for those who followed.\" Hide Caption Remembering Sen. Clementa Pinckney 22 photos Pinckney's wife, Jennifer, attends the service with her daughters Eliana, left, and Malana. Hide Caption Remembering Sen. Clementa Pinckney 22 photos The Pinckney family walks together before Obama's eulogy. Hide Caption 3 of 22 Remembering Sen. Clementa Pinckney 22 photos Members of Congress stand as they are introduced at the funeral service, which was held at the TD Arena in Charleston. Hide Caption 4 of 22 Remembering Sen. Clementa Pinckney 22 photos South Carolina Gov. Nikki Haley hugs Charleston Mayor Joseph Riley as they arrive for the funeral. Hide Caption Remembering Sen. Clementa Pinckney 22 photos Mourners pay their respects at the funeral service. Hide Caption Remembering Sen. Clementa Pinckney 22 photos Mourners pray during the service. Hide Caption Remembering Sen. Clementa Pinckney 22 photos A mourner bows his head in prayer. Hide Caption Remembering Sen. Clementa Pinckney 22 photos A mourner raises her hands in prayer. Hide Caption Remembering Sen. Clementa Pinckney 22 photos People wait for the funeral outside the TD Arena. Hide Caption 10 of 22 Remembering Sen. Clementa Pinckney 22 photos Members of Congress get off Air Force One in Charleston as they accompanied Obama to the service. Hide Caption 11 of 22 Remembering Sen. Clementa Pinckney 22 photos As the sun rises on June 26, Doris Simmons stands across the street from the Charleston church where the shooting took place earlier this month. Hide Caption Remembering Sen. Clementa Pinckney 22 photos People embrace while waiting to enter Pinckney's funeral service. Hide Caption Remembering Sen. Clementa Pinckney 22 photos People wait in line to enter the TD Arena. Hide Caption Remembering Sen. Clementa Pinckney 22 photos People watch as the hearse carrying Pinckney passes by June 26 in Charleston. Hide Caption Remembering Sen. Clementa Pinckney 22 photos Members of the clergy wait to enter the funeral service. Hide Caption Remembering Sen. Clementa Pinckney 22 photos Mourners pray before the service. Hide Caption Remembering Sen. Clementa Pinckney 22 photos Mourners sing gospel hymns inside the arena. Hide Caption Remembering Sen. Clementa Pinckney 22 photos Mourners embrace next to Pinckney's casket. Hide Caption 19 of 22 Remembering Sen. Clementa Pinckney 22 photos Church member Thomas Rose leaves a wake for Pinckney that was held on Thursday, June 25. Hide Caption 20 of 22 Remembering Sen. Clementa Pinckney 22 photos Pinckney's casket is carried to the South Carolina State House in Columbia, South Carolina, on Wednesday, June 24. Hide Caption 21 of 22 Remembering Sen. Clementa Pinckney 22 photos Mourners pay their respects to Pinckney as his body lies in the State House on June 24. Hide Caption 22 of 22 EXPAND GALLERY \"As a nation, out of this terrible tragedy, God has visited grace upon us for he has allowed us to see where we've been blind,\" Obama said. \"He's given us the chance, where we've been lost, to find our best selves.\" RELATED: Best week in Washington: Obama's legacy The President's remarks at times felt like a sermon, with organ chords backing him during some of the most impassioned passages. The mostly African-American crowd was, at the end of the eulogy, on its feet, clapping and cheering Obama as he named each victim of the church shooting and declaring each \"had grace.\" The President, first lady Michelle Obama, Vice President Joe Biden, a bipartisan host of high-level members of Congress and Hillary Clinton all attended the memorial service at TD Arena in downtown Charleston. Last Wednesday, a 21-year-old man opened fire at a Bible study inside Charleston's Emanuel African Methodist Episcopal Church, killing nine. The shooter declared he was there to \"kill black people,\" and an online manifesto attributed to him contained white supremacist screeds. Obama, in his eulogy, said the killer likely assumed he \"would deepen divisions that trace back to our nation's original sin.\" \"But God works in mysterious ways,\" Obama said. \"God had different ideas. He didn't know he was being used by God.\" \"The alleged killer could have never anticipated the way the families of the fallen would respond when they saw him in court in the midst of unspeakable grief, with words of forgiveness,\" Obama said. JUST WATCHED", "external_links": [], "published": "2015-06-29T15:45:00.000+03:00", "crawled": "2015-06-29T16:22:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}