{"organizations": [], "uuid": "5c695cdb981d9c7252e76dcbaeea9d9c62899b26", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/243947-coal-miners-union-to-sue-over-obama-power-plant-rules", "country": "US", "title": "Coal miners union to sue over Obama power plant rules", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Coal miners union to sue over Obama power plant rules", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T00:25:00.000+03:00", "replies_count": 0, "uuid": "5c695cdb981d9c7252e76dcbaeea9d9c62899b26"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/243947-coal-miners-union-to-sue-over-obama-power-plant-rules", "ord_in_thread": 0, "title": "Coal miners union to sue over Obama power plant rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Coal miners union to sue over Obama power plant rules By Devin Henry - 06/03/15 05:25 PM EDT \nThe head of the United Mine Workers of America (UMWA) said his union will sue the Environmental Protection Agency (EPA) over two rules designed to cut greenhouse gas emissions at power plants once the Obama administration finalizes them. \n\"These regulations come on top of decades of clean air and clean water regulations coming out of Washington that have already changed our industry and our communities,\" UMWA president Cecil Roberts said at a union gather in Morgantown, W.Va. on Wednesday. ADVERTISEMENT “As we stand here today, I assure that our lawyers are preparing to sue the agency again once the Clean Power Plan and New Source rule become final,” he said.\nThe coal industry has strongly opposed the two rules, which look to reduce emissions from existing and new power plants respectively. Roberts warned the standards would further diminish the role of coal-fired power plants in the American electricity sector even as the industry struggles to keep up with falling demand due to cheap natural gas supplies. \nThe rules “will make it just about impossible to either continue burning coal to generate electricity at existing plants or build new coal-fired power plants in the future, unless there is a sudden and vast leap in technological development to capture and store carbon emissions,” he said. \nUMWA has endorsed a handful of legislative efforts to blunt the effects of the rules, though those bills are likely to go nowhere as long as Obama is in office. Even so, Roberts said the bills are important ways to convince states and utilities not to move away from coal as an energy supply before the EPA’s rules even kick in. \nUMWA has a history of suing regulators over rules that impact the coal industry. The union was among the groups that convinced a federal court to overturn George W. Bush-era mercury regulations, and it’s awaiting a Supreme Court ruling on an Obama mercury rule. \n“We have not, and we will not, stand by while our members’ jobs are under attack from any source, in any administration,” Roberts said. Tags:  ", "external_links": [], "published": "2015-06-04T00:25:00.000+03:00", "crawled": "2015-06-04T00:27:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}