{"organizations": [], "uuid": "9e897f3bb7889f4e4589342d173fd125d4ed28ca", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarackfrancispope_032714getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/245460-obama-cheers-popes-climate-change-push", "country": "US", "title": "Obama cheers Pope's climate change push", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama cheers Pope's climate change push", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T22:36:00.000+03:00", "replies_count": 0, "uuid": "9e897f3bb7889f4e4589342d173fd125d4ed28ca"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/245460-obama-cheers-popes-climate-change-push", "ord_in_thread": 0, "title": "Obama cheers Pope's climate change push", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama cheers Pope's climate change push Getty Images By Devin Henry - 06/18/15 03:36 PM EDT \nPresident Obama said he “deeply admires” Pope Francis’s encyclical on the environment and his “decision to make the case — clearly, powerfully, and with the full moral authority of his position — for action on global climate change.” \n“As Pope Francis so eloquently stated this morning, we have a profound responsibility to protect our children, and our children's children, from the damaging impacts of climate change,” Obama said Thursday. ADVERTISEMENT “I believe the United States must be a leader in this effort, which is why I am committed to taking bold actions at home and abroad to cut carbon pollution, to increase clean energy and energy efficiency, to build resilience in vulnerable communities, and to encourage responsible stewardship of our natural resources.”\nFrancis’s encyclical, released Thursday morning, argues that governments and individuals need to do more to combat global warming. \nDemocrats, including several Obama administration officials, praised Francis on Thursday. Secretary of State John Kerry called his encyclical “powerful,” and Energy Secretary Ernest Moniz said it is “an important milestone in the global effort on this issue.” \nThe document comes ahead of both the pope’s inaugural trip the United States and a major climate conference this year focused on cutting global greenhouse gas emissions. Obama said he hopes Francis will inspire leaders to reach a deal. \n“I look forward to discussing these issues with Pope Francis when he visits the White House in September,” the president said. “And as we prepare for global climate negotiations in Paris this December, it is my hope that all world leaders — and all God's children — will reflect on Pope Francis's call to come together to care for our common home.” Tags: Issa escorted out of Benghazi... Rep. Trey Gowdy escorted the California Republican from the closed-door... Donald Trump's use of Neil Young... Trump’s use of “Rockin’ in the Free World” was “not authorized” by the... New $10 bill to feature a woman Obama administration officials are seeking advice nationwide on who to... Gun owners not likely to use... A new study attempts to debunk the claim that gun owners rely on... Gowdy identifies author of... The Benghazi chairman said Tyler Drumheller wrote the memos passed on to... Donald Trump comes out on top — on... About 3.4 million people reacted to his launch, the most of any GOP... Sanders overwhelms O'Malley Bernie Sanders's surging candidacy is totally suffocating Martin O'Malley'... Jon Stewart mocks Trump “Whites are black, Trump’s running for president, does gravity still work... You’re barking up the wrong tree,... OPINION | Guns are the most striking example. Boehner takes his retribution GOP leaders remove three members of its House whip team. Sanders surges in New Hampshire... Sanders ties Clinton with self-identified liberals in a new poll. Senate Dems give GOP 45-day... Senate Democrats say it will be difficult to pass a short-term highway... Actor Mark Ruffalo: Hillary needs... “It’s going to be an interesting primary,\" The Avengers star said. Court rules Bush officials can be... The split decision comes after more than a decade of litigation. Government can't explain $3B in... An audit finds inadequate review put a \"significant amount of federal... Ex-Clinton aide didn't write... Rep. Gowdy said the intel came from another source, whom the panel \"might... FCC plans to fine AT... The carrier reduced network speeds once customers used a certain amount of... GOP bill would repeal federal... Sen. Bill Cassidy's (R-La.) legislation does away with the renewable fuel... Ann Coulter: I'd run immigration... Lawmakers joined Coulter at a book signing Tuesday for her new book, Adios... House Republican leaders zero in... The plan is to vote as soon as this week on the fast-track bill.", "external_links": [], "published": "2015-06-18T22:36:00.000+03:00", "crawled": "2015-06-19T08:24:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}