{"organizations": ["ISIS"], "uuid": "33183f1d9d282d9ace7a6cf59eb7c1c916d898d5", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150608111102-obama-june-8-2015-large-169.jpg", "site_section": "http://feeds.feedburner.com/RussiaNews-GoogleNews", "section_title": "russia news - Google News", "url": "http://edition.cnn.com/2015/06/08/politics/g7-russia-sanctions-barack-obama/", "country": "IL", "title": "Obama: Europe will continue sanctions on Russia - CNN", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama: Europe will continue sanctions on Russia - CNN", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T17:43:00.000+03:00", "replies_count": 0, "uuid": "33183f1d9d282d9ace7a6cf59eb7c1c916d898d5"}, "author": "", "url": "http://edition.cnn.com/2015/06/08/politics/g7-russia-sanctions-barack-obama/", "ord_in_thread": 0, "title": "Obama: Europe will continue sanctions on Russia - CNN", "locations": ["United States", "Belarus", "Eastern Ukraine", "U.S.", "Munich", "Ukraine", "Austria", "Europe", "Russia", "Donetsk", "Bavarian Alps"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Barack Obama", "Vladimir Putin", "Obama"], "text": "Obama: 'Sanctions against Russia will remain in place' 01:33 Telfs-Buchen, Austria (CNN) President Barack Obama on Monday said he'd convinced European leaders to maintain economic sanctions on Russia, even as U.S. officials concede the measures have done little to curb aggression by separatists in Eastern Ukraine. The extension of sanctions was a chief goal of the U.S. President at this week's G7 meeting in the Bavarian Alps, where leaders huddled in a castle high above Munich to discuss Russia, ISIS and other pressing global issues. Obama said at a press conference at the conclusion of the summit that \"Russia's actions in Ukraine \"are hurting Russia and hurting the Russian people.\" The sanctions regime steadily imposed by Western nations will continue until a ceasefire that Russia agreed to in March goes into full effect, Obama said. That accord, which leaders hammered out in Belarus, has been repeatedly violated. Some of the fiercest fighting since the so-called Minsk Agreement came this week, with heavy artillery fire reported near Donetsk. In total, more than 6,000 people have died in the fighting in Eastern Ukraine since the conflict began last year. Despite the continued violence, U.S. officials insist the sanctions are taking a toll on the Russian economy, where the Ruble has plummeted in value. But they admit the sanctions have done little to prevent Russian President Vladimir Putin from continuing the campaign in Ukraine. Obama said Europe and the United States stand ready to impose new sanctions if violence increases. \"Ultimately, this is going to be an issue for Mr. Putin,\" Obama said. \"He's got to make a decision: Does he continue to wreck his country's economy and continue Russia's isolation in pursuit of a wrong-headed desire to recreate the glories of the Soviet empire? Or does he recognize that Russia's greatness does not depend on violating the territorial integrity and sovereignty of other countries?\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-06-08T17:43:00.000+03:00", "crawled": "2015-06-09T02:24:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}