{"organizations": [], "uuid": "40290ccc4f3ae79a35207953ebd5fd94f3e8a639", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_061915getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/245793-obama-uses-n-word-to-provoke-talk-about-racism", "country": "US", "title": "Obama uses N-word to spark talk about racism", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama uses N-word to spark talk about racism", "spam_score": 0.0, "site_type": "news", "published": "2015-06-23T03:53:00.000+03:00", "replies_count": 0, "uuid": "40290ccc4f3ae79a35207953ebd5fd94f3e8a639"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/245793-obama-uses-n-word-to-provoke-talk-about-racism", "ord_in_thread": 0, "title": "Obama uses N-word to spark talk about racism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama uses N-word to spark talk about racism By Jordan Fabian - 06/22/15 08:53 PM EDT \nPresident Obama caused a stir on Monday by using the N-word to make a point about racism in America. \nIn a conversation recorded on Friday, less than 48 hours after a mass shooting at an African-American church in South Carolina, Obama said racism is still deeply ingrained in society despite the fact that racial slurs are no longer acceptable in normal conversation. ADVERTISEMENT “The legacy of slavery, Jim Crow, discrimination in almost every institution of our lives — that casts a long shadow, and that’s still part of our DNA that’s passed on,” Obama said during an interview on comedian Marc Maron’s “WTF Podcast” released Monday. \n“Racism, we are not cured of it,” Obama added. “And it’s not just a matter of it not being polite to say n in public. That’s not the measure of whether racism still exists or not.” \nObama’s phrasing renewed a debate over who is allowed to use the word and when it’s appropriate to say. The provocation also garnered more attention for his broader message, something that almost certainly factored into Obama’s decision to use the word. \nThe discussion about race consumed cable news chatter and dominated newspaper headlines on Monday. White House spokesman Josh Earnest fielded more than a dozen questions about Obama’s comments at his daily briefing with reporters. \nThe discussion arose amid a new battle over the Confederate flag, augmenting a debate about race and the country’s past. As the White House reiterated Obama’s call for the flag to be placed in museums rather than state grounds, South Carolina Gov. Nikki Haley (R) said she would seek to move the flag. \nFew commentators said that Obama was wrong to use the word, though some acknowledged the discussion of one word threatened to overshadow Obama’s larger message. Despite improvements since the civil rights era, Obama said, “societies don’t, overnight, completely erase everything that happened 200 to 300 years prior.” \nEarnest said the president had no regrets for his choice of words, and he acknowledged it was a “provocative” way for the president to make a point on race, though he said it wasn’t planned by the White House. \n“The way the president designed his argument in this scenario is more provocative,” Earnest said. “I don’t think there is anybody here that is surprised that this is something that is getting a little bit more attention.” \nBut the spokesman said the focus should not be on Obama’s word choice but on his argument that the country must do more to heal its racial wounds. \nObama has increasingly spoken out about race during his second term, forced to confront a series of racially charged incidents that captured national attention. \nThe 2012 killing of Trayvon Martin, an African-American Florida teenager, and police-related deaths of black men around the country have prompted the president to address the issue of race on personal terms. \nHe called on the nation to do some “soul searching” following Martin’s death and said, “If I had a son, he would look like Trayvon.” \nEarlier this year, he made a sweeping address at the 50th anniversary commemoration of the bloody Alabama march from Selma to Montgomery, saying, “This nation’s racial history still casts its long shadow upon us.” \nMaron’s podcast is recorded in his garage and is known for its oftentimes raw and emotional interviews with guests (and its harsh language). Actor and comedian Robin Williams opened up to Maron about his battles with substance abuse and depression four years before he took his own life last year. \nIn Maron’s interview with the president, which the White House reportedly sought, Obama spoke about how he confronted his mixed-race heritage without the presence of his biological father in his life. He explored similar themes in his 1995 memoir Dreams From My Father, which includes the N-word and discusses his drug use in high school and college. \nThe president said he began “absorbing a lot of stereotypes” and “trying on different hats” about being a “black man in America.” \nThe president said he had “contradictions I had to work out” before he could learn to “be both an African American, but also somebody that affirms the white side of my family.” \nObama will likely touch on similar themes when he delivers the eulogy Friday for the Rev. Clementa Pinckney, one of the nine victims of the Charleston church shooting, whom the president knew personally. \nOne day after the shooting, Obama said the fact it occurred at a black church “raises questions about a dark part of our history.” But he also offered a glimmer of hope that the nation’s oldest divide could one day be bridged. \n“I am confident that the outpouring of unity and strength and fellowship and love across Charleston today, from all races, from all faiths, from all places of worship indicates the degree to which those old vestiges of hatred can be overcome,” he said. Tags:", "external_links": [], "published": "2015-06-23T03:53:00.000+03:00", "crawled": "2015-06-23T04:19:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}