{"organizations": [], "uuid": "546587fd5d3076b8309d908fd9a74853c2e9a0d4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/foley.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/245973-obama-orders-shift-in-hostage-policy", "country": "US", "title": "Obama orders shift in hostage policy", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama orders shift in hostage policy", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T19:19:00.000+03:00", "replies_count": 0, "uuid": "546587fd5d3076b8309d908fd9a74853c2e9a0d4"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/245973-obama-orders-shift-in-hostage-policy", "ord_in_thread": 0, "title": "Obama orders shift in hostage policy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama orders shift in hostage policy By Jordan Fabian - 06/24/15 12:19 PM EDT President Obama on Wednesday rolled out new policies that would allow families of American hostages to communicate with their captors and offer ransom payments without the threat of prosecution. ADVERTISEMENT The new policy still prevents the U.S. from making concessions and ransom payments to hostage-takers. But it will allow families and government officials to communicate with terrorist groups or other third parties to help secure the release of hostages held overseas. And it will tacitly permit families to make private ransom offers. In a statement in the Roosevelt Room, Obama said that hostages’ families have too often felt ignored by the government or been given conflicting information while trying to rescue their relatives. “It is my solemn commitment to make sure they feel fully supported in their effort to get their loved ones home,” Obama said. Obama issued an executive order and a presidential directive on Wednesday codifying the changes. He also created a new office, known as a hostage recovery fusion cell, to coordinate response efforts with the families of American captives and foreign governments. The office will include officials from various federal agencies, including the State Department, Department of Defense, and the CIA, but will be housed in the Federal Bureau of Investigation (FBI). The State Department will also name a special presidential envoy for hostage affairs. The new official will help communicate with foreign governments involved in freeing U.S. hostages. The changes are part of a long-awaited review of U.S. hostage policies following the execution of several American captives by the Islamic State in Iraq and Syria (ISIS). Families of the slain Americans complained the federal government failed to communicate effectively with them while their relatives were held hostage. The family of James Foley, the U.S. journalist killed by ISIS, has said different agencies said different things with regard to paying a ransom and said the White House threatened them with prosecution if they decided to pay a ransom. Obama met with family members who participated in the hostage review on Wednesday before making a public statement. He acknowledged that too often, the government has “let them down.” The president said his message to them was: “we are not going to abandon you, we will stand by you.” While no family has ever been prosecuted for offering a private ransom payment to an extremist group, Obama said government officials should no longer “add to families’ pain with threats like that.” Lawmakers in both political parties are pushing for more sweeping reforms to how the U.S. frees Americans captives being held overseas, and they said the White House’s policy changes do not go far enough. A bipartisan group of lawmakers in the House and Senate is introducing legislation that would create an independent director to oversee a new hostage-rescue task force. That’s different than the White House’s plan, which tasks an FBI official with overseeing the new interagency “fusion cell.” Lawmakers say an independent coordinator would have more power to direct the various agencies responsible for hostage rescues, including the State Department, Pentagon, FBI and the CIA. “Wholesale changes are needed, but what’s being put forward is nothing more than window dressing, I fear,” Rep. Duncan Hunter (R-Calif.), a sponsor of the bill, said in a statement Tuesday. “It’s a pathetic response to a serious problem.” “Too frequently, the suffering families of hostages were left in the dark, unsure who in government was working exclusively to ensure the safe return home of their loved ones,\" Sen. Ben Cardin (D-Md.), who co-authored the bill in the Senate, said in a statement Tuesday. \"That is why this legislation is so vital.” Cardin helped the family of Maryland resident Warren Weinstein, an al Qaeda captive inadvertently killed in a drone strike earlier this year, coordinate their rescue efforts with the federal government. Many hostages families, including Weinstein's, had urged the Obama administration to create an independent hostage \"czar.\" Elaine Weinstein, the wife of Warren, called the creation of a fusion cell \"a good idea,\" but said a \"sole individual with overall policy responsibilities for safe hostage recovery\" would have had more authority to coordinate a government response. “This review will not bring Warren back. It is our most sincere hope that it was conducted fully and frankly so the U.S. government can have an honest conversation about the areas where it falls short,\" she said in a statement to ABC News . Obama said that hostages' families have \"every right to be skeptical,\" but that he is demanding accountability from his administration. \"These families are to be treated like what they are — our trusted partners,\" the president said.", "external_links": [], "published": "2015-06-24T19:19:00.000+03:00", "crawled": "2015-06-24T20:48:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}