{"organizations": ["Senate", "Abortion Rights Potential Colorado Republican Senate"], "uuid": "b06ba0999a5fd87fb27dd36c48ce803f9d73e9f6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3032796/images/o-ELLEN-ROBERTS-COLORADO-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/04/ellen-roberts-colorado-_n_7510376.html", "country": "", "title": "Potential Colorado Republican Senate Candidate Tries To Thread The Needle On Abortion Rights", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Potential Colorado Republican Senate Candidate Tries To Thread The Needle On Abortion Rights", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T20:11:00.000+03:00", "replies_count": 0, "uuid": "b06ba0999a5fd87fb27dd36c48ce803f9d73e9f6"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/04/ellen-roberts-colorado-_n_7510376.html", "ord_in_thread": 0, "title": "Potential Colorado Republican Senate Candidate Tries To Thread The Needle On Abortion Rights", "locations": ["Denver", "Owen Hill", "Colorado"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ellen Roberts"], "text": "Potential Colorado Republican Senate Candidate Tries To Thread The Needle On Abortion Rights Posted: Updated: 11 minutes ago Colorado state Sen. Owen Hill (R), right, passes around a bowl of snacks to his fellow lawmakers, including state Sen. Ellen Roberts (R), left, inside the Senate chamber, at the State Capitol in Denver. | ASSOCIATED PRESS reddit \nWASHINGTON -- A Republican state Senator in Colorado who says she believes pregnant women should have a \"full array\" of choices also said she wouldn't call herself pro-choice Tuesday, in an illustration of the rhetorical knots she must tie herself in as she considers challenging Sen. Michael Bennet (D-Colo.) next year. \nState Sen. Ellen Roberts (R-Durango), president pro tem of the chamber, shot to the top of the list of likely Bennet rivals earlier this week, after Rep. Mike Coffman (R-Colo.) said he won't be entering the race . \nColorado frequently hosts some of the nation's most competitive statewide elections, with reproductive rights often serving as fodder for Democratic attacks against Republican candidates. When Bennet ran for Senate in 2010, his campaign highlighted the strong anti-abortion views of the GOP challenger, Ken Buck, who was then a district attorney. Bennet's strategy against Buck proved effective in a state with a strong libertarian streak. That theme was reprised last year, albeit unsuccessfully , as incumbent Sen. Mark Udall (D-Colo.) lost his seat to Republican Cory Gardner and Republicans took control of the state Senate. (Democrats control the state House and the governorship.) \nNow, Roberts finds herself in a tricky position. If she decides to run for the U.S. Senate, she will have to navigate a Republican primary that is sure to feature more conservative candidates -- while simultaneously preparing for a general election in a higher-turnout presidential year. She was named the \"most pro-abortion Republican in the legislature\" by the advocacy group Colorado Right to Life last year, and she's been described as \" not pro-life \" by anti-abortion media outlets. \nRoberts' rhetoric on the issue appears to have shifted as Coffman took himself out of contention and as she has become a potential Senate contender. In May, Roberts said at a Durango Herald forum that she does \"not want abortion illegal, and you will not find a vote of mine that will suggest otherwise.\" But on Tuesday, her balancing act was on display when the conservative talk show host Dan Caplis asked about her record . When asked if she would vote to confirm a Supreme Court nominee who believed Roe v. Wade, the 1973 decision that legalized abortion, was correctly decided, Roberts offered a much less direct answer, saying it was \"difficult to speculate\" about what she'd do if she were in the Senate. \n\"Well Dan, I guess I would say that I've got to go back to the point of, I'm just thinking about running. It's an excellent question, one I would be happy to answer in detail once I decided I was getting in the race,\" she said. \"But I'm going to go back to your point of, it is a wedge issue because people care deeply about that, and I have always been a strong defender of religious freedom. I completely defend the right of anyone who says, 'This is against my religion, my faith.'\" \nWhile Roberts said she has supported parental notification laws for minors seeking abortions -- a measure that reproductive rights groups oppose -- she also explained that she believes pregnant women should have a \"full array\" of choices. \n\"My position has been that making abortion illegal, unfortunately, I don’t think will resolve the issue of unintended pregnancies,\" she said. \"I think there’s a strong role for people to play in supporting a woman in that situation, but I'm not that keen on government being right in the middle of it, so that’s driven my thought process.\" \nThe legislator did not respond to a request for comment from The Huffington Post to clarify her position. \nRoberts has previously acknowledged her unique stance on reproductive rights within her party, telling National Journal in May that she was \" not your average Republican .\" \nDemocrats and reproductive rights groups say Roberts doesn't deserve to be called a moderate after voting this legislative session for a bill that would grant criminal protections to fetuses , a measure reminiscent of earlier ballot initiatives to give legal rights to fetuses that Coloradans have thrice rejected . Reproductive rights advocates describe such measures as \"personhood\" attempts that could outlaw abortion and some forms of contraception if enforced. \nRepublican supporters of the bill said it wouldn't apply to abortion or miscarriages, and that it was meant to address cases like the vicious March stabbing of a pregnant woman in Colorado. The women survived, but her fetus did not. \n“You cannot support fetal personhood measures and be pro-choice,” Cathy Alderman, spokeswoman for Planned Parenthood of the Rocky Mountains, told The Durango Herald after Roberts' vote. “Despite what the proponents claimed, when you define ‘person’ prior to birth, you have created fetal personhood. Just saying it’s not personhood doesn’t change that.” \nIn response, Roberts wrote in a guest column for The Denver Post that she and Planned Parenthood should have \"some common ground\" and that \"an intellectually honest legislator could vote for [the disputed bill] and still hold to the principle that abortion in Colorado should remain legal.\" \n\"You'd think we'd have some common ground, Planned Parenthood and I, since I'm a woman and I've always supported abortion being legal under settled U.S. Supreme Court case law,\" she wrote. \"Obviously, as a Republican, this has not been an easy path to be on and has attracted failed primaries against me.\" \nThe bill in question was ultimately defeated. \nIn the interview with Caplis, Roberts said she will decide whether to enter the Senate race by the end of the summer. Also on HuffPost: ", "external_links": [], "published": "2015-06-04T20:11:00.000+03:00", "crawled": "2015-06-04T20:11:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}