{"organizations": [], "uuid": "2d9ef866b0388f634e40e25124d7cfd40708cff6", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/060615_ANHQ_China_640.jpg", "site_section": "http://www.foxnews.com/politics/index.html", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/06/07/schiff-king-call-on-obama-to-be-aggressive-in-cyber-war-after-purported-china/", "country": "US", "title": "Schiff, King call on Obama to be aggressive in cyberwar, after purported China hacking", "performance_score": 2, "site": "foxnews.com", "participants_count": 2, "title_full": "Schiff, King call on Obama to be aggressive in cyberwar, after purported China hacking | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-07T03:00:00.000+03:00", "replies_count": 1, "uuid": "2e9d450791a1ddf31d8cc0e6075d673a6f4cc776"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/07/schiff-king-call-on-obama-to-be-aggressive-in-cyber-war-after-purported-china/#post-0", "ord_in_thread": 0, "title": "Schiff, King call on Obama to be aggressive in cyberwar, after purported China hacking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 07,\nTwo top-ranking House lawmakers -- a Democrat and Republican -- on Sunday called on President Obama to go beyond the “whodunit” in the recent hacking of U.S. government computers, suggesting his administration must go on the attack.\n“We need to figure out when we’re going on an offensive,” California Rep. Adam Schiff, the top Democrat on the House Intelligence Committee, told “Fox News Sunday.”\nSchiff, one of the most hawkish congressional Democrats, said he couldn’t be certain that China was indeed behind the attack. However, the breach was either the work of “state actors” or a “very sophisticated group” working with the Chinese government.\nBeijing says U.S. claims that China-based hackers were involved in getting into Office of Personal Management computers are unproven and irresponsible, but has not denied responsibility for the attacks.\nThe security breach resulted in the purported identify theft of at least 4 million federal workers.\nRep. Peter King, R-N.Y., a member of the House’s Homeland Security Committee and former chairman of the chamber’s Permanent Select Committee on Intelligence, said the United States must do more than it is doing right now.\n“We should not be afraid to use all of our tools to stop this,” he told Fox News.\nThe recent attack on the personal management office marks the fourth time this year that a federal agency has been hacked and it brings increasing focus on Obama’s efforts to stop the attacks.\nIn November, Obama said the increasing number of cyber attacks was “like the Wild, Wild West” and suggested the U.S. must help lead efforts to stop or at least slow the problem.\nEven if the attack were state-sanctioned, the National Security Agency also has a secret and vast data-collection program at home and abroad that was infamously exposed in 2013 by former NSA contract employee Edward Snowden.\nSchiff said he “absolutely supports” such NSA efforts and is confident that U.S. intelligence officials are not exposing Americans’ personal information in the process.\nHe also said he was concerned about the threat of the Islamic State recruiting and training terrorists on American soil, following the incident Tuesday in which investigators fatally shot a Boston man after he refused to drop a military-style knife as they sought to question him about \"terrorist-related information,\" including reported plans to behead police officers.\nThe suspect, 26-year-old Usaama Rahim, reportedly visited Islamic State-related websites.\nHowever, Schiff was more concerned about an inspector general’s report made public earlier this week that found Transportation Security Administration employees failed to detect mock explosives and weapons nearly 96 percent of the time at airport checkpoints, saying a bomb exploding on a U.S. plane could “radically change” the nature of the country.\nThe Associated Press contributed to this report.\n ", "external_links": [], "published": "2015-06-07T03:00:00.000+03:00", "crawled": "2015-06-07T19:02:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}