{"organizations": ["Texas Abortion Law Teed Up For Supreme Court Review Texas Abortion Law Teed Up For Supreme Court Review"], "uuid": "c4f41c1a078cdc68d0d1a805641e8a05a52031e4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3099256/images/o-SUPREME-COURT-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/21/texas-abortion-law_n_7631382.html", "country": "", "title": "Texas Abortion Law Teed Up For Supreme Court Review", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Texas Abortion Law Teed Up For Supreme Court Review", "spam_score": 0.0, "site_type": "news", "published": "2015-06-21T21:13:00.000+03:00", "replies_count": 0, "uuid": "c4f41c1a078cdc68d0d1a805641e8a05a52031e4"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/21/texas-abortion-law_n_7631382.html", "ord_in_thread": 0, "title": "Texas Abortion Law Teed Up For Supreme Court Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["MARK SHERMAN"], "text": "Texas Abortion Law Teed Up For Supreme Court Review | By MARK SHERMAN reddit \nWASHINGTON (AP) — Abortion is back before the Supreme Court, and the justices could signal by the end of June whether they are likely to take up the biggest case on the hot-button subject in nearly a quarter-century. \nIf the court steps in, the hearing and the eventual ruling would come amid the 2016 presidential campaign. \nThe court is considering an emergency appeal from abortion providers in Texas, who want the justices to block two provisions of a state law that already has forced the closure of roughly half the licensed abortion clinics in the state. Ten of the remaining 19 clinics will have to shut their doors by July 1, without an order from the Supreme Court. \nThe Texas law is among a wave of state measures in recent years that have placed restrictions on when in a pregnancy abortions may be performed, imposed limits on abortions using drugs instead of surgery and increased standards for clinics and the doctors who work in them. \nThe Texas case involves the last of these categories. The provisions at issue require clinics to meet hospital-like surgical standards and also call on doctors who work in the clinics to have admitting privileges at a nearby hospital. Republican presidential candidate Rick Perry signed the law in 2013 when he was the state's governor. \nBackers of the law say those are common-sense measures intended to protect women. Abortion rights groups say the regulations have only one aim: to make it harder, if not impossible, for women to get abortions in Texas. \nThe case could be attractive to the justices because it might allow them to give more definition to the key phrase from their last big abortion ruling, Planned Parenthood v. Casey, in 1992. States generally can regulate abortion unless doing so places \"an undue burden\" on a woman's right to get an abortion. \n\"Courts have been fumbling for years about what does it mean to be undue under Casey,\" said Priscilla Smith, a Yale Law School professor and defender of abortion rights. \nSome abortion opponents also see the case as a strong candidate for Supreme Court review. \"The likelihood of this case getting to the Supreme Court is very high and I think that's a good thing,\" said Mike Norton, senior counsel for Alliance Defending Freedom, a Christian-oriented public interest law firm. \nThe justices blocked the two provisions once before, in November 2014 while the New Orleans-based 5th U.S. Circuit Court of Appeals was weighing whether those parts of the law violate a woman's right to an abortion. The appeals court upheld the provisions on June 9 and has since refused to put its ruling on hold while the clinics ready their appeal to the Supreme Court. \nIn 2013, four justices — enough to hear an appeal — said the high court probably would want to weigh in. In an earlier phase of the same case, Justice Stephen Breyer wrote that the court probably would take up the controversial provisions. \nThe constitutionality of the new law is a difficult question, Breyer wrote. \"It is a question, I believe, that at least four members of this court will wish to consider irrespective of the 5th Circuit's ultimate decision,\" he said in an opinion that was joined by the other three liberal justices. \nSince then, a different set of judges from the same appeals court has prevented Mississippi from enforcing its own admitting privileges requirement because doing so would close the last abortion clinic in the state. In that case, the court said that Mississippi could not force women to cross state lines to get an abortion. \nThe state already was seeking Supreme Court review and the justices could say as early as Monday whether they will weigh in, although the Texas case could cause the justices to defer action in Mississippi. \nIn Texas, women in the El Paso area in the western part of the state would have to cross into New Mexico to reach the nearest clinic. The appeals court said that wasn't a problem because many Texas women in that part of the state already do so. \nJustice Anthony Kennedy's views are likely to determine the outcome in this case, as in so many other divisive issues. \nKennedy was one of the three authors of the Casey opinion that reaffirmed a woman's right to an abortion and struck down a Pennsylvania requirement that women tell their husbands before getting an abortion. But he also wrote the 2007 opinion that upheld a federal ban on an abortion procedure that opponents call partial-birth abortion. \nLegal experts on both sides of the issue said there is no indication that Kennedy might abandon his support for abortion rights altogether. But they differ on how Kennedy will view the clinic restrictions. \n\"I think he's quite devoted to the Casey standard and to the sense of Casey as compromised,\" said Smith, who argued the 2007 case at the Supreme Court. \nBut Carter Snead, a Notre Dame University law professor and abortion opponent, said Kennedy generally has been willing to sustain legal restrictions on abortion. \n\"In fact, during his tenure on the court, he has only struck down one abortion restriction, namely, the spousal notification provision at issue in Planned Parenthood v. Casey,\" Snead said. Also on HuffPost: 10 Myths About Abortion That Need To Be Busted of   REALITY: Over 99.75 percent of abortions do not cause major medical problems. Less than one-quarter of 1 percent of abortions performed in the United States lead to major health complications, according to a 2014 study from the University of California, San Francisco, that tracked 55,000 women for six weeks after their abortions. The researchers note that this makes an abortion statistically about as risky as a colonoscopy. If that fact seems surprising, consider how American pop culture misrepresents the risks of abortion: Nine percent of film and television characters who have abortions die as a direct result of the procedure, according to another 2014 study from UCSF. REALITY: About one in five abortions are medical abortions. The Centers for Disease Control and Prevention found that 19 percent of abortions in 2011 were medical abortions and that 28.5 percent of those took place in the first nine weeks of pregnancy. The Guttmacher Institute also found that medical abortions increased substantially from 2008 to 2011, meaning more women have ended their pregnancies with this alternative to surgery. REALITY: Most women will not regret their decision, and are no more likely to experience mental health problems than women who carry an unplanned pregnancy to term. While many women experience mixed emotions after an abortion, 95 percent of women who have abortions ultimately feel they have made the right decision, according to an August 2013 study from UCSF. \"Experiencing negative emotions postabortion is different from believing that abortion was not the right decision,\" the researchers explained. Furthermore, while unplanned pregnancies often cause emotional stress, there is no evidence to suggest that women who choose to terminate their pregnancies will be more likely to suffer from mental health issues, according to a 2008 report from the American Psychological Association that investigated all relevant medical studies published since 1989. The APA found that past studies claiming abortion causes depression and other mental health problems consistently failed to account for other risk factors, particularly a woman's medical history. The APA accounted for these factors and found that, among women who have an unplanned pregnancy, those who have abortions are no more likely to experience mental health problems than those who carry the pregnancy to term. REALITY: Fetuses cannot feel pain until at least the 24th week of pregnancy. Experts ranging from Britain’s Royal College of Obstetricians and Gynaecologists to the American Congress of Obstetricians and Gynecologists agree with that timeline. In fact, research from UCSF found that fetuses can't perceive pain before 29 or 30 weeks of development. Then why have so many states banned abortions after 20 weeks of pregnancy? Perhaps misrepresentation of research is partly to blame: Many of the researchers most frequently cited by pro-life politicians told The New York Times that their research does not prove anything about fetal pain. REALITY: Most Americans support a woman's right to choose. According to a Gallup poll from 2014, 78 percent of Americans think abortion should be legal in some or all circumstances. (Fifty percent said \"some circumstances,\" while 28 percent said all.) What's more, in 2012, Gallup found that 61 percent of Americans think abortions that take place during the first trimester of pregnancy should be legal. (Nine out of 10 abortions in the U.S. do take place during that time period, according to Guttmacher.) REALITY: The abortion rate in the United States is the lowest it's been since 1973. The abortion rate has been on the decline for years, and hit its lowest level in 2011, according to the latest data available from the Guttmacher Institute. The study's author partially credited the decline to better contraceptive use and more long-term contraceptive options, such as the IUD. REALITY: Women face a growing number of barriers to accessing abortions. More than 57 percent of American women live in states that are hostile or extremely hostile to abortion rights, according to the Guttmacher Institute. That represents a marked increase from 2000, when 31 percent of American women lived in such states. In 2011, 89 percent of counties in America had no abortion clinics. This is no accident: Across the U.S., lawmakers have enacted 231 new abortion restrictions over the past four years, according to a Guttmacher analysis from January 2015. As a result, many women have to travel great distances to reach an abortion clinic, where they may face 24-hour wait periods. These barriers particularly affect women living in rural areas and low-income women, who often can't afford to take time off work and pay for gas and a hotel room. Other laws force women to go through potentially distressing procedures, such as viewing their own ultrasound photos, in order to move forward with an abortion. REALITY: Women rarely cite pressure from family or partners as leading to their decision to abort. A 2005 study from the Guttmacher Institute found that less than 1 percent of women surveyed cited such pressure among their main reasons for having an abortion. A 2013 study from UCSF reached a similar conclusion, and found that while women rarely cited partner coercion as a reason they sought an abortion, many did cite the desire to escape a bad relationship or domestic violence. REALITY: Most women who have abortions are already mothers. Sixty-one percent of women who had abortions in 2008 were mothers, and 34 percent had two or more children, according to the Guttmacher Institute. That number only increased after the 2009 financial downturn. The National Abortion Federation told Slate that between 2008 and 2011, 72 percent of women seeking abortions were already mothers. A study from Guttmacher found that mothers typically have abortions to protect the children they already have; they simply cannot afford to raise another child. REALITY: Requiring abortion clinics to meet these standards does little to improve patient safety and forces many to shut down. Currently, 22 states require abortion clinics to meet a set of restrictive and often arbitrary standards, dictating that they be close to hospitals and that their hallways and closets meet certain measurements. Clinics often need to undergo expensive renovations in order to comply, and leading doctors' groups say the laws do little to improve patient safety. What's more, 11 states now require that doctors at abortion clinics obtain admitting privileges at a nearby hospital, but many hospitals flat-out refuse to grant these privileges. As a result, hospitals essentially have the power to shut down nearby clinics.  Share ", "external_links": [], "published": "2015-06-21T21:13:00.000+03:00", "crawled": "2015-06-21T22:47:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}