{"organizations": ["Obama Administration Wants To Eliminate Trans Fat For Good Obama Administration Wants To Eliminate Trans Fat For Good"], "uuid": "15a49d02e70bd4decfa03bbb2d3ae840659b64b8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3056398/images/o-TRANS-FAT-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/10/obama-trans-fat_n_7553016.html", "country": "", "title": "Obama Administration Wants To Eliminate Trans Fat For Good", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Administration Wants To Eliminate Trans Fat For Good", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "15a49d02e70bd4decfa03bbb2d3ae840659b64b8"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/10/obama-trans-fat_n_7553016.html", "ord_in_thread": 0, "title": "Obama Administration Wants To Eliminate Trans Fat For Good", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["MARY CLARE JALONICK"], "text": "Obama Administration Wants To Eliminate Trans Fat For Good | By MARY CLARE JALONICK reddit \nWASHINGTON (AP) — There are a lot fewer trans fats in the nation's food than there were a decade ago, but the Obama administration is moving toward getting rid of them almost entirely. \nThe Food and Drug Administration says Americans still eat about a gram of trans fat every day, and phasing it out could prevent 20,000 heart attacks and 7,000 deaths each year. \nThe FDA originally proposed in November 2013 to phase out trans fats over time. The agency says it will make a final decision by June 15. \nFive things to know about trans fats and the government's proposed effort to get rid of them: \n___ \nWORST KIND OF FAT: Scientists say there are no health benefits to trans fats, which are used in processing food and in restaurants, usually to improve texture, shelf life or flavor. \nTrans fats can raise levels of \"bad\" cholesterol and lower \"good\" cholesterol, increasing the risk of heart disease, the leading cause of death in the United States. Trans fats are widely considered the worst kind for your heart, even worse than saturated fats, which also can contribute to heart disease. \nThe fats are created when hydrogen is added to vegetable oil to make it more solid, which is why they are often called partially hydrogenated oils. \n___ \nNO BLANKET BAN: To phase the fats out, the FDA made a preliminary determination in 2013 that trans fats no longer fall in the agency's \"generally recognized as safe\" category, which covers thousands of additives that manufacturers can add to foods without FDA review. Once trans fats are off that list, any company that wants to use them would have to petition the agency to allow it. That would phase them out almost completely, since not many uses are likely to be allowed. \nFDA officials said the agency may phase the fats out more quickly for some foods than others, depending on how easy it is to find substitutes. \n___ \nWORST OFFENDERS: Think baked goods, microwave popcorn and fried foods. Over the years, trans fats have been most plentiful in foods like frostings, which need solid fat for texture, or in those that need a longer shelf life or flavor enhancement. Popular foods that have historically contained trans fats are pie crusts, biscuits, microwave popcorn, coffee creamers, frozen pizza, refrigerated dough, vegetable shortenings and stick margarines. \nTrans fats also have been used by restaurants for frying. Many larger chains have stopped using them, but smaller restaurants may still get food containing trans fats from suppliers. \n___ \nMOST OF IT IS ALREADY GONE: The Grocery Manufacturers Association, the main trade group for the food industry, says that food manufacturers have voluntarily lowered the amounts of trans fats in their products by 86 percent since 2003. Food companies are using other types of oils to replace them. \nThat reduction was helped along by FDA's decision to force labeling of trans fats on food packages in 2006. There have also been local laws, like one in New York City, banning the fats. Retailers like Wal-Mart have reduced the amount they sell. \n___ \nINDUSTRY PLANS TO ASK FOR EXCEPTIONS: The Grocery Manufacturers Association is working with food companies on a petition that would ask the FDA to determine if there is a \"reasonable certainty of no harm\" from some specific uses of the fats. A spokesman for the group would not specify what the industry plans to ask for, but said the FDA encouraged food companies to submit a petition. \nThe advocacy group Center for Science in the Public Interest first petitioned FDA to ban trans fats nine years ago. The group's director, Michael Jacobson, praised the industry's efforts so far in reducing the fats but said federal action is necessary. \nA phase out would be \"the single most important thing the FDA has done about the healthfulness of our food supply,\" Jacobson said. \n___ \nFollow Mary Clare Jalonick on Twitter: http://twitter.com/mcjalonick Also on HuffPost: Foods With More Saturated Fat Than A Whopper of   Because baked goods are often made with milk, butter and eggs, many are high in saturated fats. This flaky pastry is no exception -- and the cheese filling certainly doesn't help. It'll cost you 16 grams of saturated fat, the same as a Whopper with cheese! Flickr photo by April J. Gazmen Scanning the menu of your favorite chain restaurant for a veggie-rich salad is a smart idea, but with too many of the wrong toppings, that salad can quickly become a diet disaster. The two kinds of cheese -- one of which is fried -- in this mix contribute to its 18 grams of saturated fat. Flickr photo by Jason Burrows A \"Love It\" or medium-size scoop of this beloved Cold Stone flavor will cost you 19 grams of saturated fat -- and that's before adding any mix ins! Flickr photo by Brian Haley Starting a meal off with the right bowl of soup can help you feel full so you won't overdo it during the course of the rest of the meal. But a bowl of the creamy New England Clam Chowder at seafood haunt Red Lobster could be a meal all on its own. A bowl serving contains 20 grams of saturated fat, almost enough to last you an entire day. Flickr photo by jpellgen There are 10 grams of saturated fat in one slice of a large Meat Lover's pizza from Pizza Hut -- but who stops at one? Splurge on that second slice and you'll have eaten your saturated fat for nearly an entire day. Flickr photo by Matt McGee Fresh green peppers, mushrooms, onions, tomatoes and Cheddar cheese -- this hearty breakfast is full of healthy ingredients, but, at 840 calories, it's simply too big a portion. Asking for egg whites or going light on the cheese can help, as can splitting an order, since the whole thing will set you back 26 grams of saturated fat. Flickr photo by sergeant killjoy Chicken fingers and French fries are a comfort meal for kids and adults alike, but the fat content isn't comforting in the slightest. The strips served at Friendly's come with cole slaw and fries and your choice of sauce. But it's the Buffalo variety that do the most damage. Five strips will set you back 26 grams of saturated fat, while five strips with BBQ sauce clock in at 9 grams. Flickr photo by Brick Photos Even if you split this creamy appetizer, it's still fattier than a Whopper with cheese. An entire order contains 42 grams of saturated fat. Flickr photo by dinemag You wouldn't expect a breakfast dish consisting of scrambled eggs, sausage, bacon, ham, mayo, cheese and hash browns to be low in fat, but the Grand Slamwich at Denny's has 44 grams of saturated fat, more than enough for two days. Flickr photo by Robert Simmons While you wouldn't expect an ice cream concoction to be particularly low in fat, you might be surprised to know just how much fat you slurp in that shake. The chocolate flavor from Shake Shack contains 46 grams of fat total, 27 of which are saturated. Flickr photo by Scott Beale Another restaurant known for its over-sized portions (unlimited breadsticks, anyone?), Olive Garden has plenty of figure-unfriendly options on the menu, but one of the fattiest offenders is the creamy Fettuccine Alfredo dinner, which will set you back 47 grams of saturated fat -- more than enough for two entire days. Flickr photo by chapstickaddict Bacon and cheddar cheese will add some significant saturated fat to this starter, but these skins are also served with sour cream, bringing the total saturated fat up to 58 grams. An order is meant to be shared -- let's just hope it's with at least three other people. Flickr photo by Bob B. Brown The Cheesecake Factory is known for its gigantic portions, and this dish is no exception, with 1,830 calories. While salmon contains a small amount of saturated fat naturally, it's not nearly enough to account for the 79 grams here. Flickr photo by Robert Banh  Share ", "external_links": [], "published": "2015-06-10T03:00:00.000+03:00", "crawled": "2015-06-11T02:23:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}