{"organizations": [], "uuid": "976bdc44925cae86d237944035a6acdb2f8a78e0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_060915getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/finance/244763-trade-vote-cliffhanger-for-obama", "country": "US", "title": "Trade vote cliffhanger for Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trade vote cliffhanger for Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T01:06:00.000+03:00", "replies_count": 0, "uuid": "976bdc44925cae86d237944035a6acdb2f8a78e0"}, "author": "Peter Schroeder and Scott Wong", "url": "http://thehill.com/policy/finance/244763-trade-vote-cliffhanger-for-obama", "ord_in_thread": 0, "title": "Trade vote cliffhanger for Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trade vote cliffhanger for Obama By Peter Schroeder and Scott Wong - 06/11/15 06:06 PM EDT \nHouse GOP leaders and the Obama administration are scrambling to win over lawmakers in both parties ahead of two critical trade votes on Friday. \nLast-second Democratic threats to vote down a bill granting aid to workers displaced by trade is threatening the larger package, and lawmakers in both parties say the outcome is in doubt. ADVERTISEMENT The White House late Thursday was pleading with Democrats to back Trade Adjustment Assistance, a program that traditionally has had more support from Democrats than the GOP.\nBecause of possible Democratic defections, Rep. Tom Cole (R-Texas) said the GOP whip team may have to approach some anti-TAA Republicans and ask them to vote yes. \n“I think Democrats are playing games with it right now. We’re in a situation where people are willing to cut off their nose to spite their face,” Cole, a deputy whip, told The Hill. “Liberal, pro-trade union Democrats are breaking ranks and destroying a program that they fought to create because they’re so much against TPA.” \nThe complicated path that GOP leaders and the White House are walking was highlighted Thursday night, when a House rule governing the debate narrowly passed — and only because eight Democrats broke ranks and supported it. \nThat rule sets up votes on both fast-track and TAA on Friday. If the TAA bill is defeated, however, there won’t even be a vote on fast-track and the whole package will collapse. \nThat has created an incentive for Democrats opposed to fast-track to vote against TAA in the hope it will drag the entire package down. \nSome pro-trade Democrats expressed frustration with the threat. \n“Certain people argued that this is the mechanism to kill TPA, and that that’s worth doing,” said Rep. Jim Himes (D-Conn.), who favors fast-track. “Other people pointed out that that’s a terribly cynical gamble.” \nCole said he felt good about the TAA vote but conceded “it will be tricky and it will be close. \nHouse Rules Committee Chairman Pete Sessions (R-Texas), who supports the entire trade package, said he had serious concerns the TAA vote could fail. But he was confident Democrats would bear the blame if they voted to kill the trade package. \n“We cannot pass this all by ourselves” Sessions said. “If we’re for it and they’re against, you can tell who gets blamed.” \nIt’s unclear how many Democrats might vote against TAA, but the Congressional Progressive Caucus on Thursday sent a letter to party leaders signed by 77 lawmakers, urging them to rework the TAA bill. \nWhile the letter did not say these members would definitely oppose the TAA bill as is, it suggests there could be a significant faction of Democrats with concerns. \nWith just hours to go before the critical votes, members in both parties were left with nothing but guesses on the final outcome. \n“The only thing that is predictable is the unpredictable,” said Rep. Steve Israel (D-N.Y.). “Anyone who tells you they know where this is going to land, is the last person you should be listening to.” \nThe White House argued that the tactic could kill a program that has helped millions of workers. \nAt the closed-door Democratic caucus meeting, Treasury Secretary Jack Lew told Democrats it was a “life or death” moment for TAA, according to an aide at the meeting. \nCritics of the approach argued that Republicans, who mostly do not support TAA, would not bring up another vote on the program if this one were defeated, letting the program expire at the end of the year. \n“The only people who care about this program is Democrats,” said Rep. John Delaney (D-Md.). “It’s not a bill that Republicans wake up and want to put on the floor.” \nBut some Democrats opposed to fast-track legislation argue voting against TAA is the best way to defeat it. \nDemocrats are also under intense pressure from labor unions and other liberal groups to vote fast-track down. \nAFL-CIO President Richard Trumka attended the same Democratic caucus meeting and urged Democrats to oppose the trade package. \nDemocrats are largely in favor of TAA, but some liberals have also griped that the program to be voted on Friday would not cover public sector union members. \nHouse Republicans did not want to change the actual text of the TAA legislation already passed by the Senate, because doing so would require sending it back to that chamber for another vote. \nAnd despite a deal between Boehner and House Minority Leader Nancy Pelosi (D-Calif.) that replaced cuts to Medicare as a way of paying for TAA, some liberals said the bill would still leave them exposed to charges that they voted to cut Medicare. \n“That’s still unacceptable to many of us. It should be in the language of the TAA,” said Rep. Raul Grijalva (D-Ariz.). ““It’s tortuous, it’s a gimmick, and we’re relying on people’s discretion.” \nA major question heading into Friday’s tight votes is whether the TAA tactic is a last gasp effort by liberals desperate to put the brakes on fast-track, or a growing movement within House Democrats unhappy enough with the process to vote against a program they almost exclusively favor. \nRep. Ron Kind (D-Wisc.), another fast-track backer, argued the anti-TAA forces were overblown. \n“The feedback we’re getting seemed a lot more positive on the Democratic side in support of TAA than what the story’s being written,” he said. “We’re going to get it done.” \nStill, some significant names announced they would oppose TAA, including Rep. Sandy Levin (D-Mich.), the top Democrat on the House Ways and Means Committee and a top Democrat on trade. \nOther Democrats insisted that voting to kill TAA would not defeat the fast-track bill — it could just slow it down. \n“My understanding is that if the TAA is voted down tomorrow, it does not mean that [fast-track] will not be brought back up,” said Rep. Joe Crowley (D-N.Y.). “The [fast-track] bill does not die, it can be brought back up again.”", "external_links": [], "published": "2015-06-12T01:06:00.000+03:00", "crawled": "2015-06-12T01:28:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}