{"organizations": [], "uuid": "989907e0c5e853104a8ad102ecbebda79d2b97b7", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3098254/images/o-TEXAS-ABORTION-PERRY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/index.xml", "section_title": "Women - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/20/parenthood-texas-abortion-clinics_n_7629102.html?utm_hp_ref=women&ir=Women", "country": "US", "title": "Planned Parenthood: No Texas Abortion Clinics In Works", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Planned Parenthood: No Texas Abortion Clinics In Works", "spam_score": 0.0, "site_type": "news", "published": "2015-06-21T01:32:00.000+03:00", "replies_count": 0, "uuid": "989907e0c5e853104a8ad102ecbebda79d2b97b7"}, "author": "AP", "url": "http://www.huffingtonpost.com/2015/06/20/parenthood-texas-abortion-clinics_n_7629102.html?utm_hp_ref=women&ir=Women", "ord_in_thread": 0, "title": "Planned Parenthood: No Texas Abortion Clinics In Works", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Planned Parenthood: No Texas Abortion Clinics In Works | By By PAUL J. WEBER Posted: Updated: 48 minutes ago AUSTIN, TX - JULY 01: Supporters of Texas women's right to reproductive decisions rally at the Texas State capitol on July 1, 2013 in Austin, Texas. This is first day of a second legislative special session called by Texas Gov. Rick Perry to pass an restrictive abortion law through the Texas legislature. The first attempt was defeated after opponents of the law were able to stall the vote until after first special session had ended. (Photo by Erich Schlegel/Getty Images) | Erich Schlegel via Getty Images reddit \nAUSTIN, Texas (AP) — Planned Parenthood President Cecile Richards said Saturday that her organization has no immediate plans to build more abortion clinics in Texas, where only eight facilities are likely to remain if another round of strict regulations takes effect July 1. \nOnly the U.S. Supreme Court can now stop Texas from forcing abortion facilities to be constructed like surgical centers, and prevent a second major wave of clinic closures statewide in as many years. Texas had 41 abortion clinics in 2012. \nMore than half shut down last year when a court allowed Texas to require doctors at abortion clinics to have hospital admitting privileges. Planned Parenthood locations were among those forced to stop offering abortions, and Richards said new construction is no cure-all to restoring abortion access. \nOf the handful of Texas abortion clinics that would be likely to stay open next month, half are operated by Planned Parenthood. All are exclusively in major cities in a state of 27 million people. \n\"We can build compliant facilities, but unless there is a local hospital that would give admitting privilege — which is a highly political issue, not a medical issue — it's very difficult,\" Richards told The Associated Press. \nRichards did not rule out more Texas clinics but said Planned Parenthood has none immediately in the pipeline. \nRichards, the daughter of former Texas Gov. Ann Richards, led a rally outside the Texas Governor's Mansion on Saturday in opposition of state lawmakers cutting off money to Planned Parenthood clinics that screen low-income women for cancer. It's the latest effort by the Republican-controlled Legislature to weaken the nation's largest abortion provider in Texas. \nShe was joined by Democrat Wendy Davis, whose failed run for Texas governor last year was propelled by her nearly 13-hour filibuster in 2013 to temporarily block sweeping anti-abortion measures. \nThe surgical center standards are the final major component of the law to take effect. Most traditional abortion clinics are like doctor's offices. But new rules upheld by the 5th U.S. Circuit Court of Appeals now require Texas abortion facilities to meet a range of building requirements, including standards over air ventilation systems and the dimensions of hallways and rooms. \nOn Friday, the same appeals court declined to put their ruling on hold until the Supreme Court reviews the case. \nOwners of small abortion clinics say they can't afford upgrades that they say would cost millions of dollars. Richards said Planned Parenthood would be ready to pick up the slack if needed. \n\"We have in other states, and if we have to in Texas, we will,\" Richards said. \n___ \nFollow Paul J. Weber on Twitter: www.twitter.com/pauljweber More:", "external_links": [], "published": "2015-06-21T01:32:00.000+03:00", "crawled": "2015-06-21T05:51:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}