{"organizations": [], "uuid": "72e954205a726cab403dc2373dcc8b689baef1bd", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3037274/images/o-MEDICAL-MARIJUANA-NEW-YORK-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/05/medical-marijuana-brooklyn-new-york_n_7518724.html", "country": "", "title": "As New York's Stringent Medical Marijuana Program Takes Shape, A Dispensary Could Come To Brooklyn", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "As New York's Stringent Medical Marijuana Program Takes Shape, A Dispensary Could Come To Brooklyn", "spam_score": 0.0, "site_type": "news", "published": "2015-06-05T18:24:00.000+03:00", "replies_count": 0, "uuid": "72e954205a726cab403dc2373dcc8b689baef1bd"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/05/medical-marijuana-brooklyn-new-york_n_7518724.html", "ord_in_thread": 0, "title": "As New York's Stringent Medical Marijuana Program Takes Shape, A Dispensary Could Come To Brooklyn", "locations": ["Calif.", "New York", "Brooklyn", "Oakland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As New York's Stringent Medical Marijuana Program Takes Shape, A Dispensary Could Come To Brooklyn Posted: Updated: 25 minutes ago FILE - This Feb. 1, 2011 file photo shows medical marijuana clone plants at a medical marijuana dispensary in Oakland, Calif. (AP Photo/Jeff Chiu, File) | ASSOCIATED PRESS reddit \nBrooklyn could become home to one of the 20 medical marijuana dispensaries expected to open across New York state as early as next year. \nA company called PalliaTech announced Thursday it has signed a lease on a 3,000-square-foot space in downtown Brooklyn, where it hopes to dispense cannabis products to patients as part of the state’s new, highly regulated medical marijuana program. \nThe lease, however, is contingent upon PalliaTech winning one the five coveted vendor licenses set to be issued by the state’s Department of Health. The deadline for license applications is Friday. \nThe state Department of Health wouldn’t say how many companies like PalliaTech had applied ahead of Friday’s deadline, but a spokesperson said the five vendor licenses will be awarded next month. \nPalliaTech’s executive vice president, Andrei Bogolubov, told The Huffington Post the application process has been “much more demanding” than in other states where medical marijuana has been legalized. That’s because New York’s medical marijuana program -- created after Gov. Andrew Cuomo signed the Compassionate Care Act last year -- has some of the strictest regulations in the country. \nWhereas in places like California, patients with a wide range of ailments can get access to cannabis in plant form, New York’s program will allow patients suffering from just 10 illnesses to ingest a refined version of the drug using vaporized oils, nebulizers, gel caps and other means that don’t involve smoking or edibles. \nNew York is requiring that these non-smokable forms of cannabis be developed to “pharma-like standards,” Bogolubov said, which “isn’t happening anywhere else in the country.” \nWhile some critics say such regulations are too strict , Bogolubov contends the regulations will make doctors more comfortable prescribing the drug and patients more comfortable taking it. \n“We believe that New York has set a national standard,” he said. “It will give doctors a tool so that they can finally unlock the therapeutic potential of cannabis, which is vast for patients in New York, and ultimately that will benefit people who suffer from disease.” \nA PalliaTech technician working at at lab in Pennsauken, N.J., that the company says produces medical cannabis products with processes that are compliant with the New York State standards. (Photo courtesy PalliaTech.) \nAdditionally, each of the five winning companies will only be allowed to open four dispensaries in New York, for a total of 20 dispensaries across a large state with a population of close to 20 million. As part of its proposal, PalliaTech has also signed leases in Newburgh, Rochester and Utica, a move the company says puts them within a 2-hours drive from 96 percent of the state’s population. \nThe company has also signed a lease for a research and development laboratory in Chazy, New York, where it would grow and maintain its supply of cannabis. \n“Public officials in each of these communities have embraced our plans for the dispensaries, and we look forward to serving New York patients in need of care as soon as possible,” said Richard Taney, PalliaTech’s president and CEO. \nAnd while PalliaTech was tight-lipped about which public officials were consulted, Brooklyn Borough President Eric Adams announced his support for a medical marijuana dispensary in the borough just an hour before the company said it had signed its lease in downtown Brooklyn. \n\"Brooklyn has a welcome mat for all the new, disruptive technologies,” Adams said during a speech at a “Building Brooklyn” conference in Manhattan’s Harvard Club on Thursday morning, according to Capital New York . \n“I want Airbnb. I want Bitcoin. I want a marijuana dispensary. Come to Brooklyn,” he said. More: ", "external_links": [], "published": "2015-06-05T18:24:00.000+03:00", "crawled": "2015-06-05T18:24:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}