{"organizations": [], "uuid": "f41af57805bab36a60b6433dcce85c8e0b61220f", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150604101844-marijuana-store-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_realestate.rss", "section_title": "Home mortgage rates and real estate news - CNNMoney.com", "url": "http://money.cnn.com/2015/06/04/real_estate/marijuana-denver-housing-market/index.html", "country": "US", "title": "How legal marijuana biz is boosting Denver's housing market - Jun. 4,", "performance_score": 2, "site": "cnn.com", "participants_count": 16, "title_full": "How legal marijuana biz is boosting Denver's housing market - Jun. 4, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T22:28:00.000+03:00", "replies_count": 16, "uuid": "a2092707d9145e7e37528172d9741149d85af298"}, "author": "Kathryn Vasel", "url": "http://money.cnn.com/2015/06/04/real_estate/marijuana-denver-housing-market/index.html#post-0", "ord_in_thread": 0, "title": "How legal marijuana biz is boosting Denver's housing market - Jun. 4,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How to legally sell marijuana Denver's housing market is on fire. Home prices have shot up by double-digits, inventory has fallen dramatically and multiple offers with bidding wars have become common.\nOne factor driving the demand: pot. The budding industry has impacted home prices since the state legalized marijuana in 2012.\n\"There has been a huge bump in real estate prices due to the legalization of marijuana,\" according to James Paine, managing partner at West Realty Advisors. \"It's massively pushed up raw land and industry prices.\"\nIn March, Denver experienced the second-largest jump in annual home prices at 10%, just behind San Francisco, according to the S&P/Case-Shiller Home Price Index.\nRelated: House hunting horror stories\nWhile the legalization of marijuana isn't the only thing driving the market, it has contributed to job growth in the area that has people flocking to Denver.\n\"The pot industry is creating jobs we didn't have before,\" said Kelly Moye, a Re/Max real estate agent who has worked in the Denver area for 24 years. \"It's brand new, it adds a whole new factor to the area; you have real estate needs, housing needs, job needs.\"\nThe industry has created jobs beyond growers and dispensaries. Legal marijuana has also been a boon for existing businesses like security and HVAC companies who service the new \"green\" businesses. \"Electricians have grown from mom and pops to big-time electric companies,\" said J.P. Speers, an agent at ‎Berkshire Hathaway Home Services.\nDenver and its surrounding areas have also become a hot spot for the tech industry, adding to the job rush.\n\"It's fairly affordable, at least for now,\" said Moye. \"The quality of life is great and employers are bringing their employees here.\"\nRelated: Why your rent check just keeps going up\nBut it's difficult to pinpoint exactly what enticed a person to move to the state. \"A lot of them try to hide it,\" said Speers, who has worked with clients moving to the state because of legalization . \"They don't necessarily say they are coming out to be part of the marijuana industry.\"\nHe said he helped find a rental unit for a mom coming from out of state to access medicinal marijuana for her daughter.\nHe's also seen an increase in lease-to-purchase or home rentals for tenants looking to start growing operations. \"They are not necessarily legal operations either,\" he said.\nWhile the new law might be creating more jobs and adding to the housing market's strength, it can sometimes work against sellers. \"I had a lot of trouble selling one property because one of the neighbors was growing so much that buyers were concerned,\" said Speers.\nRelated: World's hottest luxury housing markets\nFirst-time buyers and anyone looking for a home at the lower-end of the market face stiff competition. \"There are a lot of first-time buyers,\" said Toby Waters, a real estate agent with Vision Denver Homes. \"The rental market is insane, you can save money by buying a house.\"\nInventory has been tight in the city. In a normal market, Denver typically has around 24,000 listings, according to Moye. But right now, she said there are only around 4,000.\nBut there is the nagging question of just how long the real estate buzz will last.\nMoye said the market has room to run for five to seven years barring any major economic disasters.\nIf more states legalize marijuana, that could also take away some of the state's luster. \"We are going to continue to see an increase in population growth based on marijuana until other states start picking up recreational laws,\" said Speers.\n June 4, 2015: 2:28 PM ET", "external_links": [], "published": "2015-06-04T22:28:00.000+03:00", "crawled": "2015-06-04T22:12:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}