{"organizations": [], "uuid": "cf523e3f6bae66946f246eef96104bd0f4688a99", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_boehnerjohn_031715gn.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/house/245370-obama-gop-revive-fast-track-bill", "country": "US", "title": "Obama, GOP revive fast-track bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama, GOP revive fast-track bill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T03:52:00.000+03:00", "replies_count": 0, "uuid": "cf523e3f6bae66946f246eef96104bd0f4688a99"}, "author": "Alexander Bolton and Scott Wong", "url": "http://thehill.com/homenews/house/245370-obama-gop-revive-fast-track-bill", "ord_in_thread": 0, "title": "Obama, GOP revive fast-track bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama, GOP revive fast-track bill By Alexander Bolton and Scott Wong - 06/17/15 08:52 PM EDT \nPresident Obama and GOP leaders in both chambers are inching toward a deal to save the White House trade agenda. \nRepublican leaders announced the House will vote Thursday on giving Obama fast-track authority, less than a week after a failed vote left the president’s agenda in tatters. ADVERTISEMENT Obama and Speaker John Boehner (R-Ohio) both sought to win over pro-trade Democrats, Boehner holding a meeting with House Democrats on Tuesday and Obama conferencing with pro-trade Senate Democrats at the White House on Wednesday.\nBoehner, Obama and Senate Majority Leader Mitch McConnell (R-Ky.) are seeking to persuade them to buy into the plan crafted by GOP leaders to save fast-track, also known as trade promotion authority (TPA), which would \nallow the White House to complete a sweeping trans-Pacific trade deal under negotiation. \nUnder the plan, Congress would first approve fast-track and later deal with legislation granting aid to workers displaced by trade, a program known as Trade Adjustment Assistance (TAA). \n“We are committed to ensuring both TPA and TAA get votes in the House and Senate and are sent to the president for signature,” Boehner and McConnell pledged in a joint statement Wednesday afternoon. \nThe tricky part is that pro-trade Democrats in the House and Senate would need to support fast-track on the promise that the TAA bill would be dealt with later. \nPro-trade Democrats in the Senate have so far balked at the gambit because they are skeptical that sending a stand-alone fast-track bill to the president’s desk will guarantee passage of TAA in the House. \n“What the pro-trade Democrats are telling me is that much of what is being speculated on doesn’t give them the assurance they need that both are actually going to happen,” said Sen. Ron Wyden (Ore.), the senior Democrat on the Senate Finance Committee, who met with the president on Wednesday. \nThe White House and GOP leaders see decoupling TAA and fast-track as the best way to turn the total package into law. \nIn the House, Democrats have typically backed TAA, but they voted it down last week as a way of killing fast-track. Both measures had to be approved under the floor procedure set up by House Republicans. \nIf the fast-track bill were already law, it would take away the incentive for House Democrats to vote against TAA. \nWhile the sides appear to be moving closer to a specific procedural strategy, members who attended the Wednesday meetings said a final deal has not been struck. \n“There’s no clear solution in sight yet for what’s the best path,” said Sen. Chris Coons (D-Del.), who met with Obama. \nCoons described a “vigorous” discussion with the president. \nPro-trade Democrats are looking for other sweeteners, such as a vote to reauthorize the Export-Import Bank, which is set to expire at the end of June. \nThe Ex-Im issue cropped up during a meeting between Democrats from both chambers this week, when senators pointed out that McConnell had not made good on his word to hold a vote to renew Ex-Im. \nLast month, Washington Sens. Patty Murray and Maria Cantwell and other pro-trade Democrats blocked a vote on the original trade package until the majority leader agreed to hold a separate vote on Ex-Im. \n“They need to have an opportunity to vote on Ex-Im, however that opportunity is presented,” said Rep. Gerry Connolly (Va.), one of 28 House Democrats who backed fast-track last week. \nReid Walker, Cantwell’s spokesman, said his boss “is going to look for every opportunity to reauthorize the bank.” \nOther pro-trade Senate Democrats are urging Boehner to merge fast-track and TAA and bring that package to the House floor for a vote. \n“I’ve told the House repeatedly that that was my preference,” said Wyden. \nThey believe it could pass if pro-business interest groups step up their lobbying campaign directed at House conservatives. \n“I don’t understand why our challenge is to solve Boehner’s problem managing his own caucus,” Coons said. \nHouse GOP leaders expressed confidence they can pass fast-track for a second time in the House. \n“I think we can replicate the vote if need be on trade promotion authority, assuming the pro-trade Dems can vote yes,” Chief Deputy Whip Patrick McHenry (R-N.C.) told The Hill. \nPro-trade House Democrats emerged from a closed-door meeting in the Capitol Wednesday vowing to stick together and help Republicans pass fast-track for the second time in as many weeks. \n“Our coalition will hold,” said Connolly, whose views were shared by other key pro-trade Democrats, Reps. Ron Kind (Wis.) and Gregory Meeks (N.Y.). “I’m not going to speak for all 28, but the core of the coalition will hold. And that’s critical.” \nAs for TAA, Boehner gave “assurances” to Democrats earlier this week that the worker training and education bill would receive a separate vote in the House, lawmakers said. \nWhite House spokesman Josh Earnest on Wednesday signaled Obama is open to Congress sending him the two measures separately. \nEarnest said both measures must be delivered to the president’s desk, but he said they did not need to be packaged together and did not comment on timing. \nHe also dodged a question on whether Obama would veto fast-track legislation that did not come alongside the worker assistance bill, saying, “I don’t think it’s going to come to that.” \nThe problem Obama and Republican leaders now face is convincing pro-trade Democrats that if they take a leap of faith and vote for the trade measures separately, they will both wind up on the president’s desk. \n“I don’t feel confident about anything,” said Sen. Dianne Feinstein (D-Calif.), one of 14 Senate Democrats who voted for a package combining fast-track and TAA last month. \nJordan Fabian and Vicki Needham contributed. Tags:", "external_links": [], "published": "2015-06-18T03:52:00.000+03:00", "crawled": "2015-06-18T05:02:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}