{"organizations": [], "uuid": "84b7214db1043d80795d07c259c5ae5a1177a074", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/061115_hn_emanuel_640.jpg", "site_section": "http://feeds.feedburner.com/foxnews/latest\r", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/06/12/house-obama-trade-agenda/?intcmp=latestnews", "country": "US", "title": "LAST-DITCH PLEA: Obama on Hill to lobby House Dems to save trade bill", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "LAST-DITCH PLEA: Obama on Hill to lobby House Dems to save trade bill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T17:29:00.000+03:00", "replies_count": 0, "uuid": "84b7214db1043d80795d07c259c5ae5a1177a074"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/politics/2015/06/12/house-obama-trade-agenda/?intcmp=latestnews", "ord_in_thread": 0, "title": "LAST-DITCH PLEA: Obama on Hill to lobby House Dems to save trade bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama went to Capitol Hill Friday morning to make a final plea to congressional Democrats for his trade agenda, ahead of a showdown vote in the House. \nThe president met with House Democratic leaders ahead of a caucus meeting. While it is extremely rare for a president to make a visit like this before a big vote, the last-minute lobbying comes after the president also made a surprise appearance at the annual congressional baseball game between Democrats and Republicans the night before. His personal involvement underscores how fragile the effort is -- Fox News is told the effort is still short on the votes -- and how important he sees it to his second-term legacy. \nThe night before, a bizarre scene unfolded as the crowd crammed inside Nationals Park lurched into a chant about the legislation. \n“TPA! TPA! TPA!” chanted Republican congressional aides seated near the first base dugout when Obama stepped onto the field at the top of the fourth inning. \nThis wasn’t quite the drunken, Bronx throng at Yankee Stadium cantillating “Reg-GIE! Reg-GIE! Reg-GIE!” after Reggie Jackson swatted three consecutive home runs in Game Six of the 1977 World Series. This was gamesmanship, Washington-style. A game in which most congressional Republicans find themselves backing the Democratic president’s efforts to pass Trade Promotion Authority (TPA), a framework for a big trade deal the administration hopes to advance later this year. \nTPA, which would give the president the ability to \"fast-track\" future trade deals, is one of two bills due up in the House on Friday. And it’s anybody’s guess if the bills will pass. Members of Congress may have been mixing it up on the diamond. But there is just as much gamesmanship underway on Capitol Hill as lawmakers try to leverage passage or defeat of the trade legislation. \nFirst, the basics. \nMost House Republicans want to approve TPA. But they don’t quite have the votes to do it on their own. They need Democratic support. Yet the irony is that even though Obama is pushing the deal, only about 20-plus House Democrats support their own chief executive on this issue. \nSo various political gambits kick in. \nRepublicans find it absurd that Obama can’t persuade more than two-dozen Democratic members to support the trade plan. Conversely, House Minority Leader Nancy Pelosi, D-Calif., is stunned that House Republicans, boasting a 246-188 majority, can’t excavate at least 200 GOPers to approve the package. \nSo Pelosi and House Speaker John Boehner, R-Ohio, cut a deal. Neither side promised a certain number of votes to the other. But both House leaders forged a plan which could conceivably reward both sides with a political victory and concurrently test their respective abilities to gin up votes. \nPelosi and Boehner engineered a deal to advance the trade framework to the floor – so long as Democrats scored a vote on something called Trade Adjustment Assistance (TAA). \nTAA is a program near and dear to the hearts of many Democrats. It’s a method to cushion the blow for various workers and industries damaged by business reallocations in trade agreements. So House Majority Leader Kevin McCarthy, R-Calif., teed up two votes for Friday: One for TAA and one on TPA. But a TPA vote was contingent on the House first adopting TAA. The procedural maneuver would require Republicans to carry most of the freight to adopt TPA. But to get there, Democrats would be expected to provide the lion’s share of votes for TAA. If the House doesn’t approve TAA, everything comes to a screeching halt and there’s no vote on TPA. \nFurther complicating matters, Pelosi has spoken openly against the trade accord but has yet to definitively say how she’ll vote. \nCapitol Hill is weird. Weird enough to have Republicans serving as Obama’s TPA cheerleaders – both at the ballpark and in the House chamber. It’s even weirder to have House Democrats working against Obama on this. And then there’s Pelosi – stuck in the middle. \nOn trade, Pelosi is a switch-pitcher. She’s trying to keep the Democratic caucus from embarrassing Obama with a paltry vote total for TPA. Yet she’s working to make sure most of her caucus gets what it wants: a defeat of TPA. At the same time, Pelosi secured a deal for the TAA vote – which could help pass TPA … or blow it up. \nMajor League Baseball has a rule for ambidextrous pitchers, few as there may be. Such cross-hurlers must first declare whether they intend to pitch left-handed or right-handed to each batter. There’s no such rule on Capitol Hill. That’s why when it comes to trade, Pelosi is chucking political curveballs from both sides of the mound. \nBut Democrats are working against Pelosi. A senior House GOP leadership source says Republicans can only provide 50 to 70 votes for TAA. Democrats must make up the difference. However, many Democrats now see a means to an end. Some intend to vote no on TAA simply to detonate the entire process and never get the TPA bill to the floor -- which they so despise. \nThe House nearly voted to truncate the entire process before the first pitch, coming close to voting down a procedural vote just to get the measures to the floor. \nSome observers interpreted the uneven procedural vote as a harbinger of things to come Friday on the trade bills. Some lawmakers wondered if Obama – fresh off his dugout diplomatic mission -- might ring up lawmakers and implore them to vote aye. \nOne longtime Democratic member doubted that would happen, noting that Obama had already done all of the calling he could do. \nThere are games here, too. The same lawmaker signaled that some colleagues might not even take the call if the president phones. In fact, they might even keep their phones switched off. Advertisement", "external_links": [], "published": "2015-06-12T17:29:00.000+03:00", "crawled": "2015-06-12T17:47:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}