{"organizations": [], "uuid": "23698238d89f0494a4b21feed873933dbc4b3b4b", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/24/politics/trade-taa-tpa-congress-house-pelosi/index.html", "country": "", "title": "Senate sends key trade bill to Obama - CNNPolitics.com", "performance_score": 4, "site": "cnn.com", "participants_count": 0, "title_full": "Senate sends key trade bill to Obama - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T01:44:00.000+03:00", "replies_count": 0, "uuid": "23698238d89f0494a4b21feed873933dbc4b3b4b"}, "author": "", "url": "http://www.cnn.com/2015/06/24/politics/trade-taa-tpa-congress-house-pelosi/index.html", "ord_in_thread": 0, "title": "Senate sends key trade bill to Obama - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Senate sends key trade bill to Obama Updated 2238 GMT (0538 HKT) June 24, 2015 JUST WATCHED Congress grants President Barack Obama \"fast-track\" authority needed to move ahead on trade agenda After House Democrats scuttled Obama's plans, Republicans rallied to his cause Washington (CNN) The Senate on Wednesday cleared a bill to give \"fast-track\" congressional approval of major international trade deals and will send it to President Barack Obama for his signature. The vote was 60 to 38. The Senate is now voting on a related bill dealing with assistance to U.S. workers who lose their jobs because of those free trade pacts. It's expected to pass and go to the House for a vote Thursday. JUST WATCHED Key trade bill passes the Senate 01:12 PLAY VIDEO RELATED: Obama's trade agenda moves past key Senate hurdle House Democratic Leader Nancy Pelosi, who voted against the worker's bill two weeks ago as a means to torpedo the fast track bill, said Wednesday she will now support the bill, all but assuring it will pass and be signed into law by the President. That means after a bruising and embarrassing defeat less than two weeks ago, Obama appears on track to get his trade agenda approved on Capitol Hill. The Trans-Pacific Partnership is a 12-nation deal that would link 40% of the world's economy -- including the United States, Japan, Australia, Canada and Mexico. The United States has been involved in the negotiations since early in Obama's first term and he has spent considerable political capital on getting a deal done as part of his \"pivot to Asia\" agenda. Passing a final trade deal would significantly increase America's economic clout in the fast-growing and increasingly economically important region. The deal on fast-track was accomplished when Republican congressional leadership paired with Obama on some creative legislative maneuvering after the Pelosi-led House Dems initially scuttled the measure. Pelosi, whose high-profile break with the President helped defeat his trade package in its initial House vote, announced Wednesday she will now vote for a bill providing assistance to workers displaced by global trade, known as trade adjustment assistance. \"I'm disappointed that the (trade assistance) bill isn't nearly as robust as it should be in light of a trade agreement that encompasses 40% of the global economy,\" she said in a letter to her House Democratic colleagues. But Pelosi added she would support it \"because it can open the door to a full debate on (the broader trade deal).\" Pelosi's support is significant because the measure will need significant Democratic support because most Republicans oppose it. CNN's Eric Bradner contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Politics Originals Story by Stephen Collinson and video by Ashley Codianni It wouldn't be the first time a revolution sparked in New England changed the world. ", "external_links": [], "published": "2015-06-25T01:44:00.000+03:00", "crawled": "2015-06-25T01:46:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}