{"organizations": [], "uuid": "61c98ef23271025b366d0c68748c2ad656f05f6d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/061815_dcl_clinton_460.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/19/clinton-breaks-with-obama-on-trade-despite-supporting-deal-as-secretary-state/", "country": "US", "title": "Clinton breaks with Obama on trade, despite supporting deal as secretary of state", "performance_score": 4, "site": "foxnews.com", "participants_count": 27, "title_full": "Clinton breaks with Obama on trade, despite supporting deal as secretary of state | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T03:00:00.000+03:00", "replies_count": 39, "uuid": "330551f82739482e43b1290e5fe89f75435aace8"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/19/clinton-breaks-with-obama-on-trade-despite-supporting-deal-as-secretary-state/#post-0", "ord_in_thread": 0, "title": "Clinton breaks with Obama on trade, despite supporting deal as secretary of state", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com livefyre Email Print\nAfter being coy for weeks on her position, Hillary Clinton on Thursday clearly broke with President Obama on his trade push -- despite having supported the trade deal he wants as secretary of state.\nThe now-Democratic presidential candidate made her position clear in an interview with veteran Nevada political reporter Jon Ralston.\nAfter speaking at length about the uncertainty of what's in the deal and trade in general, Clinton was pressed for a yes-or-no answer on whether she'd vote for the package going through Congress.\n\"At this point, probably not,\" she said.\nClinton indicated last weekend she was leaning against the plan, urging Obama to work more with \"allies\" in Congress including House Democratic Leader Nancy Pelosi, who helped scuttle a major vote last week. Clinton urged all sides to get the \"strongest deal possible,\" and said there should be no deal absent that.\nBut Thursday's interview was the first time she said whether she'd support or oppose the plan on the table.\nThe position came with some caveats -- noting that the trade agenda includes several distinct elements.\nAfter the push nearly derailed last week amid Democratic resistance, the House on Thursday approved the centerpiece measure known as Trade Promotion Authority, a bill giving the president \"fast-track\" authority to push trade deals through Congress. He wants this in order to ink a massive trade pact with Pacific nations known as the Trans-Pacific Partnership.\nClinton, as secretary of state, had advocated for this deal -- repeatedly.\nBut in her interview with Ralston, she stressed the bill before Congress is a \"process vote\" and not \"the same as TPP.\" She said her qualms about supporting it specifically have to do with a worker-aid measure, known as Trade Adjustment Assistance, that was stripped from the package Thursday.\n\"Right now, I'm focused on getting Trade Adjustment Assistance and I certainly would not vote for it unless I was absolutely confident we would get Trade Adjustment Assistance,\" Clinton said.\nThe measure would give aid to workers displaced by trade. Democrats still demand that the measure be included in the final set of bills, and the White House and congressional leaders are pledging to make sure that happens.\nBut the fact that it's not glued right now to the TPA bill could endanger its prospects as the legislation heads back to the Senate -- where Clinton's comments could fuel resistance to the deal.\nAdvertisement\nTrending in Politics 1 Clinton breaks with Obama on trade, despite supporting deal as secretary of state 2 Why NBC cut Brian Williams loose as anchor -- and really had no choice 3 Rand Paul pitches plan to 'blow up' tax code 4 Company that got millions from US taxpayers now profits Chinese owners 5 Sources: Clinton confidant who sent Libya memos paid $200G by Brock network See all Trends Advertisement", "external_links": [], "published": "2015-06-19T03:00:00.000+03:00", "crawled": "2015-06-19T18:19:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}