{"organizations": ["Senate"], "uuid": "a030b8a6344a2552a0c329e8c123a834d4278441", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3108024/images/o-OBAMA-SMILE-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/23/senate-fast-track_n_7645348.html", "country": "", "title": "Senate Gives Obama Huge Win On Trade", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Senate Gives Obama Huge Win On Trade", "spam_score": 0.0, "site_type": "news", "published": "2015-06-23T18:37:00.000+03:00", "replies_count": 0, "uuid": "a030b8a6344a2552a0c329e8c123a834d4278441"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/23/senate-fast-track_n_7645348.html", "ord_in_thread": 0, "title": "Senate Gives Obama Huge Win On Trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate Gives Obama Huge Win On Trade Posted: reddit \nWASHINGTON -- The Senate on Tuesday handed President Barack Obama the biggest legislative victory of his second term, with a dramatic vote clearing the way for major trade agreements with Pacific Rim nations and the European Union. \nThe 60-37 vote all but ensures the passage of legislation that will allow Obama to \"fast-track\" the trade pacts he negotiates through Congress, preventing filibusters or amendments. Liberals have long assailed Obama's trade agenda, but Republicans successfully wooed a bloc of Democrats led by Sen. Patty Murray (D-Wash.) and Ron Wyden (D-Ore.) to secure enough votes to overcome a filibuster. \nWith the 60-vote threshold cleared, the path is now open for the Senate to take a final vote on the legislation on Wednesday. \nThe fate of the bill, also known as Trade Promotion Authority, hinged on whether backers of the fast-track legislation could win over Democratic Sens. Maria Cantwell (Wash.), Heidi Heitkamp (N.D.) and Chris Coons (Del.). All three remained mum as to their intentions before the vote, with Coons lambasting the Senate on his way to the chamber for taking up a free trade vote while at the same time letting financing for exports, through the Export-Import Bank, lapse. It wasn't enough to sway his vote, though, as all three voted to move forward. \nThe vote came down to the wire, thanks to an eleventh-hour reversal by Sen. Ted Cruz (R-Texas), who announced his opposition in a bombastic op-ed for Breitbart News that sent Majority Leader Mitch McConnell (R-Ky.) scrambling for additional Democratic support. \nStill, the razor-thin margin of the final vote count masks the fact that McConnell had slightly broader support at his disposal. Sen. Ben Cardin (D-Md.) stood by the table in the well of the Senate for most of the vote, waiting for the measure to get across the threshold of 60. As soon as it did, with a vote by Sen. Dean Heller (R-Nev.), Cardin voted no, suggesting he had been willing to vote yes if needed. \nAs Heller rushed onto the chamber floor, Sen. John Barrasso (R-Wyo.), standing right outside the door, smiled at him, and shouted: \"Here's Mr. 60!\" \nSens. Mike Lee (R-Utah) and Bob Menendez (D-N.J.), both opponents of the trade legislation, missed the vote, as did supporter Bob Corker (R-Tenn.). \nThe revival of Obama's trade agenda follows a wild month of congressional maneuvering in which House Democrats nearly derailed the entire project by defeating a Trade Adjustment Assistance measure that would provide financial aid and job training to workers who lose their jobs due to foreign competition. \nAlthough Democrats overwhelmingly support TAA, they revolted against it in the House for tactical reasons. Because the TPA bill depended on TAA's passage, the Democratic defection on TAA dealt an embarrassing, although ultimately temporary, blow to the prospects for Obama's trade pacts. \nNow, the fate of the TAA bill remains undecided. Many Senate Democrats insisted their vote on Wednesday was conditional on the passage of separate TAA legislation. The Senate will likely pass that legislation on Wednesday, but the bill faces steeper challenges in the House, where Republicans overwhelmingly oppose it. Obama has said he wants both TAA and the fast-track bill to be enacted. House Speaker John Boehner (R-Ohio) has said he will deliver the votes necessary for its passage. \nMurray, on her way to the Senate floor, told reporters she'd been given assurances by McConnell and Boehner that Congress would take up assistance to workers displaced by the deal. \nVotes on the trade deals themselves will come later in Obama's tenure, and the fast-track authority will extend into the next presidency. First in line, however, is the Trans-Pacific Partnership with 11 other Pacific Rim nations. Democrats, labor unions, environmental groups and open Internet advocates have sharply criticized leaked drafts of the pact, saying it will exacerbate income inequality and undermine key regulations. Obama, Republican leaders and the U.S. Chamber of Commerce have all said the deal will boost economic growth. \nThis is a developing story and will be updated. \nRyan Grim and Laura Barron-Lopez contributed reporting. More: ", "external_links": [], "published": "2015-06-23T18:37:00.000+03:00", "crawled": "2015-06-23T20:00:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}