{"organizations": [], "uuid": "46d7571ff09d53296c3dbb02a86780ac56adf56d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_062515getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed#", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/246226-after-euphoric-day-obama-heads-to-charleston-to-grieve", "country": "US", "title": "After euphoric day, Obama heads to Charleston to grieve", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "After euphoric day, Obama heads to Charleston to grieve", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T13:00:00.000+03:00", "replies_count": 0, "uuid": "46d7571ff09d53296c3dbb02a86780ac56adf56d"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/246226-after-euphoric-day-obama-heads-to-charleston-to-grieve", "ord_in_thread": 0, "title": "After euphoric day, Obama heads to Charleston to grieve", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After euphoric day, Obama heads to Charleston to grieve Getty By Jordan Fabian - 06/26/15 06:00 AM EDT \nFresh off two exhilarating political victories, President Obama will turn to a solemn task on Friday as he travels to South Carolina to deliver a eulogy for the victim of a massacre at an African-American church. \nObama will deliver the eulogy for Rev. Clementa C. Pinckney, a friend and political ally who was among the nine victims of last week’s mass shooting at the Emanuel African Methodist Episcopal Church in Charleston, S.C. ADVERTISEMENT The president has played the role of consoler-in-chief many times, including at memorial services for the victims of the mass shootings in Newtown, Conn., and Tucson, Ariz. Most recently, he delivered an emotional tribute to Vice President Biden’s son, Beau Biden, after his death from brain cancer.\nThe shooting in Charleston hits especially close to home, coming at a church that is steeped in the history of the civil rights movement that Obama has invoked throughout his political career. \nThe memorial service will be a jarring contrast from Thursday, when the White House was in a triumphant mood following the passage of trade legislation and the Supreme Court ruling in favor of ObamaCare. \nA beaming Obama took a victory lap in the Rose Garden, telling the nation that his signature healthcare law is “here to stay” and “woven into the fabric of America.” \nBut the political elation was tempered by the tragedy in South Carolina, which has confronted Obama with two of the most intractable problems of his tenure: high-profile mass shootings and racial division. \nThe suspect in the Charleston shooting, Dylann Storm Roof, allegedly told police he intended to start a race war. The apparent racial motive has set off a furious debate over the Confederate Flag, and prompted the president to use the N-word in a frank interview about race relations. \nThe White House said it was too early say whether Obama would use his eulogy of Pinckney to address gun violence and racism, as he was still drafting the address with his top speechwriter Cody Keenan late Thursday. \n“The focus of the speech will be on celebrating the life of Rev. Pinckney and the eight others who were killed in the shooting last week,” press secretary Josh Earnest said. \nObama will be traveling to Charleston with First Lady Michelle Obama, Biden and Dr. Jill Biden, will also meet with victims’ families. \nIt’s likely that Obama will use the eulogy to amplify his call for stronger gun laws, which he first made last week in the aftermath of the Charleston attack. \n“Now is a time for mourning and for healing, but let’s be clear: at some point, we as a country will have to reckon with the fact that this type of mass violence doesn’t happen in other advanced countries,” he said . \nObama used his Newtown address to urge lawmakers to pass new gun control laws, calling it a test of whether the nation could keep its children safe. But that push turned into one of the most stinging defeats of his presidency, with the legislation never making it out of the Senate. \nHe recently told comedian Marc Maron his defeat on guns was “the closest I came to feeling disgusted.” \nObama told Maron he’s not afraid to talk about gun control despite the long odds of success. \n“I think a part of the point I wanted to make was that it’s not enough just to feel bad,” Obama said of his post-Charleston comments. “There are actions that could be taken to prevent events like this.” \nThe latest has shooting also sparked a new debate about race, and issue that has reared its head many times during Obama’s presidency despite predictions his election to the White House would heal old wounds. \nObama said the fact the Charleston shooting occurred at a black church “raises questions about a dark part of our history.” And the White House reiterated Obama’s call for the Confederate flag to be retired from state property, a step many officials around the country are beginning to take. \nThe president said after the shooting the “long shadow” of slavery and Jim Crow laws continues to exist today. \n“Racism, we are not cured of it,” Obama told Maron. “And it’s not just a matter of it not being polite to say n", "external_links": [], "published": "2015-06-26T13:00:00.000+03:00", "crawled": "2015-06-26T15:38:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}