{"organizations": [], "uuid": "cf2bbeb225ecef3f6c66e9856a023d25ed8c6444", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3061448/images/o-LINDSEY-GRAHAM-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/11/lindsey-graham-abortion_n_7561410.html", "country": "", "title": "Lindsey Graham Reintroduces 20-Week Abortion Ban: 'I Am Dying For That Debate'", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Lindsey Graham Reintroduces 20-Week Abortion Ban: 'I Am Dying For That Debate'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T09:41:00.000+03:00", "replies_count": 0, "uuid": "cf2bbeb225ecef3f6c66e9856a023d25ed8c6444"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/11/lindsey-graham-abortion_n_7561410.html", "ord_in_thread": 0, "title": "Lindsey Graham Reintroduces 20-Week Abortion Ban: 'I Am Dying For That Debate'", "locations": ["Iowa", "Waterloo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scott Olson", "Lindsey Graham"], "text": "Lindsey Graham Reintroduces 20-Week Abortion Ban: 'I Am Dying For That Debate' Posted: Updated: 06/11/2015 3:59 pm EDT Waterloo, Iowa -- Republican presidential hopeful Sen. Lindsey Graham (R-S.C.) speaks at a campaign stop at Veteran of Foreign Wars Post 1623 on June 5, 2015 in Waterloo, Iowa. (Photo by Scott Olson/Getty Images) | Scott Olson via Getty Images reddit \nSen. Lindsey Graham (R-S.C.) reintroduced a ban on abortions after 20 weeks of pregnancy on Thursday and said he would \"insist\" that the bill get a vote in the Senate. \n\"Why do we want to let this happen five months into the pregnancy?\" said Graham, who recently announced his 2016 presidential run. \"I am dying for that debate. I'm going to quite frankly insist that we have that debate.\" \nThe Pain-Capable Unborn Child Protection Act, which the House passed earlier this year , bans abortions after 20 weeks unless the woman's life is in danger or she is a victim of rape or incest. The bill is based on the disputed theory that fetuses can feel pain at 20 weeks. \nAbortions after 20 weeks are very rare and women often make the decision to end a pregnancy at that point after discovering a severe fetal anomaly that could not be detected earlier. Graham's bill has no exception for those situations. \nMost Democrats in Congress oppose the bill because it challenges Roe v. Wade, the Supreme Court's landmark abortion rights decision in 1973, and interferes with women's medical decisions. The high court ruled in Roe that women have a constitutional right to seek abortion up until the point the fetus would be viable outside the womb -- around 22 to 24 weeks. \n\"I'm calling on Republican leaders to drop this dangerous political attack, listen to women across the country who have made clear they don't need a politician at their doctor's appointments, and focus on the real challenges our country faces,\" Sen. Patty Murray (D-Wash.) said in a statement. \nThe president of the American Congress of Gynecologists and Obstetricians, an association of doctors, said Thursday that he strongly opposes Graham's bill. \"As an ob-gyn, I know firsthand the reasons why women may need abortion care after 20 weeks, and I have seen the pain that many of these women are in when confronting these decisions,\" said Dr. Mark DeFrancesco, president of ACOG, in a statement. \"Yet this ban would force physicians to deny services, even to women who have made the difficult decision to end pregnancies for reasons including fetal anomalies diagnosed later in pregnancy or other unexpected obstetric outcomes. This is simply cruel.\" \nGraham said he believes a majority of Americans support his legislation. \"America is thinking about the baby,\" he said. \"This is no longer an academic debate.\" \nGraham's bill likely does not have the votes to overcome a Democratic filibuster in the Senate. Also on HuffPost: ", "external_links": [], "published": "2015-06-12T09:41:00.000+03:00", "crawled": "2015-06-12T09:41:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}