{"organizations": ["Amtrak", "Senate", "Maeve Reston", "Congress", "White House", "Emanuel African Methodist Episcopal Church", "National Rifle Association", "CNN", "NRA"], "uuid": "5db4e51e76c3e5e5b892a1f5fc7d04144d5bcd0f", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/18/politics/hillary-clinton-barack-obama-charleston-gun-reform/index.html", "country": "", "title": "Clinton, Obama seek gun control in wake of Charleston - CNNPolitics.com", "performance_score": 4, "site": "cnn.com", "participants_count": 0, "title_full": "Clinton, Obama seek gun control in wake of Charleston - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T06:45:00.000+03:00", "replies_count": 0, "uuid": "5db4e51e76c3e5e5b892a1f5fc7d04144d5bcd0f"}, "author": "", "url": "http://www.cnn.com/2015/06/18/politics/hillary-clinton-barack-obama-charleston-gun-reform/index.html", "ord_in_thread": 0, "title": "Clinton, Obama seek gun control in wake of Charleston - CNNPolitics.com", "locations": ["New Hampshire", "Las Vegas", "U.S.", "Newtown", "Washington", "R-South Carolina", "South Carolina", "Charleston", "New England", "New Jersey", "Connecticut"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sanford", "Bernie Sanders", "Barack Obama", "Mary Pat", "Dylann Roof", "Ashley Codianni", "Obama", "Stephen Collinson", "Sanders", "Clinton", "Hillary Clinton", "Dan Merica", "Kevin Bohn", "Mark Sanford", "Wolf Blitzer", "Chris Christie", "Andrew Arulanandam", "Christie"], "text": "The crime solvers: One bullet, one story Washington (CNN) President Barack Obama and other top Democrats -- including Hillary Clinton -- find themselves in a familiar place following the mass shooting in Charleston, South Carolina, on Wednesday: Pleading for gun control while knowing it's unlikely to happen. \"At some point, we as a country will have to reckon with the fact that this kind of mass violence does not happen in other advanced countries,\" he said, taking a long pause before continuing. \"It doesn't happen in other places with this kind of frequency. It is in our power to do something about it.\" Obama made a similar pitch in December 2012 after a gunman killed 20 young school chidren and six adults in Newtown, Connecticut. Then, the President invested significant political capital in an attempt to advance gun control legislation through Congress. But his efforts -- combated by pro-gun groups like the National Rifle Association -- were rebuffed in the U.S. Senate during a series of votes in April 2013. He called it \"a pretty shameful day in Washington.\" RELATED: Obama reacts to mass U.S. shootings Since then, though other shootings have occurred, the President has not resurrected the same effort to achieve gun reform, an unlikely prospect with the GOP-controlled Congress. But other Democrats sought to highlight the cause in the wake of Wednesday's events, in which nine African-American parishioners of Emanuel African Methodist Episcopal Church were killed, allegedly by 21-year-old Dylann Roof, who is white. Authorities say they are investigating it as a hate crime. \"How many innocent people in our country, from little children, to church members, to movie theater attendees, how many people do we need to see cut down before we act?\" said Hillary Clinton, the Democratic frontrunner for the 2016 presidential nomination, at an unrelated event in Las Vegas. \"In order to make sense of it, we have to be honest. We have to face hard truths about race, violence, guns and division,\" she said. The NRA declined to comment on Thursday on the Charleston shooting. \"The NRA will not be making any public statements until the facts are known,\" spokesman Andrew Arulanandam told CNN. Rep. Mark Sanford, R-South Carolina, told CNN's Wolf Blitzer on Thursday Obama and Clinton were out of line to push for gun reform in the days after the killings. \"Too often in the wake of tragedies like this, advocates on both sides of the debate, use the debate towards their own end,\" Sanford said. \"Moving to a large debate on gun control I don't think is what should come in the immediate aftermath, within 24 hours, of this tragedy taking place.\" New Jersey Gov. Chris Christie echoed that sentiment in comments to CNN following a town hall event in New Hampshire on Thursday evening. \"We don't even really know what the facts are here,\" he said. \"This is obviously a depraved act and something that those families don't even know how to deal with at this point. So that's where we should focus.\" Christie said once \"all the facts\" are in, it will be the time to look at potentially changing policies. \"I have faith in the criminal justice system, that we'll get all the facts. And then we can make some policy decisions if we need to here,\" he said. \"Right now we shouldn't be talking about that. Both Mary Pat and I are praying for (the families in Charleston) and I can't imagine their loss.\" Another Democrat seeking the White House declined to use the incident as a means for pushing for reforms. Vermont Sen. Bernie Sanders, who despite being a liberal hero on most issues has a more moderate record on gun control. He voted against the landmark gun bill, the Brady Act, in 1993 and has voted to allow guns on Amtrak trains in the past. In 1994, however, he voted in favor of the assault weapons ban. And after the shootings in Newtown, Sanders voted for background checks and an assault weapons ban. On Thursday, Sanders issued a statement calling the Charleston shooting a \"hateful killing\" but did not tie it to a call for gun control. His campaign did not respond to a request for comment from CNN on his position on gun control on Thursday. CNN's Kevin Bohn, Dan Merica and Maeve Reston contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Politics Originals Story by Stephen Collinson and video by Ashley Codianni It wouldn't be the first time a revolution sparked in New England changed the world. ", "external_links": [], "published": "2015-06-19T06:45:00.000+03:00", "crawled": "2015-06-19T07:38:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}