{"organizations": ["Muslim Congressmen Call On Obama Administration To Investigate Armed Rally At Phoenix Mosque Muslim Congressmen Call On Obama Administration To Investigate Armed Rally"], "uuid": "62d37788b7e229eb583a3e8c3187561e5cbe6fd8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3034386/images/o-PHOENIX-PROTEST-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/04/phoenix-mosque-first-amen_n_7513312.html", "country": "", "title": "Muslim Congressmen Call On Obama Administration To Investigate Armed Rally At Phoenix Mosque", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Muslim Congressmen Call On Obama Administration To Investigate Armed Rally At Phoenix Mosque", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T23:41:00.000+03:00", "replies_count": 0, "uuid": "62d37788b7e229eb583a3e8c3187561e5cbe6fd8"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/04/phoenix-mosque-first-amen_n_7513312.html", "ord_in_thread": 0, "title": "Muslim Congressmen Call On Obama Administration To Investigate Armed Rally At Phoenix Mosque", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Muslim Congressmen Call On Obama Administration To Investigate Armed Rally At Phoenix Mosque Posted: reddit \nWASHINGTON -- Reps. Keith Ellison (D-Minn.) and André Carson (D-Ind.) sent a letter to Attorney General Loretta Lynch on Thursday requesting a Justice Department investigation on whether armed protests outside a mosque in Phoenix violated the worshippers' First Amendment-guaranteed freedom to practice religion. \n“The decision to bring assault weapons to the mosque demonstrates intent to create a hostile environment to intimidate worshipers, a clear attempt to infringe on the First Amendment rights of the worshipers [sic],” the letter reads. \nLast Friday, a biker gang of about 250 armed protesters, carrying assault rifles, pistols, American flags and depictions of the Prophet Muhammad assembled outside of the Islamic Community Center of Phoenix. The mosque had previously been attended by the two gunmen from Phoenix who opened gunfire on an anti-Islam event featuring a controversial “Draw Muhammad” contest in Garland, Texas, in May. \nThe rally outside the mosque was organized by Iraq war veteran Jon Ritzheimer, who said it was in retaliation for the attack in Garland, as well as “to expose the true colors of Islam.\" \n“True Islam is terrorism,” Ritzheimer told CNN last week. \nEllison and Carson, the only two Muslims in Congress, allege that the armed protests could also be a violation of the Freedom of Access to Clinic Entrances Act , a bill passed in 1994. The law, they note, outlaws \"'attempts to injure, intimidate or interfere with any person lawfully exercising or seeking to exercise the First Amendment right of religious freedom at a place of religious worship.'\" \nRiztheimer’s group had held a less-publicized demonstration the previous week, which resulted in the mosque canceling its Sunday services and religious classes out of safety concerns. \nThe Ellison-Carson letter is the latest in a number of attempts to pressure the Obama administration into taking a position on the armed demonstration. \nDays before the second protest, the Council on American-Islamic Relations asked the FBI to investigate threatening letters mailed to religious leaders at several mosques in Phoenix. The letters, signed by “Patriotic Friends,” warned , “in any state where sharia law is invoked in any way, all Imam’s [sic] in the that [sic] state and their families will die.” \nHours before Friday’s armed rally, Farhana Khera, president of Muslims Advocates, wrote a letter to the Justice Department, pointing it to the biker gang’s Facebook event page, where 1,000 people had RSVP’d for the demonstration. Khera requested a civil rights investigation into the group’s threat of force and urged DOJ to send civil rights investigators to observe the protest. \nSo far, the Obama administration's response has been muted. The day before the rally, White House Press Secretary Josh Earnest told reporters he had read reports about the planned event, but declined to go much further. \n“Even expressions that are offensive, that are distasteful and intended to sow divisions in an otherwise tight-knit, diverse community like Phoenix, cannot be used as a justification to carry out an act of violence, and certainly can’t be used as a justification to carry out an act of terrorism,” he said. \n“I believe the Department of Homeland Security has been in touch with state and local law enforcement authorities, and we’re going to continue to monitor the situation,” Earnest continued. The White House has made no formal statement since. \nIn their letter, Ellison and Carson reminded the Justice Department that “Armed protesters intimidating worshippers at churches, synagogues, mosques, or any religious place of worship seems to be exactly the behavior that Congress sought to outlaw when it passed the FACE Act. Enforcement of the law should not vary based on the religious affiliation of those being intimidated.\" \nOthers put it more bluntly. If fascists showed up at a synagogue w/automatic weapons for a \"Draw The Jew\" contest you bet your ass Obama would say something. #PHxMosque \n— Max Blumenthal (@MaxBlumenthal) May 30, 2015 \nThe Justice Department did not immediately provide comment on the letter. \nRyan Reilly contributed reporting. Also on The Huffington Post Close 24 Reasons To Challenge Islamophobia of ", "external_links": [], "published": "2015-06-04T23:41:00.000+03:00", "crawled": "2015-06-04T23:41:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}