{"organizations": [], "uuid": "2fd6f36d217a6bed131419fd700cdf84662a0136", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/drought_082714getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/244825-obama-to-meet-with-western-governors-on-drought", "country": "US", "title": "Obama meets with Western governors on drought", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama meets with Western governors on drought", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T19:19:00.000+03:00", "replies_count": 0, "uuid": "2fd6f36d217a6bed131419fd700cdf84662a0136"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/244825-obama-to-meet-with-western-governors-on-drought", "ord_in_thread": 0, "title": "Obama meets with Western governors on drought", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama meets with Western governors on drought Getty Images By Timothy Cama - 06/12/15 12:19 PM EDT \nPresident Obama and top Cabinet officials met via video Friday with the governors of six Western states to discuss federal efforts to combat a years-long drought. \nObama also announced $110 million in new federal efforts to help agriculture and rural communities in the West deal with drought and the accompanying wildfires. ADVERTISEMENT The meeting included leaders from the Agriculture, Interior and Labor departments, as well as the Environmental Protection Agency, the National Oceanic and Atmospheric Administration, the Federal Emergency Management Agency and the Army Corps of Engineers.\n“The goal of the briefing was to provide an update to the leaders of the western United States about the outlook about drought and wildfire in the coming summer season, and then to talk about ways in which the federal government is partnering with the states to address the many challenges that we’re facing,” top Obama adviser Brian Deese told reporters after the meeting. \n“We are focused on and concerned about the impacts of the drought for economic and social conditions across the western United States, but the very dry conditions also mean the outlook for the wildlife season will be acute in large parts of the west throughout the summer months,” he continued, adding that Obama expressed his commitment to put the “full resources and authorities of the federal government” into fighting the drought. \nThe administration said the drought and wildfire conditions are only getting worse. \nGovernors of California, Colorado, Montana, Oregon, Wyoming and Arizona participated in the meeting, along with Utah’s lieutenant governor. \n“Currently, 35 percent of the West is facing severe to exceptional drought. In California, the mountain snowpack that supplies most of the water during the summer months is only a trace above zero,” the White House said in a fact sheet about the efforts and meeting. \n“President Obama and his administration are committed to doing everything they can to help the farmers, ranchers, small businesses, and communities facing the severe impacts.” \nThe Obama administration, along with many scientists and climatologists, believe that the four-yearlong drought is either caused or made significantly worse by climate change. \nThe specific actions include $18 million from the Labor Department to provide help for the 18,000 or so California workers who lost jobs due to the drought. \nThe Agriculture Department is changing its rules to help farmers deal financially with particularly bad crop years, while the Bureau of Reclamation is spending $6.5 million on federal water projects. \nThe Interior Department, the parent agency to the Bureau of Reclamation, is also putting $10 million toward 10 projects to make landscapes more resilient to wildfires. \n- Updated at 3:26 p.m.", "external_links": [], "published": "2015-06-12T19:19:00.000+03:00", "crawled": "2015-06-12T22:57:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}