{"organizations": [], "uuid": "e2659e31b1460fdfd7f1996dda7611d71998b957", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3022950/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/02/white-house-antibiotics-meat_n_7493660.html", "country": "", "title": "President Obama Takes An Encouraging First Step In Curbing Antibiotics In Meat", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "President Obama Takes An Encouraging First Step In Curbing Antibiotics In Meat", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T18:42:00.000+03:00", "replies_count": 0, "uuid": "e2659e31b1460fdfd7f1996dda7611d71998b957"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/02/white-house-antibiotics-meat_n_7493660.html", "ord_in_thread": 0, "title": "President Obama Takes An Encouraging First Step In Curbing Antibiotics In Meat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["MARY CLARE JALONICK", "Obama"], "text": "President Obama Takes An Encouraging First Step In Curbing Antibiotics In Meat | By MARY CLARE JALONICK reddit \nWASHINGTON (AP) — President Barack Obama's effort to curb the use of antibiotics in meat is starting with his own employees. \nThe White House said Tuesday that many federal cafeterias will start buying meat and poultry produced with fewer antibiotics later this year. The directive would apply to all of those civilian government restaurants within five years. \nThe announcement is part of a White House summit on the responsible use of antibiotics. The Obama administration announced a plan earlier this year to fight the threat posed by antibiotic-resistant bacteria. \nRepeated exposure to antibiotics can lead germs to become resistant to the drugs, so that they are no longer effective. The Centers for Disease Control and Prevention estimates that drug-resistant bacteria cause 23,000 deaths and 2 million illnesses each year in the United States. \nObama has said such drug-resistant bacteria are one of the most serious public health issues and asked Congress to increase funding to fight the problem. \nCritics said the White House needs to go further, particularly in terms of the antibiotics used in animals processed for meat. The Food and Drug Administration has already successfully encouraged many drug companies to phase out the use of antibiotics for animal growth promotion. But advocacy groups have called on the agency to limit other uses of animal antibiotics as well, such as for disease prevention when holding animals in crowded conditions. \nAt the White House forum, more than 150 food companies, retailers, hospitals and drug companies will highlight their commitments to slow the spread of antibiotic-resistant bacteria and prevent antibiotic-resistant infections. \nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Also on HuffPost: Kinds Of Food Poisoning You Should Know (And Avoid) of   A common bacterial infection producing severe gastrointestinal upset that can hang around as long as two weeks. It's rarely fatal in healthy people. The culprits: Improperly slaughtered or processed meat not thoroughly cooked, contaminated vegetables, milk or water. Pets can also shed the bacteria through their \"business.\" What it feels like: You'd pay closer attention to the flulike symptoms (fever, aches and pains) if you weren't running to the bathroom every 15 minutes of your life. Maybe you shouldn't have: Plucked that mass-processed pack of pork chops out of the \"manager's special\" bin. Also, if you really need to be told, leave seagulls alone. They're neither friendly nor tasty and are known to harbor higher concentrations of the bacteria. Common sense and decent kitchen cleanliness should protect you from needless downfall. Related: Are These 5 Foods Trying To Kill You? Photo via Flickr user StuartWebster Contrary to what literature might have you believe, there will be no love in the time of cholera, only misery, woe and lots of diarrhea. The culprits: Contaminated water and eating raw or undercooked seafood that was hanging out in that water. What it feels like: Being slowly dried in a dehydrator that looks surprisingly like your bathroom while your abdomen is squeezed by a giant godlike fist. You might just want to set up shop in there for a spell, the toxin in the cholera bacteria causes any water in your body to \"release.\" Replenish as you might, it likely won't stay in there very long. Keep at it diligently, though, and you'll be fine in about a week. Maybe you shouldn't have: Splashed around in a stagnant portion of the Meekong Delta for so long, or eaten those Mexican oysters with quite as much gusto. Photo via Flickr user philosophygeek The black sheep of the food poisoning world, E. coli's the one with a strain that'll actually kill you regardless of treatment attempts. How subversive. The culprits: Escherichia coli, or E. for short, has one incredibly powerful strain: O157:H7, although other related strains can cause infection as well. This bacterium is found in mass-processed ground beef and on vegetables that were improperly cleaned or handled by contaminated fingers. What it feels like: You've been stabbed in the colon, which would explain the crippling cramps and other things that might happen if one were actually stabbed in the colon, including blood. Not that there's a \"better\" food poisoning to get, but this is one you really want to avoid. Maybe you shouldn't have: Eaten that rare burger of questionable origin while chugging raw milk in that crazy crowded public pool, all of which have been known to harbor the bacteria. Related: Update: New E. Coli Culprit In Europe Photo via Flickr user khawkins04 An incurable disease caused by eating fish contaminated by coral algae toxins. A real doozy, with an estimated 50,000 cases each year. The culprits: Ciguatera is limited to fish of tropical origin. It's impossible to detect by seafood processors, and can't be killed by cooking or freezing. Live in fear of grouper, or continue on with your life with relatively minimal risk. What it feels like: At first, typical food poisoning symptoms may present, but the bigger problem with ciguatera is its severe and often irreversible neurological effects. These can include trouble sensing hot or cold, tingling \"phantom limb\" pain in the extremities and other symptoms that may be confused with anything from multiple sclerosis to heart failure. Maybe you shouldn't have: Hit that fried \"mystery tropical fish\" eating contest at that Margaritaville in that tropical location with your buddies. To minimize your risk of catching this seriously unfun bug, make sure you know what your fish is and if possible, where it came from. Larger fish from shallower waters in a tropical environment are your worst bet. Related: Trouble Brewing For The FDA. And, Sushi. Photo via Flickr user alonso_inostrosa The range of listeria infection, or listeriosis, lands you somewhere between asymptomatic and dead and can occur from eating or drinking basically anything that was grown, raised or milked. The culprits: Raw or improperly pasteurized dairy products, vegetables grown in contaminated soil (yup, it can live in soil), preserved and smoked meats (can be identified by a slippery or slimy film), canned and raw seafood and fresh fruit. What it feels like: A bad flu, although more serious complications like meningitis can occur in people with weakened immune systems, as well as in young children, pregnant women and the elderly. Maybe you shouldn't have: Eaten all those root vegetables straight from the ground without washing them right after milking your cow. I mean a hippie farmer's life is great, unless your land is rife with listeria. Photo via Flickr user bucklava This is the picnic food poisoning everyone warns you about, especially you, dude who brought the mayo-choked potato salad (try this one instead). The culprits: The bacteria releases its toxins at the comfy incubator that is room temperature food, which gives staph food poisoning its signature cookout-ruining reputation. The worst part? Reheating contaminated food won't kill it off. Actually the worst part is the symptoms. What it feels like: Explosive, and not in a romantic feelings kind of way. Within an hour of ingesting contaminated food, both ends will be entirely occupied for up to a day. The good news is, once it's out, it's out and you can get right back to the picnic. Oh wait, it's over. Maybe you shouldn't have: Microwaved that leftover potato salad thinking no bug could possibly survive the ordeal. Photo via Flickr user stu_spivack The bacteria that causes salmonellosis, or salmonella poisoning, has a serious reputation among poultry and their handlers, and BOY does it love hanging out on the stretches of counter you missed with the sanitizer. The culprits: Although eggs, processed chicken parts and other raw meat are particularly good at spreading the bacteria, pet reptiles and rodents are also carriers. Wash everything any dead or live animal comes in contact with and maybe don't allow live animals in the kitchen while you're cooking, period. What it feels like: Your small intestine betraying you entirely. Expect a week or so of your typical diarrhea, abdominal cramps and possibly a fever. Maybe you shouldn't have: Attempted your own Japanese-style chicken breast sashimi or let Shelly the turtle roam around willy-nilly on the cutting board. Especially before slicing said chicken sashimi. Photo via Flickr user Casper Jen Similar to salmonella but yet so very different is shigella, which attacks the large intestine rather than the small. The culprit: You're going to love this -- human waste. While plenty of food-borne illness can be spread this way, particularly by catching a ride in food or water, many cases of shigellosis can be directly attributed to contact with... well, you know. It can also be resistant to antibiotics, so definitely practice safe sewage-wading. What it feels like: Salmonella, only with more blood. Maybe you shouldn't have: Taken on that blackout drunken dare to see what's really under that manhole by the creek, then gone straight to In-N Out. Just maybe. We live in a developed nation, you almost have to try to get this one. It's Darwinism, people. Photo via Flickr user Nathan Reading  Share ", "external_links": [], "published": "2015-06-02T18:42:00.000+03:00", "crawled": "2015-06-02T18:42:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}