{"organizations": [], "uuid": "b204c8f540f6163dbf24f0300feae25ff8522dfa", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack06182015getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/245422-obama-shooting-should-be-wake-up-call", "country": "US", "title": "Obama: Shooting should be wake-up call", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Shooting should be wake-up call", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T19:51:00.000+03:00", "replies_count": 0, "uuid": "b204c8f540f6163dbf24f0300feae25ff8522dfa"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/245422-obama-shooting-should-be-wake-up-call", "ord_in_thread": 0, "title": "Obama: Shooting should be wake-up call", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Issa escorted out of Benghazi... Rep. Trey Gowdy escorted the California Republican from the closed-door... Donald Trump's use of Neil Young... Trump’s use of “Rockin’ in the Free World” was “not authorized” by the... New $10 bill to feature a woman Obama administration officials are seeking advice nationwide on who to... Gun owners not likely to use... A new study attempts to debunk the claim that gun owners rely on... Gowdy identifies author of... The Benghazi chairman said Tyler Drumheller wrote the memos passed on to... Donald Trump comes out on top — on... About 3.4 million people reacted to his launch, the most of any GOP... Sanders overwhelms O'Malley Bernie Sanders's surging candidacy is totally suffocating Martin O'Malley'... Jon Stewart mocks Trump “Whites are black, Trump’s running for president, does gravity still work... You’re barking up the wrong tree,... OPINION | Guns are the most striking example. Boehner takes his retribution GOP leaders remove three members of its House whip team. Sanders surges in New Hampshire... Sanders ties Clinton with self-identified liberals in a new poll. Senate Dems give GOP 45-day... Senate Democrats say it will be difficult to pass a short-term highway... Actor Mark Ruffalo: Hillary needs... “It’s going to be an interesting primary,\" The Avengers star said. Court rules Bush officials can be... The split decision comes after more than a decade of litigation. Government can't explain $3B in... An audit finds inadequate review put a \"significant amount of federal... Ex-Clinton aide didn't write... Rep. Gowdy said the intel came from another source, whom the panel \"might... FCC plans to fine AT... The carrier reduced network speeds once customers used a certain amount of... GOP bill would repeal federal... Sen. Bill Cassidy's (R-La.) legislation does away with the renewable fuel... Ann Coulter: I'd run immigration... Lawmakers joined Coulter at a book signing Tuesday for her new book, Adios... House Republican leaders zero in... The plan is to vote as soon as this week on the fast-track bill.", "external_links": [], "published": "2015-06-18T19:51:00.000+03:00", "crawled": "2015-06-18T19:55:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}