{"organizations": [], "uuid": "3d0e0871a62d705ceb06c309d1117e80a9551243", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_061215fr_0.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/244813-obama-pleads-with-dems-to-save-trade-package", "country": "US", "title": "Obama pleads with Dems to save fast-track trade package", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama pleads with Dems to save fast-track trade package", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T18:07:00.000+03:00", "replies_count": 0, "uuid": "3d0e0871a62d705ceb06c309d1117e80a9551243"}, "author": "iswanson@thehill.com (Peter Schroeder and Cristina Marcos)", "url": "http://thehill.com/policy/finance/244813-obama-pleads-with-dems-to-save-trade-package", "ord_in_thread": 0, "title": "Obama pleads with Dems to save fast-track trade package", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama pleads with Dems to save fast-track trade package By Peter Schroeder and Cristina Marcos - 06/12/15 11:07 AM EDT \nPresident Obama made an impassioned plea to House Democrats on Friday to not kill his trade agenda. \nIn a last-minute, closed-door meeting held hours before scheduled votes on the fast-track package, the president huddled with House Democrats for about a half-hour. ADVERTISEMENT He asked them to back a measure meant to provide aid to workers displaced by trade.\n“All he asked Democrats to do is play it straight,” said Rep. Earl Blumenauer (D-Ore.), who supports the trade deal. \nOpponents of fast-track see defeating the Trade Adjustment Assistance measure as the best way to kill fast track. \nBecause of the way Friday’s votes have been set up on the floor, if the TAA bill is defeated the House will not vote on the fast-track measure. \nMost Democrats back TAA in theory, but those who want to kill fast-track see defeating the TAA bill as their best chance because many Republicans are expected to vote down TAA. \nPro-trade Democrats characterized the president’s message as simple: vote for each bill on its merits, and don’t adopt a broader strategy to block a bill you like to stop one you don’t. \nWith the vote rapidly approaching, pro-trade Democrats said they had to make up ground to save the package. \nRep. Gerry Connolly (D-Va.) said he believed the number of Democrats considering a vote against TAA exceeded the most optimistic numbers that Republicans believed they could deliver to save it. \nTo win the TAA vote, Obama and GOP leaders will have to depend on the political center. If enough Democrats and Republicans back it, it will pass. Rep. Steve Israel (D-N.Y.), who handles the Democratic caucus’s messaging efforts, said that a majority of his party's leadership would support TAA. Israel said that he’ll be “very grateful when the gavel comes down” and Democrats can move on from trade. “We’re now in a situation where Democrats are screaming at Democrats, where labor groups are lobbying progressive members to vote against Trade Adjustment Assistance, where Democrats are being threatened with primaries. We need to get back to the debates that define us, instead of this issue that is dividing us,” Israel said. \nObama definitely didn't win over every opponent, however. \n“I thought he gave a good speech,” said Rep. Gene Green (D-Texas). “No, he did not change my mind.” \nRep. Louise Slaughter (D-N.Y.), a vocal trade opponent, said she still planned to vote against TAA. \n“I will not [support TAA] because I do not want this trade bill to go through,” she said leaving the meeting. But Democrats opposed to Obama on policy generally steered away from directly criticizing the leader of their party. “I think it’s obvious that most Democrats disagree with fast-track. That does not mean that we disagree with the dedication and the record of this president. We’re very proud of this president. We have had his back again and again,” said Rep. Brad Sherman (D-Calif.). \nAs the president left the meeting, he declined to say whether he had convinced enough Democrats to keep his trade agenda afloat. \n“I don't think you ever nail anything down around here. It's always moving,” he told reporters. \nBefore the meeting, pro-trade Democrats said they were surprised liberal critics of the trade deal would go so far as to kill a program they hold dear in an attempt to block the overall package. \n“For weeks, people have been saying there’s no way Democrats would shoot down TAA,” said Rep. Jim Himes (D-Conn.). “Well, they’re doing it.” \n—This story was updated at 11:33 a.m.", "external_links": [], "published": "2015-06-12T18:07:00.000+03:00", "crawled": "2015-06-12T20:21:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}