{"organizations": ["House Oversight Committee", "Facebook", "Twitter"], "uuid": "e2ff8490bfabc4f78bd71ff71ca08127c986d268", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/chafetzforfoiastory.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss\r", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/03/foia-backlog-soars-despite-obama-pledge-transparency/", "country": "", "title": "FOIA backlog soars despite Obama pledge of transparency", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "FOIA backlog soars despite Obama pledge of transparency", "spam_score": 0.0, "site_type": "news", "published": "2015-06-03T21:40:00.000+03:00", "replies_count": 0, "uuid": "e2ff8490bfabc4f78bd71ff71ca08127c986d268"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/03/foia-backlog-soars-despite-obama-pledge-transparency/", "ord_in_thread": 0, "title": "FOIA backlog soars despite Obama pledge of transparency", "locations": ["Washington", "R-Utah", "Capitol Hill"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Chaffetz", "Obama"], "text": "FOIA backlog soars despite Obama pledge of transparency Published June 03, 2015 Facebook 0 Twitter 0 Email Print April 22, 2015: House Oversight Committee Chairman Rep. Jason Chaffetz, R-Utah, speaks on Capitol Hill in Washington. \nFederal agencies are struggling to keep up with the growing number of requests for public information, raising questions in Congress about the Obama administration's dedication to transparency. \nThe backlog of unfulfilled requests for documents has doubled since President Obama took office, according to a recent report by the Justice Department. The number of requests has also spiked. \n\"The president has committed to creating an unprecedented level of openness in government,\" said Rep. Jason Chaffetz, R-Utah, chairman of the House Oversight Committee. \"But that's not the case when it comes to filling FOIA requests.\" \nChaffetz cited examples of people waiting years for documents only to have their requests denied. In other cases, federal agencies blacked out information that was already public elsewhere. One document produced by the Federal Communications Commission blacked out a press release that had already been publicly released, Chaffetz said. \nChaffetz' committee wrapped up two days of hearings on the Freedom of Information Act Wednesday, with some Republican members chastising federal officials responsible for disclosing public information. \n\"You're part of the problem,\" declared Rep. Jody Hice, R-Ga. \nOfficials from the Departments of State, Justice, Homeland Security and Treasury testified at Thursday's hearing, along with an official from the IRS. \nSeveral Democrats on the committee came to their defense, noting that budget cuts have left fewer workers to process information requests. \n\"Logic tells you that when you have less people and you've got more demand, you're going to have problems,\" said Rep. Elijah Cummings of Maryland, the top Democrat on the Oversight Committee. \nGovernmentwide, the backlog of requests went from 77,000 in 2009 to nearly 160,000 in 2014, according to the Justice report. \nThe increase coincided with a spike in requests. In 2009, the federal government received almost 558,000 requests for information. In 2014, the number increased to more than 714,000. \nAt the same time, the number of staff working full-time on information requests dropped from a high of 4,400 in 2011 to about 3,800 in 2014. \nMelanie Ann Pustay, the director of the DOJ's office of information policy, said the administration has improved training and made some progress. \n\"First, the majority of agencies -- 72 out of 100 -- were able to maintain low backlogs of fewer than 100 requests,\" Pustay said. \"Notably, 59 of these agencies had a backlog of less than 20 requests, including 29 that reported having no backlog at all.\" \nAgencies with a backlog of more than 1,000 requests were required to come up with a plan to reduce them, she said. Advertisement", "external_links": [], "published": "2015-06-03T21:40:00.000+03:00", "crawled": "2015-06-03T22:07:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}