{"organizations": [], "uuid": "21adce4fbe68ea2e7f8b066f2dea98e8a6501f80", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/barackobama_060915.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/245782-obama-applauds-rhode-island-wage-hike", "country": "US", "title": "Obama applauds Rhode Island wage hike", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama applauds Rhode Island wage hike", "spam_score": 0.0, "site_type": "news", "published": "2015-06-23T02:23:00.000+03:00", "replies_count": 0, "uuid": "21adce4fbe68ea2e7f8b066f2dea98e8a6501f80"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/finance/245782-obama-applauds-rhode-island-wage-hike", "ord_in_thread": 0, "title": "Obama applauds Rhode Island wage hike", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama applauds Rhode Island wage hike By Jordan Fabian - 06/22/15 07:23 PM EDT \nPresident Obama on Monday applauded Rhode Island for hiking its minimum wage, seeking to highlight a top economic agenda item that has stalled in Congress. \nRhode Island Gov. Gina Raimondo (D) signed a bill Monday raising her state's minimum wage to $9.60 per hour from $9. That is well above the federal minimum wage of $7.25. ADVERTISEMENT “This year, more than half of our states guarantee their workers a wage higher than the federal minimum, but despite this progress we still have work to do,” Obama said in a statement. \n“I continue to encourage states, cities, counties and companies to lift their workers' wages,” he added. “I urge Congress to finally do the right thing and give America a raise.” \nThe president has increasingly turned to states and cities to advance policies to address income inequality, such as higher minimum wages and paid sick leave. \nObama first called for a federal minimum wage of $10.10 in 2013, and since then, he noted, 17 states have acted on their own. Large companies, such as Costco and Wal-Mart, have decided to pay a higher wage than the federal minimum. \nThe president said those states and companies have acknowledged “paying workers fairly is both good for business and the right thing to do.” \nMany Republican lawmakers say raising the wage would cause companies to cut jobs and would do little to help people in poverty. \nIn a speech Friday to the U.S. Conference of Mayors, Obama called on local officials to help him advance his economic agenda. \n“It’s so hard to get anything through Congress — even when we’re talking about issues that most Americans outside of Washington agree on,” he said. “But that’s also why we’ve partnered with many of you over the past couple of years — to make real progress on the economic priorities that matter to middle-class Americans.”", "external_links": [], "published": "2015-06-23T02:23:00.000+03:00", "crawled": "2015-06-23T04:26:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}