{"organizations": [], "uuid": "843ef626adcd0724b673fa981477f9db855b346a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_061215fr2.jpg", "site_section": "http://thehill.com/taxonomy/term/25211/feed", "section_title": "The Hill: Finance Video", "url": "http://thehill.com/policy/finance/244835-house-deals-humiliating-blow-to-obama-in-trade-fight", "country": "US", "title": "House deals humiliating blow to Obama in trade fight", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House deals humiliating blow to Obama in trade fight", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T20:49:00.000+03:00", "replies_count": 0, "uuid": "843ef626adcd0724b673fa981477f9db855b346a"}, "author": "iswanson@thehill.com (Cristina Marcos)", "url": "http://thehill.com/policy/finance/244835-house-deals-humiliating-blow-to-obama-in-trade-fight", "ord_in_thread": 0, "title": "House deals humiliating blow to Obama in trade fight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House deals humiliating blow to Obama in trade fight By Cristina Marcos - 06/12/15 01:49 PM EDT \nDefying President Obama, House Democrats on Friday rallied to vote down legislation granting aid to workers displaced by trade, dealing a potentially fatal blow to the fast-track legislation that had been scheduled to hit the floor. \nAn overwhelming majority of Democrats voted to sink the package in the 126-302 vote despite an impassioned plea from the president, which he delivered in person during a rare morning visit to Capitol Hill. A majority of Republicans also opposed the bill. ADVERTISEMENT The vote came minutes after a dramatic floor speech by House Minority Leader Nancy Pelosi (D-Calif.), who rebuffed lobbying by Obama to vote against the Trade Adjustment Assistance (TAA) program.\nPelosi noted that Democrats have traditionally backed TAA, but sided with liberals in her conference who argued a vote against the program was the only way to stop fast-track. \n“If TAA slows down the fast track, I’m prepared to vote against TAA,\" Pelosi said. \nOther members of Pelosi's leadership team, including House Minority Whip Steny Hoyer (D-Md.) and Reps. James Cyburn (S.C.) and Steve Israel (N.Y.), voted \"yes.\" \nSpeaker John Boehner (Ohio) cast a vote in favor of TAA. Speakers cast floor votes on relatively rare occasions. \nOnly 40 Democrats backed TAA, while 144 voted against it. On the GOP side, 158 Republicans voted \"no,\" while 86 Republicans voted \"yes.\" \nThe vote against TAA is a humiliating defeat for Obama, who had spent weeks lobbying House Democrats to support his trade agenda in the face of overwhelming opposition from liberal groups and organized labor. \nUnder the procedure established for considering the trade package, TAA had been packaged with fast-track authority, and a vote against either doomed the total package. \nIn a slight surprise, House Majority Leader Kevin McCarthy (R-Calif.) announced after the TAA vote that the House would still vote on the fast-track measure, as well as a separate customs bill. \nIn the vote on fast-track, the measure was approved in a 219-211 vote. Twenty-eight Democrats backed fast-track, while 54 Republicans voted \"no.\" \nHouse Republicans said they would bring the TAA bill up for another vote by Tuesday. House GOP lawmakers maintained that voting on TAA again next week would give the Obama administration time to lobby more Democrats to support it.\n\"The president has some work yet to do with his party to complete this process. This isn't over yet. And we hope that they can get together and make sure that we finish this so that America is back leading,\" House Ways and Means Committee Chairman Paul Ryan (R-Wis.) said in a hastily scheduled press conference with members of the GOP leadership after the vote. \nBut it is difficult to see why the Democrats who objected to it on Friday to prevent movement on fast-track would shift their strategy, particularly after Pelosi's words. Despite the rebuke from House Democrats, the White House still expressed optimism about passing its trade package. Press secretary Josh Earnest described the defeat as “another procedural snafu,” comparing it to a failed test vote last month in the Senate on the trade package, which eventually passed the bill. “I also feel a little like Yogi Berra,” Earnest said. “I’m tempted to walk out here and say it’s deja vu all over again.” Earnest declined to take a shot at Pelosi. He said Obama has had a “long, warm, and productive” relationship with her. The White House will continue to “make an aggressive case” for the defeated trade adjustment assistance bill to Democrats in the House, he said. \nIn a statement, Obama urged the House to pass TAA \"without delay so that more middle-class workers can earn the chance to participate and succeed in our global economy.\" \nLabor groups, including the AFL-CIO, lobbied Democrats to oppose TAA as part of a last-ditch effort to keep the fast-track legislation from coming up for a vote. \nRep. Rosa DeLauro (D-Conn.), who spearheaded the revolt, said that the TAA measure was “underfunded and wouldn't do enough to help displaced workers.” \n“It comes down to one question: Do we support hard-working Americans or do we abandon them?” DeLauro said. “A vote for these bills is a vote against jobs and it’s a vote against wages.” \nOther Democrats who oppose the fast-track bill rebuked their colleagues for opposing TAA, arguing the vote threatens to keep the assistance from being part of the final package sent to Obama. \n“I refuse to put displaced workers at risk for the sake of a political tactic,” said Rep. David Price (D-N.C.). \nRyan warned that defeating the trade package would make the U.S. look unreliable on the international stage. \n“The world is watching this,” Ryan said during floor debate. “If we establish TPA, we are saying on a bipartisan basis, we want America to lead.” \nThis story was updated at 3:02 p.m.", "external_links": [], "published": "2015-06-12T20:49:00.000+03:00", "crawled": "2015-06-13T00:44:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}