{"organizations": ["ISIS", "Facebook", "Twitter"], "uuid": "4c48b17b8e817b65666519a79147242f60fde1ac", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss\r", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/26/california-assembly-approves-bill-mandating-vaccinations-for-almost-all-public/", "country": "", "title": "Obama discusses Ukraine, ISIS with Putin in telephone call", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama discusses Ukraine, ISIS with Putin in telephone call", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T07:44:00.000+03:00", "replies_count": 0, "uuid": "0edcfa51a1029dd67ee1fb9b564fa046b90dda6a"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/26/obama-discusses-ukraine-isis-with-putin-in-telephone-call/", "ord_in_thread": 0, "title": "Obama discusses Ukraine, ISIS with Putin in telephone call", "locations": ["Ukraine"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Obama"], "text": "Obama discusses Ukraine, ISIS with Putin in telephone call Published June 26, 2015 Facebook 0 Twitter 0 Email Print \nWASHINGTON – Russian President Vladimir Putin and President Barack Obama spoke by telephone Thursday and discussed continued tensions in eastern Ukraine and the fight against ISIS in the Middle East. The last time the men spoke was in February, the White House said. \nBoth the White House and the Kremlin offered similar statements describing the conversation, Thursday evening. The White House said Putin initiated the call to Obama. \nThe White House said Obama told Putin Russia needs to meet commitments it made in Minsk, Belarus, earlier this year, including the removal of troops and equipment from Ukrainian territory. The Kremlin said the two leaders agreed that U.S. Assistant Secretary of State Victoria Nuland and Russian Deputy Foreign Minister Grigory Karasin will discuss implementation of these agreements. \nThe call came on the same day NATO's supreme allied commander cited a continuous flow of ammunition and other military supplies from Russia across the border to Ukraine. \nThe Kremlin said the two men devoted \"significant attention\" to confronting terrorism and ISIS in particular and agreed to have Russian Foreign Minister Sergei Lavrov and U.S. Secretary of State John Kerry meet to review the issue. \nThe White House and the Kremlin said the two leaders also addressed continued bloodshed in Syria and agreed on the importance of unity among the six world powers that are negotiating to restrict Iran's nuclear capabilities. \nThe call from Putin came just days after the Russian leader spoke with French President Francois Hollande and German Chancellor Angela Merkel about the situation in eastern Ukraine, a day before Paris talks between the foreign ministers of Russia, France, Germany and Ukraine. \nFrance and Germany co-sponsored February's peace deal that helped reduce hostilities between pro-Russia rebels and Ukrainian troops, but fighting again escalated in recent weeks. Advertisement", "external_links": [], "published": "2015-06-26T07:44:00.000+03:00", "crawled": "2015-06-26T07:53:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}