{"organizations": [], "uuid": "f88d391f673cb7ef4f59b7308022dbad779cb3f2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3071278/images/o-CLINTON-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/14/hillary-clinton-trade-deal_n_7580768.html", "country": "", "title": "Hillary Clinton: Obama Should Listen To Nancy Pelosi On Trade", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Hillary Clinton: Obama Should Listen To Nancy Pelosi On Trade", "spam_score": 0.0, "site_type": "news", "published": "2015-06-14T21:41:00.000+03:00", "replies_count": 0, "uuid": "f88d391f673cb7ef4f59b7308022dbad779cb3f2"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/14/hillary-clinton-trade-deal_n_7580768.html", "ord_in_thread": 0, "title": "Hillary Clinton: Obama Should Listen To Nancy Pelosi On Trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Nancy Pelosi", "Obama"], "text": "Hillary Clinton: Obama Should Listen To Nancy Pelosi On Trade Posted: reddit \nDemocratic presidential hopeful Hillary Clinton encouraged President Barack Obama on Sunday to listen to House Minority Leader Nancy Pelosi (D) on trade. \n\"The president should listen to and work with his allies in Congress, starting with Nancy Pelosi,\" Clinton said while speaking at a rally in Iowa. \nPelosi took to the House floor Friday to oppose trade legislation Obama had personally lobbied for on Capitol Hill earlier that day. \n“We have an opportunity to slow down,” Pelosi said. “Whatever the deal is with other countries, we want a better deal for America’s workers.” \nClinton encouraged lawmakers to work together to \"make sure we get the best, strongest deal possible.\" \n\"And if we don’t get it, there should be no deal,\" she added. \nClinton said she wants to \"find out what's in it and make it as good as it can be,\" and pushed for more transparency \"so the American people can actually see what will be in a finalized deal.\" \nHouse Democrats rejected Obama's trade agenda Friday by blocking a measure that would have granted him the power to fast-track sweeping, secretive international agreements through Congress. \nClinton refrained from mentioning trade in her official campaign kickoff speech that took place at New York City's Roosevelt Island on Saturday. Ahead of her remarks in Iowa on Sunday, her campaign said she would not be taking a position on trade until details of a deal were finalized. Also on HuffPost:   U. S. Secretary of State Hillary Rodham Clinton waits to speak as she is introduced at Singapore Management University, Saturday, Nov. 17, 2012, in Singapore. Secretary of State Hillary Rodham Clinton gestures as she speaks during a ceremony in recognition of World AIDS Day, Thursday, Nov. 29, 2012, at the State Department in Washington, where she released The U.S. President's Emergency Plan for AIDS Relief, (PEPFAR) Blueprint' for Creating an AIDS- Free Generation. U.S. Secretary of State Hillary Rodham Clinton speaks at a press conference at NATO headquarters in Brussels, Belgium, Wednesday Dec. 5, 2012. NATO foreign ministers were set Wednesday to shift their focus to the way forward in Afghanistan during a second day of talks in Brussels, as the military alliance prepares to withdraw its combat troops in 2014. Secretary of State Hillary Rodham Clinton gestures as she gives a speech: \"Frontlines and Frontiers: Making Human Rights a Human Reality,\" Thursday, Dec. 6, 2012, at Dublin City University in Dublin, Ireland. In this Dec. 1, 2012 file photo, Actress Meryl Streep uses her iPhone to get a photo of her and Secretary of State Hillary Rodham Clinton following the State Department Dinner for the Kennedy Center Honors gala at the State Department in Washington. Secretary of State Hillary Rodham Clinton speaks during a Global Townterview at the Newseum in Washington, Tuesday, Jan. 29, 2013. Secretary of State Hillary Rodham Clinton testifies on Capitol Hill in Washington before the Senate Foreign Relations Committee hearing on the deadly September attack on a US diplomatic mission in Benghazi, Libya (Foto vom 23.01.13). Secretary of State Hillary Rodham Clinton smiles before speaking on American leadership at the Council on Foreign Relations in Washington, Thursday, Jan. 31, 2013. Former Secretary of State Hillary Rodham Clinton laughs as she gives a speech during a ceremony honoring her at the Pentagon, Thursday, Feb. 14, 2013, where outgoing Defense Secretary Leon Panetta presented her with the Defense Department's Medal for Distinguished Public Service. This April 2, 2013, file photo shows former Secretary of State Hillary Rodham Clinton addressing the Vital Voices Global Partnership 2013 Global Leadership Awards gala at the Kennedy Center for the Performing Arts in Washington. Clinton is getting plenty of encouragement to run for president in 2016. Her re-emergence this past week after a two-month break brought out cheering supporters when she gave speeches focused on the issues of women and girls around the world. Hillary Clinton greets the audience during a Yale Law School ceremony at Yale University, Saturday, Oct. 5, 2013, in New Haven, Conn. Clinton received the Yale Law School Association Award of Merit, which is presented annually to those who have made a substantial contribution to public service or the legal profession. Former Secretary of State Hillary Clinton, left, poses onstage for a photograph with Elton John after receiving her Founders award during the Elton John AIDS Foundation's 12th Annual \"An Enduring Vision\" benefit gala at Cipriani Wall Street on Tuesday, Oct. 15, 2013, in New York. In a Monday, Aug. 12, 2013 file photo, former Secretary of State Hillary Clinton speaks to the American Bar Association Annual Meeting Monday, Aug. 12, 2013, in San Francisco. Clinton spoke about maintaining the Voting Rights Act and received a medal from the association. The former secretary of state will receive the Elton John AIDS Foundation's first Founder's Award for her support of gay rights. In a statement Wednesday, Sept. 4, 2013, the foundation cited a 2011 speech in which Clinton asserted that gay rights were human rights for helping envision a world without AIDS. Former Secretary of State Hillary Rodham Clinton walks to the podium after receiving the Liberty Medal during a ceremony at the National Constitution Center, Tuesday, Sept. 10, 2013, in Philadelphia. The honor is given annually to an individual who displays courage and conviction while striving to secure liberty for people worldwide. Former Secretary of State Hillary Clinton addresses a gala celebrating the 10th anniversary of the Center for American Progress at the Mellon Auditorium October 24, 2013 in Washington, DC. Co-founded by former Clinton Administration Chief of Staff John Podesta, the liberal public policy research and advocacy organization is a think tank that rivals conservative policy groups, such as the Heritage Foundation and the American Enterprise Institute. Former Secretary of State Hillary Rodham Clinton speaks after receiving the National Defense Foundation University's (NDU) American Patriot Award during a gala dinner at the Ronald Reagan Center in Washington, Thursday, Nov. 14, 2013. The American Patriot Award annually recognizes leaders of extraordinary caliber who have strengthened America?s strategic interests and advanced global security. Former Secretary of State Hillary Rodham Clinton walks past the Presidential seal in the East Room of the White House in Washington, Wednesday, Nov. 20, 2013, after a ceremony where President Barack Obama awarded the Presidential Medal of Freedom to former President Bill Clinton and others. Former US Secretary of State Hillary Clinton speaks after receiving the 2013 Lantos Human Rights Prize during a ceremony on Capitol Hill in Washington on December 6, 2013.  Share ", "external_links": [], "published": "2015-06-14T21:41:00.000+03:00", "crawled": "2015-06-14T23:52:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}