{"organizations": [], "uuid": "298779887e69c68b6ca23c6608edcac426e9e7c8", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/07/politics/obama-germany-g7/index.html", "country": "", "title": "G7 summit: Obama arrives in Germany - CNNPolitics.com", "performance_score": 6, "site": "cnn.com", "participants_count": 0, "title_full": "G7 summit: Obama arrives in Germany - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-07T07:40:00.000+03:00", "replies_count": 0, "uuid": "298779887e69c68b6ca23c6608edcac426e9e7c8"}, "author": "", "url": "http://www.cnn.com/2015/06/07/politics/obama-germany-g7/index.html", "ord_in_thread": 0, "title": "G7 summit: Obama arrives in Germany - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama arrives in Germany, seeks to get Europe behind him on Ukraine By Kevin Liptak , CNN White House Producer Updated 0532 GMT (1232 HKT) June 7, 2015 Crisis in Ukraine 46 photos Shelling between Ukrainian troops and pro-Russian rebels leaves damage in Donetsk, Ukraine, on Monday, June 1. Fighting continues in eastern Ukraine despite a fragile ceasefire agreed upon in February. More than 6,400 people have been killed in the conflict since April 2014, the United Nations says. Hide Caption 1 of 46 Crisis in Ukraine 46 photos A Ukrainian serviceman fires a grenade launcher on the front lines near Donetsk on Saturday, May 30. Hide Caption 2 of 46 Crisis in Ukraine 46 photos Pro-Russian rebels carry the coffin of prominent separatist commander Alexei Mozgovoi during his funeral in Alchevsk, Ukraine, on Wednesday, May 27. Hide Caption 3 of 46 Crisis in Ukraine 46 photos An American soldier, right, trains Ukrainian troops on Tuesday, April 21, near Yavoriv, Ukraine. Operation Fearless Guardian, a six-month training exercise, involves about 300 members of the American 173rd Airborne and about 900 Ukrainian National Guard troops. Hide Caption 4 of 46 Crisis in Ukraine 46 photos Residents flee with salvaged belongings during renewed fighting in the Jabunki neighborhood near the airport in Donetsk on Monday, April 13. Hide Caption 5 of 46 Crisis in Ukraine 46 photos A mortar round sticks out of the ground near a destroyed tank at a former Ukrainian army checkpoint outside Chornukhyne, Ukraine, on Monday, March 2. Russian-backed separatists had recently overran the area. Hide Caption 6 of 46 Crisis in Ukraine 46 photos An instructor of the Ukrainian volunteer Azov Battalion conducts training exercises in Kiev, Ukraine, on Sunday, March 1. Hide Caption 7 of 46 Crisis in Ukraine 46 photos A woman makes her way across a bridge destroyed in heavy fighting in Donetsk, Ukraine, on March 1. Hide Caption Crisis in Ukraine 46 photos A volunteer gives humanitarian aid to residents of Popasna, Ukraine, on Saturday, February 28. Hide Caption 9 of 46 Crisis in Ukraine 46 photos A Ukrainian serviceman climbs out of a tank at a checkpoint near Horlivka, Ukraine, on Monday, February 23. Hide Caption 10 of 46 Crisis in Ukraine 46 photos A member of a Ukrainian military medical unit cries during a ceremony in Artemivsk, Ukraine, on February 23. Four of his comrades were killed near Debaltseve, Ukraine. Hide Caption 11 of 46 Crisis in Ukraine 46 photos A man holds a Ukrainian flag as he covers a victim of an explosion in Kharkiv, Ukraine, on Sunday, February 22. The explosion during a peaceful protest left two dead and 15 wounded. Hide Caption Crisis in Ukraine 46 photos Pro-Russian rebels stationed in Horlivka launch missiles on Wednesday, February 18. Hide Caption Crisis in Ukraine 46 photos Pro-Russian separatists take position near Uglegorsk, Ukraine, on February 18. Hide Caption 14 of 46 Crisis in Ukraine 46 photos An army ambulance damaged in recent shelling lies by a road near Svitlodarsk, Ukraine, on Sunday, February 15. Hide Caption 15 of 46 Crisis in Ukraine 46 photos Ukrainian servicemen play with a soccer ball on a road between Svitlodarsk and Debaltseve on February 15. Hide Caption 16 of 46 Crisis in Ukraine 46 photos A woman salvages items February 15 from the rubble of a destroyed clinic where she had worked in Opytne, Ukraine. Hide Caption 17 of 46 Crisis in Ukraine 46 photos People carry a refrigerator through a balcony at an apartment building that was damaged in recent shelling in Svitlodarsk on February 15. Hide Caption 18 of 46 Crisis in Ukraine 46 photos A recent ceasefire was brokered during marathon talks in Minsk, Belarus. From left, Belarusian President Alexander Lukashenko, Russian President Vladimir Putin, German Chancellor Angela Merkel, French President François Hollande and Ukrainian President Petro Poroshenko gather before negotiations begin on Wednesday, February 11. Hide Caption 19 of 46 Crisis in Ukraine 46 photos People stand beside the body of a woman killed during shelling in Kramatorsk, Ukraine, on Tuesday, February 10. Hide Caption 20 of 46 Crisis in Ukraine 46 photos A volunteer gets a medical checkup at a military base for pro-Russian rebels February 10 in Donetsk, Ukraine. Hide Caption 21 of 46 Crisis in Ukraine 46 photos Ukrainian volunteer fighters and policemen arrest two men in Kiev, Ukraine, on February 9. The men allegedly arrived from Donetsk and were suspected of participating in pro-Russian rebel activities and organizing terrorist attacks in the Ukrainian capital. Hide Caption Crisis in Ukraine 46 photos Residents unload humanitarian aid in Debaltseve on Friday, February 6. Hide Caption Crisis in Ukraine 46 photos A man rides a bicycle in Vuhlehirsk, Ukraine, on February 6. Hide Caption 24 of 46 Crisis in Ukraine 46 photos A child waits on a bus to leave Debaltseve on Tuesday, February 3, after increased fighting in the region. Hide Caption 25 of 46 Crisis in Ukraine 46 photos A man stands next to his car in Donetsk on Sunday, February 1, after it was destroyed by shelling. Hide Caption 26 of 46 Crisis in Ukraine 46 photos The body of a civilian killed during shelling lies on the ground in Donetsk on Friday, January 30. Hide Caption 27 of 46 Crisis in Ukraine 46 photos People in Mariupol, Ukraine, pour soil into the grave of a recent shelling victim on Monday, January 26. Hide Caption 28 of 46 Crisis in Ukraine 46 photos Ukrainian servicemen prepare ammunition at a position on the front line near Mariupol on January 26. Hide Caption Crisis in Ukraine 46 photos A man injured during shelling in Mariupol sits in an emergency hospital on January 26. Hide Caption 30 of 46 Crisis in Ukraine 46 photos A piece of an exploded missile sits lodged in the ground outside an apartment building in the Vostochniy district of Mariupol on Sunday, January 25. Hide Caption Crisis in Ukraine 46 photos A resident walks by a burning building in Mariupol on Saturday, January 24. Hide Caption 32 of 46 Crisis in Ukraine 46 photos A pro-Russian rebel takes cover from shelling in the Kievsky district of Donetsk on Thursday, January 22. Hide Caption 33 of 46 Crisis in Ukraine 46 photos People in downtown Donetsk react as Ukrainian prisoners of war are handed over by pro-Russian rebels on January 22. Hide Caption 34 of 46 Crisis in Ukraine 46 photos A trolleybus is damaged in Donetsk's Lenin District after its station was hit by a shell on January 22. Hide Caption 35 of 46 Crisis in Ukraine 46 photos A rebel takes aim while protecting a supply position in the Kievsky district of Donetsk on January 22. Hide Caption Crisis in Ukraine 46 photos Rubble and debris cover the airport in Donetsk on Wednesday, January 21. Hide Caption Crisis in Ukraine 46 photos Hide Caption 38 of 46 Crisis in Ukraine 46 photos Vladimir Bovrichev cries next to the body of his 4-year-old son, Artiam, during Artiam's funeral on the outskirts of Donetsk on Tuesday, January 20. The boy was killed during a Ukrainian artillery strike. Hide Caption Crisis in Ukraine 46 photos Women sit in a shelter during a battle in Donetsk on Sunday, January 18. Hide Caption 40 of 46 Crisis in Ukraine 46 photos A building hit by Ukrainian artillery is seen in the Voroshilovsky area of Donetsk on January 18. Hide Caption 41 of 46 Crisis in Ukraine 46 photos Men from the Azov Volunteer Battalion board a bus in Kiev to join the fight against the rebels on Saturday, January 17. Hide Caption 42 of 46 Crisis in Ukraine 46 photos Rebels sit atop a tank at a checkpoint north of Luhansk, Ukraine, on Wednesday, January 14. Hide Caption 43 of 46 Crisis in Ukraine 46 photos A Ukrainian soldier looks down from a military truck at the Donetsk airport on Tuesday, January 6. The airport has been the scene of some of the fiercest fighting in eastern Ukraine. Hide Caption 44 of 46 Crisis in Ukraine 46 photos Ukrainian President Petro Poroshenko gives a speech as he hands over new military equipment to forces near the city of Ghytomyr, Ukraine, on Monday, January 5. Hide Caption 45 of 46 Crisis in Ukraine 46 photos A Ukrainian volunteer fighter fires a machine gun at pro-Russian rebels near the village of Pisky, Ukraine, on Saturday, January 3. Hide Caption ", "external_links": [], "published": "2015-06-07T07:40:00.000+03:00", "crawled": "2015-06-07T07:40:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}