{"organizations": [], "uuid": "d503d4e0dc0c55f11e8ccb7c57cd68f57d8ea99a", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3098052/images/o-MICHELLE-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/06/20/fotos-de-la-semana_n_7624106.html", "country": "", "title": "10 fotos de la semana: ¿Qué le pasó a Michelle Obama?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "10 fotos de la semana: ¿Qué le pasó a Michelle Obama?", "spam_score": 0.0, "site_type": "news", "published": "2015-06-21T03:49:00.000+03:00", "replies_count": 0, "uuid": "d503d4e0dc0c55f11e8ccb7c57cd68f57d8ea99a"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/06/20/fotos-de-la-semana_n_7624106.html", "ord_in_thread": 0, "title": "10 fotos de la semana: ¿Qué le pasó a Michelle Obama?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "\nAlgunas fotos de las principales noticias de los últimos siete días. Una semana en que la nación vivió otro hecho violento, trágico en una iglesia de Charleston, Carolina del Sur. 1 Campamento de refugiados sirios en la frontera turco-siria. 20 de junio de 2015. 2 ASSOCIATED PRESS Residentes de una villa en Afganistán comparten comida en el inicio de la celebración del Ramadán. 19 de junio de 2015. 3 Chuck Burton/AP Dylann Storm Roof, el atacante de una iglesia metodista afroamericana en Charleston, Carolina del Sur. Nueve muertos como resultado de la matanza. Otro hecho de violencia que enluta al país. 18 de junio de 2015. 4 David Goldman/AP Olina Ortega, a la izquierda, y Austin Gibbs, a la derecha, prenden sus velas en un servicio de recordación por las víctimas de la matanza de Charleston. 18 de junio de 2015. 5 Stephen B. Morton/AP Dolor y luto ante otro hecho de violencia en el país. Charleston, Carolina del Sur, enfrentando otra tragedia. Mujer reza en las afueras de la iglesia metodista donde el atacante mató a nueve personas durante un estudio religioso. 19 de junio de 2015. 6 ASSOCIATED PRESS Michelle Obama en Italia y así reacciona con un vestido para bebé en encuentro con soldados estadounidenses y sus familias. 19 de junio de 2015. 7 ASSOCIATED PRESS Malia Obama reparte helados a los hijos de los soldados en el norte de Italia como parte de una gira que realiza con su madre y hermana por Europa. 19 de junio de 2015. 8 Seth Wenig/AP Jose Luis Hernandez, un inmigrante hondureño que perdió parte de sus dedos cuando cayó del tren conocido como \"La Bestia\" ofrece una conferencia de prensa en Nueva York. 15 de junio de 2015. 9 HIllary Clinton en plena campaña presidencial. 15 de junio de 2015. 10 Lynne Sladky/AP El exgobernador de Florida Jeb Bush besa a su esposa Columba durante el anuncio de su candidatura presidencial por el Partido Republicano durante un evento en el Miami Dade Community College el pasado lunes 15 de junio de 2015. Más: ", "external_links": [], "published": "2015-06-21T03:49:00.000+03:00", "crawled": "2015-06-21T03:50:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}