{"organizations": [], "uuid": "4f3baf87476e33836b95cf6288a9f41d32d9329c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3025308/images/o-MARIJUANA-BIBLE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/02/indianas-church-of-marijuana_n_7496084.html", "country": "US", "title": "Indiana's Church Of Marijuana Granted Tax-Exempt Status From IRS", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Indiana's Church Of Marijuana Granted Tax-Exempt Status From IRS", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T22:00:00.000+03:00", "replies_count": 0, "uuid": "4f3baf87476e33836b95cf6288a9f41d32d9329c"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/02/indianas-church-of-marijuana_n_7496084.html", "ord_in_thread": 0, "title": "Indiana's Church Of Marijuana Granted Tax-Exempt Status From IRS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Indiana's Church Of Marijuana Granted Tax-Exempt Status From IRS Posted: reddit \nIndiana's First Church of Cannabis -- a religious sect that embraces marijuana use as a sacrament , newly formed under the state's controversial Religious Freedom Restoration Act -- has just received the classification that so many religious organizations covet: tax-exemption status under section 501(c)(3) of the Internal Revenue Service code. \n\"We are pleased to inform you that upon review of your application for tax exempt status we have determined that you are exempt from Federal income tax,\" the IRS cover letter to the church, dated May 21, reads. \"We determined that you are a public charity.\" A copy of the IRS letter was provided to The Huffington Post by Bill Levin, the church's founder. \nThe church's tax exemption status means it can take full advantage of the benefits of being considered a public charity by the federal government, including the deduction of financial contributions, limits on the IRS's ability to audit the church, and being qualified to receive tax-deductible gifts and more . It's also good news for the nearly $11,000 the church has raised through a crowdfunding account over the last several months. \n\"The approval came in under 30 days, which if you're a lawyer you sort of go, 'How the hell did that happen?'\" Levin told HuffPost. \"We filled out the long form, sent it in to the IRS and expected that usual 180-day wait -- but it was back on our desk in under 30 days.\" \nThe IRS's own website says it will respond within 180 days to the long-form application. So how did this new church get such a quick turnaround? \n\"The power of love,\" Levin said. \nLevin's church will likely put to the test Indiana's fraught \"religious freedom\" law, which when first introduced would have allowed businesses to discriminate against lesbian, gay, bisexual and transgender individuals. After considerable national criticism of the original text of the law, Indiana Gov. Mike Pence (R) signed a revised version that does not allow businesses to deny goods or services to LGBT people. \nWhile some may question the true intent of a church that includes marijuana use as part of membership, Levin isn't joking around about his new faith. He says it's founded on universal principals of love, respect, equality and compassion. And similarly to other religious movements like the Rastafarians in Jamaica who see cannabis use as a sacrament, Levin said members of his church -- which he calls \"canatarians\" -- will adopt a similar belief in the plant. But unlike the Rastas, there is not a traditional deity at the top of this faith. \n\"It has nothing to do with God; I don't have the balls to describe a god to anybody,\" Levin told HuffPost in March . \nLevin explained that his belief is that the human body is \"hard-wired\" for cannabis consumption for \"health benefits.\" He believes that the plant helps to heal damage from processed and heavily sugared foods and drinks. \nThe church was already officially recognized by Indiana's secretary of state office in March, so the tax-exempt status only bolsters its standing as an actual church. But it remains unclear how the state will respond to the church's embrace of marijuana use, as the substance remains illegal under state law. \nA church that includes sacramental marijuana use is not without precedent, and several have emerged in the United States with varying degrees of success. But much of their ability to survive hinges on a state at least decriminalizing marijuana, if not legalizing it for limited purpose. Abdul-Hakim Shabazz, an Indiana attorney and political commentator, told RawStory in March that if Levin can convince the state that, under the RFRA, smoking marijuana is part of his religion's practices, he may have \"a pretty good shot of getting off scot-free.” \nIn a recent interview with MSNBC , the church's attorney, Jon Sturgill, argues that the Church of Cannabis' \"canatarians\" deserve the same protections for their marijuana use that members of more established religions, like Catholicism, already receive for the practice of drinking wine. \n\"You've got 300 people at a Mass and 50 minors going up and drinking wine -- is it illegal outside the confines of that sanctuary? Yes,\" Sturgill said. \"It is not, because it is an exemption under RFRA.\" \nAs for where the church's followers will congregate, Levin is still in search of a proper venue, but says the church is very close to closing on a building. \n\"The reality of it is we are a 90 day old business with no credit and $10,000 in the bank,\" Levin said about acquiring a space for the church. \"It's just a matter of being creative with the financing.\" \nHe's confident a satisfactory building will be found in time for what will be the church's first service on July 1 -- just after the RFRA law goes into effect. Levin expects more than 1,000 people will attend that first service. \n\"The law goes into effect at noon, and we'll start our service at 12:01 p.m.,\" Levin said. For the first service, there will be live music, storytelling and an interactive discussion of what it means to \"live, love, laugh, learn, create, grow and teach\" Levin said. \nAfter that, the congregation will stand, read the foundational tenets of the faith -- which Levin dubbed the \"Deity Dozen,\" and include such advice as \"Don't be an asshole\" and \"Laugh often, share humor\" -- culminating in the use of the church's sacrament: marijuana. \n\"At the end,\" Levin says, \"we'll all light up and celebrate the birth of a new religion.\" Also on HuffPost:", "external_links": [], "published": "2015-06-02T22:00:00.000+03:00", "crawled": "2015-06-03T03:15:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}