{"organizations": [], "uuid": "40181d19356dc33575cb27b0b30059ffb08f21ab", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1876007/images/o-ECONOMY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/wall-street/feed", "section_title": "Wall Street on Huffington Post", "url": "http://www.huffingtonpost.com/robert-hardaway/republicans-rally-to-give_b_7588156.html", "country": "US", "title": "Robert Hardaway: Republicans Rally to Give Obama Full Support on Trade Powers", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Robert Hardaway: Republicans Rally to Give Obama Full Support on Trade Powers", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T16:58:00.000+03:00", "replies_count": 0, "uuid": "40181d19356dc33575cb27b0b30059ffb08f21ab"}, "author": "Robert Hardaway", "url": "http://www.huffingtonpost.com/robert-hardaway/republicans-rally-to-give_b_7588156.html", "ord_in_thread": 0, "title": "Robert Hardaway: Republicans Rally to Give Obama Full Support on Trade Powers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nIn 1930, populist Republicans Reed Smooth and Wallis Hawley rammed through the notorious Tariff Act of 1930, which eschewed free trade treaties and instead raised tariffs on 20,000 imported goods, purportedly on grounds of \"protecting American jobs.\" Of course it did nothing of the sort, as trading partners responded by raising their own trade barriers, causing American exports to decline by more than half, putting millions of Americans out of work and thereby, according to economists, ushering in the Great Depression. \nRecognizing the harm that trade barriers had inflicted upon the American economy, Roosevelt campaigned strenuously against the Act, and employers begged President Hoover to veto the bill in order to avoid massive layoffs. Hoover recognized the anti-free trade bill as \"vicious, extortionate, and obnoxious\" as well as job-killing, but nevertheless caved in to the most demagogic Republican Party leaders and signed the bill. \nIn the infamous 1993 debate between Al Gore and Ross Perot on the Larry King Show, a strident Ross Perot, following in the footsteps of Republicans Smoot and Hawley, demanded defeat of the free-trade NAFTA bill, prompting Al Gore to present Perot with a framed picture of a smirking Smoot and Hawley shaking hands after having put the country on an inexorable path toward the Great Depression. Flustered, Perot revealing his lack of understanding of basic economic principles such as the law of comparative advantage, did himself little good by simply reiterating his objection to free-trade on grounds that it would just benefit \"those people\" down in Mexico. \nWhile Republicans have not been bashful about opposing Obama when they believe he has over-stepped his constitutional authority, they have supported him fully when it comes to giving him full powers to negotiate on matters important to the American economy and the preservation of American jobs. Accordingly, Republicans have overwhelmingly supported giving the President negotiating powers with trading partners, while a number of Democrats, supported by some \"populist\" Tea Partiers\" have decided to oppose the president by assuming the long discredited mantle of Smoot and Hawley. Despite the procedural setback last week, there remains hope among those interested in protecting American jobs particularly in high wage export industries, for a trade bill in the coming week. \nWhile economists overwhelmingly support free trade which allows every country to maximize its output by producing what it is most efficient at producing, and then trading for similar goods most efficiently produced by trading partners, today's followers of Smooth and Hawley, like their Republican predecessors, fail to recognize not only that eschewing free trade devastates jobs in high-wage exporting industries, but also forfeits money that could be earned from imports by creating jobs in the service and marketing industries--all on the back of hapless consumers, especially the poor, obliged to pay higher prices for goods because of oppressive tariff taxes on those goods. \nEconomists recognize that some workers in some poverty-wage import industries like textiles might require some adjustment and re-training in the aftermath of a free-trade bill for Americans previously mired in such jobs as a result of high tariffs on imported textiles, but are puzzled by the fact that political demagogues are apparently willing to preserve low-wage import jobs at the cost of cutting higher wage export jobs. Our competitive advantage is in capital, not in slave wages. \nWhile it is true that other job-killing and wage-reducing policies such as flooding the U.S. labor market with millions of illegal overseas workers or pricing the poor out of the labor market with mandatory above market wages, will continue to put pressure on jobs and wages, that is no reason to allow demagogues to defy the president by depriving him of the powers he needs to preserve American jobs in both the export and import industries. More:", "external_links": [], "published": "2015-06-16T16:58:00.000+03:00", "crawled": "2015-06-16T21:51:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}