{"organizations": [], "uuid": "3f5d2949966e3bd7fd959e984e3cd0250ae2006b", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2011/10/27/eu-tropas-en-iraq.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/06/10/democratas-ven-similitudes-con-vietnam-en-los-planes-de-obama-para-iraq", "country": "", "title": "Demócratas ven similitudes con Vietnam en los planes de Obama para Iraq", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Demócratas ven similitudes con Vietnam en los planes de Obama para Iraq", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T23:28:00.000+03:00", "replies_count": 0, "uuid": "3f5d2949966e3bd7fd959e984e3cd0250ae2006b"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/06/10/democratas-ven-similitudes-con-vietnam-en-los-planes-de-obama-para-iraq", "ord_in_thread": 0, "title": "Demócratas ven similitudes con Vietnam en los planes de Obama para Iraq", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Demócratas ven similitudes con Vietnam en los planes de Obama para Iraq Varios legisladores demócratas manifestaron inquietudes acerca del envío de más soldados estadounidenses a respaldar a las fuerzas iraquíes Miércoles, 10 de junio de 2015 a las 15:19 La Casa Blanca confirmó que enviarían más soldados a entrenar a los iraquíes (EFE). Lo más importante La Casa Blanca confirmó que enviarán alrededor de 450 soldados para entrenar a las fuerzas iraquíes en la lucha contra ISIS Varias voces demócratas manifiestan inquietudes de que esta medida lleve a Estados Unidos a un nuevo Vietnam Temas relacionados Recuerdo que cuando dije que 'necesitamos salir de Iraq', la gente me dijo que sería un desastre. Va a ser un desastre, pase lo que pase José Serrano, asambleísta por Nueva York ¿Cuál es el \"talón de Aquiles\" de ISIS? ISIS obtiene armas de EU tras victoria en Ramadi \nWASHINGTON (CNN) — Cuando la Casa Blanca anunció que enviaría hasta a 450 soldados para ayudar a asesorar a los soldados iraquíes, algunos demócratas de la Asamblea de Representantes de Estados Unidos encontraron similitudes con Vietnam. \n\"Así fue exactamente como empezó Vietnam\", dijo el asambleísta Charlie Rangel a los reporteros por la mañana del miércoles 10 de junio. \nEl gobierno de Obama anunció el miércoles que planea enviar unos 450 soldados estadounidenses más a Iraq para entrenar a los soldados de ese país y posiblemente también a las tribus sunitas, según confirmó la Casa Blanca el miércoles. \nLa administración de Obama planea entrenar a los combatientes de las tribus sunitas como parte de su estrategia de enviar más soldados estadounidenses a Iraq . Estados Unidos también enviará armas a las tribus sunitas y chiitas, así como a los combatientes peshmerga kurdos, quienes combaten al Estado Islámico en Iraq y Siria bajo las órdenes de los iraquíes. \nUn funcionario de la administración de Obama dijo que esperan que se dé un nuevo \"levantamiento sunita\" como el que ocurrió en 2013, pero esta vez en contra de los combatientes del Estado Islámico. \n\"Esto está diseñado para centrarse en el adiestramiento de los sunitas\", dijo el funcionario. \nEl personal militar estadounidense adicional entrenará y asesorará a los soldados iraquíes y tribales en la base militar de Taqaddum, en la provincia oriental de Anbar. \nLos combatientes sunitas seguirán con la estrategia estándar de someterse a una revisión de seguridad por parte de los iraquíes antes de que se les permita unirse, con el fin de asegurarse de que no sean leales a ISIS, de acuerdo con el funcionario. \nNo obstante, Rangel dijo que \"no solo es inconstitucional, sino inmoral\" enviar más soldados estadounidenses a incorporarse a los 3,050 que ya se encuentran en Iraq sin que el Congreso haya declarado la guerra. \nEl asambleísta demócrata por Nueva York, José Serrano, también comparó el plan más reciente de Obama con Vietnam y dijo que le recuerda que también se han enviado \"asesores\". \n\"Recuerdo que cuando dije que 'necesitamos salir de Iraq', la gente me dijo que sería un desastre\", dijo. \"Va a ser un desastre, pase lo que pase\". \nSin embargo, el plan de Obama recibió el visto bueno del asambleísta republicano por Illinois, Adam Kinzinger, veterano de la guerra en Iraq, aunque el miércoles manifestó que le preocupa que el presidente no esté enviando soldados adicionales suficientes a la región para combatir a ISIS. \n\"Este podría ser un buen plan. Creo que es un acontecimiento positivo. Pero a final de cuentas, temo que se requerirá una participación de Estados Unidos mayor de la que (Obama) quiere reconocer\", dijo Kinzinger. \nCon información de Laura Koran y Deirdre Walsh. Encuentra este artículo con: iraq, soldados, estados unidos, asesoria, entrenamiento, sunitas, chiitas, peshmerga, kurdos, vietnam, congreso, asamblea, democratas, barack obama Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"11c70b84f8204bb7b8a5a8f65db5bd85\", \"time\": \"2015-06-10T20:42:22.776Z\" } Video ", "external_links": [], "published": "2015-06-10T23:28:00.000+03:00", "crawled": "2015-06-10T23:42:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}