{"organizations": ["Fox News North Carolina", "Facebook", "Twitter"], "uuid": "c27b614a37a35ed6b0650a1f3562157ca36fe44e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/06/04/north-carolina-lawmakers-approve-72-hour-abortion-waiting-period/", "country": "", "title": "North Carolina lawmakers approve 72-hour abortion waiting period | Fox News", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "North Carolina lawmakers approve 72-hour abortion waiting period | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T08:40:00.000+03:00", "replies_count": 0, "uuid": "c27b614a37a35ed6b0650a1f3562157ca36fe44e"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/04/north-carolina-lawmakers-approve-72-hour-abortion-waiting-period/", "ord_in_thread": 0, "title": "North Carolina lawmakers approve 72-hour abortion waiting period | Fox News", "locations": ["North Carolina"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "North Carolina lawmakers approve 72-hour abortion waiting period Published June 04, 2015 Facebook 0 Twitter 0 Email Print \nRALEIGH, N.C. – North Carolina lawmakers passed a bill on Wednesday that would make the state one of several with 72-hour waiting periods for an abortion, sending the bill to the Republican governor who plans to sign it. \nHours after the bill passed, Gov. Pat McCrory said he was pleased with progress made on the bill in recent days and planned to sign it. The House and Senate chambers in the GOP-controlled legislature approved the measure by margins above the threshold for overcoming a veto. \nBill supporters have said that increasing the state's waiting period from the current 24 hours will give pregnant women more time to collect information about a difficult decision. The bill's House sponsors also said they hope the measure would lead to fewer abortions. \nThe bill requires women to talk to a doctor or other qualified professional 72 hours before having an abortion, unless there's a medical emergency. \nThree other states have 72-hour waiting periods: Missouri, South Dakota and Utah. Oklahoma's waiting period of that length goes into effect in November. \nThe bill adds other rules for doctors and clinics that perform abortions and includes several unrelated criminal justice measures. \nDemocratic lawmakers and other opponents have said there is no medical reason for increasing the wait, and they've complained that Republicans want to add more hurdles for women seeking a procedure that courts have ruled to be constitutionally protected. \n\"In the majority's view, a woman's right to choose is an empty and hollow concept with little meaning,\" said Rep. Rick Glazier, a Cumberland County Democrat. \nSince Republicans took over North Carolina's legislature in 2011, the state has passed several laws aimed at limiting abortions, including the current 24-hour waiting period. Some credit the laws with contributing to the 26 percent decline in the number of abortions in North Carolina since 2010. \nThe bill that passed Wednesday also requires doctors to provide more data to state regulators about certain second-trimester abortions, and it makes clear that clinics and ambulatory surgical centers performing abortions must be inspected annually and that no one under 18 can work at them. \nOther criminal justice measures expand the definition of statutory rape, make administrative changes to child support collection and specify places that must be avoided by sex offenders registered in other states who come to North Carolina. \nThe bill's passage was applauded by Tami Fitzgerald, executive director of the NC Values Coalition. She called it \"a major victory that will protect women and save the lives of unborn children in North Carolina.\" She urged the governor to sign it. \nOpponents of the bill had urged McCrory to stand by his answer in a 2012 gubernatorial debate when he was asked what further abortion restrictions he would sign if elected. McCrory responded only: \"None.\" \nIn announcing his plans to sign the bill, McCrory argued that it won't restrict access. \n\"We ensured that contact, including a simple phone call, would start a reasonable process that protects women's health, and we also more clearly and rationally defined medical training and qualifications to ensure there will be no further restrictions on access,\" he said. \nPlanned Parenthood and NARAL Pro-Choice North Carolina said before the governor's announcement that they planned to deliver thousands of petitions on Thursday urging the governor to veto the bill. \n\"Going back on his word by allowing these new restrictions to become law would represent a fundamental betrayal of voters' trust,\" said Alison Kiser, Senior Director of Communications for Planned Parenthood South Atlantic. Advertisement ", "external_links": [], "published": "2015-06-04T08:40:00.000+03:00", "crawled": "2015-06-04T08:40:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}