{"organizations": ["Marijuana Research White House"], "uuid": "bbaf12aaa09a57812432463dcf3d7e1e95e5307d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3101610/images/o-MARIJUANA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/22/public-health-service-review_n_7635760.html", "country": "", "title": "White House Takes Huge Step Forward In Fight Over Marijuana Research", "performance_score": 10, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "White House Takes Huge Step Forward In Fight Over Marijuana Research", "spam_score": 0.0, "site_type": "news", "published": "2015-06-22T16:56:00.000+03:00", "replies_count": 0, "uuid": "bbaf12aaa09a57812432463dcf3d7e1e95e5307d"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/22/public-health-service-review_n_7635760.html", "ord_in_thread": 0, "title": "White House Takes Huge Step Forward In Fight Over Marijuana Research", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "White House Takes Huge Step Forward In Fight Over Marijuana Research Posted: reddit \nWASHINGTON -- The White House took a major step forward on Monday to support research into the medical properties of marijuana, lifting a much-maligned bureaucratic requirement that had long stifled scientific research. \nBy eliminating the Public Health Service review requirement, the Office of National Drug Control Policy (ONDCP), also known as the drug czar's office, will help facilitate research into the drug. \nThe requirement had long outgrown today's marijuana politics. Even opponents of legalization have called for it to be lifted. As HuffPost's Matt Ferner reported earlier: \nCurrently, marijuana research that is not funded by the government must go through a Public Health Service review -- a process established in 1999 by the federal government after a 1998 Institute of Medicine report called for more scientific research into the medical value of marijuana. \nIt's a process that no other substance classified by the government as Schedule I is subject to and one that researchers and lawmakers alike have criticized. \nUnder the Controlled Substances Act, the U.S. has five categories for drugs and drug ingredients . Schedule I is reserved for what the DEA considers to have the highest potential for abuse and no medical value. Marijuana has been classified as Schedule I for decades, alongside other substances like heroin and LSD. \nDrug czar spokesman Mario Moreno Zepeda said, “The Obama Administration has actively supported scientific research on whether marijuana or its components can be safe and effective medicine. Eliminating the Public Health Service review should help facilitate additional research to advance our understanding of both the adverse effects and potential therapeutic uses for marijuana or its components.” More: ", "external_links": [], "published": "2015-06-22T16:56:00.000+03:00", "crawled": "2015-06-22T16:58:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}