{"organizations": [], "uuid": "081f80fb0b8ef0de095bca8735363ee366dbc2f7", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3108128/images/o-OBAMA-PLAYS-BASKETBALL-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/23/obama-basketball_n_7645194.html", "country": "", "title": "Barack Obama Tells Marc Maron He's Pretty Bad At Basketball Now", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Barack Obama Tells Marc Maron He's Pretty Bad At Basketball Now", "spam_score": 0.0, "site_type": "news", "published": "2015-06-23T19:56:00.000+03:00", "replies_count": 0, "uuid": "081f80fb0b8ef0de095bca8735363ee366dbc2f7"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/23/obama-basketball_n_7645194.html", "ord_in_thread": 0, "title": "Barack Obama Tells Marc Maron He's Pretty Bad At Basketball Now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama Tells Marc Maron", "Obama"], "text": "A video posted by @washwizards on Apr 6, 2015 at 9:19am PDT Those days are over for Obama. No more balling up for the cameras. No more talking smack to All-Star NBA players. Obama is, by his own admission, completely washed. \nOn the latest episode of \"WTF with Marc Maron,\" Obama was frank about politics, family life and, most important, his basketball abilities . \n\"I’ve been trying to work out pretty hard to try and stay in shape. I used to play basketball more,\" Obama said with a sudden downtrodden tone. \"But these days, I’ve gotten to the point where it’s not as much fun because I’m not as good as I used to be, and I get frustrated.” \nObama used to be good. (Source: Perez Hilton) \nNow he's old and bad. (Source: Huffington Post) \n“I was never great, but I was a good player and I could play seriously,\" Obama continued. \"Now I’m one of these old guys who’s running around. The guys I play with -- who are all a lot younger -- they sorta pity me and sympathize with me. They tolerate me, but we all know I’m the weak link on the court and I don’t like being the weak link.” \nNBA players can corroborate Obama's downfall. Last Thursday, when asked if Justin Bieber could beat Obama in a game of one-on-one, Washington Wizards point guard John Wall picked Bieber . \nThat's sad, because if you envision Wall's decision like you would a quick pickup game draft, Bieber being drafted ahead of the president is unfortunate in any situation, especially in basketball. \nFor what it's worth, I'd still take Obama as the Knicks' starting shooting guard though. Also on The Huffington Post Close ", "external_links": [], "published": "2015-06-23T19:56:00.000+03:00", "crawled": "2015-06-23T22:55:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}