{"organizations": ["U.S. Peace Corps", "USAID", "Campaign for Female Education", "University of Cambridge", "Georgetown University", "CNN"], "uuid": "e2f7b344f92581913e6c66e1ac39c539f6b8197a", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i.cdn.turner.com/cnn/.e/img/4.0/logos/cnn_logo_social.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/06/16/politics/donald-trump-2016-announcement-elections/index.html", "country": "US", "title": "Michelle Obama to announce new girls' education initiative during London trip", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Michelle Obama to announce new girls' education initiative during London trip", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T13:09:00.000+03:00", "replies_count": 0, "uuid": "486fa190f8dd40dfad938fb72678e23fd87e53fa"}, "author": "", "url": "http://edition.cnn.com/2015/06/16/europe/obama-london-girls-education/index.html", "ord_in_thread": 0, "title": "Michelle Obama to announce new girls' education initiative during London trip", "locations": ["United States", "Kensington Palace", "Democratic Republic of the Congo", "Europe", "U.K.", "United Kingdom", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Wright", "Harry", "Obama", "Michelle Obama"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Michelle Obama to announce new girls' education initiative during London trip David Wright, CNN Updated 1109 GMT (1809 HKT) June 16, 2015 (CNN) In London for two days this week, first lady Michelle Obama is set to announce on Tuesday a new partnership between the United States and United Kingdom to improve girls' access to education around the world. The two countries will \"launch a nearly $200 million partnership to continue their collective support for adolescent girls' education,\" according to a press release from Obama's office. Special attention and portions of the funds will be devoted \"to countries affected by conflict and crisis,\" with the Democratic Republic of the Congo set to receive $180 million over five years, benefitting \"more than 755,000 girls aged 10 to 18.\" Under the new partnership, the United States and United Kingdom will collaborate to build support for improved girls' education access through efforts including enrolling students in accelerated primary school programs, reducing barriers to school access and mobilizing parental and community support. Both countries will also seek to improve the quality of teaching and learning materials and identify improvements to school governance. Building and sharing evidence as it relates to improving girls' education will be a key feature of the new partnership, according to the release. The United States and United Kingdom will establish a platform to share adolescent girls' education data from various advocacy and academic organizations, including the University of Cambridge and Georgetown University, and \"produce research and provide guidance and technical support\" through USAID's Education in Conflict and Crisis Network. Additionally, the partnership will encourage other advocacy organizations to \"collaborate and share community-based solutions\" to assist vulnerable girls, with the U.S. Peace Corps and U.K.'s Campaign for Female Education set to share \"best practices\" developed based on their experience. The announcement press release notes that \"62 million girls are out of school around the world,\" and that \"when a girl receives a quality education, she is more likely to earn a decent living, raise a healthy, educated family and improve the quality of life for herself, her family and her community.\" Furthermore, the release adds that \"girls' attendance in secondary school is also correlated with later marriage, later childbearing, lower maternal and infant mortality rates, lower birth rates, lower rates of HIV/AIDs and significantly higher earning power.\" As part of her \"Let Girls Learn\" initiative, Obama will also meet with students while in London to discuss how the two countries are working together to expand access to girls education around the world. Obama started her day by meeting with Prince Harry Tuesday at Kensington Palace, where they talked about \"Let Girls Learn\" and their interest in supporting veterans and their families. More from Europe", "external_links": [], "published": "2015-06-16T13:09:00.000+03:00", "crawled": "2015-06-16T13:29:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}