{"organizations": ["WWF"], "uuid": "d8c05caf749fc47c01a0012506375361e9aece58", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3091100/images/o-OBAMA-POPE-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/18/obama-pope-encyclical_n_7615454.html", "country": "", "title": "Obama 'Deeply Admires' The Pope's Climate Change Encyclical", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama 'Deeply Admires' The Pope's Climate Change Encyclical", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T00:26:00.000+03:00", "replies_count": 0, "uuid": "d8c05caf749fc47c01a0012506375361e9aece58"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/18/obama-pope-encyclical_n_7615454.html", "ord_in_thread": 0, "title": "Obama 'Deeply Admires' The Pope's Climate Change Encyclical", "locations": ["Southern Ocean", "Antarctica", "Earth", "West Antarctic Peninsula", "Arctic Circle", "Venice", "Alaska"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Climate Change: Ten Beautiful Places Under Threat of   The impacts of climate warming in Alaska are already occurring, experts have warned. Over the past 50 years, temperatures across Alaska increased by an average of 3.4°F. Winter warming was even greater, rising by an average of 6.3°F jeopardising its famous glaciers and frozen tundra. The most fragile of Italian cities has been sinking for centuries. Long famous for being the city that is partially under water, sea level rise associated with global warming would have an enormous impact on Venice and the surrounding region. The Italian government has begun constructing steel gates at the entrances to the Venetian lagoon, designed to block tidal surges from flooding the city. However, these barriers may not be enough to cope with global warming. The West Antarctic Peninsula is one of the fastest warming areas on Earth, with only some areas of the Arctic Circle experiencing faster rising temperatures. Over the past 50 years, temperatures in parts of the continent have jumped between 5 and 6 degrees F— a rate five times faster than the global average. A 2008 report commissioned by WWF warned that if global temperatures rise 3.6 degrees Fahrenheit (2 degrees Celsius) above pre-industrial averages, sea ice in the Southern Ocean could shrink by 10 to 15 percent. The rapid decline of the world's coral reefs appears to be accelerating, threatening to destroy huge swathes of marine life unless dramatic action is swiftly taken, leading ocean scientists have warned. About half of the world's coral reefs have already been destroyed over the past 30 years, as climate change warms the sea and rising carbon emissions make it more acidic. The world's highest mountain range contains the planet's largest non-polar ice mass, with over 46,000 glaciers. The mammoth glaciers cross eight countries and are the source of drinking water, irrigation and hydroelectric power for roughly 1.5 billion people. And just like in Antarctica, the ice is melting. An expected 2°C rise in the world’s average temperatures in the next decades will impact island economies such as the Maldives with extreme weather patterns and rising sea levels. Over the last century, global warming has caused all Alpine glaciers to recede. Scientists predict that most of the glaciers in the Alps could be gone by 2050. Global warming will also bring about changes in rain and snowfall patterns and an increase in the frequency of extreme meteorological events, such as floods and avalanches, experts have warned. The Arctic is ground zero for climate change, warming at a rate of almost twice the global average. The sea ice that is a critical component of Arctic marine ecosystems is projected to disappear in the summer within a generation. Called the \"epicenter of the current global extinction,\" by Conservation International, this smattering of more than 4,000 South Pacific islands is at risk from both local human activity and global climate change.  Share ", "external_links": [], "published": "2015-06-19T00:26:00.000+03:00", "crawled": "2015-06-19T00:28:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}