{"organizations": [], "uuid": "2a76d360cba99c8214ac71ece1845fe527dd7b00", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_may_26_0.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/244632-obama-using-hollywood-tv-interview-to-defend-health-law", "country": "US", "title": "Obama using Hollywood TV interview to defend health law", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama using Hollywood TV interview to defend health law", "spam_score": 0.0, "site_type": "news", "published": "2015-06-11T03:04:00.000+03:00", "replies_count": 0, "uuid": "2a76d360cba99c8214ac71ece1845fe527dd7b00"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/244632-obama-using-hollywood-tv-interview-to-defend-health-law", "ord_in_thread": 0, "title": "Obama using Hollywood TV interview to defend health law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama using Hollywood TV interview to defend health law By Jordan Fabian - 06/10/15 08:04 PM EDT President Obama on Thursday will use a television interview to make the case his healthcare law has helped save lives, just weeks before it faces a major legal test. Obama will sit down with Jerry Penacoli, a correspondent for the syndicated entertainment news program “Extra” who says ObamaCare helped him receive life-saving cancer treatment. Penacoli plans to “discuss his own personal story with the president and how the Affordable Care Act quite literally saved his life,” according to a statement from the program. ADVERTISEMENT The interview comes as the White House is ramping up its defense of ObamaCare in advance of a Supreme Court case that threatens to unravel the law. That case, King v. Burwell, will decide whether federal insurance subsidies for nearly 6.4 million people are legal. Obama has expressed confidence the court will rule in his favor, but his administration has said there is no easy fix if the court decides to strike down the subsidies. Provisions in the law eliminating lifetime limits on insurance benefits helped Penacoli receive treatment for thyroid cancer and melanoma “without losing his life savings,” according to “Extra.” Earlier this week, Obama expressed deep disappointment with the myriad legal challenges and political attacks the law has faced. “It seems so cynical to want to take coverage away from millions of people, to punish millions with higher costs of care and unravel what’s now become part of the fabric of America,” he said during a speech to the Catholic Health Association on Tuesday. Past: 1 day Bill would require trade deals to... A House trade vote could come as soon as this week. Republicans fear they will win... Republicans in Congress are worried the Supreme Court will hand them a... Fast talk from the fast-track... Some GOP members say that TPA will \"constrain the president,\" but it's... Obama’s frustration with courts... Obama made some of his toughest and bluntest comments to date. Benghazi chairman pushes back... Trey Gowdy has been accused of using the Benghazi investigation to raise... Bachelor Graham hints at 'rotating... “Well, I've got a sister. She could play that role if necessary,” Graham... Sanders pulls within 8 points of... National Republican Party leaders frame the results as trouble for Clinton. Sheldon Adelson's mistake In just the last year, BDS proponents in the US have marked several major... White House press room evacuated... President Obama and the first family remained in the building during the... White House: 'Prudent' for Texas... Images of the McKinney, Texas, incident “have a detrimental impact,\" Josh... Top 10 undecided House members to... The White House has joined forces with GOP leaders to furiously lobby... Rubio slams Times after paper... A spokesman says it's \"the latest in their continued hits against Marco... Bill Press: Why not Joe for 2016? OPINION | Why isn’t Vice President Joe Biden at the top of the list of... Bernie Sanders's great idea: Free... Nothing would do more to bring opportunity to young men and women... President decries 'endless... Obama accuses critics of a cynical attempt to take coverage from people. Rumsfeld: 'Unrealistic' for Bush... Rumsfeld said the U.S. \"template\" is not always appropriate for other... Dems move to ban plastic guns The push follows major security lapses at U.S. airports. Obama smoking? President caught on... President Obama may have been caught on camera holding a pack of... Clint's Caitlyn quip cut from... Clint Eastwood made a Caitlyn Jenner joke at Spike TV's Guys' Choice... Court rejects challenge to Obama... An appeals court said it does not have the power to review a proposed... Republicans brace for Hurricane... Republicans are worried Trump will steal attention from other presidential...", "external_links": [], "published": "2015-06-11T03:04:00.000+03:00", "crawled": "2015-06-11T03:19:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}