{"organizations": ["House", "Facebook", "Twitter"], "uuid": "21e4166f3da3f1a754348055e3b986b6d85327bd", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss\r", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/03/gop-controlled-house-backs-state-medical-marijuana-laws/", "country": "", "title": "GOP-controlled House backs state medical marijuana laws", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "GOP-controlled House backs state medical marijuana laws", "spam_score": 0.0, "site_type": "news", "published": "2015-06-03T22:51:00.000+03:00", "replies_count": 0, "uuid": "21e4166f3da3f1a754348055e3b986b6d85327bd"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/03/gop-controlled-house-backs-state-medical-marijuana-laws/", "ord_in_thread": 0, "title": "GOP-controlled House backs state medical marijuana laws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP-controlled House backs state medical marijuana laws Published June 03, 2015 Facebook 0 Twitter 0 Email Print \nWASHINGTON – The GOP-controlled House voted Wednesday to prevent the federal government from blocking state laws that permit the use of medical marijuana. \nBut lawmakers narrowly declined to direct the Justice Department not to interfere with states like Colorado and Washington that permit the recreational use of marijuana. \nThe 242-186 vote on medical pot was a larger margin than a tally last year, when the House first approved it as part of a bill funding the Justice Department. Wednesday's vote was to renew the pro-pot language as part of a bill providing funding for the coming fiscal year. \nMost Republicans opposed the idea and the Senate is in GOP hands this year so the outcome could still be reversed. But Senate advocates of Medical marijuana won a test vote in the GOP-controlled Appropriations Committee last month. \nOn Wednesday, 67 Republicans, including libertarian-minded lawmakers such as Thomas Massie of Kentucky, combined with all but a handful of Democrats in support of states that allow doctors to prescribe pot for medical uses such as improving the appetites of cancer patients undergoing chemotherapy. \nAlmost half the states allow medical marijuana, which remains an illegal drug under federal law. But the federal government has adopted a hands-off approach to states that have adopted lenient marijuana laws. The Justice Department has issued guidance to governors in such states — including the three that have enacted laws permitting pot possession for recreational use — that it won't challenge those laws so long as marijuana is tightly regulated. \n\"The medical marijuana train has definitely left the station,\" said Rep. Earl Blumenauer, D-Ore. \nThe Treasury Department has also issued guidance intended to clarify that financial institutions can offer services to businesses that dispense marijuana, though industry advocates say most banks are still reluctant to do so for fear of prosecution. \nThe amendment to allow recreational pot use, offered by conservative Rep. Tom McClintock, R-Calif., was rejected by a surprisingly narrow 222-206 vote. McClintock's measure had less GOP support and more Democratic opposition than did the amendment on medical marijuana. Advertisement", "external_links": [], "published": "2015-06-03T22:51:00.000+03:00", "crawled": "2015-06-03T23:40:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}