{"organizations": [], "uuid": "24a16cf7e1f895dabb457f5d2a8069858d1f1ef6", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Scitech/0/0/john%20cusack%20876.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/entertainment/2015/06/05/john-cusack-president-obama-is-as-bad-or-worse-than-george-w-bush/", "country": "US", "title": "John Cusack: President Obama is 'as bad or worse than' George W. Bush", "performance_score": 2, "site": "foxnews.com", "participants_count": 3, "title_full": "John Cusack: President Obama is 'as bad or worse than' George W. Bush | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-05T03:00:00.000+03:00", "replies_count": 2, "uuid": "07ab3ce4b7b3d05709f3b05d570f82b69aba330f"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/entertainment/2015/06/05/john-cusack-president-obama-is-as-bad-or-worse-than-george-w-bush/#post-0", "ord_in_thread": 0, "title": "John Cusack: President Obama is 'as bad or worse than' George W. Bush", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 05, 2015 FoxNews.com livefyre Email Print Actor John Cusack arrives at the premiere of the movie \"Love & Mercy\" at the Samuel Goldwyn Theater in Beverly Hills, California June 2, 2015. (Reuters)\nJohn Cusack is not a fan of President Obama.\nThe \"Love & Mercy\" star shared his less-than favorable views on the president with the Daily Beast .\n\"Well, Obama has certainly extended and hardened the cement on a lot of Bush's post-9/11 Terror Inc. policies, so he's very similar to Bush in every way that way,\" Cusack told the Daily Beast . \"His domestic policy is a bit different, but when you talk about drones, the American Empire, the NSA, civil liberties, attacks on journalism and whistleblowers, he’s as bad or worse than Bush.\"\nCusack continued, \"He hasn’t started as many wars, but he’s extended the ones we had, and I don’t even think Dick Cheney or Richard Nixon would say the president has the right to unilaterally decide whom he can kill around the world. On Tuesdays, the president can just decide whom he wants to kill, and you know, since 9/11 there are magic words like “terror,” and if you use magic words, you can justify any power grab you want.\"\nThis isn't the first time Cusack has criticized Obama. In an interview prior to the 2012 election with law professor Jonathan Turley, he called Obama \"just another Ivy League a--hole shredding civil liberties and due process and sending people to die in some s---hole for purely political reasons.\"\nA year later, the actor also called out Obama and attorney general Eric Holder for their lack of \"accountability\" regarding the Associated Press scandal.\nMore on this... Vince Vaughn wants guns to protect schools More recently, Cusack took a slam at fellow actor Vince Vaughan's statement that guns should be placed in schools for protection. He said he thinks it's a \"bad idea\" but added it's \"not the kind of debate where you want to do a tit-for-tat with what two celebrities think about it.\"\nWATCH: Will Smith: This is a gun culture\nAdvertisement\nON OUR RADAR Amanda Bynes steps out\nTMZ Alba's steamy photo shoot\nTMZ Stodden's mom to do sex tape?\nTMZ 'Teen Mom' mug shots\nTMZ Hottest WAGs in golf\nTMZ Trending in Entertainment 1 Palins slams media's treatment of Duggars 2 Kellie: 'I'm sleeping with my producer' 3 The roles that got away 4 Abby Lee Miller drops 8 dress sizes 5 Jason Aldean lashes out See all Trends Advertisement", "external_links": [], "published": "2015-06-05T03:00:00.000+03:00", "crawled": "2015-06-05T18:23:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}