{"organizations": [], "uuid": "e845484a475e318ecce5443dbcd6e4f5e5b3efc5", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/06/24/could-obama-end-up-on-supreme-court-after-retires-from-white-house/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1435177776283.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/opinion/2015/06/24/could-obama-end-up-on-supreme-court-after-retires-from-white-house.html", "country": "US", "title": "Could Obama end up on the Supreme Court after he retires from the White House?", "performance_score": 0, "site": "foxnews.com", "participants_count": 24, "title_full": "Could Obama end up on the Supreme Court after he retires from the White House? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T03:00:00.000+03:00", "replies_count": 23, "uuid": "6231064b44f8eec3b84a397e5ed40c018fd76323"}, "author": "Zev Chafets", "url": "http://www.foxnews.com/opinion/2015/06/24/could-obama-end-up-on-supreme-court-after-retires-from-white-house.html#post-0", "ord_in_thread": 0, "title": "Could Obama end up on the Supreme Court after he retires from the White House?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Zev Chafets\n FoxNews.com livefyre Email Print FILE -- June 18, 2015: President Obama pauses while speaking in the Brady Press Briefing Room of the White House in Washington. (AP)\nIn his recent podcast interview with comedian Marc Maron, President Obama reflected on the passing of time. His daughters are growing older and have less time to hang with their dad. “I’ve got to start thinking, well, what’s going to replace that fun,” he said.\nGood question, and it goes for the rest of Obama’s life as well. In eighteen months he will be an ex-president, term-limited and out of a job. Just fifty-five, the former leader of the free world will still be in the prime of life.\nObama hasn’t said what he has in mind for his next act. His options are virtually endless. What he decides is going to matter—especially to Hillary Clinton and the Democratic Party.\nAssuming she is nominated, Hillary can’t be elected president in 2016 without a huge black turnout. Obama will, of course, endorse her, but his blessing can’t be lukewarm. He will have to go all out. In politics, that kind of an effort does not come without a quid pro quo.\nWhat could President Clinton do for her predecessor? The most obvious answer is: Appoint him to the Supreme Court.\nThere is a precedent. William Howard Taft went from the White House to the Court. As a former constitutional lawyer and teacher, Obama is more than qualified professionally.\nThe president has been a persistent critic of the conservative-leaning Roberts Court. He would automatically become the leader of the Court’s liberal faction and perhaps—with additional Clinton appointments—its eventual majority. That, in turn, would give him a chance to defend his own presidential legacy and press his agenda.\nNot incidentally, appointing Obama to the Supreme Court would serve the interests of President Hillary Clinton. Out of office, Obama would likely remain the de facto leader of the Democratic African-American base and a powerful voice on issues like immigration, gun control, voting rights and free trade. This is the sort of influence no president wants to cede to a predecessor. She’s stuck with Bill, but she’s not married to Barack. Put him on the Supreme Court and he won’t be able to (overtly) meddle in party politics or constrain her presidential power.\nThere is something else that a President Hillary Clinton could do for Obama: Give his wife a job. Michelle Obama, like her husband, is on her way to becoming an unemployed empty-nester.\nMichelle Obama is as qualified for public office as Hillary Clinton was in 2000, when she first won a Senate seat from New York. For that matter, she is not less qualified than her husband when he won his Senate seat from Illinois 2006. A Clinton administration could clear the decks for a Senate run by Michelle, or offer her a senior cabinet post.\nIf Hillary loses in 2016, Obama will still have plenty of options. He could emulate Bill Clinton and start a multi-billion dollar charitable foundation, while supplementing his income with seven-figure speeches and a little help from his friends. He could follow Jimmy Carter’s example and turn his Presidential Library into a center for international policy (and meddling) on issues like climate change, free trade and rapprochement with the Muslim world.\nIt is a given (literally) that Obama will make a fortune with a memoir. That is a post-presidential prerogative. But unlike his predecessors, he is capable of more than a standard retrospective.\nObama is a man of letters. His first book, “Dreams from My Father,” attests to that. He may be a second-rate chief executive, but he is a first-rate writer.\nWriting isn’t retirement. Writing is work. But for the right person, it is rewarding work. Nobody invades an author’s privacy (especially if it is guarded by the Secret Service). Writers have time for family and friends, room for reading and reflection and creativity. Those who can command an audience can exert lasting influence. Certainly Barack Obama would command that kind of attention.\nI’m sure that President Obama is considering numerous scenarios and options. Once he leaves office, Barack Obama will still remain a formidable presence in American public life a man with the potential to exert a powerful influence on his party, his country and the world.\nZev Chafets is a Fox News contributor. His latest book is \" Remembering Who We Are: A Treasury of Conservative Commencement Addresses \" (Sentinel 2015).\n+ Follow FoxNewsOpinion on Facebook\nADVERTISEMENT\nTRENDING IN OPINION 1 Could Obama end up on the Supreme Court after he retires from the White House? 2 Professors: US flag symbolizes racism, should not be displayed on campus 3 Donald Trump: A Mexican-American's take on businessman's clownish presidential bid 4 UN report denies Israel's right of self-defense, advocates arrest of Israelis instead 5 Bobby Jindal and my home state of Louisiana See all Trends Opinion Newsletter Don't miss a minute of opinion. Sign up for our newsletter now\nYour subscription has been submitted. American Innovation More →\nWaffle House partners with crowdsourced shipping app Roadie Wearable technology may improve sleep, endurance and chronic pain How IBM's Watson supercomputer is battling cancer with advanced genomics Advertisement", "external_links": ["http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffxnopinion&width&layout=button_count&action=like&show_faces=true&share=false&height=21", "https://www.facebook.com/FoxNewsOpinion", "http://www.amazon.com/exec/obidos/ASIN/1591848180", "https://platform.twitter.com/widgets/follow_button.1389999802.html#_=1390944151618&id=twitter-widget-0&lang=en&screen_name=fxnopinion&show_count=false&show_screen_name=true&size=m"], "published": "2015-06-24T03:00:00.000+03:00", "crawled": "2015-06-25T02:11:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}