{"organizations": [], "uuid": "24ffab6da0a8d5bb1ec52781aeb1a21913220779", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3135492/images/o-RAINBOW-WHITE-HOUSE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/dc/index.xml", "section_title": "DC - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/30/obama-rainbow-white-house_n_7698194.html?utm_hp_ref=dc&ir=DC", "country": "US", "title": "Obama On Rainbow White House: 'That Was Pretty Cool'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama On Rainbow White House: 'That Was Pretty Cool'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T20:25:00.000+03:00", "replies_count": 0, "uuid": "24ffab6da0a8d5bb1ec52781aeb1a21913220779"}, "author": "Paige Lavender", "url": "http://www.huffingtonpost.com/2015/06/30/obama-rainbow-white-house_n_7698194.html?utm_hp_ref=dc&ir=DC", "ord_in_thread": 0, "title": "Obama On Rainbow White House: 'That Was Pretty Cool'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Politicians React To Gay Marriage Ruling of   All marriages, at their root, are about love. Today, the Supreme Court affirmed that simple proposition—supported by a majority of Americans and a majority of our states—by recognizing that men marrying men and women marrying women are guaranteed the same civil rights and equal protection under our Constitution afforded to Jill and me, and to anyone else. We couldn’t be prouder. Over the years—in their homes, on our staff, on the frontlines of war, and in houses of worship—Jill and I have befriended countless gay, lesbian, bisexual, and transgender Americans who share a love for their partners constrained only by social stigma and discriminatory laws. But today, their love is set free with the right to marry and the recognition of that marriage throughout the country. This day is for them, their children, and their families. And it is for generations of advocates—gay, lesbian, transgender, straight—who for decades fought a lonely and dangerous battle. People of absolute courage who risked their lives, jobs, and reputations to come forward in pursuit of the basic right recognized today, but at a time when neither the country nor the courts would protect or defend them. And this day is for history to remember as one where, as a nation, our laws finally recognize that all people should be treated with respect and dignity—and that all marriages, at their root, are defined by unconditional love. \"All human beings are created equal by God and thus deserve to be treated with love, dignity and respect. I am, however, disappointed that the Supreme Court disregarded the democratically-enacted will of millions of Americans by forcing states to redefine the institution of marriage. My views are based on my upbringing and my faith. I believe that marriage is a sacred vow between one man and one woman, and I believe Americans should be able to live and work according to their beliefs.\" \"Today is a victory that is truly decades in the making and ends long-standing discrimination against the LGBT community in the context of marriage. I applaud the Supreme Court's decision and thank the many citizens and advocates across the country who have dedicated so much of their time and energy to make this day possible. This decision affirms the core American value of equal justice under the law by giving every American full marriage equality.\" “By recognizing the constitutional right of all people to marry the person they love, the Supreme Court has guaranteed that, across the country, same-sex couples will have their relationships treated with the full legal dignity and respect that they deserve. With our country’s fundamental ideal that ‘all men are created equal’ in mind, I welcome the end of discriminatory bans that have, until today, denied same-sex couples the privileges, responsibilities, and joys of marriage. This is an important step on our continuing quest to create a more perfect union.” “Guided by my faith, I believe in traditional marriage. I believe the Supreme Court should have allowed the states to make this decision. I also believe that we should love our neighbor and respect others, including those making lifetime commitments. In a country as diverse as ours, good people who have opposing views should be able to live side by side. It is now crucial that as a country we protect religious freedom and the right of conscience and also not discriminate.” “Massachusetts played a pioneering role in bringing this issue into the national spotlight and I want to congratulate all of the activists in our home state who have been so committed to advancing this important cause. I join them in celebrating and taking pride in this historic decision. “In 2004, I rallied on the steps of the Massachusetts State House in support of same-sex marriage and I was proud when Massachusetts became the first state to recognize marriage equality. Today’s ruling validates once again the Commonwealth’s long history of sparking change.” \"The ruling is a huge victory for equality and our country. The Supreme Court has held what I have long argued and advocated - the Fourteenth Amendment's guarantees of due process and equal protection support marriage equality. I commend the Supreme Court for choosing inclusion rather than discrimination today. An immeasurable amount of time and effort has been dedicated over the years by groups and individuals committed to the basic fairness of marriage equality and proper recognition of its constitutionality. Today's ruling is a historic culmination of those efforts. The landmark decision reflects what the majority of people in our country believe - all Americans have the freedom to marry whom they love.\" “Love wins!” \"Today the Supreme Court put to rest a decades-long civil rights struggle for marriage equality. In its decision the Supreme Court affirmed what a majority of Americans believe, that marriage between two loving individuals, regardless of their sex, deserves full protection under the law as afforded under the 14th Amendment. History will remember this day as a watershed moment, a day when 'we the people' took another major step toward justice in our enormous and enduring struggle to form a more perfect union.\" \"Marriage is about love, respect and commitment, and today's Supreme Court decision making marriage equality the law of the land grants long overdue dignity and protection to same-sex couples. No longer will these couples have to navigate a confusing patchwork of laws that stand in the way of equal protection or the simple act of calling the one you love your husband or wife. Today is a day to look back upon as a time when we strengthened millions of families across the country as well as the institution of marriage itself.\" “I enthusiastically applaud the Supreme Court’s decision in the case of Obergefell v.Hodges. This decision, and what it means for the LGBT community, has been a long-time coming and is the result of decades of struggle and perseverance. “Now, same-sex couples throughout the country will be guaranteed the recognition and legal protections they so fully deserve. No longer will their families be viewed as lesser in the eyes of the law. “As has been said, ‘the arc of history is long and it bends in the direction of justice.’ Thank you to five Supreme Court heroes for helping bend it a little sooner.” \"Today’s ruling by the Supreme Court serves only as further encouragement to use the court system as a systematic springboard to enact agendas outside the democratic and legislative structures of government. Thirty States have held statewide ballots banning gay marriage since the year 2000, and yet legislating from the bench has superseded both public approval and our elected representatives. This is not only a sad day for marriage, but a further judicial destruction of our entire system of checks and balances.” “The issue of LGBT equality is very personal for me. I spent two decades as a supervisor and then mayor of San Francisco, when the city was at the forefront of bringing LGBT people out of the shadows. I watched firsthand as the community fought for legal recognition of their lives, relationships and personal dignity. I could not be more thrilled to share in their happiness on this historic day. “The American people have come to recognize that loving, committed couples should be able to marry, regardless of sexual orientation. The Supreme Court has now recognized this as well. The court acknowledged that depriving same-sex couples the basic dignity, stability and security of legal marriage is not right—and in fact it is unconstitutional.\" “Today’s ruling by the Supreme Court in Obergefell v. Hodges is an historic affirmation that the fundamental principles of justice, fairness and equality afforded to every American unequivocally apply to same-sex couples,” Edwards said. “Loving same-sex couples and their families deserve to be treated equally over the law, and now have the ability to take advantage of the full array of benefits afforded under the institution of marriage. “I am pleased that today’s ruling stands with Maryland law and ensures that legal marriage across America is available to all no matter who you love.” “Today the Supreme Court fulfilled the words engraved upon its building: ‘Equal justice under law.’ This decision is a victory for same-sex couples across our country as well as all those seeking to live in a nation where every citizen is afforded equal rights. For far too long our justice system has marginalized the gay community and I am very glad the Court has finally caught up to the American people.” \"The Supreme Court ruling today, guaranteeing an individual's right to marry who they love, regardless of sex, is an important step forward for our country and a victory for American families. \"Families wish their children a lifetime of love and happiness, and the government can no longer stand in their way by depriving citizens of the right to marry the loves of their lives. \"I joyfully welcome this affirmation that is long overdue. Equality, fairness, and most importantly, love won out today.\" “Today the Supreme Court ruled on the right side of history. In every state in our great union, officials will be required to issue the same marriage licenses to loving and committed same-sex couples that straight couples have always been entitled to receive. Every same-sex couple in America now knows that their government will recognize, protect and value their love and commitment. I cannot think of a better way of celebrating the conclusion of LGBT Pride Month than the sight of gay and lesbian couples publicly taking their vows and joining their straight peers in showing their love and commitment. Today’s decision has brought the Court one step closer to our founding ideal of a more perfect union.\" “This is a tremendous day for the LGBT community, their families, and their friends who have stood beside them,” said Senator Menendez. “The Supreme Court has ended one of the blatant forms of discrimination that keep loving families apart based solely on who they love and where they live. This decision brings us closer to our nation’s promise of equal rights for all, and this victory belongs to those who can now marry who they love across America.” He added: “However, today’s victory does not mean that the fight is over. Already we are seeing efforts to categorically deny LGBT individuals protections against unjust firings, unlawful evictions, or even refused service in restaurants. I will continue to work with the LGBT community and allies to put common sense protections in place to ensure that no person is discriminated against based upon who they are.” “The Supreme Court decision today conveniently and not surprisingly follows public opinion polls, and tramples on states’ rights that were once protected by the 10th Amendment of the Constitution. Marriage between a man and a woman was established by God, and no earthly court can alter that. This decision will pave the way for an all out assault against the religious freedom rights of Christians who disagree with this decision. This ruling must not be used as pretext by Washington to erode our right to religious liberty. “This is a great day for marriage equality and a historic day for civil rights in our country,” said Durbin. “The decision by the Supreme Court affirms that same-sex couples across the nation have the right to marry whom they love and to participate fully - with their families - in the rights and responsibilities of marriage. Another step in the march toward equal rights has been taken today.” “This is a historic day, reflecting what each of us knows in our hearts and within our communities, we are all equal and should be able to marry who we love.” As a result of today’s ruling, same-sex spouses are now eligible for full Social Security and veterans benefits in every state in the country.\" “With this momentous ruling from the Supreme Court we end a chapter of discrimination in our country’s history and start a new one that says all Americans have the right to pursue happiness by marrying the person they love. Today, we raise our voices for equality. We raise our voices for an end to all forms of discrimination. We raise our voices for justice. It’s about basic freedoms for our friends, neighbors and families. Any effort to deny equal protections under the law is unfair, discriminatory, and unconstitutional – and that is just plain wrong. I am so proud to represent the state that has become a model across the country and the world on LGBT inclusion and acceptance. “Today’s historic Supreme Court ruling is an historic moment to celebrate, but the fight for equality is not over. We have much more to do to ensure LGBT people have equal protections under all laws so that we will one day look to the history books to know that there ever was a time when society didn’t recognize LGBT rights as human rights.” “No American should face discrimination simply because of who they love, and today’s ruling by the Supreme Court affirms that every American has the right to marry the person they love and raise a family without fear that they will one day be torn apart because they are treated differently under the law. With this decision, thousands of Michigan same-sex couples will finally be afforded the same opportunity to marry as other Americans, including April DeBoer and Jayne Rowse of Michigan, who courageously took their case all the way to the United States Supreme Court. “I was proud to join my colleagues in signing an amicus curiae brief urging the Supreme Court to rule in favor of marriage equality. Every year, we move closer and closer to fulfilling the ideals our nation was founded on — equality, freedom, and justice. And although history will no doubt view today’s ruling as a watershed moment in the fight for equality, that fight is far from over. LGBT Americans across the country still face discrimination and lack many legal protections afforded to other Americans. Our Constitution guaranteed equal protection under the law, and I am committed to fighting for equal rights for all Americans so we can always say with confidence that our country is a place where all are created equal.” Along with millions of Americans, I am celebrating today’s landmark victory for marriage equality, and the generations of advocates and activists who fought to make it possible. From Stonewall to the Supreme Court, the courage and determination of the LGBT community has changed hearts and changed laws. This ruling is an affirmation of the commitment of couples across the country who love one another. It reflects the will of the vast and growing multitude of Americans who believe that LGBT couples deserve to be recognized under the law and treated equally in the eyes of society. And it represents our country at its best: inclusive, open, and striving towards true equality. “I believe that marriage, as the key to strong family life, is the most important institution in our society and should be between one man and one woman. People who disagree with the traditional definition of marriage have the right to change their state laws. That is the right of our people, not the right of the unelected judges or justices of the Supreme Court. This decision short-circuits the political process that has been underway on the state level for years. “While I disagree with this decision, we live in a republic and must abide by the law. As we look ahead, it must be a priority of the next president to nominate judges and justices committed to applying the Constitution as written and originally understood.\" “Today’s Supreme Court decision is a big win for gay rights, for civil rights, and for human rights. Every committed couple, whether they are gay or straight, deserves to be treated equally under the law. With this historic ruling, the Supreme Court has reaffirmed what most Americans already know – the Constitution protects the rights of every American, regardless of who they love.” “I am disappointed the Supreme Court today chose to change the centuries old definition of marriage as between one man and one woman. I’m a firm believer in traditional marriage, and I also believe the 10th Amendment leaves it to each state to decide this issue. I fundamentally disagree with the court rewriting the law and assaulting the 10th Amendment. Our founding fathers did not intend for the judicial branch to legislate from the bench, and as president, I would appoint strict Constitutional conservatives who will apply the law as written.” “Today is an historic day – for equal rights, for justice, and for individuals and couples across the country who can no longer be treated differently because of who they love,” said Heitkamp. “Many North Dakotans have been fearlessly pushing back on our state’s ban on marriage equality and fighting for fairness nationwide, and I’m beyond thrilled that because of today’s decision, they and so many other Americans can finally marry their loved ones – not just in some states, but in any state. Discrimination of any form is unjust, and now Congress needs to step up and finally pass legislation to make sure LGBT individuals can’t be discriminated against in the workplace, housing, schools, or anywhere else. I will always be someone who stands up for everyone in our state – as every North Dakotan deserves the same rights, deserves a voice, and deserves to be valued. Congratulations to the families across North Dakota and the country who today finally have those rights and that voice – it’s long overdue.” “For the first time, every American has the right to marry the person they love. This is a monumental step toward a more inclusive society, one that embraces all who wish to take on the rights and responsibilities of marriage. The blood, sweat, and tears of generations of gay Americans and their allies who never gave up the fight for equality will be remembered as same-sex couples take their long-awaited vows. All of us are created equal - and that includes our ability to love and our right to pursue happiness with the person of our choosing. Today's ruling finally affirms that truth for Americans in every one of our great United States.” “I have officiated the marriages of several same-sex couples, and I have seen the love in the eyes of those whose hands, and whose lives, I have joined,” said Cárdenas. “For the Federal government to have told those Americans that their love is lesser or, worse yet, illegal, has been an embarrassment to our nation and a violation of our founding principles. All people are created equal. All love is equally valuable. Today the Supreme Court confirmed what loving families have known in their hearts, Love Wins.” “Today, America has taken a big step forward. No longer will discriminatory state laws prevent same-sex couples from marrying the person they love. With this ruling, we come one step closer to fully recognizing the fundamental equality of all our fellow citizens. “Two years ago, my daughter and I rallied in front of the Supreme Court for marriage equality with many others. That year, the Court ruled in favor of same-sex couples, striking down the so-called Defense of Marriage Act (DOMA). Back in 1996 I was one of only 67 out of 435 Members of Congress to vote against DOMA. Today we can all share in this proud moment knowing that the Supreme Court has taken us full circle and landed on the right side of history. \"It's a proud day to be an American.\" “In today’s ruling, five judges overturned the sound public policy that was democratically enacted by millions of Americans in states across the country, including Ohio. This ruling follows what seems to be a recent trend on the Supreme Court: rulings based on the desires of the justices, and not the letter of the law and the framework of the Constitution. “I am also concerned that this ruling opens the door for discrimination against those who believe in traditional marriage, and I believe Congress must work to ensure that no American is forced to violate their beliefs on this important issue, to ensure that all Americans, regardless of their beliefs, can co-exist peacefully. That’s why I am co-sponsoring Senator Lee and Congressman Labrador’s First Amendment Defense Act, a bill that promotes tolerance for all Americans by preventing any federal agency from discriminating against any individual, association, or business based on their marriage views.” “It is a tragic and ominous day for the United States when a decision by five unelected justices of the U.S. Supreme Court blatantly violates the law in order to destroy the foundational building block for society provided by Nature and Nature’s God – that was stated as divine law by Moses and Jesus. Our nation has been blessed with liberty, opportunity, power, and individual prosperity beyond any other nation in history. Both Moses and Jesus stated that it was God’s law that ‘a man will leave his father and mother and a woman will leave her home and the two will come together as one.’ That defined marriage. Jesus even added that the defined marriage that God brought together should not be divided by anyone. The Supreme Court ruling is heartbreaking for the turmoil it will mean for our nation’s future.\" “This week's Supreme Court rulings represent a dangerous display of judicial activism, with the majority of the court's justices clearly creating new law where it does not exist in statute or the Constitution. These rulings on Obamacare and marriage further underscore how important it is to properly vet and appoint Supreme Court justices who will strictly interpret the Constitution and laws rather than use their exclusive perches to write their own personal versions of what that historic document establishes. “Justice Scalia's scathing criticism of the Supreme Court's majority in these two shocking rulings accurately sums up the breach between the separation of powers, as unelected judges took it upon themselves to rewrite the laws to their own personal liking.” “Today, the Supreme Court of the United States has recognized the equality, dignity and essential humanity of our gay and lesbian brothers and sisters and reaffirmed this country’s bedrock principle – engraved over the entrance to the Court itself – that all Americans are entitled to equal justice under law. By putting an end to an era of state-sanctioned discrimination, the decision lights the way to a future of acceptance, inclusion and opportunity for gay and lesbian Americans and their families. It encapsulates a nation’s enormous leap of understanding – rooted in compassion, tolerance and empathy – and reflects the countless hearts touched and minds opened along the way. It vindicates an idea whose time has come at last. Victory! In a 5-4 decision in Obergefell v. Hodges, the Supreme Court recognized marriage for same-sex couples in every state across America. This is a landmark victory for marriage equality and a ruling in favor of justice, just in time for the 46th anniversary of the Stonewall Riots and the culmination of Pride Mo‌nth. To‌day's Supreme Court decision brings us one step closer to fulfilling the sacred principle that binds our nation: All people are created equal. “America is a nation of laws, and we must respect and abide by the Supreme Court’s decision.”  Share", "external_links": [], "published": "2015-06-30T20:25:00.000+03:00", "crawled": "2015-06-30T21:27:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}