{"organizations": [], "uuid": "a1c2d81137bd7d6f7d61d22006df20791792c07c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_060715getty.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/senate/245930-obama-poised-for-huge-win-on-trade", "country": "US", "title": "Obama poised for huge win on trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama poised for huge win on trade", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T03:54:00.000+03:00", "replies_count": 0, "uuid": "a1c2d81137bd7d6f7d61d22006df20791792c07c"}, "author": "Mike Lillis and Alexander Bolton", "url": "http://thehill.com/homenews/senate/245930-obama-poised-for-huge-win-on-trade", "ord_in_thread": 0, "title": "Obama poised for huge win on trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama poised for huge win on trade By Mike Lillis and Alexander Bolton - 06/23/15 08:54 PM EDT \nPresident Obama is poised for one of the biggest victories of his second term after the Senate voted Tuesday to advance legislation enhancing his trade powers. \nThe Senate’s 60-37 vote sets the stage for passage on Wednesday of the trade-promotion authority (TPA) bill, or fast-track, which House GOP leaders ushered through the lower chamber last week. If the Senate approves the measure, as expected, it heads to the White House for Obama’s signature. ADVERTISEMENT After the vote, liberal trade opponents on and off Capitol Hill acknowledged fast-track is all but certain to become law, throwing in the towel after a months-long legislative brawl that saw Obama siding with GOP leaders against his own Democratic base.\nThe opponents are instead moving the battle lines back in preparation to fight an emerging Pacific trade deal the fast-track power is designed to foster. \nAs part of the strategic switch, Democrats in both chambers are lining up to vote in favor of a worker aid bill — known as Trade Adjustment Assistance (TAA) — which House liberals killed earlier this month as a means to block fast-track. \nPublic Citizen, among the most vocal opponents of Obama’s trade agenda, also indicated Tuesday that it will reserve its firepower for the coming fight over the Trans-Pacific Partnership (TPP), an accord with Japan and 10 other nations that could affect as much as 40 percent of the global economy. \nObama had said he would not sign a fast-track bill without assurances that there is a strategy for getting TAA to his desk as well. \nThat stipulation left open the question of whether liberal fast-track opponents would repeat their earlier effort to sink TAA, a program long-championed by Democrats, in a bid to stall TPA once more. But even the staunchest Democratic critics said Tuesday that there’s no such plan in the works. \n“I don’t think too many members want to go home having taken care of corporate interests with TPA and then falling short on taking care of workers,” said Sen. Sherrod Brown (D-Ohio), who led the Democratic opposition to fast-track in the Senate. \nHe said he would vote for TAA but that pro-union Democrats will make their next stand against the TPP. Brown and other Democrats acknowledged, however, that it will be tougher to fight the multilateral pact because of Obama’s fast-track authority. \nThe TPA bill would grant Congress an up-or-down vote on Obama’s trade deals but prohibit amendments or a filibuster in the Senate. The administration has portrayed the extra authority as a necessary step in the president’s bid to finalize the TPP, which has emerged as the top economic priority of his second term. \nWhite House spokesman Josh Earnest on Tuesday declined to say if Obama would sign the fast-track bill before the worker aid measure reached his desk, but he did not rule out that possibility. \n“The president has made clear both of them are a priority,” Earnest told reporters. “I don’t have a time frame to lay out for you right now in terms of when the president will sign one bill or the other.” \nSuch vague comments have made Democratic critics of TPA even more wary of the president’s approach. Asked if there’s a fear among Democrats that Obama would sign TPA even without concrete assurances that TAA would follow, one House Democratic aide minced no words. \n“Not a fear, a belief,” said the aide, whose boss opposes fast-track. “His whole sentiment the entire time has been ‘trust us.’ But we know what he’s saying doesn’t jibe with reality. So, no, there’s not much trust.” \nTuesday’s Senate vote is a huge win for Obama and his unlikely ally, Senate Majority Leader Mitch McConnell (R-Ky.), who has been better known as the president’s persistent foil over the past six and a half years. \nObama’s second term has been largely devoid of legislative accomplishment after immigration reform and gun control legislation faltered in the last Congress. \nMcConnell predicted earlier this year that trade legislation would be the biggest legislative achievement of the new Senate GOP majority, bolstering his argument to voters that Republicans know how to govern. \n“We have demonstrated we can work together on a bipartisan basis to achieve something that is extremely important for America,” McConnell said after the vote. \nThirteen Democrats joined 47 Republicans in supporting the measure, while only six Republicans voted no. \nSen. Ted Cruz (R-Texas), a 2016 presidential contender, surprised GOP leaders by announcing his last-minute opposition. The move left fellow Republicans scratching their heads because Cruz, along with House Ways and Means Committee Chairman Paul Ryan (R-Wis.), had penned a Wall Street Journal op-ed in April expressing support for fast-track. \nSenate aides speculated it was an effort to persuade other Republicans to join him and hand the GOP establishment an embarrassing loss. \nMcConnell, meanwhile, is aiming to pass the worker aid bill later in the week as an attachment to an African trade bill. \nIn the House, Speaker John Boehner (R-Ohio) is also vowing to move the remaining pieces of the trade package through the lower chamber and to Obama before week’s end. \n“Our goal is to get TPA and TAA to the president’s desk this week and deliver this win for the American people,” he said Tuesday in a statement. \nThat would be a victory for Boehner and Ryan, who has led the GOP effort in the House. \nThey don’t have much time. GOP leaders have canceled Friday’s scheduled votes to allow lawmakers to attend funerals in Charleston, S.C., in the wake of last week’s fatal shooting at a historic black church in the city. Tags:", "external_links": [], "published": "2015-06-24T03:54:00.000+03:00", "crawled": "2015-06-24T05:31:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}