{"organizations": ["Cari Nierenberg Facebook", "Fox News Teens", "Twitter"], "uuid": "24fbd8e106da649de0a5fa9e084c1ddacac64ec3", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/smoking%20marijuana.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/health/2015/06/24/teens-are-less-familiar-with-marijuana-e-cigarette-health-risks/", "country": "", "title": "Teens are less familiar with marijuana, e-cigarette health risks | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Teens are less familiar with marijuana, e-cigarette health risks | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "24fbd8e106da649de0a5fa9e084c1ddacac64ec3"}, "author": "", "url": "http://www.foxnews.com/health/2015/06/24/teens-are-less-familiar-with-marijuana-e-cigarette-health-risks/", "ord_in_thread": 0, "title": "Teens are less familiar with marijuana, e-cigarette health risks | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Teens are less familiar with marijuana, e-cigarette health risks By Cari Nierenberg Facebook 0 Twitter 0 Email Print (Getty) \nTeenagers think that smoking marijuana and e-cigarettes is much less harmful than smoking cigarettes, a new study suggests. \nResearchers found that although teens are familiar with the negative effects of smoking cigarettes, they know little about the health risks of using marijuana and e-cigarettes , and even describe some benefits they think are related to these products. \n\"The main implication of these findings is that teens are receiving the health messages about smoking cigarettes , but they are not hearing much information about the risks of these other products, so they may perceive them as being OK,\" said Bonnie Halpern-Felsher, co-author of the study and a professor of pediatrics and adolescent medicine at Stanford University School of Medicine in Stanford, California. \nIn this small study, published online today (June 23) in the Journal of Adolescent Health, the researchers held small group discussions with 24 teens from a northern California school district with high rates of substance use. \nDuring these discussions, the teens were asked to describe the risks and benefits of using conventional cigarettes, marijuana and e-cigarettes, as well as how, where and from whom they learned information about these products. The researchers recorded the teens' comments in transcripts and then analyzed them to find the recurring themes. \nThe study found that young people were well aware of the negative health consequences of smoking conventional cigarettes, including having yellow teeth, bad breath and a greater risk of dying of cancer. [ Kick the Habit: 10 Scientific Quit-Smoking Tips ] \nHigh school students also perceived tobacco as having more health risks and addictive qualities than marijuana, although the teens also said they felt strong peer pressure to smoke pot, according to the study. \nHalpern-Felsher said teens need to understand that smoking marijuana impacts the developing adolescent brain just like nicotine does, and its effects on the heart and lungs are similar to smoking conventional cigarettes. \nThe attitudes of these California teens reflect the trends seen in other studies, which have also found that rates of tobacco use among American high school students are leveling off or declining, while rates of marijuana and e-cigarette use are rising . \nTeenage misperceptions \nYoung people in the study had trouble naming any benefits of smoking cigarettes, but they described several benefits of using marijuana, including getting high, relieving stress and easing pain. \nThe findings also showed that kids were unsure of the health risks of e-cigarettes because they were a newer product, but they considered the devices \"classy,\" and thought they might not be as bad as regular cigarettes, the researchers wrote in their study. \n\"The teens uniformly perceived cigarette use as bad and had heard little about e-cigarettes,\" Halpern-Felsher said. But if adolescents had heard anything about e-cigarettes, it was very positive and usually came from family members who had tried e-cigs in an effort to quit smoking conventional cigarettes, she added. \nThere are several possible reasons why teens may view the risks of smoking cigarettes differently than using marijuana or e-cigarettes. One reason involves advertising — although the tobacco industry can't advertise on TV, in some print media or in any youth venue, similar restrictions don't apply to e-cigarettes, Halpern-Felsher told Live Science. \nYoung people are seeing e-cigarettes in cool colors and cool flavors. They are also seeing celebrities use them, and that gives these products more exposure and makes them appealing, she said. \nEducation about harms \nA second reason for teens' misperceptions is the lack of standardized educational material in high schools covering the risks of e-cigarette and marijuana use, Halpern-Felsher said. And she said a third reason is the changing policies on marijuana: The legalization of the drug for medicinal or recreational use in some states may be contributing to young people's confusion about its health risks. \nTeens need to realize that e-cigarettes are not harmless, but rather contain hundreds of chemicals that can be absorbed into the body, Halpern-Felsher said. She also said that although e-cigarettes contain lower levels of nicotine than regular cigarettes, their nicotine levels can harm an adolescent's developing brain or, if they are used during pregnancy, pose risks to a developing fetus. \nMoreover, the chemicals used to create their youth-friendly flavors can be dangerous to the heart and lungs when inhaled, she said. ", "external_links": [], "published": "2015-06-24T03:00:00.000+03:00", "crawled": "2015-06-24T15:52:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}