{"organizations": [], "uuid": "ddae9e70d6afaefab945cd8e031defade42c68c0", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3042838/images/o-OBAMA-KRUEN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/06/08/obama-cumbre-g7_n_7534228.html", "country": "", "title": "Obama en la cumbre del G7: ¿Y ahora con quién?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama en la cumbre del G7: ¿Y ahora con quién?", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T20:09:00.000+03:00", "replies_count": 0, "uuid": "ddae9e70d6afaefab945cd8e031defade42c68c0"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/06/08/obama-cumbre-g7_n_7534228.html", "ord_in_thread": 0, "title": "Obama en la cumbre del G7: ¿Y ahora con quién?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "reddit Pool via Getty Images \nEl carisma de Obama es innegable. La 'coquetería' o amabilidad también, especialmente cuando es captada en cámara y da motivos para interpretaciones si la imagen se saca de contexto. \nEste fin de semana, el presidente Obama asistió a un concierto previo al inicio de la cumbre de los países que conforman el G7 y se le vio conversando muy animadamente con el primer ministro de Canadá , Stephen Harper, y también con su esposa Laureen Harper, en la localidad de Kruen, Alemania. \nA juzgar por las fotos, la Sra. Harper parecía ser la que más disfrutaba la charla. Obama se acercaba a la primera dama y a su esposo rompiendo cualquier protocolo de este tipo de eventos. \nFotos similares a esta han provocado reacciones en las redes sociales. Recordemos cuando en el funeral de Nelson Mandela, el presidente Obama conversaba, reía y hasta se tomó una 'selfie' con la primera ministra de Dinamarca, Helle Thorning-Schmidt. \nLos países que conforman el grupo del G7 son Alemania, Canadá, Estados Unidos, Francia, Italia, Japón y Reino Unido. La cumbre del G7 se celebra en la localidad alemana de Elmau. \nEste domingo a Obama se le vio disfrutar de la cerveza tradicional de la región de Kruen durante un desayuno al estilo bávaro. \nEste lunes, Obama se reunió con varios de sus aliados en encuentros paralelos a la cumbre internacional del G7 para abordar los urgentes problemas en Medio Oriente, mientras trataba de convencer a los gobernantes europeos de que mantengan las sanciones contra Rusia tras las nuevas hostilidades en Ucrania, informó AP. También en HuffPost Voces ", "external_links": [], "published": "2015-06-08T20:09:00.000+03:00", "crawled": "2015-06-08T22:27:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}