{"organizations": ["European Union Commission"], "uuid": "b478e2e20fe86458087324d23e52b4c92e7b7c15", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/08/politics/barack-obama-angela-merkel-photo-germany-mountains/index.html", "country": "", "title": "Barack Obama, Angela Merkel enjoy view in Germany - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Barack Obama, Angela Merkel enjoy view in Germany - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "b478e2e20fe86458087324d23e52b4c92e7b7c15"}, "author": "", "url": "http://www.cnn.com/2015/06/08/politics/barack-obama-angela-merkel-photo-germany-mountains/index.html", "ord_in_thread": 0, "title": "Barack Obama, Angela Merkel enjoy view in Germany - CNNPolitics.com", "locations": ["Garmisch-Partenkirchen", "US", "Kruen", "U.S.", "Munich", "Ukraine", "Krun", "Bavaria", "Austria", "Elmau Castle", "Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Cameron", "Matteo Renzi", "Shinzo Abe", "Barack Obama", "Renzi", "Francois Hollande", "Jean-Claude Juncker", "Donald Tusk", "Merkel", "Stephen Harper", "Angela Merkel", "Ellen Johnson Sirleaf", "Obama"], "text": "World leaders meet in Germany for G7 Summit 02:33 Telfs-Buchen, Austria (CNN) The topics on the agenda might be serious, but even President Barack Obama found a moment to be distracted by the alpine views at this week's G7 meeting in Germany. Obama, Merkel: Best friends in Bavaria 8 photos Obama, Merkel: Best friends in Bavaria 8 photos U.S. President Barack Obama and German Chancellor Angela Merkel stroll outside at the summit of the Group of Seven nations at the Schloss Elmau resort on Sunday, June 7, near Garmisch-Partenkirchen, Germany. Hide Caption Obama, Merkel: Best friends in Bavaria 8 photos Obama and Merkel attend a concert on June 7. Hide Caption 2 of 8 Obama, Merkel: Best friends in Bavaria 8 photos Obama enjoys a beer with Merkel, right, at the summit of G7 nations on June 7 in Kruen, Germany. Hide Caption Obama, Merkel: Best friends in Bavaria 8 photos Obama and Merkel greet each other at a bilateral meeting on June 7. Hide Caption 4 of 8 Obama, Merkel: Best friends in Bavaria 8 photos Merkel and Obama chat while posing for a group photo on Monday, June 8, the second day of the summit of G7 nations. Hide Caption 5 of 8 Obama, Merkel: Best friends in Bavaria 8 photos From left: European Council President Donald Tusk, Japanese Prime Minister Shinzo Abe, Canadian Prime Minister Stephen Harper, Obama, Merkel, French President Francois Hollande, British Prime Minister David Cameron, Italian Prime Minister Matteo Renzi and European Union Commission President Jean-Claude Juncker pose for a photo at Elmau Castle near Garmisch-Partenkirchen, southern Germany, on June 7. Hide Caption 6 of 8 Obama, Merkel: Best friends in Bavaria 8 photos Obama and Merkel walk on their way to their first working session at Elmau Castle on June 7. Hide Caption 7 of 8 Obama, Merkel: Best friends in Bavaria 8 photos On the bench, from left: Liberian President Ellen Johnson Sirleaf, Merkel, Obama and Renzi sit on a bench outside Elmau Castle on June 8. Hide Caption 8 of 8 EXPAND GALLERY A photo captured Monday shows the president stretching out on a wooden bench, chatting with German Chancellor Angela Merkel with the jagged Bavarian Alps rising in the distance. Obama is closer to Merkel than almost any other world leader, and on Sunday praised her leadership on issues like climate change and the crisis in Ukraine. She, in turn, gave Obama a tour on the traditional village Krun, high in the mountains above Munich. Germany's Chancellor Angela Merkel (C) gestures while chatting with US President Barack Obama sitting on a bench outside the Elmau Castle after a so-called outreach meeting at a G7 summit near Garmisch-Partenkirchen, southern Germany, on June 8, 2015. The pair snacked on pretzels and drank tall glasses of beer -- which a local official later revealed was non-alcoholic. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-06-08T03:00:00.000+03:00", "crawled": "2015-06-09T02:04:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}