{"organizations": [], "uuid": "a4f658e005e2c523d7bf80df84013b0cb2b6b103", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamahollande_060815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/national-security/245972-obama-does-damage-control-with-french-after-nsa-leaks", "country": "US", "title": "Obama does damage control with France over NSA spying", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama does damage control with France over NSA spying", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T19:12:00.000+03:00", "replies_count": 0, "uuid": "a4f658e005e2c523d7bf80df84013b0cb2b6b103"}, "author": "jhattem@thehill.com (Julian Hattem)", "url": "http://thehill.com/policy/national-security/245972-obama-does-damage-control-with-french-after-nsa-leaks", "ord_in_thread": 0, "title": "Obama does damage control with France over NSA spying", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama does damage control with France over NSA spying Getty Images By Julian Hattem - 06/24/15 12:12 PM EDT \nPresident Obama spoke with French President François Hollande on Wednesday to stem the damage from new revelations that the U.S. had spied on his and other leaders’ personal communications for years. \nObama reiterated his “unequivocal commitment” to halt American spying on friendly foreign leaders, which Hollande’s office called “unacceptable among allies,” the Élysée Palace said in a statement . \n“The President affirmed our unwavering commitment to the bilateral relationship, including our ongoing close cooperation in the intelligence and security fields,” the White House added. ADVERTISEMENT The tense phone call came a day after National Security Agency documents released by WikiLeaks showed American agents had nabbed Hollande’s communications as well as those of former Presidents Nicolas Sarkozy and Jacques Chirac from at least 2006 to 2012.\nHollande's office expressed outrage about the news earlier in the day, and he called Obama in the afternoon to express his sentiments. \n“The exchange was an occasion to focus on the principles that should govern relations between allies on intelligence matters,” Hollande’s office said in the statement. \nAccording to the WikiLeaks documents, NSA officials had picked up personal communications of the three French presidents, covering subjects as sensitive as plans for Middle East peace, discussions about Greek debt troubles and the global financial crisis. \nWhile experts have long said that major intelligence services routinely spy on their allies and enemies alike — including top foreign leaders — leaks about the NSA’s activities have caused a series of headaches for the Obama administration over the last two years. \nLast year, after similar disclosures about the NSA snooping on German Chancellor Angela Merkel, Obama announced that the U.S. would no longer target friendly foreign leaders to intercept their communications. \nThe Obama administration has “abided by” that and other similar pledges, Obama told Hollande on Wednesday. \nThe newly released documents date from before that announcement, however. \nOn Tuesday, National Security Council spokesman Ned Price said American officials “are not targeting and will not target the communications of President Hollande.” \nHowever, the statement does not rebut the NSA documents or deny that the U.S. ever targeted Hollande’s communications in the past. \n--This report was updated at 12:57 p.m. Tags:", "external_links": [], "published": "2015-06-24T19:12:00.000+03:00", "crawled": "2015-06-24T22:36:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}