{"organizations": ["Obama Admin Builds Economic Case For Action On Climate Change", "Georgetown University", "AP"], "uuid": "3089f02f2a9df2bb5dda4a5df0cf33d8d6f255be", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3103126/images/o-OBAMA-CLIMATE-CHANGE-GEORGETOWN-facebook.jpg", "site_section": "http://news.yahoo.com/rss/weather", "section_title": "Weather News Headlines - Yahoo! News", "url": "http://www.huffingtonpost.com/2015/06/22/obama-climate-change_n_7638226.html?ncid=txtlnkusaolp00000592", "country": "GB", "title": "Obama Admin Builds Economic Case For Action On Climate Change, As House Preps To Block It", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Admin Builds Economic Case For Action On Climate Change, As House Preps To Block It", "spam_score": 0.0, "site_type": "news", "published": "2015-06-22T22:08:00.000+03:00", "replies_count": 0, "uuid": "3089f02f2a9df2bb5dda4a5df0cf33d8d6f255be"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/22/obama-climate-change_n_7638226.html?ncid=txtlnkusaolp00000592", "ord_in_thread": 0, "title": "Obama Admin Builds Economic Case For Action On Climate Change, As House Preps To Block It", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama"], "text": "Obama Admin Builds Economic Case For Action On Climate Change, As House Preps To Block It Posted: Updated: 15 minutes ago President Barack Obama wipes perspiration from his face as he speaks about climate change at Georgetown University in Washington on June 25, 2013. The administration is marking the two-year anniversary of the speech with renewed focus on climate action. (AP Photo/Charles Dharapak) | ASSOCIATED PRESS reddit \nWASHINGTON -- The Obama administration is making another big push on climate change this week, marking the two-year anniversary of the release of the president's Climate Action Plan . \nThe Environmental Protection Agency kicked off the week with the release of a new report outlining the health and economic benefits of acting to curb greenhouse gas emissions, which have been found to drive climate change. Meanwhile, the House of Representatives is preparing to vote on legislation to set back the administration's climate agenda. \n\"Climate change is happening now, and Americans are already feeling the impacts. But we do have a choice on how we move forward and what we want our future to look like,\" said EPA Administrator Gina McCarthy in a meeting with reporters Monday morning. \"The report shows it's not too late to avoid the worst impacts of climate, which is a hopeful sign.\" \nThe report tallies costs that will be avoided if climate change is addressed, projecting the potential savings through 2100. Those include $110 billion in avoided costs from lost labor due to extreme temperatures and 57,000 avoided deaths due to poor air quality. It also projects up to $7.4 billion in avoided costs for road maintenance and repairs, between 6 and 7.9 million fewer acres of land lost to wildfires, and $3.1 billion in avoided costs from rising sea levels and coastal storm surges. \nThe analysis covers 20 different sectors in the United States, including public health, infrastructure, agriculture and water resources. It compares the potential costs in each sector if no action is taken on climate change to the savings if world leaders make emissions cuts that would keep global temperatures from rising more than 2 degrees Celsius (3.6 degrees Fahrenheit) -- a target that global leaders reiterated their support for in the recent G7 meeting . \nBrian Deese, a senior adviser to President Barack Obama, said the analysis \"undergirds the president's argument that we have not only a moral obligation to act, but we also have an economic opportunity.\" \nWhether the proposed 2-degree limit on warming is even still attainable at this point, given the proposed emissions cuts countries have put on the table so far, remains in doubt . \nDeese argued that the U.S. emissions commitments and projections like those contained in Monday's analysis are building the case to make more aggressive global cuts. \"I think you're continuing to see a clear commitment to taking the kind of long-term actions that will be necessary to get to the place where science tells us we need to get,\" he said. \"I think there's an acknowledgment of where we need to get and a commitment to get there.\" \nThe administration is using the EPA report, and the approaching anniversary of Obama's June 25, 2013 address on climate change, to tout its ongoing efforts. Those include a commitment in international climate negotiations to cut total U.S. emissions 26 to 28 percent by 2025. The administration has laid out a suite of new regulations to reach that target, including final rules for both new and existing power plants, which the EPA is expected to release in the next few weeks. The agency is also moving toward regulating emissions from commercial aircraft , and last week proposed emission standards for heavy trucks . \nThe White House is also hosting a summit on public health and climate change on Tuesday. \nThe House of Representatives is planning to vote this week on two pieces of legislation that would undermine the administration's regulations on power plant emissions. One bill would allow states to opt out of compliance with the standards, and a second is a funding bill that contains specific language blocking the EPA from enforcing its power plant rules. More:", "external_links": [], "published": "2015-06-22T22:08:00.000+03:00", "crawled": "2015-06-22T22:27:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}