{"organizations": [], "uuid": "cd29f6b5154d8a0c4df887e941353dc4508bd0a9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/30/obama-brazil-leader-seek-to-move-past-spying-tensions/", "country": "US", "title": "Obama, Brazil's leader seek to move past spying tensions", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama, Brazil's leader seek to move past spying tensions | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "cd29f6b5154d8a0c4df887e941353dc4508bd0a9"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/06/30/obama-brazil-leader-seek-to-move-past-spying-tensions/", "ord_in_thread": 0, "title": "Obama, Brazil's leader seek to move past spying tensions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print President Barack Obama and visiting Brazilian President Dilma Rousseff sought Tuesday to cast their nations as \"natural partners\" collaborating closely on critical issues like climate and regional diplomacy.\nThe pair glossed over recent tensions over spying that have strained relations between the U.S. and Brazil. And at a joint White House news conference, Obama praised Brazil as a global power whose relationship with the U.S. is a cornerstone of American relations throughout Latin America.\nThe president called Brazil an \"absolutely indispensable partner\" in efforts to promote security and U.S. interests around the world.\n\"I trust her completely,\" Obama said of his counterpart. \"No country is going to have identical interests. There will always be some frictions.\"\nRousseff, speaking through a translator, said the relationship was on an \"upward trajectory\" and described her talks with Obama this week as fruitful. She acknowledged she had canceled a previous trip to Washington in direct response to the spying allegations, but said things since then had changed.\n\"The change is partially due to the fact that President Obama and the U.S. government have stated on several occasions that they would no longer engage in intrusive acts of spying on friendly countries,\" said Rousseff. She said Obama had told her if he needs information about Brazil that isn't publicly available, he'll simply pick up the phone and call her.\n\"I believe President Obama,\" she added.\nNot so long ago, the Brazilian leader was outraged when documents released by National Security Agency leaker Edward Snowden showed the U.S. had been monitoring her communications. Leaked documents also suggested that the NSA targeted Brazil's state-run oil company, Petrobras.\nObama, Vice President Joe Biden and other top officials have spent the last two years attempting to repair the damage to the relationship inflicted by those revelations. In the East Room of the White House on Tuesday, Obama and Rousseff were all smiles, trading jokes and bets about the 2016 Summer Olympics, to be held in Rio de Janeiro.\nIn tandem with Rousseff's visit, Brazil pledged Tuesday to curb illegal deforestation and expand renewable energy use, as the United States and Brazil worked to build momentum toward a budding global climate treaty.\nBrazil's announcement stopped short of a commitment to bring deforestation down to zero, as many environmentalists had advocated. Still, the pledge offered some of the first signs of how Brazil intends to curb its emissions as part of the treaty. The vast majority of Brazil's greenhouse gas emissions come from destruction in the Amazon rainforest.\nAs part of its plan, Brazil is vowing by 2030 to restore and reforest 12 million hectares -- an area roughly the size of Pennsylvania. The government is also pledging to \"pursue policies aimed at eliminating illegal deforestation.\" Brazilian law allows landowners to legally cut 20 percent of trees in land, with some limitations.\n\"Climate change one of the central challenges of the 21st century,\" Rousseff said.\nBrazil also plans to expand renewable sources other than hydropower to between 28 percent and 33 percent of its total energy mix by 2030. And in the electricity sector, the U.S. and Brazil jointly announced intentions to increase their share of renewable, non-hydropower sources to 20 percent by 2030.\nThat will require tripling the amount of renewable energy on the U.S. electricity grid, while doubling it in Brazil, the White House said. Brian Deese, a senior adviser to Obama, said the U.S. would meet that goal by relying on controversial power plant emission limits that Obama has proposed.\nThe climate announcement came on the second day of Rousseff's visit to Washington. She met with Obama in the Oval Office earlier Tuesday morning and planned to close her visit with lunch with Vice President Joe Biden at the State Department.\n    3 Don’t remember the Alamo? Texas wants to change that 4   5 FBI setting up command centers to monitor terrorist threats over July 4 weekend  ", "external_links": [], "published": "2015-06-30T03:00:00.000+03:00", "crawled": "2015-06-30T23:49:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}