{"organizations": [], "uuid": "75a8e70815e61aa65edc82b1aeda80c92559221d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/overnights/244475-overnight-energy-court-tosses-challenge-to-obamas", "country": "US", "title": "OVERNIGHT ENERGY: Court tosses challenge to Obama climate rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT ENERGY: Court tosses challenge to Obama climate rule", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T01:10:00.000+03:00", "replies_count": 0, "uuid": "75a8e70815e61aa65edc82b1aeda80c92559221d"}, "author": "Timothy Cama and Devin Henry", "url": "http://thehill.com/policy/energy-environment/overnights/244475-overnight-energy-court-tosses-challenge-to-obamas", "ord_in_thread": 0, "title": "OVERNIGHT ENERGY: Court tosses challenge to Obama climate rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT ENERGY: Court tosses challenge to Obama climate rule By Timothy Cama and Devin Henry - 06/09/15 06:10 PM EDT \nTOO SOON: A federal appeals court ruled Tuesday that a group of energy companies and states acted too soon in trying to challenge the Obama administration’s proposed climate rule for power plants. \nAs was expected, the Court of Appeals for the District of Columbia Circuit said that it cannot review regulations before they’re made final, as the Environmental Protection Agency (EPA) plans to do this summer. \n\"They want us to do something that they candidly acknowledge we have never done before: review the legality of a proposed rule,” Judge Brett Kavanaugh wrote for the majority. ADVERTISEMENT “But a proposed rule is just a proposal,” he continued, writing that the judges do “not have authority to review proposed agency rules.”\nJudge Karen Henderson wrote a concurring opinion, saying that the court could review the proposal, but it is not appropriate in this case. \nMurray Energy Corp., which led the energy companies’ challenge, promised to file suit again when the rule is made final. \nWest Virginia’s attorney general did not make such a promise, though he pledged to keep protecting his state from the rule. \nThe court did not touch the issue of the merits of the challenges, instead focusing only on the threshold issue of timing. \nRead more here . \nGOP LOOKS TO STYMIE EPA: House Republicans are looking to use an appropriations bill to strip the EPA of much of its rulemaking authority. \nRepublicans on the Appropriations Committee released their 2016 funding bill for the Interior Department and EPA on Tuesday, which includes provisions blocking the EPA’s ability to issue rules like the climate rule for power plants, its redefinition of waters the agency can regulate and others. The budget would cut agency funding by 9 percent and cap staffing levels. \n\"The bill takes meaningful steps to shield our economy and defend American jobs from the executive overreach of EPA regulators,\" Interior Subcommittee Chairman Ken Calvert (R-Calif.) said in a statement. \nThe provisions and the cut are similar to those included in GOP spending bills from years past. \nPresident Obama has proposed a $500 million increase to EPA funding. \nRead more here . \nON TAP WEDNESDAY I: The Senate Environment and Public Works Committee will vote Wednesday on Sen. John Barrasso’s (R-Wyo.) Federal Water Quality Protection Act. The bill would undo the EPA’s rule defining the waterways it can regulate and give regulators instructions on how to rewrite it. \nON TAP WEDNESDAY II: The Appropriations Committee’s subcommittee on the EPA and Interior Department will mark up its 2016 spending bill. \nRest of Wednesday’s agenda ... \nThe White House Council on Environmental Quality (CEQ) will host its 2015 GreenGov symposium on Wednesday. EPA Administrator Gina McCarthy will give the afternoon keynote. CEQ Managing Director Christy Goldfuss will also give a speech, as will Navy Secretary Ray Mabus. \nSens. Sheldon Whitehouse (D-R.I.) and Brian Schatz (D-Hawaii) will present their legislation to impose a tax on carbon dioxide emissions Wednesday at an American Enterprise Institute event on carbon taxes. \nA subcommittee of the Senate Energy and Natural Resources Committee will meet Wednesday to discuss 10 bills on national parks. \nThe House Natural Resources Committee will meet Wednesday to vote on seven bills on energy infrastructure, national forests, public land and other topics. \nThe Progressive Policy Institute will host an event Wednesday on the future of the electric grid. Sen. Martin Heinrich (D-N.M.) will give the keynote address. \nThe Chemical Safety Board will meet Wednesday to gather input on the agency’s direction amid the resignation of its last chairman, Rafael Moure-Eraso. \nNEWS BITE: The Energy Department official credited with turning around its loan program is leaving the agency after more than two years. \nPeter Davidson started as executive director of the Loan Programs Office in May 2013 as the program was recovering from the high-profile controversies over companies like Solyndra Corp. and Fisker Automotive Inc., which had received support from the program. \n“Under Peter’s leadership, LPO restarted its loan activities and many of the projects in its more than $30 billion portfolio began operation and commenced loan repayment and LPO is now recognized as a leader in the financing of clean energy,” Energy Secretary Ernest Moniz told agency employees Tuesday. \n“Through proactive portfolio management, 22 projects supported by LPO are now operational and generating revenue,” he said. \nMark McCall, chief financial officer of private equity firm Lime Rock Partners, will become the new executive director of the office in July, Moniz said. \nAROUND THE WEB: \nSpanish oil giant Repsol Tuesday signed onto a letter from other European oil giants calling for prices on carbon emissions throughout the world, Bloomberg Business reports . \nWisconsin’s state assembly voted to cut various Department of Natural Resources positions focused on contentious issues like climate change, pollution and mining, the Associated Press reports . \nSecretive organizations donated about $125 million over three years to groups fighting climate change policies in the United States, the Guardian reports . \nIN CASE YOU MISSED IT: \n-Study: EPA climate rule would create jobs -Obama launches $34M climate effort for poor countries -EPA to formally propose ethanol standard -Court rejects challenge to Obama climate rule -GOP appropriators look to block EPA rules -GOP lawmaker wants Obama to offer oil export exemptions \nPlease send tips and comments to Timothy Cama, tcama@thehill.com ; and Devin Henry, dhenry@thehill.com . Follow us on Twitter: @Timothy_Cama , @dhenry , @thehill Tags:", "external_links": [], "published": "2015-06-10T01:10:00.000+03:00", "crawled": "2015-06-10T05:25:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}