{"organizations": [], "uuid": "79ef8d16db666c33a03fbd14dba0cc2bc575474e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/housing_1111gettty.jpg", "site_section": "http://thehill.com/taxonomy/term/25211/feed#", "section_title": "The Hill: Finance Video", "url": "http://thehill.com/regulation/244620-obamas-bid-to-diversify-wealthy-neighborhoods", "country": "US", "title": "Obama making bid to diversify wealthy neighborhoods", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama making bid to diversify wealthy neighborhoods", "spam_score": 0.0, "site_type": "news", "published": "2015-06-11T13:00:00.000+03:00", "replies_count": 0, "uuid": "79ef8d16db666c33a03fbd14dba0cc2bc575474e"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/244620-obamas-bid-to-diversify-wealthy-neighborhoods", "ord_in_thread": 0, "title": "Obama making bid to diversify wealthy neighborhoods", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama making bid to diversify wealthy neighborhoods By Tim Devaney - 06/11/15 06:00 AM EDT \nThe Obama administration is moving forward with regulations designed to help diversify America’s wealthier neighborhoods, drawing fire from critics who decry the proposal as executive overreach in search of an “unrealistic utopia.” \nA final Department of Housing and Urban Development (HUD) rule due out this month is aimed at ending decades of deep-rooted segregation around the country. ADVERTISEMENT The regulations would use grant money as an incentive for communities to build affordable housing in more affluent areas while also taking steps to upgrade poorer areas with better schools, parks, libraries, grocery stores and transportation routes as part of a gentrification of those communities.\n“HUD is working with communities across the country to fulfill the promise of equal opportunity for all,” a HUD spokeswoman said. “The proposed policy seeks to break down barriers to access to opportunity in communities supported by HUD funds.” \nIt’s a tough sell for some conservatives. Among them is Rep. Paul Gosar (R-Ariz.), who argued that the administration “shouldn’t be holding hostage grant monies aimed at community improvement based on its unrealistic utopian ideas of what every community should resemble.” \n“American citizens and communities should be free to choose where they would like to live and not be subject to federal neighborhood engineering at the behest of an overreaching federal government,” said Gosar, who is leading an effort in the House to block the regulations. \nCivil rights advocates, meanwhile, are praising the plan, arguing that it is needed to break through decades-old barriers that keep poor and minority families trapped in hardscrabble neighborhoods. \n“We have a history of putting affordable housing in poor communities,” said Debby Goldberg, vice president at the National Fair Housing Alliance. \nThe Fair Housing Act of 1968 prohibited direct and intentional housing discrimination, such as a real estate agent not showing a home in a wealthy neighborhood to a black family or a bank not providing a loan based on someone’s race. \nBut HUD is looking to root out more subtle forms of discrimination that take shape in local government policies that unintentionally harm minority communities, known as “disparate impact.” \n“This rule is not about forcing anyone to live anywhere they don’t want to,” said Margery Turner, senior vice president at the left-leaning Urban Institute. “It’s really about addressing long-standing practices that prevent people from living where they want to.” \n“In our country, decades of public policies and institutional practices have built deeply segregated and unequal neighborhoods,” Turner said. \nChildren growing up in poor communities have less of a chance of succeeding in life, because they face greater exposure to violence and crime, and less access to quality education and health facilities, Turner suggested. \n“Segregation is clearly a problem that is blocking upward mobility for children growing up today,” she said. \nTo qualify for certain funds under the regulations, cities would be required to examine patterns of segregation in neighborhoods and develop plans to address it. Those that don’t could see the funds they use to improve blighted neighborhoods disappear, critics of the rule say. \nThe regulations would apply to roughly 1,250 local governments. \nHans von Spakovsky, a fellow at the Heritage Foundation, called the Obama administration “too race conscious.” \n“It’s a sign that this administration seems to take race into account on everything,” Spakovsky said. \nRepublicans are trying to block the Affirmatively Furthering Fair Housing rule. Before passing HUD’s funding bill this week, the GOP-led House approved Gosar’s amendment prohibiting the agency from following through with the rule. \nThough segregationist policies were outlawed long ago, civil rights advocates say housing discrimination persists. \nHUD is looking to break down many barriers, but Gosar suggested the regulation would have negative repercussions. \n“Instead of living with neighbors you like and choose, this breaks up the core fabric of how we start to look at communities,” Gosar said. “That just brings unease to everyone in that area.” \n“People have to feel comfortable where they live,” he added. “If I don’t feel comfortable in my own backyard, where do I feel comfortable?” \nCritics of the rule say it would allow HUD to assert authority over local zoning laws. The agency could dictate what types of homes are built where and who can live in those homes, said Gosar, who believes local communities should make those decisions for themselves rather than relying on the federal government. \nIf enacted, the rule could depress property values as cheaper homes crop up in wealthy neighborhoods and raise taxes, Gosar warned. \nIt could also tilt the balance of political power as more minorities are funneled into Republican-leaning neighborhoods, he suggested. \nThe Supreme Court is expected to weigh in on housing discrimination in a related case in the coming weeks. At issue is whether government policies that unintentionally create a disparate impact for minority communities violate federal laws against segregation. \nThe Texas Department of Housing and Community Affairs is facing accusations that it makes low-income housing funds more readily available in minority neighborhoods than in white neighborhoods. This promotes segregation, critics argue, by encouraging minorities to continue living in poor communities where government assistance is available. \nCourt observers say the case could have a profound impact on HUD’s rule.", "external_links": [], "published": "2015-06-11T13:00:00.000+03:00", "crawled": "2015-06-11T19:05:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}