{"organizations": [], "uuid": "1b005594dd4999ed136ff8d378ee829c57d2c5e5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2912952/images/o-JOHN-KERRY-facebook.jpg", "site_section": "http://www.newslookup.com/rss/newslookup-usnp.rss", "section_title": "US Newspapers: National", "url": "http://www.huffingtonpost.com/eric-zuesse/obama-sidelines-kerry-on-_b_7527342.html", "country": "US", "title": "Obama Sidelines Kerry on Ukraine Policy", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Sidelines Kerry on Ukraine Policy", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T03:46:00.000+03:00", "replies_count": 0, "uuid": "1b005594dd4999ed136ff8d378ee829c57d2c5e5"}, "author": "", "url": "http://www.huffingtonpost.com/eric-zuesse/obama-sidelines-kerry-on-_b_7527342.html", "ord_in_thread": 0, "title": "Obama Sidelines Kerry on Ukraine Policy", "locations": ["Ukraine"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama Sidelines Kerry"], "text": "reddit \nOn May 21, I headlined \"Secretary of State John Kerry v. His Subordinate Victoria Nuland, Regarding Ukraine,\" and quoted John Kerry's May 12 warning to Ukrainian President Petro Poroshenko to cease his repeated threats to invade Crimea and re-invade Donbass, two former regions of Ukraine, which had refused to accept the legitimacy of the new regime that was imposed on Ukraine in violent clashes during February 2014. (These were regions that had voted overwhelmingly for the Ukrainian President who had just been overthrown. They didn't like him being violently tossed out and replaced by his enemies.) \nKerry said then that, regarding Poroshenko, \"We would strongly urge him to think twice not to engage in that kind of activity, that that would put Minsk in serious jeopardy. And we would be very, very concerned about what the consequences of that kind of action at this time may be.\" \nAlso quoted there was Kerry's subordinate, Victoria Nuland, three days later, saying the exact opposite, that we \"reiterate our deep commitment to a single Ukrainian nation, including Crimea, and all the other regions of Ukraine.\" I noted, then that, \"The only person with the power to fire Nuland is actually U.S. President Barack Obama.\" However, Obama instead has sided with Nuland on this. \nRadio Free Europe, Radio Liberty, bannered, on June 5, \"Poroshenko: Ukraine Will 'Do Everything' To Retake Crimea',\" and reported that, \"President Petro Poroshenko has vowed to seek Crimea's return to Ukrainian rule. ... Speaking at a news conference on June 5, ... Poroshenko said that 'every day and every moment, we will do everything to return Crimea to Ukraine.'\" Poroshenko was also quoted there as saying, \"It is important not to give Russia a chance to break the world's pro-Ukrainian coalition,\" which indirectly insulted Kerry for his having criticized Poroshenko's warnings that he intended to invade Crimea and Donbass. \nRight now, the Minsk II ceasefire has broken down and there are accusations on both sides that the other is to blame. What cannot be denied is that at least three times, on April 30, then on May 11, and then on June 5, Poroshenko has repeatedly promised to invade Crimea, which wasn't even mentioned in the Minsk II agreement; and that he was also promising to re-invade Donbass, something that is explicitly prohibited in this agreement. Furthermore, America's President, Barack Obama, did not fire Kerry's subordinate, Nuland, for her contradicting her boss on this important matter. \nHow will that be taken in European capitals? Kerry was reaffirming the position of Merkel and Hollande, the key shapers of the Minsk II agreement; and Nuland was nullifying them. Obama now has sided with Nuland on this; it's a slap in the face to the EU: Poroshenko can continue ignoring Kerry and can blatantly ignore the Minsk II agreement; and Obama tacitly sides with Poroshenko and Nuland, against Kerry. \nThe personalities here are important: On February 4, 2014, in the very same phone-conversation with Geoffrey Pyatt , America's Ambassador in Ukraine, in which Nuland had instructed Pyatt to get \"Yats\" Yatsenyuk appointed to lead Ukraine after the coup (which then occured 18 days later), she also famously said \"F--k the EU!\" Obama is now seconding that statement of hers. \nIn effect, Obama is telling the EU that they can get anything they want signed, but that he would still move forward with his own policy, regardless of whether or not they like it. \nKerry, for his part, now faces the decision as to whether to quit -- which would force the EU's hand regarding whether to continue with U.S. policy there -- or else for Kerry to stay in office and be disrespected in all capitals for his staying on after having been so blatantly contradicted by his subordinate on a key issue of U.S. foreign policy. If he stays on while Nuland also does, then, in effect, Kerry is being cut out of policymaking on Europe and Asia (Nuland's territory), altogether, and the EU needs to communicate directly with Obama on everything, or else to communicate with Nuland as if she and not Kerry were the actual U.S. Secretary of State. But if Kerry instead quits, then the pressure would be placed on EU officials: whether to continue with the U.S., or to reject U.S. anti-Russia policy, and to move forward by leaving NATO, and all that that entails? \nIf they then decide to stay with the U.S., after that \"F--k the EU!\" and then this; then, the European countries are clearly just U.S. colonies. This would be far more embarrassing to those leaders than John Kerry would be embarrassed by his simply resigning from the U.S. State Department. It might even turn the tide and force the Ukrainian Government to follow through with all of its commitments under the Minsk II accords. \nIt would be the most effective thing for Kerry to do at this stage. But, it would lose him his position as a (now merely nominal) member of Obama's Cabinet. \nThe way this turns out will show a lot, about John Kerry. The nations of Europe already know everything they need to know about Barack Obama. If Kerry quits, he'll have respect around the world. If he stays, he'll be just another Colin Powell. \nThe ball is in Kerry's court, and everyone will see how he plays it -- and what type of man he is (and isn't). \n--", "external_links": [], "published": "2015-06-08T03:46:00.000+03:00", "crawled": "2015-06-08T04:04:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}