{"organizations": [], "uuid": "88a707c1b8400cd1e16adcf10461f42ddaa966c8", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/abadihaider04162015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/244043-obama-to-meet-iraqi-prime-minister-at-g7", "country": "US", "title": "Obama to meet Iraqi prime minister at G7", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to meet Iraqi prime minister at G7", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T19:58:00.000+03:00", "replies_count": 0, "uuid": "88a707c1b8400cd1e16adcf10461f42ddaa966c8"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/international/244043-obama-to-meet-iraqi-prime-minister-at-g7", "ord_in_thread": 0, "title": "Obama to meet Iraqi prime minister at G7", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to meet Iraqi prime minister at G7 Getty Images By Jordan Fabian - 06/04/15 12:58 PM EDT \nPresident Obama will meet with Iraqi Prime Minister Haider al-Abadi at this weekend’s Group of Seven (G7) summit in Germany amid tensions over the administration’s strategy in fighting the Islamic State in Iraq and Syria (ISIS). ADVERTISEMENT It will be Obama and Abadi’s first face-to-face meeting since the city of Ramadi fell to ISIS militants last month, a major blow for the international coalition’s campaign against the group.\nThe two leaders will discuss “the situation on the ground and our efforts to support the Iraqi security forces,” deputy national security adviser Ben Rhodes told reporters Thursday. \nThe White House has publicly expressed confidence in Abadi’s leadership, but there have been signs of a strained relationship since ISIS took control of the Sunni stronghold of Ramadi. \nAbadi called for greater international support for Iraqi ground forces during a meeting of coalition partners in Paris this week. \n“This is a failure on the part of the world,” Abadi told reporters. “There is a lot of talk of support for Iraq. There is very little on the ground.” \nISIS has also made recent gains in Syria, taking the ancient city of Palmyra and advancing on Aleppo. \nRhodes said there are no plans to announce any shift in strategy. He expressed confidence in the existing plan to fight the group, which includes a new offensive in Anbar Province, where Ramadi is located. \nThere are approximately 3,000 U.S. troops training and equipping Iraqi forces, but they do not serve in combat roles. \nIn addition, the government has sent 2,000 anti-tank missiles to Iraq to help combat ISIS’s use of car bombs placed inside armored vehicles. The administration has also pledged to speed up other weapons shipments. \nLast month, Iraqi officials were angered when Defense Secretary Ashton Carter said Iraqi troops who were routed in Ramadi showed “no will to fight.” That prompted Vice President Biden to smooth over tensions and pledge support for the Iraqi forces in a phone call with Abadi. Tags: Past: 1 day Paul joins crusade to expose... The Bush administration blacked out 28 pages extracted from a... GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-04T19:58:00.000+03:00", "crawled": "2015-06-04T23:20:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}