{"organizations": ["Facebook", "Twitter"], "uuid": "8cdb48c7d4975cb790a9b925c4d706ef2690fea4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/politics/2015/06/26/obama-to-deliver-eulogy-at-funeral-for-charleston-shooting-victim/", "country": "US", "title": "Obama to deliver eulogy at funeral for Charleston shooting victim", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama to deliver eulogy at funeral for Charleston shooting victim", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T16:17:00.000+03:00", "replies_count": 0, "uuid": "8cdb48c7d4975cb790a9b925c4d706ef2690fea4"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/26/obama-to-deliver-eulogy-at-funeral-for-charleston-shooting-victim/", "ord_in_thread": 0, "title": "Obama to deliver eulogy at funeral for Charleston shooting victim", "locations": ["Charleston"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama to deliver eulogy at funeral for Charleston shooting victim Published June 26, 2015 Facebook 0 Twitter 0 Email Print \nFor President Obama, it's become an all-too-frequent ritual: honoring the victims of mass shootings in communities across the country. \nOn Friday, Obama will mourn with the city of Charleston, South Carolina, where nine people were killed last week at a historic black church. He'll deliver a eulogy at the funeral for Rev. Clementa Pinckney, a state lawmaker and pastor of Emanuel African Methodist Church. \nThe deaths of Pinckney and eight others have sparked a debate in Southern states over the Confederate battle flag, which for years has flown at a monument on the grounds of the South Carolina statehouse. But the slayings have also exposed the scant appetite in Washington for restarting discussions on gun control legislation, which have made no progress during Obama's presidency. \nWhite House officials indicated the president's remarks would focus more on the victims of last week's shootings than those delicate political issues. \n\"The president will be mindful of not just how sad it is that those individuals were taken from us, but also use the occasion to celebrate their lives,\" White House spokesman Josh Earnest said. \nThe somber setting in Charleston will be a marked contrast to the jubilant mood at the White House this week, where Obama and his advisers have relished back-to-back victories on trade and health care. \nFirst lady Michelle Obama, along with Vice President Joe Biden and his wife, Jill, will join the president at the funeral at the College of Charleston. Several members of Congress were also scheduled to attend, along with Hillary Rodham Clinton, who is seeking the Democratic presidential nomination. \nFollowing the service for Pinckney, the president is expected to meet privately with the families of other victims. \nObama has been called upon throughout his presidency to help soothe the pain of communities mourning gun-related tragedies. \nHe issued a powerful call for national unity in Tucson, Arizona, after a 2011 shooting that severely injured then-Rep. Gabby Giffords. His voice was filled with emotion in 2012 when he spoke at a prayer vigil for the elementary school students and adults killed in Newtown, Connecticut. \nHe's also addressed grief-stricken communities in Fort Hood, Texas and Aurora, Colorado, as well as his own current hometown of Washington. \nThe morning after the Charleston shooting, Obama expressed his frustration with the frequency of such tragedies. \n\"I've had to make statements like this too many times,\" he said. \"Communities like this have had to endure tragedies like this too many times.\" Advertisement", "external_links": [], "published": "2015-06-26T16:17:00.000+03:00", "crawled": "2015-06-26T16:31:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}