{"organizations": [], "uuid": "7ae2059983760cdf9cc5d851d47233f22cb8b1eb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama3_060815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/33/feed#", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/244274-obama-we-should-assume-court-will-uphold-healthcare-law", "country": "US", "title": "Obama: Supreme Court wrong to take up ObamaCare challenge", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Supreme Court wrong to take up ObamaCare challenge", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T18:03:00.000+03:00", "replies_count": 0, "uuid": "7ae2059983760cdf9cc5d851d47233f22cb8b1eb"}, "author": "sferris@thehill.com (Sarah Ferris and Jordan Fabian)", "url": "http://thehill.com/policy/healthcare/244274-obama-we-should-assume-court-will-uphold-healthcare-law", "ord_in_thread": 0, "title": "Obama: Supreme Court wrong to take up ObamaCare challenge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Supreme Court wrong to take up ObamaCare challenge Getty Images By Sarah Ferris and Jordan Fabian - 06/08/15 11:03 AM EDT The Supreme Court should not have taken up the lawsuit challenging ObamaCare subsidies, President Obama said on Monday. “This should be an easy case, frankly it shouldn't have even been taken up,” Obama said during a news conference at the Group of Seven (G-7) summit of leading industrial nations in Germany. ADVERTISEMENT The Supreme Court is expected to hand down a decision this month in the King v. Burwell case, which threatens to eliminate subsidies for millions of Americans who receive their health insurance from federal exchanges. Obama rejected the basis for the challenge and said it is “well documented” that the authors of the Affordable Care Act “never intended” to block people on federal exchanges from obtaining the subsidies. “There is no reason why the existing exchanges should be overturned through a court case,” he said. He declined to answer questions about his contingency plans for a Supreme Court decision against the law, and said people should “assume” that it will be upheld. “I'm not going into a long speculation anticipating disaster,” Obama said. “I think it’s important for us to go ahead and assume that the Supreme Court is going to do what most legal scholars who've looked at this would expect them to do.” The Obama administration has repeatedly declined to discuss plans for people in at least 34 states that could lose subsidies. A total of 6.3 million people could lose subsidies, and Obama and his health secretary have stressed that they wouldn’t be able to blunt the impact. When asked why his administration was not preparing a backup plan, Obama paused. \n“I want to make sure that everybody understands that you have a model, where all the pieces connect, and there are a whole bunch of scenarios — not just related to healthcare — but all kinds of stuff that I do where, if somebody does something that doesn't make any sense, it's hard to fix,” he said. \nHe did say there was one way to resolve the dispute over the law: “Congress could fix this whole thing with a one-sentence provision,” he said. Congressional Republicans are still working on their own plan B for the court ruling. GOP leaders have backed a plan that would repeal both the individual and employer mandate in exchange for allowing the ObamaCare subsidies to continue. That plan would be vetoed by the president, however — a scenario that Senate Majority Leader Mitch McConnell (R-Ky.) acknowledged last week. Sen. John Barrasso (R-Wyo.) issued a sharp statement Monday pushing back against Obama's remarks, warning that the GOP would not pass \"a so called 'one-sentence' fake fix.\"“Instead of bullying the Supreme Court, the president should spend his time preparing for the reality that the court may soon rule against his decision to illegally issue tax penalties and subsidies on Americans in two-thirds of the country,\" said Barrasso, who is leading the Senate's working group for King v. Burwell contingency plans. \n“Fortunately, there's no reason to have to do it. It doesn't need fixing,” Obama said. \nThe Supreme Court case centers on whether a clause in the healthcare law — \"established by the state\" — means that subsidies for buying insurance cannot be distributed through the federal exchange HelathCare.gov. \nThirty-four states opted to not create their own exchanges, and it is the people in those states who would lose financial aid if the administration lost the case. \nObama said he is puzzled by the legal challenges against his signature healthcare law, arguing there is ample evidence that the system is working. \n“Part of what's bizarre about this whole thing is, we haven't had a lot of conversation about the horrors of ObamaCare because none of them have come to pass,” he said. Tags:", "external_links": [], "published": "2015-06-08T18:03:00.000+03:00", "crawled": "2015-06-08T23:29:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}