{"organizations": ["Vicenza", "Mulberry School for Girls", "Peace Corps Volunteer Bina Contreras", "UK Department of International Development"], "uuid": "096c2ea4e33940378223c1dbb4a94c2ad7c68158", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/16/politics/gallery/michelle-obama-malia-obama-sasha-obama-let-girls-learn-initiative-london-italy-global-tour/index.html", "country": "", "title": "Michelle, Malia and Sasha Obama stop by London - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Michelle, Malia and Sasha Obama stop by London - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-17T01:15:00.000+03:00", "replies_count": 0, "uuid": "096c2ea4e33940378223c1dbb4a94c2ad7c68158"}, "author": "", "url": "http://www.cnn.com/2015/06/16/politics/gallery/michelle-obama-malia-obama-sasha-obama-let-girls-learn-initiative-london-italy-global-tour/index.html", "ord_in_thread": 0, "title": "Michelle, Malia and Sasha Obama stop by London - CNNPolitics.com", "locations": ["Kensington Palace", "Milan", "U.S.", "UK", "Italy", "London", "Stansted Airport"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malia Obama", "David Cameron", "Sasha Obama", "Malia", "Harry", "Michelle", "Samantha Cameron", "Marian Robinson", "Obama", "Sasha", "Michelle Obama"], "text": "Michelle, Malia and Sasha Obama stop by London Updated 2224 GMT (0524 HKT) June 16, 2015 Michelle, Malia and Sasha Obama stop by London 7 photos First lady Michelle Obama arrives with her daughters, Malia Obama (center) and Sasha Obama (right), and her mother, Marian Robinson, at Stansted Airport on June 15 in London. Hide Caption Michelle, Malia and Sasha Obama stop by London 7 photos Obama meets Prince Harry at Kensington Palace on June 16 in London. Hide Caption 2 of 7 Michelle, Malia and Sasha Obama stop by London 7 photos Obama speaks during a Let Girls Learn initiative meeting at the Mulberry School for Girls on June 16 in London. Hide Caption 3 of 7 Michelle, Malia and Sasha Obama stop by London 7 photos Obama speaks during a Let Girls Learn meeting at the Mulberry School for Girls on June 16. Hide Caption 4 of 7 Michelle, Malia and Sasha Obama stop by London 7 photos Obama sits between the UK Department of International Development's Justine Greening (left) and Peace Corps Volunteer Bina Contreras (right) during a Let Girls Learn meeting at the Mulberry School for Girls on June 16. Hide Caption 5 of 7 Michelle, Malia and Sasha Obama stop by London 7 photos Obama meets Prime Minister David Cameron and his wife, Samantha Cameron, in Downing Street on June 16 in London. Hide Caption 6 of 7 Michelle, Malia and Sasha Obama stop by London 7 photos Sasha (left) and Malia (center) leave Downing Street following a meeting with the Prime Minister and his wife on June 16 in London. Hide Caption 7 of 7 First lady Michelle Obama is visiting London with her daughters, Malia and Sasha, and her mother, Marian Robinson, for a global tour promoting her Let Girls Learn Initiative. She met with students to discuss how the UK and U.S. are working together to expand girls education around the world and will travel on to Milan and Vicenza in Italy. More from Politics ", "external_links": [], "published": "2015-06-17T01:15:00.000+03:00", "crawled": "2015-06-17T01:16:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}