{"organizations": [], "uuid": "7e0d4d045000ae48a48265a0fcfd4842c98f6d2f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_060815getty_1.jpg", "site_section": "http://thehill.com/rss/syndicator/21684", "section_title": "TheHill - Video", "url": "http://thehill.com/policy/finance/244539-house-dem-obama-has-lost-touch-with-real-world-on-trade", "country": "US", "title": "House Democrat says Obama has lost touch with 'the real world'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House Democrat says Obama has lost touch with 'the real world'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T18:57:00.000+03:00", "replies_count": 0, "uuid": "7e0d4d045000ae48a48265a0fcfd4842c98f6d2f"}, "author": "Peter Schroeder", "url": "http://thehill.com/policy/finance/244539-house-dem-obama-has-lost-touch-with-real-world-on-trade", "ord_in_thread": 0, "title": "House Democrat says Obama has lost touch with 'the real world'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House Democrat says Obama has lost touch with 'the real world' By Peter Schroeder - 06/10/15 11:57 AM EDT 645X363 - Full Sharing - Additional videos are suggested upon completion \nA House Democrat on Wednesday accused President Obama of losing touch with the real world, as his administration pushes for fast-track authority to finish a sweeping trade pact. \nRep. Brad Sherman (D-Calif.), who opposes the pending Trans-Pacific Partnership and legislation to help finalize it, said Obama lives “in a cloister” at the White House, while Sherman and his fellow lawmakers “are out seeing the real world.” ADVERTISEMENT “We’re in our districts. We don’t live in a cloister where the only people who can get in are the captains of industry and the titans of Wall Street,” he said. “We’re the ones that are standing at the county fairs, talking to whoever wants to come up and talk to us.”\nSherman said living in the White House for the last six years had put Obama out of touch with the common American and that he should listen to the perspective of fellow Democrats who oppose him on trade. \n“The president should trust us, his 200 most fervent supporters who, unlike him, have a chance to get out and see the real world,” he said. “We have the same values, but we don’t have the same lifestyle.” \nObama and congressional Democrats have clashed for months over the trade pact, with the fight coming to a head in the push to pass fast-track legislation that would allow Obama to finalize terms of the 12-nation agreement by limiting Congress to an up-or-down vote. \nRep. Marcy Kaptur (D-Ohio) said it was up to Democrats to defeat the bill and \"save President Obama from his advisers.\" \nWith a vote set for Friday that would send the fast-track legislation to the president, House Democrats in opposition are still trying to rally support to block it. Critics of the deal gathered outside the Capitol Wednesday to reiterate their opposition and urge Democrats to hold firm and block the bill. \n“Now is the time to redouble our efforts,” said Rep. Rosa DeLauro (D-Conn.). “Failure, my friend, is not an option.” \nLabor groups and liberal organizations have been staunchly opposed to the deal, arguing it is a bad for workers. They have vowed they won’t forget which Democrats help pass the legislation come Election Day. \n“This is a message to any member of Congress that’s thinking about voting for this unfair trade deal,” said Hasan Solomon with the Machinists Union. “You better start packing your bags right now, because we’re going to fast track you right out of office in 2016.” \nThe liberal group MoveOn.org vowed it would mobilize its millions of members to oppose Democrats who vote in favor of the pending bill. \n“Our members knocked on doors for you, they donated to you,” said Ben Wikler, the group’s Washington director. “They are watching this vote, and they will not forget how you vote on fast track.” Tags:", "external_links": [], "published": "2015-06-10T18:57:00.000+03:00", "crawled": "2015-06-10T22:28:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}