{"organizations": ["CNN"], "uuid": "92d34d4ade0574bbb5dcc46fc7093398023f8e91", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/06/04/WE01217945/3613376/BarakObama2jpg-3613376_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1246698", "country": "", "title": "President Obama Twitter – “Hello, Twitter! It’s Barack. Really! Six years in, they’re finally giving me my own account.” President Obama Twitter First Tweet - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "President Obama Twitter – “Hello, Twitter! It’s Barack. Really! Six years in, they’re finally giving me my own account.” President Obama Twitter First Tweet - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "92d34d4ade0574bbb5dcc46fc7093398023f8e91"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1246698", "ord_in_thread": 0, "title": "President Obama Twitter – “Hello, Twitter! It’s Barack. Really! Six years in, they’re finally giving me my own account.” President Obama Twitter First Tweet - CNN iReport", "locations": ["United Arab Emirates", "Dubai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama Twitter", "Barack", "Obama"], "text": "By IGiReports President Obama Twitter – “Hello, Twitter! It’s Barack. Really! Six years in, they’re finally giving me my own account.” President Obama Twitter First Tweet By Amonmag | Posted 14 hours ago | Dubai, United Arab Emirates \nPresident Obama Twitter Account has recently gain alot of populari ty when it officially launched. \nPresident Obama Twitter Account \nPresident Obama Twitter Account: The president of the United States finally acquired his own dedicated Twitter account. His first tweet was “Hello, Twitter! It’s Barack. Really! Six years in, they’re finally giving me my own account.” \nPreviously, Barack Obama wasn’t silent on social media – for example, 7 years ago, he demonstrated the power of Twitter as an early adopter on the presidential campaign trail. @BarackObama, his personal feed, is now accounting for 60 million followers. \nNow President Obama Twitter official account @POTUS is launched, attracting about 5,000 followers a minute. According to Obama’s administration, the account would help the president to engage directly with the US people, with tweets coming exclusively from him. \nHowever, the industry observers believe that it’s unlikely that Obama will use his account as robustly as does Iran’s leader Ayatollah Ali Khamenei, who is constantly trolling his enemies, not least the United States. However, by deploying the official @POTUS account, which was reserved a few years ago, the US president has gained an official online voice as head of state, while his @BarackObama account is more personal. Michelle Obama took the same approach and appears online on the @FLOTUS account along with her own personal feed. \nIf Obama’s administration is telling the truth, and the president really does write his own entries on the new Twitter account, this means that he enters a very elite club – the statistics say that while 86% of the 193 UN member states are represented on Twitter, very few world leaders actually tweet themselves. Those few exceptions are Estonian president, president of the European Council, Latvian foreign minister, Norway’s and Russia’s prime ministers. \nInsight Of President Obama Twitter Account: President Obama Twitter ACcount This picture shows what time does President Obama Tweets in the day. So you can Ask Q&A at the time when he is active. \nhttp://beta.amonmag.com \nPresident Obama Twitter This shows the details about his account. The platform he uses to tweet. As twitter doesnt show when the account joined, so here is more detailed information about his account \nPresident Obama Twitter Account Tweets From 18th May 2015 till 28 May 2015 ", "external_links": [], "published": "2015-06-04T03:00:00.000+03:00", "crawled": "2015-06-05T06:33:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}