{"organizations": ["Fox News"], "uuid": "6ef8271425fcd97bd99de0367f3171885d19717e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2015/06/26/latest-crowds-gather-before-obama-arrives-to-deliver-eulogy-for-church-shooting/", "country": "", "title": "The Latest: Crowds gather before Obama arrives to deliver eulogy for church shooting victim | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The Latest: Crowds gather before Obama arrives to deliver eulogy for church shooting victim | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "6ef8271425fcd97bd99de0367f3171885d19717e"}, "author": "", "url": "http://www.foxnews.com/us/2015/06/26/latest-crowds-gather-before-obama-arrives-to-deliver-eulogy-for-church-shooting/", "ord_in_thread": 0, "title": "The Latest: Crowds gather before Obama arrives to deliver eulogy for church shooting victim | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "\nThe latest in the Charleston church shooting. (All times local.) \n___ \n8:10 a.m. \nCrowds were gathering outside an arena were funeral services were to be held for one of the nine victims of the Charleston church shooting last week. President Barack Obama was scheduled to deliver the eulogy. \nHundreds of people began lining up in a queue that stretched at least four blocks from the arena. Services were scheduled to begin at 9 a.m. for the Rev. Clementa Pinckney, who also served as a state senator. \nWanda Johnson of Anderson, South Carolina, said it was \"monumental\" that Obama was coming to support the community and the state and also said she was proud of the way people in her state have remained peaceful and united after unrest in other cities that followed the killings of unarmed African-Americans. \n\"I think it speaks a whole lot for the people of South Carolina,\" she said. \nPinckney and eight other blacks were killed last week by a gunman during a bible study at the Emanuel African Methodist Episcopal Church. A suspect, Dylann Storm Roof, has been charged in their murders. \n___ \n10 p.m. \nThe dean of Washington National Cathedral is calling for the removal of stained-glass windows that depict the Confederate battle flag. \nThe Very Rev. Gary Hall issued a statement Thursday saying windows in the church honoring Confederate Gen. Stonewall Jackson and Gen. Robert E. Lee should be removed. Both windows depict the Confederate flag. \nThe cathedral installed the windows in 1953. Hall says the cathedral's leadership at the time thought recognition for the Confederate leaders would foster reconciliation. \nBut Hall says celebrating the lives of the Confederate generals and flag now does not promote healing or reconciliation, especially for African-Americans. Hall says the Confederate flag has become the primary symbol of white supremacy. \nHall says the cathedral should consider new windows representing the nation's history of race and slavery. \n__ \n9 p.m. \nApple is removing games from its online app store that feature the Confederate flag in \"offensive or mean-spirited ways.\" \nThe announcement Thursday comes days after Apple CEO Tim Cook called on people in a tweet to honor the victims of the Charleston, South Carolina, church shooting by eradicating racism and the symbols that feed it. \nApple said in a statement that apps are being removed \"that use the Confederate flag in offensive or mean-spirited ways, which is in violation of our guidelines.\" Other apps that depict the flag in educational or historical contexts are not being removed. \nThe Cupertino, California-based company is the latest business to distance itself from the divisive symbol after the shooting suspect, Dylann Storm Roof, appeared in photos holding the flag. \nThis week, a host of retailers including Wal-Mart, Amazon, Sears, eBay and Etsy said they would remove Confederate flag merchandise from their shelves and websites, while Google blocked digital ads featuring the flag. \n__ \n7:45 p.m. \nA viewing in a historic black church in Charleston, South Carolina is giving the community a chance to pay respects to the Rev. Clementa Pinckney. \nA somber procession of mourners filed past his open casket during the viewing Thursday night at Emanuel African Methodist Episcopal Church. \nThe state senator also had public viewings Thursday at a church in Ridgeland and a day earlier in the state Capitol. \nPresident Barack Obama is scheduled to deliver the eulogy at his funeral on Friday. \nLater Thursday, services for Sharonda Coleman-Singleton were scheduled. Funerals for the other seven victims of last week's shooting at Emanuel African Methodist Episcopal Church were set for other days over the next week. Advertisement ", "external_links": [], "published": "2015-06-26T03:00:00.000+03:00", "crawled": "2015-06-26T18:59:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}