{"organizations": [], "uuid": "9069d00725cc669af924f01386518edccb637b2e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/billrobinson/the-crucial-compassion-of_b_7586508.html", "country": "", "title": "The Crucial Compassion of Medical Marijuana in NY State | Bill_Robinson", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "The Crucial Compassion of Medical Marijuana in NY State | Bill_Robinson", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T00:12:00.000+03:00", "replies_count": 0, "uuid": "9069d00725cc669af924f01386518edccb637b2e"}, "author": "", "url": "http://www.huffingtonpost.com/billrobinson/the-crucial-compassion-of_b_7586508.html", "ord_in_thread": 0, "title": "The Crucial Compassion of Medical Marijuana in NY State | Bill_Robinson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nMany Americans are against the legalization of marijuana for a multitude of reasons. \nPerhaps they're parents worried about their children. Whatever. We all understand these concerns, or should. \nThe legalization of recreational use of pot is one of our country's most hotly contested issues. And it will probably remain that way. \nBut I feel it's time for all Americans, and in particular, New Yorkers to come together and speak with one voice saying, \"Sick people in pain should have every possible option to help them with their fight. And minimize their pain.\" \nEven the vociferous Conservatives worried about the recreational legalization of weed, make strong exceptions for medical use. Why shouldn't people struggling with serious disease and in pain, be able to try marijuana to help? \nWhy can't people worry more about the sick and pained, than other less desperate potentials? How about the sick, shouldn't we worry about them first and foremost? Of course we should. \nThough there's a snowballing effect for the deregulation of medical cannabis, the sprouting medical cannabis industry in New York and countrywide still needs our support. Even government is awakening. \nThat's why in June of 2014, the New York state legislature passed a bill which Governor Cuomo signed promptly making New York the 23rd state to legalize the medicinal use of marijuana. \nUntil recently, the government has been more worried about people getting high than people in pain. It's a major stride forward to recognize the difference and allow for helping people first. \nAnd sometime in July, New York state will be announcing the five licenses to be awarded to five companies to legally grow, cultivate and distribute medicinal marijuana through four dispensaries each. \nA partial list of the diseases and nastinesses that various strains of medical cannabis are now helping include: Epilepsy, Alzheimer's, Autism, Huntington's, Crohn's, Parkinson's, Diabetes, Glaucoma, Cerebral Palsy, Tourette Syndrome, Multiple Sclerosis and even--researchers are discovering now--Cancer. \nI could very well be wrong about this, but it appears medicinal marijuana may just be the \"Wonder Drug\" medicine has been searching for since we came out of our caves. \nSince the THC content in marijuana is what the government's been so worried about for decades, let's offer medicinal cannabis which helps with these afflictions without the \"high\" and does just a good or better job of helping the sick. \nWell, one company that is competing for one of the five licenses New York state is offering has just such a product. CCCNY , or Compassionate Care Center of New York has a strain of cannabis which does not get the patient high but still quickly delivers needed relief. It is called \" Avidekel \" and it has only 1.1% to 2% THC range and a Cannabinoid or CBD range of 14.5% to 16.3%. For many illnesses, it is from the CBD side of the marijuana plant, not the THC buzz-inducing side, that the true medicinal benefits are derived. \nTherefore, the best medicinal cannabis for many maladies is that which is low in THC and correspondingly high in CBD. \nNot this ... \nBut this ... the THC and \" Haleigh's Hope \" CBD cannabis medicines \nFor the children especially, CBD-rich oils and other medicines with low or no THC have proved very effective. Seizures in children seem to be one of the foremost examples of the efficacy of medicinal cannabis. ( \"From Dozens of Seizures a Day to 33 Straight Days Seizure-Free with Medical Marijuana\") Autism is another heart-breaking affliction that reports say is vastly improved with medical cannabis. CCCNY is a serendipitous conglomerate of several major players, two of which come from countries that legalized the sympathetic use of cannabis long before the US: Israel (process began in 2000) and Canada ( July, 2001 ). Together, I feel these disparate companies and individuals who've given their lives to helping people who are sick and in pain, comprise a sort of medical cannabis \"Dream Team.\" \nMedReleaf MedReleaf is based in Markham, Ontario, part of Greater Toronto. Neil Closner is CEO of this Canadian Licensed Producer medical cannabis corporation with a 55,000-square foot facility and a very serious research focus. \"The intention of this group is to put together the best team and bring it to New York state for the benefit of New Yorkers,\" Closner told me passionately. \n\"I was approached by somebody who told me about a company in Israel called Tikun Olam,\" Closner told me. \"I was skeptical but went to visit Tikun Olam and they took me to a nursing home where I sat with senior after senior taking medical cannabis. I was blown away by how it improved their lives. I came back and immediately got a (Canadian) government license. We started shipping one year ago and ship 15 different products working very closely with Tikun Olam.\" \nTikun Olam Aharon Lutzky is the CEO of Tikun Olam, an Israeli enterprise that's created some of the leading medicinal cannabis products in the world. It was Lutzky that Neil Closner visited in Israel. \n\"Tikun Olam means 'Healing the world,'\" Lutzky told me recently. \"I was in the plastic and agriculture industry and my son was injured. He was using the Tikun Olam' product and it was the only thing helping him. So I started volunteering for the company and in the end became CEO. We were working with both types of cannabis (THC and CBD) and went on to apply for a number of patents and have three pending .\" \nZvi Bentwich, M.D. is the Chief Scientist at Tikun Olam and also Professor at Ben-Gurion University of the Negev. Dr. Bentwich was the first physician to work with AIDS patients and provide them with medical marijuana. \nAccording to Bentwich, \"we've been allowed to move forward in Israel with solid, well-designed clinical trials to discover a lot,\" the doctor explained. \"Israel has been peer-reviewing medical cannabis for more than 20 years, whereas the US has only had non-peer-reviewed science on the subject. This is one reason we are so far ahead of the US in this area.\" \nCCCNY- Compassionate Care Center of New York The CCCNY sprung up from the relationship between MedReleaf and Tikun Olam. \nLarry I. Good, M.D., is CEO of CCCNY and also the former Chief, Division of Gastroenterology, South Nassau Communities Hospital and former CEO, Good Pharmaceuticals. \nJason Cranford, Director of Cultivation, CCCNY \nCranford, who invented and owns the rights to the \"Haleigh's Hope\" strain of medicinal cannabis, told me, \"You can't smoke this; you can't put it in a brownie. I try to steer patients away from smoking cannabis ... it is carcinogenic when smoked.\" \nAnd last, but certainly not least, is Sue Sisley, M.D . Sisley has been focused on helping military veterans suffering from PTSD and has made tremendous progress using medicinal cannabis. \n\"In Canada and Israel recently,\" Sisley told me excitedly, \"I've seen the great way they provide their veterans with marijuana to help them.\" Extending her commentary to the CCCNY initiative, Sisley told me, \"I'm so excited to be working with this great team from around the world.\" \nI've written about our great fighting heroes in my column \" American Hero Stories \" and know as well as anybody who hasn't marched into combat behind our flag, the great sacrifice that these men and women--and their families make. They deserve every possible assistance as they re-integrate back into American society. They deserve this from us. Dr. Sisley has made this her personal priority. \nBecause of the way in which the license recipients will need to hit the ground running once they are approved for a license, the CCCNY team is wasting no time. They've got a 350,0000 square foot, state-of-the-art, turn-key greenhouse ready to grow their patient's medical cannabis in Newark, New York. \nCCCNY plans to locate the four dispensary locations each of the winners of New York State licenses may have in Brooklyn, Buffalo, Rochester and Binghamton. \nI can't imagine a more versatile drug; positively affecting more serious afflictions; with the potential to help millions of people, than these new strains and formats of cannabis that don't (necessarily) get anybody high . And while I don't know anything about any of the other consortia competing for these licenses, I can't imagine a better international team qualified to lead this effort than CCCNY. \nFollow Bill_Robinson on Twitter: www.twitter.com/RelentlessBill More: ", "external_links": [], "published": "2015-06-30T00:12:00.000+03:00", "crawled": "2015-06-30T00:12:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}