{"organizations": [], "uuid": "2f0b10515f88570714135f87462344da223fe40f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/bidenbeaubidenjoe_053015getty.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/243752-obama-to-deliver-eulogy-for-beau-biden", "country": "US", "title": "Obama to deliver eulogy for Beau Biden", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to deliver eulogy for Beau Biden", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T19:39:00.000+03:00", "replies_count": 0, "uuid": "2f0b10515f88570714135f87462344da223fe40f"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/243752-obama-to-deliver-eulogy-for-beau-biden", "ord_in_thread": 0, "title": "Obama to deliver eulogy for Beau Biden", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to deliver eulogy for Beau Biden Getty Images By Jordan Fabian - 06/02/15 12:39 PM EDT \nPresident Obama on Saturday will deliver a eulogy for Vice President Biden’s son, Beau, who died after a long battle with brain cancer. \nObama will honor the life of the younger Biden during a mass of Christian burial at St. Anthony of Padua R.C. Church in Wilmington, Delaware, the White House said. ADVERTISEMENT The president’s speech will culminate a three-day memorial for Biden, 46, who served as attorney general of Delaware. \nHis body will lie in honor Thursday at Legislative Hall in the state capitol of Dover. There will be a public viewing at the Wilmington church on Friday. \nThe Biden family asked mourners to donate to the Beau Biden Foundation for the Protection of Children. \nPresident Obama and first lady Michelle Obama visited the Bidens at their home at the Naval Observatory in Washington on Sunday, the day after Beau Biden’s death. \n“Beau Biden believed the best of us all,” the president said in a statement last weekend. “For him, and for his family, we swing our lanterns higher.” \nPast: 1 day Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-02T19:39:00.000+03:00", "crawled": "2015-06-02T20:35:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}