{"organizations": [], "uuid": "75269964a794d2c97437a089720763867e2f95e0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3063798/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/12/democrats-fast-track-primaries_n_7566304.html", "country": "", "title": "Activists Threaten Primaries Against Dems Who Back Obama Trade Deals", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Activists Threaten Primaries Against Dems Who Back Obama Trade Deals", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "75269964a794d2c97437a089720763867e2f95e0"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/12/democrats-fast-track-primaries_n_7566304.html", "ord_in_thread": 0, "title": "Activists Threaten Primaries Against Dems Who Back Obama Trade Deals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Activists Threaten Primaries Against Dems Who Back Obama Trade Deals Posted: reddit \nWASHINGTON -- Democratic activists are trying to add momentum to a revolt against President Barack Obama's trade push Friday, threatening to seek primary opponents against any Democratic lawmakers who back legislation that helps the trade deals pass. \nThe House is set to vote on several measures designed to help give Obama the fast-track authority he needs to pass major new trade agreements that would cover well over half the world's economy. Opponents, including most Democrats, say the deals will undermine U.S. labor laws, environmental rules, consumer protections and financial regulations while shifting even more manufacturing jobs overseas. A significant number of Republicans are worried about impacts at home from the deals, which would include the Trans-Pacific Partnership, the Transatlantic Trade and Investment Partnership, and the Trade in Services Agreement. \nGiven the fervent opposition, Republicans and the White House have tried to strike a delicate balance of finding ways to allay GOP concerns about granting the president more power and Democratic concerns about angering their union, middle-class base. \nKey to that equation is Trade Adjustment Assistance, a program that aims to retrain workers who are likely to lose jobs because of the trade deals. Democrats see it as essential, and won't back trade pacts unless it is passed. Many Republicans see it as ineffective welfare, but some have expressed willingness to vote for TAA if it means they can get enough Democrats to help pass the broader agenda. \nThat's where the primary threat comes in, from the group started by former Democratic Party Chairman Howard Dean, Democracy For America. \n\"Ahead of today's votes we wanted to be very clear to Democratic members of Congress: If you vote for either Medicare-cutting Trade Adjustment Assistance legislation or Fast Track Authority for the job-killing Trans-Pacific Partnership, we will not lift a finger or raise a penny to protect you when you're attacked in 2016, we will encourage our progressive allies to join us in leaving you to rot, and we will actively search for opportunities to primary you with a real Democrat,\" said Jim Dean, chairman of Democracy for America. \nThe Medicare cuts he referred to are some $700 million that would be sliced from the entitlement program to help pay for the aid to displaced workers. But in the complicated maneuvering around the trade deals, Republicans have offered yet another measure that would restore those cuts, in hopes of getting a few more Democrats on board. \nBut Dean and Democracy for America are saying that's not good enough, and anything that helps pass fast-track authority -- for Obama and the next president -- is unacceptable, and will be grounds for backing challengers against incumbent Democrats. \n\"Those primaries could happen next year or they could happen in election cycles to come, but, make no mistake, today's vote to cut Medicare and fast track the destruction of American jobs will be remembered and will either haunt you or make you a hero,\" said Dean in a statement provided to HuffPost. \nHouse Speaker John Boehner (R-Ohio) has said he expects to lose about 50 of his 246 Republican members, which would mean that he needs around 25 Democrats to pass trade legislation. So far, about 20 have said they'd back Boehner and Obama. \nMichael McAuliff covers Congress and politics for The Huffington Post. Talk to him on Facebook. Also on HuffPost: ", "external_links": [], "published": "2015-06-12T03:00:00.000+03:00", "crawled": "2015-06-13T04:31:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}