{"organizations": [], "uuid": "2e770fe762cbf3b024d161605a7ca2e296f22062", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3039002/images/o-RODNEY-A-ERICKSON-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/teen/news.xml", "section_title": "Teen News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/07/college-presidents-pay_n_7520982.html?utm_hp_ref=teen&ir=Teen", "country": "US", "title": "68 Public College Presidents Made More Than President Obama In 2014", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "68 Public College Presidents Made More Than President Obama In 2014", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T01:27:00.000+03:00", "replies_count": 0, "uuid": "2e770fe762cbf3b024d161605a7ca2e296f22062"}, "author": "Alexandra Svokos", "url": "http://www.huffingtonpost.com/2015/06/07/college-presidents-pay_n_7520982.html?utm_hp_ref=teen&ir=Teen", "ord_in_thread": 0, "title": "68 Public College Presidents Made More Than President Obama In 2014", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nSixty-eight public college presidents and chancellors made more than President Barack Obama in 2014, according to a Huffington Post analysis of The Chronicle of Higher Education's annual report on college heads' compensation. \nThe Chronicle released its annual database of the salaries of public college chief executives Sunday night. The new list shows that two presidents made over $1 million in 2014, and 66 others made more than the Obamas' 2014 income of $495,964. \nHigh salaries for college presidents have been a source of controversy in recent years as students have increasingly taken on large amounts of debt to get a degree. One study last year found a correlation between highly paid presidents at state universities and larger student debt loads . \nPresident Rodney A. Erickson at Pennsylvania State University made a total of $1,494,603 last year, and Texas A&M University President R. Bowen Loftin collected $1,128,957, according to the Chronicle. Erickson and Loftin both left their positions in 2014. \nThat tally of two millionaires -- Erickson and Loftin -- is considerably lower than in 2013 , when nine presidents made over $1 million. Many of those presidents have since left their respective schools. Hamid Shirvani at the North Dakota University System was the third highest paid person on 2013's list when he left the school, and Larry C. Skogen, the current interim chancellor, was compensated $182,520 in 2014. The top-paid president in 2013 was E. Gordon Gee at Ohio State University, who got a $6 million package as he left the school . \nPenn State confirmed to HuffPost that Erickson's compensation includes \"payout due to his retirement from the University after more than 37 years of service.\" He received $125,000 for unused vacation and sick days and $150,000 as a performance bonus approved by the board of trustees. Erickson took over as interim president in 2011 after Graham Spanier was fired following the Penn State child sex abuse scandal. \n\"$1M is too high for a public university,\" Gregory Fenves, incoming president at the University of Texas at Austin, wrote to the school in February of this year, in response to a proposed million-dollar base salary. Fenves chose to take a $750,000 base salary instead -- which is still higher than the Obamas' total income. \nEven leaving bonuses aside, school presidents' pay often represents a huge amount of money. Erickson's 2014 pay is equivalent to the tuition of about 88 students. At the University of South Florida, President Judy L. Genshaft's total compensation of $719,675 is equivalent to the tuition of 112 students. \n1. Penn State University -- Rodney A. Erickson, $1,494,603 \n2. Texas A&M University -- R. Bowen Loftin, $1,128,957 \n3. Ohio State University -- Joseph A. Alutto, $996,169 \n4. Washington State University -- Elson S. Floyd, $877,250 \n5. University of Illinois at Chicago -- Paula Allen-Meares, $872,250 \n6. University of Texas system -- Francisco G. Cigarroa, $864,660 \n7. University of Houston -- Renu Khator, $850,000 \n8. University of Delaware -- Patrick T. Harker, $800,156 \n9. Indiana University at Bloomington -- Michael A. McRobbie, $778,143 \n10. Virginia Tech -- Charles W. Steger, $745,195 \n11. University of Alabama system -- Robert E. Witt, $745,000 \n12. Rutgers University -- Robert L. Barchi, $739,624 \n13. University of South Florida -- Judy L. Genshaft, $719,675 \n14. Texas A&M University system office -- John Sharp, $708,435 \n15. University of Michigan at Ann Arbor -- Mary Sue Coleman, $703,357 \n16. University of Kentucky -- Eli Capilouto, $688,000 \n17. University of Virginia - Teresa A. Sullivan, $674,700 \n18. University of Alabama at Tuscaloosa -- Judy Bonner, $670,000 \n19. University of Massachusetts system -- Robert L. Caret, $666,933 \n20. State University of New York at Stony Brook -- Samuel L. Stanley Jr., $650,000 20. University at Buffalo -- Satish K. Tripathi, $650,000 More:", "external_links": [], "published": "2015-06-08T01:27:00.000+03:00", "crawled": "2015-06-08T01:43:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}