{"organizations": [], "uuid": "9d07cf791d57fd8d14d6c54929bdd62fe5fcf068", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051415_dotcom_obama_640.jpg", "site_section": "http://www.foxnews.com/politics/index.html", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/06/04/obama-struggling-to-sway-dems-on-trade-push-as-unions-crank-up-opposition/", "country": "US", "title": "Obama struggling to sway Dems on trade push, as unions crank up opposition", "performance_score": 2, "site": "foxnews.com", "participants_count": 10, "title_full": "Obama struggling to sway Dems on trade push, as unions crank up opposition | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T03:00:00.000+03:00", "replies_count": 9, "uuid": "7f475d121a48967553efb5924c1c110d770457c1"}, "author": "Kara Rowland", "url": "http://www.foxnews.com/politics/2015/06/04/obama-struggling-to-sway-dems-on-trade-push-as-unions-crank-up-opposition/#post-0", "ord_in_thread": 0, "title": "Obama struggling to sway Dems on trade push, as unions crank up opposition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Kara Rowland\n FoxNews.com livefyre Email Print\nPresident Obama, despite launching a full-court press to woo skeptical Democrats, is struggling to cobble together the votes for his trade agenda in the House -- as union leaders ramp up their own pressure campaign to kill it.\nThe so-called fast-track trade bill -- which would limit Congress' ability to amend future trade deals negotiated by the White House -- cleared the Senate last month with the help of 14 Democratic senators.\nBut the White House faces an even bigger lift in the House, where progressive lawmakers aligned with labor groups are urging their colleagues to oppose the Trade Promotion Authority bill. The issue has flipped the script in Congress, with Republican leaders backing it and rank-and-file Democrats largely opposed. Democratic leaders remain officially undecided, as the president fights for the 218 votes needed to pass.\nHouse GOP leaders have said they are confident they'll be able to push TPA through this month. But even Speaker John Boehner acknowledged this week that supporters are still short of the necessary votes.\n\"I don't think we're quite there yet,\" the Ohio Republican said Wednesday in an interview on Fox News Radio's \"Kilmeade & Friends,\" adding that he expects to see TPA on the floor in the next couple weeks and predicting it will eventually pass.\nWhile Republican leaders expect most of their caucus to vote for fast-track, they stand to lose several dozen votes and are relying on House Democrats to make up the difference.\nMore on this... Rep. Ryan working with Dems to approve Obama trade deal \"The president could have done more over the past couple of years to bring Democrats along, but the unions, frankly, have outflanked him,\" Boehner said.\n\"Fast-track\" is a major priority for the president, who hopes to soon complete work on the Trans-Pacific Partnership, a 12-nation free-trade agreement that would need to be ratified by Congress. Obama has been burning up the phone lines and top administration officials have lobbied Hill Democrats in person during repeated briefings.\nWhile House Democratic Leader Nancy Pelosi remains officially undecided on TPA, she has not whipped her members against the bill.\nBut her members are facing heavy pressure from labor groups, including public criticism by AFL-CIO chief Richard Trumka.\nThe AFL-CIO has been particularly critical of California Democratic Rep. Ami Bera, who has come out in favor of fast-track. The group is running a television ad against the two-term lawmaker, accusing him of being willing \"to do anything to keep his job, including shipping your job overseas.\"\nIn a statement, Trumka said the ad is \"a message to Ami Bera and every other politician that the trade debate is enormously important to working families ... we expect our representatives in Congress to vote against rubber stamping a corporate-driven trade policy that delivers extra profits for global corporations at the expense of good-paying jobs for working people.\"\nThe pressure, though, is starting to stir a backlash among Democrats.\n\"I think labor is going a little overboard,\" Rep. Cedric Richmond, a Louisiana Democrat, told reporters Wednesday. \"The more Trumka talks, the more I lean yes.\"\nHouse Minority Whip Steny Hoyer, D-Md., earlier this week said he and Pelosi have asked \"our friends in labor to have respect for the decisions of members,\" noting that Democratic lawmakers have been strong supporters of workers. The Maryland Democrat has said he is still undecided on the measure.\nAccording to a whip list being maintained by The Hill, 112 House Democrats oppose fast-track, while 60 won't say which way they are voting.\nRep. Jim Himes, a Connecticut Democrat being lobbied by Obama, said the president believes he has the support of 20 House Democrats, according to the Wall Street Journal.\nThe exact number of Democratic votes that will be needed depends on how many Republican defections there are.\nFor their part, GOP criticism of fast-track has involved arguments ranging from an alleged encroachment on legislative power -- TPA would guarantee an up-or-down vote on a free-trade deal with no amendments -- to fears that future deals could include immigration provisions. Republican leaders have done their best to assuage those concerns by stressing that the streamlined negotiating authority lasts six years and will benefit a future administration, not just the current one.\n\"We've got some Republicans that don't trust the president to do anything and don't want to give him any authority at all for anything,\" Boehner told Fox News host Brian Kilmeade. \"This isn't about the president, frankly. This is about the country.\"\nThe business lobby and GOP-aligned political groups are also pitching in to help Boehner and other leaders limit Republican fallout. The American Action Network on Thursday announced a $900,000 ad blitz in favor of TPA.\n\"If we don't pass a bill that allows America more access to trade, then China will have a bigger share of the market and keep rigging international trade,\" the group's president, Mike Shields, said in a statement announcing the campaign. \"It's a question of who you want to lead: the U.S. or China.\"\nCapitol Attitude is a weekly column written by members of the Fox News Capitol Hill team. Their articles take you inside the halls of Congress, and cover the spectrum of policy issues being introduced, debated and voted on there.\nAdvertisement\nTrending in Politics 1 Reps press Kerry on ‘alarming’ violence surrounding US consulates in Mexico 2 Cruz apologizes on Facebook for Biden joke 3 Texas gov poised to roll back 140-year-old open carry gun ban 4 'Deceptive assault': Obama NLRB seeks to gut right-to-work laws, say critics 5 Israeli reporter gives Obama an earful on why there's no room for error on the Iran deal See all Trends Advertisement", "external_links": [], "published": "2015-06-04T03:00:00.000+03:00", "crawled": "2015-06-04T19:45:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}