{"organizations": ["NSA"], "uuid": "98a97812bdede0edb8a55b9c68fab4c92f7d5869", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Obama%20Rousseff%20MLK.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/30/obama-and-brazil-rousseff-look-to-put-nsa-spy-scandal-behind-them-as-talks/", "country": "", "title": "Obama and Brazil's Rousseff try to move past NSA spy scandal, begin talks | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama and Brazil's Rousseff try to move past NSA spy scandal, begin talks | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "98a97812bdede0edb8a55b9c68fab4c92f7d5869"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/30/obama-and-brazil-rousseff-look-to-put-nsa-spy-scandal-behind-them-as-talks/", "ord_in_thread": 0, "title": "Obama and Brazil's Rousseff try to move past NSA spy scandal, begin talks | Fox News Latino", "locations": ["Washington", "Brazil"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dilma Rousseff", "Barack Obama", "Rousseff", "Obama"], "text": "Obama and Brazil's Rousseff try to move past NSA spy scandal, begin talks Published June 30, 2015 Fox News Latino President Barack Obama walks with Brazilian President Dilma Rousseff , second from right, during a visit the Martin Luther King Jr. Memorial in Washington, Monday, June 29, 2015. (AP Photo/Evan Vucci) \nWASHINGTON (AP) – President Barack Obama and Brazilian President Dilma Rousseff will aim to show they have smoothed over tensions sparked by a spying scandal, as they open two days of talks at the White House Monday. \nThe meetings come nearly two years after Rousseff canceled a rare state visit to Washington following revelations that Brazil was a target of American spy programs. The disclosures by former National Security Agency contractor Edward Snowden deeply strained relations between the two hemispheric powers. \nRather than rehash the spying controversy, officials from both countries say the leaders want to delve into talks on trade, investment and climate change. \n\"They are putting behind the Edward Snowden affair,\" said Michael Shifter, president of the Inter-American Dialogue, a Washington think tank. \"The meeting is to create good atmosphere, a good mood, establish communication and get the relationship back on solid footing.\" \nUpon Rousseff's arrival at the White House, Obama took her on a tour to the Martin Luther King Jr. Memorial. Obama described the \"Stone of Hope\" into which King's statue is carved and pointed out some of King's famous quotes along the memorial wall. \nThe leaders reunited Monday evening over a dinner of grilled lamb, spinach salad and coconut banana cake, the White House said. They were to hold more formal talks and a joint news conference on Tuesday. \nThe meeting comes six months before a United Nations-sponsored conference in Paris in December to finalize a climate treaty. Obama has argued that a gradually warming planet could worsen social tensions and political instability worldwide, in addition to harming the U.S. \nCountries are making their positions on climate change clear ahead of the Paris talks. The U.S. already has announced a 2025 deadline to reduce emissions of heat-trapping gases by 26 percent to 28 percent below 2005 levels. \nBrazil, the seventh largest economy, is one of the top emitters that has not presented pollution-control targets. Environment Minister Izabella Teixeira, who is traveling with Rousseff to Washington, has said that developed nations bear more responsibility than the developing world because of their emissions track record. \nBrazil's first female president started her second term in January — Vice President Joe Biden attended her inauguration — but she since has been weighed down by low approval ratings, her country's poor economic performance and a massive corruption scandal involving Petrobras, a state-owned oil company. Tens of thousands of Brazilians filled streets across the country earlier this year to protest her leadership. \nSnowden's disclosures showed that in addition to spying on Rousseff's communications, the NSA had hacked the oil company's computer network. Rousseff served on the company's board but has not been implicated in the scandal. \nWith Brazil bracing for recession, officials are emphasizing the economic agenda for the Obama-Rousseff meeting. The U.S. is Brazil's second-largest trading partner after China, exchanging $62 billion in trade flows. The U.S. announced Monday that it will allow imports of fresh beef from 14 states in Brazil, which the South American nation had long sought. \nCarlos Eduardo de Freitas, an economist and former Central Bank executive director, said the White House meeting may invigorate Brazil as it seeks to reduce government spending to avoid being shunned in credit markets. Rousseff is traveling with 11 cabinet members and met with Brazilian businessmen and U.S. investment fund managers and government officials in New York to discuss infrastructure before arriving in Washington. \n\"The government needs to unshackle its economy,\" Freitas said. \nThe timing of Rousseff's trip was settled months ago; Obama announced it when the two met on the sidelines of a summit in Panama in April. But for Rousseff, being seen warmly received by an American president coming off one of the best weeks of his time in office could help her back home. \nObama rejoiced last week after the nation's highest court upheld a key aspect of his sweeping health care law and granted gay couples the right to marry nationwide. Congress also cleared legislation critical to his ambitious trade agenda, measures that days earlier were given up for dead. \nLike us on Facebook ", "external_links": [], "published": "2015-06-30T03:00:00.000+03:00", "crawled": "2015-06-30T23:17:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}