{"organizations": [], "uuid": "802116ffd764081bef16b6cd099676bab87675b2", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/06/25/obama-interrupcin-casa-blanca-respuesta.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/06/25/estas-en-mi-casa-obama-calla-a-una-mujer-que-lo-interrumpio", "country": "", "title": "“Estás en mi casa”: Obama calla a una mujer que lo interrumpió", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "“Estás en mi casa”: Obama calla a una mujer que lo interrumpió", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T16:50:00.000+03:00", "replies_count": 0, "uuid": "802116ffd764081bef16b6cd099676bab87675b2"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/06/25/estas-en-mi-casa-obama-calla-a-una-mujer-que-lo-interrumpio", "ord_in_thread": 0, "title": "“Estás en mi casa”: Obama calla a una mujer que lo interrumpió", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía “Estás en mi casa”: Obama calla a una mujer que lo interrumpió El presidente de Estados Unidos respondió a la mujer durante un evento en la Casa Blanca y la obligó a retirarse Por Kevin Liptak Jueves, 25 de junio de 2015 a las 08:46 A Obama no le gusta que lo interrumpan en 'su casa'. El presidente contestó molesto a la asistente a un evento de la comunidad LGBTQ (Reuters). Lo más importante Obama increpó a una manifestante que interrumpió su discurso en la Casa Blanca El mandatario suele ser tolerante con quienes lo interrumpen Temas relacionados Obama bromea sobre política en la Casa Blanca \n(CNN) — El presidente de Estados Unidos, Barack Obama, está acostumbrado a los asistentes que interrumpen sus discursos, pero al parecer, hacerlo en la Casa Blanca es algo que no puede tolerar. \nObama ofreció un discurso este miércoles en la Casa Blanca por un evento con motivo del Orgullo LGBT cuando se escuchó una voz al fondo que protestaba por las deportaciones ocurridas durante la actual administración. \n“Debería darte vergüenza”, le dijo Obama. “Escucha, estás en mi casa, no es respetuoso”. \nLa interrupción continúo y entonces Obama pidió al personal de seguridad sacarla del East Room (Sala Este) de la Casa Blanca. \n“Como regla general estoy bien con unos cuantos provocadores, pero no cuando estoy aquí en la casa”, dijo, mientras el vicepresidente Joe Biden le dio una palmada en la espalda. \nObama después dijo que si sus invitados están “comiendo los aperitivos y bebiendo” se espera que lo escuchen con respeto, aseguró. \nPoco después del incidente, un grupo de inmigración dijo que la manifestante era una inmigrante indocumentada de nombre Jennicet Gutiérrez, quien es transgénero. \nLee: Corte federal de EU paraliza acciones migratorias de Obama \nDe acuerdo con un comunicado de prensa, Gutiérrez es una fundadora del grupo FAMILIA TQLM, creado con el objetivo de defender los derechos de los inmigrantes LGBTQ, que el grupo dice son a menudo excluidos del debate migratorio. \nActivistas por una reforma inmigratoria usualmente interrumpen a Obama en sus discursos . Pero las interrupciones son más raras en la Casa Blanca, aunque esta no es la primera. \nEn junio de 2012, cuando Obama anunció cambios en materia de migración, una reportera del sitio Daily Caller lo interrumpió para hacerle una pregunta. El presidente se negó y dijo que no era momento para cuestionamientos. Encuentra este artículo con: obama, discurso, casa blanca, interrupcion, manifestante, calla Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"53e475b1e8db4c7f8b1912834ac1b974\", \"time\": \"2015-06-25T13:55:35.209Z\" } Video ", "external_links": [], "published": "2015-06-25T16:50:00.000+03:00", "crawled": "2015-06-25T16:55:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}