{"organizations": ["Delaware National Guard"], "uuid": "dfaad0581f2e8d39dae3e675b55fae2bc873485d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3041010/images/o-OBAMA-BIDEN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/06/obama-beau-biden-eulogy_n_7525334.html", "country": "", "title": "Obama Delivers Emotional Eulogy For Beau Biden", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Delivers Emotional Eulogy For Beau Biden", "spam_score": 0.0, "site_type": "news", "published": "2015-06-06T20:08:00.000+03:00", "replies_count": 0, "uuid": "dfaad0581f2e8d39dae3e675b55fae2bc873485d"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/06/obama-beau-biden-eulogy_n_7525334.html", "ord_in_thread": 0, "title": "Obama Delivers Emotional Eulogy For Beau Biden", "locations": ["Earth", "Delaware", "Kosovo", "White House", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Beau", "Cheney", "Jeb Bush", "Donald J. Trump", "Kelly Ayotte", "Landra", "Michelle", "Heidi", "Hallie", "Joe", "Jill", "Ashley", "Lindsey Graham", "Hillary Clinton", "Jill Biden", "Jamie", "Beau Biden", "Marc", "William Butler Yeats", "Scott", "Biden", "Laura", "Biden III", "Hunter", "Joe Biden", "Tom Carper", "Joseph", "Liz Cheney", "Obama", "Alex", "James E. Clyburn", "Hillary", "Scott Walker", "Natalie"], "text": "Politicial figures react to death of Beau Biden of   \"It is with broken hearts that Hallie, Hunter, Ashley, Jill and I announce the passing of our husband, brother and son, Beau, after he battled brain cancer with the same integrity, courage and strength he demonstrated every day of his life. The entire Biden family is saddened beyond words. We know that Beau’s spirit will live on in all of us—especially through his brave wife, Hallie, and two remarkable children, Natalie and Hunter. Beau's life was defined by service to others. As a young lawyer, he worked to establish the rule of law in war-torn Kosovo. A major in the Delaware National Guard, he was an Iraq War veteran and was awarded the Bronze Star. As Delaware’s Attorney General, he fought for the powerless and made it his mission to protect children from abuse. More than his professional accomplishments, Beau measured himself as a husband, father, son and brother. His absolute honor made him a role model for our family. Beau embodied my father's saying that a parent knows success when his child turns out better than he did. In the words of the Biden family: Beau Biden was, quite simply, the finest man any of us have ever known.\" (Mark Wilson/Getty Images) \"Michelle and I are grieving tonight. Beau Biden was a friend of ours. His beloved family – Hallie, Natalie, and Hunter – are friends of ours. And Joe and Jill Biden are as good as friends get. Beau took after Joe. He studied the law, like his dad, even choosing the same law school. He chased a life of public service, like his dad, serving in Iraq and as Delaware’s Attorney General. Like his dad, Beau was a good, big-hearted, devoutly Catholic and deeply faithful man, who made a difference in the lives of all he touched – and he lives on in their hearts. But for all that Beau Biden achieved in his life, nothing made him prouder; nothing made him happier; nothing claimed a fuller focus of his love and devotion than his family. Just like his dad. Joe is one of the strongest men we’ve ever known. He’s as strong as they come, and nothing matters to him more than family. It’s one of the things we love about him. And it is a testament to Joe and Jill – to who they are – that Beau lived a life that was full; a life that mattered; a life that reflected their reverence for family. The Bidens have more family than they know. In the Delaware they love. In the Senate Joe reveres. Across this country that he has served for more than forty years. And they have a family right here in the White House, where hundreds of hearts ache tonight – for Hallie, Natalie, and Hunter; for Joe and for Jill; for Beau’s brother, Hunter; his sister, Ashley, and for the entire Biden clan. “I have believed the best of every man,” wrote the poet William Butler Yeats, “And find that to believe it is enough to make a bad man show him at his best or even a good man swing his lantern higher.” Beau Biden believed the best of us all. For him, and for his family, we swing our lanterns higher.\" Michelle and I humbly pray for the good Lord to watch over Beau Biden, and to protect and comfort his family here on Earth. (MANDEL NGAN/AFP/Getty Images) Hillary and I mourn the loss and give thanks for the life of Beau Biden, so full of love, honor and service - and we pray for the strength of his wonderful family. He was a son to be proud of, a brother to cherish, a husband and father to love and be grateful for. The pain of his loss is so great because his life was so large and good. From the entire Cheney family - our deepest sympathy and heartfelt prayers to the @VP Biden family.— Liz Cheney (@Liz_Cheney) May 31, 2015 (Photo by Marc Piscotty/Getty Images) Sad news, my prayers are with @JoeBiden and his family after their loss.— Scott Walker (@ScottWalker) May 31, 2015 (Photo by Scott Olson/Getty Images) Saddened by the news of Beau Biden's passing. My prayers are with The Vice President, Dr. Biden and the whole family.— Jeb Bush (@JebBush) May 31, 2015 (Photo by Laura Segall/Getty Images) Heartbreaking and devastating news about Beau Biden. I hope God will provide the Biden family comfort and healing in the days ahead.— Lindsey Graham (@GrahamBlog) May 31, 2015 (MENAHEM KAHANA/AFP/Getty Images) I'm deeply saddened to hear the news of Beau Biden's passing.My condolences go out to the VP, Dr. Biden & their family.May he rest in peace.— James E. Clyburn (@Clyburn) May 31, 2015 (Photo by Alex Wong/Getty Images) Sending my deepest condolences to the Vice President & his family at this very sad time— Kelly Ayotte (@KellyAyotte) May 31, 2015 AFP PHOTO/NICHOLAS KAMM My heart is breaking for the Biden family. Beau represented all that is good about Delaware and our country. I will miss him greatly.— Senator Tom Carper (@SenatorCarper) May 31, 2015 MANDEL NGAN/AFP/Getty Images My heart is broken for the family of Beau Biden—a wonderful man who served his country with devotion and lived his life with courage. -H— Hillary Clinton (@HillaryClinton) May 31, 2015 (Photo by Scott Olson/Getty Images) I would like to offer Vice President Biden my warmest condolences on the loss of his wonderful son, Beau. Met him once, great guy!— Donald J. Trump (@realDonaldTrump) May 31, 2015 (Photo by Jamie McCarthy/Getty Images) “Beau Biden was a wonderful, strong and courageous man. I met him many times and thought the world of him. His life was so rich and it is unspeakably sad to see him leave us far too soon. Beau’s dedication to public service was deep, broad and profound. He embodied the best and most noble traits that his parents sought to instill in him. I know Joe is very proud and he should be proud because Beau was simply a joy to know. Beau’s wife, Hallie, and children, Natalie and Hunter, have lost a husband and father who was truly one of the good ones and they will be in our loving thoughts as they move through this difficult time. “Joe and Jill are dear friends of mine and I can only imagine what they and their family are going through. Landra and I convey our deepest condolences to them and their entire family in this tragic time.” (Photo by Chip Somodevilla/Getty Images) Yesterday Joseph 'Beau' Biden III, a long-time public servant, Iraq War veteran, and the son of Vice President Joe Biden, passed away after a hard-fought battle with brain cancer. Heidi and I were saddened by the news of the loss of Beau, a dedicated husband and father, and a man that so many admired. He tirelessly worked to serve his country. As the parents of two precious little girls, Heidi and I can only imagine the grief of losing a child -- something no parent should have to do. We would like to extend our deepest sympathies and our prayers to Joe and Jill, the entire Biden family, and all those who knew and loved Beau.  Share ", "external_links": [], "published": "2015-06-06T20:08:00.000+03:00", "crawled": "2015-06-06T20:08:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}