{"organizations": ["European Council", "European Union", "Internet Corporation for Assigned Names and Numbers", "House Energy and Commerce Committee", "ICANN", "Department of Commerce"], "uuid": "dcb47faf1e43dbd794c53c48ec451d0b7bcee12c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051915getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/technology/244970-european-countries-back-obama-admins-domain-transition", "country": "", "title": "European countries back Obama administration's domain transition | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "European countries back Obama administration's domain transition | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "dcb47faf1e43dbd794c53c48ec451d0b7bcee12c"}, "author": "", "url": "http://thehill.com/policy/technology/244970-european-countries-back-obama-admins-domain-transition", "ord_in_thread": 0, "title": "European countries back Obama administration's domain transition | TheHill", "locations": ["America", "Capitol Hill"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David McCabe", "Obama"], "text": "European countries back Obama administration's domain transition By David McCabe - 06/15/15 09:38 AM EDT The European Council has backed an Obama administration plan to loosen America’s grip on the system that governs Internet domain names. The Council, which helps articulate the policy agenda of the European Union and represents 28 governments, said in a statement on Friday that it supported the transfer being done “in a way that does not expose this function to capture by narrow commercial or government interests.” ADVERTISEMENT Under the proposal, the Department of Commerce would no longer oversee the Internet Corporation for Assigned Names and Numbers (ICANN). Instead, ICANN would be linked to a group of multinational stakeholders. Republicans on Capitol Hill have said they are worried the organization isn’t ready for the transfer. On Wednesday, the House Energy and Commerce Committee will vote on a bill to give them more oversight over the transfer. \nThough ICANN’s current contract with the Department of Commerce is set to expire in September, even supporters of the transfer acknowledge it is possible that it will take longer to complete. “The Council invites the global multi-stakeholder community to make further progress in the development of the transition process and efforts to retain the Internet as a single, open, neutral, free, and un-fragmented network,” the European Council said in its statement. “At the same time, the Council notes that any unjustified delay of this process could negatively impact Internet governance debates worldwide.” \nFadi Chehadé, the CEO of ICANN, said earlier this month that the transition remains on the right track. \"I'm never comfortable, but I am optimistic, and I believe that all interests are now aligned. ... Everybody sees that this makes sense,” he said, according to Reuters. Tags: Share on Facebook Get TheHill's free daily Technology email \nFrom Hillicon Valley Team the overnight email is a round-up of the day's top technology stories delivered every weekday morning. Past: 1 day Two states win approval for... Move sends a signal to dozens of states preparing for a high-stakes court... Scalia slips, refers to Justice '... The conservative justice had a slip of the tongue in court Monday. California lawmakers don't want a... Rep. Eric Swalwell tweeted that he hopes Golden State win the championship... Senator: 'Breathtaking' how far... Sen. Bob Corker is urging Obama to walk away from a \"bad deal.\" Poll finds Sanders closing in on... Sanders trails Clinton by 12 percentage points in a new online poll of... Gun groups denounce push for... The NRA slammed a Democratic bill as an attack on the Constitution. Widespread and systemic... Under pressure from the industry, the EPA began severely limiting the... Fiorina, Clinton top 2016 rich... The presidential contenders, ranked by personal wealth. Sanders wants details on DOD... The Vermont senator and presidential candidate wants an annual update from... Clinton calls for fixes to... She also said the Supreme Court should uphold the law's subsidies. House punts on trade The GOP-led House might not vote again until the end of July. Obama making bid to diversify... Rules in the works are drawing fire from critics who cry overreach. Clinton: 'Collective amnesia'... Clinton praised former President Clinton and President Obama in an... NAACP leader who lied about being... Rachel Dolezal said in a statement that the dialogue has shifted to her \"... White House defends private Prince... The Obamas paid for the concert themselves, a spokesman says. Feds eye small nuclear reactors... Federal officials are preparing for a future in which small nuclear... CIA releases secret report... The report claims to identify blind spots at intelligence agencies before... Judd Gregg: GOP must avoid... OPINION: A conservative win at the Supreme Court would place the GOP in a... ", "external_links": [], "published": "2015-06-16T03:00:00.000+03:00", "crawled": "2015-06-17T00:10:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}