{"organizations": [], "uuid": "2cd55d6b47501c432331a2aa564d53be72c52173", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/06/26/obama-funeral-charleston.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/06/26/charleston-un-motivo-para-hablar-sobre-el-control-de-armas-en-eu-obama", "country": "", "title": "Charleston, un motivo para hablar sobre el control de armas en EU: Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Charleston, un motivo para hablar sobre el control de armas en EU: Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "2cd55d6b47501c432331a2aa564d53be72c52173"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/06/26/charleston-un-motivo-para-hablar-sobre-el-control-de-armas-en-eu-obama", "ord_in_thread": 0, "title": "Charleston, un motivo para hablar sobre el control de armas en EU: Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Charleston, un motivo para hablar sobre el control de armas en EU: Obama El presidente estadounidense participó en el funeral del reverendo Clementa Pinckney, una de las nueve víctimas del ataque en Charleston Viernes, 26 de junio de 2015 a las 16:04 Obama canta con la comunidad de Charleston Lo más importante Barack Obama participó en el funeral de una de las víctimas de la masacre de Charleston El mandatario señaló que el ataque abre la discusión sobre el control de armas y símbolos de supremacia como la bandera Confederada Temas relacionados Ira, tristeza y desconcierto: el luto en Charleston Obama habló este viernes ante una emocionada congregación (Getty Images). \n(CNN) — Para el presidente estadounidense Barack Obama, la masacre en Charleston, Carolina del Sur, debería dar pie a tomar acciones acerca del control de armas . \nMientras daba una elegía para el reverendo Clementa Pinckney , una de las nueve víctimas en el ataque en la iglesia de Charleston, el mandatario afirmó que “ninguno de nosotros debería creer que un puñado de medidas de seguridad en las armas va a prevenir cada tragedia de armas. No lo hará”. \n“Creo que sería una traición de todo lo que el reverendo Pinckney representaba si nos permitiéramos a nosotros mismos resbalar en un cómodo silencio nuevamente”, dijo ante una iglesia repleta de devotos. \nAdemás de hablar acerca de cada una de las víctimas, y especialmente del reverendo, a quien se refirió como “un hombre de Dios que vivía con fe”, el presidente habló de temas raciales que afectan a su nación. Al servicio también asistieron la primera dama Michelle Obama, el vicepresidente Joe Biden, diversos miembros del Congreso y Hillary Clinton. \nObama se expresó acerca de otro de los temas controversiales tras la masacre, como la bandera Confederada, el símbolo de una parte de EU que abogó por la continuación de la esclavitud . \n“Al quitar esa bandera, expresamos la gracia de Dios”, dijo. \nObama terminó su discurso cantando la canción Amazing Grace , a la que se unió la congregación. Encuentra este artículo con: barack obama, charleston, control de armas, masacre Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"8a2600556c89421a8888dfa2a2d7532e\", \"time\": \"2015-06-27T14:05:45.254Z\" } Video ", "external_links": [], "published": "2015-06-26T03:00:00.000+03:00", "crawled": "2015-06-27T17:05:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}