{"organizations": [], "uuid": "6df240ee286c546969f2f412585aa57199cf54c7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/cottontom_020515gn.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/246424-gop-senator-urges-obama-to-be-strong-on-iran-nuclear-talks", "country": "US", "title": "Cotton to Obama: 'Be strong' on Iran nuke talks", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Cotton to Obama: 'Be strong' on Iran nuke talks", "spam_score": 0.0, "site_type": "news", "published": "2015-06-29T17:46:00.000+03:00", "replies_count": 0, "uuid": "6df240ee286c546969f2f412585aa57199cf54c7"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/246424-gop-senator-urges-obama-to-be-strong-on-iran-nuclear-talks", "ord_in_thread": 0, "title": "Cotton to Obama: 'Be strong' on Iran nuke talks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cotton to Obama: 'Be strong' on Iran nuke talks Getty Images By Kristina Wong - 06/29/15 10:46 AM EDT Sen. Tom Cotton (R-Ark.), the author of a controversial GOP letter to Iran's leaders over nuclear negotiations, urged President Obama on Monday to \"be strong\" and extend the talks beyond a Tuesday deadline until demands are met. \"What the ayatollahs respect is strength. And this is a moment — perhaps more than any other time of his presidency — for President Obama to be strong,\" Cotton, a member of the Senate Armed Services Committee, said in a Washington Examiner op-ed. \"He should continue talks past tomorrow's artificial deadline for however long it takes to eliminate Iran's nuclear weapons capability,\" Cotton added. ADVERTISEMENT \"That would be a strategic gain for which lifting sanctions would be justified. Failing that, the president should cite Iranian intransigence, break off talks, reinstate the full spectrum of economic sanctions and fortify the credible threat of military force,\" he added. Cotton's op-ed adds to the growing number of Republican voices who are weighing in on the pending deal in advance of the deadline. U.S. officials acknowledged on Sunday that international talks with Iran would extend past their self-imposed deadline of June 30. However, the administration is still aiming to meet a July 9 deadline imposed by Congress to submit the text of any agreement for review. If the deal is submitted before July 9, Congress would have only 30 days to review it. If after, Congress would have 60 days, giving it more time to act and possibly build opposition to the deal. Cotton said the pending accord would not deny Iran nuclear weapons capability and would allow Tehran to maintain significant nuclear infrastructure, continue to research advanced centrifuge technology and shorten the time for nuclear breakout. \"But it is not too late to reverse course. President Obama has said on numerous occasions that no deal is better than a bad deal. And make no mistake: The deal currently envisioned is a bad deal,\" Cotton said. Cotton also referenced an open letter signed by 18 experts, including five of Obama's former senior advisers, that was published last week arguing for a stronger deal. \"That is not only my opinion. A consensus is building among national security experts — including former inner-circle advisers to President Obama on Iran — that the pending accord gives away the store to the Iranians,\" Cotton wrote. It is not clear whether the deal would meet Cotton's demands, but even if Republicans vote to kill the deal, Congress would need a veto-proof majority in both chambers in order to scuttle it — a high hurdle that would require a number of Democrats to side against the administration. Cotton and 46 other GOP senators drew condemnation from the White House in March when they sent a letter to Iran's leaders warning that Congress or future presidents could undo any bargain struck over Iran's nuclear program. Tags:", "external_links": [], "published": "2015-06-29T17:46:00.000+03:00", "crawled": "2015-06-30T00:42:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}