{"organizations": [], "uuid": "907e25fe17a9707f155dac34cce5d7640afef62f", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/06/politics/beau-biden-funeral/index.html", "country": "", "title": "Obama leads mourners at Beau Biden's funeral - CNNPolitics.com", "performance_score": 4, "site": "cnn.com", "participants_count": 0, "title_full": "Obama leads mourners at Beau Biden's funeral - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-06T18:35:00.000+03:00", "replies_count": 0, "uuid": "907e25fe17a9707f155dac34cce5d7640afef62f"}, "author": "", "url": "http://www.cnn.com/2015/06/06/politics/beau-biden-funeral/index.html", "ord_in_thread": 0, "title": "Obama leads mourners at Beau Biden's funeral - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Obama leads mourners at Beau Biden's funeral Updated 1624 GMT (2324 HKT) June 6, 2015 JUST WATCHED Beau Biden: Dad 'most loyal person' Wilmington, Delaware (CNN) President Barack Obama is leading hundreds of mourners paying solemn tribute to Beau Biden, a beloved son of Delaware and the eldest child of grief-stricken Vice President Joe Biden, who died last week of brain cancer at only 46. Obama, who will deliver a eulogy, arrived with his family to support Biden as he copes with the latest tragedy to strike his family, at a Roman Catholic funeral mass at St. Anthony of Padua Church, in the \"Little Italy\" section of Wilmington, where the Biden family has frequently worshiped. Beau Biden mourned 6 photos Beau Biden mourned 6 photos Vice President Joe Biden rests his head in his hand during a viewing for his late son, former Delaware Attorney General Beau Biden, on Thursday, June 4. Beau Biden died of brain cancer May 30 at the age of 46. Standing with the vice president, from right, is his wife, Jill, and Beau Biden's immediate family: daughter Natalie, wife Hallie and son Hunter. Hide Caption Beau Biden mourned 6 photos An honor guard carries Biden's casket out of Legislative Hall in Dover, Delaware. Hide Caption Beau Biden mourned 6 photos Joe Biden pauses with his family as they enter the visitation. Hide Caption 3 of 6 Beau Biden mourned 6 photos Natalie Biden, center, is comforted by her grandfather and her mother as they follow the honor guard carrying the casket. Hide Caption Beau Biden mourned 6 photos Biden hugs a woman while waiting in line to view his son's body. Hide Caption Beau Biden mourned 6 photos Biden rests his hand on the flag-draped casket. Hide Caption 6 of 6 EXPAND GALLERY Beau Biden's funeral cortege arrived at the church heralded by a pipe band. The vice president, wearing dark glasses, and the rest of his family, all looking bereft, formed up behind the hearse. Biden occasionally whispered in the ear of Beau's widow Hallie, and comforted his son's two children, Natalie and Hunter. The casket, covered in an American flag, was removed and carried gently into the church with full military honors, reflecting Beau's service as a captain in the Army National Guard in Iraq. Earlier, Obama, first lady Michelle Obama, daughters Sasha and Malia and his mother-in-law Marian Robinson, all dressed in black, left the White House, where the American flag stood at half-staff to honor Beau Biden. The first person in line for the service arrived at 4:30 a.m., and by breakfast time, the line of mourners stretched around the block of the St. Anthony of Padua Church, in the \"Little Italy\" section of Wilmington, where the Bidens have frequently worshipped. Obama's eulogy will be both a show of respect for Beau Biden, the former Delaware attorney general, with whom he had a personal relationship and a sign of the deep bond that has grown up between the president and his deputy. JUST WATCHED ", "external_links": [], "published": "2015-06-06T18:35:00.000+03:00", "crawled": "2015-06-06T18:35:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}