{"organizations": ["Facebook", "Fox News Obama", "Twitter", "Supreme Court"], "uuid": "08d31abfd35590d1dffd0f9b300499c494733856", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/060715_smf_obamairaq_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/06/08/obama-says-supreme-court-should-never-have-taken-up-health-law-case-in-blunt/", "country": "", "title": "Obama says Supreme Court should never have taken up health law case, in blunt challenge | Fox News", "performance_score": 10, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama says Supreme Court should never have taken up health law case, in blunt challenge | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T18:36:00.000+03:00", "replies_count": 0, "uuid": "08d31abfd35590d1dffd0f9b300499c494733856"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/08/obama-says-supreme-court-should-never-have-taken-up-health-law-case-in-blunt/", "ord_in_thread": 0, "title": "Obama says Supreme Court should never have taken up health law case, in blunt challenge | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama says Supreme Court should never have taken up health law case, in blunt challenge Published June 08, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama on Monday bluntly challenged the Supreme Court over a pending ruling on the validity of ObamaCare subsidies, saying the court shouldn't even have taken up the case -- and warning that a decision striking down subsidies would be a \"twisted interpretation\" of the law. \nThe president and his administration's legal team for months have fought the Affordable Care Act court challenge, which is over whether people who enrolled through the federal HealthCare.gov are entitled to subsidies. \nBut the president's comments on Monday, during a press conference on the sidelines of the G-7 summit in Germany, were perhaps his toughest to date. He strongly suggested the court would be running afoul of established legal guidance if it rules against the administration, and took the rare step of saying the court should have stayed out of this fight. \n\"This should be an easy case. Frankly, it probably shouldn't even have been taken up,\" Obama said. \nThe administration has argued in court that the subsidies are valid through both state-run exchanges and exchanges run through HealthCare.gov. Foes argue that the Affordable Care Act stipulates subsidies are only intended for those buying insurance on state-run exchanges. \nThe court decision, expected any day, could have far-reaching implications because millions would lose their insurance if the court rules against the administration. \nYet the Obama administration has faced criticism for declining the spell out what its contingency plan is if the court rules that way, instead voicing confidence that the Supreme Court will keep the program as is. \nObama again voiced that confidence on Monday, and urged the court not to rule otherwise. \nHe said it's safe to \"assume\" the court will do what most legal scholars expect and \"play it straight.\" Obama said it has been well-documented that Congress never intended to exclude people who went through the federal exchange. \nTo rule the other way, the president said, would be a \"contorted reading of the statute\" and a \"twisted interpretation.\" \nBut if that does happen, Obama said, \"that throws off how that exchange operates\" and millions of people would lose subsidies. \n\"It's a bad idea,\" Obama said. \nThe president went on to mount a robust defense of the law itself, saying \"none\" of the alleged \"horrors\" associated with ObamaCare have \"come to pass.\" \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-06-08T18:36:00.000+03:00", "crawled": "2015-06-08T19:13:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}