{"organizations": [], "uuid": "841e6e4a65d28acb3df6018c3060168542584977", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3042830/images/o-OBAMA-KRUEN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/06/08/obama-bebe-cerveza-alemania_n_7530840.html", "country": "", "title": "Obama bebe cerveza en Alemania: ¡Salud!", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama bebe cerveza en Alemania: ¡Salud!", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T16:41:00.000+03:00", "replies_count": 0, "uuid": "841e6e4a65d28acb3df6018c3060168542584977"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/06/08/obama-bebe-cerveza-alemania_n_7530840.html", "ord_in_thread": 0, "title": "Obama bebe cerveza en Alemania: ¡Salud!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "  El Presidente Obama es conocido por su apoyo a la limitación de la contaminación, a medidas que limiten el calentamiento global causado por emisiones de gases en la atmósfera. a la protección de nuestros suelos y el agua. FILE - In this July 16, 2012 file photo, President Barack Obama sips his beer as he watches Team USA and Brazil during the first half of an Olympic men's exhibition basketball game, in Washington. Obama and his team frequently talk about the president's fondness for beer, and Obama has been photographed many times downing a beer, including an appearance at the Iowa State Fair last month. Being identified as a beer drinker is an easy way for Obama to connect with votes and serves as a not-so-subtle reminder that his Republican rival Mitt Romney, a Mormon, doesn't drink. (AP Photo/Alex Brandon, File) También es conocido por su amor a la cerveza y por el hecho de que en la misma Casa Blanca ha establecido una microcervecería para gozar de lo mejor de esta “bebida alcohólica hecha con granos germinados de cebada u otros cereales fermentados en agua, y aromatizada con lúpulo” como la define la Real Academia Española. US Democratic presidential candidate Illinois Senator Barack Obama toasts before sampling local beer during a visit to the Bethlehem Brew Works while on a tour of Bethlehem, Pennsylvania, on April 20, 2008. Pennsylvania will hold its primary vote on April 22. AFP PHOTO/Emmanuel DUNAND (Photo credit should read EMMANUEL DUNAND/AFP/Getty Images) Recientemente el Presidente, a pedido del público, dio a conocer la receta secreta de la cerveza \"Casa Blanca\". President Barack Obama pulls out a bottle of beer as he delivers a case of White House brewed beer to the fire fighters at Fire Station No. 14, during an unscheduled stop, Tuesday, Sept. 4, 2012, in Norfolk, Va. (AP Photo/Pablo Martinez Monsivais) Pero hay más. El sitio Outside Online, de aventuras al aire libre, nos recuerda que “la cerveza es 90 por ciento agua... lleva cinco galones de agua producir un galón de cerveza”. US President Barack Obama (R) and First Lady Michelle Obama (L) sip Guinness at a pub as they visit Moneygall village in rural County Offaly, Ireland, where his great-great-great grandfather Falmouth Kearney hailed from, on May 23, 2011. Obama landed in Ireland on May 23, 2011 for a visit celebrating his ancestral roots, kicking off a four-nation European tour. AFP PHOTO/ POOL/ MAXWELL'S (Photo credit should read -/AFP/Getty Images) Por lo tanto, el Concilio para la Defensa de los Recursos Naturales (NRDC) inició su campaña “Destiladores por Agua Limpia” en la que reclutaron a una veintena de empresas cerveceras que se comprometieron a hacer que sus operaciones sean más eficientes y gasten menos cantidades del líquido universal, ya que \"agua limpia es esencial más que para una cerveza de gran sabor. Es crítica para la salud pública y para la salud de una amplia gama de industrias\". MONEYGALL, IRELAND - MAY 23: US President Barack Obama enjoys a glass of Guinness in his ancestral home of Moneygall, on May 23, 2011 in Moneygall, Ireland. U.S. President Obama is visiting Ireland for one day at the start of a week long tour of Europe. He will meet with distant relatives in Moneygall and speak at a rally in central Dublin after a concert. (Photo by Irish Government - Pool/Getty Images) Se trata, dice la nota, de revertir una interpretación de la Suprema Corte de 1996 a la ley de Aguas Limpias, que limita la prohibición de arrojar químicos contaminantes a vías de agua “navegables” y no a todas. Esta decisión llevó a que se arrojen deshechos a arroyos o humedales que puedan ser fuentes de agua potable. President Barack Obama has a beer with Mike Cunningham II, left, and another worker at the beer stand during a visit to the Iowa State Fair, Monday, Aug. 13, 2012, in Des Moines, Iowa. The president is on a three-day campaign bus tour through Iowa. (AP Photo/Carolyn Kaster) Las cerveceras necesitan que esas aguas permanezcan limpias de contaminantes. Muchas de ellas están basadas en la zona de los Grandes Lagos (estados de Michigan, Wisconsin, Illinois), que “están sufriendo de niveles bajos récord en su nivel de agua” porque además de todo, al calentarse las aguas, se evaporan más. WASHINGTON, DC - JULY 16: President Barack Obama drinks a beer as he sits with his wife Michelle, daughter Malia, and Vice President Joe Biden, as the US Senior Men's National Team and Brazil play during a pre-Olympic exhibition basketball game at the Verizon Center on July 16, 2012 in Washington, DC. (Photo by Patrick Smith/Getty Images) De acuerdo con NBC News, estos lagos contienen el 20 por ciento de las aguas potables en todo el planeta. President Barack Obama stops to drink his beer as he greets patrons during an unschedule stop at Gator's Dockside, Saturday, Sept. 8, 2012, in Orlando, Fla. (AP Photo/Pablo Martinez Monsivais) Queda por ver si Obama actuará enérgicamente - como productor y consumidor serio de cerveza - en este ámbito. Porque, como se puede ver en las siguientes imágenes, asiduo consumidor y amante de la bebida amarga y alegre, lo es. US President Barack Obama reacts after tasting a Guinness at a pub as he visits Moneygall village in rural County Offaly, Ireland, where his great-great-great grandfather Falmouth Kearney hailed from, on May 23, 2011. Obama landed in Ireland on May 23, 2011 for a visit celebrating his ancestral roots, kicking off a four-nation European tour. AFP PHOTO/ POOL/ MAXWELL'S (Photo credit should read -/AFP/Getty Images) A propósito, la principal ley que mantiene nuestras aguas potables, potables, es la Clean Water Act de 1972 (cuyo alcance cercenó la Suprema Corte en 1996). El entonces presidente republicano Richard Nixon la vetó, pero el Congreso, dominado por los demócratas en esos días, sobreseyó el veto y se la impuso. President Barack Obama holds up a beer stein that he received from U.S. Navy Ensign John-Rex Spivey, president of the U.S. Naval Academy's class of 2013, during the Academy's graduation and commissioning ceremonies, Friday, May 24, 2013, in Annapolis, Md. The president urged new graduates to exhibit honor and courage in tackling incidents of sexual assault as they assume leadership positions in the military. (AP Photo/Pablo Martinez Monsivais) US President Barack Obama (C) shares a beer with customers at the Common Man restaurant in Merrimack, New Hampshire, on October 27, 2012. AFP PHOTO/Jim WATSON (Photo credit should read JIM WATSON/AFP/Getty Images) RALEIGH, NC - MAY 6: Democratic presidential hopeful Sen. Barack Obama (D-IL) (R) has a beer with patrons at the Raleigh Times Bar May 6, 2008 in Raleigh, North Carolina. Sen. Hillary Clinton (D-NY) and Sen. Barack Obama (D-IL) are each hoping to win the primaries today in North Carolina and Indiana as the Democrats battle for their party's presidential nomination before the National Convention in August. (Photo by Mark Wilson/Getty Images) Democratic presidential candidate US Senator Barack Obama grabs a beer while meeting with local residents at Raleigh Times bar in Raleigh, North Carolina, May 06, 2008. Voters in North Carolina and Indiana weighed in on the fates of Barack Obama and Hillary Clinton in the most significant contests left in their presidential showdown. AFP PHOTO/Emmanuel Dunand (Photo credit should read EMMANUEL DUNAND/AFP/Getty Images) US President Barack Obama (R) and First Lady Michelle Obama (L) sip Guinness at a pub as they visit Moneygall village in rural County Offaly, Ireland, where his great-great-great grandfather Falmouth Kearney hailed from, on May 23, 2011. Obama landed in Ireland on May 23, 2011 for a visit celebrating his ancestral roots, kicking off a four-nation European tour. AFP PHOTO/ JEWEL SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) President Barack Obama talks with patrons as he stops for a beer at Ziggy's Pub and Restaurant in Amherst, Ohio, Thursday, July 5, 2012. Obama is on a two-day bus trip through Ohio and Pennsylvania. At right is former Ohio Gov. Ted Strickland. (AP Photo/Susan Walsh) President Barack Obama raise his glass of beer as he joins in a toast with local patrons during an unscheduled visit to the Common Man Restaurant, Saturday, Oct. 27, 2012 in Merrimack, N.H. (AP Photo/Pablo Martinez Monsivais) ARCHIVO - En esta imagen del 14 de agosto de 2012, el presidente de Estados Unidos Barack Obama se detiene para beber una cerveza en The Pump House, un restaurante bar en Cedar Falls, Iowa. La Casa Blanca reveló el sábado 1 de septiembre la receta de las dos cervezas de fabricación casera favoritas de Obama. (Foto AP/Carolyn Kaster, archivo) President Barack Obama reaches for his beer from the bar as he greets local patrons during an unscheduled visit to the Common Man Merrimack restaurant, Saturday, Oct. 27, 2012 in Merrimack, NH. (AP Photo/Pablo Martinez Monsivais) President Barack Obama takes a sip of his beer while greeting local patrons during an unscheduled visit to the Common Man Merrimack restaurant, Saturday, Oct. 27, 2012 in Merrimack, N.H. (AP Photo/Pablo Martinez Monsivais) US President Barack Obama holds a bottle of ale as he presents a case of White House brew to firefighters during an unannounced stop at Fire Station No. 14 September 4, 2012 in Norfolk, Virginia. AFP PHOTO/Mandel NGAN (Photo credit should read MANDEL NGAN/AFP/GettyImages) FILE - In this July 30, 2009 file photo, President Barack Obama and Vice President Joe Biden have a beer with Harvard scholar Henry Louis Gates Jr., second from left, and Cambridge, Mass., police Sgt. James Crowley in the Rose Garden of the White House in Washington. Obama and his team frequently talk about the president's fondness for beer, and Obama has been photographed many times downing a beer, including an appearance at the Iowa State Fair last month. Being identified as a beer drinker is an easy way for Obama to connect with votes and serves as a not-so-subtle reminder that his Republican rival Mitt Romney, a Mormon, doesn't drink. (AP Photo/Alex Brandon, File) President Barack Obama stops for a beer at The Pump House, a pub and grill, Tuesday, Aug. 14, 2012, in Cedar Falls, Iowa, during a three day campaign bus tour through Iowa. (AP Photo/Carolyn Kaster) FILE - In this July 5, 2012 file photo, President Barack Obama has a beer as he talks with patrons as he stops for a beer at Ziggy's Pub and Restaurant in Amherst, Ohio. Obama and his team frequently talk about the president's fondness for beer, and Obama has been photographed many times downing a beer, including an appearance at the Iowa State Fair last month. Being identified as a beer drinker is an easy way for Obama to connect with votes and serves as a not-so-subtle reminder that his Republican rival Mitt Romney, a Mormon, doesn't drink. (AP Photo/Susan Walsh, File) President Barack Obama greets workers as he orders a beer at the beer stand at the Iowa State Fair, Monday, Aug. 13, 2012, in Des Moines, Iowa, as Agriculture Secretary Tom Vilsack looks on at left. The president is on a three-day campaign bus tour through Iowa. (AP Photo/Carolyn Kaster) President Barack Obama greets workers as he orders a beer at the beer stand at the Iowa State Fair, Monday, Aug. 13, 2012, in Des Moines, Iowa. The president is on a three-day campaign bus tour through Iowa. (AP Photo/Carolyn Kaster) US President Barack Obama (C) and First Lady Michelle Obama (L) wait to get their glasses of Guinness in a pub as they visit Moneygall village in rural County Offaly, Ireland, where his great-great-great grandfather Falmouth Kearney hailed from, on May 23, 2011. Obama landed in Ireland on May 23, 2011 for a visit celebrating his ancestral roots, kicking off a four-nation European tour. AFP PHOTO/ JEWEL SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) People wave and offer free beer for US President Barack Obama as his motorcade arrives at the Fox Theatre in Oakland, California, on July 23, 2012 for a campaign event. AFP PHOTO / Saul LOEB (Photo credit should read SAUL LOEB/AFP/GettyImages) US President Barack Obama (L) rises his glass of Guinness in a pub as he visits Moneygall village in rural County Offaly, Ireland, where his great-great-great grandfather Falmouth Kearney hailed from, on May 23, 2011. Obama landed in Ireland on May 23, 2011 for a visit celebrating his ancestral roots, kicking off a four-nation European tour. AFP PHOTO/ JEWEL SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) US President Barack Obama (L) reacts after tasting Guinness in a pub as he visits Moneygall village in rural County Offaly, Ireland, where his great-great-great grandfather Falmouth Kearney hailed from, on May 23, 2011. Obama landed in Ireland on May 23, 2011 for a visit celebrating his ancestral roots, kicking off a four-nation European tour. AFP PHOTO/ JEWEL SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) US President Barack Obama (2ndL) and First Lady Michelle Obama (L) sip Guinness at a pub as they visit Moneygall village in rural County Offaly, Ireland, where his great-great-great grandfather Falmouth Kearney hailed from, on May 23, 2011. Obama landed in Ireland on May 23, 2011 for a visit celebrating his ancestral roots, kicking off a four-nation European tour. AFP PHOTO/ JEWEL SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) US President Barack Obama holds a bottle of beer to settle a bet on the US-England World Cup soccer game with British Prime Minister David Cameron during a meeting on the sidelines of the G20 Summit in Toronto on June 26, 2010. Obama gave Cameron a case of 312 Beer and Cameron gave Obama a case of Hobgoblin. AFP PHOTO/Saul LOEB (Photo credit should read SAUL LOEB/AFP/Getty Images) US President Barack Obama and British Prime Minister David Cameron trade bottles of beer to settle a bet on the US-UK World Cup Soccer game during a meeting on the sidelines of the G20 Summit in Toronto on June 26, 2010. AFP PHOTO/Saul LOEB/Pool (Photo credit should read SAUL LOEB/AFP/Getty Images) Democratic presidential candidate US Senator Barack Obama offers a toast while meeting with local residents at Raleigh Times bar in Raleigh, North Carolina, May 06, 2008. Voters in North Carolina and Indiana weighed in on the fates of Barack Obama and Hillary Clinton in the most significant contests left in their presidential showdown. AFP PHOTO/Emmanuel Dunand (Photo credit should read EMMANUEL DUNAND/AFP/Getty Images) BETHLEHEM, PA - APRIL 20: Democratic presidential candidate Senator Barack Obama (D-IL) (C) toasts a beer with Cheryl Bauer (L) and Peg Fegley and others at the Bethlehem Brew Works April 20, 2008 in Bethlehem. Pennsylvania. Voters in Pennsylvania go to the polls April 22. (Photo by Scott Olson/Getty Images) BETHLEHEM, PA - APRIL 20: Democratic presidential candidate Senator Barack Obama (D-IL) (C) drinks a beer with Cheryl Bauer (L) and Peg Fegley at the Bethlehem Brew Works April 20, 2008 in Bethlehem. Pennsylvania. Voters in Pennsylvania go to the polls April 22. (Photo by Scott Olson/Getty Images)  Compartir ", "external_links": [], "published": "2015-06-08T16:41:00.000+03:00", "crawled": "2015-06-08T16:45:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}