{"organizations": [], "uuid": "b817763de232128dee04d0dced6e5bd6b5ce7b6e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamahurricane.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/244439-obama-launches-34m-climate-effort-for-poor-countries", "country": "US", "title": "Obama launches $34M climate effort for poor countries", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama launches $34M climate effort for poor countries", "spam_score": 0.0, "site_type": "news", "published": "2015-06-09T22:10:00.000+03:00", "replies_count": 0, "uuid": "b817763de232128dee04d0dced6e5bd6b5ce7b6e"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/244439-obama-launches-34m-climate-effort-for-poor-countries", "ord_in_thread": 0, "title": "Obama launches $34M climate effort for poor countries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama launches $34M climate effort for poor countries Getty Images By Timothy Cama - 06/09/15 03:10 PM EDT \nThe Obama administration launched a $34 million public-private effort to help developing nations prepare for the effects of climate change. \nThe partnership “will provide needed climate services — including actionable science, data, information, tools, and training — to developing countries that are working to strengthen their national resilience to the impacts of climate change,” the White House said in a fact sheet. ADVERTISEMENT The announcement follows up on a pledge President Obama made last year at a United Nations summit on climate change.\nPoor countries have long maintained that richer countries with more economic development should shoulder most of the burden of cutting greenhouse gases to fight climate change. The poorer countries, meanwhile, bear much of the brunt of the effects of a warming planet. \nAlong with the United States government, the program involves the American Red Cross, the Asian Development Bank, Esri, Google Inc., the Inter-American Development Bank, the Skoll Global Threats Fund, and the government of the United Kingdom. \nThe White House said some of the expected effects of climate change, like rising sea levels, ocean acidification and loss of biodiversity, can be particularly damaging in developing and poor countries. \nInitially, the effort will be focused only on Colombia, Bangladesh and Ethiopia. \nThe announcement came a day after leaders of the G-7 countries agreed to various climate change goals, including “the need to integrate climate risks into development assistance and investment programs across the board, and to increase access to risk insurance to help developing countries respond to and recover from climate-related disasters.” Tags: Past: 1 hour Bill would require trade deals to... A House trade vote could come as soon as this week. Republicans fear they will win... Republicans in Congress are worried the Supreme Court will hand them a... Bachelor Graham hints at 'rotating... “Well, I've got a sister. She could play that role if necessary,” Graham... Obama: 'We don't yet have a... The president said Iraq must show a greater commitment to fighting ISIS. Republicans wield power of the... A bill to fund the Justice Department is the latest front in the battle... Obama’s frustration with courts... Obama made some of his toughest and bluntest comments to date. Boehner: We don't have votes yet... \"I don't think we're quite there yet,\" the Speaker said. GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. House bill would require gun... Rep. Carolyn Maloney said the requirement would \"help save lives.\" Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\"", "external_links": [], "published": "2015-06-09T22:10:00.000+03:00", "crawled": "2015-06-10T05:25:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}