{"organizations": [], "uuid": "4a54f89d4ca7b5fc820a9335c2f26d8982b1282b", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/06/08/obama-dijo-que-continuar-solicitando-a-las-autoridades-judiciales-que-permitan-instalar-medidas-de-alivio-para-migrantes.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/06/08/obviamente-estoy-frustrado-dice-obama-sobre-su-plan-migratorio", "country": "", "title": "“Obviamente, estoy frustrado”, dice Obama sobre su plan migratorio", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "“Obviamente, estoy frustrado”, dice Obama sobre su plan migratorio", "spam_score": 0.0, "site_type": "news", "published": "2015-06-09T00:29:00.000+03:00", "replies_count": 0, "uuid": "4a54f89d4ca7b5fc820a9335c2f26d8982b1282b"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/06/08/obviamente-estoy-frustrado-dice-obama-sobre-su-plan-migratorio", "ord_in_thread": 0, "title": "“Obviamente, estoy frustrado”, dice Obama sobre su plan migratorio", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía “Obviamente, estoy frustrado”, dice Obama sobre su plan migratorio El presidente de EU aseguró que está siendo lo más agresivo que puede en términos legales para implementar su programa Lunes, 08 de junio de 2015 a las 16:30 Obama aún no ha recurrido a la Corte Suprema para implementar su plan migratorio (Reuters). Lo más importante El juez de Distrito Andrew S. Hanen está detrás del bloqueo del plan migratorio de Obama Temas relacionados Corte federal paraliza acciones migratorias de Obama \nWASHINGTON (CNN) — El presidente de Estados Unidos, Barack Obama, reiteró su frustración este lunes por la decisión de una corte de distrito que bloqueó temporalmente sus acciones ejecutivas para un alivio migratorio en la nación norteamericana. \n“Con respecto a la migración, obviamente, estoy frustrado por la decisión de una corte de distrito que ahora atraviesa un proceso de apelación”, comentó Obama durante una rueda de prensa en Alemania este lunes. \nLa administración estadounidense solicitó a una corte de apelaciones que permita que los programas de alivio de Obama puedan implementarse en espera de una apelación de méritos, pero un panel dividido de tres jueces declinó que esto se llevara a cabo en mayo pasado. \nObama comentó este lunes que está siendo “tan agresivo legalmente como pueda”, para resolver el tema, a pesar de que no ha buscado apoyo de la Corte Suprema de EU. \nSimpatizantes de las acciones del presidente estadounidense y grupos defensores de derechos de los migrantes no están inconformándose sobre la manera en que Obama ha manejado el tema de migración, pero sí se han quejado del juez de Distrito de Estados Unidos Andrew S. Hanen, el hombre detrás del bloqueo de las acciones del mandatario estadounidense. \n“El juez Hanen mostró una cantidad inusual de hostilidad contra los programas migratorios del presidente”, dijo Ian Millhiser, investigador del Centro del Progreso Estadounidense. \n“Hasta que una alta corte mantenga o dé marcha atrás a la decisión de Hanen, el presidente probablemente reacciona al hecho de que sus manos están atadas por el momento”, dijo el experto. \nSi la corte decide a favor de Obama, unos 5 millones de migrantes indocumentados podrán empezar a aplicar para las deportaciones tardías este verano. Pero si la corte decide que la ley puede esperar, podría tomar años para que las acciones migratorias entren en vigor. \nPara la frustración de Obama y sus aliados, las reglas, que incluyen una amplia lista de protecciones para la deportación y nuevas pautas de permiso de trabajo, han sido instaladas desde febrero en una batalla iniciada por gobernadores republicanos en una corte. Encuentra este artículo con: mundo, presidente estados unidos, barack obama, programa, alivio migratorio, migrantes, corte suprema, andrew hanen Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"ee7ab71ae73943819916b5331837082b\", \"time\": \"2015-06-08T21:29:47.427Z\" } Video ", "external_links": [], "published": "2015-06-09T00:29:00.000+03:00", "crawled": "2015-06-09T00:29:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}