{"organizations": [], "uuid": "619ba4f02e7751271b2233ac9c7d5c6f41868953", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/clintonhillary05042015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/245502-breaking-with-obama-clinton-says-she-wouldnt-support-trade-bill", "country": "US", "title": "Breaking with Obama, Clinton says she wouldn’t support trade bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Breaking with Obama, Clinton says she wouldn’t support trade bill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T04:25:00.000+03:00", "replies_count": 0, "uuid": "619ba4f02e7751271b2233ac9c7d5c6f41868953"}, "author": "esmilowitz@thehill.com (Vicki Needham)", "url": "http://thehill.com/policy/finance/245502-breaking-with-obama-clinton-says-she-wouldnt-support-trade-bill", "ord_in_thread": 0, "title": "Breaking with Obama, Clinton says she wouldn’t support trade bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Breaking with Obama, Clinton says she wouldn’t support trade bill By Vicki Needham - 06/18/15 09:25 PM EDT In a major break with the White House, Hillary Clinton said Thursday she probably wouldn’t vote for fast-track trade authority if she were still in the Senate. The 2016 Democratic presidential hopeful reasoned that fast-track, or trade promotion authority, is a process vote, and “I don’t want to say it’s the same thing as [the Trans-Pacific Partnership],” she said during an interview with Jon Ralston on Ralston Reports. “I certainly would not vote for it unless I was absolutely confident that we would get Trade Adjustment Assistance,” she said. ADVERTISEMENT Pro-trade Senate Democrats will face a similar dilemma next week. The chamber votes Tuesday on whether to proceed to the fast-track measure and, after that vote, another bill that includes Trade Adjustment Assistance, which is help for workers who lose their jobs because of expanded trade. As senators headed out for the weekend, there wasn’t a plan in place assuring all the bills would reach President Obama’s desk. Senate Majority Leader Mitch McConnell (R-Ky.) promised Democrats that the Senate would, once again, pass all the trade measures and ship them up Pennsylvania Avenue. The House earlier Thursday passed legislation, 218-208, that would give Obama the fast-track authority he needs to complete and negotiate the Trans-Pacific Partnership (TPP) and another deal with the European Union. Last weekend, after a stinging defeat of Obama’s trade agenda in the House, Clinton said the president should “listen to and work with” Democrats to salvage the legislation that would ease passage of any global agreements that reach Capitol Hill. Republicans and Democrats have criticized Clinton for dancing around the details by failing to take a hard position on trade, arguing that her stance would do plenty to sway lawmakers. During a campaign swing through Iowa last month, Clinton said she would reserve opinion on the TPP until negotiations are completed. Supporters argue fast-track is needed to reach a final deal. During that stop, the former secretary of State said any trade deal must protect jobs and increase wages, boost U.S. competitiveness, improve global working conditions and the environment while tackling currency manipulation. Tags:", "external_links": [], "published": "2015-06-19T04:25:00.000+03:00", "crawled": "2015-06-19T11:09:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}