{"organizations": ["College of Charleston TD Arena", "Clementa Pinckney"], "uuid": "4efd64995da28f8eceae9faf8b81dca4a9604514", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3123566/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/26/obama-clementa-pinckney-eulogy_n_7670800.html", "country": "", "title": "Obama Gives Impassioned Eulogy At Clementa Pinckney's Funeral, Comments On Confederate Flag, Racism", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Gives Impassioned Eulogy At Clementa Pinckney's Funeral, Comments On Confederate Flag, Racism", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T22:31:00.000+03:00", "replies_count": 0, "uuid": "4efd64995da28f8eceae9faf8b81dca4a9604514"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/26/obama-clementa-pinckney-eulogy_n_7670800.html", "ord_in_thread": 0, "title": "Obama Gives Impassioned Eulogy At Clementa Pinckney's Funeral, Comments On Confederate Flag, Racism", "locations": ["US", "South Carolina", "Charleston"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Clementa Pinckney", "Obama", "MANDEL"], "text": "Obama Gives Impassioned Eulogy At Clementa Pinckney's Funeral, Comments On Confederate Flag, Racism Posted: Updated: 1 minute ago US President Barack Obama delivers the eulogy during the funeral of slain pastor, Rev and South Carolina State Sen. Clementa Pinckney, at the College of Charleston TD Arena, in Charleston, South Carolina on June 26, 2015. AFP PHOTO/MANDEL NGAN (Photo credit should read MANDEL NGAN/AFP/Getty Images) | MANDEL NGAN via Getty Images reddit \nPresident Barack Obama gave the eulogy at the funeral for Rev. Clementa Pinckney , a South Carolina state senator and pastor who was one of nine people shot and killed at Charleston's Emanuel African Methodist Episcopal Church last week. \n\"The Bible calls us to hope. To persevere, and have faith in things not seen. They were still living by faith when they died, the Scripture tells us,\" Obama said of Pinckney and the other shooting victims, who the president said were \"each at different stations in life but bound together by a common commitment to God.\" \n\"Good people. Decent people. God-fearing people,\" Obama added. \"People so full of life and so full of kindness, people who ran the race and persevered, people of great faith. To the families of the fallen, the nation shares in your grief.\" \nObama addressed Pinckney's murderer during his eulogy, saying \"he didn't know he was being used by God.\" \n\"Blinded by hatred, the alleged killer could not see the grace surrounding Reverend Pinckney and that Bible Study group,\" Obama said, saying the killer \"failed to comprehend what Reverend Pinckney so well understood -- the power of God’s grace.\" \nObama talked about his history with Pinckney, recalling when they first met. \n\"I cannot claim to have had the good fortune to know Rev. Pinckney well, but I did have the pleasure of knowing him and meeting him here in South Carolina back when we were both a little bit younger. Back when I didn't have visible grey hair. The first thing I noticed was his graciousness, his smile, his reassuring baritone, his deceptive sense of humor -- all qualities that helped him wear so effortlessly a heavy burden of expectation.\" \nPresident Barack Obama delivers the eulogy for South Carolina state senator and Rev. Clementa Pinckney during Pinckney's funeral service June 26, 2015 in Charleston, South Carolina. (Photo by Win McNamee/Getty Images) \nObama spoke on the importance of church to African American life and specifically spoke of the Emanuel AME Church's historical significance. \n\"The church [was] built by blacks seeking liberty, burned to the ground because its founder sought to end slavery, only to rise up again -- a phoenix from these ashes,\" Obama said. \nObama also addressed the controversy over the Confederate flag during his remarks. \n\"It's true a flag did not cause these murders, but as people from all walks of life -- Republicans and Democrats -- now acknowledge... the flag has always represented more than just ancestral pride,\" Obama said. \"For many, black and white, that flag is a reminder of systemic oppression and racial subjugation. We see that now.\" \nObama said removing the flag from the South Carolina capitol grounds isn't a rebuke of Confederate forces, but rather what they fought for. \n\"The cause of slavery was wrong,\" Obama said. \nObama touched on racism, saying \"the subtle impulse\" still exists \"to call Johnny back for a job interview but not Jamal.\" Obama also spoke about gun violence during his remarks, saying each life cut short by a gun is important to remember and noting \"the vast majority\" of Americans and gun owners want to make change to prevent gun deaths. He doubled down on his remarks that gun control laws won't prevent every tragedy, but they could save a few lives. \n\"[We see] when eight of our brothers and sisters are cut down in a church basement, 12 in a movie theater, 26 in an elementary school, but I hope we also see the 30 precious lives cut short by gun violence in this country every day,\" Obama said. \nPinckney was taking part in a prayer meeting at the church on June 17 when he was killed. \nObama initially gave a statement calling the shooting a \" tragedy ,\" noting other advanced countries don't typically see this type of mass violence. Obama has had to address homicidal gun violence 14 times during his presidency, according to a count by CBS' Mark Knoller. \nIn his eulogy Friday, Obama said the shooting \"has allowed us to see where we've been blind.\" \n\"[God has] once more given us grace, but it's up to us now to make the most of it,\" Obama said. \nObama said it wouldn't be fair to Pinckney's legacy \"to go back to business as usual\" after the funerals for the nine victims of the Charleston shooting have concluded. \n\"It would be a betrayal of everything Rev. Pickney stood for if we allow ourselves to slip into a comfortable silence again,\" Obama said. \n\"It would be a refutation of the forgiveness expressed by those families [of the Charleston victims] if we slipped into old habits,\" Obama added. \nAs he ended his remarks, the president began to sing \"Amazing Grace,\" leading the crowd in the song before naming each of the shooting victims. Also on HuffPost:   \"My heart is breaking for Charleston and South Carolina tonight. This senseless tragedy at a place of worship - where we come together to laugh, love and rejoice in God's name - is absolutely despicable and can never be understood. Tonight we stand together in prayer for Pastor Pinckney and his congregation at Emanuel AME, and for the families who are enduring unimaginable pain at the loss of their loved ones. We will come together as a city and as a state to lift up those who need us most right now. I hope for their sake, and for the people of Charleston, that the perpetrators of this terrible crime are swiftly brought to justice.\" “Our prayers are with the families of the victims and the people of Charleston. We are all heartbroken by this tragedy. “To the families of the victims, please know that you are being prayed for and loved by so many in the community and across the nation. I pray that God will provide you healing in the coming days. “There are bad people in this world who are motivated by hate. Every decent person has been victimized by the hateful, callous disregard for human life shown by the individual who perpetrated these horrible acts. \"Our sense of security and well-being has been robbed and shaken.” \"Today we say to families of Mother Emanuel, you do not walk alone,\" Clinton said at the 2015 NALEO Convention. \"How many people do we need to see cut down before we act?\" she added. \"Michael, Rena, Nalin and I are praying for the victims and families touched by tonight's senseless tragedy at Emanuel AME Church. While we do not yet know all of the details, we do know that we'll never understand what motivates anyone to enter one of our places of worship and take the life of another. Please join us in lifting up the victims and their families with our love and prayers.\" \"There can be no trying to understand or explain away this evil behavior,\" Jindal said in an interview on CNN. \"I do hope this community will be able to find some comfort in their faith,\" he added. \"Today, the nation mourns as we learn more about the harrowing shooting at the historic Emanuel AME Church in Charleston, South Carolina. As law enforcement continues its work and as the victims' families and community begin to heal, we are heartbroken and painfully reminded that our work is far from done. No one should ever have a reason to be afraid to go to their place of worship. We must recommit to ensuring our communities are safe from senseless and hateful acts of violence.\" \"The Charleston church killings are a tragic reminder of the ugly stain of racism that still taints our nation. This senseless violence fills me with outrage, disgust and a deep, deep sadness. The hateful killing of nine people praying inside a church is a horrific reminder that, while we have made significant progress in advancing civil rights in this country, we are far from eradicating racism. Our thoughts and prayers are with the families and their congregation.\" “My heart and prayers go out to the entire Charleston community and the families and loved ones of victims in this horrific hate crime, as gun violence again grips our nation. Mass murder and gun violence have killed children and educators in their Sandy Hook school, moviegoers in Colorado, and men and women in their workplaces and neighborhoods across America. Last night gun violence invaded yet another sacred place – a site of ultimate sanctity and safety. We are far beyond saying ‘enough is enough’ and in danger of being numb to the scourge of gun violence plaguing our country. Numbness to gun violence is consummate complicity.\" “The brutal killing of nine innocent African-Americans at the historically black Emmanuel AME Church in South Carolina, including pastor and State Senator Clementa Pinckney, is an unspeakable and horrific tragedy by any measure. These individuals simply gathered to worship and study the Bible in a sanctuary and place of refuge as they did every week, but were senselessly killed. My most heartfelt condolences go out to all of the families and friends of the victims as well as the entire community. “It is my hope that all levels of state, local and federal law enforcement work together to capture this brutal killer before any more senseless violence occurs. I commend the Department of Justice for their swift determination to open a federal hate crimes investigation.” “Like all Americans, Marcelle and I are shaken by the horrific tragedy in Charleston. We all deserve to feel safe regardless of who we are, who we love, or what religion we choose to practice. Our thoughts and prayers are with the grieving families and parishioners whose right to feel safe in their community and their place of worship was taken from them yesterday. “I appreciate the swift engagement by the Department of Justice to monitor the situation and to assist in any way possible. Today, we stand with the people of Charleston and with the brave law enforcement officers and agents who are working to bring to justice the person or persons responsible for these heinous acts.” \"My thoughts and prayers are with the families of the victims of last night's shooting in Charleston, who were tragically taken from us as they gathered together in prayer inside their place of worship. While details are still emerging, I have faith in law enforcement that the perpetrator of this evil and senseless act will be brought to justice and prosecuted to the fullest extent of the law.\" \"This was an absolutely troubling and heart wrenching moment. The fact is that nine innocent lives are lost. Our hearts go out to the people of Charleston. Our hearts go out to the members of the Emanuel African Methodist Episcopal Church. We in this city feel the pain of people anywhere in this country, anywhere in this globe, because we’re so connected to each and every part of the country and the world. There are so many people here who hail from South Carolina, and it’s a very, very painful moment for all of us. I want everyone to know there’s no place in New York City for this kind of hatred, and that we, through the NYPD, have increase our resources directed at protecting African-American churches in this city as a precaution.\" \"Hate has once again been let loose in an American community. And the senseless actions of a coward have once again cut short so many lives with so much promise. Our hearts ache with sorrow with the entire Emanuel AME Church family as they seek solace and comfort in the shadow of a gunman’s act of pure evil and hatred. Our love and prayers are with them. \"We last saw Reverend Clementa Pinckney less than a year ago at a prayer breakfast in Columbia. He was a good man, a man of faith, a man of service who carried forward Mother Emaunel’s legacy as a sacred place promoting freedom, equality, and justice for all. We pray for him and his sister as we do for the seven other innocent souls who entered that storied church for their weekly Bible study seeking nothing more than humble guidance for the full lives ahead of them. \"We have no doubt the coward who committed this heinous act will be brought to justice. But as a nation we must confront the ravages of gun violence and the stain of hatred that continues to be visited on our streets, in our schools, in our houses of worship, and in our communities. \"As Mayor Riley made clear, all of Charleston’s heart bleeds today—but the overwhelming display of unity will bring forth the city’s healing. We will never forget those innocent souls who lost their lives. We will be there with all the strength and support and prayers we can offer to the families who now grieve. And as a nation we will come together.\" “I commend law enforcement officials for their work to apprehend the suspect in the shooting at Emanuel African Methodist Episcopal Church in Charleston, South Carolina. There are no words to express the anguish and shock felt by people across the nation from this massacre. As the son of two preachers, I know the sanctity and security the church offers for people of faith. It is unimaginable that someone would commit such an act of violence in a place of worship that resulted in the loss of nine lives. “My prayers are with the families and loved ones of those who were killed and for the Charleston community as they begin the healing process.”  Share ", "external_links": [], "published": "2015-06-26T22:31:00.000+03:00", "crawled": "2015-06-26T22:31:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}