{"organizations": [], "uuid": "edf9c7f37aba1662ade3ef7a121135352e8dffcc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/pelosinancy_061115gn5.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/house/245414-pelosi-dems-have-deep-trust-in-obama-despite-trade-dispute", "country": "US", "title": "Pelosi: Dems have 'deep' trust in Obama despite trade dispute", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Pelosi: Dems have 'deep' trust in Obama despite trade dispute", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T19:18:00.000+03:00", "replies_count": 0, "uuid": "edf9c7f37aba1662ade3ef7a121135352e8dffcc"}, "author": "Mike Lillis", "url": "http://thehill.com/homenews/house/245414-pelosi-dems-have-deep-trust-in-obama-despite-trade-dispute", "ord_in_thread": 0, "title": "Pelosi: Dems have 'deep' trust in Obama despite trade dispute", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pelosi: Dems have 'deep' trust in Obama despite trade dispute Greg Nash By Mike Lillis - 06/18/15 12:18 PM EDT \nHouse Minority Leader Nancy Pelosi (D-Calif.) is downplaying the discord between President Obama and congressional Democrats, saying the sharp disagreement over the president's trade agenda has done nothing to erode the lawmakers' trust in their White House ally. ADVERTISEMENT \"We have a deep relationship of trust with the president,\" Pelosi told reporters in the Capitol. \"In almost every category you can name, he has been excellent.\"\nThe comments came just hours before the House voted on trade promotion authority (TPA) legislation granting the administration additional powers to negotiate international trade deals, including a 12-nation colossus that stands as the top economic priority of Obama's second term. \nThe legislation is backed by Obama and Republican leaders in both chambers. But the liberal Democrats who have been the president's most faithful allies have revolted, arguing that TPA sets the stage for the trans-Pacific deal they say would degrade the environment and kill U.S. jobs, among a long list of other concerns. \nThe TPA bill squeaked through the House on Friday, but did not move out of the chamber because of a procedural requirement that a companion bill providing help to workers harmed by trade deals must also pass. Behind Pelosi, Democrats voted overwhelmingly to sink that workers aid measure as an 11th-hour tactic to block the TPA. \nIn the wake of the vote, the communication between Pelosi and Obama seemed to wane. Although the president was in direct contact with GOP leaders in both chambers on a path forward, it was White House chief of staff Denis McDonough who reached out to Pelosi. \nPelosi on Thursday rejected the notion that the relationship between Obama and Democrats is strained as a result of the trade debate. \n\"If you want me to, I'll spell out some of the great accomplishments of his presidency, and we highly regard his leadership,\" Pelosi said. \n\"This [issue] has been a long-standing difference in the Democratic Party having nothing to do with the president of the United States, and everything to do with our bosses — the constituents we work for,\" she added. \"We have deep friendships, deep respect and [we'll] move on to the next subject.\" \nGOP leaders on Wednesday changed the rule to bring the TPA to the floor as a stand-alone bill, which is expected to pass Thursday afternoon. \nIf successful, that strategy would send the proposal back to the Senate, which passed a trade package last month that combined the TPA with the workers aid provision, which would extend the Trade Adjustment Assistance (TAA) program beyond September. \nThe White House has said it won't accept a TPA bill without assurances that the TAA will reach Obama's desk. With that in mind, Senate leaders are said to be eyeing a strategy to move the TAA provision as part of a separate bill, the African Growth and Opportunity Act (AGOA), to extend trade preferences to African nations. \nPelosi predicted the strategy would fail, arguing that AGOA shouldn't be used as a vehicle for more controversial trade provisions. \n\"I don't see a path right now for TAA,\" she said. \"There's never been any major opposition to [AGOA]. And there's some thought that they may want to put something on that, but I don't think that that's a path. Forgetting TPA ... let's just get [AGOA] moving and done and not have it be part of any controversy.\" Tags:", "external_links": [], "published": "2015-06-18T19:18:00.000+03:00", "crawled": "2015-06-18T19:55:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}