{"organizations": ["Islamic State", "ISIS", "International Monetary Fund"], "uuid": "d5c4959411678d5ced9a1f2fc33e6c778b812719", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/08/politics/obama-abadi-iraq-germany-g7/index.html", "country": "", "title": "Obama on ISIS: 'No complete strategy' on Iraqi training - CNNPolitics.com", "performance_score": 4, "site": "cnn.com", "participants_count": 0, "title_full": "Obama on ISIS: 'No complete strategy' on Iraqi training - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T18:13:00.000+03:00", "replies_count": 0, "uuid": "d5c4959411678d5ced9a1f2fc33e6c778b812719"}, "author": "", "url": "http://www.cnn.com/2015/06/08/politics/obama-abadi-iraq-germany-g7/index.html", "ord_in_thread": 0, "title": "Obama on ISIS: 'No complete strategy' on Iraqi training - CNNPolitics.com", "locations": ["Ramadi", "U.S.", "Austria", "Baghdad", "Germany", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matteo Renzi", "Barack Obama", "Abadi", "Haider al-Abadi", "Nouri al-Maliki", "Obama", "Christine Lagarde"], "text": "World leaders meet in Germany for G7 Summit 02:33 Telfs-Buchen, Austria (CNN) President Barack Obama said on Monday his top national security advisers were still working to solidify their plans to train Iraqi defense forces battling ISIS in their own country. \"We don't yet have a complete strategy because it requires commitments on the part of the Iraqis as well about how that recruitment takes place, how that training takes place,\" Obama said during concluding remarks at the G7 conference in Germany. \"We want to get more Iraqi security forces trained, fresh, well equipped, and focused,\" Obama said. \"We're reviewing a range of plans for how we might do that, essentially accelerating the number of Iraqi forces that are properly trained and equipped and have a focused strategy and good leadership.\" He said when his military brass has developed a final plan on training Iraqi forces, he would share it with the American people. Earlier in the day, Obama frankly acknowledged setbacks in his war against ISIS on Monday, saying the terrorists' gains in Iraq amount to a short-term tactical gain that could be reversed through ramped-up U.S. assistance. Speaking alongside Iraqi Prime Minister Haider al-Abadi on the sidelines of the G7 summit, Obama reiterated the U.S. pledge to bolster training for Iraqi forces, but stopped short of announcing the increases in lethal aid being requested by Baghdad. \"The challenges we face continue to be significant,\" Obama said. \"We have seen successes, but we have also seen setbacks.\" Later, he said he was \"confident that although it is going to take time, we are going to be successful, ISIL is going to be driven out of Iraq and ultimately it is going to defeated.\" Speaking afterward, Abadi said he was confident ISIS would be defeated in his country, and called the fall of Ramadi into ISIS hands last month only a temporary gain for the group. During his meeting with Obama, Abadi was expected to again press for ramped-up U.S. military assistance to beleaguered Iraqi forces. He's been asking Obama and other American leaders for months to increase their support as ISIS continues to advance in Iraq. However, senior U.S. administration officials said ahead of the meeting that an announcement of new lethal aid wasn't forthcoming during Obama's visit to Germany for the G-7, saying instead that the President has tasked his national security team with continually assessing the mission against ISIS. The Obama administration still regards Abadi as a vast improvement over his predecessor Nouri al-Maliki, who the U.S. accused of fostering sectarian resentments within Iraq by not forming an inclusive enough government. Elected last year. Abadi was widely regarded as a more effective partner for the allied mission against Islamic State terrorists. But leaders in Iraq have continued to struggle in uniting the country's Sunni, Shia and Kurd populations. \"As long (Abadi) and the government stay committed to an inclusive approach ... I am absolutely confident that we will be successful,\" Obama said. During a photo call for leaders attending the G7 summit Monday, there was an awkward moment when Obama turned his back on Abadi as the Iraqi Prime Minister appeared intent on initiating a conversation. Engrossed in a conversation with Italian leader Matteo Renzi and International Monetary Fund president Christine Lagarde, Obama didn't notice Abadi lingering behind him. After waiting a moment, Abadi and his translator turned and walked away. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-06-08T18:13:00.000+03:00", "crawled": "2015-06-08T18:33:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}