{"organizations": ["Information Technology Industry Council", "Reuters", "Apple", "Microsoft", "Facebook", "FBI", "IBM", "SIIA", "Information Industry Association", "White House", "ITIC", "Google", "National Security Agency"], "uuid": "dcc22357ed8e4fdfc4f37deadb5eed464b5460cf", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051815getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/cybersecurity/244378-tech-groups-warn-obama-against-weakening-encryption", "country": "", "title": "Tech groups warn Obama against weakening encryption | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Tech groups warn Obama against weakening encryption | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "dcc22357ed8e4fdfc4f37deadb5eed464b5460cf"}, "author": "", "url": "http://thehill.com/policy/cybersecurity/244378-tech-groups-warn-obama-against-weakening-encryption", "ord_in_thread": 0, "title": "Tech groups warn Obama against weakening encryption | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Edward Snowden", "Obama", "Cory Bennett"], "text": "Tech groups warn Obama against weakening encryption By Cory Bennett - 06/09/15 07:52 AM EDT The tech industry is not relenting in its attempt to dissuade the White House from proposing any type of policy to guarantee law enforcement access to encrypted data. Two major tech industry groups on Monday sent a letter to President Obama arguing that such a move would weaken all encryption standards, threatening consumers’ privacy and safety from hackers, Reuters reported . ADVERTISEMENT “We are opposed to any policy actions or measures that would undermine encryption as an available and effective tool,” said the letter, from the Information Technology Industry Council (ITIC) and the Software and Information Industry Association (SIIA). Combined, the groups represent most of the major digital players, including Apple, Google, Facebook, IBM and Microsoft. The tech community is waging its crusade as the White House is preparing a report on potential ways law enforcement can bypass encryption during criminal or national security investigations. It’s a battle that has been simmering since former National Security Agency contractor Edward Snowden revealed a number of secret government spying programs. In response, many firms moved to encrypt their products and online services, locking out government officials and even the companies themselves. Increasingly, the FBI and other government officials have warned this spreading encryption is hindering them from conducting lawful investigations. It’s also giving criminals a safe zone, free from fear of discovery, they argue. The disagreement has come to an impasse as the administration tries to figure out how to move forward. In their letter, the ITIC and the SIIA argued that digital commerce has taken off because consumers believe it is secure. “Consumer trust in digital products and services is an essential component enabling continued economic growth of the online marketplace,” the groups wrote. “Accordingly, we urge you not to pursue any policy or proposal that would require or encourage companies to weaken these technologies, including the weakening of encryption or creating encryption ‘workarounds.’ ” Monday’s letter is just the latest move in the contentious fight over encryption standards. Many of the big names in the ITIC and the SIIA also signed on to a similar letter sent to the White House in May that also included more than 100 civil liberties organizations, digital rights advocates and security researchers. A strong contingent of bipartisan lawmakers is also fighting the administration on the issue. The argument flared up during a recent hearing with an FBI official. \n“Creating a pathway for decryption only for good guys is technologically stupid,” said Rep. Ted Lieu (D-Calif.), who has a bachelor’s degree in computer science from Stanford University. ", "external_links": [], "published": "2015-06-10T03:00:00.000+03:00", "crawled": "2015-06-11T00:20:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}