{"organizations": [], "uuid": "9a92a16b451957996adca98357f226702132d185", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/NLRB.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/03/deceptive-assault-obama-nlrb-seeks-to-gut-right-to-work-laws-say-critics/", "country": "US", "title": "'Deceptive assault': Obama NLRB seeks to gut right-to-work laws, say critics", "performance_score": 3, "site": "foxnews.com", "participants_count": 38, "title_full": "'Deceptive assault': Obama NLRB seeks to gut right-to-work laws, say critics | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-03T03:00:00.000+03:00", "replies_count": 38, "uuid": "93ff8d32fa5dba7dbe7802cd65fda6743cbbe876"}, "author": "Perry Chiaramonte", "url": "http://www.foxnews.com/politics/2015/06/03/deceptive-assault-obama-nlrb-seeks-to-gut-right-to-work-laws-say-critics/#post-0", "ord_in_thread": 0, "title": "'Deceptive assault': Obama NLRB seeks to gut right-to-work laws, say critics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Perry Chiaramonte\nPublished June 03, 2015 FoxNews.com livefyre Email Print Employees at the Volkswagen plant in Chattanooga, Tennessee recently voted against union representation from United Auto Workers. (Reuters/Billy Weeks)\nOpponents of Big Labor complained to lawmakers Wednesday that the Obama administration's National Labor Relations Board is poised to gut right-to-work laws with a seemingly simple tweak they claim could leave independent workers at the mercy of the unions they rejected.\nThe board is considering requiring non-union workers who work at unionized companies - something that can only happen in the 25 so-called \"right-to-work\" states - to pay fees to unions in order to file workplace grievances. That, complained Mark Mix, president of the National Right to Work Committee, gives the unions, who control the grievance process, too much power over workers who opted out.\n“This proposed action by Obama’s Big Labor NLRB is a direct assault on a worker’s fundamental First Amendment right to freedom of association.\"\n- Greg Mourad, National Right to Work Committee\n\"History has shown that union officials all too often initiate on-the-job discrimination, which forces a worker into the grievance process the union bosses control, in order to punish him or her for not joining the union in the first place,” he said.\nIn addition to the potential for union workers to initiate a grievance with non-union colleagues, forcing them to seek and pay for union representation, the \"fee-for-grievance” scheme could allow for fees that exceed regular dues, warned Mix, who called the NLRB proposal a \"deceptive assault\" on right-to-work laws.\nThe testimony, given before the House Committee on Education and Workforce, was prompted by a recent NLRB request of legal briefs on the merits of allowing the change in right-to-work laws. While the laws are enacted by states, the board has wide latitude over labor relations rules inside the workplace.\n“We are very pleased that Congress recognized the seriousness of the NLRB’s threat to state right-to-work laws,” National Right to Work Committee Vice President of Legislation Greg Mourad told FoxNews.com. “This proposed action by Obama’s Big Labor NLRB is a direct assault on a worker’s fundamental First Amendment right to freedom of association. Congress can and must take action to block this rogue NLRB, and advance worker freedom.”\nUnion supporters defended the proposed change, but even more emphatically denounced right-to-work laws.\n\"At their core, right-to-work laws hamstring unions’ ability to help employees bargain with their employers for better wages, benefits, and working conditions,” Elise Gould, a senior economist for the Economic Policy Institute, testified. “Given that unionization raises wages both for individual union members as well as for nonunion workers in unionized sectors, it is not surprising that research shows that both union and nonunion workers in right-to-work states have lower wages and fewer benefits, on average, than comparable workers in other states.”\nWhile there is statistical data to show workers in states without right-to-work laws earn more, there is also data showing right-to-work states have much lower unemployment. Committee Chairman John Kline, R-Minn., stressed the importance of keeping laws against mandatory union membership intact. He warned that the fee-for-grievance proposal could be used as a weapon against workers who opt out.\n“Every worker has a fundamental right to decide whether or not to join a union,” Kline said. “Those who decide not to join a union shouldn’t be punished for that decision, especially when the punishment denies a worker the chance to provide for his or her family.\"\nNebraska Gov. Pete Ricketts, whose state has been right-to-work since 1946, said that by undermining the laws, the federal board was usurping states who have voted against mandatory union membership.\n\"Requiring a nonmember to pay for the union's participation is unreasonable,\" Ricketts said.\" And, it makes perfect sense that both the courts and the NLRB have up to now consistently barred organized labor from charging nonmembers in Right to Work states to get their grievances processed when union members can have their grievances processed for free.\"\nPerry Chiaramonte is a reporter for FoxNews.com. Follow him on Twitter at @perrych\nAdvertisement\nTrending in Politics 1 US officials warn no way to monitor ISIS' online encrypted messages 2 Texas gov poised to roll back 140-year-old open carry gun ban 3 Fox News Poll: Bush, Walker, Carson top GOP pack, support for Clinton down 4 'Deceptive assault': Obama NLRB seeks to gut right-to-work laws, say critics 5 Pentagon: Number of anthrax shipments accidentally shipped, doubles See all Trends Advertisement", "external_links": [], "published": "2015-06-03T03:00:00.000+03:00", "crawled": "2015-06-04T04:20:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}