{"organizations": [], "uuid": "8e24b0b69f0fbc4edc9401060def8d6d25c97063", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/06/22/king-v-burwell-obama-takes-his-toys-and-goes-home/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1434990033196.jpg?ve=1&tl=1", "site_section": "http://feeds.foxnews.com/foxnews/opinion", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2015/06/22/confederate-battle-flag.html", "country": "US", "title": "King v. Burwell: Obama takes his toys and goes home", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "King v. Burwell: Obama takes his toys and goes home", "spam_score": 0.0, "site_type": "news", "published": "2015-06-22T19:13:00.000+03:00", "replies_count": 0, "uuid": "21adc8117631ac5bfcf5aabbfaf87db3583c5697"}, "author": "Matt Kibbe", "url": "http://www.foxnews.com/opinion/2015/06/22/king-v-burwell-obama-takes-his-toys-and-goes-home.html", "ord_in_thread": 0, "title": "King v. Burwell: Obama takes his toys and goes home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print June 18, 2015: President Obama pauses while speaking in the Brady Press Briefing Room of the White House in Washington. (AP) \nA decision in the King v. Burwell lawsuit is just days away. With the potential to strike down health insurance subsidies for millions of people, you would think that the administration would be scrambling to come up with a response to the ruling. So what are they doing to prepare? \nNot a damn thing. \nVarious administration officials, including the president himself, have repeated that they have no intention of acting in the wake of the Supreme Court’s decision. Here’s Health and Human Service Secretary Sylvia Burwell on the agency’s plans : \"We know of no administrative actions that could, and therefore we have no plans that would, undo the massive damage to our health care system that would be caused by an adverse decision.\" \nIRS Commissioner John Koskinen echoed this indifference, saying “we don’t spend any time thinking about it.” And when President Obama was asked about the case, he brushed the question aside , saying, “I’m not going to anticipate that. I'm not going to anticipate bad law.\" Wow, we’ve sure come a long way from hope and change we can believe in. \nThe president may hope that his inaction will make Republicans look bad, but when the grassroots demand Congress does what they were put in office to do—repeal ObamaCare and replace it with patient-centered reform, he’s going to wish he had paid more attention to governing and less to political posturing. \nThis is a purely political calculation, and Republicans shouldn’t fall into the trap or take the bait. Obama is not worried about the Supreme Court ruling against him, he’s banking on it. It gives him an opportunity to blame Republicans for robbing people of their health care. By taking no action, he can point fingers at everyone else for spoiling his vision of government-run health care. \nIt’s the ultimate insider play: pass a broken law in a one-sided, partisan way, lie to people about what the law does, allow the IRS to implement the law illegally, and then, when it all falls apart, fiddle while America burns in the interest of scoring political points. \nNo wonder people hate Washington. \nIn the wake of the Burwell decision, assuming the plaintiffs prevail, Congress is going to be feeling a lot of pressure act quickly, and the easiest thing for them to do would be to pass a quick fix patch to ObamaCare, effectively undoing the Supreme Court’s ruling. Such an action would represent a wholesale surrender to the administration, giving retroactive permission for the IRS’s illegal implementation of ObamaCare. \nThis time, the people aren’t going to fall for it. The president may hope that his inaction will make Republicans look bad, but when the grassroots demand Congress does what they were put in office to do—repeal ObamaCare and replace it with patient-centered reform, he’s going to wish he had paid more attention to governing and less to political posturing. \nWhile the Obama administration is planning—or rather not planning—for disaster, Republicans need to be planning for success. The ideas are out there, they just need to be presented coherently so they can be implemented. Ben Sasse, the young senator from Nebraska, has proposed a bridge plan that would allow people coming off ObamaCare to transition via a COBRA-like system. A bridge is not a bad first step, but we need to make sure the bridge goes somewhere. We could start with a repeal of the individual mandate, equal tax treatment of health care expenses between employers and individuals, and encouraging more competition between insurers. \nInstead of concealing the cost of health insurance with subsidies, how about actually doing something to bring those costs down? This could be easily done by removing ObamaCare’s price-fixing regulations that are forcing consumers to pay higher rates. This would be an easy fix that would provide immediate relief to millions of Americans, the relief of actual reforms, not political sleight of hand. \nMatt Kibbe is the president of FreedomWorks and author of the New York Times bestseller, \"Don't Hurt People and Don't Take Their Stuff.\" Follow him on Twitter at @MKibbe.", "external_links": [], "published": "2015-06-22T19:13:00.000+03:00", "crawled": "2015-06-23T00:23:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}