{"organizations": [], "uuid": "95eec23ede29eef2cce00c005aa5e11009857e91", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Archive/fn2/0/0/0_21_020709_obamaposter.jpg", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2015/06/25/new-york-city-says-whole-foods-is-overcharging-customers/", "country": "US", "title": "Detroit police issue arrest warrant for artist behind Obama 'Hope' poster", "performance_score": 6, "site": "foxnews.com", "participants_count": 0, "title_full": "Detroit police issue arrest warrant for artist behind Obama 'Hope' poster", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T07:54:00.000+03:00", "replies_count": 0, "uuid": "6c26cb85cd28f687c962405c15e1fed53e2c86e5"}, "author": "", "url": "http://www.foxnews.com/us/2015/06/25/detroit-police-issue-arrest-warrant-for-artist-behind-obama-hope-poster/", "ord_in_thread": 0, "title": "Detroit police issue arrest warrant for artist behind Obama 'Hope' poster", "locations": ["Detroit"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Shepard Fairey", "Obama"], "text": "Detroit police issue arrest warrant for artist behind Obama 'Hope' poster Published June 25,   livefyre Email Print Feb. 3, 2009: Artist Shepard Fairey poses beside his \"Obama HOPE\" image, part of an exhibit of his work at the Institute of Contemporary Art. (AP/Boston Herald) \nDetroit police have issued an arrest warrant for the artist who created the famous \"Hope\" poster in support of President Obama during the 2008 election, it was revealed Wednesday. \nThe Detroit Free Press reported that Shepard Fairey faces two felony counts of malicious destruction of property. The warrant was filed Friday. \nPolice claim that Fairey caused about $9,000 in damage while he was in Detroit to complete a commissioned mural. The charges carry a maximum penalty of up to five years in jail, as well as fines that could exceed $10,000. \nAuthorities say that Fairey will be arrested the next time he comes to Detroit if he doesn't immediately turn himself in. \n\"Just because he is a well-known artist does not take away the fact that he is also a vandal,\" Detroit Police Sgt. Rebecca McKay, who oversees the city's graffiti task force, told the Free Press. \"And that's what we consider was done, in these instances, was vandalism.\" \nFairey, whose other trademark is a black-and-white rendering of the late professional wrestler Andre the Giant's face, told the Free Press last month that he would \"still do stuff on the street without permission. I'll be doing stuff on the street when I'm in Detroit.\" The paper reported that the Andre the Giant face has been seen in several locations downtown since Fairey's commission ended. \nIn an interview with Esquire magazine published last month, Fairey said Obama had not lived up to the expectations he had when supported his campaign. \n\"Obama has had a really tough time, but there have been a lot of things that he's compromised on that I never would have expected,\" Fairey told the magazine, specifically citing \"drones and domestic spying\" as \"the last things I ever thought he'd support.\"", "external_links": [], "published": "2015-06-25T07:54:00.000+03:00", "crawled": "2015-06-25T08:26:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}