{"organizations": [], "uuid": "308cd48388493133746ddf742e6513c3fd8b28b4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaaddress0627.png", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/trade/246461-obama-signs-trade-bills", "country": "", "title": "Obama signs trade bills | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama signs trade bills | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T04:09:00.000+03:00", "replies_count": 0, "uuid": "308cd48388493133746ddf742e6513c3fd8b28b4"}, "author": "", "url": "http://thehill.com/policy/finance/trade/246461-obama-signs-trade-bills", "ord_in_thread": 0, "title": "Obama signs trade bills | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Vicki Needham", "Obama"], "text": "By Vicki Needham - 06/29/15 03:01 PM EDT President Obama on Monday signed a fast-track trade authority bill into law, cementing a major legislative victory at the end of a bruising months-long battle within his own party. \nObama signed the measure during a brief ceremony in the East Room of the White House, where he hailed the bipartisan cooperation that was needed to get the legislation through Congress after an intense lobbying campaign that pitted the president against congressional Democrats and created a rare alliance with Republicans. The president was surrounded by key lawmakers and members of his administration who kept this trade agenda alive through several procedural hiccups even though, he said, it had “been declared dead more than once.” The trade promotion authority (TPA) legislation, also known as fast-track, is expected to speed the completion of Trans-Pacific Partnership (TPP) negotiations with 11 other Pacific Rim nations in the coming weeks. Obama also signed a measure into law that provides $450 million to retrain workers who lose their jobs because of expanded trade and extends trade preferences for another decade to sub-Saharan Africa. The president said he believed that signing the legislation would be good for American workers and businesses and would give the United States a global competitive edge. “We’re going to turn global trade into a race to the top and reestablish our leadership role in the world,” he told the crowd that included business owners and other stakeholders. “Trade is one part of a broader agenda of middle-class economics,” he said. Behind him during the signing were U.S. Trade Representative Michael Froman, Treasury Secretary Jack Lew, Reps. John Delaney (D-Md.), Pat Tiberi (R-Ohio), Dave Reichert (R-Wash.), Ron Kind (D-Wis.), Gerry Connolly (D-Va.), Don Beyer (D-Va.), Sen. Chris Coons (D-Del.), Agriculture Secretary Tom Vilsack and Commerce Secretary Penny Pritzker. Jeff Zients, the director of the United States National Economic Council and an architect of the White House’s full-court press in Congress, was in the audience. The president also thanked Republican leaders who helped deliver the trade victory — Speaker John Boehner (Ohio), Senate Majority Leader Mitch McConnell (Ky.) and House Ways and Means Committee Chairman Paul Ryan (Wis.) — who couldn’t make the ceremony because they are out of town for the July 4 recess. Those leaders and the White House remained resilient during the legislative fight and were quick to find a way to breathe new life back into the trade agenda just when it seemed out of chances to pass. The TPP’s leaders are aiming to finish a deal this summer, meaning at the earliest Congress could vote sometime this fall on the massive agreement that covers 40 percent of the world’s gross domestic product. Locking in a deal sets up the next fight between Congress and the White House over whether the TPP meets the high standards set by lawmakers. ", "external_links": [], "published": "2015-06-30T04:09:00.000+03:00", "crawled": "2015-06-30T04:09:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}