{"organizations": [], "uuid": "3c805229bb12346f8a896ba9d41e664c15e5bee9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaextra_051115extra.png", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/244785-obama-i-respond-to-people-who-call-me-idiot", "country": "US", "title": "Obama: I respond to people who call me 'idiot'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: I respond to people who call me 'idiot'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T03:09:00.000+03:00", "replies_count": 0, "uuid": "3c805229bb12346f8a896ba9d41e664c15e5bee9"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/244785-obama-i-respond-to-people-who-call-me-idiot", "ord_in_thread": 0, "title": "Obama: I respond to people who call me 'idiot'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: I respond to people who call me 'idiot' By Jordan Fabian - 06/11/15 08:09 PM EDT President Obama takes time to respond to his critics, even the ones that call him an \"idiot.\" During an interview with entertainment news program “Extra,” correspondent Jerry Penacoli thanked the president for his healthcare law, which he says “pretty much saved my finances and my life” during his battle with cancer. “The number of stories I have gotten like yours — it’s made a difference in a lot of people’s lives,” Obama said in the interview, which aired Thursday. But not all the feedback the president gets from the public is positive. “I get 10 letters a night out of the 40,000 letters and emails and messages that we get,” he said. “Some of them are just saying thank you for something. Some of them are saying, ‘You’re an idiot.’ ” When Penacoli asked Obama whether he answers the ones that call him an idiot, the president said, “I do.” Obama said “sometimes they are” surprised to hear back from him. “You know, I try to address their concerns,” he said. The president is stepping up his defense of the Affordable Care Act as the Supreme Court prepares a ruling that could unravel his signature law. The high court is expected to rule this month in the King v. Burwell case, which could decide whether subsidies for buying insurance can be distributed through the federal exchange. “One of the things I try to remind people of — what we do here, what the Supreme Court does, what Congress does — these aren’t just abstractions,” Obama said. “These are things that really matter in people’s lives.” White House spokesman Josh Earnest said Thursday the decision to tout ObamaCare on an entertainment show \"is part of our sustained effort to try to use a variety of channels to communicate with the American public.\" The interview with Penacoli took on a much friendlier tone than a typical television news interview. The former “Days of Our Lives” and “Galaxy Quest” actor suffered from stage III melanoma and early-stage thyroid cancer. But he was able to pay for treatments thanks to a provision in the president’s healthcare law that lifted lifetime caps on insurance benefits. “The opportunity to sit here with the sitting president and to be able to say thank you,” Penacoli said. “This has nothing, for me, to do with politics. I’m just letting you know that it made a difference in my life.” “You are a perfect example of somebody who could be caught with debilitating bills or not being able to get the care you need,” Obama said. “A lot of the protections essentially made existing insurance better.” Penacoli asked Obama about life in the White House, his daughters and his picks to win the National Basketball Association title and National Hockey League’s Stanley Cup. The president wouldn’t pick a winner in the NBA Finals between the Cleveland Cavaliers and the Golden State Warriors. “Too close to call right now,” he said. “I think both teams are playing incredible basketball.” The president was more decisive in choosing a winner in the Stanley Cup Final, pitting his hometown Chicago Blackhawks against the Tampa Bay Lightning.", "external_links": [], "published": "2015-06-12T03:09:00.000+03:00", "crawled": "2015-06-12T05:25:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}