{"organizations": [], "uuid": "1b2dab95470e7c0a93d998e19da6d046425ad777", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/mountmckinleydenali06102015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/energy-environment/244583-obama-administration-does-not-object-to-potential-mount-mckinley", "country": "", "title": "Obama admin OK with Alaska mountain name change | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama admin OK with Alaska mountain name change | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "1b2dab95470e7c0a93d998e19da6d046425ad777"}, "author": "", "url": "http://thehill.com/policy/energy-environment/244583-obama-administration-does-not-object-to-potential-mount-mckinley", "ord_in_thread": 0, "title": "Obama admin OK with Alaska mountain name change | TheHill", "locations": ["Alaska"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Devin Henry", "Obama"], "text": "Obama admin OK with Alaska mountain name change Getty Images By Devin Henry - 06/10/15 04:40 PM EDT \nThe Obama administration “does not object” to changing the name of North America’s largest peak from Mount McKinley to Mount Denali, an official told a Senate committee on Wednesday. \nSen. Lisa Murkowski (R-Alaska) is pushing a bill to change the name of the 20,237-foot peak from a tribute to the nation’s 25th president to the name given to it by indigenous Alaskans and the state government. ADVERTISEMENT On Wednesday, Victor Knox, the associate director for planning, facilities and lands at the National Park Service, said the Department of Interior would not fight Murkowski’s efforts to change the name.\n“The National Park Service appreciates the long history and public interest for both the name Mount McKinley and the traditional Athabascan name, Denali,” Knox said. “The Department respects the choice made by this legislation, and does not object.” \nMurkowski’s push is likely to run into hurdles from one very specific group: Ohioans. McKinley hailed from Ohio, and lawmakers from the state are opposed to removing his name from the continent’s highest peak. \nRep. Bob Gibbs (R-Ohio) introduced a bill in January affirming the name, a move that effectively blocks the U.S. Board on Geographic Names from changing it. \n“Located in Alaska, Mount McKinley is the highest point in North America and has held the name of our nation’s 25th president for over 100 years,” Gibbs said in a January statement. “This landmark is a testament to his countless years of service to our country.” \nCongress formally named the peak after William McKinley in 1917. A gold miner had unofficially christened it ‘McKinley’ after the 1896 presidential election. \nBut Alaskans and indigenous tribes, especially the Athabascan people, kept calling it Denali. The Alaska government recognized the name Denali in 1975 and asked the Board on Geographic Names to do the same. \nIn 1980, Congress renamed the national park surrounding the peak from McKinley to Denali, but Alaskan officials, led now by Murkowski and Sen. Dan Sullivan (R-Alaska), want to formally change the name of the mountain, as well. \nIn a statement Wednesday, Murkowski said McKinley's legacy would live on through the many other places named after him: a county in New Mexico, for instance, or 20 schools in Ohio, or the \"literally hundreds of streets, libraries and other institutions and businesses\" around the country. \nRenaming the mountain \"seems a fitting gesture and an appropriate way to honor the culture and history of Alaska Natives,\" Murkowski said. \"There is no need for this name confusion and controversy to continue.\" \nMurkowski chairs the Senate Energy and Natural Resources Committee. Its natural parks panel considered her bill, along with nine other National Parks Services matters, on Wednesday. \nKnox accepted most of those bills, though he said the Obama administration opposed legislation establishing a plan to cull the bison population in Grand Canyon National Park. He said it would “disrupt an ongoing planning effort” for bison there. \nSen. Jeff Flake (R-Ariz.), a bill sponsor, said the Park Service needs to move more quickly to develop a bison plan. \n“We wouldn’t feel the need to put a timeframe if we were moving ahead more expeditiously,” he said. “It just seems to be taking far too much time here.” \nKnox said the administration also “strongly objects” to a bill that would allow national parks to remain open during government shutdowns. \n“We disagree with the idea of enacting laws to lessen the impact of a future government shutdown for a few select governmental activities rather than protecting all such activities by avoiding a future lapse in appropriations,” he said. \nFlake said the bill is meant to keep the lights on during a shutdown like the one in 2013. \n“We don’t want a shutdown,” Flake said. “But in case it does happen, if a state or local government is willing to fund these activities that the Park Service is undertaking, I would hope that we would work with them quickly, and that’s all we’re trying to do here.” Tags: ", "external_links": [], "published": "2015-06-10T03:00:00.000+03:00", "crawled": "2015-06-11T00:16:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}