{"organizations": [], "uuid": "f91abd64c7c94051da002a2edf52d4cb0017fec2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3038060/images/o-KANSAS-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/civil-rights/feed", "section_title": "Civil Rights on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/05/kansas-abortion-law-_n_7512958.html", "country": "US", "title": "Why This Ob-Gyn And Her Father Are Suing Kansas To Stop Its New Abortion Ban", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Why This Ob-Gyn And Her Father Are Suing Kansas To Stop Its New Abortion Ban", "spam_score": 0.0, "site_type": "news", "published": "2015-06-05T16:45:00.000+03:00", "replies_count": 0, "uuid": "f91abd64c7c94051da002a2edf52d4cb0017fec2"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/05/kansas-abortion-law-_n_7512958.html", "ord_in_thread": 0, "title": "Why This Ob-Gyn And Her Father Are Suing Kansas To Stop Its New Abortion Ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why This Kansas Ob-Gyn And Her Father Are Suing The State To Stop Its New Abortion Ban Posted: Updated: 12 minutes ago Protesters hold signs during a rally at the Statehouse in Topeka, Kan. About two dozen protesters gathered to protest new regulations aimed at restricting abortion in Kansas. (AP Photo/Orlin Wagner) | ASSOCIATED PRESS \nWASHINGTON -- Working as an abortion provider is increasingly dangerous in any state, let alone in Kansas . \nBut the father-daughter pair of Drs. Herbert Hodes and Traci Nauser have continued to provide abortions and other reproductive health services, with more than 40 years of combined experience serving Kansas patients between them. Their clinic in Overland Park, the Center for Women's Health in Kansas, is one of only three that offers abortions in the state. Over the years, they've weathered restrictions such as insurance coverage bans for the procedure, mandatory parental consent and ultrasound laws, a 24-hour waiting period, new licensing regulations that almost forced them to stop providing abortions and state-mandated speeches they must give to their patients. \nNow, Hodes and Nauser are serving as plaintiffs in a lawsuit against a new law that could block them from using the most common method for second-trimester abortions, called dilation and evacuation (D&E). The suit , filed by the Center for Reproductive Rights, seeks to have the legislation blocked before it takes effect July 1. A hearing for the suit hasn't yet been scheduled. \nThe law in question bans what the anti-abortion advocates behind it describe as \"dismemberment abortion\" by prohibiting doctors from using forceps, clamps, scissors or other instruments to remove a fetus from the womb. Reproductive rights advocates say the measure is a public relations stunt, aimed at using graphic language to turn people against the procedure altogether. Its supporters think the policy \" has the power to transform the landscape of abortion policy \" in the United States. \nSince nearly 90 percent of abortions are performed in the first trimester, the ban would affect the approximately 8 or 9 percent of abortions performed using D&E. Ninety-five percent of second-trimester abortions are performed with the D&E method. \nOklahoma Gov. Mary Fallin (R) signed a similar bill within days of Kansas Gov. Sam Brownback (R) approving the measure in early April. \nIn a Thursday conversation with The Huffington Post, Dr. Traci Nauser explained why she believes the ban would force her to resort to under-studied, unnecessarily risky medical procedures instead of the generally accepted standard for care. (The interview has been edited for clarity and length.) \nHuffPost : Could you explain how the law banning dilation and evacuation would impact your practice -- and what the alternative looks like? \nTN : The standard D&E procedure that is performed currently is the safest, most effective and efficient surgical method to provide a second-trimester pregnancy termination. It’s definitely the most common procedure that’s performed at this gestational age. It’s safer than a full-term pregnancy, the risk associated with a full-term pregnancy. Banning it does nothing but increase the risk and safety to women. We feel no woman should have to undergo a risky invasive procedure because of the politicians’ personal and political agendas. \nHuffPost : It must be exhausting to constantly be litigating and constantly facing these measures that would dramatically affect what you do. \nTN : My father and I are deeply committed to providing our patients with the safest medical care available. This specific law would force us to choose between that commitment, which would literally be a criminal offense, or putting the lives of our patients at increased risk, and that’s totally unethical to us. I don’t think the general public really realizes how these laws are just a severe intrusion into the doctor-patient relationship, and really are going to put the lives of all pregnant women in Kansas at risk. \nHuffPost : How does it feel to have the state’s government telling you how you’re able to perform the procedure? \nTN : Doctors make decision with their patients on the ways to take care of any clinical situation, based on our medical training, our experience, our expertise and evidence-based science. The politicians and their personal or political agendas literally have no business being in that physician-patient process or in our exam rooms. They’re not doctors. \nHuffPost : It's unique for a father-daughter pair to be working together in this way. Why did you decide to pursue this path? \nTN : He used to always take us to the hospital where we'd see his patients. In the beginning that was just fun to go to the doctor’s lounge and eat doughnuts and stuff like that, and the nurses loved seeing us as kids. \nI remember my favorite teddy bear had a big tear in it, and my father did surgery to fix it, and I was like, ‘Oh my God, that’s the best thing ever.’ Since then I’ve done that for my son and he thought it was the greatest thing ever, that I did surgery to repair his favorite monkey. (He’ll kill me if you put that in the article). \nAs I got older I learned that he took care of women and all of the particular medical situations they have, and part of that was learning he did abortions. I don’t think as a young kid I had any idea what that was, but I did know that there were people who picketed our house and our cul de sac every Sunday from 3 to 5 p.m. In the beginning we would actually have to leave the house so our parents could keep us away from all that. Eventually, as we got older that wasn’t something they needed to do. We’d stay home, and we would even be out in the yard playing and ignoring the picketers while we were there because we had such great support from people in the neighborhood. \nWhen I was a senior in high school I got to watch a delivery and thought it was the most beautiful thing ever. In my residency I saw patients who were in situations where they had to make difficult decisions about what was best for them and their families, taking into account their personal beliefs, values, desires and goals for their futures, and I realized how important it is to be someone who will provide abortion services. \nThere are very few ob-gyns who are willing to be brave enough to do it. The majority are pro-choice and will talk to their patients about all three choices you have with a pregnancy, and then they refer their patients here, but they’re not willing to put up with the potential picketers and people not liking you, or the potential shame that is put on you. But they know that there has to be someone who is going to take care of their patients. They refer their patients to us for all different reasons, and a lot of the patients that get referred to us are desired pregnancies, people who find out later in the pregnancy that there’s something not right with the fetus, or the mother’s health is in danger. Those patients get referred to us from all over the Midwest. \nHuffPost : Is there anything else you’d want to share about what it’s like to be a provider in Kansas, with only three clinics performing the procedure? \nTN : It’s a privilege to be a provider in Kansas because the patients need us, and the other doctors in other cities in the Midwest need us. When the laws keep coming down on us, trying to take away the rights of our patients, the other ob-gyns wonder, \"What’s going to happen to our patients if you guys can’t take care of them?\" That is a scary thing, what is going to happen to the patients if we’re not able to take care of them? Also on The Huffington Post Close 10 Myths About Abortion That Need To Be Busted of   REALITY: Over 99.75 percent of abortions do not cause major medical problems. Less than one-quarter of 1 percent of abortions performed in the United States lead to major health complications, according to a 2014 study from the University of California, San Francisco, that tracked 55,000 women for six weeks after their abortions. The researchers note that this makes an abortion statistically about as risky as a colonoscopy. If that fact seems surprising, consider how American pop culture misrepresents the risks of abortion: Nine percent of film and television characters who have abortions die as a direct result of the procedure, according to another 2014 study from UCSF. REALITY: About one in five abortions are medical abortions. The Centers for Disease Control and Prevention found that 19 percent of abortions in 2011 were medical abortions and that 28.5 percent of those took place in the first nine weeks of pregnancy. The Guttmacher Institute also found that medical abortions increased substantially from 2008 to 2011, meaning more women have ended their pregnancies with this alternative to surgery. REALITY: Most women will not regret their decision, and are no more likely to experience mental health problems than women who carry an unplanned pregnancy to term. While many women experience mixed emotions after an abortion, 95 percent of women who have abortions ultimately feel they have made the right decision, according to an August 2013 study from UCSF. \"Experiencing negative emotions postabortion is different from believing that abortion was not the right decision,\" the researchers explained. Furthermore, while unplanned pregnancies often cause emotional stress, there is no evidence to suggest that women who choose to terminate their pregnancies will be more likely to suffer from mental health issues, according to a 2008 report from the American Psychological Association that investigated all relevant medical studies published since 1989. The APA found that past studies claiming abortion causes depression and other mental health problems consistently failed to account for other risk factors, particularly a woman's medical history. The APA accounted for these factors and found that, among women who have an unplanned pregnancy, those who have abortions are no more likely to experience mental health problems than those who carry the pregnancy to term. REALITY: Fetuses cannot feel pain until at least the 24th week of pregnancy. Experts ranging from Britain’s Royal College of Obstetricians and Gynaecologists to the American Congress of Obstetricians and Gynecologists agree with that timeline. In fact, research from UCSF found that fetuses can't perceive pain before 29 or 30 weeks of development. Then why have so many states banned abortions after 20 weeks of pregnancy? Perhaps misrepresentation of research is partly to blame: Many of the researchers most frequently cited by pro-life politicians told The New York Times that their research does not prove anything about fetal pain. REALITY: Most Americans support a woman's right to choose. According to a Gallup poll from 2014, 78 percent of Americans think abortion should be legal in some or all circumstances. (Fifty percent said \"some circumstances,\" while 28 percent said all.) What's more, in 2012, Gallup found that 61 percent of Americans think abortions that take place during the first trimester of pregnancy should be legal. (Nine out of 10 abortions in the U.S. do take place during that time period, according to Guttmacher.) REALITY: The abortion rate in the United States is the lowest it's been since 1973. The abortion rate has been on the decline for years, and hit its lowest level in 2011, according to the latest data available from the Guttmacher Institute. The study's author partially credited the decline to better contraceptive use and more long-term contraceptive options, such as the IUD. REALITY: Women face a growing number of barriers to accessing abortions. More than 57 percent of American women live in states that are hostile or extremely hostile to abortion rights, according to the Guttmacher Institute. That represents a marked increase from 2000, when 31 percent of American women lived in such states. In 2011, 89 percent of counties in America had no abortion clinics. This is no accident: Across the U.S., lawmakers have enacted 231 new abortion restrictions over the past four years, according to a Guttmacher analysis from January 2015. As a result, many women have to travel great distances to reach an abortion clinic, where they may face 24-hour wait periods. These barriers particularly affect women living in rural areas and low-income women, who often can't afford to take time off work and pay for gas and a hotel room. Other laws force women to go through potentially distressing procedures, such as viewing their own ultrasound photos, in order to move forward with an abortion. REALITY: Women rarely cite pressure from family or partners as leading to their decision to abort. A 2005 study from the Guttmacher Institute found that less than 1 percent of women surveyed cited such pressure among their main reasons for having an abortion. A 2013 study from UCSF reached a similar conclusion, and found that while women rarely cited partner coercion as a reason they sought an abortion, many did cite the desire to escape a bad relationship or domestic violence. REALITY: Most women who have abortions are already mothers. Sixty-one percent of women who had abortions in 2008 were mothers, and 34 percent had two or more children, according to the Guttmacher Institute. That number only increased after the 2009 financial downturn. The National Abortion Federation told Slate that between 2008 and 2011, 72 percent of women seeking abortions were already mothers. A study from Guttmacher found that mothers typically have abortions to protect the children they already have; they simply cannot afford to raise another child. REALITY: Requiring abortion clinics to meet these standards does little to improve patient safety and forces many to shut down. Currently, 22 states require abortion clinics to meet a set of restrictive and often arbitrary standards, dictating that they be close to hospitals and that their hallways and closets meet certain measurements. Clinics often need to undergo expensive renovations in order to comply, and leading doctors' groups say the laws do little to improve patient safety. What's more, 11 states now require that doctors at abortion clinics obtain admitting privileges at a nearby hospital, but many hospitals flat-out refuse to grant these privileges. As a result, hospitals essentially have the power to shut down nearby clinics.  Share", "external_links": [], "published": "2015-06-05T16:45:00.000+03:00", "crawled": "2015-06-05T21:44:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}