{"organizations": [], "uuid": "6b8a21689b7dc9992e99cc1c475b298c396b1389", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_063015getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/246559-confident-obama-not-satisfied-with-his-best-week-ever", "country": "US", "title": "Confident Obama not satisfied with his 'best week ever'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Confident Obama not satisfied with his 'best week ever'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T21:37:00.000+03:00", "replies_count": 0, "uuid": "6b8a21689b7dc9992e99cc1c475b298c396b1389"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/246559-confident-obama-not-satisfied-with-his-best-week-ever", "ord_in_thread": 0, "title": "Confident Obama not satisfied with his 'best week ever'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Confident Obama not satisfied with his 'best week ever' Getty Images By Jordan Fabian - 06/30/15 02:37 PM EDT \nPresident Obama said Tuesday he is not letting his foot off the gas pedal following a string of victories some are calling his \"best week ever.\" ADVERTISEMENT Obama said he plans to harness momentum from wins at the Supreme Court and in Congress to complete the unfinished business left on his agenda.\n“The list is long,” Obama said during a press conference with Brazilian President Dilma Rousseff. “We are going to squeeze every last ounce of progress that we can make as long as I have the privilege of holding this office.” \nAlthough he acknowledged some items would be “left undone,” Obama cited bipartisan criminal justice reform, a long-term highway bill and implementing a sweeping new rule on overtime pay as some of his top remaining goals before he leaves office in January, 2017. \nObama has exuded confidence since he racked up a series of wins last week that helped cement some of his key legacy achievements. \nThe Supreme Court upheld a central provision of his signature healthcare law and legalized same-sex marriage nationwide. Congress, meantime, passed a package of trade bills that are at the top of the president’s second-term economic agenda. \nThe president also delivered an impassioned call for America to confront gun violence and racism last Friday during an emotional eulogy for one the nine victims of a mass shooting at a historic black church in South Carolina. \nObama’s week of wins was only stopped by an unfavorable Supreme Court ruling Monday against his administration’s rules governing toxic emissions from coal-fired power plants. \nAfter being dogged for months by concerns about the growing threat posed by the Islamic State in Iraq and Syria (ISIS) and other domestic challenges, Obama’s image has improved. His approval rating ticked up to 50 percent for the first time in two years, according to a new CNN/ORC poll . \n“I feel pretty excited about it,” Obama said of his remaining time in office. “I might see if we can make next week even better.” \nObama’s loose demeanor was on display on Tuesday. Told by a reporter that some have called last week his best ever, the president demurred. \n“I will tell you,[the best week] was marrying Michelle. That was a really good week,” he said. “Malia and Sasha being born, excellent weeks. There was a game where I scored 27 points.” \nObama, who has sometimes had a cool relationship with the White House press corps, joked that he would not mind taking more questions from reporters. \n“I love press conferences. It's my press team that's always holding me back,” he said. “I want to talk to you guys every day.” \nObama then turned to his press secretary Josh Earnest, who was sitting in the front row, and said, “sorry, Josh.” \nThe president also said it was “pretty cool” the White House was lit up rainbow colors the evening of the Supreme Court’s ruling on same-sex marriage, although he did not get a chance to see the lights himself. \n“To see people gathered in an evening outside on a beautiful summer night and to feel whole and to feel accepted and to feel that they had a right to love, that was pretty cool,” he said. “That was a good thing.”", "external_links": [], "published": "2015-06-30T21:37:00.000+03:00", "crawled": "2015-06-30T22:42:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}