{"organizations": [], "uuid": "0aebfa6943d9994933f345b3ec118841a5d795bd", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_4275868144001_060415-on-rubiocandidates-640.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/04/rubio-defends-record-on-immigration-talks-clinton-wu-tang-clan/", "country": "US", "title": "Rubio defends immigration record, talks Clinton, Wu-Tang Clan", "performance_score": 1, "site": "foxnews.com", "participants_count": 3, "title_full": "Rubio defends immigration record, talks Clinton, Wu-Tang Clan | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T03:00:00.000+03:00", "replies_count": 2, "uuid": "9fb24a0024e72cab1a34b832d7084843357842f3"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/04/rubio-defends-record-on-immigration-talks-clinton-wu-tang-clan/#post-0", "ord_in_thread": 0, "title": "Rubio defends immigration record, talks Clinton, Wu-Tang Clan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print \nWASHINGTON –   Republican presidential candidate Sen. Marco Rubio defended his immigration stance Thursday, denying he had flip-flopped in backing away from comprehensive immigration legislation. \n“We do have to address this issue,” he said on Fox News’ “Outnumbered.” “The only thing I am arguing differently than what I did three years ago is that we can’t do it in one single step.” \nRubio has come under attack by some who say he bent to political pressure in 2013 and wound up abandoning immigration legislation he once supported. The Florida senator, though, argues the country's flawed immigration system still needs to be fixed, just in a different way. \nRubio and his Florida rival former Gov. Jeb Bush -- set to announce his presidential bid later this month -- have both voiced support for comprehensive immigration reform. Both have endorsed allowing some illegal immigrants already in the country to attain “legal status.” \nDuring his appearance on \"Outnumbered,\" Rubio also took Democratic presidential frontrunner Hillary Clinton to task about avoiding questions from the media and said her hesitation could harm her in the long run.\n“I think for the average voter over time it will become an issue. Maybe not today but certainly over time,” he said. “People are going to begin to wonder why is it she is not holding herself up to the same standards [as the people on the other side of the aisle].”\n“Her advisers are putting her in a very delicate position,” he said.\nRubio also said Clinton needed to come clean with Americans about her time as secretary of state.\n“How do you answer for the abysmal foreign policy approach that this White House has taken … whether it’s the reset in Russia or pulling out of Iraq too early, mismanaging the Libya experience?” Rubio said. “I think they have a lot to answer for and it’s one of the reasons why she doesn’t want to be exposed so early to these questions.”\nDuring the Fox News interview, Rubio also discussed the crowded Republican field and shared personal stories about his life. The self-professed hip-hop super-fan seemed at a loss, though, when asked to identify his favorite member of Wu-Tang Clan. \n\"That's, like, early '90s stuff,\" he said, adding that he likes listening to Miami's Pitbull, though \"not with my kids there.\"\n ", "external_links": [], "published": "2015-06-04T03:00:00.000+03:00", "crawled": "2015-06-04T23:55:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}