{"organizations": ["Congress", "IRS", "U.S. Supreme Court", "Supreme Court"], "uuid": "ce5449006877c2ed2397031bb870767f7c6e079a", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/08/politics/obamacare-supreme-court-obamacare-challenge/index.html", "country": "", "title": "Obama: No Plan B on health care law - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama: No Plan B on health care law - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ce5449006877c2ed2397031bb870767f7c6e079a"}, "author": "", "url": "http://www.cnn.com/2015/06/08/politics/obamacare-supreme-court-obamacare-challenge/index.html", "ord_in_thread": 0, "title": "Obama: No Plan B on health care law - CNNPolitics.com", "locations": ["Washington", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Samuel Alito Jr.", "Stephen Breyer", "Barack Obama", "Bush", "Bill Clinton", "George W. Bush", "Sandra Day O'Connor", "Scalia", "Michael Carvin", "William Rehnquist", "Ruth Bader Ginsburg", "Ronald Reagan", "Stephen G. Breyer", "Samuel A. Alito Jr.", "Elena Kagan", "Roberts", "Obama", "Sonia Sotomayor", "Anthony M. Kennedy", "Clarence Thomas", "George H. W. Bush", "Donald B. Verrilli Jr.", "John G. Roberts", "Carvin", "Antonin Scalia", "Thurgood Marshall"], "text": "Obamacare at the Supreme Court in less than three minutes 02:52 Washington (CNN) President Barack Obama on Monday defended his administration's decision not to present a \"Plan B\" in case the Supreme Court rules that federal tax credits are not available to help millions of Americans afford health insurance. Challengers to the Affordable Care Act say the law does not authorize federal subsidies for those living in 34 states that rely on federally facilitated marketplace exchanges. They say the law only authorizes subsidies for those living in the 16 states with state-run exchanges. The Supreme Court is currently considering whether the IRS interpreted the law correctly to allow subsidies for eligible Americans nationwide. A decision is expected by June. RELATED: The other challenge to Obamacare \"There is no reason why the existing exchanges should be overturned through a court case,\" the President said at an overseas news conference while attending the G7 Summit. \"It has been well documented that those who passed this legislation never intended for folks who were going through the federal exchange not to have their citizens get subsidies.\" \"This should be an easy case,\" he said. He then seemed to launch a dig at the Court for agreeing to hear the case in the first place. \"Frankly, it probably shouldn't even have been taken up,\" he said. The President didn't hesitate to outline the impact of an adverse ruling. \"It means that millions of people who are obtaining insurance currently with subsidies suddenly aren't getting those subsidies; many of them can't afford it; they pull out; and the assumptions that the insurance companies made when they priced their insurance suddenly gets thrown out the window. And it would be disruptive -- not just, by the way, for folks in the exchanges, but for those insurance markets in those states, generally,\" Obama said. But challengers to the law say the words \"established by the State\" in a subsection of the law made clear that subsidies were only available to those living in the 16 states that set up their own exchanges. They argue that Congress limited the subsidies in order to encourage the states to set up their own exchanges. But when only a few states acted, the IRS tried to \"fix\" the law. Today's Supreme Court 10 photos The justices of the U.S. Supreme Court sit for their official photograph on October 8, 2010, at the Supreme Court. Front row, from left: Clarence Thomas, Antonin Scalia, Chief Justice John G. Roberts, Anthony M. Kennedy and Ruth Bader Ginsburg. Back row, from left: Sonia Sotomayor, Stephen Breyer, Samuel Alito Jr. and Elena Kagan. Hide Caption 1 of 10 Today's Supreme Court 10 photos John G. Roberts – In 2005, Chief Justice John G. Roberts was nominated by President George W. Bush to succeed Justice Sandra Day O'Connor as an associate justice. After Chief Justice William Rehnquist died, however, Bush named Roberts to the chief justice post. The court has moved to the right during his tenure, although Roberts supplied the key vote to uphold President Barack Obama's Affordable Care Act. Hide Caption 2 of 10 Today's Supreme Court 10 photos Antonin Scalia – Justice Antonin Scalia was appointed by President Ronald Reagan in 1986 to fill the seat vacated by Justice William Rehnquist when he was elevated to chief justice. A constitutional originalist -- and a colorful orator -- Scalia is a member of the court's conservative wing. He is currently the court's longest-serving justice. Hide Caption 3 of 10 Today's Supreme Court 10 photos Anthony M. Kennedy – Justice Anthony M. Kennedy was appointed to the court by President Ronald Reagan in 1988. He is a conservative justice but has provided crucial swing votes in many cases, writing the majority opinion, for example, in Lawrence v. Texas, which struck down that state's sodomy law. Hide Caption 4 of 10 Today's Supreme Court 10 photos Clarence Thomas – Justice Clarence Thomas is the second African-American to serve on the court, succeeding Justice Thurgood Marshall when he was appointed by President George H. W. Bush in 1991. He is a conservative, a strict constructionist who supports states' rights. Hide Caption 5 of 10 Today's Supreme Court 10 photos Ruth Bader Ginsburg – Justice Ruth Bader Ginsburg is the second woman to serve on the Supreme Court. Appointed by President Bill Clinton in 1993, she is a strong voice in the court's liberal minority. Hide Caption 6 of 10 Today's Supreme Court 10 photos Stephen G. Breyer – Justice Stephen G. Breyer was appointed to the court in 1994 by President Bill Clinton. He is considered a member of the court's liberal minority. Hide Caption 7 of 10 Today's Supreme Court 10 photos Samuel A. Alito Jr. – Justice Samuel A. Alito Jr. was appointed by President George W. Bush in 2006 and is known as one of the most conservative justices to serve on the court in modern times. Hide Caption 8 of 10 Today's Supreme Court 10 photos Sonia Sotomayor – Justice Sonia Sotomayor is the court's first Hispanic and third female justice. She was appointed by President Barack Obama in 2009 and is regarded as a resolutely liberal member of the court. Hide Caption 9 of 10 Today's Supreme Court 10 photos Elena Kagan – Justice Elena Kagan is the fourth female justice and a member of the court's liberal wing. She was appointed in 2010, at the age of 50, by President Barack Obama and is the court's youngest member. Hide Caption 10 of 10 \"If the rule of law means anything it is that text is not infinitely malleable, and that agencies must follow the law as written -- not to revise it to 'better' achieve what they assume to have been Congress's purposes, \" wrote Michael Carvin, an attorney for the challengers, in court papers. \"This case may be socially consequential and politically sensitive, but that only heightens the importance of judicial fidelity to the rule of law and well-established interpretive principles,\" Carvin wrote. At oral arguments, Justice Antonin Scalia suggested Congress could step in and fix the problem. \"Congress adjusts, enacts a statute that takes care of the problem. It happens all the time,\" he said. \"Why is that not going to happen here?\" \"Well, this Congress your honor?\" Solicitor General Donald B. Verrilli Jr. said to laughter. Obama was pressed at Monday's press conference after the G7 Summit as to whether the administration should issue a \"Plan B\" in case it loses. \"I want to just make sure that everybody understands that you have a model where all the pieces connect. And there are a whole bunch of scenarios not just in relation to health care, but all kinds of stuff that I do, where if somebody does something that doesn't make any sense, then it's hard to fix,\" the President said. \"And this would be hard to fix. Fortunately, there's no reason to have to do it. It doesn't need fixing.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Supreme Court ", "external_links": [], "published": "2015-06-08T03:00:00.000+03:00", "crawled": "2015-06-09T02:04:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}