{"organizations": ["Texas Legalizes Medical Marijuana Oils For Epilepsy Texas Legalizes Medical Marijuana"], "uuid": "48d5d43571b019a54223a99dff4659e8c6372d3b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3019012/images/o-GREG-ABBOTT-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/01/texas-legalizes-marijuana_n_7486232.html", "country": "", "title": "Texas Legalizes Medical Marijuana Oils For Epilepsy", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Texas Legalizes Medical Marijuana Oils For Epilepsy", "spam_score": 0.0, "site_type": "news", "published": "2015-06-01T23:59:00.000+03:00", "replies_count": 0, "uuid": "48d5d43571b019a54223a99dff4659e8c6372d3b"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/01/texas-legalizes-marijuana_n_7486232.html", "ord_in_thread": 0, "title": "Texas Legalizes Medical Marijuana Oils For Epilepsy", "locations": ["Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Greg Abbott", "BRENDAN SMIALOWSKI"], "text": "Texas Legalizes Medical Marijuana Oils For Epilepsy Posted: Updated: 42 minutes ago Texas Governor Greg Abbott (R). (Photo credit should read BRENDAN SMIALOWSKI/AFP/Getty Images) | BRENDAN SMIALOWSKI via Getty Images reddit \nTexas Gov. Greg Abbott (R) signed a bill Monday legalizing the limited use of marijuana extracts for severe forms of epilepsy. \nThe law allows the use of cannabis oils that are high in CBD, or cannabidiol, a non-euphoric compound found in the marijuana plant, and low in THC -- the main psychoactive ingredient found in marijuana associated with the \"high\" sensation -- to treat intractable epilepsy. The state will oversee the regulation and distribution of the cannabis oils, which are only available to patients who have tried at least two traditional epilepsy medications and have not found them to be effective. The patient must also get the approval of two doctors before being able to take advantage of the new law. \nWhile marijuana policy reformers are critical of laws like the one signed today for not providing fuller access to medical marijuana, Heather Fazio, Texas political director for Marijuana Policy Project, still saw today as a historic moment for Texas. \n“While this program leaves most patients behind and we’re concerned about its functionality, today is one for the history books,\" Fazio said. \"The Texas Legislature is sending a resounding message: Marijuana is medicine. We commend our Texas lawmakers and look forward to continuing this conversation when the 85th Legislature convenes in 2017.” \nAbbot's signing makes Texas the 15th state to allow for limited medical use of marijuana-derived oils. Twenty-three other states have adopted broader laws that allow for some form of legal and regulated cultivation, sale or production of multiple strains of medical marijuana for multiple debilitating conditions. The federal government considers all forms of marijuana to be illegal and classifies the plant as one of the \"most dangerous\" with no medical value. \nCBD has been found to be effective not only at treating epilepsy , but also at stopping metastasis of many kinds of aggressive cancer and at killing cancerous cells found in leukemia patients . But critics of these limited CBD extract bills contend that while support for low-THC/high-CBD laws is growing, the laws are too restrictive, as there is research suggesting that THC may also be effective in treating epilepsy . \nAccording to the bill, at least three CBD oil-dispensing organizations must be approved by the Texas Department of Public Safety by Jan. 1, 2018, provided that at least three dispensary applicants in the state have been approved by that time. Also on HuffPost: Sick Children Treated With Cannabis of   Maggie has been suffering from seizures since she was six weeks old, and has hundreds of seizures on any given day. Her family relocated from Tennessee to Colorado late last year to use a combination of intensive therapy and cannabis oil to treat her symptoms. Hunter suffers from intractable epilepsy and developmental delay. He's been on numerous medications that have failed to alleviate his seizures and he continues to decline \"cognitively, physically and emotionally,\" according to his mother. He recently started cannabis treatments in the hopes that cannabidiol can provide relief. Piper was born with a rare genetic disorder that causes her to suffer from seizures and has rendered her non-verbal, unable to crawl or walk and visually impaired. She has been on nine medications to try to treat her symptoms, and started taking cannabis oil last October. Since she began taking a low dose of cannabis, her family has begun to see small improvements. Calvin has an extreme form of autism that has rendered him nonverbal. After 22 days of taking cannabis, he has begun using words to communicate. According to his mother, he used to have up to 20 head-beating episodes per day, and has only had one episode total in the three weeks he's been using cannabis. \"I cried everyday for the first week of him using cannabis,\" his mother wrote on Montanez's blog. \"We no longer had to pull over and restrain him on our way to therapy.\" Sydni suffers from Doose syndrome, which causes her to have up to thousands of seizures each day. She functions at the academic level of a three-year-old and takes nine different medications. Her family recently started her on cannabis oil in the hopes that it will reduce her seizures. Emily suffers from a debilitating form of epilepsy that has yet to be diagnosed. Her family recently moved from Indiana to Colorado in the hopes that a cannabis prescription will help ease her seizures. Jordan was diagnosed with Dravet syndrome when she was six months old and has suffered from seizures for her entire life. On her worst days, she's unable to eat, drink or function. Her family recently relocated from Cleveland to Colorado to try cannabis treatments. Tyler has a rare, drug-resistant form of epilepsy called Lennox-Gastaut Syndrome. He has spent months living in the hospital and has been placed in two medically induced comas. He began taking a low dose of cannabis in October and his family has begun to see \"small victories.\" Kennedee was born with Walker-Warburg Syndrome, a severe and rare form of muscular dystrophy that claimed her older sister's life when she was just two months old. When Kennedee was born, she was only given a few months to live. Since starting her cannabis treatment, \"we have seen a personality we didn't know she had,\" her mother wrote on Montanez's blog. Charlie suffers from Dravet Syndrome and has seizures in the middle of the night, every night. His family hopes his use of cannabis oil will make him able to communicate and reduce his dependence on other drugs. Cora was born with a rare multiple-malformation syndrome that causes her to have body and head overgrowth and various abnormalities of her brain, limbs and vascular system. She also suffers from dozens of seizures a day, has undergone multiple surgeries and uses a head switch to communicate. Her parents are beginning to explore cannabis treatments as a means for relief. KC has suffered from multiple daily seizures since he was three years old and has yet to respond to any treatments. After two weeks using cannabis, he began exhibiting progress. \"A boy who would previously wobble and stumble as he walked was now running up hiking trails and jumping into his dad's arms,\" his mother wrote on Montanez's blog. \"He has even been cracking jokes!\" Charlotte used to suffer from more than 40 seizures per day, and now, according to her mother, \"her wheelchair and seizure helmet are in storage collecting dust.\" Charlotte was the first child in Colorado to be treated with cannabis oil, and her story inspired the name \"Charlotte's Web,\" which is the high-cannabidiol, low-THC strain used to treat other children with similar conditions. Since he was just a few months old, Zaki suffered from up to thousands of seizures per day. He has been seizure-free since he started taking cannabis oil more than a year ago.  Share ", "external_links": [], "published": "2015-06-01T23:59:00.000+03:00", "crawled": "2015-06-01T23:59:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}