{"organizations": [], "uuid": "905177adc25278df140e2b1777d536c819c642a2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_061715getty.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/245362-trade-looms-over-white-house-picnic-for-obama-lawmakers", "country": "US", "title": "Trade looms over White House picnic for Obama, lawmakers", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trade looms over White House picnic for Obama, lawmakers", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T02:24:00.000+03:00", "replies_count": 0, "uuid": "905177adc25278df140e2b1777d536c819c642a2"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/245362-trade-looms-over-white-house-picnic-for-obama-lawmakers", "ord_in_thread": 0, "title": "Trade looms over White House picnic for Obama, lawmakers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trade looms over White House picnic for Obama, lawmakers Getty Images By Jordan Fabian - 06/17/15 07:24 PM EDT \nPresident Obama hosted members of Congress for the congressional picnic on Wednesday amid a fierce trade debate on Capitol Hill. \nThe annual White House event, which includes a barbecue and outdoor games, is typically a chance for the president to spend casual time with lawmakers and their families. ADVERTISEMENT In brief remarks to the legislators standing under cloudy skies on the South Lawn, Obama addressed the contentious debates that consume Capitol Hill, a subtle nod to the trade fight that has divided the president and congressional Democrats.\n“Obviously, democracy can be contentious,” Obama said. “There are times when people have deep, principled disagreements. But I hope events like today remind us that ultimately we’re on the same team and that’s the American team.” \nOur job together “is to make sure we are true to that commitment and true to these values,” the president added. \nThe president said he would keep his remarks short in order to greet as many people as he could, but he joked he couldn’t honor all selfie requests. \n“I want to warn in advance, I can't do a selfie with everybody,” he said. \nSomeone shouted “how about a kiss?” \n“A kiss I can give ya,\" the president replied. \nThis year’s gathering took place one day before the House was expected to hold a vote to revive the president’s stalled trade agenda, and less than one week after Democrats killed a key part of the legislative package. \nHouse Minority Leader Nancy Pelosi (D-Calif.) was in attendance at the picnic. The president has not spoken with her personally since she led the Democratic revolt against the trade bills. \nThe event is seen as an opportunity for the president to get face time with lawmakers in a low-pressure setting. That could prove to be important for Obama with the House set for a re-vote on fast-track trade authority and a measure to provide aid to U.S. workers displaced by international trade. \nOn the South Lawn, food was set up buffet-style on tables covered in red, white, or blue tablecloths. Lawmakers had a choice of hamburgers, cheeseburgers, veggie burgers, chicken, fries, nachos, ice cream and cookies. \nThe U.S. Marine Band entertained the crowd. \nLast Thursday, Obama made a surprise appearance at the Congressional Baseball Game to spend time with lawmakers in a relaxed setting before the House's big trade vote. \nThe president didn’t bring up the fact he suffered a defeat the next day, but he praised members for their skills on the diamond. \n“I do want to also say how wildly impressed i was at the quality of baseball when I went out to Nats stadium the other day,” Obama said. “You guys actually looked like you knew what you were doing. [Sen. Jeff] Flake, I saw you man, at bat. You were alright.” \nThe picnic followed a flurry of activity at the White House and Capitol as the White House and Republicans crafted the plan to move forward on trade. Just over an hour before the picnic was to begin, Obama met with a group of pro-trade members of Congress. \nThe White House downplayed the picnic as an opportunity for the president to twist arms. \n“This is a nice opportunity for members of Congress from both parties to spend time with their families on a nice summer evening on the South Lawn of the White House,” spokesman Josh Earnest said Wednesday. “And it is a good-will gesture and a purely social occasion.”", "external_links": [], "published": "2015-06-18T02:24:00.000+03:00", "crawled": "2015-06-18T03:27:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}