{"organizations": [], "uuid": "5fe8920f15e7cbdebc7f49ac7298563ec34417ca", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed#", "section_title": "The Hill - Administration", "url": "http://thehill.com/policy/international/244264-obama-promises-ramped-up-assistance-to-iraq", "country": "US", "title": "Obama promises ramped-up assistance to Iraq", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama promises ramped-up assistance to Iraq", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T17:15:00.000+03:00", "replies_count": 0, "uuid": "5fe8920f15e7cbdebc7f49ac7298563ec34417ca"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/international/244264-obama-promises-ramped-up-assistance-to-iraq", "ord_in_thread": 0, "title": "Obama promises ramped-up assistance to Iraq", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama promises ramped-up assistance to Iraq By Jordan Fabian - 06/08/15 10:15 AM EDT \nThe Iraqi government and the U.S.-led coalition fighting the Islamic State in Iraq and Syria need improved coordination to defeat the extremist group, President Obama said Monday. \nObama met with Iraqi Prime Minister Haider al-Abadi on the sidelines of the Group of Seven (G-7) summit in Germany, as the administration’s strategy to fight the extremist group has come under fire. ADVERTISEMENT Obama said success is dependent on an “effective partnership” between Iraq and coalition partners, and stressed the need to “coordinate more effectively in getting weapons in the hands of” anti-ISIS forces. \n“The U.S. is going to continue to ramp up training and assistance,” Obama told reporters. \n“I am confident that, although it is going to take time, we are going to be successful. ISIL is going to be driven out of Iraq and ultimately it is going to defeated,” said Obama, who used another acronym to describe the group. \nThe meeting between Obama and al-Abadi is the first since ISIS took control of the city of Ramadi last month, a major blow for the international coalition’s campaign against the group. \nAl-Abadi called for greater international support for Iraqi ground forces during a meeting of coalition partners in Paris last week. \nThe Iraqi leader said he appealed for increased assistance in cutting off the group’s recruiting pipeline during meetings with G-7 officials over the weekend. \n“ISIL recruiting must be stopped, and this can be done via a global intelligence sharing effort,” Abadi said. \nThere are approximately 3,000 U.S. troops training and equipping Iraqi forces, but they do not serve in combat roles. \nIn addition, the government has sent 2,000 anti-tank missiles to Iraq to help combat ISIS’s use of car bombs placed inside armored vehicles. The administration has also pledged to speed up other weapons shipments. \nLast month, Iraqi officials were angered when Defense Secretary Ashton Carter said Iraqi troops who were routed in Ramadi showed “no will to fight.” That prompted Vice President Biden to smooth over tensions and pledge support for Iraqi forces in a phone call with al-Abadi. \nAl-Abadi framed it as a temporary setback and expressed confidence Iraqi forces would fight to retake the city. \n“We lost only temporarily in Ramadi,” he said. ”We'll continue all our efforts.” Tags: Past: 1 day Obama: 'We don't yet have a... The president said Iraq must show a greater commitment to fighting ISIS. Republicans wield power of the... A bill to fund the Justice Department is the latest front in the battle... Boehner: We don't have votes yet... \"I don't think we're quite there yet,\" the Speaker said. GOP open to extending ObamaCare... Conservatives are hinting at support for a temporary extension if court... GOP’s top 10: Who's making the... The unlucky number for GOP presidential candidates in this election cycle... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Republicans aim to use DOJ funding... House Republicans are seeking to roll back a number of controversial gun... Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Uber’s business model under fire Labor groups say contractors look suspiciously like employees. Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-08T17:15:00.000+03:00", "crawled": "2015-06-08T23:07:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}