{"organizations": [], "uuid": "1a102f504a773d6b5a25c9dbefa733810d2c95a9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/laguardia_americaneagle_airport_082313getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/243856-obama-to-seek-cut-in-airplane-emissions", "country": "US", "title": "Obama to seek cut in airplane emissions", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to seek cut in airplane emissions", "spam_score": 0.0, "site_type": "news", "published": "2015-06-03T15:36:00.000+03:00", "replies_count": 0, "uuid": "1a102f504a773d6b5a25c9dbefa733810d2c95a9"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/243856-obama-to-seek-cut-in-airplane-emissions", "ord_in_thread": 0, "title": "Obama to seek cut in airplane emissions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to seek cut in airplane emissions By Timothy Cama - 06/03/15 08:36 AM EDT \nThe Obama administration has decided to propose cutting greenhouse gas emissions from aircraft. \nThe Environmental Protection Agency (EPA) will announce as soon as this week its conclusion that carbon dioxide from commercial airliners harms the public health or welfare, the New York Times reported . ADVERTISEMENT The official “endangerment finding” would set off a process leading toward regulations to limit the emissions, which account for 11 percent of the transportation sector’s greenhouse gases and 3 percent of the country’s total.\nIt would follow major rules the Obama administration has enforced or proposed to limit greenhouse gases from cars, trucks and power plants, the latter of which have been extremely controversial. \nGiven the difficulties in regulating airplanes, the rules are likely to focus heavily on improving the efficiency of aircraft and their engines, the Times said. \nThe EPA’s regulatory framework would probably seek to align the United States with the International Civil Aviation Organization’s ongoing process for setting worldwide emissions standards for airplanes, in an effort to set a level playing field for an international industry, according to the Times. \nBut environmental groups are hoping that the EPA will go beyond what the international body is doing and prevent more emissions. \nA federal court ruled in 2011 that the EPA is obligated to undertake the process of determining whether an endangerment finding is necessary for aircraft. \nFacing the threat of another lawsuit from environmentalists, the EPA announced in September that it would study the issue. Under the schedule, the agency is due to formally propose regulations next spring if it decides they’re warranted. Tags: Paul joins crusade to expose... The Bush administration blacked out 28 pages extracted from a... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-03T15:36:00.000+03:00", "crawled": "2015-06-03T18:42:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}