{"organizations": [], "uuid": "128ac18cf0174b9c1b6895fd2a21296152aaf664", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2960724/images/o-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/ethics/feed", "section_title": "Ethics on Huffington Post", "url": "http://www.huffingtonpost.com/david-a-grimes/abortion-in-texas-lessons_b_7649860.html", "country": "US", "title": "David A. Grimes: Abortion in Texas: Lessons From Prohibition", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "David A. Grimes: Abortion in Texas: Lessons From Prohibition", "spam_score": 0.0, "site_type": "news", "published": "2015-06-29T14:08:00.000+03:00", "replies_count": 0, "uuid": "128ac18cf0174b9c1b6895fd2a21296152aaf664"}, "author": "David A. Grimes", "url": "http://www.huffingtonpost.com/david-a-grimes/abortion-in-texas-lessons_b_7649860.html", "ord_in_thread": 0, "title": "David A. Grimes: Abortion in Texas: Lessons From Prohibition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: scATX \nRepeating history The recent bevy of abortion regulations in Texas may close most abortion clinics in the state. Ironically, Texas is the home of Roe v. Wade , the 1973 U.S. Supreme Court decision that struck down restrictive state laws as unconstitutional. Henry Wade was the District Attorney of Dallas County. Roe v. Wade ruled that state restrictions on abortion violated numerous civil rights , including those protected by the First, Fourth, Fifth, Ninth and Fourteenth Amendments to the Constitution. \nDespite more than a decade of extraordinary abortion safety, a subsequent Supreme Court decision in Planned Parenthood v. Casey opened the door to state interference with a woman's access to abortion. It allowed state abortion restrictions, provided they did not pose an undue burden on a woman's access to abortion. That hopelessly ambiguous criterion and the recent Republican takeover of many state legislatures led to an epidemic of state laws based not on public health but, rather, on personal opinions. In the first quarter of 2015, more than 300 such bills have been introduced in state legislatures...all in the absence of any public health need. \nTurning back the clock on women Republicans sponsoring this legislation apparently have a short memory. They appear unaware of the reasons why physicians and clergy led the drive five decades ago to liberalize abortion laws: American women were suffering and dying in large numbers. They could not countenance the needless carnage. For example, in 1947, the year that I was born, more than 700 U.S women died from unsafe abortion, and the population of the nation was half that of today. In Texas, 33 women were reported to have died from unsafe abortion in 1947, which is about three times the numbers who die annually in the entire United States today. Clandestine abortion in Texas was common and dangerous. \nAbortion has been with us as long as has pregnancy. It will not go away. Should safe, legal abortion become inaccessible (the goal of Republicans), women in large numbers will choose other options. Some will travel long distances at great expense to obtain safe care. Some will attempt to abort themselves . Others will turn to the back alley . \nThe deadly lessons of Prohibition A century ago, \" do-gooders of the day \" led the charge to restore the virtues of the nation and abolish alcohol consumption. After ratification of the 18th Amendment, the nation went dry in January of 1920. Consumption of alcohol was not banned; the manufacture, distribution, sale and transport were outlawed. Affluent citizens were able to skirt the law; the poor were less fortunate. During Prohibition, an estimated 10,000 Americans died from consuming poisoned beverages, including denatured alcohol, methyl alcohol and Sterno, a canned heating fuel. \nLiquor poured into a sewer after a raid in New York City Photo: Library of Congress \nGangsters fill the void When the bars closed, illegal \"speakeasies\" quickly met the public's quest for spirits. By 1925, an estimated 100,000 illegal drinking establishments were operating in New York City alone. Before Prohibition, Cleveland had 1200 bars; by 1923 an estimated 3,000 \"speakeasies\" were operating. Corruption and contempt for the law were rampant. The true beneficiaries of Prohibition were criminals , like Al Capone and Arnold Rothstein. Enforcement of Prohibition proved impossible. When the stunning failure of this \"noble experiment\" became incontrovertible, the 21st Amendment repealed this dangerous social policy in 1933. \nThe tragic legacy of Prohibition Prohibition had little net effect on personal drinking. Instead, Prohibition spawned dangerous alternatives to safe alcohol, corruption of police and public officials, racketeering and international travel to access safe liquor. Thousands of Americans died needlessly as a result of well-intended \" social reformers \" forcing their views on the nation. After the repeal of Prohibition, states and municipalities could choose to remain dry. For example, Mississippi finally repealed Prohibition in 1966. Still today, \"red\" states with the poorest health status of women and children are those with the most regressive social policies . \nThe largest still in captivity \nProhibition's \" evil consequences \" \nThe Rev. Sam Small, an evangelist and temperance advocate, said that Prohibition had created 'an orgy of lawlessness and official corruption.' John D. Rockefeller, a teetotaler, observed in 1932, 'drinking has generally increased, the speakeasy has replaced the saloon and a vast army of lawbreakers has been recruited and financed on a colossal scale.' \nSantayana's warning Harvard philosopher George Santayana warned that those who do not remember the past are condemned to repeat its errors. As Texas continues its drive to make safe, legal abortion inaccessible for large numbers of women, the consequences of this social policy are predictable. Affluent women will often be able to find safe care; the poor will not. Dangerous, unskilled practitioners will fill the void. Complications and deaths will increase, as will costs to the state , which will have to treat preventable complications of unsafe abortions. \nAs experience in Romania confirmed, when denied access to safe, legal abortion, desperate women will risk their lives to control their fertility. Many will die as a result. If the history of Prohibition has anything to teach us, the message is that \" it is counterproductive to try to legislate morality .\" \nAn alternative to safe, legal abortion in Texas \nFollow David A. Grimes on Twitter: www.twitter.com/drdavidagrimes More:", "external_links": [], "published": "2015-06-29T14:08:00.000+03:00", "crawled": "2015-06-29T18:13:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}