{"organizations": [], "uuid": "30d1ca8ca747e581fc44d96f480f8affe374dc45", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/09/politics/president-obama-supreme-court-obamacare/index.html", "country": "", "title": "Obama looks to save his legacy from the Supreme Court - CNNPolitics.com", "performance_score": 3, "site": "cnn.com", "participants_count": 0, "title_full": "Obama looks to save his legacy from the Supreme Court - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T02:14:00.000+03:00", "replies_count": 0, "uuid": "30d1ca8ca747e581fc44d96f480f8affe374dc45"}, "author": "", "url": "http://www.cnn.com/2015/06/09/politics/president-obama-supreme-court-obamacare/index.html", "ord_in_thread": 0, "title": "Obama looks to save his legacy from the Supreme Court - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Obama looks to save his legacy from the Supreme Court Updated 0004 GMT (0704 HKT) June 10, 2015 JUST WATCHED Obamacare at the Supreme Court in less than three minutes 02:52 Washington (CNN) It's the constitutional law professor in the Oval Office versus the Supreme Court, again. President Barack Obama's politicized, difficult relationship with the court's conservative wing is back in the spotlight, as his patience threatens to snap over the latest attempt to destabilize the health care law at the center of his political legacy. Obama did not mention the nine justices who are currently deliberating the fate of the Affordable Care Act in an impassioned, campaign-style speech on his central domestic policy achievement Tuesday. But he didn't have to. Three years after a divided Supreme Court saved Obamacare in a narrow 5-4 decision, its fate is again in the hands of the nine black-robed justices, as the sultry summer heat at the end of a long legal term begins to stifle Washington. READ: Obama questions why Supreme Court took up Obamacare challenge As in 2012, Obama seems to be building a political case with the public in the final days before the ruling is handed down -- a break with how his predecessors have handled delicate relations with the Court. His public advocacy for the law, and previous criticisms of the court, underlines how the survival of the law -- which helps define the political and philosophical contours of his presidency -- is deeply personal to Obama. But it also reflects the state of a nation split almost exactly down the middle between Republicans and Democrats, where everything becomes politicized sooner or later. \"You have a president who was a constitutional law professor and looks at the court as a political institution,\" said Jon Gould, an American University law professor. Obama sends a message to the court \"He is expecting the court to act in that way, and is potentially trying to send a little bit of a message.\" Eric Segall, a Georgia State University law professor, thinks Obama isn't trying to sway the deliberations of the court -- which the president doesn't see himself having the power to do -- so much as start to make a case to Americans about who would be to blame if the law were gutted. \"I don't think it is unprecedented, but it is pretty rare ... for the American president to make a strong appeal to the American public before a case is decided,\" Segall said. The court is expected to rule within weeks on the legality of federal subsidies that are a linchpin of the way Obamacare works. The decision could see the Affordable Care Act's very existence -- and the president's political legacy -- cast into serious doubt in states that rely on federal exchanges to sell insurance if the court rules that the government can't provide subsidies for these policies. Obama on Tuesday had no problem taking direct aim at the political motives of those challenging the law -- and by implication members of the court who may side with them. \"There's something, I have to say, just deeply cynical about the ceaseless, endless, partisan attempts to roll back progress,\" Obama told a Washington conference on the Affordable Care Act. JUST WATCHED Obama and SCOTUS healthcare action 02:11 PLAY VIDEO He went on to fire an implicit shot across the court's bow, warning that anyone responsible for felling the law through this legal maneuver would not just be depriving millions of people of long-sought health care, but inciting chaos and subverting the central ideals of America itself. \"It seems so cynical to want to take coverage away from millions of people, to take care away from the people who need it the most, to punish millions with higher costs of care and unravel what's been woven into the fabric of America,\" he said. \"That kind of cynicism flies in the face of our history. Our history is one of each generation striving to do better and to be better than the last.\" The day before, at a press conference in Germany, Obama had called out the court directly. \"This should be an easy case,\" he said. \"Frankly, it probably shouldn't even have been taken up.\" Obama, who taught constitutional law before he went into politics, also sought to debunk the legal reasoning behind the case. The Affordable Care Act statute refers to exchanges \"established by the state,\" but the law's backers insist that the language does not prohibit subsidies being offered on federal exchanges that operate in 34 states. \"It's not something that should be done based on a twisted interpretation of four words in -- as we were reminded repeatedly -- a couple-thousand-page piece of legislation,\" Obama said Tuesday. Angry conservative reaction to Obama's push Conservatives have reacted angrily to Obama's gambit. \"Instead of bullying the Supreme Court, the President should spend his time preparing for the reality that the court may soon rule against his decision to illegally issue tax penalties and subsidies on Americans in two-thirds of the country,\" said Wyoming Sen. Tom Barrasso Monday. Carrie Severino, chief counsel for the Judicial Crisis Network and a former law clerk for Justice Clarence Thomas, rejected Obama's argument that support for his health care legislation was a moral choice. \"There's nothing 'moral' about attempting to bully the Supreme Court by presenting a false choice between the rule of law and love for one's neighbor,\" she said Tuesday. Obama's strategy of choosing to make such a public defense of Obamacare and to argue that the law was now \"woven into the fabric of America\" could be seen as an attempt to convince certain members of the court -- possibly Justice Anthony Kennedy, who is seen as a swing vote, and Chief Justice John Roberts, who cast the deciding vote that preserved Obamacare the last time it was before the court -- that gutting Obamacare could spark chaos, and so hurt the reputation of the court. READ: Poll: Trust lacking in Supreme Court over handling of key issues His administration's repeated statements that there is no Plan 'B' if the federal exchanges are ruled out could also fit an interpretation that he is trying to pressure the court to uphold the law. Some analysts believe that Roberts's decision to find a legal way to uphold Obamcare in 2012 was partly motivated by a desire to protect the court he leads from the severe political blowback a rejection of the law could have set off. But like most of the dealings behind the closed doors of the Supreme Court chambers, the way judges make their decisions is opaque to outsiders, and it is unclear how much they are influenced by outside political debate. \"It's really difficult to know. If you ever were to ask one of the Supreme Court justices whether this has any influence in any way, the answer is going to be no,\" said Gould. \"At the same time, we think we have circumstantial evidence that several justices take into account the political climate, the political consequences of their decisions.\" A precedent for taking on the Supreme Court This is not the first time Obama as taken on the Supreme Court in public. Obama made a similarly robust public case the last time that Obamacare was on the line. \"I'm confident that the Supreme Court will not take what would be an unprecedented, extraordinary step of overturning a law that was passed by a strong majority of a democratically elected Congress,\" Obama said a few months before the ruling was announced. Two years before, Obama had taken what was seen by many at the time as a shocking step in calling out the court publicly over another judgment -- the Citizens United ruling abrogating aspects of campaign finance law -- during his State of the Union address. e said the decision would \"open the floodgates\" for special interests to manipulate politics with massive infusions of cash. The justices, as by tradition, sat stoney-faced in the House of Representatives' chamber. But Justice Samuel Alito was caught on camera mouthing the words \"that's wrong.\" Another conservative justice, Antonin Scalia, has also been willing to push back against the president, a sign that personal sparring on court decisions isn't only a tactic Obama is embracing. During oral arguments in 2014, Scalia took an apparent shot at Obama's use of recess appointments, saying the Constitution's clause on the practice had \"been assumed to be ambiguous by self-interested presidents.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News ", "external_links": [], "published": "2015-06-10T02:14:00.000+03:00", "crawled": "2015-06-10T02:14:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}