{"organizations": [], "uuid": "4cd3b635a816be12591393e1e40db2adff1b6e6e", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/246307-senate-dems-predict-wide-ranging-harms-from-oil-exports", "country": "US", "title": "Democrats to Obama: Resist oil exports", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Democrats to Obama: Resist oil exports", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T22:31:00.000+03:00", "replies_count": 0, "uuid": "4cd3b635a816be12591393e1e40db2adff1b6e6e"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/246307-senate-dems-predict-wide-ranging-harms-from-oil-exports", "ord_in_thread": 0, "title": "Democrats to Obama: Resist oil exports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Democrats to Obama: Resist oil exports By Timothy Cama - 06/26/15 03:31 PM EDT \nThirteen Senate Democrats wrote to President Obama Friday asking him to resist calls from Republicans, oil producers and others to ease restrictions on crude oil exports. \nThe Democrats, led by Sen. Ed Markey (Mass.), predicted that changing the 40-year-old ban on exports would hurt consumers, businesses and the country’s national security. ADVERTISEMENT “Repealing the crude export ban is opposed by a broad coalition, including the AFL-CIO, the United Steelworkers, environmental organizations and domestic refiners,” the Democrats wrote .\nWhile calls from a wide range of business groups and their allies have grown louder and louder to ease export restrictions, especially as the industry is suffering from historically low prices, the Democrats are holding tough. \nTheir letter follows arguments from export proponents who say that the very same people and concerns would benefit from opening the United States’s oil market to the world. Those interests have argued that if Congress cannot completely repeal the ban, Obama should exercise his authority to approve exports to specific areas. \nBut the Democrats told Obama to ignore those arguments. They said that crude exports could make the United States more dependent on foreign oil while raising energy prices for domestic businesses and consumers by billions of dollars. \n“We are concerned that lifting the crude oil export ban could harm U.S. consumers, businesses and our national security and we urge you to pay close attention to these adverse impacts that could result from any efforts to repeal or weaken this longstanding U.S. law,” they wrote. \nAn ad hoc coalition of oil producers that supports exports said the Democrats’ letter does not match with research on the subject. \n“The senators’ views are completely at odds with well-established and well-settled fact regarding the relationship between domestic gasoline prices and repealing the crude export ban,” George Baker, executive director of Producers for American Crude Oil Exports, said in a statement. \n“Allowing crude oil exports from the U.S. will put downward pressure on domestic gasoline prices — not a matter of opinion but the inexorable result of the laws of supply and demand,” Baker continued. Tags:", "external_links": [], "published": "2015-06-26T22:31:00.000+03:00", "crawled": "2015-06-26T22:47:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}