{"organizations": [], "uuid": "c29b139ecc4efd34bf9ad668944c312451774982", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/49/feed#", "section_title": "The Hill: All Regulation", "url": "http://thehill.com/regulation/245243-new-regs-for-thursday-ocean-dumping-air-conditioners-fake-marijuana", "country": "US", "title": "New regs for Thursday: Ocean dumping, air conditioners, fake marijuana", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "New regs for Thursday: Ocean dumping, air conditioners, fake marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-06-17T17:02:00.000+03:00", "replies_count": 0, "uuid": "c29b139ecc4efd34bf9ad668944c312451774982"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/245243-new-regs-for-thursday-ocean-dumping-air-conditioners-fake-marijuana", "ord_in_thread": 0, "title": "New regs for Thursday: Ocean dumping, air conditioners, fake marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New regs for Thursday: Ocean dumping, air conditioners, fake marijuana By Tim Devaney - 06/17/15 10:02 AM EDT Thursday's edition of the Federal Register contains new rules for ocean dumping, energy conservation standards for residential air conditioners, and production quotas for synthetic drugs. Here's what is happening: Air conditioners: The Department of Energy is looking into new energy conservation standards for room air conditioners. The Energy Department's Office of Energy Efficiency and Renewable Energy announced Wednesday it is trying to determine whether new efficiency rules are necessary for these air conditioners. The public has 45 days to comment. Ocean dumping: The Environmental Protection Agency (EPA) is proposing new ocean dumping rules . The rules would affect more than a half dozen ocean dumping sites in Texas where dredged material is disposed. The public has 45 days to comment. Trucks: The Federal Motor Carrier Safety Administration is moving forward with new hazardous materials regulations . The agency is updating the inspection procedures and out-of-service criteria for trucks transporting radioactive materials, the agency said Wednesday. The new rules go into effect immediately. Fake marijuana: The Drug Enforcement Administration (DEA) is issuing new production quotas for three types of synthetic cannabinoids that mirror the effects of marijuana. The production quotas allow for the scientific use and study of the synthetic drugs. The rules go into effect immediately.", "external_links": [], "published": "2015-06-17T17:02:00.000+03:00", "crawled": "2015-06-17T23:52:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}