{"organizations": ["Arizona Immigration Law Reuters", "Arizona Immigration Law Supreme Court", "Supreme Court"], "uuid": "a8b8ccd0410afd789c83f102fd831ff3b63d1211", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3017334/images/o-SUPREME-COURT-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/01/supreme-court-arizona-immigration_n_7483862.html", "country": "", "title": "Supreme Court Declines Request To Revive Arizona Immigration Law", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Supreme Court Declines Request To Revive Arizona Immigration Law", "spam_score": 0.0, "site_type": "news", "published": "2015-06-01T18:19:00.000+03:00", "replies_count": 0, "uuid": "a8b8ccd0410afd789c83f102fd831ff3b63d1211"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/01/supreme-court-arizona-immigration_n_7483862.html", "ord_in_thread": 0, "title": "Supreme Court Declines Request To Revive Arizona Immigration Law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Supreme Court Declines Request To Revive Arizona Immigration Law Reuters reddit \nBy Lawrence Hurley \nWASHINGTON, June 1 (Reuters) - The U.S. Supreme Court on Monday left intact an appeals court ruling from last year that struck down an Arizona law that denied bail to illegal immigrants charged with certain felonies. \nThe justices rejected an appeal filed by Maricopa County and its controversial sheriff, Joe Arpaio. Three of the court's conservative justices, Clarence Thomas, Antonin Scalia and Samuel Alito, said they would have heard the case. Four of the nine justices must agree to hear a case for the court to take it up. \nThe court's action means the October 2014 ruling by the San Francisco-based 9th U.S. Circuit Court of Appeals, which said the 2006 law is unconstitutional, is the final word in the case. \nThomas wrote in an opinion joined by Scalia that the court's refusal to hear the case \"shows insufficient respect to the state of Arizona, its voters and its constitution.\" \nThe court's action \"suggests to the lower courts that they have free rein to strike down state laws on the basis of dubious constitutional analysis,\" Thomas added. \nArizona is known for putting in place tough measures cracking down on illegal immigrants. This one was passed as a ballot measure with overwhelming support from Arizona voters. \nThe state said it was needed due in part to concerns of immigrants fleeing if allowed bail. \nThe appeals court said the move was unconstitutional since it did not address an acute problem, was not limited to a specific category of very serious offenses and did not consider the individual factors needed to determine if a suspect is an unmanageable flight risk. \nThe law violated the U.S. Constitution's due process guarantee, the appeals court said. \nThe American Civil Liberties Union, which challenged the law, said in court papers that it was the only measure of its kind in the United States. \nIt said it imposed \"a categorical prohibition on bail that applies to hundreds of charged felony offenses, including nonviolent offenses that often result in noncustodial sentences.\" \nThe case is Maricopa County v. Lopez-Valenzuela, U.S. Supreme Court, No. 14-825. (Reporting by Lawrence Hurley; Editing by Will Dunham) Also on HuffPost: ", "external_links": [], "published": "2015-06-01T18:19:00.000+03:00", "crawled": "2015-06-01T18:19:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}