{"organizations": [], "uuid": "23315a4e93625f10646040b0cadda6b5198f79f9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/061815_an_mccarthy_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/18/house-oks-obama-trade-agenda-on-2nd-try-heads-to-senate/", "country": "US", "title": "House OKs Obama trade agenda on 2nd try, bill heads to Senate", "performance_score": 3, "site": "foxnews.com", "participants_count": 11, "title_full": "House OKs Obama trade agenda on 2nd try, bill heads to Senate | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T03:00:00.000+03:00", "replies_count": 15, "uuid": "42c097733e899711ddf2b417123021c21ee06294"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/18/house-oks-obama-trade-agenda-on-2nd-try-heads-to-senate/#post-0", "ord_in_thread": 0, "title": "House OKs Obama trade agenda on 2nd try, bill heads to Senate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 18, 2015 FoxNews.com livefyre Email Print\nThe House on Thursday approved a key plank of President Obama's trade agenda after the push nearly imploded amid Democratic resistance last week, sending the bill to the Senate where it still faces an uncertain fate.\nThe 218-208 vote nevertheless marked a significant victory for Obama and his pro-trade supporters in both parties. The vote came after Obama huddled Wednesday evening with congressional allies to try to craft a way forward.\nThe bill would specifically give the president so-called \"fast-track\" authority to approve trade deals, which Obama wants to seal a 12-nation pact involving Japan and 11 other countries bordering the Pacific Ocean.\nThe mechanics of the vote are some of the most complicated in recent memory, in a legislative body notorious for esoteric procedural maneuvers. The vote failed in the House last week because another measure it was attached to was defeated by a coalition of Democrats and Republicans.\nIt was labor-aligned Democrats, in particular, who caused the biggest headaches for the White House. Democrats have fought the measure for months, for fear it would lead to the loss of U.S. jobs overseas. \"Let's kill this donkey once and for all,\" Rep. Donna Edwards, D-Md., said before the latest vote.\nOn Thursday, House leaders moved to vote only on the \"fast-track\" measure, known as Trade Promotion Authority. The measure on the House floor would give Obama authority to negotiate global trade deals that Congress can approve or reject, but not change. Other recent presidents have had the same prerogative Obama seeks.\nWith the bill's approval, it heads back to the Senate where lawmakers would have to approve it in tact in order to send it to Obama's desk.\nThe issue has led to unusual alliances and factions on Capitol Hill, with some Tea Party-aligned Republicans and labor-aligned Democrats joining forces to resist it -- while pro-trade Democrats and GOP congressional leaders side with the White House.\nThe House debate and vote Thursday marked the beginning of an extraordinary rescue operation that the White House and GOP leaders in Congress hope will result in passage of both bills by the end of next week. The other bill, not addressed on Thursday, would renew an expiring program of aid for workers who lose their jobs because of imports.\n\"We are committed to ensuring both ... get votes in the House and Senate and are sent to the president for signature,\" House Speaker John Boehner and Senate Majority Leader Mitch McConnell said in a joint statement issued Wednesday in an attempt to reassure pro-trade Democrats whose votes will be needed.\nHouse Democratic Leader Nancy Pelosi had no comment on the day's events. The California Democrat joined the revolt last week in which her party's rank-and-file lawmakers helped vote down the aid package that they customarily support, calculating their actions would prevent the entire trade package from reaching Obama's desk.\nSupporters of the president's agenda argue that the United States must stay involved in international trade, in part because otherwise, countries like China will write the rules to their own advantage. The administration's immediate negotiating objective is a round of talks involving 12 countries in Asia, North America and South America.\nOrganized labor and other opponents of international trade deals say they cost thousands of American workers their jobs by shifting employment to foreign countries with low wages, poor working conditions and lax environmental standards.\nOfficials in Congress said Boehner and McConnell hope to have both the trade and the aid legislation to the president by the time lawmakers begin a scheduled vacation at the end of next week.\nThe Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Supreme Court: Texas can refuse to issue Confederate flag license plate 2 Woman will be face of redesigned $10 bill, Treasury says 3 Cruz moves to fine State Department for illegally withholding key Iran report 4 S.C. pastor killed in church attack a leader in religious, political communities 5 Justices rule for small Arizona church in sign dispute See all Trends Advertisement", "external_links": [], "published": "2015-06-18T03:00:00.000+03:00", "crawled": "2015-06-18T20:32:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}