{"organizations": [], "uuid": "6eb234f42caa0b7c80655b18dbf88bfaff906af2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/mlkmonument_011915getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/246478-obama-takes-brazilian-president-on-visit-to-mlk-memorial", "country": "US", "title": "Obama takes Brazilian president to MLK memorial", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama takes Brazilian president to MLK memorial", "spam_score": 0.0, "site_type": "news", "published": "2015-06-29T23:53:00.000+03:00", "replies_count": 0, "uuid": "6eb234f42caa0b7c80655b18dbf88bfaff906af2"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/246478-obama-takes-brazilian-president-on-visit-to-mlk-memorial", "ord_in_thread": 0, "title": "Obama takes Brazilian president to MLK memorial", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama takes Brazilian president to MLK memorial Getty Images By Jordan Fabian - 06/29/15 04:53 PM EDT \nPresident Obama and Brazilian President Dilma Rousseff toured the Martin Luther King Jr. Memorial in Washington on Monday as the leaders kicked off two days of talks at the White House. \nThe two presidents took a quick walk around the statue, which overlooks the Tidal Basin on the National Mall. \n“The visit provided the leaders an opportunity to reflect together on Dr. King's lifelong work for equality and justice, and against racism and intolerance,” the White House said in a statement. “The visit also underscores the many shared values and strong bonds that exist between the American and Brazilian peoples.” ADVERTISEMENT Rousseff’s visit to the U.S. is designed to smooth over tensions with Obama, which were heightened when it was revealed the U.S. had spied on her communications. \nThe disclosure, made by former National Security Agency contractor Edward Snowden, led Rousseff to call off a state visit to the U.S. two years ago. \nThe two leaders are expected to discuss climate change, months ahead of a United Nations summit in Paris to seal an international climate treaty. \nTrade and investment will also be on the agenda. Rousseff is trying to re-establish her political footing at home; her approval ratings have plummeted to record lows, and slipping oil prices have hurt Brazil’s economy. \nRousseff and Obama were scheduled to have a working dinner Monday evening before a day of meetings Tuesday. \nTaking foreign leaders to see monuments on the National Mall is turning into a go-to move for the president. Japanese Prime Minister Shinzo Abe toured the Lincoln Memorial with Obama at the start of a state visit in April, and the president took Indian Prime Minister Narendra Modi to view King’s statue in September.", "external_links": [], "published": "2015-06-29T23:53:00.000+03:00", "crawled": "2015-06-30T00:32:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}