{"organizations": [], "uuid": "704ead84b3826c961f4b08b19d4d3cc6721052c1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3136170/images/o-ROUHANI-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/middle-east/feed", "section_title": "Middle East on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/30/obama-rouhani-nuclear-tal_n_7699512.html", "country": "US", "title": "Obama, Rouhani Trade Warnings Over Nuclear Talks", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama, Rouhani Trade Warnings Over Nuclear Talks", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T18:28:00.000+03:00", "replies_count": 0, "uuid": "704ead84b3826c961f4b08b19d4d3cc6721052c1"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/30/obama-rouhani-nuclear-tal_n_7699512.html", "ord_in_thread": 0, "title": "Obama, Rouhani Trade Warnings Over Nuclear Talks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama, Rouhani Exchange Warnings As Iran Nuclear Deal Talks Extended Posted: Updated: 7 minutes ago Iran's President Hassan Rouhani gives a press conference on the second anniversary of his election, in Tehran, Iran, Saturday, June 13, 2015. Rouhani said a final nuclear deal is \"within reach\" as Iran and world powers face a June 30 deadline for an agreement. Rouhani said Iran will allow inspections of its nuclear facilities but vowed that the Islamic republic won't allow its state \"secrets\" to be jeopardized under the cover of international inspections. (AP Photo/Ebrahim Noroozi) | ASSOCIATED PRESS reddit \nBy Parisa Hafezi and John Irish \nVIENNA, June 30 (Reuters) - Iran and world powers gave themselves an extra week to reach a nuclear accord, extending a deadline due to expire on Tuesday, while U.S. President Barack Obama said there would be no deal if all pathways to an Iranian nuclear weapon were not cut off. \nWith talks in the final stretch, Iran's president Hassan Rouhani also spoke out, saying his country would resume suspended atomic work if the West breaks its promises. \nIran and six world powers are working towards an accord that would see Tehran halt sensitive nuclear work for at least a decade in exchange for the lifting of economic sanctions, potentially the biggest breakthrough in decades of hostility between Washington and Tehran. \n\"Ultimately this is going to be up to the Iranians\" to meet the requirements set out by the international community, Obama said during a news conference in Washington. \nObama's remarks were likely to be seen as a response to Iran's Supreme Leader Ayatollah Ali Khamenei, who last week seemed to place a hurdle in front of the talks by ruling out either a long freeze of sensitive nuclear work or opening military sites to inspectors. \nPresident Rouhani, a pragmatist elected two years ago on promises to reduce Iran's international isolation, said on Tuesday Tehran would resume halted nuclear work immediately if the powers failed to keep their promises under any accord. \n\"If we reach a deal, both sides should be committed to it,\" Rouhani said in Tehran, the state news agency IRNA reported. \"If the other side breaches the deal, we will go back to the old path, stronger than what they can imagine.\" \nRouhani has been a strong supporter of negotiations but has less power in Iran than the more hardline Khamenei. \nIAEA TO REPORT IRAN COMPLYING \nIn a positive sign for the talks, Western diplomats said the International Atomic Energy Agency (IAEA) was expected to report next month that Iran had complied with a preliminary deal to reduce its low-enriched uranium stockpile. \nAn IAEA report in May said the stockpile had increased above the required level, but Tehran met a June 30 deadline to reduce it, the diplomats said on condition of anonymity. \nTuesday was the official deadline to reach a long-term deal that would build on the preliminary agreement. But with the prize tantalizingly close and the atmosphere seemingly positive, the week-long extension came as no great surprise. \nU.S. State Department spokeswoman Marie Harf said the sides had agreed to extend the preliminary agreement \"until July 7 to allow more time for negotiations to reach a long-term solution.\" \nA successful negotiation could help ease decades of hostility between Iran and the United States. But many U.S. allies in the region, including Israel and Saudi Arabia, are skeptical, as are hardliners in both Washington and Tehran. \nThe powers negotiating with Iran are the five U.N. Security Council permanent members - Britain, China, France, Russia and the United States - plus Germany. \nWashington, as the superpower most at odds with Tehran, has played a central role. The preliminary deal arose out of initially secret talks between the two countries that have not had normal diplomatic ties since Iranian revolutionaries stormed the U.S. embassy in Tehran in 1979. \nWestern countries suspect Iran of seeking the capability to make a nuclear weapon. Tehran says its program is peaceful. \nUnder the November 2013 preliminary agreement, Iran agreed to take some steps to constrain its nuclear program in exchange for limited relief from sanctions. \nU.S. Secretary of State John Kerry, on crutches with a broken leg, resumed negotiations on Tuesday with Iranian Foreign Minister Mohammad Javad Zarif, who returned in the morning from consultations in Tehran. \nZarif flew in with Iran's nuclear chief Ali Akbar Salehi, who is still recovering from major surgery in May. The two immediately went into almost two hours of private talks with Kerry. \n\"I am here to get a final deal, and I think we can,\" Zarif told reporters.\" \nLATE NIGHT WORK \nGerman Foreign Minister Frank-Walter Steinmeier, in an interview with Iranian state news agency IRNA, said there were difficult issues to work out but outlined the benefits Iran could enjoy if a long-term agreement is reached in Vienna. \n\"We have offered to suspend all economic and financial sanctions in the first phase,\" he was quoted as saying. \"Experts estimate that lifting the sanctions will lead to economic growth of 5 to 7 percent.\" \nIranian media said it was the first interview Iranian state media had with a German government minister since the 1979 Islamic Revolution. \nFor more than a week, the sides have been working into the night trying to break an impasse in talks they feel have never been closer to success. \nDiplomats have said the real deadline is not June 30 but July 9, the latest the deal can be presented to the U.S. Congress to limit to 30 days a mandatory review period before Obama can begin suspending sanctions. After that, the review would last 60 days, with growing risks a deal could unravel. \nThe main differences are on the pace and timing of sanctions relief for Iran and on the nature of monitoring mechanisms. \n\"There are real and tough issues that remain which have to be resolved in order to get the comprehensive agreement, and we still do not know yet whether we will be able to get there,\" a senior U.S. administration official told reporters on Monday. \nA big sticking point is Western demands that U.N. inspectors have access to Iranian military sites and nuclear scientists. \nWestern diplomats say they are nearing a resolution, although Iranian officials maintain that access to military sites is a red line set by Khamenei. \nThe U.S. official said the six powers had come up with a system to ensure that the IAEA would have the necessary access, though there was no suggestion the Iranians had agreed. (Additional reporting by Louis Charbonneau, Arshad Mohammed and Shadia Nasralla; Writing by Louis Charbonneau and Arshad Mohammed; Editing by Peter Graff) More:", "external_links": [], "published": "2015-06-30T18:28:00.000+03:00", "crawled": "2015-06-30T23:18:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}