{"organizations": [], "uuid": "82fa4f59f0cbb014f0f55ac3ee3872c5e85ccc7c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/media/index.xml", "section_title": "Media - The Huffington Post", "url": "http://www.huffingtonpost.com/mark-green/is-omalley-the-hart-of-16_b_7531150.html?utm_hp_ref=media&ir=Media", "country": "US", "title": "Is O'Malley the Hart of '16? Is Sanders the Dean? Is Obama Jew- ish ?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Is O'Malley the Hart of '16? Is Sanders the Dean? Is Obama Jew- ish ?", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T01:44:00.000+03:00", "replies_count": 0, "uuid": "82fa4f59f0cbb014f0f55ac3ee3872c5e85ccc7c"}, "author": "Mark Green", "url": "http://www.huffingtonpost.com/mark-green/is-omalley-the-hart-of-16_b_7531150.html?utm_hp_ref=media&ir=Media", "ord_in_thread": 0, "title": "Is O'Malley the Hart of '16? Is Sanders the Dean? Is Obama Jew- ish ?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LISTEN HERE: \nBy Mark Green \nHastert shocking... but Alter recalls how he sleazily pocketed millions when legislation enhanced his private property. Alter-Matalin debate how Pope wants to phase out fossil fuels while many Catholic Republicans are in big oil's pockets. Then: Is O'Malley Hart and Hillary Mondale? Is Obama Jew- ish ? \n*Spying and Snowden. Jonathan applauds that the USA Freedom Act because it re-balances security and privacy by requiring 'probable cause' to a secret FISA Court to get access to meta-data -- phone calls and duration. Mary, however, worries that may slow down urgent probes and prosecutions. She says that Bush43 team tried to recalibrate original PATRIOT Act but couldn't in real world... yet she seems to oppose the recent Congressional action amending it. \nThey agree, however, that at this point, Snowden should neither be brought back for a criminal trial nor exonerated completely. Ideally, since he has been both vindicated in one sense but broke the law at the same time, he should suffer \"some modest\" if symbolic punishment. \nMary acknowledges big split among Republicans McCain and Paul wings and concludes that a big problem is that the public no longer trusts their government in this area. Host: \"'True, lying about Vietnam and Watergate cut by half the percentage of Americans who believe their government 'most of the time.'\" \nHastert Scandal. Mary confirms that her GOP friends are to a person shocked by the ex-Speaker's misconduct decades ago and now. Unfair, selective, political prosecution? No, she concludes, showing herself to be a non-partisan hard-liner on prosecuting a public person \"sworn to uphold the law yet who lies to the FBI.\" As for the \"shock\", Jonathan reminds us how Hastert used his public office to make millions by jacking up the value of land he owned. \nIs there a larger political point here since GOP leaders seriatim in the late '90s voted to impeach Clinton yet had themselves engaged in sexual misconduct -- Gingrich, Livingston, Hastert, Hyde -- and Denny led charge against gay rights? \"OMG, hypocrisy in politics!,\" mocks Mary, adding that Clinton was prosecuted not for his misconduct but lying about it. Alter will have none of that: first, it wasn't proven that Clinton lied (\"is... is?\") and, in any event, \"it was crazy that these guys put the country through impeachment when at most he should have been censured, especially when they were engaging in this kind of abuse.\" \nCan Sanders, O'Malley, Chaffee slow or stop HRC? Remember when most Democrats and commentators were saying that HRC would benefit from a tough primary contest? (You know, like Carter benefitted from Kennedy in 1980?) Well, be careful what you wish for. \nSanders, O'Malley, Chaffee have announced their presidential candidacies. Perhaps Webb soon. Mary and Jonathan both marvel at Sanders's appeal based on his sincere, consistent, clear positions... and the crowds showing up. But unless we're forgetting someone, there hasn't been a Jewish socialist from Brooklyn elected president (at least not since Jefferson). \nO'Malley? They agree that he has appeal as a well-spoken, vibrant, experienced candidate and that he had a good announcement where he sharply criticized Wall Street and chided Hillary and Jeb as royalty. Also, given his history as Baltimore's mayor and its recent explosion, it's smart, says Mary, that he's including Baltimore in his narrative. \"He's a damn good street politician.\" \nSo in any other year, he could have Bill Clinton-breakout potential... but the panel doubts he could overtake Sanders in attracting non-Hillary votes this primary cycle. \nThe Host then ungenerously notes that \"Chaffee is no Lincoln\" given his opening assertions that Billary's fund-raising and speech-giving unethically affected her judgment at Secretary of State. Odd for a Democrat to start out by accusing a Democratic frontrunner of corruption and criminality. We'll see how that works. \n\"But they all will double team [or triple team] Hillary,\" Alter notes, which she'll have to calmly answer. \"But she's a good debater and should be able to. Also, as possibly the first female president, opponents have to be careful.\" \n*Hussein Obama Jewish? Really? David Axelrod reports that President Obama once privately remarked that he was the closet thing to a Jew in the Oval Office, a comment that sent Jewish neo-cons into a swivet. \nOf course, it's funny that Clinton42 was considered the first black president and now the actual first black president says he's sorta Jewish! Can't anybody be themselves? \nJonathan goes personal noting how his family in Chicago were among a group of Jewish professionals who were Obama's earliest supporters + BO's immersion in scholarly pursuits have enabled him to appear to be thoughtful, rabbinical. Mary agrees: \"Jesus was a Jew. We're all Jews if you're a person of faith...Obama is a Talmudic and thoughtful person. Indeed his ability to joke about his being Jewish reveals his political prowess to convey to people that 'I'm one of you.'\" As for neo-con fury, Jonathan laughs it off as reflective of Obama's and Netanyahu's fraught relationship ( and, says the Host, at their frustration at wanting to \"own\" the Jews while Obama won 78 percent and 70 percent of them in his two national elections. Sorry Bill Kristol ). \nIs the Pope... an Enviro? Anticipating the Pope's coming encyclical urging nations to sign on to the UN Climate accord, Mary discounts its influence on Catholic Republicans who deny that human activity significantly contributes to extreme weather. \"Deny? That's just you lefties speaking since Catholic doctrine... explains how they have to be good stewards of the earth especially for the poor.\" \nJonathan pounces. \"The Pope is saying that we have to get off fossil fuels but the GOP is in the pocket of fossil fuels interests. They're on opposite sides of this issue.\" (And the Host is thinking: not one of 20 actual or possible GOP presidential contenders has said, yes, climate change is a problem caused by humans and we have to do something.\" Not one. That why they don't quote or cite one of our greatest presidents, on Mt. Rushmore -- TR?) \nMark Green is the creator and host of Both Sides Now . \nYou can follow him on Twitter @markjgreen \nSend all comments to Bothsidesradio.com , where you can also listen to prior shows. \nBoth Sides Now is available Sat. 5-6 PM EST From Lifestyle TalkRadio Network & Sun. 8-9 AM EST from Business RadioTalk Network. \nFollow Mark Green on Twitter: www.twitter.com/markjgreen More:", "external_links": [], "published": "2015-06-08T01:44:00.000+03:00", "crawled": "2015-06-08T02:11:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}