{"organizations": ["San Francisco", "University of California", "GOP", "Guttmacher Institute", "National Right to Life Committee", "U.S. House", "Georgetown University", "Washington Post", "ACLU", "UCSF", "National Abortion Federation", "Supreme Court"], "uuid": "eb2b5f0a6cdc2e40c2f7cce5ff8bc19222256c5a", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/08/politics/abortion-20-weeks-ban-house-vote/index.html", "country": "", "title": "The women on the front lines of the new abortion battle - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "The women on the front lines of the new abortion battle - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T13:51:00.000+03:00", "replies_count": 0, "uuid": "eb2b5f0a6cdc2e40c2f7cce5ff8bc19222256c5a"}, "author": "", "url": "http://www.cnn.com/2015/06/08/politics/abortion-20-weeks-ban-house-vote/index.html", "ord_in_thread": 0, "title": "The women on the front lines of the new abortion battle - CNNPolitics.com", "locations": ["Washington", "Philadelphia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jennifer Dalven", "Roe v. Wade", "Roe", "Diana Greene Foster", "Casey", "Hillary Clinton", "Mallory Quigley", "Christy Zink", "Dalven", "Kermit Gosnell", "Susan B. Anthony List", "Scott Walker", "Zink", "Carol Tobias"], "text": "A mother's voice: Abortion after 20 weeks 02:58 Story highlights Most 2016 GOP candidates support a ban on abortions after 20 weeks, while Democrat Hillary Clinton has spoken against it So far 14 states have barred the procedure after 20 weeks, though court orders have kept some from putting their bans into effect Washington (CNN) As the technician scanned her belly to determine the gender of her baby, Christy Zink could not have been more excited about her pregnancy. At 21 weeks, the pregnancy had been going well. But the look on the technician's face as she examined the images told Zink that was no longer the case. Further scans revealed that the fetus' brain was badly malformed. Two hemispheres should have formed by then, but the right side of the brain had not developed at all. The prognosis left Zink, a writing professor at Georgetown University who was then 39, and her husband with a terrible choice: carry the baby to term and raise a child who would be in constant pain, need to be hooked up to life-sustaining machines and would require permanent hospitalization. Or have an abortion. Since she was 21 weeks pregnant and could only find a doctor willing to perform abortions up to 22 weeks, she and her husband had a week to decide. \"It was the hardest decision that my husband and I ever had to make,\" Zink recalled in a recent interview, six years after they opted to end the pregnancy. Women like Zink are at the center of the newest front in the abortion war as Republicans push for a ban on such procedures after a pregnancy reaches 20 weeks. 2016 candidates weigh in The U.S. House approved a bill in May that would establish such a standard and similar measures have passed in 14 states. The limit is becoming an issue on the 2016 campaign trail, with nearly all the GOP presidential hopefuls backing it and Democrat Hillary Clinton slamming it. Both sides of the abortion debate say the push for a ban after 20 weeks opens up a new legal debate over the procedure that may well find its way to the Supreme Court. EXPAND IMAGE Abortion rights advocates say the measures are a direct challenge to high court cases establishing that women have an unfettered right to an abortion before the point of viability, generally thought to be at 24 weeks. But abortion opponents think they can succeed by arguing the fetus is able to feel pain at 20 weeks, a hotly contested idea. \"We feel that once the child can feel pain, we think the court will say the state does have an interest in protecting the unborn child,\" said Carol Tobias, president of the National Right to Life Committee. About 1.2% of the slightly more than 1 million abortions that are done annually take place after 21 weeks, according to the Guttmacher Institute, a pro-abortion rights research organization whose statistical work is widely considered reliable. Studies suggest about 20% of that 1.2% are performed because, like Zink, the women discover only well into their pregnancy that the fetus has severe defects or that their life is threatened by continuing to carry it. Poor women most affected The rest are mostly poor women who lack private health insurance and who don't live in one of the 17 states that allow Medicaid to pay for abortions under some circumstances. Researchers say a prime cause of women seeking abortions during their second trimester -- the second 13-week period in a 39-week gestation -- is that they find out relatively late that they are pregnant. \"The later a woman is in pregnancy, the harder it is to access abortion services because there are fewer providers, they're farther away and the procedures cost more,\" said Diana Greene Foster, an associate professor at the University of California, San Francisco who conducted one of the few studies of women who seek abortions after the first trimester. \"Wealthier women are able to access this care; poor and middle-class women are more likely to show up at an abortion clinic beyond the gestational limit and be denied an abortion,\" she said. Overall, the UCSF study of 441 women found that those who had second-trimester abortions did not vary from those who had first-trimester abortions along the lines of race, ethnicity, mental or physical health or rates of substance abuse. But in addition to being more likely to have discovered they were pregnant later on, women seeking these abortions did tend to be younger, need to travel more than three hours to an abortion clinic and lack private health insurance. READ: Scott Walker: I would sign 20-week abortion ban Once women discover they're pregnant, the leading reason for postponing an abortion is lack of money. In the UCSF study, conducted by the Advancing New Standards in Reproductive Health program at the School of Medicine in 2013, 65% of the women who had second-trimester abortions cited \"raising money for the procedure and related cost\" as the reason they delayed terminating their pregnancies. The cost of abortions escalates rapidly the later the procedure is conducted. The average cost to terminate a pregnancy at 12 weeks is $500, according to the National Abortion Federation, the trade association for abortion clinics. At 16 to 18 weeks, the price jumps to about $1,000. After 20 weeks it doubles again to $2,000. Some poor women spend weeks scraping together enough money to get an abortion, only to find out that in that time, the goal has moved further from their grasp, It's a vicious cycle that ends with procedures later in their terms, according to abortion rights advocates. This poor population tends to lack political clout, which abortion rights advocates say contributes to an absence of public outcry over such bans. \"These are not the folks that the public rallies around,\" said Jennifer Dalven, director of the ACLU's Reproductive Freedom Project. \"These are not the folks that people are likely to go to the mat for. That's true with abortion. But it's also true across our society.\" Widespread public support for ban Bans on abortions at later stages of pregnancy enjoy widespread public support. A Washington Post poll in 2013 found that 56% of Americans supported a ban after 20 weeks. Republicans who back the prohibition see these bans as a means of harnessing public support for abortion restrictions, which they often back out of religious conviction. \"We are focused on where there is common ground,\" said Mallory Quigley, communications director for the Susan B. Anthony List, which supports candidates who oppose abortion. \"This is something the other side has been saying for years -- that we need to find common ground. Well, if you look at the polls on this bill, this is where the country is at.\" Yet the majority of the country also supports Roe v. Wade, the 1973 Supreme Court ruling that legalized abortion nationwide. According to a 2013 Gallup Poll, 53% of Americans didn't want the decision overturned. Constitutional fight brews Dalven said the 20-week abortion ban takes direct aim at one of the central tenets of Roe, which was affirmed in the high court's 1992 Planned Parenthood v. Casey decision. \"These laws are directly in conflict with what Roe and Casey said. That you can't ban abortion before viability,\" said Dalven. \"As a constitutional matter, that's why the issue is really important.\" In their fight to influence public attitudes, the sides have found themselves battling over the use of the letter \"R.\" Anti-abortion organizations tend to describe procedures to end pregnancy at 20 weeks as \"late-term\" abortions, a means of associating them with horrors such as the work of Kermit Gosnell, a Philadelphia doctor who performed abortions on women up to seven or eight months pregnant and was convicted of killing a baby born alive in a botched abortion. Pro-abortion rights groups favor calling 20-week abortions \"later-term,\" saying that, while they occur further along in the pregnancy than the typical abortion, they still only take place at around the midpoint of a normal pregnancy. JUST WATCHED ", "external_links": [], "published": "2015-06-08T13:51:00.000+03:00", "crawled": "2015-06-08T13:51:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}