{"organizations": ["Facebook", "Twitter", "Supreme Court"], "uuid": "dea3deebd312e3212aa33afa125bf70bfd4b8ec9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/ObamaGayMarriage.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss\r", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/26/gop-lawmakers-ask-obama-to-fire-opm-chief-after-massive-data-breach/", "country": "", "title": "Obama calls Supreme Court same-sex marriage ruling a 'victory for America'", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama calls Supreme Court same-sex marriage ruling a 'victory for America'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T18:23:00.000+03:00", "replies_count": 0, "uuid": "8c02def3110091df0f4727283033e02510634398"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/26/obama-tweets-lovewins-on-supreme-court-same-sex-marriage-ruling/", "ord_in_thread": 0, "title": "Obama calls Supreme Court same-sex marriage ruling a 'victory for America'", "locations": ["US", "America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama calls Supreme Court same-sex marriage ruling a 'victory for America' Published June 26, 2015 Facebook 0 Twitter 0 livefyre Email Print June 26: President Obama speaks in the Rose Garden of the White House after the Supreme Court declared that same-sex couples have the right to marry anywhere in the US. (AP) \nPresident Obama lauded Friday's landmark decision by the Supreme Court -- which declared same-sex couples have a right to marry in all 50 states -- calling it a \"victory for America\" and describing the 5-4 ruling as \"justice that arrives like a thunderbolt.\" \n\"This morning, the Supreme Court recognized that the Constitution guarantees marriage equality,\" Obama said. \"In doing so, they have reaffirmed that all Americans are entitled to the equal protection of the law; that all people should be treated equally, regardless of who they are or who they love. \n\"Today we can say in no uncertain terms that we made our union a little more perfect,\" he said. \"What an extraordinary achievement.\" \nThe president spoke from the White House Rose Garden shortly after a divided Supreme Court ruled 5-4 in favor of same-sex marriages anywhere in the United States. Justice Anthony Kennedy wrote for the majority, with the four liberal justices. \n\"No union is more profound than marriage, for it embodies the highest ideals of love, fidelity, devotion, sacrifice and family,\" Kennedy wrote. \"In forming a marital union, two people become something greater than they once were.\" \n\"Their hope,\" he wrote, \"is not to be condemned to live in loneliness, excluded from one of civilization's oldest institutions. They ask for equal dignity in the eyes of the law. The Constitution grants them that right.\" \nIt was not until 2012 that Obama announced his own support for gay marriage. Now, he says, the court ruling will end the patchwork of laws on marriage across the country and the uncertainty that they create for same-sex couples. \nImmediately after the ruling, Obama tweeted: \"Today is a big step in our march toward equality. Gay and lesbian couples now have the right to marry, just like anyone else. #LoveWins\" \nWhile praising Friday's ruling, Obama also acknowledged strong opposition to it and asked Americans to be \"mindful\" of differing views. \n\"I know that Americans of good will continue to hold a wide range of views on this issue,\" Obama said. \"Opposition, in some cases, has been based on sincere and deeply held beliefs. All of us who welcome today's news should be mindful of that fact and recognize different viewpoints, revere our deep commitment to religious freedom.\" \nThe Associated Press contributed to this report.", "external_links": [], "published": "2015-06-26T18:23:00.000+03:00", "crawled": "2015-06-27T00:06:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}