{"organizations": [], "uuid": "bd09c33d21a02037119a6f0a35bc7b655cb71a45", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3109862/images/o-CIA-DRONE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/drones/feed", "section_title": "Drones on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/24/obama-cia-drones_n_7649702.html", "country": "US", "title": "Obama Administration On Plan To Take Away CIA's Drones: Nevermind, Keep 'Em", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration On Plan To Take Away CIA's Drones: Nevermind, Keep 'Em", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T13:00:00.000+03:00", "replies_count": 0, "uuid": "bd09c33d21a02037119a6f0a35bc7b655cb71a45"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/24/obama-cia-drones_n_7649702.html", "ord_in_thread": 0, "title": "Obama Administration On Plan To Take Away CIA's Drones: Nevermind, Keep 'Em", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Administration On Plan To Take Away CIA's Drones: Nevermind, Keep 'Em Posted: reddit \nWASHINGTON -- President Barack Obama has abandoned his two-year push to consolidate his controversial targeted killing program under Pentagon control and has spent the past several months finalizing a new plan that would give the Defense Department and the CIA joint control of drone strikes, sources tell The Huffington Post. \nTwo years ago, Obama promised during a speech at the National Defense University that he would move the CIA's controversial drone program out of the covert shadows and into the relative sunlight of the Defense Department. Drone critics greeted the announcement with cautious optimism , hoping that a Pentagon-run drone program would be more transparent and allow more oversight of targeted killings. \nThe CIA and its allies on the congressional intelligence committees resisted Obama's proposal. But until recently, the Obama administration was still publicly pushing forward, saying as recently as April that it wanted to take the trigger out of the CIA's hands for good. \nBehind closed doors, all of that has changed. On June 10, administration officials gave a classified briefing to lawmakers laying out a blueprint for a new transition plan that would involve a dual command structure. That blueprint is all but complete, U.S. officials briefed on it said. \n\"About 95 percent,\" one U.S. official who attended the briefing told HuffPost. \"The 5 percent is details.\" \nThe White House's stark departure from its promises isn't sitting well with everyone. Although the CIA and Pentagon have both backed the new plan, lawmakers aren't convinced that the two bureaucracies -- each of which has long charged that the other isn't qualified to manage the drone program -- can finally cooperate. \n\"[The White House] was almost laughed out of the room,\" said another official in the June 10 briefing. \"It was just totally unworkable. It was dual command... that's not what the president's direction was.\" \nThe officials who agreed to speak with HuffPost requested anonymity to discuss the still-classified plan. \nThe first source said that although the White House publicly implied it wanted to end the CIA's drone program, that was never a realistic objective. \n\"It's more centrally operated than they may have originally intended, but the intention was always integration,\" the source said. \nThe White House declined to comment, but one administration official suggested the president had never intended to end the CIA program entirely. \n\"The broader point is we're not going to shut out any part of the United States government,\" that administration source said. \"Especially one that has the expertise and experiences that is useful across a range of means.\" \nThat includes analytical and operational capabilities, the official continued. \nControl of the drone program has long been a tense issue in Washington. The notoriously independent CIA is infamous for its tendency to not play nice with others, and suspicions abound in the beltway that the agency frequently trash talks the Defense Department, charging that they're not as precise nor careful as the CIA. The Pentagon's backers, meanwhile, have long insisted that soldiers, not spies, should be in charge of paramilitary operations, and CIA critics have argued that the agency's program is unchecked, citing the errant strike that took out two Western hostages, including an American, in Pakistan in January. \nThe CIA declined to comment for this story. The Pentagon did not respond to a request for comment. \nOn Capitol Hill, the CIA's defenders -- many of them on the Senate Intelligence Committee -- have lauded the agency's precision and care in conducting strikes, and insisted the CIA's oversight is second to none. Meanwhile, the Senate Armed Services Committee, led by Chairman John McCain (R-Ariz.), has consistently pushed to have the program moved fully to Pentagon control -- and under that panel's oversight jurisdiction. \nThe CIA's boosters succeeded in stymying the White House's plans last year. Dianne Feinstein (D-Calif.), who was then serving as chair of the Senate Intelligence Committee, prevented the White House from using federal dollars to end the CIA drone program by tacking a classified amendment onto a massive 2014 federal spending bill. Her measure passed, and further slowed the already slow trudge toward an overhaul. \nThis year, McCain has led an effort to insert his own language into the National Defense Authorization Act -- the annual must-pass defense spending bill -- that would bolster the president's plan to overhaul the program. \nBut a third U.S. official familiar with both McCain's proposal and the June briefing said the language is fairly benign. McCain, who has long championed shifting the program to Pentagon control, was forced to water down his measure to get his colleagues on the Intelligence Committee to support it. \nThe same factor that caused Obama to want to take the drone program away from the CIA may be part of the reason the agency is holding onto it: As covert operations, the agency's drone strikes aren't subject to the same international laws and domestic oversight as the Pentagon's. The CIA can more easily operate in countries such as Pakistan, where local governments may not necessarily sign off on U.S. strikes. \nBut the demise of the president's plan may have less to do with geopolitics and more to do with the government's internal power struggles. \n\"This is the classic example of the bureaucracies resisting even the president of the United States,\" the first official said. \"They've reached some unholy Faustian bargain... it's unworkable.\" Also on The Huffington Post Close Drones: The Future Of Flight of   Type: Military (U.S.) Description: Boeing's stealth Phantom Ray took to the skies for the first time in April 2011. According to Boeing, the Phantom Ray can perform missions such as intelligence, surveillance and reconnaissance; suppression of enemy air defenses; and electronic attack. Potential Deployment: Unknown. This is a \"demonstrator\" so there will likely be a future variation of the Ray. Type: Military (U.S.) Description: General Atomics Aeronautical Systems Predator Avenger C is a beast. According to the two-page brochure, the PAC is a \"Next-Generation Multi-mission ISR and Strike Aircraft\" and successor for the Predator B that can be stacked with a multitude of weaponry. Deployment: There is one demonstration craft currently in Afghanistan. Type: Military (U.S.) Description: Yo dawg, I heard you like drones so I put a drone in your drone. One small deadly warhead-equipped mini-drone stuffed into another, to be launched from the main drone and remotely aimed at a target. Potential Deployment: This warhead-equiped micro-UAV could be flown by SOCOM in the skies by spring 2012. Type: Military (USA) Description: AeroVironment's Switchblade is meant to be a portable, rapid deployment, beyond line-of-sight, \"loitering munition\" that is a \"magic bullet.\" A bit of advice, AeroVironment: Don't describe a remote-controlled bomb as a \"loitering munition\" that you call \"Switchblade,\" as it conjures up images of 1950's-style greasers loitering on street corners, flipping open switchblades idly as they wait for their favorite gals. Luckily, greasers won't be in charge of flying Switchblades. They're to be controlled by infantry and according to the AeroVironment, \"Flying quietly at high speed the Switchblade delivers its onboard explosive payload with precision while minimizing collateral damage.\" Potential Deployment: Undisclosed. Type: Surveillance (USA, DARPA Funded) Description: AeroVironment is at it again. In partnership with DARPA, they've actually managed to build a human mechanically engineered version of one of nature's most amazing flying machines: the hummingbird. The Nano Hummingbird is a perfect bid for James Bond-esque style spy shenanigans. Once these hit the field, we'll never look at hummingbirds the same way. \"Stop looking at me! That bird is following me!\" Potential Deployment: Within five years. Type: Military (U.S. Army) Description: Though the military's A160 Hummingbird drone doesn't resemble an actual hummingbird so much as AeroVironment's take, it is raising just as many alarms because of its potential to be deployed on the U.S. home front. Potential Deployment: May or June 2012, Afghanistan Type: Military (U.S. Navy) Description: Northrop Grumman describes the Firescout as a \"Transformational Fire Scout Vertical Takeoff and Landing Tactical Unmanned Aerial Vehicle system provides unprecedented situation awareness and precision targeting support for U.S. Armed Forces of the future. The MQ-8B Fire Scout has the ability to autonomously take off and land on any aviation-capable warship and at prepared and unprepared landing zones in proximity to the soldier in contact.\" Potential Deployment: March 2013 Type: Military (German Ministry of Defense, purchased from Northrop Grumman) Description: NG touts its Euro Hawk, built for German Ministry of Defense, as having a \"wingspan larger than a commercial airliner, endurance of more than 30 hours and a maximum altitude of more than 60,000 feet, EURO HAWK is an interoperable, modular and cost-effective replacement to the aging fleet of manned Breguet Atlantic aircraft, which have been in service since 1972 and will be retired in 2010.\" Potential Deployment: 2015, 2016 (PDF) Type: Military (U.S. Navy) Description: A carrier-based combat drone, Northrop Grumman's futuristic X-47B flew in its cruise configuration for the first time on November 22, 2011. It can land with precision on the deck of a moving aircraft carrier, and features twin weapons payload bays that hold up to 4,500 lbs. (PDF). Potential Deployment: 2018 Type: Military (British) Description: BAE System's Taranis (PDF) is aiming to \"Push the boundaries by providing advancements in low observability capability and autonomous mission systems operations demonstrating the feasibility and utility of UAVs.\" Such a statement starts to push the idea of fully autonomous flight from science fiction into science fact, though we're still a long way off from having an actual real debate on fully autonomous drones fighting our battles and flying our skies. Potential Deployment: TBD, test flights have been delayed to 2012. Type: Communications Description: Boeing's hydrogen-powered Phantom Eye is a High Altitude Long Duration Craft designed to fly at 65,000 feet for up to four days. Potential Deployment: Unknown Type: Intelligence, Surveillance, and Reconnaissance (ISR) Description: DARPA's description says the \"Vulture technology enables a re-taskable, persistent pseudo-satellite capability, in an aircraft package.\" Basically, DARPA is attempting to develop a super long duration craft capable of five year continuous flight. Think about that - the Vulture is intended to fly for up to five years continuously. If it were to launch this year it would be in the air for two Olympics. Potential Deployment: Unknown Type: Government Funded Space Exploration Description: While the proposal probably won't go through for this mission, this is an aerial drone we can really get behind. AVIATR would be a long distance drone that would fly the skies of Saturn's moon Titan. Potential Deployment: Beyond 2020 Type: Surveillance (Japan) Description: Techcrunch tells us that the drone can \"stand still in mid-air, fly vertically and horizontally through narrow spaces at up to 60km/h, and (which is very cool) keep on moving when it hits the ground or a wall. Thanks to three gyro sensors in its body, the machine can keep also flying even if it's hit by an obstacle.\" And all for only $1,400. Potential Deployment: Undisclosed  Share", "external_links": [], "published": "2015-06-24T13:00:00.000+03:00", "crawled": "2015-06-24T17:12:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}