{"organizations": ["Fox News GOP", "GOP", "Facebook", "Twitter"], "uuid": "e55a87c7e08eaf8e1808fdb377a0953e35e765a7", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/06/11/gop-obama-on-same-side-as-trade-bill-heads-for-close-vote/", "country": "", "title": "GOP, Obama on same side as trade bill heads for close vote | Fox News", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "GOP, Obama on same side as trade bill heads for close vote | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "e55a87c7e08eaf8e1808fdb377a0953e35e765a7"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/11/gop-obama-on-same-side-as-trade-bill-heads-for-close-vote/", "ord_in_thread": 0, "title": "GOP, Obama on same side as trade bill heads for close vote | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "GOP, Obama on same side as trade bill heads for close vote Published June 11, 2015 Facebook 0 Twitter 0 Email Print \nThe House plunged into a divisive two-day debate over trade legislation on Thursday, a controversy so thick that President Obama conferred on strategy with Republican Speaker John Boehner and drew a public rebuttal in the House from a Democratic foe of the measure. \nWith a showdown vote expected on Friday, Boehner declined to predict the fate of White House-backed legislation allowing Obama to complete global trade deals that Congress could approve or reject but not change. The bill also would renew an aid program, due to expire soon, for workers who lose their jobs as a result of international trade. \n\"I'm not in the guaranteeing business,\" Boehner said at a news conference after conferring with Obama on the phone. \n\"I know he's working on it and I hope he's successful,\" the Ohio Republican said of the president's campaign to secure Democratic votes. \nThe White House dispatched Treasury Secretary Jacob Lew and other administration officials to a midday closed-door meeting with House Democrats, but there was no immediate indication they came away with any converts. Richard Trumka, head of the AFL-CIO, also attended the occasionally heated session, and strongly recommended defeat of the trade bill. \nThe House's top Democrat, Minority Leader Nancy Pelosi of California, remained publicly uncommitted, as did some other members of the leadership. She has sought to maintain leverage to the end to sweeten the package for workers directly disadvantaged by trade. \nBut opposition to the White House-backed measure was so intense among some Democrats that Trumka and some lawmakers backed a strategy of defeating the aid program they normally support, thinking it would seal the defeat of the trade measure itself. \nRepublicans hold a commanding 246-188 majority in the House but were expecting a large number of defections on the trade measure. \nThe legislation is a top priority for the president, who hopes to complete a major deal with 11 Pacific Area nations. It has drawn fierce opposition from Democrats, many of them supported by unions arguing that expanded global trade will cost jobs at home. \nObama has publicly disagreed with critics in his own party on the merits of the legislation, saying they were wrong in their objections. \n\"You're not right, Mr. President. Actually, you're wrong on that one,\" Rep. Peter DeFazio, D-Ore., said in remarks on the House floor. \nHe drew a warning from the House chair not to engage in personal criticism of the president. \nThe legislation to strengthen Obama's hand in international talks was one of several trade-related measures pending in the House. \nThe first bill to be considered would extend existing rules for trade with African nations, Haiti and elsewhere. It was adjusted by Republicans at the last minute to eliminate a provision in the trade measure itself that called for a cut in Medicare to help pay for the aid to workers. Tougher tax compliance measures were inserted instead. \nThe bill cleared overwhelmingly, 397-32, a reflection of fear among lawmakers in both parties of being vulnerable to a charge of cutting Medicare. \nPelosi sought an additional change, pressing to make government workers eligible for aid, but Republicans ruled that out. Boehner told reporters that the last time a so-called trade adjustment bill was approved, government workers were eligible for aid but none ever qualified. \nIt was unclear if that would be a deal-breaker for Pelosi. \nThe maneuvering in the House marked the beginning of a two-day struggle, and capped an effort by Republicans to reassure members of their own rank and file who distrust Obama and are not eager to expand his authority. \nThey included language in the package of bills to limit any impact of trade deals on immigration, climate policy and other issues. \nFor once in an era of divided government, most Republicans and the White House were on the same side of a bitterly contested issue. \nLike Obama, GOP supporters of the bill argued that global trade deals are essential to give U.S. firms the ability to complete with overseas companies. \n\"Either we shape the global economy, as Americans, with trade agreements, or it shapes us. The rest of the world is moving,\" Rep. Paul Ryan, R-Wis., said in an interview on Fox during the day. \nRyan is the chairman of the House Ways and Means Committee and was the 2012 Republican vice presidential candidate. \nLabor Secretary Tom Perez, in a letter to Democratic lawmakers, stressed support for the renewal of the assistance program, which Pelosi was still trying to change as the letter landed. Advertisement ", "external_links": [], "published": "2015-06-11T03:00:00.000+03:00", "crawled": "2015-06-11T23:41:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}