{"organizations": [], "uuid": "3b839ca16cca7f55efa7399381ce94c8eb3c6827", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/overnights/246070-overnight-finance-win-for-obama-as-fast-track-clears-senate", "country": "US", "title": "Overnight Finance: Win for Obama as fast-track clears Senate", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Finance: Win for Obama as fast-track clears Senate", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T01:23:00.000+03:00", "replies_count": 0, "uuid": "3b839ca16cca7f55efa7399381ce94c8eb3c6827"}, "author": "mmali@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/overnights/246070-overnight-finance-win-for-obama-as-fast-track-clears-senate", "ord_in_thread": 0, "title": "Overnight Finance: Win for Obama as fast-track clears Senate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Finance: Win for Obama as fast-track clears Senate By Kevin Cirilli - 06/24/15 06:23 PM EDT \nTOMORROW STARTS TONIGHT: OBAMA GETS TRADE AUTHORITY. Alexander Bolton for The Hill: \"The Senate voted Wednesday to approve fast-track authority, securing a big second-term legislative win for President Obama after a months-long struggle.\" \n1.) THE TALLY: The 60-38 Senate vote capped weeks of fighting over the trade bill, which pitted Obama against most of his party -- including Senate Democratic Leader Harry Reid (Nev.) and House Minority Leader Nancy Pelosi (D-Calif.). ADVERTISEMENT 2.) THE WINNERS: Passage of the bill is also a big victory for GOP leaders in Congress, including Senate Majority Leader Mitch McConnell (R-Ky.) and Speaker John Boehner (R-Ohio). The Republican leaders worked closely with an administration they have more frequently opposed to nudge the trade bill over the goal line.\n3.) THE LOSERS: Labor unions and liberal Democrats fought hard against fast-track authority and are likely to now turn their attention toward stopping the Trans-Pacific Partnership, a trade deal Obama is negotiating with 11 other Pacific Rim nations. Bolton's story: http://bit.ly/1GqOws8 \n-- Pete Schroeder and Vicki Needham have more on who's up and who's down after the trade battle: http://bit.ly/1dgS2gj \nTHIS IS OVERNIGHT FINANCE, and tomorrow is Thursday. I had a buffalo chicken wrap for already so I'm in a good mood. Stay hungry. Stay grateful. Tweet: @kevcirilli ; email: kcirilli@thehill.com ; and subscribe: http://thehill.com/signup/48 \nON-TAP FOR TOMORROW: Two more officials at the Consumer Financial Protection Bureau (CFPB) will testify and bring new evidence to a House Financial Services subcommittee for their claims that discrimination and retaliation have gotten worse at the agency. \n-- FLORINE WILLIAMS , a career professional with 20+ years of Equal Employment Opportunity experience who now serves as a senior equal employment specialist at CFPB, in sworn-testimony: \"Ironically, the agency that was created to provide comprehensive consumer protections and strong remedies for consumer harm has unequivocally failed to protect its own employees and remedy the harms we have suffered... \n-- MORE FROM WILLIAMS: \"I am frequently approached by colleagues who tell me they are being subjected to maltreatment and discrimination but who fear they will face reprisal if they seek help through OCR's EEO process. I cannot adequately describe the pervasive and chilling atmosphere that prevails throughout the CFPB.\" Read her testimony: http://1.usa.gov/1FBNnMH \nLEGISLATIVE DAYS UNTIL EX-IM's CHARTER EXPIRES: One. And Sen. Ted Cruz (R-Texas) is already moving ahead, looking to kill any chance the bank has to get reauthorized in July. Alexander Bolton for The Hill: \"Texas Sen. Ted Cruz, who has drifted to the middle of the pack of Republican presidential contenders, is girding for his next battle with GOP leaders: reauthorization of the Export-Import Bank. The firebrand conservative on Wednesday challenged Senate Majority Leader Mitch McConnell (R-Ky.) and Speaker John Boehner (R-Ohio) to block any vote on reauthorizing the Export-Import Bank next month.\" \n-- Meanwhile, Ex-Im President Fred Hochberg tells me he's still very optimistic the bank will be reauthorized next month. Hochberg also described a \"deep anxiety\" that has gripped the bank's 450 employees as lawmakers grapple with the fate of the bank. He said that the political battle has hurt the bank's staff recruitment efforts. But he praised their continued hard work. Hochberg said he's still a long ways from having to draft any wind-down plans, and he noted that the bank is fully funded through the Congressional appropriations process through Sept. 30. My exclusive: http://bit.ly/1KaoDS1 \n2016-WATCH: CLINTON V. SANDERS: IT'S ON. MarketWatch: \"Elizabeth Warren has officially missed the boat on running for president, but that doesn't mean Hillary Clinton has clear sailing to the Democratic nomination. Two leaders of the 'Ready for Warren' movement that sought to draft the Massachusetts Democrat have accepted her decision not to run and switched their support to Vermont independent Bernie Sanders as the new standard bearer for progressive policies. \n\"These policies, which are resonating with enthusiastic crowds, include federal investment in infrastructure to create jobs; a higher minimum wage; paid sick leave; higher tax rates for the rich; campaign finance reform; a tougher line on trade accords; subsidies for higher education; and further reforms to guarantee health care for all, among others.\" http://on.mktw.net/1HhmoeL \nQUOTABLE, billionaire Carl Icahn on CNBC earlier today talking markets: \"I think the public is walking into a trap again as they did in 2007. I think it's almost the duty of well-respected investors, like myself I hope, to warn people, to tell people, that really you are making errors.\" http://cnb.cx/1LuHn0h \nNOTABLE: MORE YOUNG PEOPLE CAN'T AFFORD COLLEGE, via WaPo's Wonk Blog: \"A federal program for the country's neediest college students is witnessing a troubling trend: an influx of students with fewer resources to pay for school. In its latest report on the Pell Grant program, the Education Department said nearly three quarters of the 8.6 million students who received the federal grant to attend college last year reported having no savings or other cash on hand. That compares to 60 percent of federal grant recipients five years earlier.\" http://wapo.st/1JjolcS \nMARK YOUR CALENDAR: Federal Reserve Chair Janet Yellen will appear before the Senate Banking Committee on Wednesday, July 15 at 10 a.m. for the Fed's semi-annual Monetary Policy Report to Congress and to discuss the state of the economy. \nFED WATCH: THEY WANT BIZ COMMUNITY TO HELP WRITE STRESS TESTS. Not The Onion , but it's still Cirilli - - > Federal Reserve officials are asking the business community for advice on how to test financial institutions' preparedness for economic calamity. Fed vice chairman Stanley Fischer said Wednesday that the central bank is considering changes to how it monitors financial institutions, a process known as \"stress tests\" within the industry. \n-- FISCHER: \"As part of that assessment process, we are also currently seeking feedback from the industry, market analysts and academics about the program,\" Fischer said during a speech an economic forum in Sweden. http://bit.ly/1eHO2Hk \nFIDUCIARY FIGHT: PEREZ DEFENDS CONTROVERSIAL RULES -- BY CITING REAGAN. Labor Secretary Thomas Perez is defending his agency's regulatory proposals for financial advisers amid an onslaught of criticism from the business community. In a Washington speech on Tuesday, Perez assailed the current system as \"anachronistic\" and argued that the administration's proposals amount to a \"common sense,\" \"middle-ground\" approach that's rooted in President Reagan's adage, \"trust -- but verify.\" http://bit.ly/1JjpjWI \nBIZ BRACES FOR CFPB's 'YELP.com' DATABASE, via me: Regulators are getting ready to release the first batch of complaints from consumers about banks and other financial services industry players, according to two sources familiar with the plans. The complaints would be released online through the Consumer Financial Protection Bureau. A CFPB spokesperson could not immediately be reached for comment. \n-- BACKSTORY: The business community has assailed the CFPB complaint database, arguing that it's got about as much credibility as Yelp.com, where anonymous consumers can post complaints about businesses and potentially raise a company's reputational risk. But supporters of new site argue that it's filling a void for consumers who have no place to go when they have complaints about the financial services industry. Already more than 400,000 consumer complaints have been filed on the site. http://bit.ly/1QQE7QA", "external_links": [], "published": "2015-06-25T01:23:00.000+03:00", "crawled": "2015-06-25T06:47:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}