{"organizations": ["Trans-Pacific Partnership", "Congress", "House", "Carter Hill Orchard", "Democratic"], "uuid": "e24bdadc0e88c33108a820f5338128a2a37794af", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150615095559-hillary-clinton-lemonade-trade-agenda-00004004-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/06/15/europe/pope-climate-change-encyclical/index.html", "country": "US", "title": "Clinton: Obama should leverage Democratic trade rift", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Clinton: Obama should leverage Democratic trade rift", "spam_score": 0.0, "site_type": "news", "published": "2015-06-15T23:48:00.000+03:00", "replies_count": 0, "uuid": "718c709623490126228e70bb8783b8d26c130d97"}, "author": "", "url": "http://edition.cnn.com/2015/06/15/politics/hillary-clinton-trade-new-hampshire/index.html", "ord_in_thread": 0, "title": "Clinton: Obama should leverage Democratic trade rift", "locations": ["Rochester", "Panama", "New Hampshire", "New York", "America", "U.S.", "Maryland", "Colombia", "Iowa", "South Korea"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Bush", "Bill Clinton", "O'Malley", "George W. Bush", "Richard Nixon", "Dorthy", "Obama", "Clinton", "Hillary Clinton", "Chelsea", "Lis Smith", "Martin O'Malley"], "text": "Hillary Clinton on trade: Let's turn lemons into lemonade 02:32 Concord, New Hampshire (CNN) Hillary Clinton had a message for President Barack Obama on the trade deal that is dividing Democrats: Rip it up if that's what it takes. \"There is always room to maneuver, and I think this is one of those times,\" she said here on Monday. The Democratic front-runner again declined to say whether she thinks Obama should have authority to fast-track the massive Pacific trade deal through Congress without amendments — which U.S. trade negotiators say is leverage they need to get the 12-nation deal done. Clinton dismissed the fight over that legislation, known as trade promotion authority, as \"a process issue.\" But she said the intra-party fight over the measure, with House Democrats on Friday delivering Obama a stunning rebuke, should allow Obama to scrap and redo some of the deal's biggest elements — and only then get close enough to ask Congress for trade promotion authority. She even offered a specific example, citing a pact with South Korea that was negotiated and finalized under President George W. Bush — and then opened back up for changes early in Obama's first term. \"I think that the president's team could go to every one of these other parties and say, 'I know you understand the process of fast track. I want to get it, but I'm going to have to make some adjustments in order to get it. But if I get it, then we have to negotiate on the basis of those adjustments,'\" Clinton said. \"I think that is really worth trying.\" READ: Hillary Clinton takes a stand on trade - kind of Every president since Richard Nixon has had trade promotion authority. Bill Clinton used it to get the North American Free Trade Agreement through Congress. Bush had it to implement a similar Central American deal, and Obama used the authority — which hadn't yet expired after lawmakers gave it to Bush — to get deals with South Korea, Colombia and Panama cleared. But Clinton suggested Monday that the Trans-Pacific Partnership isn't close enough to completion for Congress to grant that authority to Obama. \"I believe that you take whatever happens to you in a negotiation and you try to leverage it,\" Clinton said. \"In this case, I believe that one of the ways the president could get fast-track authority is to deal with the legitimate concerns of those Democrats who are potential 'yes' voters, to see what within the negotiation — or what's even in the existing framework agreement that is being drafted — could be modified or changed.\" She tore into a mechanism in the deal that would let corporations ask an international arbiter to rule against countries' laws and regulations when those rules violate the country's trade obligations. That, she said, is a \"fundamentally anti-Democratic process.\" She said it should be opened up to include local governments, environmental and public health groups and more — otherwise, \"I'm not sure that's a fair way to resolve a dispute.\" It was a more nuanced answer than Clinton has delivered on trade promotion authority, or \"fast-track,\" before. But it didn't stop Democratic foes like former Maryland Gov. Martin O'Malley from saying she still needs to give a yes-or-no answer. READ: Why a trade deal matters to 'big on the pig' Iowa \"For the thousands of America workers whose jobs are on the line with TPP, fast track is not a 'process' issue, it's a straightforward vote on their future and their livelihood,\" said O'Malley deputy campaign manager Lis Smith. \"The facts are clear - TPP will not be negotiated without fast track, and Governor O'Malley believes we must stop the fast-track vote in Congress now because TPP will be a bad deal for America's middle class. Now is a time for leadership, not political dodges.\" Clinton's day-long visit to New Hampshire was her third since announcing her candidacy in April. The presidential candidate spent the morning in Rochester, where she read to young students and spoke about the importance of early childhood education. She finished the trip by headlining the Manchester Democrats' Flag Dinner. This was not Clinton's first stop at the Carter Hill Orchard. She, along with her daughter, Chelsea, and mother, Dorthy, visited in December 2007 for a \"Hillary I Know\" event during her first fight for the Democratic nomination. Clinton revisits the orchard days after she relaunched her campaign in a speech the focused heavily on her mother and the legacy she left (she died in 2011). Clinton mentioned her 2008 loss on Monday, telling the audience that her current run was not because she was upset about losing seven years ago. \"I'm not angry at anybody,\" Clinton said to applause. \"I am determined.\" The prepared portion of her speech pulled heavily from her first large campaign rally in New York. Clinton highlighted the \"four fights\" that are grounding her campaign, arguing that she would \"get up every single day and... fight for you.\" At one point, Clinton said, \"When does your hard work pay off? When?\" In what became one of Clinton's biggest applause lines of the day, a women in the audience filled a lull of silence with, \"When you're in the White House!\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div>", "external_links": [], "published": "2015-06-15T23:48:00.000+03:00", "crawled": "2015-06-16T00:09:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}