{"organizations": [], "uuid": "4c48ff7cefd44f489004eedb2ee047c187f7631f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/Congress%20Trade_Cham6403600623.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/23/obama-trade-agenda-clears-key-senate-test-vote/", "country": "US", "title": "Obama trade agenda clears key Senate test vote", "performance_score": 3, "site": "foxnews.com", "participants_count": 17, "title_full": "Obama trade agenda clears key Senate test vote | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-23T03:00:00.000+03:00", "replies_count": 20, "uuid": "a9c2c33048cfe1c27cd4666ee89a2332d51b1c62"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/23/obama-trade-agenda-clears-key-senate-test-vote/#post-0", "ord_in_thread": 0, "title": "Obama trade agenda clears key Senate test vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 23, 2015 FoxNews.com FILE - In this June 16, 2015, file photo, Senate Majority Leader Mitch McConnell, , R-Ky., speaks to members of the media following the weekly Republican luncheon on Capitol Hill in Washington. (AP Photo/Susan Walsh, File)\nPresident Obama's trade agenda narrowly survived a key Senate test vote on Tuesday, moving the legislation toward likely passage just days after congressional leaders helped rescue it from a Democrat-led rebellion.\nThe Senate voted, 60-37, to cut off debate and move toward a final vote. The bill needed 60 votes to advance.\nThe result is a big win for the White House and Republican congressional leaders who allied with the president on the package -- an issue that has created unusual alliances and stirred deep tensions within the Democratic caucus.\nThe bill itself would allow Obama to obtain \"fast track\" authority on trade deals, which would let him negotiate deals that Congress can ratify or reject, but not change. He wants that power to move the so-called Trans-Pacific Partnership with Japan, Mexico, Canada and several other countries.\nTuesday's result comes after House GOP leaders employed some legislative gymnastics to advance a new version of the bill last week, after a prior attempt had failed. Republican leaders -- who support Obama on trade while most of his fellow Democrats oppose him -- restructured the package and then passed the key elements, with only 28 House Democrats.\nOn Tuesday, 13 Senate Democrats voted with most Senate Republicans to advance the measure, known as Trade Promotion Authority.\nSen. Ted Cruz, R-Texas, who voted for the measure the last time it came up, switched his vote to \"no\" on Tuesday. In a press release, Cruz cited an op-ed he wrote for Breitbart.com saying the process has \"become enmeshed in corrupt Washington backroom deal-making, along with serious concerns that it would open up the potential for sweeping changes in our laws that trade agreements typically do not include.\"\nDemocratic critics, including union leaders, generally charge that the trade package could hurt U.S. workers.\nObama and GOP allies, though, say it will be a boon for the economy.\nHours before the vote, House Speaker John Boehner, R-Ohio, said the goal was to get the bills to Obama by week's end before Congress breaks for the July 4th recess \"and deliver this win for the American people.\" Senate Majority Leader Mitch McConnell, R-Ky., pushed the measure in his chamber.\nAnti-free-trade groups are employing ads, phone banks and other tools to defeat Obama's trade agenda. An AFL-CIO ad warns that the legislation includes \"no training for displaced workers\" who lose their jobs to international trade.\nSuch aid, known as trade adjustment assistance, was linked to fast track in the original packaging. After House Democrats, at the AFL-CIO's urging, derailed the whole package by killing the training component, Obama's allies agreed to separate the two issues and try again.\nThe Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Most illegal immigrants from border surge skipped court date after release, records show 2 Obama trade agenda clears key Senate test vote 3 Amtrak employees claimed to work 40 hours per day 4 US military moving tanks, other equipment to allied nations near Russian border 5 Hillary’s hurting! Hillary could lose! The media’s mini-panic over Bernie Sanders See all Trends Advertisement", "external_links": [], "published": "2015-06-23T03:00:00.000+03:00", "crawled": "2015-06-23T20:30:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}