{"organizations": ["Athena Jones", "Congress", "CNN", "NRA", "ACA", "Supreme Court"], "uuid": "c5d4ffc0c15e23c540f445a4e5cb06a0659bcddc", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150622074538-obama-in-san-francisco-ca-june-19-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/06/22/us/charleston-church-shooting-main/index.html", "country": "US", "title": "Barack Obama says the N-word to Marc Maron's podcast", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Barack Obama says the N-word to Marc Maron's podcast", "spam_score": 0.0, "site_type": "news", "published": "2015-06-22T15:48:00.000+03:00", "replies_count": 0, "uuid": "fc5196550f83c9bad173afc2e521bdcba8ac15cd"}, "author": "", "url": "http://edition.cnn.com/2015/06/22/politics/barack-obama-n-word-race-relations-marc-maron-interview/index.html", "ord_in_thread": 0, "title": "Barack Obama says the N-word to Marc Maron's podcast", "locations": ["America", "Charleston"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jim Crow", "Barack Obama", "Kristen Holmes", "Marc Maron", "Obama"], "text": "Obama quotes MLK in wake of Charleston shooting 01:27 PLAY VIDEO Obama said that progress on race relations has been made, citing his own experience as a young man who was born to a white mother and an African father. \"I always tell young people, in particular, do not say that nothing has changed when it comes to race in America, unless you've lived through being a black man in the 1950s or '60s or '70s. It is incontrovertible that race relations have improved significantly during my lifetime and yours,\" Obama said. But he added that \"the legacy of slavery, Jim Crow, discrimination\" exists in institutions and casts \"a long shadow and that's still part of our DNA that's passed on.\" Obama used the N-word and explained that the absence of racist language does not mean that racism doesn't exist. \"Racism, we are not cured of it. And it's not just a matter of it not being polite to say nigger in public,\" Obama said. \"That's not the measure of whether racism still exists or not. It's not just a matter of overt discrimination. Societies don't, overnight, completely erase everything that happened 200 to 300 years prior.\" READ: Republicans take a pass on Confederate flag Obama echoed comments he made Thursday and said that he's had to make speeches about a \"devastating loss\" too often. \"It's not enough just to feel bad. There are actions that could be taken to make events like this less likely. One of those actions we could take would be to enhance some basic common sense gun safety laws,\" Obama said. Obama lamented Congress's lack of action on gun control and said \"Unfortunately, the grip of the NRA on Congress is extremely strong. I don't foresee any legislative action being taken in this Congress.\" Obama also weighed in on a critical case that is currently before the Supreme Court, where opponents of the Affordable Care Act are asking whether the law authorizes tax subsidies for 6.4 million Americans who have already received help to afford health coverage. READ: How the Supreme Court could send Obamacare into a \"death spiral\" \"First of all I'm confident we'll win, because the law is clearly on our side,\" Obama said. He added that if the nation's highest court were to rule in favor of the ACA's opponents, \"five to six million people could lose their healthcare.\" CNN's Athena Jones and Kristen Holmes contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-06-22T15:48:00.000+03:00", "crawled": "2015-06-22T16:07:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}