{"organizations": ["Team America Rocketry Challenge", "Emery Dodson", "White House"], "uuid": "e3c65331ae8e343373954111d109de2c8581f7f0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3119416/images/o-BARACK-OBAMA-SCIENCE-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/25/barack-obama-david-attenborough_n_7667832.html", "country": "", "title": "Watch Obama Discuss Climate Change With Naturalist Sir David Attenborough", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Watch Obama Discuss Climate Change With Naturalist Sir David Attenborough", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T04:56:00.000+03:00", "replies_count": 0, "uuid": "e3c65331ae8e343373954111d109de2c8581f7f0"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/25/barack-obama-david-attenborough_n_7667832.html", "ord_in_thread": 0, "title": "Watch Obama Discuss Climate Change With Naturalist Sir David Attenborough", "locations": ["Wallenpaupack", "Washington", "U.S. Virgin Islands", "Okla.", "DC", "Phoenix", "Tulsa", "Oklahoma", "Massachusetts", "Arizona", "Denver", "Pittsburgh", "Pennsylvania", "Colorado", "Cambridge"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Attenborough", "Alicia Cutter", "Barack Obama", "Emily Bergenroth", "Tiye Garrett", "Mohammed Sayed", "Isela Martinez", "Kaitlin Rees", "Sahil Doshi", "Stephanie Bullock", "Kristian Sonsteby", "Karissa Cheng", "Addy", "Sergio Corral", "Kaitlin Reed"], "text": "2015 White House Science Fair of   President Barack Obama tries a wheel chair powered by a rowing motion designed by Kaitlin Reed of Massachusetts during the 2015 White House Science Fair on March 23, 2015, in Washington, DC. The fair celebrates student winners who created projects to illustrate mastery of science, technology, math or engineering. President Barack Obama tries an attachable lever, created by Kaitlin Rees, that can make wheelchair movements easier, while Mohammed Sayed -- who developed a 3D-printed modular arm -- looks on. Mohammed Sayed of Cambridge, Massachusetts, speaks to President Barack Obama about his modular 3D printed and magnet-based wheelchair accessories during the 2015 White House Science Fair. President Barack Obama tours an exhibit with six-year-old Girl Scouts from Tulsa, Okla., during the White House Science Fair in the Red Room of the White House in Washington on Monday, March 23, 2015. The Girl Scouts -- Emily Bergenroth, Alicia Cutter, Karissa Cheng, Addy O'Neal and Emery Dodson -- used Lego pieces and designed a battery-powered page turner to help people who are paralyzed or have arthritis. President Barack Obama poses with six-year-old Girl Scouts from Tulsa, Okla. during the White House Science Fair, Monday, March 23, 2015, in the Red Room of the White House in Washington. President Barack Obama tours an exhibit by six-year-old Girl Scouts during the White House Science Fair in the Red Room of the White House in Washington on Monday, March 23, 2015. The Girl Scouts -- including Emily Bergenroth, Alicia Cutter, Karissa Cheng, Addy O'Neal and Emery Dodson from Tulsa, Okla. -- used Lego pieces and designed a battery-powered page turner to help people who are paralyzed or have arthritis. President Barack Obama receives a hug from Girl Scouts from Tulsa, Oklahoma during the 2015 White House Science Fair. Tiye Garrett of Denver, Colorado, explains her method of cheaply scanning leaves to share samples with other scientists during the 2015 White House Science Fair March 23, 2015 in Washington, DC. Sergio Corral and Isela Martinez, both of Phoenix, Arizona, explain their robot to President Barack Obama during the 2015 White House Science Fair. Kristian Sonsteby of Wallenpaupack, Pennsylvania, watches as President Barack Obama makes waves to illustrate her solution to generate electricity from docks bobbing in the water during the 2015 White House Science Fair. President Barack Obama listens to Stephanie Bullock, who is part of a team from the U.S. Virgin Islands that designed rockets for the Team America Rocketry Challenge, during the 2015 White House Science Fair. President Barack Obama listens to Sahil Doshi, 14, from Pittsburgh, Pennsylvania, who designed an innovative carbon-dioxide powered battery to reduce the environmental effects of pollution. President Barack Obama spoke in the East Room of the White House in Washington on Monday, March 23, 2015, during the 2015 White House Science Fair. Here, he jokingly gestures towards the exit doors after he smelled smoke during the event. The fair celebrated the student winners of a broad range of science, technology, engineering and math (STEM) competitions from across the country. The 2015 Science Fair has a specific focus on diversity and includes many students.  Share ", "external_links": [], "published": "2015-06-26T04:56:00.000+03:00", "crawled": "2015-06-26T04:56:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}