{"organizations": ["North Carolina", "Facebook", "Twitter", "Supreme Court"], "uuid": "d1fc7938154da86be02040ccb43e769b1c6eed55", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/politics/2015/06/15/supreme-court-wont-revive-north-carolina-abortion-law/", "country": "US", "title": "Supreme Court won't revive North Carolina abortion law", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Supreme Court won't revive North Carolina abortion law", "spam_score": 0.0, "site_type": "news", "published": "2015-06-15T18:18:00.000+03:00", "replies_count": 0, "uuid": "d1fc7938154da86be02040ccb43e769b1c6eed55"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/15/supreme-court-wont-revive-north-carolina-abortion-law/", "ord_in_thread": 0, "title": "Supreme Court won't revive North Carolina abortion law", "locations": ["North Carolina"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Supreme Court won't revive North Carolina abortion law Published June 15, 2015 Facebook 0 Twitter 0 Email Print \nThe Supreme Court on Monday rejected an appeal from North Carolina to revive a requirement that abortion providers show and describe an ultrasound to a pregnant woman before she has an abortion. \nThe justices left in place an appeals court decision that said the 2011 North Carolina law was \"ideological in intent\" and violated doctors' free-speech rights. \nThe North Carolina law would have required abortion providers to display and describe the ultrasound even if the woman refused to look and listen -- a mandate that the court found particularly troublesome. \nNorth Carolina is among 23 states, mostly in the South and the Midwest, which passed laws dealing with the administration of ultrasounds by abortion providers, according to the Guttmacher Institute, a research institute that supports abortion-rights. \nJustice Antonin Scalia voted to hear the appeal. \nThe court took no action in a separate abortion case from Mississippi. The state is appealing a lower court ruling that effectively allowed Mississippi's lone abortion clinic to remain open and blocked a state law that would have required the clinic's doctors to have admitting privileges at a nearby hospital. \nA second appeals court ruling involving a Texas law imposing restrictions on abortion providers also is expected to make its way to the Supreme Court soon. In Texas, the appeals court upheld the admitting privileges requirement and other provisions that could force 11 clinics to close by July 1, lawyers for the clinics said in court papers. \nThe North Carolina case is Walker-McGill v. Stuart, 14-1172. Advertisement", "external_links": [], "published": "2015-06-15T18:18:00.000+03:00", "crawled": "2015-06-15T18:27:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}