{"organizations": [], "uuid": "39c5539b3da76f1c660b4cf88f09e54a55a30698", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/murraypatty_cantwellmaria_heitkampheidi_0615fr.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/senate/245790-obama-scrambles-for-votes-on-fast-track", "country": "US", "title": "Obama scrambles for votes on fast-track authority", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama scrambles for votes on fast-track authority", "spam_score": 0.0, "site_type": "news", "published": "2015-06-23T13:00:00.000+03:00", "replies_count": 0, "uuid": "39c5539b3da76f1c660b4cf88f09e54a55a30698"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/senate/245790-obama-scrambles-for-votes-on-fast-track", "ord_in_thread": 0, "title": "Obama scrambles for votes on fast-track authority", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama scrambles for votes on fast-track authority By Alexander Bolton - 06/23/15 06:00 AM EDT President Obama scrambled for votes Monday as Democratic support trickled in for his trade agenda, despite strong pressure from unions. Labor groups led by the AFL-CIO are furiously lobbying Democrats to oppose fast-track authority when the Senate votes on a procedural motion Tuesday. ADVERTISEMENT The measure would help Obama negotiate the largest trade deal in history with 11 other countries along the Pacific Rim by limiting interference from Congress. Obama’s trade bill needs 60 votes, and he can afford no more than three Democratic defections. As of Monday evening, he had not yet secured public promises from all the Democrats he needs. Backers of fast-track likely need 11 Democratic votes because five of the Senate’s Republicans voted against the trade package last month. Sens. Maria Cantwell (D-Wash.) and Heidi Heitkamp (D-N.D.) said Monday they are still reviewing their options, while Sen. Ben Cardin (D-Md.) insisted he wants fast-track to remain bundled with Trade Adjustment Assistance (TAA), an aid program for workers hurt by foreign competition. Democratic Sens. Chris Coons (Del.), Michael Bennet (Colo.), Jeanne Shaheen (N.H.) and Claire McCaskill (Mo.) declined to say Monday evening how they would vote. Cantwell told reporters last week she would vote against fast-track because it was not attached to TAA, but her office walked back the comment Monday. Heitkamp is holding out for a guarantee that the Export-Import Bank will be reauthorized before its charter expires on June 30. Sen. Patty Murray (Wash.), the fourth-ranking member of the Democratic leadership and one of the leaders of the Senate’s pro-trade Democrats, declined to say how she would vote. Obama got a boost Monday afternoon, however, when Sen. Ron Wyden (D-Ore.) announced he would support fast-track, even untethered from TAA. Wyden and other pro-trade Democrats have wavered over the past week because GOP leaders split the legislation after House Democrats defeated TAA in a bid to derail the broader agenda. In the end, Wyden and other Democrats realized they had gone too far out on a limb to turn back, having voted last month for a trade package that included both. “The trade package currently before the Senate is a blueprint for trade done right,” Wyden said in a statement. “It will make our country stronger by opening new markets to American products and creating new opportunities for good-paying American jobs.” Democratic Sens. Tom Carper (Del.), Bill Nelson (Fla.), Dianne Feinstein (Calif.) and Tim Kaine (Va.) signaled Monday they will also vote for fast-track. “I intend to vote for cloture on the Trade Promotion Authority bill because the facts show that expanded trade with the Asia-Pacific region helps California and the country as a whole,” Feinstein said in a statement. Supporters of fast-track argue that trade supports more than 4.7 million jobs in California. Treasury Secretary Jack Lew on Sunday described an all-out lobbying offensive by the administration. “One thing I can say is the president spared no effort on this. He’s talked to more members than I can count, more senators than I can count, and everyone in the Cabinet, including myself, is doing their job to try and get this across the finish line,” he told CNN’s Fareed Zakaria. White House press secretary Josh Earnest told reporters Monday that Obama would keep up the pressure campaign until the vote. “I do think the president will be engaged in that effort,” he said. The Senate’s vote Tuesday to end debate on fast-track — if it gets 60 backers — will set up a final roll call on the measure later in the day or Wednesday. The chamber would then vote on a package of trade preferences combined with the African Growth and Opportunity Act and TAA. That measure is expected to clear Wednesday or Thursday. Senate Majority Leader Mitch McConnell (R-Ky.) predicted Monday that both would make it to Obama’s desk by week’s end. “Now I know how important it is, particularly for my friends on the other side of the aisle, to get both TPA [trade promotion authority] and TAA done,” McConnell said on the floor. “It’s why I set in motion a process last week — filing cloture on the vehicles for both TPA and TAA so that we get one done followed immediately by the other — that will put both pieces of legislation on the president’s desk before the July 4 [recess].” McConnell has promised Democrats that a customs and enforcement bill that needs to be reconciled with a version from the House will also make it to Obama for a signature. Senate Democratic leaders are not whipping against fast-track, leaving it to unions to do the heavy lifting to defeat it. The AFL-CIO urged Democrats Monday to vote against fast-track and warned they had no guarantee that TAA will pass the House, where many Republicans oppose it. “Without assurances that TAA will pass the House, or that the customs bill will ever see the president’s desk, considering Fast Track prematurely could compound its expected negative impacts, leaving U.S. workers in the lurch and depriving the U.S. manufacturing sector of vital tools necessary to combat unfair trade,” William Samuel, the union’s director of government affairs, wrote in a letter to senators. A turning point in his negotiations with pro-trade Democrats came when McConnell offered to add to the mix legislation that would help U.S. companies petition the Commerce Department and International Trade Commission to respond to infractions of trade rules. The Leveling the Playing Field Act, sponsored by Sens. Sherrod Brown (D-Ohio) and Rob Portman (R-Ohio), a close ally of McConnell’s, is attached to the package of trade preferences and worker assistance. “We urged Republican leaders to include Sen. Brown’s trade enforcement bill as a sign of good faith that Republican leaders will do what is necessary to ensure the entire trade package gets done,” Wyden said in his statement, describing his “round-the-clock discussions” with McConnell. Heritage Action for America urged Republican senators to vote against fast-track Tuesday. The conservative advocacy group argued that passing fast-track would pave the way for later passage of what it called the “ineffective” TAA program, which is paid for with tax penalties. “The new pay for — included in H.R. 1295 which the Senate will also consider this week — increases revenue by raising certain tax penalties. New spending should not be offset by new revenues,” the group wrote in a legislative alert Monday. Jordan Fabian and Vicki Needham contributed.", "external_links": [], "published": "2015-06-23T13:00:00.000+03:00", "crawled": "2015-06-23T13:18:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}