{"organizations": ["Senate", "Fox News Latino While Rubio"], "uuid": "d8f3e3350ee065b2f6417ddada8d73eedadf0643", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/rubio%20obama%20juntos.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/19/while-rubio-continues-to-be-compared-to-obama-two-carved-different-paths-in/", "country": "", "title": "While Rubio continues to be compared to Obama, the two carved different paths in Senate | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "While Rubio continues to be compared to Obama, the two carved different paths in Senate | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-20T00:15:00.000+03:00", "replies_count": 0, "uuid": "d8f3e3350ee065b2f6417ddada8d73eedadf0643"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/19/while-rubio-continues-to-be-compared-to-obama-two-carved-different-paths-in/", "ord_in_thread": 0, "title": "While Rubio continues to be compared to Obama, the two carved different paths in Senate | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama", "Rubio"], "text": "While Rubio continues to be compared to Obama, the two carved different paths in Senate Published June 19, 2015 Fox News Latino \nCharismatic. Young. A glass-ceiling-breaker. An engaging public speaker. \nThose are the modifiers political observers like to use when describing presidential hopeful Sen. Marco Rubio, who’s done well so far in polls of likely GOP voters. \nThey were also modifiers used to describe Barack Obama when he, too, was a junior U.S. senator who was not as well known nationally as others running for president in 2008, but who wowed and intrigued enough Americans to beat Hillary Clinton in the Democratic primaries, and then win the presidency that November. \nBut the comparison to Obama, while meant as a compliment by many who make it, is seen as potentially inimical to Rubio. \nFor those Rubio’s detractors, among them some of his presidential election rivals, are saying that those similarities between him and Obama – whose lack of national legislative experience, they argue, partly explains his deficiencies as U.S. leader – are precisely why the junior senator from Florida would make a poor choice for the Oval Office. \n“He’ll have to offer more than one really great speech, because voters are looking for more than inspiration,” Politico quoted an Iowa Republican who is part of a bipartisan panel of top operatives, activists and political hands in Iowa and New Hampshire the publication assembled to provide weekly assessments on the presidential candidates and election issues. “We’ve had plenty of that with Obama. Voters are looking for accomplishment and experience as well.” \nPolitico did not identify the Iowa Republican, noting that part of an agreement with members of the panel called for granting anonymity so that they would speak without inhibition. \n“Every election selects the candidate that corrects the perceived deficiencies of the current occupant of the White House,” a New Hampshire Republican was quoted as saying to Politico. “After 7 years of an eloquent, one term senator — the GOP is going to look for something different.” \nTo be sure, other freshman congressional lawmakers, such as Senators Ted Cruz, a Texas Republican, and Rand Paul, a Kentucky Republican, also face comments about their limited experience in Congress. But Rubio, so far at least, has been deemed one of the biggest threats to Democratic presidential contender Hillary Clinton as well as to those in his party seeking to be the GOP nominee in the 2016 election. \n“I am waiting for Republicans to explain why this absolutely valid critique of Obama does not apply,” a New Hampshire Republican said to Politico of the frequent references in 2008 to Obama’s limited experience in the Senate to argue that he was not prepared to be president. \nAnother panel member described as an Iowa Republican said “We can’t out-Obama Obama. There is only one shot for a flash in the pan candidate like that. And by the way, it hasn’t turned out so well.” \nStill, there are weak points in the comparisons between Obama and Rubio that Rubio himself emphasizes. \nRubio’s time in the Senate has been marked by substantive roles having to do with some of the most burning issues of the day. \nHe was a central figure in the bipartisan Senate comprehensive immigration reform bill that passed in 2013, but then stalled in the House of Representatives. Not only did Rubio play a pivotal role in the drafting of the measure, he became, essentially, the face of the bill on television news shows, defending particularly the part that called for giving undocumented immigrants a path to legal status. \nAlso, Rubio has emerged as among the most hawkish members of Congress on foreign policy. \nHe is on the Senate Foreign Relations Committee and, again, has played an active and quite high-profile role on it. \n“Rubio’s relative lack of federal experience is fair game for his rivals, but he had significantly more state legislative experience than Obama,” an Iowa Republican said, according to Politico. \n“The only way the experience question hurts him is if he comes across as inexperienced. So far, that hasn’t been an issue.” \nLike us on Facebook ", "external_links": [], "published": "2015-06-20T00:15:00.000+03:00", "crawled": "2015-06-20T00:15:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}