{"organizations": [], "uuid": "bbcba3aba75761f960d5721a6941f37efaa350db", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3079804/images/o-LET-GIRLS-LEARN-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/england/feed", "section_title": "England on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/16/let-girls-learn-initiative_n_7596386.html", "country": "US", "title": "Michelle Obama Promotes Education Initiative For Young Girls Around The World", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Michelle Obama Promotes Education Initiative For Young Girls Around The World", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T17:42:00.000+03:00", "replies_count": 0, "uuid": "bbcba3aba75761f960d5721a6941f37efaa350db"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/16/let-girls-learn-initiative_n_7596386.html", "ord_in_thread": 0, "title": "Michelle Obama Promotes Education Initiative For Young Girls Around The World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Michelle Obama Promotes Education Initiative For Young Girls Around The World Posted: reddit \nHundreds of students greeted first lady Michelle Obama with applause, cheers and singing when she stopped by the Mulberry School for Girls in East London on Tuesday as part of her efforts to promote her Let Girls Learn initiative. \nStudents waved American and British flags, according to a White House pool report, as Obama entered the school to announce a $200 million collaboration between the U.S. and the U.K. to advance education for adolescent girls around the world, especially in countries in the midst of crisis and conflict. \nThe money will be invested in programs that attempt to remove obstacles -- such as school fees, access to transportation, early marriage, pregnancy and family obligations -- that prevent 62 million girls around the world from going to school, according to a White House press release. \nIn her speech, the first lady touted the crowd of high-achieving female students, 70 percent of whom receive free lunch , as an inspiration and an example of how support and education can unlock the potential in women. \n\"I see a roomful of business leaders and surgeons and barristers. I see women who are going to win elections, and science competitions, and arts awards. I see leaders who will inspire folks not just here in Tower Hamlets, but all across the country and all around the world,\" she said to the girls. \nObama also likened her own upbringing, as an African-American girl from a working-class family who grew up on the South Side of Chicago and worked hard to get an education, to that of predominantly Muslim and Bangladeshi girls who attend the school. In an impassioned voice, she continued to underline the importance of education. \n\"[I] have seen it again and again and again that what our parents told us really is true -- that if we get our education, we can do anything. We can lift up ourselves to heights we could never imagine,\" she said. \"We can pay forward all of the love and support that our families have poured into us.\" \nEducation has been one of Obama's pillars as first lady. Since 2010, she's been working to fight childhood obesity by promoting healthy eating and exercise in schools for children through her Let's Move campaign. In 2014 she launched the Reach Higher initiative, which aims to push young people from disadvantaged backgrounds to go beyond high school and enter college or professional training. More:", "external_links": [], "published": "2015-06-16T17:42:00.000+03:00", "crawled": "2015-06-16T22:18:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}