{"organizations": [], "uuid": "2a91836dbb34140534d929e3ca3d32ae242b7bca", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/06/16/what-republicans-are-missing-when-look-at-obamas-immigration-plans/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1434466743792.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/us/immigration/index.html", "section_title": "Immigration | U.S. | Fox News ", "url": "http://www.foxnews.com/opinion/2015/06/16/what-republicans-are-missing-when-look-at-obamas-immigration-plans.html", "country": "US", "title": "Immigration: Conservatives, you've been conned by Obama's immigration actions", "performance_score": 0, "site": "foxnews.com", "participants_count": 21, "title_full": "Immigration: Conservatives, you've been conned by Obama's immigration actions | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T03:00:00.000+03:00", "replies_count": 27, "uuid": "a90e66fc60ea6b2a7419f09a4c70cd467b943858"}, "author": "Ruben Navarrette", "url": "http://www.foxnews.com/opinion/2015/06/16/what-republicans-are-missing-when-look-at-obamas-immigration-plans.html#post-0", "ord_in_thread": 0, "title": "Immigration: Conservatives, you've been conned by Obama's immigration actions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Ruben Navarrette\nPublished June 16, 2015 Facebook 0 Twitter 0 livefyre Email Print FILE - November 21, 2014: President Obama signs two Presidential Memoranda associated with his Executive Actions on immigration from his office on Air Force One upon his arrival in Las Vegas Nevada. (Reuters)\nWhen the conversation shifts to immigration, conservatives can be awfully foolish, gullible and hardheaded.\nAll three traits are in evidence in how folks on the right are reacting to a recent ruling by a three judge panel of the Fifth Circuit Court of Appeals upholding U.S. District Judge Andrew Hanen’s injunction against President Obama’s execution action on immigration.\nJudging from what’s being said on talk radio and cable television shows, many conservatives don’t seem to understand what happened here, what it means, and how they should respond.\nSome of them think they’ve won a major battle. The truth is, they’ve lost the war.\nObama got out of a tough scrape by proposing an executive solution to the country’s immigration mess that he knew would fail and letting the judiciary take the heat while he got praised for his leadership on a difficult issue without taking the lumps that come from actually leading. It was a first-class political maneuver.\nRepublicans, you’ve been hustled. The White House set a trap, and you charged right in.\nIt’s similar to what happened back in 2006 and 2007, when Democratic Senate Harry Reid, the master politician, discreetly killed bipartisan immigration reform bills while making it appear as if Republicans were to blame. Reid was doing the bidding of Democratic Party benefactors in organized labor, which is full of blue-collar workers who don’t want to compete with newly-legalized immigrants who have a stronger work ethic.\nNow, it has happened again. Obama took a page from Reid’s playbook, and ran a similar game on you with executive action.\nAs I walk through the hubbub over Obama’s executive action — or as I call it “The Big Con” — keep in mind four things.\nFirst, if you think you have problems reconciling the two factions of the Republican Party — big business which wants more immigrants and nativists who want fewer — Democrats have to keep the peace between two competing constituencies. They have to please both organized labor which — despite phony proclamations by its leaders — actually oppose legalizing the undocumented and Latinos, most of whom support it. Bridging that divide will take a little finesse, and a lot of dishonesty\nSecond, the courts have not settled the question of whether Obama exceeded his authority in allowing some undocumented immigrants (i.e., the parents of U.S.-born children) to apply for three-year deferred status so they couldn't be deported. The lower court hung its injunction on the fact that states might have to provide services if Obama’s executive action went into effect; and the fact that the White House failed to comply with the Administrative Procedure Act of 1946, which calls for public notice. Are we to believe that all the smart lawyers at the White House Counsel’s Office and Justice Department skipped that day in law school? Here’s a more plausible idea: This executive action was supposed to fail.\nThird, for those conservatives who insist that Obama will stop at nothing in his attempts to push temporary deferred action (which the right incorrectly calls, “unlawful executive amnesty”), perhaps they can explain why the administration has stopped pushing. The Justice Department have announced that it will not ask the Supreme Court for permission to carry out the president’s deferred action. Administration officials claim that their decision to give up reflects an undeniable reality, insisting that the undocumented immigrants who would apply for the program would be scared off by continued legal wrangling. That’s absurd. Meanwhile, a fight over presidential authority continues in the lower courts. But that question won’t be resolved for year or two, officials said, meaning that Obama is off the hook for the rest of his term.\nFourth, even though the courts said that the size of the impacted group was part of the problem — with as many as 5 million undocumented immigrants eligible for deferred action — Hillary Clinton, the likely 2016 Democratic presidential candidate, has said that she thought Obama didn’t go far enough. She promised that, if elected, she would take executive measures that spared from deportation even more immigrants. Why repeat this gesture and expand it? Simple. Because it worked for Obama, allowing him to sidestep warring factions of the Democratic Party and get praised for making the effort without having to suffer the blowback that he would have experienced if successful. Of course, Democrats will repeat this stunt.\nWhat just happened? Obama got out of a tough scrape by proposing an executive solution to the country’s immigration mess that he knew would fail and letting the judiciary take the heat while he got praised for his leadership on a difficult issue without taking the lumps that come from actually leading. It was a first-class political maneuver.\nAs for the Republicans, well, they don’t know what hit them — which all but ensures that they’ll be hit again and again.\nRuben Navarrette is a columnist for the Daily Beast. He also writes a nationally syndicated column for the Washington Post Writers Group. He is author of \" A Darker Shade of Crimson: Odyssey of a Harvard Chicano \" (Bantam 1994).\n+ Follow FoxNewsOpinion on Facebook\nADVERTISEMENT\nTRENDING IN OPINION 1 Southern Baptists: Supreme Court is not final authority on gay marriage 2 Immigration: Conservatives, you've been conned by Obama's immigration actions 3 Why Rachel Dolezal's assertion that she is black could pave way for folks choosing a 'racial identity' 4 Donald Trump for president? The 2016 race just got fun 5 Make no mistake, Iran will acquire nuclear weapons. Soon. See all Trends Opinion Newsletter Don't miss a minute of opinion. Sign up for our newsletter now\nYour subscription has been submitted. American Innovation More →\nWaffle House partners with crowdsourced shipping app Roadie Wearable technology may improve sleep, endurance and chronic pain How IBM's Watson supercomputer is battling cancer with advanced genomics Advertisement", "external_links": ["https://platform.twitter.com/widgets/follow_button.1389999802.html#_=1390944151618&id=twitter-widget-0&lang=en&screen_name=fxnopinion&show_count=false&show_screen_name=true&size=m", "http://www.amazon.com/exec/obidos/ASIN/0553374273", "https://www.facebook.com/FoxNewsOpinion", "http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffxnopinion&width&layout=button_count&action=like&show_faces=true&share=false&height=21"], "published": "2015-06-16T03:00:00.000+03:00", "crawled": "2015-06-17T00:09:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}