{"organizations": [], "uuid": "506a5cab5ed8ae6c6797973f8427006e62317221", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/ryanpaul_061015gn.jpg", "site_section": "http://thehill.com/taxonomy/term/25211/feed#", "section_title": "The Hill: Finance Video", "url": "http://thehill.com/policy/finance/244619-gop-obama-on-cusp-of-fast-track-trade-victory", "country": "US", "title": "GOP, Obama on cusp of fast-track trade victory", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP, Obama on cusp of fast-track trade victory", "spam_score": 0.0, "site_type": "news", "published": "2015-06-11T02:16:00.000+03:00", "replies_count": 0, "uuid": "506a5cab5ed8ae6c6797973f8427006e62317221"}, "author": "iswanson@thehill.com (Scott Wong and Peter Schroeder)", "url": "http://thehill.com/policy/finance/244619-gop-obama-on-cusp-of-fast-track-trade-victory", "ord_in_thread": 0, "title": "GOP, Obama on cusp of fast-track trade victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP, Obama on cusp of fast-track trade victory By Scott Wong and Peter Schroeder - 06/10/15 07:16 PM EDT \nHouse Republicans have set the stage for a high-stakes vote Friday to grant President Obama fast-track trade authority. \nWhile objections from some Democrats on a last-minute deal related to the trade package raised some doubts about the outcome, Obama and the GOP appear poised to earn a significant victory. ADVERTISEMENT “We’re moving because we feel comfortable moving,” said Ways and Means Committee Chairman Paul Ryan (R-Wis.), who has led efforts to secure GOP votes for the measure.\nLess than a month ago, Obama’s hopes of securing fast-track powers were in peril after Senate Democrats blocked an \neffort to take up the legislation. The temporary setback in the Senate, which is generally more trade friendly, raised doubts over whether Obama would get a victory on his top legislative target. \nFast-forward to Wednesday, and things look completely different. \nOnly 30 House Republicans are “no” votes or leaning against the package, according to The Hill’s Whip List, while Reps. Steve King (Iowa), Joe Barton (Texas) and Trent Franks (Ariz.), who frequently defy leadership, recently announced they will vote in favor. \nNineteen Democrats have said they are “yes” votes or are leaning toward backing the package after a furious White House lobbying campaign. \nIf the vote on Friday is successful, the trade bill would head to Obama’s desk, weeks before many thought possible. Fast-track powers would greatly enhance the president’s ability to conclude negotiations on a sweeping trade deal with Pacific Rim nations that is a key part of his economic and foreign policy agenda. They would prevent Congress from amending the trade deal, and stop the Senate from filibustering it. \nOpponents of fast-track are far from throwing in the towel, however. \nLabor unions and other progressive groups have warned Democrats they’ll lose support from the left if they back the trade package, which they argue will cost the nation jobs. \n“Our members knocked on doors for you. They donated to you,” said Ben Wikler, Washington director for MoveOn. “They are watching this vote, and they will not forget how you vote on fast-track.” \nHouse Democrats opposed to the measure rallied on the Capitol’s steps, arguing a last-minute deal between Speaker John Boehner (R-Ohio) and Minority Leader Nancy Pelosi (D-Calif.) was full of holes. \nOn the right, the conservative group Heritage Action for America urged lawmakers to oppose the measure over concerns the House could vote separately to approve the reauthorization of the Export-Import Bank. It said it would negatively score votes in favor of the fast-track measure absent “iron-clad commitments” from GOP leaders that the bank will not be reauthorized. \nThe Boehner-Pelosi deal replaces proposed cuts to Medicare that were set aside to pay for Trade Adjustment Assistance, a program favored by Democrats that offers help to workers displaced by trade. The TAA bill is a key part of the broader fast-track package. \nDemocrats complained the deal wasn’t good enough because GOP leaders plan to attach the fix to a separate trade “preferences” bill instead of the TAA measure. Because the bill granting trade preferences to African countries is not considered must-pass legislation, that means there is “no guarantee of enactment,” said a source in the meeting. \nBoehner and Republicans don’t want the Medicare fix attached to either fast-track or TAA, because this would force the Senate to take another vote on the measure. \nThe arrangement was enough to push Pelosi off the fence; her remarks at Wednesday’s closed-door Democratic caucus meeting left her members convinced she’ll vote “no.” \n“She has decided this [procedural] issue is of sufficient gravity to justify a no vote and seemed to be urging Democrats to do the same,” said Rep. Gerry Connolly (D-Va.). \nA spokesman for Pelosi said her focus this week has been to improve the offsets and process through which the trade assistance can pass. \nThe new concerns from Democrats sparked a flurry of activity on Capitol Hill Wednesday afternoon. Top Obama administration officials paid a visit to Pelosi that same day; among them were White House chief of staff Denis McDonough, U.S. Trade Representative Michael Froman, Labor Secretary Tom Perez and National Economic Council Director Jeff Zients. \nLater, Pelosi and Boehner huddled for 20 minutes in the Speaker’s office to negotiate an alternative procedure for the TAA offsets. But they didn’t reach a new agreement, and Pelosi returned to her office to brief her Democratic leadership team. \nConnolly, one of a handful of pro-trade Democrats who traveled with Obama to Germany last weekend, said he was taking seriously fresh threats by fellow Democrats to derail the trade package. \nBut he said the Medicare fix was “acceptable” to him and that he wouldn’t change his vote in favor — and he didn’t believe any of the other Democratic supporters would flip their vote either. \n“Having gone this far, and paid a price for it, retreating from that position probably causes you more grief than staying with it,” Connolly said. \nThe White House also sounded an optimistic tone — though it was a bit muted. \nWhite House press secretary Josh Earnest expressed confidence there would be a “bipartisan majority” behind the bill. \n“Outbreaks of bipartisanship in the House of Representatives in the last couple of years have not been common, so that’s why I would not characterize it as a slam dunk,” he said. \nRepublicans suggested the last-minute complaints would not derail the bill — and that if they were a problem, it would be on Obama. \n“We’ve gone out of our way to substantively address Democrats’ concerns with a TAA bill they support. It would be an incredible embarrassment to the president if his party manufactures an excuse to oppose it,” Boehner spokesman Kevin Smith said. \nAfter huddling with rank-and-file Republicans, the Speaker told reporters the last-ditch process complaints were an effort to find any reason possible to vote against the bill. \n“If people are looking for an excuse to vote no,” he said, “I guess they can always find an excuse to vote no.” \nJordan Fabian contributed.", "external_links": [], "published": "2015-06-11T02:16:00.000+03:00", "crawled": "2015-06-11T19:05:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}