{"organizations": [], "uuid": "9e0b0f22ac47cc0d71fbd04fbe34876a8fc0050c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/isis_3.jpg", "site_section": "http://www.breakingnews.com/feeds/rss", "section_title": "Breaking News - breakingnews.com", "url": "http://thehill.com/policy/defense/245312-house-rejects-withdrawal-from-isis-war", "country": "US", "title": "House rejects resolution requiring President Obama to remove troops in Islamic State fight - @thehill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House rejects resolution requiring President Obama to remove troops in Islamic State fight - @thehill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T00:11:00.000+03:00", "replies_count": 0, "uuid": "9e0b0f22ac47cc0d71fbd04fbe34876a8fc0050c"}, "author": "Stephanie Clary", "url": "http://thehill.com/policy/defense/245312-house-rejects-withdrawal-from-isis-war", "ord_in_thread": 0, "title": "House rejects resolution requiring President Obama to remove troops in Islamic State fight - @thehill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House rejects withdrawal from ISIS war By Cristina Marcos and Kristina Wong - 06/17/15 04:17 PM EDT \nThe House voted resoundingly Wednesday to keep troops stationed abroad fighting the Islamic State of Iraq and Syria (ISIS) despite the absence of a formal congressional authorization for military action against the group. \nIn the first vote of its kind since the Obama administration began airstrikes ten months ago, the House defeated a resolution requiring the president to remove troops within the next six months. The vote was 139-288. ADVERTISEMENT Nineteen Republicans and 120 Democrats voted for the measure. Rep. Justin Amash (R-Mich.) voted \"present.\"\nRep. Jim McGovern’s (D-Mass.) resolution would require removal of troops in Iraq and Syria within 30 days. But the deadline could be have been pushed to the end of 2015 if the Obama administration determined it would not be safe to do so in a shorter timeframe. \nThe vote did not split along the usual party lines. A majority of Democrats and Republicans opposed the measure, while a smaller bipartisan coalition joined together in voting for it. \nMcGovern, who authored the measure with Reps. Walter Jones (R-N.C.) and Barbara Lee (D-Calif.), said the United States shouldn’t keep deploying troops into harm’s way unless Congress formally authorizes war against ISIS. \n“Either Congress needs to live up to its responsibilities and authorize this war, or by its continuing neglect and indifference our troops should be withdrawn and allowed to come home,” McGovern said. \nThe Obama administration has been citing the 2001 and 2002 authorizations of military force (AUMF) in Afghanistan and Iraq as the legal basis for the military campaign against ISIS. \nEven Rep. Eliot Engel (D-N.Y.), the top Democrat on the House Foreign Affairs Committee who opposed the resolution, said the use of powers approved before ISIS even existed “sets a terrible precedent.” \n“We didn’t vote for perpetual war, and we need a new AUMF,” Engel said. \nBut Engel said that voting to withdraw troops amid the escalating violence would send the wrong message. \n“That’s no way to defeat ISIS or to help the people of Iraq and Syria,” Engel said. \"I understand the frustration but this is like cutting off your nose to spite your face.\" \nHouse Foreign Affairs Committee Chairman Ed Royce (R-Calif.) warned that voting to withdraw American troops would embolden the extremist group. \n“The resolution before us today has nothing to do with an authorization for the use of military force. It is a withdrawal resolution,” Royce said. “That would be irresponsible and dangerous.” \nThe Obama administration began ordering troops to Iraq almost exactly one year ago, on June 16. It ordered 275 troops to provide security for the U.S. Embassy and personnel there. \nThe number of troops grew to 3,550 after Obama authorized another 450 troops last week. The troops are being deployed to train and equip the Iraqi military against ISIS. \nMcGovern's measure also would have stopped manned U.S. airstrikes in Iraq and Syria, which began last August. There are no troops in Syria, although the administration acknowledges it has some responsibility to protect rebels fighting ISIS and the regime there. \nWhile Wednesday’s vote was Congress' first on war authorization for ISIS, the House has taken other votes related to the military campaign. \nThe chamber voted last week to defeat an amendment to a defense appropriations bill that would have prohibited funding for the campaign against ISIS after March 2016 unless Congress formally authorizes it on a vote of 196-231. \nCongress voted to authorize a $500 million train and equip program of moderate Syrian rebels last September. \nLawmakers first suggested they would take up an authorization of military force when they returned from the midterm campaign trail. But Speaker John Boehner (R-Ohio) said that voting on war shouldn’t be in the hands of a lame-duck Congress and also called on the White House to submit an AUMF to Congress. \nThe draft AUMF President Obama sent to Congress in February has since stalled. Many Democrats think it is too open-ended, while Republicans view it as too constraining. \nWhile a majority voted against the measure, Republicans said they supported having a debate on the use of force. \n\"I think we ought to have a real AUMF debate. This is not it,\" said House Armed Services Committee Chairman Mac Thornberry (R-Texas).", "external_links": [], "published": "2015-06-18T00:11:00.000+03:00", "crawled": "2015-06-18T00:19:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}