{"organizations": [], "uuid": "3eb8596abe28a589e905cd47c333dfa0017eff42", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/immigrationactivism_getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1775/feed", "section_title": "The Hill: Juan Williams", "url": "http://thehill.com/opinion/juan-williams/244202-juan-williams-gop-needs-a-new-script-on-immigration", "country": "US", "title": "Juan Williams: GOP needs a new script on immigration", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Juan Williams: GOP needs a new script on immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T13:00:00.000+03:00", "replies_count": 0, "uuid": "3eb8596abe28a589e905cd47c333dfa0017eff42"}, "author": "nstanage@thehill.com (Juan Williams)", "url": "http://thehill.com/opinion/juan-williams/244202-juan-williams-gop-needs-a-new-script-on-immigration", "ord_in_thread": 0, "title": "Juan Williams: GOP needs a new script on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Juan Williams: GOP needs a new script on immigration Getty Images By Juan Williams - 06/08/15 06:00 AM EDT \nThe politics of immigration reform is kryptonite to the current Republican majority in Congress. Now the playing field is shifting to 2016 presidential politics. \nWith 18 months of Republican control of Congress remaining, Speaker John Boehner (R-Ohio) and Senate Majority Leader Mitch McConnell (R-Ky.) could do their party a big favor by lining up the votes to pass an immigration reform package. That would change the campaign dynamic by allowing Republicans to take credit for ending the gridlock and making immigration reform a reality. ADVERTISEMENT Let’s remember that McConnell, as he was becoming majority leader, pledged that the “single best thing” his GOP majority Senate could achieve is “not [to] mess up the playing field…for whoever the nominee ultimately is.”\nRight now, that means passing immigration reform. The Senate's bipartisan proposal, passed in 2013, has died on the vine under attack from talk radio and amid a lack of interest from the hard-right, anti-immigration caucus in the House. \nBut Congressional Republicans need to take a new look at the political calculation surrounding immigration. \nFirst, the Republican obsession with border security looks more and more untethered from reality. \nThere is no rush of Mexicans coming across the southern border, according to the Pew Research Center. In April 2012, Pew reported that more Mexicans may be leaving the U.S. than entering for the first time in decades. Arrests of people trying to enter illegally over the first half of this fiscal year are 28 percent lower than they were during the corresponding period last year, according to the Department of Homeland Security. \nGerald Seib, writing in The Wall Street Journal last month, pointed out how the central facts of the debate have changed. He explained that “the premise of the immigration debate – that waves of Hispanic immigrants are sweeping across the southern border, swelling the nation’s population of undocumented immigrants and transforming the culture and economy – is caught in a kind of time warp… [I]n 2013, China replaced Mexico as the top country sending immigrants to the U.S., according to a new Census Bureau study.” \nThe Chinese, as well as increasing numbers of immigrants from countries such as India, South Korea, Japan and the Philippines, do not run across any border. They come legally on boats and planes, and then some of them overstay visas. They are better educated than past immigrants from Latin countries. Again, the shape of the problem has dramatically changed. \nThat being so, McConnell and Boehner could enlist their caucus to find common ground with GOP-leaning business leaders who want the U.S. economy to benefit from the vitality of the world’s top brains and industrious people who want to work. \nSecond, the House has reason to act because the polling is clear that voters want immigration reform. \nA CBS/ New York Times poll last month reported lop-sided numbers, with 29 percent wanting illegal immigrants to be forced out of the United States but nearly double that figure — 58 percent — in favor of letting illegal immigrants stay in the country and apply for citizenship. \nWhit Ayres, the top pollster for the presidential campaign of Sen. Marco Rubio (R-Fla.), told a Christian Science Monitor breakfast discussion in March: “A Republican nominee is going to need to be somewhere in the mid-forties, or better, among Hispanic voters.” \nThat is a long way from the 27 percent of the Hispanic vote that went to 2012 Republican nominee Mitt Romney, an advocate of \"self-deportation.\" \nFinally, it is obvious that the status quo on immigration favors Democrats in 2016. They are politically united and have public opinion on their side. \nHillary Clinton, the clear leader among Democrats seeking the nomination, is already reinforcing her dominance on the issue. She announced last month that if she is elected she will go beyond President Obama’s plan and offer full citizenship to longtime U.S. residents who entered illegally. \nOn the campaign trail, the often harsh anti-immigrant rhetoric from Republicans is driving away Latino voters, who are growing in number. This dynamic is killing any chance for the eventual GOP nominee to win Latino votes in states such as Florida, Colorado, Nevada, North Carolina and Virginia, all of which are vital for any Republican hoping to win the White House. \nRepublicans on the campaign trail need a new script. The tired, outdated debate from Congressional Republicans has them locked in a circular firing squad. \nThe best of the Republican contenders on immigration are two Floridians — former Gov. Jeb Bush and Rubio. \nBush has floated the idea of increased visas for skilled immigrants. Rubio helped to write the comprehensive Senate package, which would have opened the door to legal status for the 11 million illegal immigrants already in the country and provided a huge increase in spending on border security. \nRubio has backed away from his bill, even though it won the votes of 14 Senate Republicans as it passed 68-32. Among those supporting the Senate bill were the two Republican senators from the border state of Arizona, Sens. Jeff Flake and John McCain, as well as Sen. Lindsey Graham (S.C.), now a fellow contender for the GOP nomination. But Rubio these days dismisses the bipartisan success of the Senate bill. \nWhat good is having control of both Houses of Congress if Republicans can’t even help themselves by setting the terms of debate for the presidential campaign? Juan Williams is an author and political analyst for Fox News Channel. Tags:", "external_links": [], "published": "2015-06-08T13:00:00.000+03:00", "crawled": "2015-06-08T16:51:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}