{"organizations": ["Legislative Hall", "St. Anthony of Padua Roman Catholic Church", "St. Anthony of Padua", "St Anthony of Padua Roman Catholic Church", "St. Anthony of Padua Catholic Church"], "uuid": "1fc550d3c266d747e25d319e2f9a3f12e49f508f", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/06/politics/obama-biden-bond-beau-biden-funeral/index.html", "country": "", "title": "Obama and Biden share bond beyond politics - CNNPolitics.com", "performance_score": 5, "site": "cnn.com", "participants_count": 0, "title_full": "Obama and Biden share bond beyond politics - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-07T07:11:00.000+03:00", "replies_count": 0, "uuid": "1fc550d3c266d747e25d319e2f9a3f12e49f508f"}, "author": "", "url": "http://www.cnn.com/2015/06/06/politics/obama-biden-bond-beau-biden-funeral/index.html", "ord_in_thread": 0, "title": "Obama and Biden share bond beyond politics - CNNPolitics.com", "locations": ["Delaware", "Wilmington", "Dover", "St. Anthony of Padua"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hunter", "Joe Biden", "Barack Obama", "Hallie Biden", "Hallie", "Joe", "Obama", "Jill", "Jill Biden", "Natalie Biden", "Beau Biden", "Chris Martin", "Coldplay", "Biden", "Natalie"], "text": "Wilmington, Delaware (CNN) The kiss, at the end, said it all. While delivering a moving lament for Beau Biden on Saturday, President Barack Obama offered a remarkable statement of love and gratitude for another man: the father of Delaware's favorite son and his own vice president, Joe Biden, whose life is again stricken by personal tragedy. Beau Biden mourned 17 photos Beau Biden mourned 17 photos Mourners exit St. Anthony of Padua Catholic Church after a Mass of Christian burial was held for former Delaware Attorney General Beau Biden on Saturday, June 6, in Wilmington. Biden, Vice President Joe Biden's eldest son, died at the age of 46 after a battle with brain cancer. Hide Caption 1 of 17 Beau Biden mourned 17 photos Vice President Joe Biden and his wife, Jill Biden, depart after the service on June 6. Hide Caption Beau Biden mourned 17 photos Chris Martin of Coldplay performs \"Til Kingdom Come\" during the funeral. Hide Caption 3 of 17 Beau Biden mourned 17 photos President Barack Obama hugs Joe Biden after delivering the eulogy on June 6. In his eulogy, Obama credited the vice president with inspiring in his son a devotion to public service and to family, jokingly calling him \"Joe 2.0.\" Hide Caption 4 of 17 Beau Biden mourned 17 photos President Barack Obama delivers the eulogy in honor of Beau Biden on June 6. The President struggled for composure at several points during his tribute. Hide Caption Beau Biden mourned 17 photos A procession carrying the casket of Beau Biden enters the church on June 6. Hide Caption 6 of 17 Beau Biden mourned 17 photos Vice President Joe Biden, accompanied by his family, holds his hand over his heart as he watches an honor guard carry a casket containing the remains of his son into St. Anthony of Padua Roman Catholic Church in Wilmington, on June 6. Standing alongside the vice president are Beau Biden's widow Hallie Biden, left, and daughter, Natalie. Hide Caption 7 of 17 Beau Biden mourned 17 photos Vice President Joe Biden and his wife Dr. Jill Biden arrive with family for the funeral on June 6. Hide Caption 8 of 17 Beau Biden mourned 17 photos An honor guard stands at the viewing for Beau Biden at St. Anthony of Padua in Wilmington, Delaware on Friday June 5. Hide Caption 9 of 17 Beau Biden mourned 17 photos Vice President Joe Biden and his wife, Jill, greet mourners during the viewing for Beau Biden inside St. Anthony of Padua in Wilmington, Delaware, on Friday, June 5. Hide Caption Beau Biden mourned 17 photos Mourners arrive for the viewing on June 5. Hide Caption 11 of 17 Beau Biden mourned 17 photos Vice President Joe Biden rests his head in his hand during a viewing for his late son, former Delaware Attorney General Beau Biden, on Thursday, June 4. Standing with the vice president, from right, is his wife, Jill, and Beau Biden's immediate family: daughter Natalie, wife Hallie and son Hunter. Hide Caption Beau Biden mourned 17 photos An honor guard carries Biden's casket out of Legislative Hall in Dover, Delaware. Hide Caption Beau Biden mourned 17 photos Joe Biden pauses with his family as they enter the visitation. Hide Caption 14 of 17 Beau Biden mourned 17 photos Natalie Biden, center, is comforted by her grandfather and her mother as they follow the honor guard carrying the casket. Hide Caption Beau Biden mourned 17 photos Biden hugs a woman while waiting in line to view his son's body. Hide Caption Beau Biden mourned 17 photos Biden rests his hand on the flag-draped casket. Hide Caption 17 of 17 EXPAND GALLERY Obama is known for emotional restraint and rarely wears his heart on his sleeve, but produced his most personal and heartfelt tribute yet for the man who shares his burden of power, just at the moment his friend needed it most. \"Joe, you are my brother. I'm grateful every day that you've got such a big heart and a big soul and those broad shoulders. I couldn't admire you more,\" Obama said, looking Biden squarely in the eye as he delivered a eulogy at a funeral mass in the St Anthony of Padua Roman Catholic Church in Wilmington, Delaware. RELATED: Obama delivers emotional eulogy for Beau Biden It was a rare glimpse into the personal relationship between a president and his deputy, who are locked in a constitutional embrace that throughout history has often proven to be fraught with tension. While the top two men in this administration get on well, the vice presidency still requires someone like Biden, with an outsize political ego and distinguished career of his own, to defer to his boss for a job that has few real powers or responsibilities. JUST WATCHED ", "external_links": [], "published": "2015-06-07T07:11:00.000+03:00", "crawled": "2015-06-07T07:11:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}