{"organizations": [], "uuid": "1431c248830ec1652bbe188c7cf76651f7ec3bc1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3062474/images/o-SUGAR-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/los-angeles/news.xml", "section_title": "Los Angeles News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/12/marijuana-flower-photos_n_7562532.html?utm_hp_ref=los-angeles&ir=Los+Angeles", "country": "US", "title": "Dazzling Macro Photographs Reveal The Unexpected Beauty Of Marijuana Buds", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Dazzling Macro Photographs Reveal The Unexpected Beauty Of Marijuana Buds", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T15:33:00.000+03:00", "replies_count": 0, "uuid": "1431c248830ec1652bbe188c7cf76651f7ec3bc1"}, "author": "Priscilla Frank", "url": "http://www.huffingtonpost.com/2015/06/12/marijuana-flower-photos_n_7562532.html?utm_hp_ref=los-angeles&ir=Los+Angeles", "ord_in_thread": 0, "title": "Dazzling Macro Photographs Reveal The Unexpected Beauty Of Marijuana Buds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nAlpha Blue \nT he most commonly cited effects of marijuana include heightened mood, a sense of relaxation and an increased appetite. Less commonly commended, however, are the aesthetic merits of the little green buds. From far away, they appear like unassuming shrubs, yet zoom in and the Cannabis plant transforms into an emerald-toned coral reef, covered in tiny crystals and microscopic furs. \nPhotographer Erik Christiansen captures the psychoactive herbage in all its glory with his captivating macro photographs of the hypnotic flowers. The collection is featured in Green: A Field Guide to Marijuana , a new treatise for the medical or recreational smoker from Chronicle Books. \nThe stoner encyclopedia contains stunning, close-up images of 170 marijuana strains, accompanied by descriptions of their lineage, smell, taste and effects. Billed as a \"visual guide for curious, sophisticated pot smokers,\" the book is targeted toward the new generation of legal weed users, bent on expanding the still-burgeoning economy at play. \nBlueberry Afgoo \nChristiansen was inspired to explore his photographic subject when he began smoking himself, and soon became frustrated by the grainy, low quality images available on the web. \" The photos out at the time didn’t really depict what I thought was the true essence of the bud, \" he explained to Slate. \nHe soon embarked on a process of bringing out the true beauty of each individual bud, taking between 25 and 40 macro shots of each plant from different perspectives, and then stacking them atop each other. To track down his models, Christiansen visited dispensaries in San Diego, Los Angeles, Northern California and Canada, capturing popular strains, one-of-a-kind blossoms, weed wax and other marijuana-infused goodies before his lens. \"It was kind of like a treasure hunt,\" he said. \nThe resulting images are hyper-detailed portraits of stunning subjects including Lambs Bread, Sugar Daddy and Black Cherry Soda. Whether you're a stoner, a photography nerd, or just a bit curious, we're sure just ogling the photos below will provide some sense of euphoria. \nBlack Cherry Soda", "external_links": [], "published": "2015-06-12T15:33:00.000+03:00", "crawled": "2015-06-12T16:06:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}