{"organizations": [], "uuid": "8c29572047169ee0fddb024acfcbe5de51be1ead", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/19/politics/bernie-sanders-immigration/index.html", "country": "", "title": "Sanders makes strongest immigration push yet as 2016 candidate - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Sanders makes strongest immigration push yet as 2016 candidate - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "8c29572047169ee0fddb024acfcbe5de51be1ead"}, "author": "", "url": "http://www.cnn.com/2015/06/19/politics/bernie-sanders-immigration/index.html", "ord_in_thread": 0, "title": "Sanders makes strongest immigration push yet as 2016 candidate - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Sanders makes strongest immigration push yet as 2016 candidate Updated 0339 GMT (1039 HKT) June 20, 2015 Bernie Sanders' political career 13 photos Democratic presidential candidate U.S. Sen. Bernie Sanders (I-VT) delivers remarks while officially announcing his candidacy for the U.S. presidency during an event at Waterfront Park May 26, 2015 in Burlington, Vermont. Hide Caption 1 of 13 Bernie Sanders' political career 13 photos Sanders participates in a \"Don't Trade Our Future\" march organized by the group Campaign for America's Future on April 20 in Washington. Click through for other photos from his career. Hide Caption 2 of 13 Bernie Sanders' political career 13 photos Sanders speaks to protesters taking part in the \"Don't Trade Our Future\" march on April 20. Hide Caption 3 of 13 Bernie Sanders' political career 13 photos Sanders speaks to low-wage federal contract workers during a protest where the workers demanded presidential action to win a wage increase to $15 an hour on December 4, 2014, in Washington. Hide Caption 4 of 13 Bernie Sanders' political career 13 photos Sanders, left, and Sen. Charles Grassley of Iowa arrive with other senators for a briefing at the U.S. Capitol on September 11, 2014, by military and intelligence officials for members of the U.S. Senate on the White House strategy to combat ISIS. Hide Caption 5 of 13 Bernie Sanders' political career 13 photos Sanders awaits the start of a hearing on the state of veterans' health care by the Senate Veterans Affairs Committee on September 9, 2014, in Washington. Hide Caption 6 of 13 Bernie Sanders' political career 13 photos On September 8, 2014, Sanders speaks outside the U.S. Capitol at a press conference where members of Congress discuss a joint resolution proposing a constitutional amendment relating to contributions and expenditures intended to affect elections. Hide Caption 7 of 13 Bernie Sanders' political career 13 photos Sanders addresses a rally in support of Social Security on March 28, 2011, on Capitol Hill. Hide Caption 8 of 13 Bernie Sanders' political career 13 photos Sanders speaks to reporters on Capitol Hill on December 7, 2010, about how the Obama administration is pushing for Congress to extend Bush-era tax cuts in a compromise with Republicans. Hide Caption 9 of 13 Bernie Sanders' political career 13 photos Sanders speaks at a news conference in Washington on September 30, 2009, to urge Congress to pass a $250 one-time cost of living adjustment payment to Social Security recipients in 2010. Hide Caption 10 of 13 Bernie Sanders' political career 13 photos Sanders speaks during a hearing on the economy before the Senate Budget Committee on Capitol Hill on March 3, 2009. Hide Caption 11 of 13 Bernie Sanders' political career 13 photos Rep. Elliot Engel, from left, then-Sen.Thomas Harkin and Sanders meet with local leader Kouadio Yao in Ivory Coast in January 2008 ahead of a July 2008 certification deadline to ensure cocoa heading to the United States has not been produced with child labor. Hide Caption 12 of 13 Bernie Sanders' political career 13 photos Incoming Sens. James Webb, from left, Sanders, and Amy Klobuchar meet with Senate Minority Leader Harry Reid on November 13, 2006, in Washington. Hide Caption 13 of 13 Las Vegas (CNN) Bernie Sanders joined Hillary Clinton on Friday in calling for expanded actions to allow the parents of undocumented immigrants brought into the U.S. as children to stay in the country. The comments by Sanders, who rarely speaks about immigration, essentially match a position made by Clinton last month and represent the Vermont senator's strongest words yet on the subject since he became a presidential candidate. \"Until we finally pass comprehensive reform -- and I would very much like to see the House of Representatives pick up where the Senate left off -- we must be aggressive in pursuing policies that are humane and sensible and that keep families together,\" Sanders said at a meeting of the National Association of Latino Elected Officials. \"I strongly support the administration's Deferred Action for Childhood Arrivals program. DACA is a good first step, but it should be expanded.\" JUST WATCHED ", "external_links": [], "published": "2015-06-20T03:00:00.000+03:00", "crawled": "2015-06-20T23:30:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}