{"organizations": [], "uuid": "c1b10298a43559e6e146a6c2ec77682f9301fb18", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/feeds/Associated%20Press/2015/06/28/0/0/Albania%20Cannabis%20Village-1.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/world/2015/06/28/albanian-police-arrest-2-more-suspects-in-policeman-killing-in-marijuana/", "country": "US", "title": "Albanian police arrest 2 more suspects in policeman's killing in marijuana-growing village", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Albanian police arrest 2 more suspects in policeman's killing in marijuana-growing village | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "c1b10298a43559e6e146a6c2ec77682f9301fb18"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2015/06/28/albanian-police-arrest-2-more-suspects-in-policeman-killing-in-marijuana/", "ord_in_thread": 0, "title": "Albanian police arrest 2 more suspects in policeman's killing in marijuana-growing village", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 28, 2015 Associated Press Email Print An Albanian police officer uses binoculars during an operation in Lazarat village, about 200 kilometers (125 miles) south of Tirana, Thursday, June 25, 2015. Hundreds of Albanian police officers were checking houses Thursday in a marijuana-growing village in southern Albania a day after gunmen fatally shot a policeman and wounded two others during a shootout. (AP Photo/Hektor Pustina) (The Associated Press)\nAlbanian police officers control the school building during their operation in Lazarat village, about 200 kilometers (125 miles) south of capital Tirana, Thursday, June 25, 2015. Hundreds of Albanian police arrested suspects and checked houses Thursday in a southern marijuana-growing village a day after gunmen fatally shot one policeman and wounded two others. (AP Photo/Hektor Pustina) (The Associated Press)\nAlbanian police officers patrol the scene in Lazarat village, about 200 kilometers (125 miles) south of capital Tirana, Friday, June 26, 2015. Hundreds of police deployed there have already arrested 14 persons and check the village, a major illegal marijuana-growing center, after gunmen fatally shot one policeman and wounded two others a day before. (AP Photo) (The Associated Press)\nPrevious Next TIRANA, Albania – Albanian police have arrested two suspects considered to be the leaders of the armed group that fatally shot one policeman and wounded two others this week.\nPolice spokesman Gentian Mullai on Sunday said two teenagers, brothers Arbjon and Alban Aliko, handed themselves over after 500 police isolated them Saturday evening at a former army mountain tunnel 10 kilometers (6 miles) from the marijuana-growing village of Lazarat. The village, 200 kilometers (125 miles) south of the capital, Tirana, is where the policeman was killed.\nSix people so far have been accused and detained in both the policeman's killing and for illegal weapons possession. Police say gunmen were organized to push away police from the village so locals could resume planting marijuana, a multibillion-dollar business in Lazarat.\nAdvertisement\nTrending in World 1 Parliament approves referendum as Greece's future hangs in the balance 2 More than 500 injured in massive fire at Taiwan water park party 3 Beach massacre gunman reportedly told Tunisians to flee during shooting 4 Day of terror: Islamist attacks around world follow ISIS' Ramadan message 5 Kuwait police arrest several people tied to deadly mosque bombing See all Trends Fox News Salutes More\nTaya Kyle enters the 'No Spin Zone' What makes me proud to be an American: The men and women of our uniformed services Congressional Gold Medal given to general who went on to White House up for sale Advertisement", "external_links": ["http://www.ap.org/"], "published": "2015-06-28T03:00:00.000+03:00", "crawled": "2015-06-28T12:00:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}