{"organizations": [], "uuid": "33c4f38cc578b7ebcdbe34d774a513bc030f203d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/cavuto_flynn_061015.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/transcript/2015/06/11/former-obama-defense-intelligence-agency-director-isis-is-winning/", "country": "US", "title": "Former Obama Defense Intelligence Agency director: ISIS is winning", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Former Obama Defense Intelligence Agency director: ISIS is winning | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "33c4f38cc578b7ebcdbe34d774a513bc030f203d"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/06/11/former-obama-defense-intelligence-agency-director-isis-is-winning/", "ord_in_thread": 0, "title": "Former Obama Defense Intelligence Agency director: ISIS is winning", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com Email Print\nThis is a rush transcript from \"Your World,\" June 10, 2015. This copy may not be in its final form and may be updated.\n(BEGIN VIDEO CLIP)\nLT. GEN. MICHAEL FLYNN (RET.), FORMER DIRECTOR, DEFENSE INTELLIGENCE AGENCY: I mean, I just -- I was -- I was stunned by his comments two days ago, or three days ago, stunned.\n(END VIDEO CLIP)\nNEIL CAVUTO, HOST: All right. No, that is not just another politician blasting the president for saying that we don't have a complete strategy to fight ISIS. This guy used to work for the president as his top spy chief.\nSo, now that the White House is sending another 450 so-called advisers over there, is that enough to satisfy General Michael Flynn now?\nWe're honored to have him.\nGeneral, thank you for joining us.\nFLYNN: Thanks, Neil. Thanks for the invite.\nCAVUTO: Those 450, whatever we're calling them, I have used the word advisers, is that an accurate description, General, to the best of your knowledge?\nFLYNN: Yes, to the best of my knowledge, it is, Neil.\nBut, I mean, I think what we have to do is, we have to step back and take a look at the -- at really what is it that we're trying to accomplish in the Middle East? I mean, this trickle effect of sort of strategic drips, if you will, just doesn't appear to be working.\nAnd, as I said earlier in some testimony I made today, I was a bit surprised at the president's statements, you know, and waiting on the Pentagon for a plan is not where it should begin. Where it needs to begin is, it needs to begin at the White House.\nAnd the White House needs to really state a very clear policy, strategic policy that has a long-term framework that can get us to a place where we can at least create conditions for stability.\nI think that this addition of more -- more troops out into the Middle East is just -- it -- again, it's sort of a -- it's sort of a drip effect of strategy, rather than actually having a long, clear policy objective we need to achieve.\nCAVUTO: You know, as you know better than anyone, ISIS has now control of a third of Iraq, virtually half of Syria, a huge chunk of Libya. I could go on and on.\nBut you said that all roads lead back to Iran right now. You said that Iran has every intention to build a nuclear weapon. They have stated many times they have attempted well over a decade to move rapidly to nuclearizing its capability and their enrichment to 20 percent in their rapid move to develop a ballistic missile program.\nDo you think then, General, our strategy or our couching what we're going to do about ISIS is in no small order couched to not disrupt Iran or this deal that presumably is in the works with Iran? What do you think?\nFLYNN: Well, what I think and what I believe and what I know, at least in some of the conversations that I have had with some very close friends out in the region, is that they're actually more concerned about Iranian hegemonic behavior and basically taking over large chunks of the Middle East than they are about the nuclear -- the potential that Iran might build a nuclear weapon anytime in the next decade.\nI mean, this is a real threat to many of our friends and partners in the region, especially Israel. I really just think that we need to take a big step back. And I do think that the president needs to take a harder look at not just the military component.\nEverybody has sort of locked into that as the -- as that's the nirvana, that's going to be what actually accomplishes the mission. It is much bigger than that, Neil. And we need to bring in some of these other Gulf Arab nations out there, Egypt, Kuwait, clearly the Saudis.\nI mean, I was really -- I was disheartened by this latest GCC summit, which was essentially a leaderless summit. You don't bring Arabs together, my experience, unless the deal is already cut and you have something that you're ready to come forward with.\nAnd I think what they want is, they want to know that they can trust the United States over the long haul. I do believe, I very strongly believe that the Arab nations would be willing to put together an Arab NATO-like structure. And I think that the Arabs would be willing to lead it, but they need to know that the U.S. is right there with them, not necessarily with the proverbial boots on the ground, but at least in other ways that we can support them through other means.\nAnd I think that's the direction, that's part of the direction that we need to go. I'm really -- you know, this business about another 400 troops out there, you know, those troops are probably just finding out, you know, who they're going to be here right now, and I'm not sure that they're going to be all that excited about this type of mission, especially in a place that is very dangerous, as we have seen some of these bombs going off in Baghdad over the last 24 hours.\n(CROSSTALK)\nCAVUTO: But, General, having worked for the president -- and you know him very well -- do you think his heart is in this? To be fair to the president, he didn't like our involvement in the Middle East to begin with becoming a president. He was -- he wanted to wind things down. He is hardly inclined now to wind things back up.\nHe thinks that the will of the people behind him -- and there doesn't seem to be the temperament to take anyone on. You mentioned NATO before, sir. And I'm thinking of that survey done of NATO member countries, several of whom are not too keen on this notion you invade or attack a NATO member, it is an attack on all NATO members.\nMajorities in Germany, France, and Italy, a good many in Spain are saying no, no, you attack one of us, there is no guarantee that we should or would attack in kind.\nWhat is going on?\nFLYNN: Really, you're addressing the NATO Article V, an attack on one is an attack on all.\nCAVUTO: Exactly.\nFLYNN: But I think that part of what we're dealing with here -- and I really -- you know, I go back to, you know, this big stick that the administration has used on the decision to go into Iraq in the first place.\nThere was an enormous number of strategic errors made going into the into the Middle East and clearly into Iraq. I'm not going to argue that point, because even after that, even after the attack and with the lousy intelligence decision in going in there, and some of the mistakes made, I got all that. That's water under the bridge.\nHistory will write about it and tell us about it, but we're in the here and now. We're in the world of reality and practicality today. What we achieved under General Petraeus up through 2011, and defeating this threat that we faced out there, I mean, once we decided to come out of there, we squandered an enormous opportunity that frankly the military did actually provide our nation and provided the Middle East.\nAnd what has happened is a void was created, and that void has amounted to what it is that we're facing right now. One of the things -- one of the phrases we use in the military is bad news doesn't get better with time, Neil. And I will tell you, there has been a lot of bad news over the last couple of years.\n(CROSSTALK)\nCAVUTO: Well, that's why General Petraeus, sir -- I didn't mean to jump on you there, but when I had him on last week...\nFLYNN: Well, we failed to do a lot of things.\nCAVUTO: That was his point with me last week, that he said, you know, if you're not winning, you're losing. And right now, the impression that he got looking at ISIS' gains and others' gains is that we are not advancing the ball here. They are.\nAnd that puts us at a distinct disadvantage. A lot of hullabaloo over those remarks. But do you think ISIS is winning?\nFLYNN: Yes.\nI think ISIS is achieving the objectives that they have set out to achieve. I think that they feel probably very emboldened. They feel pretty good. Their resiliency is extraordinary. But I will tell you, Neil, we have seen this resiliency in fighting members -- fighting the Taliban, fighting Al Qaeda in Iraq, fighting other groups of these Al Qaeda and their associated movements over the last decade-plus.\nSo these guys are very resilient. They're achieving their objectives. And as you talked a little bit about a few minutes back, if you just look at a map of the region and you see what they're dominating, the Middle East, a new Middle East is struggling to be born here.\nAnd if we're not part of that growth, if the United States doesn't take a driver's seat in that, it is going to turn into something that is going to deeply affect our national security for a long time. And I'm -- I just don't see the Middle East going back to the way it was. I really don't.\n(CROSSTALK)\nCAVUTO: All right.\nThen, if Iraq is the way it is now, sir, and looking back at the most analogous thing we can mention in our memory here is the fall of Saigon, those famous shots of American helicopters taking Americans and South Vietnamese out of Vietnam, and the communists took over, North Vietnam took over, do you ever see that possibility?\nIf things are going along the trajectory they're going now, something doesn't erratically change, that Baghdad and Iraq goes the same way?\nFLYNN: Yes, I don't see that right now, to be honest with you, Neil.\nI believe that we are smarter and we know more. I think that part of our inability to act against this very complex situation, frankly, has a lot to do with just the struggle of dealing with 21st century threats that we're facing. And the Middle East is a -- it exacerbates those types of threats that we're facing and we're dealing with them with 20th century tools.\nIt is a very general statement to make, but I just feel like we're moving at such a slow pace, when, in fact, the reality on the ground is moving at a pace that we're frankly not able to keep up with. And I think that the I think the administration needs to take a big step back, evaluate the whole thing and make a big decision about this, Neil.\nAnd, then, number one, I think the president needs to tell the American public, what is it that we're trying to achieve? Be very clear, be very concise, and get after this, because it is going to go on for a long time. And I...\nCAVUTO: General Michael Flynn, thank you, sir. I appreciate it.\nFLYNN: Appreciate it, Neil.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\nyour-world Your World Cavuto , hosted by Neil Cavuto, airs on Weekdays at 4PM ET on Fox News Channel.\nMore on this show Advertisement\nAdvertisement", "external_links": [], "published": "2015-06-11T03:00:00.000+03:00", "crawled": "2015-06-12T00:19:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}