{"organizations": [], "uuid": "c2bdc81d0d41d2e58fc2183cd72cca1802ecaec1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/beauinternal8773.jpg", "site_section": "http://www.foxnews.com/politics/index.html", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/06/06/obamas-clintons-political-dignitaries-join-joe-biden-at-funeral-for-son-beau/", "country": "US", "title": "Obamas, Clintons, political dignitaries join Joe Biden at funeral for son Beau", "performance_score": 8, "site": "foxnews.com", "participants_count": 26, "title_full": "Obamas, Clintons, political dignitaries join Joe Biden at funeral for son Beau | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-06T03:00:00.000+03:00", "replies_count": 28, "uuid": "f3736a2714de6e006a12615d3a1c2490e9e447f2"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/06/obamas-clintons-political-dignitaries-join-joe-biden-at-funeral-for-son-beau/#post-0", "ord_in_thread": 0, "title": "Obamas, Clintons, political dignitaries join Joe Biden at funeral for son Beau", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 06, June 6, 2015: Vice President Joe Biden, accompanied by his family, holds his hand over his heart as he watches an honor guard carry a casket containing the remains of his son, former Delaware Attorney General Beau Biden, into St. Anthony of Padua Roman Catholic Church in Wilmington, Del. for funeral services. Standing alongside the vice president are Beau's widow Hallie Biden, left, and daughter, Natalie. (AP)\nVice President Joe Biden bowed his head and wiped away tears on Saturday before entering the church for his eldest son’s funeral.\nBagpipers played outside St. Anthony of Padua Roman Catholic Church as more than a thousand people attended the funeral of Beau Biden, the former Delaware Attorney General, died a week ago from brain cancer. He was 46.\nThe song “Bring Him Home” was sung during the procession.\nSaturday’s funeral caps three days of public mourning in which the vice president and his family have been both the consolers and the consoled.\nBeau Biden's casket lay in honor in the state Senate chamber on Thursday ahead of a public viewing at St. Anthony on Friday. On each day, seemingly endless lines of people streamed through to greet the vice president, whose solemnity at times gave way to his characteristic humanity as he greeted familiar faces with a broad smile, a lingering hug or a fond memory of his son.\nThe vice president, whose wife and daughter were killed in a car crash four decades ago, developed a reputation over the years for possessing a deep ability to comfort those in grief, and is often called upon to eulogize fellow American leaders. Saturday's Mass honoring his own son is a reversal of roles of sorts for Biden, who in 2012 spoke of his son's service in Iraq as he comforted a group of grieving military families.\n\"When he came home -- it's going to sound strange to you -- we felt almost a little guilty because he came home,\" Biden said then. \"Because there's so many funerals I've attended, so many bases I've visited. And you know, not all losses are equal. Not all losses are equal.\"\nPresident Obama, accompanied by his family, is scheduled to deliver remarks during the full Catholic Mass. Other political luminaries like Hillary Clinton and former President Bill Clinton also gathered to pay their respects.\nA prominent political figure in his own right, Beau Biden served two terms as Delaware's attorney general before setting his sights on the governor's mansion. Many imagined his career would mirror that of his father, who represented Delaware for decades in the U.S. Senate before becoming vice president.\nBut in 2010, at age 41, Beau Biden suffered a mild stroke, then was diagnosed with brain cancer three years later. He returned to work after what doctors said was a successful operation to remove a small lesion, but his illness returned, and he died last Saturday -- less than two weeks after being admitted to Walter Reed National Military Medical Center for aggressive treatment.\nHis death drew passionate expressions of sympathy from across the American political spectrum, the sense of sadness heightened by the sheer enormity of tragedy that the Biden family has endured over the years. It was just weeks after Joe Biden was first elected to the Senate in 1972 that Beau, then 3 years old, and his younger brother, Hunter Biden, were injured in the car crash that killed their mother and infant sister.\nWhite House officials said the choice of Obama to deliver remarks reflected the tight personal relationship that Joe Biden and the president have developed after more than six years together in the White House. In the hours after Beau Biden died, Obama called the vice president to offer his condolences and was invited to give the remarks.\nThe Associated Press contributed to this report.\n ", "external_links": [], "published": "2015-06-06T03:00:00.000+03:00", "crawled": "2015-06-06T18:56:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}