{"organizations": [], "uuid": "c22eb680bd047854c470992ecd1643dbdd28411b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3116826/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/bernie-sanders/feed", "section_title": "Bernie Sanders on Huffington Post", "url": "http://www.huffingtonpost.com/joseph-a-palermo/transpacific-partnership-obama_b_7665862.html", "country": "US", "title": "Joseph A. Palermo: Trans-Pacific Partnership: Obama Sides With the Wrong People for the Wrong Reasons at the Wrong Time", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Joseph A. Palermo: Trans-Pacific Partnership: Obama Sides With the Wrong People for the Wrong Reasons at the Wrong Time", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T19:34:00.000+03:00", "replies_count": 0, "uuid": "c22eb680bd047854c470992ecd1643dbdd28411b"}, "author": "Joseph A. Palermo", "url": "http://www.huffingtonpost.com/joseph-a-palermo/transpacific-partnership-obama_b_7665862.html", "ord_in_thread": 0, "title": "Joseph A. Palermo: Trans-Pacific Partnership: Obama Sides With the Wrong People for the Wrong Reasons at the Wrong Time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nBy siding with the Republicans and Senate Majority Leader Mitch McConnell in passing \"fast-track\" trade authority as a step toward signing the Trans-Pacific Partnership (TPP), President Barack Obama triangulated against labor unions, environmentalists, consumer activists, and the base of his party. \nThe 60-38 vote in the Senate to give the president (and the next president) more executive power to negotiate trade agreements, which garnered the support of thirteen Democratic Senators, followed months of bitter in-fighting among Democrats. \nPresident Obama not only expended his own \"political capital\" by pushing for fast-track but that of the Democratic Party too. He had a clear choice: either side with workers, environmentalists, consumers, and progressives - or side with Wall Street, Big Pharma, Walmart, and the Koch Brothers . \nRepublicans have been whining about Obama's \"unconstitutional power grabs\" for over six years. Now they turn around and give him fast-track authority - Wow! It's creepy to see Mitch McConnell and Paul Ryan praising Barack Obama. \nThe fight continues because the TPP still needs to be voted on (most likely in the fall), but it's a colossally wrongheaded political choice for the Democratic Party. Obama's support for the TPP blurs the line between Republican and Democrat at a time when the distinctions should be sharpened going into 2016. \nThe TTP, which has been called \"NAFTA on steroids,\" is part of a corporate-managed \"trade\" framework that at the very least guarantees to balloon the massive $400 billion U.S. trade deficit and outsource more American jobs to low wage countries like Vietnam where workers earn an average of $90 to $129 a month . \nJournalists rarely bring up the mammoth trade deficits the United States has sustained since the \"bipartisan\" NAFTA-style \"trade\" agreements became the law of the land. Between 2001-2012, there were 63,000 American factories shuttered. Today the average American CEO makes 300 times the average worker. None of this happened by accident. \nTrade deals that promise to offshore more American jobs and swell the current accounts deficit, coming after the pummeling the average American worker has received over the past decade are just rubbing salt in the wound. \nWith men like Utah Senator Orrin Hatch, the CNBC talking head Larry Kudlow, and the Chamber of Commerce chief Thomas Donahue offering their adoration of the TPP (all of them ferociously anti-labor, pro- Citizens United , and wholly unquestioning of the plutocratic direction our society has taken) aren't we being a bit foolish if we think the TPP is going to be \"good\" for the United States no matter how many \"Democrats\" support it? \nIf you look at the special interests that have lined up in favor of the TPP it's pretty clear that this trade deal serves giant multinational corporations and international banking conglomerates. The TPP will only give more power to the already far too powerful corporate and banking behemoths that hold sway over Congress and the Obama Administration. Obama expended so much energy pushing through this corporate wish list he has demoralized his base. \nMcConnell's sudden transformation into a \"bipartisan\" leader willing to \"reach across the aisle\" helps the Republican brand. But it reinforces all of the most negative stereotypes of the Democratic Party. The Vulcan Mind Meld that has apparently taken place between McConnell and Obama on the TPP gives credence to the argument that there is really no difference between the two dominant political parties in this country. \nOne reason we shouldn't be fooled into another corporate \"trade\" deal is that the world we live in today is not the one that existed in 1993, or in 2003; the working people in this country have suffered immensely since the 2008 Great Recession. When comparing the TPP to NAFTA the big difference is that things are much worse for the working class in the United States today than they were 20 years ago. \nThe labor unions are weaker; there are more \"right-to-work\" states than ever before; public sector workers have been stripped of their collective bargaining rights in many states and their pensions are under attack; there is less job security, the social safety net is in tatters, and the Great Recession threw millions of people out of decent jobs and shoved them into McJobs. \nThe trade deficit weighs like a alp on the wages of all of us and the technology today is so advanced it has opened up new methods of degrading workers through automation or training low-paid tech workers from other countries to do the work that once provided Americans with decent paying jobs. \nThe political class loves the TPP and other \"trade\" deals because they promise short-term profits. But they're dangerous because they could impoverish so many Americans in the long-term that we can reach a point where there won't be enough demand to keep the economy running. When bosses and oligarchs do a dance on the heads of working people they stymy demand and put so much downward pressure on wages the whole economy eventually screams. \nAs demand declines, banks will try to rope more people into debt because there is so little real economic growth. Consumer and household debt, student debt, mortgage debt, and higher rents are already victimizing millions of working families in America. They feel it in their bones that their livelihoods are more precarious than ever. \nObama's support for the TPP also reinforces one of the most damaging narratives attached to Democrats: They're all a bunch of cowards and tools of big corporations just like the Republicans. If the $5 billion presidential election in 2016 is going to be between another Bush and another Clinton, the voter turnout will be low and the GOP could hit the jackpot. Whoever the Democrats nominate is going to need the base of the party to show up. \nAt a time when nationally the Democrats should be making every effort to draw distinctions with the GOP, the Obama triangulation against the left and the base of his party on fast-track and the TPP only blurs the lines. When the moment came to stand up for workers, which is still the most important responsibility of any Democratic president, Obama and the rest of the TPP crowd not only failed but sided with the oligarchs. \nAmong the Democratic candidates for president only Vermont Senator Bernie Sanders draws clear distinctions. Only Bernie Sanders articulates a Democratic vision that is freed from the Rahm Emanuel/Andrew Cuomo/Wall Street-wing of the party that supports the TPP. \nIf the Republicans run the table in 2016 they'll cement the oligarchy, further stack the Supreme Court with plutocrat-friendly justices, and ram through policies they've already articulated in their budget such as slashing social programs, cutting taxes on the rich and corporations, privatizing as much of the government they can get away with (including Social Security), gutting environmental regulations, and guaranteeing the nation does nothing to deal with global warming. \nUnless the grassroots activists figure out a way to nominate a true friend of the working class like Bernie Sanders, the Democrats could find themselves going down in flames in 2016. \nObama and the pro-TPP Democrats have sided with the wrong people for the wrong reasons at the wrong time. \nFollow Joseph A. Palermo on Twitter: www.twitter.com/JosephPalermo1 More:", "external_links": [], "published": "2015-06-25T19:34:00.000+03:00", "crawled": "2015-06-25T23:41:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}