{"organizations": ["Senate", "GOP", "Congress", "House", "Ways and Means Committee", "Democratic Party"], "uuid": "d462b8373962b3059cd46249fbb039134620aff8", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/05/politics/paul-ryan-trade-negotation-barack-obama/index.html", "country": "", "title": "Paul Ryan's new partner: Obama - CNNPolitics.com", "performance_score": 3, "site": "cnn.com", "participants_count": 0, "title_full": "Paul Ryan's new partner: Obama - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-05T15:58:00.000+03:00", "replies_count": 0, "uuid": "d462b8373962b3059cd46249fbb039134620aff8"}, "author": "", "url": "http://www.cnn.com/2015/06/05/politics/paul-ryan-trade-negotation-barack-obama/index.html", "ord_in_thread": 0, "title": "Paul Ryan's new partner: Obama - CNNPolitics.com", "locations": ["United States", "Iran", "Mexico", "Canada", "Australia", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Hillary Clinton", "Mitt", "Ryan", "Paul Ryan", "Obama", "Janna"], "text": "MUST WATCH Here's why the TPP is such a big deal 03:24 The bill Ryan and Obama are working on would make it easier for presidents to move big trade deals through Congress. It comes as Obama is seeking congressional approval of a historic trade agreement with 12 nations in the Pacific, including the United States, Canada, Mexico, Australia and Japan. The Senate approved the so-called fast track authority last month, despite opposition from some members of both parties. But it's facing a tougher climb in the House amid concern from a sizable bloc of conservatives. READ: Democrats blast unions' pressure tactics on trade A vote on the bill could come up in the House as soon as next week and Ryan's job is to convince fellow Republicans that easing the path for trade legislation is in line with the GOP's principles. Ryan says the biggest hurdle is what he calls the misperception among many House Republicans that a vote to give the President fast track trade authority is a vote to give Obama more power. \"It's far from it. It's actually quite the opposite. There's nothing that stops the President from going out and getting an agreement. Look at what he's doing with Iran. But with TPA (trade promotion authority), it puts Congress in the driver's seat. Congress says here's what we want to see in trade agreements, Congress says we want to be a party to the negotiations while they're ongoing.\" explained Ryan. It's a line he uses over and over in private, as he lobbies skeptical fellow Republicans to vote yes. Ryan insists the trade legislation will pass, but the reality is that also depends on how many Democrats the President can deliver. No one in his the President's own Democratic leadership in the House is backing the bill publicly, as of now. READ: 6 reasons why the Trans-Pacific Partnership matters On the presidential campaign trail, Hillary Clinton hasn't committed to supporting this trade legislation. Free trade agreements are historically controversial within the Democratic Party because many blame them for American job loss. Labor unions as well as anti-trade lawmakers in key states are pushing Clinton to take a stand against it. When we asked Ryan about that, he said he didn't want to weigh in on Hillary Clinton, even as he did just that. \"My guess is she's got her own political concerns. I think her support for these things in the past has been pretty clear, speaks for itself,\" said Ryan. Ryan took himself out of the running for the 2016 Republican presidential nomination early in the process, saying he wanted to focus on being House Ways and Means chairman -- what he calls his dream job. READ: Obama: Liberal critics of trade stuck in the past Now that the 2016 race is heating up, and the field is flooded with candidates, he says he doesn't have regrets. \"I'm at peace with these kinds of decisions. I gave it a lot of thought last year. To me, it's a phase of life. Janna and I, our kids are 10, 12 and 13. I'm chairman of the Ways and Means Committee -- it's an incredibly important job that affects our tax policy, our health care policy,\" Ryan said. \"I feel like I'm in a very good position to make a difference now. So just with the phase of life I'm in I thought this was the right decision.\" Then we asked a question that gave Ryan pause before answering. What would have been a better job -- the one that you're in or vice president? \"Oh you know,\" he said after taking in a long breath, \"I never planned on running for vice president -- that was something that Mitt asked me to join him on the ticket. So Ways and Means is something I've had my mind focused on trying to do because I knew I could make a huge difference,\" he replied. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Congress ", "external_links": [], "published": "2015-06-05T15:58:00.000+03:00", "crawled": "2015-06-05T15:58:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}