{"organizations": [], "uuid": "55cfa9fcc5acac9cf76246615f0c687c9fa46f84", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/061415_smf_king_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/transcript/2015/06/15/rep-king-blames-obama-for-trade-deal-failure-gen-mcchrystal-on-us-expanding/", "country": "US", "title": "Rep. King blames Obama for trade deal failure; Gen. McChrystal on US expanding ISIS fight", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Rep. King blames Obama for trade deal failure; Gen. McChrystal on US expanding ISIS fight | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "55cfa9fcc5acac9cf76246615f0c687c9fa46f84"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/06/15/rep-king-blames-obama-for-trade-deal-failure-gen-mcchrystal-on-us-expanding/", "ord_in_thread": 0, "title": "Rep. King blames Obama for trade deal failure; Gen. McChrystal on US expanding ISIS fight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 15, 2015 FoxNews.com Email Print\nThis is a rush transcript from \"Sunday Morning Futures,\" June 14, 2015. This copy may not be in its final form and may be updated.\nMARIA BARTIROMO, HOST: Good morning. The role of the United States expanding in the fight against ISIS with 450 more military advisers headed to Iraq.\nHi, everyone. I'm Maria Bartiromo, welcome to \"Sunday Morning Futures.\"\nThe Pentagon may also open a fifth training base in the country.\nSo is this slowly moving towards putting our boots on the ground?\nI'll ask Stanley McChrystal, a former top commander of U.S. and international forces in Afghanistan.\nPlus, health care for millions of Americans in limbo as we await a federal court ruling on federal subsidies. The CEO of one of the top hospitals in the country, the Mayo Clinic, on what it means for you, the patient.\nAnd we break down Hillary Clinton's formal campaign launch yesterday as we prepare for two more GOP candidates, including Jeb Bush, to announce their 2016 run. Our panel on their chances as we look ahead on \"Sunday Morning Futures.\"\n(MUSIC PLAYING)\nBARTIROMO: Well, a landmark trade deal that would have given President Obama fast-track authority went down in flames on Friday. Fellow Democrats circling the wagons to kill it off in the first of a series of maneuvers.\nWhat happened in spite of a rare appearance on Capitol Hill by President Obama to lobbied for its passage? The vote disappointed many business sectors, like manufacturing, like farming, which called it a missed opportunity.\nUnions cheered, saying it would have cost jobs in America.\nJoining me now Republican Congressman Peter King from New York, a member of the House Homeland Security Committee and chairman of the Subcommittee on Counterterrorism and Intelligence.\nCongressman, good to have you on the program. Thank you so much for joining us.\nREP. PETER KING, R-N.Y.: Thank you, Maria.\nBARTIROMO: Explain the division around this trade deal.\nKING: Well, first of all, Maria, let me tell you, this was a total failure of leadership by the president. He has lost all influence within his own party, the Democratic Party; Republicans in large numbers supported the president.\nThis deal, this agreement is so important for us as far as national security. Apart from the economics alone, the national security impact is very significant because, by not having this agreement, we are, in effect, giving that area of the world, the Pacific, to China. And they are going to be the ones setting the terms and conditions. This would have allowed us to do it.\nWhat happened here was the president has had no leadership role with Congress. He doesn't deal with his own party. And so now as the term is winding down, the Democrats are basically giving in to their base, which would be the unions and other progressive groups that are against trade deals.\nAnd he lost all influence with them. The fact that you said that he made a special trip to Capitol Hill. Well, it shouldn't be a special trip. The president should always be dealing with Congress.\nI was there in '94, in 1994 with President Clinton. That was 24/7. He was working with every member of Congress, Republicans, Democrats, I mean, literally around the clock. And so he had the votes to get that there. He worked closely with Newt Gingrich, he worked with Republicans, with Democrats. In this case, the president was AWOL. It's a terrible failure of leadership.\nBARTIROMO: So what are the implications of this failure on Friday, Congressman?\nKING: It's a devastating economic blow. I mean, the last 15 years alone, the United States has lost, I think our share of the import market into Asia has declined by over 40 percent. There's been 48 trade agreements in Asia. We've only been party to two of them, which means that China is going to become the dominant economic force in the Pacific.\nAnd across the board this hurts us economically. It will hurt us as far as job production and it will hurt us from a national security perspective because it will establish China as the dominant economic power. And an economic power also means that you become the dominant force in the region.\nThis is a terrible blow to the United States. And to also -- again, you combine the president's terrible foreign policy in the Middle East and with Russia and now this. It looks as if we're disengaging from the world.\nAnd so, no, I can't emphasize enough what a loss this was to the United States.\nBARTIROMO: All right. Congressman, stay with us. A lot to talk about with you this morning, Congressman Peter King. But first we want to break down the politics of this trade bill.\nDoes the legislation actually have a chance when the House votes again this week?\nFox News' senior correspondent Eric Shawn with that angle. Good morning to you, Eric.\nERIC SHAWN, FOX NEWS SENIOR CORRESPONDENT: Good morning, Maria.\nAnd good morning, everyone.\nIt was a stunning setback for the president: Democrats, 144 of them, rejecting a key part of the trade bill despite his personal pleas to pass it. And with that, a thumbs down from members of his own party and a victory for the progressives and unions.\nThe House rejecting the long-standing provision providing assistance to workers displaced by the global economy called trade adjustment assistance, a step that could potentially sink the president's Pacific Rim trade agreement. Supporters claim it would boost the U.S. economy but critics among the many Democrats fear more American jobs would be shipped overseas.\nEven Nancy Pelosi was a no.\n(BEGIN VIDEO CLIP)\nREP. NANCY PELOSI, D-CALIF., HOUSE MINORITY LEADER: We have an opportunity to slow down. We all know we have to have -- what to engage in trade promotion and the rest of that. But we have to slow down this -- is not whatever the deal is with other countries, we want a better deal for America's workers.\n(END VIDEO CLIP)\nSHAWN: The president's pleas fell flat. He showed up at last week's congressional baseball game to pitch the bill. By the way, the Democrats beat the Republicans, 5-2.\nAnd as Congressman King noted, he drove up Pennsylvania Avenue to lobby in person on Capitol Hill, but the rebuke was stinging.\n(BEGIN VIDEO CLIP)\nREP. PETER DEFAZIO, D-ORE.: Basically the president tried to both guilt people and then impugn their integrity. And I don't think it was a very effective tactic.\nREP. JOHN LEWIS, D-GA.: America should not have to compete with starvation wages and environmental destruction.\nSHAWN (voice-over): Republicans will try again, but need to shift 90 votes, a huge task.\nREP. JOHN BOEHNER, R-OHIO, SPEAKER OF THE HOUSE: And we want to make darn sure that there's less authority for the president and more authority for the American people. That's what this bill does.\nSHAWN (voice-over): In his weekend address yesterday, the president also indicated he is not giving up.\nPRESIDENT BARACK OBAMA: Simply put, America has to write the rules of the 21st century economy in a way that benefits American workers. If we don't, countries like China will write those rules in a way that benefits their workers.\n(END VIDEO CLIP)\nSHAWN: And there could be a revote on the bill this coming week, when by the way members of Congress will go up to the White House on Wednesday for the annual White House congressional picnic. There's no word today that the president will be eating crow -- Maria.\nBARTIROMO: All right, Eric, thanks very much.\nEric Shawn with the very latest there. And we are back with Republican Congressman Peter King from New York, a member of the House Homeland Security Committee and chairman of the Subcommittee on Counterterrorism and Intelligence.\nCongressman, let me ask you about this redo and what may happen in the House this upcoming week.\nWhat do you think this side would be willing to give on in terms of moving this bill forward?\nKING: I don't know if it was something involving the transportation bill. Quite frankly, there's been so much negotiation up until now again within the Congress and, again, I thought this was ready to go and then the Democrats the last minute, really, in the last week, decided to break from the president. That's going to have to be behind closed doors between the Speaker, John Boehner, the Democratic leader Nancy Pelosi and the president to see what can possibly be done.\nBut again, there's been so much dealing going on within the Congress up until now. And I'm talking about honest dealing, I'm talking about trying to find a common way forward. But it was the president dropped the ball. So again, I don't want to get in John Boehner's way or Paul Ryan's way. But again, this is going to have to be negotiated between them and Nancy Pelosi and the president.\nBARTIROMO: How did the president drop the ball?\nI mean, looking at the divisiveness and division over this trade bill within the Democratic Party, it's not something you see often. Normally you see this group sticking together.\nHow did the president drop the ball?\nKING: By not showing leadership, by being AWOL during the time when the unions and the progressive movement was putting tremendous pressure on the Democratic members of Congress. The president was nowhere to be seen.\nAlso, going back over the last six years, there was no working relationship between the Democrats in Congress and the president. So he couldn't call in on a personal basis. He couldn't ask for their support. And he really let the people, like Elizabeth Warren and others, dominate the debate.\nThat's his job as president. Also for instance, someone like Hillary Clinton as a candidate for president, as the front-runner, she should have been out there supporting this bill. Instead she's been silent. So there's been a terrible lack of leadership in the Democratic Party. And in the end, the Democrats' own leader, Nancy Pelosi, went into it.\nBARTIROMO: All right. So let me move on, Congressman, to Hillary Clinton, who, of course, launched officially her campaign yesterday on Roosevelt Island and really took a decidedly Far Left tack, I mean, really came down hard on the wealthy, on hedge fund managers, on Wall Street, basically saying these Republicans trip over themselves, promising lower taxes for the wealthy and fewer rules for the biggest corporations without regard for how that will make income inequality even worse.\nWe've heard this tune before and we know how it turns out.\nWhat's your reaction to Hillary's official launch yesterday?\nKING: I've known Hillary Clinton for a number of years and I was really disappointed. I'm saying that as an American, not just a Republican. She's now going for the politics of class envy, class warfare, the politics of begrudgery (sic). This goes almost entirely against Bill Clinton's economic philosophy. She's really to me pandering to the worst instincts by again, you know, going after the rich and going after those who are successful.\nIt was John Kennedy said a rising tide lifts all boats. The idea is to make the economy grow for everyone and not begrudge those who have made it now. Give everyone at every level the opportunity to move forward.\nShe gave no indication. She really wanted to do that, she'd be talking about cutting back on regulations, cutting back on marginal tax rates, giving incentives for lower income people, to small businesses, giving people a chance to move up.\nInstead, she's just talking about attacking people at the top. That never works. It maybe worked in the short term politically but it will just hamper our economy. That won't give anyone the opportunity to move ahead.\nBARTIROMO: Yes, it's really interesting. I was surprised that she came out basically like a third term of Obama as opposed to another term of Bill Clinton. Really different economics there.\nVery quickly, we're going to talk about the new troops going to Iraq with Stan McChrystal coming up, but what's your take on the president's new strategy now? Is this a new strategy?\nKING: I -- I -- I just think it's marginal. No, the fact is, if it's only 450, it -- it has the smallest possible impact.\nBARTIROMO: Right.\nKING: I think the president has yet to show a real commitment and that's why I don't think even the military nor our allies believe him and why our enemies are emboldened.\nBARTIROMO: Congressman, good to have you on the show today. Thanks so much.\nKING: Thank you, Maria. Thank you.\nBARTIROMO: We'll see you soon. Congressman Peter King joining us.\nThere is no complete strategy in the fight against ISIS, that's according to the president. He said that last week. He's sending in hundreds of more military advisers now to help train Iraqi and Kurdish forces. Is that enough to get things moving in the coalition's favor? I'll talk with General Stanley McChrystal next, and his new book.\nYou can follow us on twitter @mariabartiromo. Send us a note. What would you like to hear from Stanley McChrystal? @sundayfutures is the handle on the program. Stay with us as we look ahead this \"Sunday Morning Futures\" this Sunday morning.\n(COMMERCIAL BREAK)\nBARTIROMO: And today we honor the men and women in uniform as the Army celebrates 240 years defending the American people and their freedoms. This as our military is called upon once again to defend us from another enemy abroad, ISIS. Last week, President Obama announced he will send 450 additional military advisers to the region to help degrade and destroy ISIS. But he put it on the Pentagon to come up with, Quote: , \"a complete strategy.\"\nA year into this battle now, our next guest says we must not only beat ISIS militarily, but win over people's minds as well. He is the author of the new book \"Team of Teams: New Roles of Engagement for a Complex Word,\" and he is General Stanley McChrystal, former commander of U.S. and international forces in Afghanistan and the former commander of Joint Special Operations Command.\nSir, it's great to have you on the program. Welcome.\nGEN. STANLEY MCCHRYSTAL, RETIRED FOUR-STAR GENERAL , U.S. ARMY: Thank you, Maria.\nBARTIROMO: Thank you so much for joining us.\nSo as you have run such important operations in Iraq, in Afghanistan, over a decade of special operations missions around the globe, can you give us your reaction to now the president wanting to send 450 additional advisers? Is this the right move?\nMCCHRYSTAL: Sure. I think it's the right move only if we step back and decide exactly what our objective is. Strategy is how you achieve an objective, and I think that we have to have an objective in the region that is clearly understood by people in the region, our foes and our potential allies and understood by the American people. And I think that can use some refinement.\nAnd then secondly, I think if you're going to try to do something of this nature, you're going to have to build a team, a coalition against it, and that means countries in the region, not just the people inside of Iraq and the opposition groups in Syria, but we are going to have to build a credible coalition that can work to some degree together. Absent that, an organization like ISIS has an outsized ability to be effective.\nBARTIROMO: Do you think that the troops that we have there right now, the airstrikes, if you will, do you think those men and women need additional backup on the ground?\nMCCHRYSTAL: I think if we are going to accomplish an objective, we are going to have to have enough capacity to do that. I've never been a believer that airstrikes alone will make a decisive effect because there's got to be a complimentary effort on the ground. Now, that could be allied forces, Iraqis or others, if they're effective and credible, and thus far they've struggled with that. So I think we need a more holistic approach clearly.\nBARTIROMO: And you said that we really also need to ensure that America understands the strategy and communicate to the American people because the will of the American people is no war and not to send troops. Is that what you mean by that?\nMCCHRYSTAL: That's exactly what I mean. If you look at American history since the Second World War, as we enter a war very quickly, political divisiveness makes getting out of that war seem to be our major objective. And our allies and our opponents look at that and they question our resolve. If we are going to put people in harm's way, I think we need to have a national debate about that, we need to make a commitment about it and we can certainly question the strategy, but we have got to demonstrate the kind of resolve that makes potential allies, like the tribes in al Anbar, believe that we'll see it through to the end.\nBARTIROMO: And, in fact, the White House just this last week, on Thursday, did not rule out sending even more troops to Iraq, one day after the administration announced the plan to send 450 military advisers there. Assess the situation for us now one year in. We have been fighting this war against ISIS one year now officially yesterday. What has been the successes and failures from your standpoint?\nMCCHRYSTAL: Well, I think, clearly, there have been some military successes against some of the leadership of ISIS. I think they have been contained in areas. But I think perception wise, and the perception is very important, they seem to still be moving forward. They seem to still threaten areas and they hold areas like Mosul that the longer they hold it, the more legitimacy they get in the eyes of the people. So I think it's dangerous from the standpoint of the longer an organization like ISIS seems to have state-like credibility, the more dangerous they become.\nBARTIROMO: What about Syria? How worried are you that ISIS apparently controls 50 percent of Syria and, of course, has taken down so many important cities in Iraq?\nMCCHRYSTAL: Well, I think it's very dangerous. But even if ISIS were to magically disappear this morning, Syria would still be a mess. And Syria is going to be a mess for a long time. And that's one of the things we have to think about in the United States, what next? So if, for example, we are defeat -- to defeat ISIS, then we're still going to have a big problem in that region. And if we look only at the short-term issue of ISIS, I think we're going to be very disappointed when that's over that there's so much left that has to be done. Much of it diplomatic, but some military presence as well.\nBARTIROMO: Yes. So what else needs to be done then? What would you like to see the approach -- how do you want to see it evolve?\nMCCHRYSTAL: I would start with a framework. The players in the region aren't going to work towards something unless there's some kind of credible, political framework that we can move towards. Now, it may not be something that everybody loves, but it's got to be something that they believe is achievable. Only when we have that can we build the kind of team we have. And I write in my book, \"Team of Teams,\" you know, you can have the best idea in the world and you can have the most altruistic objective, but if you can't put together a team to actually get it done, then it's actually irrelevant. And I -- I think that's the next thing that has to happen.\nBARTIROMO: It is a very important book. General, great to have you on the show today. Thanks so much.\nMCCHRYSTAL: Maria, thank you.\nBARTIROMO: We'll see you soon. General Stanley McChrystal joining us.\nA critical piece of ObamaCare hangs in the balance. We are watching the Supreme Court to see if it strikes down federal subsidies that help more than 7 million people. Such a ruling would create a huge problem for Congress and many states, as we look ahead this morning on \"Sunday Morning Futures.\" Back in a moment.\n(COMMERCIAL BREAK)\nBARTIROMO: Welcome back. We are keeping a close eye on the Supreme Court this weekend, waiting for its decision on ObamaCare and the lawsuit against federal subsidies that make up the core of the program. The decision could affect recipients in nearly three dozen states because those states have not set up exchanges. More than 7 million people depend on the federal marketplace healthcare.gov, which could be voided.\nThe justices are expected to announce a decision by the end of this month. Congress and those states would have some big decisions to make if the subsidies get tossed aside.\nJoining me now is Dr. John Noseworthy. He is president and CEO of the Mayo Clinic. And he is with us on set.\nGood to see you, John. Thanks so much for joining us.\nDR. JOHN NOSEWORTHY, PRESIDENT & CEO, MAYO CLINIC: It's good to be back, Maria.\nBARTIROMO: Thank you so much for joining us.\nSo I want to get your take, really, on a couple of things. I want to talk about the subsidies issue and this pending Obamacare care ruling. But I also want to ask you about innovation, what you're doing at Mayo and, really, what's happening in health care today.\nSo thoughts on this pending Supreme Court ruling on the ObamaCare case of King v. Burwell: how has it changed things so far and what are you seeing?\nNOSEWORTHY: Well, I think it's not for a physician to speculate on what's going to happen politically. I assume they'll come up with a fix of some sort because there are going to be, as you say, 7 million people who can't afford their health care.\nFrom a health care standpoint, this has really drawn attention to how costly health care is and how it's paid for. And hopefully it's focusing patients' attention on the importance of buying the right insurance and employers making sure that their employees have good insurance, because health care is costly and we want to make sure that people are insured.\nSo an awful lot of eyes are on the Supreme Court.\nBARTIROMO: But this decision, if in fact it tosses away the subsidies, I mean, that would create a lot of new decisions. People will not know what they're going to do. How would it impact patients?\nNOSEWORTHY: The 7 million people who are depending on the subsidies from the federal government would lose those, presumably. If they lose them immediately, they basically won't have health care.\nIf their states move forward with an administrative fix and the government says now you have a federal exchange; let's help you get it to a state exchange, they would be covered. Or if the Congress comes together in a bipartisan way and provides subsidies and keeps those going for another year or two, then they would get a stay, if you will.\nBut that's -- that's really the decision for the government to make.\nBARTIROMO: We've already seen premiums go up. I mean, I know a number of people who basically say, \"Look, I was paying $200 a month for me and my family; now I'm paying close to $1,000.\" Why have costs gone up so much for individuals?\nNOSEWORTHY: Right. Well, more people are using health care because they have access to health care, because they have a form of insurance, whether it's Medicaid or a commercial insurance. And so people are coming to the emergency department; they're going to their physician and saying, \"I now have health care; I have a pent-up need; I've been chronically ill for a while; I've never had health care; now I have access to that.\"\nSo people are using health care, particularly the newly insured, the Medicaid patients. And we're seeing the Medicare patients continuing to use health care. Those with commercial insurance who have had it for a while are kind of hanging back a bit because many of them have bought the low- cost, high deductible health plans. And they're not looking forward to more out-of-pocket expense and they're not sure where they can go for their care. Are they stuck in (inaudible) network and so on?\nSo it's a -- people are confused.\nBARTIROMO: So was this an unintended consequence, the fact that, you know, prices went up so much?\nNOSEWORTHY: Well, I can't speak about the political side, but it's not surprising, if people have health care, insurance, that they're going to start to use it.\nBARTIROMO: True.\nNOSEWORTHY: And I think, when the economy was so slow for so long, that folks were staying back. Now the economy is beginning to -- beginning to move and people are now going to their physician more.\nBARTIROMO: Let me ask you about what's going on at Mayo because you've got a big announcement today, actually, or tomorrow, really -- it was embargoed, but you're going to release it right now -- about organ transplants. What's the news of the day at Mayo?\nNOSEWORTHY: So the news of the day, released today on an embargo at noon, is that, working with United Therapeutics, Mayo Clinic is going to build a lung restoration center on our campus in Florida to allow lungs that are currently not usable at the time of death for transplantation, can be restored through some new technology. So it's very exciting.\nBARTIROMO: What is the technology?\nNOSEWORTHY: So essentially lungs are very delicate. And immediately during the dying process and after death, they begin to deteriorate. And they deteriorate much more quickly than your heart or your liver or your -- or your kidney. And basically, by reperfusing the lung with fluids and with gases, one can remove the inflammatory debris and the blood clots and bring that lung back so it's usable.\nAnd this will, we hope, within five years, double the number of lungs that can be transplanted. So it's a big advance.\nBARTIROMO: Wow, this is a big deal.\nNOSEWORTHY: It's a big deal.\nBARTIROMO: Congratulations on that and thanks for releasing it here.\nLet me ask you about your latest efforts in using technology for data collection. Of course, this is the biggest issue of the day that we all face, trying to protect all our data, in particular the health care data that is private information.\nNOSEWORTHY: Right.\nBARTIROMO: How are you managing that?\nNOSEWORTHY: Well, security of data is absolutely paramount in everything that we do. And I'm not saying we've got that licked, but so far we have been very good at protecting our patients' data.\nBut, as you remember, we came together as the founding medical partner with a subsidiary of UnitedHealth Group called Optum and put together Optum Labs. And essentially, that innovation brings outcomes data, what works in health care, with the cost of health care, claims data from the insurance companies. One hundred-fifty million patients are in that big database.\nNow we have 21 partners, academic medical organizations, big pharma technology companies and so on, to mine the data using big data tools to find out what works in health care and how we can bring the cost of that down.\nBARTIROMO: And you think you'll be able to secure that data?\nNOSEWORTHY: We are -- yes, I believe we can. We have -- we have done that.\nBARTIROMO: Dr. Noseworthy, great to have you on the program today.\nNOSEWORTHY: Thanks, Maria. Good to be here.\nBARTIROMO: Thank you so much for joining us.\nDr. John Noseworthy is president and CEO of the Mayo Clinic.\nHillary Clinton kicking off her campaign again. So what kind of impact did her big speech on getting Americans sitting on the fence about her trustworthiness back on her side?\nOur panel is here and we'll begin right there after Hillary's speech yesterday on Roosevelt Island.\nThis is \"Sunday Morning Futures.\" Back in a minute.\n(MUSIC PLAYING)\n(COMMERCIAL BREAK)\n(MUSIC PLAYING)\nSHAWN: From America's news headquarters, I'm Eric Shawn. Here are some of the other stories that are making headlines at this hour.\nWe're now in the second week of that massive manhunt for those two escaped killers, Richard Matt (ph) and David Sweat.\n(BEGIN VIDEO CLIP)\nSHAWN (voice-over): Authorities say they planned to drive seven hours away where a four-wheel drive vehicle would be needed. The Clinton County district attorney and upstate New York said the biggest surprise in the hunt so far has been the lack of positive leads as to their whereabouts. Today authorities will expand the search area and continue going door-to- door.\nIn an astonishing moment in space exploration, the European Space Agency says its comet lander, Philae, has contacted Earth after months of hibernation. Philae was dropped on the surface of a comet last November and worked for 60 hours before the solar-powered battery went flat.\nThe comet has since moved closer to the sun, giving Philae the power to work again. Scientists are now awaiting the next contact.\nAnd I'll be back with Arthel Neville at noon Eastern with more news and the doctors, as always, are in, Drs. Siegel and Samadi join us for \"Sunday Housecall\" two hours from now at 12:30 Eastern. So for now, I'm Eric Shawn, back to \"Sunday Morning Futures\" and Maria.\n(MUSIC PLAYING)\nBARTIROMO: Thanks, Eric.\nHillary Clinton rebooting her campaign yesterday on Roosevelt Island. In a speech, bashing the Republicans as the party of yesterday, close minded on immigration and women's issues, this while reaching out to minorities, women, and the LGBTQ community. She also brought up her mother in an attempt to make a connection with the financial struggle of everyday Americans as well as to distance herself from her ties to Wall Street and present herself as an advocate for the middle class.\nI want to bring in our panel.\nAlan Colmes is with us today. He's the host of \"The Alan Colmes Radio Show.\"\nJudith Miller is adjunct fellow at The Manhattan Institute for Policy Research. She's a Pulitzer Prize winning author and journalist and a Fox News contributor.\nAnd Jon Hilsenrath is with us today. He is chief economics correspondent with \"The Wall Street Journal.\"\nAll three are FOX News contributors. Good to see everybody. Thanks so much for joining us.\nAlan, kick us off here.\nYour thoughts on Hillary yesterday?\nALAN COLMES, RADIO HOST: I thought it was a very good speech. Clearly it was a primary speech. She's clearly appealing to the primary voter, not the general voter. And I thought the backdrop was people, very heavily, beautifully managed. She addressed the age issue I thought very well.\nBARTIROMO: She's been coloring her hair for years.\n(CROSSTALK)\nCOLMES: -- the youngest woman. I thought that was a very, very effective line --\n(CROSSTALK)\nBARTIROMO: Very smart.\nCOLMES: I would have liked to have seen more diversity in the crowd. I saw a lot of white, middle-in-age people. And I would have expected in a Hillary Clinton very well-managed event to have more diversity in the backdrop.\nBARTIROMO: Some of the Quote: s, Judy, were very much far leaning left, like attacking Republicans and wealthy earners. These Republicans trip over themselves promising lower taxes for the wealthy and lower -- fewer rules for the biggest corporations without regard to how it will impact income inequality.\nCan she walk this balance of not being seen as a third term of Obama but also sort of a Bill Clinton's world of vibrancy of the '90s?\nJUDITH MILLER, AUTHOR AND JOURNALIST: Well, she's going to try but it will be a very hard and delicate walk.\nBARTIROMO: She didn't try yesterday.\nMILLER: No, she went all the way to the Left.\nThat's for the primary audience as Alan says. I was a little surprised that she didn't portray herself also as a person who's a centrist. Because that's where she is going to have to be in the general election.\nBARTIROMO: Yes.\nMILLER: Now it's not if she has a tough primary ahead of her. She's the obvious winner.\nBARTIROMO: Right. So why play to the primary voters?\nMILLER: Why play to the primary? I didn't get it.\nAnd also, by the way, managed? This event was managed to the nines. I mean, these reporters were kind of hustled through the narrow little lane so that they didn't interact with the people in the crowd and she only spent 3 percent of this speech -- this amazed me -- on foreign policy.\nBARTIROMO: Wow.\n(CROSSTALK)\nBARTIROMO: -- the former secretary of state.\nJon, what do you think?\nJON HILSENRATH, THE WALL STREET JOURNAL: Well, I saw two Hillarys there. I saw an authentic Hillary and an inauthentic Hillary. The one that was bashing Wall Street and positioning herself as a champion for the middle class didn't sound very authentic to me. I mean, this is someone who is part of The Clinton Foundation, \"The Wall Street Journal\" has reported all the money that they've pulled in.\nLet's not forget the Treasury Secretary under Bill Clinton was a Goldman Sachs guy, Robert Rubin. That just -- I think she's going to have a hard time selling that version of herself.\nThe part that resonated with me was when she talked about how she's been called a lot of things but she's not a quitter, she's never been called a quitter. Yes, the whole theme of fighting and being -- having all of these fights that she wants to fight when -- if she becomes president. That actually resonates with me. She does seem like the kind of person who's always game for a fight.\nI mean, she and the -- President Clinton had plenty of fights with the Republicans.\nBARTIROMO: Right.\nCOLMES: And with each other.\n(LAUGHTER)\n(CROSSTALK)\nBARTIROMO: Yes, but what about, you know, fighting and being the champion for the middle class when, in fact, the middle class is worse off today than they were seven years ago?\nCOLMES: Well, I'm not sure I would agree with that. I mean, look at how things were at the end of 2008, when at the end of the Bush administration we were in a very deep recession at that point. We have now 5.5 percent --\n(CROSSTALK)\nBARTIROMO: That's a good point.\nCOLMES: -- we had more consumer confidence. So I am not sure that I would agree with that --\n(CROSSTALK)\nHILSENRATH: The bottom line, though, is I think a lot of Americans are very suspicious of the establishment right now and the elites. And Hillary Clinton really represents the establishment and the elites. I think she's going to have a hard time selling that.\nMILLER: I think she had to humanize herself, and she did that with her mother.\n(CROSSTALK)\nMILLER: The humor, the belly laugh at the beginning.\nUNIDENTIFIED MALE: The grandmother.\nMILLER: The grandmother. She really had to do that because people feel that she's cold. She's not Bill.\nBARTIROMO: Yes. Then there's the press. Let's get a look at what's coming up on \"MediaBuzz,\" check in with Howard Kurtz. He's in the studio right now, telling us what's ahead in about 20 minutes -- Howie.\nHOWARD KURTZ, HOST, \"MEDIABUZZ\": Hey, Maria.\nI was at Hillary's Roosevelt Island speech yesterday. I had a chance to talk to her campaign chairman, John Podesta. We'll have that for you, a look at the coverage of this very liberal speech.\nPlus some increasingly negative stories about Jeb Bush as he prepares to jump into the race tomorrow.\nAnd Marco Rubio taking on The New York Times over that story on his personal finances, raising a bunch of money by punching back at The New York Times.\nBARTIROMO: Yes, we're going to -- be interested in hearing your thoughts in about 20 minutes. Thanks so much, Howie. We will be there.\nAnd as you just said, Jeb Bush set to make it real tomorrow, announcing his campaign for the White House in 2016. Hear what his anticipated agenda looks like next.\nPlus, what other Republican contenders have planned in the coming weeks as we look ahead on \"Sunday Morning Futures.\" More on all of the above with our panel. Stay with us.\n(COMMERCIAL BREAK)\nBARTIROMO: Welcome back.\nTwo days after Hillary Clinton's big splash, the growing field of Republican candidates will have one more. Former Florida Governor Jeb Bush set to make it official tomorrow that he wants to be the third member of his family to move into the White House. Mr. Bush apparently will announce on the campus of Miami-Dade College with campaign stops planned this month in New Hampshire, Iowa, and South Carolina.\nWe're still waiting to hear from other potential contenders. Donald Trump expected to announce his intentions this week, Louisiana Governor Bobby Jindal on June 24th, Wisconsin Governor Scott walker by the end of the month, and Ohio Governor John Kasich in July.\nWe bring back our panel, Alan Colmes, Judith Miller and Jon Hilsenrath.\nJon Hilsenrath, let me kick it off with you. Your thoughts on the incoming GOP candidates. We'll hear from Jeb Bush tomorrow.\nHILSENRATH: Well, I don't know how you guys are going to get all of these people on one set when it comes time to have debates.\nBARTIROMO: Right. Well, there are rules that, you know, some of them will not be on the scene (ph).\nMILLER: Some (ph) are not.\nHILSENRATH: I think -- I think Bush has the same problem that Clinton has, which is the last name, which is why your -- we were just talking about this during the commercial break, the whole rundown of talking points is Jeb, it's not Bush.\nBARTIROMO: Right. That's right.\nHILSENRATH: We were also talking about how there's an anti-establishment mood out there in the country and I think it really has a potential to work against Bush and against Clinton.\nBARTIROMO: I feel like people don't want a Bush/Clinton election. It's boring and that's yesterday.\nCOLMES: We want excitement. We want something new. Except the country was in much better shape at the end of the Clinton presidency than it was at the end of the last Bush presidency. So if you're going to fall back on that, I think that puts it in a different perspective.\nHILSENRATH: Which is why he, I think, resonates more to his father than his brother in his campaign.\nCOLMES: Yes.\nBARTIROMO: OK. So what does Jeb need to do? What do you think about his talking points? He's looking at the economy. He says disrupting Washington to achieve big goals. We must disrupt the broken Washington culture that has been good for lobbyists.\nMILLER: I think he needs to repair the broken Washington culture. He needs to bring people together. This is a president who couldn't even mobilize his own base for the trade pact, which was crucial, as Congressman King told us, to the economic future of the country.\nBARTIROMO: That's right.\nMILLER: And so I'm a little surprised that Jeb Bush, this creature of the establishment, is taking the position that he's going to disrupt Washington. It's pretty disrupted. But he is not a quitter. He is the Republican version of Hillary. He doesn't quit on immigration. He's not changing his mind and he's not changing his mind on Common Core. I think he's going to portray himself as a man of principle.\nBARTIROMO: Does it hurt the Republicans that there are so many of them? I mean, you know, Hillary has an open field. We know Bernie Sanders is out there and Martin O'Malley is out there, but it just --\nCOLMES: I think it's great that they have such a deep bench. I think it's good for the Republicans.\nBARTIROMO: You think it's good for the Republicans?\nCOLMES: It's actually good that there's so much -- so many options and people can get to see the diversity in the Republican Party. Mostly white men, but still diversity of thought perhaps.\nBARTIROMO: Yes. Well --\nHILSENRATH: You -- you have to wonder, though, if they're going to get through this. If whoever gets through this primary is going to come out so beaten up that it's going to be hard to run a national campaign.\nMILLER: Well, so far they've been pretty gentle with one another because I think every Republican is aware of this danger. They don't want to repeat the last time.\nBARTIROMO: No, they saw it last time around, let's face it.\nMILLER: Absolutely. It destroyed them.\nCOLMES: To just what you said before, what really Bush has to do is separate himself from his brother in foreign policy. He's got the same advisers around him that his brother had in Iraq.\nBARTIROMO: Right.\nCOLMES: And he's got to walk a very fine line because he loves his brother and also say, this is not going to happen in my presidency.\nBARTIROMO: Is that a problem that he's got --\nCOLMES: I think it's a big problem.\nBARTIROMO: Yes.\nMILLER: Well, he --\nHILSENRATH: I think at the end of the day there's going to be an insider that comes out of this and an outsider. I don't see how Bush avoids being the insider, given his name and his history with -- with Washington itself.\nMILLER: But you have two insiders, Hillary and Jeb Bush. I mean, come on.\nHILSENRATH: Right.\nMILLER: And, by the way, she has a secret weapon called Bill.\nBARTIROMO: Yes.\nMILLER: He's already out the air today saying, I trust her. I trust her. Why don't you?\nBARTIROMO: Right. Right. So do you think yesterday's rally advanced her positively or was it, you know, no value?\nCOLMES: I think it advanced her positively in that she took some very clear policy positions with Citizens United, constitutional amendment, minimum wage she talked about. She talked about this issue of voting, that everybody should have universal voting and then an opt out, which is a very unique idea and something brand new. So I think that helped advance -- certainly advance her with the left and really addressed the Bernie Sanders crowd there.\nMILLER: Well, she needs the center and I don't think it did anything for her there, but she did humanize herself, so that's important.\nBARTIROMO: Yes. Well, --\nHILSENRATH: She got a chance to work on some lines she'll be using a lot. That grandmother line is a pretty good one.\nMILLER: Right.\nBARTIROMO: That's true. That's true. I want to talk about economics and President Obama's trade bill knocked down by the hands of his own party. Now the question is, whether the Democrats will throw the final knockout punch this upcoming week when they vote again, as we take a look ahead on SUNDAY MORNING FUTURES. We're back with our panel, next.\n(COMMERCIAL BREAK)\nBARTIROMO: Welcome back. The trade bill goes down in flames in the House last week. Even one of the president's closest allies, Nancy Pelosi, folded her cards after the president personally went to Congress on Friday to make his final push.\nWe're back with our panel, Alan, Judy and Jon.\nJudy, your take on the implications of this failed shot on Friday on the trade bill?\nMILLER: Clearly, very serious but a potential disaster of their own making. And I'm speaking of President Obama and the Democrats, who could not muster the political will to do what's in the economic interests of the country because, in part, of the enormous secrecy surrounding this trade measure.\nI mean, congressmen had to go into a room to read the trade bill, which almost no one did. And then, when Wikileaks published parts of it, three parts of it had nothing to do whatsoever with trade -- patents, net neutrality.\nAnd we don't want to do a Nancy Pelosi, \"We have to pass the bill to know what's in it.\"\nBARTIROMO: Right.\nMILLER: But beyond that, it's just steady pressure from labor unions, et cetera.\nBARTIROMO: It was a big victory for unions and environmentalists.\nMILLER: It's not over. The president could still recoup it next week.\nHILSENRATH: I think -- Maria, I think something bigger and broader is going on here, in terms of the national consensus about trade and the benefits of trade.\nYou know, in the '90s and 2000s, there was a widespread view in political circles and also, very importantly, in economic circles, that trade was good and it made everybody better off. This is an idea that goes back 200 years to a British economist named David Ricardo.\nThat consensus has broken down. And, you know, I'm seeing research coming up all the time now that looks at how trade with low-wage countries like China affects the wages of American workers and has hurt a lot of American workers.\nBARTIROMO: Sure.\nHILSENRATH: I think the real problem here isn't Nancy Pelosi. It's that this consensus that we had in the '90s has really broken down because there have been some real victims of the trade that we've entered into with all these low-wage countries.\nCOLMES: I think you're right when you say there was so much secrecy surrounding this. Also, there's some poison pills, as you mentioned, like foreign companies can sue and the American taxpayer would be liable for those dollars. And this is so important that it seems like we're losing control. We lose sovereignty, here, with this bill.\nBARTIROMO: Right. Let me switch gears.\nHILSENRATH: The real problem in Ohio and Michigan is that people feel like they're losing their jobs...\n(CROSSTALK)\nBARTIROMO: Exactly. Let me switch gears to the Federal Reserve. The Fed is meeting on Wednesday.\nNow, when everybody talks about when we're going to see higher interest rates, one of the times was June; it could be June. This is the meeting in June. Will they raise rates next week?\nHILSENRATH: Very unlikely to happen this week because we had a lot of soft economic data early in the year. Now, it just so happens, in the last couple of weeks, we've gotten some strong data which is going to give them some confidence, but they want to see more of it. And the odds on Wall Street now are moving toward September, that they'll move in September.\nBARTIROMO: If they upgrade their assessments of the economy, that could move markets negatively, as well, because that means the good news is bad news; the economy is getting better but it means the Fed raises rates.\nHILSENRATH: It could, but I don't think they're going to upgrade their assessment of the economy.\nBARTIROMO: You don't?\nHILSENRATH: Because they were really shaken by how soft the data were early in the year. They want to see more evidence. If we get more reports like we did the last couple weeks, retail sales, jobs -- they've come in very nicely for May. If we get more of that, then they'll upgrade their assessments and we'll start seeing rate increases.\nBut, you know, people out there need to remember it's going to be a big deal on Wall Street when the Fed raises rates. Our interest rates are not going up very much.\nBARTIROMO: Right.\nHILSENRATH: They're going to stay low for a long time because this economy, frankly, is still very weak.\nBARTIROMO: So it's not a big deal for Main Street is what you're saying.\nHILSENRATH: I don't think so.\nBARTIROMO: All right. We'll take a short break; then the one thing to watch for the week ahead on \"Sunday Morning Futures.\" We'll get our panel's prediction next.\n(COMMERCIAL BREAK)\nBARTIROMO: Back with our panel. The one big thing to watch in the week ahead, Alan?\nCOLMES: Jeb announcing, more Republicans jumping in. Hillary's now on a roll. Bobby Jindal made an announcement in a phone booth, but...\n(LAUGHTER)\n... this is the thing to watch.\nBARTIROMO: Hillary's on a roll?\nCOLMES: Well, she -- I mean, we're on a roll now with the campaign.\n(CROSSTALK)\nBARTIROMO: Judy?\nMILLER: I'm watching the Supreme Court, two really crucial decisions, one, of course, health care; the second, same-sex marriage. Both can have huge effects on the campaign.\nBARTIROMO: Absolutely. Jon?\nHILSENRATH: There's a Fed meeting on Wednesday. They're not likely to raise rates, but they might signal that they're going to later, and that could be a big day for the market.\nBARTIROMO: And I guess I'm going to watch the ECB. I'm going to watch the Fed as well. But the ECB is going to be out, Mario Draghi giving his quarterly assessments of the eurozone economy on Monday. That may very well send the euro down, impact the dollar higher and impact markets. So we'll watch all of the above.\nThanks to our panel. Appreciate it. Thank you so much for joining us today, Alan, Jon and Judy.\nThat will do it for \"Sunday Morning Futures.\" I'm Maria Bartiromo.\nI'll be back tomorrow morning on \"Mornings With Maria\" on the Fox Business Network. It's from 6 a.m. to 9 a.m. Eastern on the Fox Business Network. Take a look at where to find Fox Business Network on your cable network or your satellite provider or click on to \"Channel Finder\" at foxbusiness.com. I hope you'll join us tomorrow morning on \"Mornings With Maria\" at 6 a.m.\n\"MediaBuzz\" with Howard Kurtz is next. Stay with the Fox News Channel right now, and Howie is next, taking you through the rest of the day. Have a great Sunday, everybody.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\nsunday-morning-future Making sense of Washington, making America what it should be and making money on â€œSunday Morning Futures with Maria Bartiromo!â€\nMore on this show Advertisement\nAdvertisement", "external_links": [], "published": "2015-06-15T03:00:00.000+03:00", "crawled": "2015-06-16T00:46:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}