{"organizations": [], "uuid": "73197ce0ea506a2e117f0674d44aac600126ea54", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/06/24/el-presidente-de-estados-unidos-barack-obama.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/06/24/el-senado-de-eu-da-via-libre-al-proyecto-de-ley-fast-track-de-obama", "country": "", "title": "El Senado de EU da vía libre al proyecto de ley 'Fast Track' de Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "El Senado de EU da vía libre al proyecto de ley 'Fast Track' de Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "73197ce0ea506a2e117f0674d44aac600126ea54"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/06/24/el-senado-de-eu-da-via-libre-al-proyecto-de-ley-fast-track-de-obama", "ord_in_thread": 0, "title": "El Senado de EU da vía libre al proyecto de ley 'Fast Track' de Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía El Senado de EU da vía libre al proyecto de ley 'Fast Track' de Obama Con la medida se da autorización al presidente de EU para negociar acuerdos de libre comercio sin la intervención del Congreso Miércoles, 24 de junio de 2015 a las 17:45 La administración del presidente de Estados Unidos podrá tener más control sobre acuerdos comerciales (Reuters). Lo más importante Es un mecanismo utilizado para negociar acuerdos como el de libre comercio con Canadá y México sin la intervención del Congreso El Senado debate un proyecto relacionado que aborda la asistencia a empleados estadounidense que pierdan sus trabajos por esta ley Temas relacionados \n(CNN) — El Senado de Estados Unidos dio vía libre este miércoles a un proyecto de ley conocido como Fast Track para la aprobación parlamentaria de grandes acuerdos comerciales internacionales y lo enviará al presidente Barack Obama para su sanción presidencial. \nLa votación fue de 60 a favor frente a 38 en contra. \nFast Track es la autorización que pidió el presidente Obama para negociar acuerdos de libre comercio sin la intervención del Congreso. \nEs un mecanismo utilizado para negociar acuerdos como el Tratado de Libre Comercio de América del Norte (NAFTA, por sus siglas en inglés) con Canadá y México y los acuerdos de libre comercio con Perú, Chile y Colombia, entre otros. \nEsa autorización les permite a los gobiernos con los que negocia Washington tener la certeza de que no habrá cambios al texto de un acuerdo cuando llegue al Congreso de Estados Unidos, que solo puede aprobar o rechazar, pero no alterar el documento. \nEl Senado ahora debate un proyecto relacionado que aborda la asistencia a empleados estadounidense que pierdan sus trabajos debidos a esos acuerdos comerciales. \nSe espera que ese proyecto pase y vaya a la Cámara para una votación el jueves. \nLa líder del Partido Demócrata en la Cámara, Nancy Pelosi, quien votó contra ese último proyecto hace dos semanas para obstaculizar el fast track , dijo este miércoles que ahora lo apoyará, pero asegurándose de que pase y sea convertido en ley. \nCon información de Juan Carlos López. Encuentra este artículo con: mundo, barack obama, senado, estados unidos, proyecto, ley, fast track, presidente, votacion, acuerdos, libre comercio Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"1933d067add74fa4a2bce4d5d278c79f\", \"time\": \"2015-06-25T06:37:39.572Z\" } Video ", "external_links": [], "published": "2015-06-24T03:00:00.000+03:00", "crawled": "2015-06-25T09:37:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}