{"organizations": [], "uuid": "418017eef6d88b6cdb7472d87dff16a829b26dce", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051115getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/243811-obama-lauds-senate-for-finally-passing-nsa-bill", "country": "US", "title": "Obama lauds Senate for 'finally' passing NSA bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama lauds Senate for 'finally' passing NSA bill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-03T00:29:00.000+03:00", "replies_count": 0, "uuid": "418017eef6d88b6cdb7472d87dff16a829b26dce"}, "author": "bgoad@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/243811-obama-lauds-senate-for-finally-passing-nsa-bill", "ord_in_thread": 0, "title": "Obama lauds Senate for 'finally' passing NSA bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama lauds Senate for 'finally' passing NSA bill By Jordan Fabian - 06/02/15 05:29 PM EDT \nPresident Obama on Tuesday thanked the Senate for “finally” passing a bill to reform the country’s surveillance laws after an impasse caused key provisions of the Patriot Act to lapse. Obama said he would sign the bill once it reaches his desk. “Glad the Senate finally passed the USA Freedom Act. It protects civil liberties and our national security. I'll sign it as soon as I get it,” Obama tweeted. ADVERTISEMENT The Senate voted 67-32 to pass the USA Freedom Act almost two days after the National Security Agency’s bulk phone data collection program was forced to shut down. Obama and administration officials had sharply criticized for failing to extend the surveillance authorities ahead of last Sunday’s deadline, saying it hampered national security investigations. For weeks, the president urged the Senate to pass the USA Freedom Act, which cleared the House with a bipartisan 338-88 vote. But the measure was opposed by Senate Majority Leader Mitch McConnell (R-Ky.), who feared it would weaken national security. The USA Freedom Act replaces the controversial NSA program that collected Americans’ phone records in bulk. It prevents the agency from storing the records and requires investigators to obtain them from phone companies. \nIn a statement, Obama slammed lawmakers for \"a needless delay and inexcusable lapse in important national security authorities.\" \nHe said his administration \"will work expeditiously\" to restore the expired surveillance programs \"to ensure our national security professionals again have the full set of vital tools they need to continue protecting the country.\" \nObama said the reforms \"will strengthen civil liberty safeguards and provide greater public confidence in these programs.\" \n- Updated at 6:26 p.m. Paul joins crusade to expose... The Bush administration blacked out 28 pages extracted from a... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-03T00:29:00.000+03:00", "crawled": "2015-06-03T03:48:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}