{"organizations": [], "uuid": "3d200384c7f9bd75dc3d37d4bc6a256f5120532b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaaddress0530.png", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/243990-obama-confident-fast-track-will-pass-the-house", "country": "US", "title": "Obama confident fast-track will pass the House", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama confident fast-track will pass the House", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T04:01:00.000+03:00", "replies_count": 0, "uuid": "3d200384c7f9bd75dc3d37d4bc6a256f5120532b"}, "author": "esmilowitz@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/finance/243990-obama-confident-fast-track-will-pass-the-house", "ord_in_thread": 0, "title": "Obama confident fast-track will pass the House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama confident fast-track will pass the House By Jordan Fabian - 06/03/15 09:01 PM EDT President Obama on Wednesday expressed confidence a key fast-track trade bill would pass the House, where it faces stiff resistance from members of his own party. “I’m pretty confident that we are going to be able to get this done,” Obama said during an interview with Seattle NBC affiliate KING. “I’ve never hypothesized that we’re not going to get this done, because it’s the right thing to do for the American people.” ADVERTISEMENT The president is using a series of media interviews to ramp up support for the fast-track measure ahead of a vote in the House as soon as next week. In addition to Seattle, Obama spoke with TV anchors from El Paso, Dallas, San Diego and Sacramento, all places represented by Democratic lawmakers who support the measure or have not yet decided how to vote. Obama is pressing Congress to grant him fast-track authority, which would pave the way for a sweeping 12-nation Pacific trade deal that is his top remaining legislative priority. A majority of Republicans are expected to back the measure. Some will not vote for it because they are reluctant to grant Obama more power. GOP leaders may need as many as two dozen Democratic votes for the bill to pass. Obama is aggressively courting Democratic lawmakers, but he faces a tough task because many are concerned new trade deals will ship American jobs overseas and undercut labor and environmental standards abroad. Obama conceded the Trans-Pacific Partnership agreement could hurt some in the U.S., but he said the benefits of breaking down trade barriers would provide an overall boon to the American economy and workers. “In an economy of this size, there’s always going to be some dislocations,” he told KING. Obama argued the economy could suffer in the long run if it does not open up Asian markets to American products. “What we’re arguing here is globalization is here to stay,” he added. “We’ve got to do everything we can to make sure that we are accessing markets the same way they are accessing ours and that there is a level playing field.” The president noted that Nike, which makes almost all of its goods overseas, has pledged to create 10,000 new high-skill manufacturing jobs in the United States if the trade deal goes through. “Nothing in this agreement is going to induce other companies to move jobs, in fact, what it may do is bring some jobs back,” he said. Obama said the labor and environmental standards in the deal has placed pressure on China, which has “ started putting out feelers ” about joining the pact. “The fact is that if we have 11 of the leading economies in the Asia-Pacific region … then China is going to have to at least take those international norms into account,” Obama said in an interview with NPR’s Marketplace. But Obama still faces an uphill battle in the House, where Democrats are feeling heavy pressure from labor unions to oppose the fast-track bill. “I take the president at his word that he believes … the argument he’s making, but I think he’s wrong,” Rep. David Cicilline (D-R.I.) said Wednesday. “It’s clear that this will, in the long term, not result in the growth of American jobs and an increase in wages,” he added. Just 16 Democrats have said they would vote for the measure, according to The Hill’s whip list , meaning Republicans would need more than 200 votes to pass the bill. Speaker John Boehner (R-Ohio) said Wednesday he does not yet have the votes on fast-track. “I don’t think we’re quite there yet,” he said in an interview with Fox News.", "external_links": [], "published": "2015-06-04T04:01:00.000+03:00", "crawled": "2015-06-04T11:35:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}