{"organizations": ["Supreme Court Won't Revive North Carolina Abortion Law Supreme Court"], "uuid": "f5d72ed4de7e47ac092164e732df7aff4d0b5417", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3073600/images/o-SUPREME-COURT-BUILDING-WASHINGTON-DC-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/15/supreme-court-abortion-law_n_7585250.html", "country": "", "title": "Supreme Court Won't Revive North Carolina Abortion Law", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Supreme Court Won't Revive North Carolina Abortion Law", "spam_score": 0.0, "site_type": "news", "published": "2015-06-15T17:11:00.000+03:00", "replies_count": 0, "uuid": "f5d72ed4de7e47ac092164e732df7aff4d0b5417"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/15/supreme-court-abortion-law_n_7585250.html", "ord_in_thread": 0, "title": "Supreme Court Won't Revive North Carolina Abortion Law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Supreme Court Won't Revive North Carolina Abortion Law Posted: reddit \nWASHINGTON (AP) — The Supreme Court on Monday rejected an appeal from North Carolina to revive a requirement that abortion providers show and describe an ultrasound to a pregnant woman before she has an abortion. \nThe justices left in place an appeals court decision that said the 2011 North Carolina law was \"ideological in intent\" and violated doctors' free-speech rights. \nThe North Carolina law would have required abortion providers to display and describe the ultrasound even if the woman refused to look and listen — a mandate that the court found particularly troublesome. \nNorth Carolina is among 23 states, mostly in the South and the Midwest, which passed laws dealing with the administration of ultrasounds by abortion providers, according to the Guttmacher Institute, a research institute that supports abortion-rights. \nJustice Antonin Scalia voted to hear the appeal. \nThe court took no action in a separate abortion case from Mississippi. The state is appealing a lower court ruling that effectively allowed Mississippi's lone abortion clinic to remain open and blocked a state law that would have required the clinic's doctors to have admitting privileges at a nearby hospital. \nA second appeals court ruling involving a Texas law imposing restrictions on abortion providers also is expected to make its way to the Supreme Court soon. In Texas, the appeals court upheld the admitting privileges requirement and other provisions that could force 11 clinics to close by July 1, lawyers for the clinics said in court papers. \nThe North Carolina case is Walker-McGill v. Stuart, 14-1172. Also on HuffPost:   Supreme Court Justice Antonin Scalia makes gestures as he speaks at the Northern Virginia Technology Council's (NVTC) Titans breakfast gathering in McLean, Va., Wednesday, Sept. 25, 2013. (AP Photo/Manuel Balce Ceneta) Supreme Court Justice Antonin Scalia speaks as part of a lecture series at Tufts University, Wednesday, Oct. 2, 2013, in Medford, Mass. (AP Photo/Josh Reynolds) In this Oct. 18, 2011 file photo, U.S. Supreme Court justice Antonin Scalia looks into the balcony before addressing the Chicago-Kent College Law justice in Chicago. (AP Photo/Charles Rex Arbogast, File) Supreme Court Justice Antonin Scalia speaks during a ceremony naming a courtroom at The John Marshall Law School after former Supreme Court Justice Arthur J. Goldberg Friday, Sept. 28, 2012 in Chicago. (AP Photo/M. Spencer Green) In this Oct. 18, 2011, file photo U.S. Supreme Court justice Antonin Scalia smiles during a college address in Chicago. (AP Photo/Charles Rex Arbogast, File) Supreme Court Justice Antonin Scalia is interviewed by The Associated Press, Thursday, July 26, 2012, at the Supreme Court in Washington. (AP Photo/Haraz N. Ghanbari) In this Oct. 6, 2011 file photo, Supreme Court Justice Antonin Scalia participates at the third annual Washington Ideas Forum at the Newseum in Washington. One never knows when the Supreme Court will hand down its last, often biggest, opinions of the term. (AP Photo/Manuel Balce Ceneta, File) Supreme Court Justice Antonin Scalia participates at the third annual Washington Ideas Forum at the Newseum in Washington Thursday Oct. 6, 2011. (AP Photo/Manuel Balce Ceneta) Supreme Court Justice Antonin Scalia testifies on Capitol Hill in Washington, Wednesday, Oct. 5, 2011, before the Senate Judiciary Committee hearing; \"Considering the Role of Judges Under the Constitution of the United States.\" (AP Photo/Evan Vucci) In this Sept. 29, 2009, Justice Antonin Scalia sits for a new group photograph at the Supreme Court in Washington. (AP Photo/Charles Dharapak, File) Supreme Court Justice Antonin Scalia testifies on Capitol Hill in Washington, Wednesday, Oct. 5, 2011, before the Senate Judiciary Committee hearing; \"Considering the Role of Judges Under the Constitution of the United States.\" (AP Photo/Evan Vucci Supreme Court Justice Antonin Scalia speaks as part of a lecture series at Tufts University, Wednesday, Oct. 2, 2013, in Medford, Mass. (AP Photo/Josh Reynolds)  Share ", "external_links": [], "published": "2015-06-15T17:11:00.000+03:00", "crawled": "2015-06-15T17:25:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}