{"organizations": [], "uuid": "b00da41851eeaf652fc478dd42c42edda6a3fad4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/Medical%20Marijuana.jpg", "site_section": "http://www.foxnews.com/health/index.html", "section_title": "Health News | Latest Medical, Fitness, Healthcare &amp; Nutrition News | Fox News", "url": "http://www.foxnews.com/health/2015/06/16/marijuana-dabbing-may-be-on-rise-report-finds/", "country": "US", "title": "Marijuana ‘dabbing’ may be on the rise, report finds", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Marijuana ‘dabbing’ may be on the rise, report finds | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "b00da41851eeaf652fc478dd42c42edda6a3fad4"}, "author": "Cari Nierenberg", "url": "http://www.foxnews.com/health/2015/06/16/marijuana-dabbing-may-be-on-rise-report-finds/", "ord_in_thread": 0, "title": "Marijuana ‘dabbing’ may be on the rise, report finds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Cari Nierenberg\nPublished June 16, 2015 Email Print\nYoung people who use marijuana and are looking for a new way to get high may be increasingly turning to \"dabbing,\" a new paper suggests.\nDabbing is inhaling the vapors from a concentrated form of marijuana made by an extraction method that uses butane gas. Dabs, also known as butane hash oil (BHO) — which are sometimes called \"budder,\" \"honeycomb\" or \"earwax\" — are more potent than conventional forms of marijuana because they have much higher concentrations of the psychoactive chemical tetrahydrocannabinol, or THC, than is found in regular cannabis, according to the paper.\n\"We have been seeing an emergence of dabs over the last three years,\" said John Stogner, co-author of the new paper and an assistant professor of criminal justice and criminology at the University of North Carolina at Charlotte. \"It is really exploding onto the drug-use scene.\"\nSome substance users are drawn to whatever the newest trend may be. But besides novelty, the appeal of dabbing is that it's considered \"a stronger, faster high,\" said Stogner, who studies emerging drug-use trends.\n\"At a minimum, dabs are four times as strong as a joint, and the high is administered all at once,\" he said.\nIn the paper, published online today (June 15) in the journal Pediatrics, the authors discuss this emerging trend.\nThere are no firm numbers on how common the practice of dabbing is, Stogner told Live Science. In states where marijuana is legal, some surveys of regular marijuana users suggest many of them may have tried it at least once, he said. [ 11 Odd Facts About Marijuana ]\nAlthough estimates of dabbing's popularity are lacking, Stogner suspects the people experimenting with it may likely mirror the age range and demographic breakdown associated with marijuana use.\nAmateur production\nDabbing isn't new. It's been around since the 1970s and has been done by a small number of people in the drug-use community, Stogner noted. But in recent years, dabbing has made the move from obscurity to the general drug-using population.\nStogner said dabbing's rise in popularity can be attributed to the commercial development of medical marijuana and the legalization of pot in a few states. Both of these factors have facilitated the spread of information about dabbing on social media and in instructional videos on YouTube, he said.\nIn states with medical-marijuana laws or where marijuana is legal, it's possible to purchase butane hash oil extracts, which have been made in a commercial process where butane — a flammable and volatile gas — can be properly ventilated.\nWhen recreational users attempt to create dabs at home, in a process known as \"blasting,\" the safety risks are \"comparable to those of manufacturing methamphetamine,\" the paper's authors wrote.\nDabs are made by pouring butane over marijuana, which allows THC to leave the plant material and dissolve into the butane. The butane-THC solution is then pressed through the filter and is placed in a dish or tray.\nThe remaining gummy, solid product is high in THC (concentrations may approach 80 percent), and does not contain much else, Stogner said. People often use modified water pipes (bongs) to smoke the dab, but dabs can also be put into an e-cigarette and be vaped.\nSmall fires, explosions and burns can result when amateur \"blasters\" use butane in their garages or kitchens, Stogner warned.\nHe also said there is not a good understanding of the health effects and physiological risks associated with dabbing because there haven't been good studies of this method of using marijuana.\nIn the only previously published study of dabbing — a survey of about 350 frequent marijuana users — researchers found that the users viewed dabbing as more dangerous than other forms of cannabis use because they reported it led to a higher tolerance for the drug and worse withdrawal symptoms, suggesting a possibility of addiction or dependence, the researchers noted.\n\"It's dangerous to assume the risks of dabbing are akin to [those of] smoking marijuana,\" Stogner said.\nAlthough dabbing has become popular only recently, and research on the practice is limited, it would be a mistake for parents and kids to assume dabbing is not more worrisome or worse than smoking flower cannabis, Stogner said.\n3 New Dangerous Drug Habits in Teens Where Americans Smoke and Grow Marijuana (Maps) The Drug Talk: 7 New Tips for Today's Parents Copyright 2015 LiveScience , a Purch company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\n ", "external_links": ["http://www.livescience.com/", "http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffoxnewshealth&width&layout=button_count&action=like&show_faces=true&share=false&height=21", "http://www.livescience.com/48246-odd-facts-marijuana.html", "http://www.livescience.com/18539-3-dangerous-drug-habits-teens.html", "http://www.livescience.com/36148-talk-kids-drugs-alcohol-tips.html", "http://www.livescience.com/48606-marijuana-maps-of-united-states.html", "http://www.cancercenter.com/", "http://global.fncstatic.com/static/managed/img/share/source/live-science.png"], "published": "2015-06-16T03:00:00.000+03:00", "crawled": "2015-06-16T18:18:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}