{"organizations": [], "uuid": "fbd30b649a05c433ec7e586c3c5d0327d25408d7", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/hillary-clinton/feed", "section_title": "Hillary Clinton on Huffington Post", "url": "http://www.huffingtonpost.com/david-dent/bernie-in-bushobama-america-a-movement-or-a-candidate_b_7671938.html", "country": "US", "title": "David Dent: Bernie in Bush-Obama America: A Movement or a Candidate?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "David Dent: Bernie in Bush-Obama America: A Movement or a Candidate?", "spam_score": 0.0, "site_type": "news", "published": "2015-06-29T15:30:00.000+03:00", "replies_count": 0, "uuid": "fbd30b649a05c433ec7e586c3c5d0327d25408d7"}, "author": "David Dent", "url": "http://www.huffingtonpost.com/david-dent/bernie-in-bushobama-america-a-movement-or-a-candidate_b_7671938.html", "ord_in_thread": 0, "title": "David Dent: Bernie in Bush-Obama America: A Movement or a Candidate?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nBarack Obama poked good humor at some of those extreme conservative perceptions of his presidency at the White House Correspondents Dinner last month. In doing so, he threw a bit of the spotlight on Bernie Sanders. \"I like Bernie. Bernie's an interesting guy. Apparently, some folks want to see a pot-smoking socialist in the White House. We could get a third Obama term after all.\" \nJokes aside, Bernie Sanders clearly distinguished himself from Obama when I spoke to the candidate after a campaign appearance at the UAW Hall in Marshall, an Iowa Bush-Obama county. \"Well, I think the difference between me and Obama is that I would mobilize the grassroots of this country to stand with us on a progressive agenda. In other words, the mistake I think the president made is that after running a brilliant campaign in 2008 he, in a significant way, severed his ties with his base.\" \nSanders said, unlike Obama, he will \"take on the big money interests\" by mobilizing millions of people who will also be prepared to throw people out of congress who are voting against working families.\" For now, another more immediate challenge haunts the dreams of Bernie. He must convince voters that he can actually achieve what Obama's brilliance delivered-victorious campaigns. Even with surges in some polls, doubt is a big enemy confronting Sanders. In Iowa and New Hampshire, some strong Sanders supporters worry that Bernie could not win in a general election. And anyone who loves Bernie probably trembles at the thought of any current names on the Republican roster in the White House. \n\"The candidates coming up in the Republican side are kind of frightening,\" says Jane Gallagher, who owns Grove and Main Antique Shop in downtown Peterborough, New Hampshire. Peterborough is home to the MacDowell Colony, the idyllic place where Thornton Wilder wrote \"Our Town\" in 1937. It is also in Hillsborough County, a swing Bush-Obama county. So candidate appearances are common. \"It's exciting and incredibly annoying at the same time,\" says Gallagher. \"I love to have Bernie Sanders, you know, my guys, come through. But, all the others come through and they're just annoying...I support almost everything Bernie Sanders has to say. And, I hope that he can go all the way. My fear is the electability issue of Bernie in other parts of the country, I think he probably is easier to take in the Northeast because that's where he's from. They're a little bit more free thinking. But it's other parts of the country. And it wouldn't hurt me if Hillary got it.\" \nHillary Clinton would hug those words if she could. Her mission to avoid hurting Bernie-lovers absorbs her campaign rhetoric, which matches the likes of Elizabeth Warren these days. She learned a lesson in 2008. She knows that she must prevent Sanders from growing into anything like the Obama 2008 formula that crumbled the inevitability of her Democratic throne. At the moment, the thought of a socialist taking her down is far fetched-as crazy as the idea of someone with the middle name of, say, Hussein taking her down. Yet Bernie is drawing huge crowds and cheers in Iowa and New Hampshire. \nThe Iowa Caucuses are six months away and, at this comparable moment in the 2008 campaign, Hillary Clinton's path to the Democratic nomination looked unstoppable. From Politico on June 14, 2007: \n\"Support from women is propelling Hillary Rodham Clinton (D-N.Y.) ahead of her Democratic challengers and positioning her as the most likely candidate to win the nomination, according to new polling analyses. \n\"In a show of strength against Sen. Barack Obama (D-Ill.), Clinton holds a lead even among minority women of more than 25 percentage points, according to surveys by Zogby International and The Pew Research Center for the People and the Press.\" \nAt the time, there appeared to be so many odds against the black junior senator from Illinois. A New York Times headline even asked: \"Will There Be an Obama Effect? \" The article examined if Obama would suffer the fate of many black candidates who appear stronger in polls because whites fear offending telephone poll interviewers by saying they will not vote for a black candidate. \"In high-profile contests where one of the major party candidates is black, pre-election telephone polls have often been wrong, overstating the strength of the black candidate. In polling circles this is known as the \"Bradley effect\" or the \"Wilder effect\" or the \"Dinkins effect.\" Will it also be known as the Obama effect?\" \nIowa State Senator Steve Sodders worried about Obama's candidacy in the context of race in 2008. \"Iowa is 3 percent black,\" says Sodders, who chaired the Marshall County Democratic Party when Obama made his first campaign stop in Marshall County. \"In fact, we have more Hispanics now. We're at 6 percent Hispanic in Iowa, 3 percent black. So at first, kinda in the back of my mind you think about the racism...But overall, I just didn't see that race could hurt the campaign. . It just didn't enter. After a while I was just like, 'That's not going to stop him.' I didn't get the feeling at all that his skin color was going to stop him from getting the nomination and winning.\" \nObama visited the same UAW hall where Sodders warmed up the crowd for Sanders a couple of weeks ago. Sodders did not decide to caucus for Obama until a month before the election. He has yet to commit to caucus for anyone in January. For now, he is doing what many Iowans love to do-enjoy the attention of the candidates. \"Huckabee has been here, Santorum's been here. Romney came here a few times. McCain came here back when. The main candidates do come to Marshall County at some point. That's maybe another beautiful part about being a purple county in Iowa. They all come. You're going to get a chance to meet the next president at some point because they are going to come here.\" \nSodders says Clinton's biggest liability in Iowa in 2008 was the belief in her inevitability as the nominee. \"Iowans don't like to be told who is going to win. Everyone said she had it from the get-go and I think voters don't like that. Don't tell us who's gonna win, that's up to us. I think a little bit of that hurt her- the notion that she was going to win.\" \nWhether they like Obama or not, Iowans, like Sodders, take pride when an underdog wins the caucus and goes onto become president. By the time Obama won the South Carolina primary a couple of weeks after Iowa, Bill Clinton desperately tried to help his wife by reducing Obama to a movement similar to a \"Run Jesse Run\" thing. \"Jesse Jackson won South Carolina in the 2004 and 2008 campaigns,\" Clinton said, a comparison that angered Obama supporters. \nPoor Clintons. They could not turn Obama's campaign into a mere movement of black pride. Here's the more contemporary question: Can Sanders truly go Barack on Hillary? To do so, he must avoid the trap of running an electrifying yet losing campaign similar to Jesse Jackson's historic runs. He must bring his campaign beyond a cause and become a candidate that can win. \nFollow David Dent on Twitter: www.twitter.com/bushobamausa More:", "external_links": [], "published": "2015-06-29T15:30:00.000+03:00", "crawled": "2015-06-29T19:36:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}