{"organizations": [], "uuid": "459b52f493e4eb26a517404f4b8a6da743a62645", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3107080/images/o-OBAMA-RAMADAN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/23/obama-white-house-ramadan_n_7644614.html", "country": "", "title": "President Obama Hosts Ramadan Iftar Dinner For Muslim Americans At The White House", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "President Obama Hosts Ramadan Iftar Dinner For Muslim Americans At The White House", "spam_score": 0.0, "site_type": "news", "published": "2015-06-23T17:56:00.000+03:00", "replies_count": 0, "uuid": "459b52f493e4eb26a517404f4b8a6da743a62645"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/23/obama-white-house-ramadan_n_7644614.html", "ord_in_thread": 0, "title": "President Obama Hosts Ramadan Iftar Dinner For Muslim Americans At The White House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama Hosts Ramadan Iftar Dinner For Muslim Americans At The White House The Associated Press | By DEB RIECHMANN Posted: Updated: 34 minutes ago US President Barack Obama talks to a guest during an Iftar dinner celebrating Ramadan in the State Dining Room at the White House in Washington, DC on June 22, 2015. AFP PHOTO/YURI GRIPAS (Photo credit should read YURI GRIPAS/AFP/Getty Images) | YURI GRIPAS via Getty Images reddit \nWASHINGTON (AP) — President Barack Obama said Monday that Americans stand united in rejecting the targeting of any religious or ethnic group as he marked Islam's holy month of Ramadan. \nObama opened the White House to Muslim Americans for a traditional iftar dinner, which follows daily fasting from dawn to sunset. Ramadan ends with the Islamic holiday of Eid al-Fitr. \n\"We affirm that whatever our faith, we're all one family,\" Obama said at the East Room dinner attended by about 40 members of the diplomatic community and a few members of Congress. \nHe recognized several young dinner guests, including Samantha Elauf, who went to the Supreme Court to defend her right to wear a headscarf, or hijab. She was 17 in 2008 when she was rejected for a sales job at an Abercrombie Kids store in Tulsa, Oklahoma, after wearing a hijab to the interview. \n\"She was determined to defend the right to wear a hijab — to have the same opportunities as everybody else,\" Obama said. \"She went all the way to the Supreme Court — which I didn't do at her age — and she won.\" \nObama spoke of three young Muslims who were killed Feb. 10 in Chapel Hill, North Carolina, and the nine black church members killed last week in Charleston, South Carolina. \n\"As Americans, we insist that nobody should be targeted because of who they are, what they look like, who they love, how they worship,\" he said. \"We stand united against these hateful acts.\" \nLISTEN: Imam Khalid Latif talks about The Heart of Ramadan Also on The Huffington Post Close Ramadan Around The World 2015 of   WASHINGTON, DC - JUNE 22: U.S. President Barack Obama speaks at the annual Iftar dinner celebrating the Muslim holy month of Ramadan in the East Room of the White House July 22, 2015 in Washington, DC. (Photo by Olivier Douliery-Pool/Getty Images) President Barack Obama, left, greets guests after delivering remarks during the annual Iftar dinner, celebrating the Muslim holy month of Ramadan, in the East Room of the White House, Monday, June 22, 2015, in Washington. (AP Photo/Evan Vucci) President Barack Obama greets guests after delivering remarks during the annual Iftar dinner, celebrating the Muslim holy month of Ramadan, in the East Room of the White House, on Monday, June 22, 2015, in Washington. (AP Photo/Evan Vucci) US President Barack Obama talks to guests during an Iftar dinner celebrating Ramadan in the State Dining Room at the White House in Washington, DC on June 22, 2015. AFP PHOTO/YURI GRIPAS (Photo credit should read YURI GRIPAS/AFP/Getty Images) President Barack Obama delivers remarks during the annual Iftar dinner, celebrating the Muslim holy month of Ramadan, in the East Room of the White House, Monday, June 22, 2015, in Washington. (AP Photo/Evan Vucci) Indian Muslim women pray in the compound of Jama Masjid on the first day of the holy month of Ramadan in New Delhi, India, Friday, June 19, 2015. Muslims throughout the world are marking the month of Ramadan, the holiest month in the Islamic calendar during which devotees fast from dawn till dusk. (AP Photo/Altaf Qadri) Kashmiri Muslim women pray outside Shah Hamadan Shrine on the first day of the holy month of Ramadan in Srinagar, Indian controlled Kashmir, Friday, June 19, 2015. Muslims throughout the world are marking the month of Ramadan, the holiest month in the Islamic calendar during which devotees fast from dawn till dusk. (AP Photo/Dar Yasin) Pakistani Muslims attend Friday prayers during Ramadan in Badshahi mosque Lahore, Pakistan, Friday, June 19, 2015. Muslims around the globe are observing the holy fasting month of Ramadan where they refrain from drinking, eating, smoking and sex from dawn to dusk. (AP Photo/K.M. Chaudary) An Indian worker dries Seviiyan (thin vermicelli) which is used for the preparation of 'sheerkhorma', a traditional sweet dish prepared by the Muslim community during the holy month of Ramadan, at a food factory in Hyderabad on June 23, 2015. Muslims around the world are celebrating Eid al-Fitr marking the end of the holy month of Ramadan during which followers are required to abstain from food, drink and sex from dawn to dusk. AFP PHOTO/NOAH SEELAM (Photo credit should read NOAH SEELAM/AFP/Getty Images) Two Indonesian Muslim men rest while taking part in Ramadan at the Istiqlal mosque in Jakarta on June 23, 2015. More than 1.5 billion Muslims around the world are marking the month, during which believers abstain from eating, drinking, smoking and having sex from dawn until sunset. AFP PHOTO / ADEK BERRY (Photo credit should read ADEK BERRY/AFP/Getty Images) An Iraqi Muslim counts prayer beads, during Muslim holy month of Ramadan, at the shrine of the Sunni Sheikh Abdul Qadir al-Jilani in central Baghdad on June 23, 2015. AFP PHOTO/AHMAD AL-RUBAYE (Photo credit should read AHMAD AL-RUBAYE/AFP/Getty Images) An Iraqi Muslim rests, during Muslim holy month of Ramadan, at the shrine of the Sunni Sheikh Abdul Qadir al-Jilani in central Baghdad on June 23, 2015. AFP PHOTO/AHMAD AL-RUBAYE (Photo credit should read AHMAD AL-RUBAYE/AFP/Getty Images) A Pakistani Muslim prays after breaking fast during Ramadan in the Grand Faisal mosque in Islamabad, Pakistan, Monday, June 22, 2015. Devout Muslims around the globe are observing the holy fasting month of Ramadan, when they refrain from drinking, eating, smoking and sex, from dawn to dusk. (AP Photo/Anjum Naveed) Pakistani Muslims leave the Grand Faisal mosque after breaking fast and offering evening prayers during Ramadan in Islamabad, Pakistan, Monday, June 22, 2015. Devout Muslims around the globe are observing the holy fasting month of Ramadan, when they refrain from drinking, eating, smoking and sex, from dawn to dusk. (AP Photo/Anjum Naveed) A Malaysian Muslim man recites the Holy Quran, before the Zohar prayers at a mosque during Islam's holy month of Ramadan, in Putrajaya, Malaysia on Tuesday, June 23, 2015. During Ramadan, Muslims refrain from eating, drinking, smoking and sex from dawn to dusk. (AP Photo/Joshua Paul) Iraqi women and children, most of them refugees, wait for free food being distributed for Iftar, the meal after fasting, at the Abdul Khader al-Kilani mosque in Baghdad, Iraq, Tuesday, June 23, 2015. Muslims throughout the world are marking Ramadan - a month of fasting during which the observants abstain from food, drink and other pleasures from sunrise to sunset. (AP Photo/ Karim Kadim) Indian Muslim devotees offer Friday prayers at the Vasi Ullah mosque on the first Friday of Ramadan in Allahabad on June 19, 2015. Islam's holy month of Ramadan is celebrated by Muslims worldwide marked by fasting, abstaining from foods, sex and smoking from dawn to dusk for soul cleansing and strengthening the spiritual bond between them and the Almighty. AFP PHOTO/ SANJAY KANOJIA (Photo credit should read Sanjay Kanojia/AFP/Getty Images) Kashmiri muslim family members look on during the first day of the holy month of Ramadan at the Shah-i-Hamdaan shrine in downtown Srinagar on June 19, 2015. Across the Muslim world, the faithful fast from dawn to dusk, and abstain from eating, drinking, smoking and having sex during that time as they strive to be more pious and charitable. AFP PHOTO / Tauseef MUSTAFA (Photo credit should read TAUSEEF MUSTAFA/AFP/Getty Images) An Indian Muslim youth prepares food prior to breaking fast on the first day of the Islamic holy month of Ramadan at Mecca Masjid in Hyderabad on June 19, 2015. Like millions of Muslim around the world, Indian Muslims celebrate the month of Ramadan by abstaining from eating, drinking, and smoking as well as sexual activities from dawn to dusk. AFPHOTO/ Noah SEELAM (Photo credit should read NOAH SEELAM/AFP/Getty Images) Indian Muslims offer prayers prior to breaking their fast on the first day of the Islamic holy month of Ramadan at Mecca Masjid in Hyderabad on June 19, 2015. Like millions of Muslim around the world, Indian Muslims celebrate the month of Ramadan by abstaining from eating, drinking, and smoking as well as sexual activities from dawn to dusk. AFPHOTO/ Noah SEELAM (Photo credit should read NOAH SEELAM/AFP/Getty Images) LONDON, ENGLAND - JUNE 19: A man carries out Wudu, a washing procedure in preparation for prayer, at the East London Mosque before the first Friday prayers of the Islamic holy month of Ramadan on June 19, 2015 in London, England. Muslim men and women across the world began to observe Ramadan, a month long celebration of self-purification and restraint, earlier this week. During Ramadan the Muslim abstain from eating, drinking, smoking and having sex between sunrise and sunset, breaking their fast with an Iftar meal after sunset. (Photo by Rob Stothard/Getty Images) A migrant reads the holy Coran on the rocky beach at the Franco-Italian border in Ventimiglia, Italy, during the holy month of Ramadan,Thursday, June 18, 2015. European Union nations failed to bridge differences Tuesday over an emergency plan to share the burden of the thousands of refugees crossing the Mediterranean Sea, while on the French-Italian border, police in riot gear forcibly removed dozens of migrants. (AP Photo/Lionel Cironneau) Bosnian Muslims offer a prayer during late night prayer for upcoming holy month of Ramadan, inside memorial room for Srebrenica massacre victims, at the memorial center Potocari, near Srebrenica, northeast of the Bosnian capital of Sarajevo on Wednesday, June, 17, 2015. Family members of the Srebrenica victims killed in July, 1995, will mark the first night of Ramadan at the memorial center Potocari, in front of the graves of killed Muslims from this small Bosnian town. Ramadan celebrations in Srebrenica are unlike anywhere else in the world. This is the only place where the living join the dead in prayer. Emotional evening ahead of first day of Ramadan gathers all Muslim returnees at the graveyard, paying respects to their dearest as the fasting begins. (AP Photo/Amel Emric) Indonesian Muslim men take a nap as they wait for the time to break during the first day of the fasting month of Ramadan at a Mosque on the outskirts of Jakarta, Indonesia, Thursday, June 18, 2015. During Ramadan, the holiest month in Islamic calendar, Muslims refrain from eating, drinking, smoking and sex from dawn till dusk. (AP Photo/Tatan Syuflana) Malaysian Muslim breaking their fast on the first day of the holy Islamic month of Ramadan in Kuala Lumpur, Malaysia, on Thursday, June 18, 2015. During Ramadhan, Muslims are called to practice more actively the dictates of their faith such as tolerance, patience and an increase in works of charity. (AP Photo/Vincent Thian) People break their fast backdroped by the Byzantine-era Hagia Sophia, in the historic Sultanahmet district of Istanbul, Turkey, Thursday, June 18, 2015 on the first day of the fasting month of Ramadan. Muslims throughout the world are marking Ramadan - a month of fasting during which the observants abstain from food, drink and other pleasures from sunrise to sunset. After an obligatory sunset prayer, a large feast known as 'iftar' is shared with family and friends. (AP Photo/Emrah Gurel) Afghan boys read the Quran during the Muslim holy month of Ramadan at a mosque in Kabul, Afghanistan, Friday, June 19, 2015. Muslims throughout the world are marking the month of Ramadan, the holiest month in the Islamic calendar during which devotees fast from dawn till dusk. (AP Photo/Rahmat Gul) A Pakistani Muslim woman holds her child during Friday prayers at the Badshahi mosque in Lahore, Pakistan, June 19, 2015. Muslims around the globe are observing the holy fasting month of Ramadan where they refrain from drinking, eating, smoking and sex from dawn to dusk. (AP Photo/K.M. Chaudary) Muslim devotees ready to break their fast during the holy month of Ramadan on June 19, 2015 in the Omani capital Muscat. More than 1.5 billion Muslims around the world will mark the month, during which believers abstain from eating, drinking, smoking and having sex from dawn until sunset. AFP PHOTO / MOHAMMED MAHJOUB (Photo credit should read MOHAMMED MAHJOUB/AFP/Getty Images) Pakistani Muslim devotees pray before breaking their fast during the Muslim fasting month of Ramadan in Karachi on June 19, 2015. Islam's holy month of Ramadan is celebrated by Muslims worldwide and implies fasting, abstaining from foods, sex and smoking from dawn to dusk. AFP PHOTO / RIZWAN TABASSUM (Photo credit should read RIZWAN TABASSUM/AFP/Getty Images) A Pakistani baker prepares sweet 'Jalebi' for Iftar during the Muslim fasting month of Ramadan in Islamabad on June 19, 2015. Islam's holy month of Ramadan is celebrated by Muslims worldwide and implies fasting, abstaining from foods, sex and smoking from dawn to dusk. AFP PHOTO / AAMIR QURESHI (Photo credit should read AAMIR QURESHI/AFP/Getty Images) Muslim men leave after praying to mark the holy month of Ramadan at Jimeta Central Mosque in Yola, Adamawa state, in northeast Nigeria, on June 19, 2015. Tens of millions across the Muslim world fast from dawn to dusk and strive to be more pious and charitable during the month, which ends with the Eid holiday. AFP PHOTO / PIUS UTOMI EKPEI (Photo credit should read PIUS UTOMI EKPEI/AFP/Getty Images) Kashmiri Muslim women pray outside Shah Hamadan Shrine on the first day of the holy month of Ramadan in Srinagar, Indian controlled Kashmir, Friday, June 19, 2015. Muslims throughout the world are marking the month of Ramadan, the holiest month in the Islamic calendar during which devotees fast from dawn till dusk. (AP Photo/Dar Yasin) A Kashmiri Muslim girl watches as her mother, left, and sister, right, offer prayers outside Shah Hamadan Shrine on the first day of the holy month of Ramadan in Srinagar, Indian controlled Kashmir, Friday, June 19, 2015. Muslims throughout the world are marking the month of Ramadan, the holiest month in the Islamic calendar during which devotees fast from dawn till dusk. (AP Photo/Dar Yasin) Pakistani Muslims attend Friday prayers during Ramadan in Badshahi mosque Lahore, Pakistan, Friday, June 19, 2015. Muslims around the globe are observing the holy fasting month of Ramadan where they refrain from drinking, eating, smoking and sex from dawn to dusk. (AP Photo/K.M. Chaudary) A worshipper rests on the ground holding the Quran, Islam's holy book, as he waits for the afternoon prayer at al-Azhar mosque during the Muslim holy month of Ramadan, in Cairo, Egypt, Friday, June 19, 2015. (AP Photo/Hassan Ammar) A Muslim worshipper rests on the ground as he waits for the afternoon prayer at Al-Azhar mosque during the Muslim holy month of Ramadan, in Cairo, Egypt, Friday, June 19, 2015. (AP Photo/Hassan Ammar) A Pakistani volunteer arranges food to distribute among poor people for iftar, the first meal to break the fast, during Ramadan in Islamabad, Pakistan, Friday, June 19, 2015. Muslims throughout the world are marking Ramadan - a month of fasting during which the observants abstain from food, drink and other pleasures from sunrise to sunset. Ramadan is meant to be a time of reflection and worship, remembering the hardships of others and being charitable. (AP Photo/B.K. Bangash) Afghan villagers hold out their plates for food donated by other villagers as they prepare to break their fast during the holy month of Ramadan in Kabul, Afghanistan, Friday, June 19, 2015. Muslims throughout the world are marking the month of Ramadan, the holiest month in the Islamic calendar during which devotees fast from dawn till dusk. (AP Photo/Rahmat Gul) Preparations are in progress for the upcoming Ramadan at the 17th century Badshahi mosque in Lahore, Pakistan, Wednesday, June 17, 2015. Muslims throughout the world mark the month of Ramadan, the holiest month in the Islamic calendar, with dawn to dusk fasting. (AP Photo/K.M. Chaudary) A Pakistani vendor waits for customers to sell caps in Karachi, Pakistan, Wednesday, June 17, 2015. Muslims throughout the world mark the month of Ramadan, the holiest month in the Islamic calendar, with dawn to dusk fasting. It is customary in some countries to wear caps when offering prayers in mosques. (AP Photo/Shakil Adil) Pakistani clerics offer evening prayers during a moon sighting event for Ramadan in Karachi, Pakistan, Wednesday, June 17, 2015. Muslims throughout the world mark the month of Ramadan, the holiest month in the Islamic calendar, with dawn to dusk fasting. (AP Photo/Fareed Khan) Pakistanis clean walls of Sunehri mosque as preparations for the upcoming Ramadan in Peshawar, Pakistan, Wednesday, June 17, 2015. Muslims throughout the world mark the month of Ramadan, the holiest month in the Islamic calendar, with dawn to dusk fasting. (AP Photo/Muhammad Sajjad) A vendor arranges praying beads for worshippers getting new ones for the Islamic holy month of Ramadan in Peshawar, Pakistan, Wednesday, June 17, 2015. Muslims throughout the world mark the month of Ramadan, the holiest month in the Islamic calendar, with dawn to dusk fasting. (AP Photo/Muhammad Sajjad) Pakistanis clean a carpet in Sunehri mosque as preparations for the upcoming Ramadan in Peshawar, Pakistan, Wednesday, June 17, 2015. Muslims throughout the world mark the month of Ramadan, the holiest month in the Islamic calendar, with dawn to dusk fasting. (AP Photo/Muhammad Sajjad) In this Tuesday June 16, 2015 photo, a boy looks into a telescope during a moon sighting event on top of Jebel Hafeet mountain ahead of the holy month of Ramadan in Al Ain, United Arab Emirates. The sighting of the new moon marks the beginning of Ramadan. (AP Photo/Kamran Jebreili) In this Tuesday, June 16, 2015 photo, a father holds his girls as one of them looks into a telescope during a moon sighting event on top of Jebel Hafeet mountain ahead of the holy month of Ramadan, in Al Ain, United Arab Emirates. The sighting of the new moon marks the beginning of Ramadan. (AP Photo/Kamran Jebreili) A Pakistani Muslim reads the Quran ahead of Ramadan at the 17th century Badshahi mosque in Lahore, Pakistan, Wednesday, June 17, 2015. Muslims throughout the world mark the month of Ramadan, the holiest month in the Islamic calendar, with dawn to dusk fasting. (AP Photo/K.M. Chaudary) Indonesia Muslims perform an evening prayer called 'tarawih' marking the first eve of the holy fasting month of Ramadan on a pedestrian bridge in Jakarta, Wednesday, June 17, 2015. During Ramadan, the holiest month in Islamic calendar, Muslims refrain from eating, drinking, smoking and sex from dawn to dusk.(AP Photo/Achmad Ibrahim) A young girl plays during an evening prayer called \"tarawih\" marking the first eve of the holy fasting month of Ramadan at Istiqlal Mosque in Jakarta, Indonesia, Wednesday, June 17, 2015. During Ramadan, the holiest month in Islamic calendar, Muslims refrain from eating, drinking, smoking and sex from dawn to dusk.(AP Photo/Dita Alangkara) Indonesian Muslims offer an evening prayer called \"tarawih\" marking the first eve of the holy fasting month of Ramadan at Istiqlal Mosque in Jakarta, Indonesia, Wednesday, June 17, 2015. During Ramadan, the holiest month in Islamic calendar, Muslims refrain from eating, drinking, smoking and sex from dawn to dusk.(AP Photo/Dita Alangkara) Indonesian Muslim children carry torches during a parade marking Ramadan in Jakarta, Indonesia, Tuesday, June 16, 2015. Ramadan, the holy fasting month, is expected to begin on Thursday June, 18. Indonesia is the world's most populous Muslim nation.(AP Photo/Achmad Ibrahim) A Pakistani baker fries vermicelli to customers in preparation for the Muslim fasting month of Ramadan in Rawalpindi on June 17, 2015. More than 1.5 billion Muslims around the world will mark the month, during which believers abstain from eating, drinking, smoking and having sex from dawn until sunset. AFP PHOTO/ Aamir QURESHI (Photo credit should read AAMIR QURESHI/AFP/Getty Images) People take part in a parade to mark the Muslim holy fasting month of Ramadan in Malang, eastern Java island, on June 17, 2015. More than 1,5 billion Muslims around the world will mark the month, during which believers abstain from eating, drinking, smoking and having sex from dawn until sunset. AFP PHOTO / AMAN ROCHMAN (Photo credit should read AMAN ROCHMAN/AFP/Getty Images) SURABAYA, INDONESIA - JUNE 17: A florist sells floral offerings for visitors making pilgrimages to the graves of family members as Indonesian Muslims begin fasting for Ramadan on June 17, 2015 in Surabaya, Indonesia. Muslims worldwide observe Ramadan, the ninth month of the Islamic calendar which is marked by a holy month of fasting, prayer, and recitation of the Quran. (Photo by Robertus Pudyanto/Getty Images) A man walks on June 17, 2015 in a room of the Grand Mosque in Paris, on the eve of the start of the Muslim holy fasting month of Ramadan. More than 1.5 billion Muslims around the world will mark the month, during which believers abstain from eating, drinking, smoking and having sex from dawn until sunset. AFP PHOTO / JOEL SAGET (Photo credit should read JOEL SAGET/AFP/Getty Images) A Palestinian vendor displays traditional lanterns known in Arabic as 'Fanous' sold during the Muslim holy month of Ramadan at a market in Gaza City, on June 17, 2015, as the faithful prepare to start fasting. More than 1.5 billion Muslims around the world will mark the month, during which believers abstain from eating, drinking, smoking and having sex from dawn until sunset. AFP PHOTO / MAHMUD HAMS (Photo credit should read MAHMUD HAMS/AFP/Getty Images) A Palestinian woman shops at a market in Gaza City as the faithful prepare for the start of the Muslim holy fasting month of Ramadan on June 17, 2015. More than 1.5 billion Muslims around the world will mark the month, during which believers abstain from eating, drinking, smoking and having sex from dawn until sunset. AFP PHOTO / MAHMUD HAMS (Photo credit should read MAHMUD HAMS/AFP/Getty Images) Indonesian people offer prayers at a cemetery ahead of the holy Muslim month of Ramadan in Jakarta on June 17, 2015. Indonesia, the world's most populous Muslim-majority country, will start Ramadan on June 18. AFP PHOTO / ADEK BERRY (Photo credit should read ADEK BERRY/AFP/Getty Images)  Share ", "external_links": [], "published": "2015-06-23T17:56:00.000+03:00", "crawled": "2015-06-23T18:35:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}