{"organizations": ["Fox News Latino Charleston", "Fox News Latino State", "Statehouse"], "uuid": "b7225e587bd9d065e5501396fab16bf5adc9bbe2", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/APTOPIX%20Charleston%20Sh_Garc.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/18/charleston-shooting-obama-shares-deep-sorrow-presidential-candidates-cancel/", "country": "", "title": "Charleston shooting: Obama shares ‘deep sorrow’; presidential candidates cancel South Carolina stops | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Charleston shooting: Obama shares ‘deep sorrow’; presidential candidates cancel South Carolina stops | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "b7225e587bd9d065e5501396fab16bf5adc9bbe2"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/18/charleston-shooting-obama-shares-deep-sorrow-presidential-candidates-cancel/", "ord_in_thread": 0, "title": "Charleston shooting: Obama shares ‘deep sorrow’; presidential candidates cancel South Carolina stops | Fox News Latino", "locations": ["S.C.", "South Carolina", "Columbia", "Charleston"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ehrhardt", "Vincent Sheheen", "Pinckney", "Clementa Pinckney", "Obama"], "text": "Charleston shooting: Obama shares ‘deep sorrow’; presidential candidates cancel South Carolina stops Published June 18, 2015 Fox News Latino State Senator Vincent Sheheen (D-Kershaw) gets emtional as he sits next to the draped desk of state Sen. Clementa Pinckney, Thursday, June 18, 2015, at the Statehouse in Columbia, S.C. Pinckney was one of those killed, Wednesday night in a shooting at the Emanuel AME Church in Charleston. (AP Photo/Rainier Ehrhardt) \nPresident Barack Obama delivered somber remarks Thursday alongside Vice President Joe Biden, expressing his “deep sorrow” following the fatal shooting of nine people at a historic black church in downtown Charleston, South Carolina. \n“To say our thoughts and prayers are with them doesn't say enough to convey the heartache and sadness and the anger that we feel,” Obama said. “There is something particularly heartbreaking about death happening in place in which we seek solace and peace.” \nObama said he and First Lady Michelle Obama know several members of the Emanuel AME Church, one of the country’s oldest black congregations, including its beloved pastor, state Sen. Clementa Pinckney. \n“Mother Emanuel is in fact more than a church. This is a place of worship that was founded by African American seeking liberty,” Obama said. \nThe president also called for another national conversation about gun control. \n“Now is the time for mourning and for healing,” Obama said. “But let's be clear. At some point, we as a country will have to reckon with the fact that this type of mass violence does not happen in other advanced countries.” \nMeantime, presidential hopefuls took a pause from the campaign trail on Thursday following news of the horrific shooting. \nFormer Florida Gov. Jeb Bush, who was scheduled to speak at the Charleston Maritime Center on Thursday, cancelled all campaign events for the day. \n\"Columba and I mourn today with the Emanuel AME Church and the families of the victims of this terrible crime,” Bush said in a statement. “Our hearts are broken at the senseless loss of life. Our prayers are for the community that has lost its pastor and a brave leader.” \nHe added, “May the families and the city of Charleston be lifted up by the prayers of our entire nation.\" \nAccording to the Washington Post, Bush was to speak about foreign policy and the need to revamp the American military at a veteran’s town hall meeting. The candidate has already visited New Hampshire and Iowa this week. \nMeantime, former Secretary of State Hillary Clinton tweeted, “Heartbreaking news from Charleston – my thoughts and prayers are with you all.” According to Charleston’s Post and Courier, Clinton was at a fundraising about a mile from the church Wednesday evening, but she left for Nevada at least two hours before the shooting. \nOn Thursday afternoon, Congressional members held a prayer vigil for victims outside on Capitol Hill. It was led by South Carolina Republican Sen. Tim Scott. \nSouth Carolina Senator and GOP presidential hopeful Lindsey Graham canceled his political schedule for the remainder of the weekend in order to return to his home state. Graham had been scheduled to deliver remarks in Philadelphia Firday and campaign in New Hampshire over the weekend. \nOther presidential hopefuls like Florida Sen. Marco Rubio and Texas Sen. Ted Cruz also sent out condolences. \n“Saddened by the news from Charleston,” Rubio tweeted. “The victims and their families are in my prayers today.” Saddened by the news from Charleston. The victims and their families are in my prayers today. \n— Marco Rubio (@marcorubio) June 18, 2015 \n\"My thoughts and prayers are with the families of the victims of last night's shooting in Charleston, who were tragically taken from us as they gathered together in prayer inside their place of worship,” Cruz said in a statement. ", "external_links": [], "published": "2015-06-19T03:00:00.000+03:00", "crawled": "2015-06-20T05:43:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}