{"organizations": [], "uuid": "4b56e162fa57a9479e99277aa0b577a10d83b228", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/carter_obamanewsplit.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/30/jimmy-carter-hits-obama-on-foreign-policy-calls-accomplishments-minimal/", "country": "US", "title": "Jimmy Carter hits Obama on foreign policy, calls accomplishments ‘minimal’", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Jimmy Carter hits Obama on foreign policy, calls accomplishments ‘minimal’ | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "4b56e162fa57a9479e99277aa0b577a10d83b228"}, "author": "Blake Seitz", "url": "http://www.foxnews.com/politics/2015/06/30/jimmy-carter-hits-obama-on-foreign-policy-calls-accomplishments-minimal/", "ord_in_thread": 0, "title": "Jimmy Carter hits Obama on foreign policy, calls accomplishments ‘minimal’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Blake Seitz\nPublished June 30, 2015 Washington Free Beacon Email Print At left, former President Jimmy Carter; at right, President Obama. (Reuters/AP)\nPresident Obama was criticized last week by the president he is often compared to, Jimmy Carter.\nCarter told an Aspen Institute audience that Obama's accomplishments on foreign policy \"have been minimal\" and that the United States' influence is \"lower than it was six or seven years ago.\"\nAfter proclaiming John Kerry \"one of the best secretaries of state we've ever had,\" Carter dumped cold water on Obama's record abroad.\n\"On the world stage, I think [Obama's accomplishments] have been minimal,\" Carter said. \"I think he has done some good things domestically, like health reform and so forth. But on the world stage, just to be objective about it, I can't think of many nations in the world where we have a better relationship now than when he took over.\"\nCarter declined to blame Obama for the U.S.'s dismal foreign policy outlook, stating simply that circumstances \"have evolved.\" However, he did state that the U.S. had suffered a reversal of fortunes in foreign policy since Obama took over from President George W. Bush.\n\"I would say the U.S.'s influence and prestige and respect in the world is probably lower than it was six or seven years ago,\" Carter said.\nAs president, Carter presided over a series of foreign policy challenges as Iran seized American hostages and the Soviet Union invaded Afghanistan. He spent the last year of his presidency trying to counter these threats, in part by articulating the Carter Doctrine, a reversal from his previously standoffish foreign policy.\nClick for more from The Washington Free Beacon .\nAdvertisement\nTrending in Politics 1 Obama says US could 'walk away' from Iran nuclear talks, as deadline extended 2 Supreme Court takes up dispute over union fees 3 Don’t remember the Alamo? Texas wants to change that 4 Obama proposes major overtime pay expansion, amid GOP resistance 5 Christie announces 2016 White House bid, vows 'I mean what I say' See all Trends Advertisement", "external_links": ["http://freebeacon.com/politics/jimmy-carter-obamas-foreign-policy-accomplishments-minimal/"], "published": "2015-06-30T03:00:00.000+03:00", "crawled": "2015-06-30T22:42:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}