{"organizations": [], "uuid": "3778eaa2dbbea6a426e3ebfeef7052c70bcaaf0b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/supremecourttexas661.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/health/2015/06/29/dr-manny-supreme-court-decision-on-texas-abortions-is-dangerous/", "country": "US", "title": "Dr. Manny: The Supreme Court decision on Texas abortions is dangerous", "performance_score": 0, "site": "foxnews.com", "participants_count": 11, "title_full": "Dr. Manny: The Supreme Court decision on Texas abortions is dangerous | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-29T03:00:00.000+03:00", "replies_count": 10, "uuid": "c27cf81446d4f4825553b980fdc57de91c51e0dc"}, "author": "Manny Alvarez", "url": "http://www.foxnews.com/health/2015/06/29/dr-manny-supreme-court-decision-on-texas-abortions-is-dangerous/#post-0", "ord_in_thread": 0, "title": "Dr. Manny: The Supreme Court decision on Texas abortions is dangerous", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Dr. Manny Alvarez\nPublished June 29, June 29, 2015: Members of security stand outside of the Supreme Court in Washington. (AP)\nI completely disagree with the Supreme Court decision to block Texas from enforcing restrictions on abortion clinics that would force 10 centers in the state to close. Let me be clear, the regulations that were being placed on these clinics were mainly focused on enforcing safety and guidelines for a very delicate procedure. What the state of Texas is asking for is that these independent clinics performing these procedures be held to the same clinical standards as any other surgical center in the country.\nIn other words, the regulations would have mandated that these clinics have of all the tools necessary to handle medical emergencies including a complete subset of necessary equipment, surgical protocols and safety checks to ensure that women undergoing abortions do not get hurt during the procedure. Rightfully so, these regulations would have also meant doctors, as well as clinics, be granted admitting privileges at a local hospital in the event of an emergency situation.\nThe importance of that power is that you want continuity of care. If a woman is undergoing a pregnancy termination and there is any kind of complication, you want that attending doctor to be able to continue dealing with the emergency in a hospital setting.\nHave we already forgotten what happened in Philadelphia with Dr. Kermit Gosnell who was arrested on Jan. 19 and charged with eight counts of murder? One count stemmed from the death of a woman who received an overdose of anesthetic at his clinic, while seven involved infants that officials say were delivered live and then killed. He was later convicted of killing three of the infants at his Women’s Medical Society practice, and of involuntary manslaughter in the death of a patient. He is currently serving life in prison without parole.\nFor more than three decades, Gosnell, who according to a published grand jury report was not an obstetrician or gynecologist, ran a clinic in which patients were neglected, providers were not certified and conditions were unsanitary. The grand jury report attributed the horrors to an egregious lapse in regulatory oversight.\nGiven the severity of that case and many others, I don’t understand this Supreme Court ruling, I really do not. I believe that if you are going to perform any kind of medical procedure on any type of patient you must have medical standards that ensure quality medicine and focus on patient safety. Just because some clinics do not want to adhere to these rules does not mean our country’s patients must suffer. The opposition argued that the new regulations would have forced a major wave of clinic closures, leaving some areas across the state without any centers. That should not have been a reason to block this rule, but rather a reason for the state to address its needs and construct more regulated, safe facilities.\nTo me, this ruling does not make any medical or humanitarian sense. I hope that whatever the aftermath is, and whatever lessons we can learn from this ruling will also address some of the quality issues that we face involving independent, unregulated centers of care, specifically abortion clinics.\nFollow Dr. Manny on Facebook and subscribe to his YouTube channel for more.\nDr. Manny Alvarez serves as Fox News Channel's Senior Managing Editor for Health News. Prior to this position, Alvarez was a FNC medical contributor. Click here more information on Dr. Manny's work with Hackensack University Medical Center . Visit AskDrManny.com for more.\nAdvertisement\nTrending in Health 1 Dr. Manny: The Supreme Court decision on Texas abortions is dangerous 2 Dispelling 3 diet soda myths 3 Purple Heart veteran with PTSD denied bus ride over service dog 4 Women who sit too much have higher breast cancer risk 5 Are you a woman with no sex drive? Check your heart rate See all Trends Spring Clean Your Diet More\nVirtual reality pedals and dances its way into fitness classes Mushroom extract may help treat obesity, but it's no magic cure Stepping on a scale daily may help you lose weight USDA proposes healthier fare for child, adult day cares Sponsored content Integrative Cancer Care, With you at the center Cancer Therapy: Are you making the right choices? Mike's Naturopathic Medicine Story Mike Fincham's Story What is Cancer? Top Health Centers More\nBack Pain Beauty & Skin Cancer Cold and Flu Depression Heart Disease Digestive Health Nutrition Pain Management Pregnancy Sexual Health Health Connect Weekly news and features that matter the most to your well-being\nThank you! Your subscription has been submitted. Advertisement", "external_links": ["http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffoxnewshealth&width&layout=button_count&action=like&show_faces=true&share=false&height=21", "http://www.washingtonpost.com/blogs/wonkblog/wp/2013/04/15/the-gosnell-case-heres-what-you-need-to-know/", "http://www.cancercenter.com/", "https://www.youtube.com/subscription_center?add_user=askdrmanny", "http://www.facebook.com/DrManny"], "published": "2015-06-29T03:00:00.000+03:00", "crawled": "2015-06-30T02:25:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}