{"organizations": [], "uuid": "10c5b3d2485ab7e25878bce3a0990fd97f98bc7d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamacyber_021215getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/cybersecurity/244901-obama-under-pressure-to-retaliate-for-hack", "country": "", "title": "Obama under pressure to retaliate for hack | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama under pressure to retaliate for hack | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-14T17:43:00.000+03:00", "replies_count": 0, "uuid": "10c5b3d2485ab7e25878bce3a0990fd97f98bc7d"}, "author": "", "url": "http://thehill.com/policy/cybersecurity/244901-obama-under-pressure-to-retaliate-for-hack", "ord_in_thread": 0, "title": "Obama under pressure to retaliate for hack | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama", "Cory Bennett"], "text": "Obama under pressure to retaliate for hack Getty By Cory Bennett - 06/14/15 09:00 AM EDT \nThe massive digital theft of millions of federal workers’ data is mounting pressure on President Obama to take a tougher stand against state-sponsored cyberattacks. \nSince the infiltration of the Office of Personnel Management by suspected Chinese hackers, lawmakers, experts and 2016 hopefuls have pushed for a range of responses, from economic sanctions to currency restrictions to aggressively hacking back at Beijing officials. \nThe OPM hack is believed to be part of a broader Chinese cyber espionage scheme to construct a comprehensive database of millions of government workers that could allow hackers to imitate, blackmail and digitally exploit high-ranking officials. ADVERTISEMENT “What we’re seeing with these repeated hacks and repeated intrusions is that building your defense is not enough in and of itself,” Rep. Adam Schiff (D-Calif.), the top Democrat on the House Intelligence Committee, told reporters Tuesday. “There also has to be a deterrent.”\nBut no one can agree on what exactly that deterrent should be. The only thing people seem to agree on is that the deterrent has been woefully insufficient so far. \n“This is not an easy problem,” Schiff added. “That’s why it hasn’t been solved yet.” \nIn recent years, cyber crime syndicates have matured, pilfering billions of dollars from banks around the world. Underground darknet markets have become the go-to location to buy and sell billions worth of narcotics. And foreign powers have rapidly built up massive cyber espionage programs that one U.S. defense official said was causing the country to “hemorrhage” commercial and military secrets “at a dizzying rate.” \nAll this has exploded with little fear of being caught as law enforcement and government officials scramble to catch up. \n“It cannot be costless,” said former Sen. Joseph Lieberman (I-Conn.), who chaired the Senate Homeland Security Committee for roughly eight of his last 12 years in Congress, before retiring in 2013. \nWhile police have dramatically ramped up crackdowns on cyber crime rings, the administration has not developed a codified response system to fight back against state-backed hacks on federal agencies or private companies. \nThe U.S. has gone after China over cyber spying before. In 2014, the Justice Department indicted five members of the Chinese military for hacking a variety of U.S. companies in the nuclear, solar and metals industries from 2006-2014. \nBut that lacked the same eye-for-an-eye or “symmetric response” that people increasingly call for after mammoth hacks. \nThat means any retaliation for the OPM breach could set a precedent, putting all eyes on Obama to see how — and if — he reacts. \nThe administration has been hesitant to tip its hand thus far, refusing to publicly lay blame on China even as officials do so privately. \n“I can’t promise you that we’ll be in a position at any point in the future to make a grand pronouncement about who may have been responsible for this particular intrusion,” White House press secretary Josh Earnest said in a briefing this week. \nThe White House has also yet to vow a “proportional” response, as it did following the bruising cyberattack on Sony Pictures Entertainment, which it blamed on North Korea. \nIn the Sony case, “proportional” meant a new round of economic sanctions on the reclusive East Asian nation. \nSince then, President Obama has signed an executive order giving the Treasury Department more clout to impose similar sanctions on any foreign regime caught hacking the U.S. \nBut experts are wary the administration will make the OPM hack its inaugural test case for this new tool. \n“I don’t know that frankly, in this case, in the absence of any independent evidence that doesn’t rely on [classified] intelligence sources, that it would make sense to do that,” said Chris Finan, a former Obama administration cybersecurity adviser. “What do you get in return?” \nFinan and others believe such sanctions would simply provoke China and do little to change its hacking behavior. \n“I think they’re going to save [sanctions] for an intellectual property case,” said Adam Segal, a Chinese cyber policy expert and senior fellow at the Council on Foreign Relations, referring to China’s digital theft of commercial trade secrets. \nMaintaining the fraught U.S.-China relationship, which has been particularly strained in recent months over territorial disputes in the South China Sea, is economically vital to the U.S., Segal explained. \n“Cyber is an irritation, a growing irritation, but one that they don't want to derail the relationship,” he said. \nBut many are pressing the president to respond swiftly and forcefully. \n“They’re really daring us, in some ways challenging us, to respond to them,” Lieberman said. “It’s a time for action, not talk.” \nFormer Arkansas Gov. Mike Huckabee, a 2016 GOP hopeful, went so far as to argue the U.S. should be hitting China back in cyberspace. Infiltrate Communist party leaders’ cellphones, he said this week, hack intelligence officials’ bank accounts, call out elite Chinese families for political corruption, take down key computer networks in the country. \n“The way you deal with a bully on the playground is to punch them in the face and put them on the ground because the only thing they respect is power,” Huckabee said. \nMost have been more measured. \n“This attack, while serious, is not the equivalent of an attack on our cyber infrastructure,” Lieberman said. “This is a theft of records.” \nThe former senator advocated a counter cyberattack that is perhaps not made public, but “something the Chinese know about.” \n“This attack cannot be left unresponded to, but should be done in a way that’s proportionate to the attack so we don’t escalate into a larger conflict,” he said. \nOthers have focused on pulling international levers. \nSen. Lindsey Graham (R-S.C.), another 2016 candidate, and Sen. Charles Schumer (D-N.Y.), asked the International Monetary Fund (IMF) on Tuesday to withhold currency benefits from China until the country reins in overseas hacking. \nThe IMF is contemplating including the yuan as part of its emergency-lending fund, used to stabilize the global economy. Designating the yuan as a reserve currency would make it stronger in the international marketplace. \n“It is long past time for the international community to rally together and make crystal clear to the Chinese government that if they want to be treated as a leading nation on the global stage, then they need to start acting like it,” Schumer said. \nAs troubling details continue to leak about the scale of the OPM hack, it’s unlikely the White House is close to determining its ultimate response, if there even is one. \nFinan believes the administration might never officially blame China, reluctant to give up its methods for tracing the hacks. \nThe evidence he’s seen is also “circumstantial,” lacking a “direct linkage to the government.” \nThat won’t stop the calls from Congress and the public to strike back, or to at least develop a better protocol for future retaliation, as Schiff has been advocating. \n“We have not done enough to provide that deterrent,” he said. \nThe U.S. must “develop not only the offensive capabilities, but also the rules of this cyber warfare,” he added. ", "external_links": [], "published": "2015-06-14T17:43:00.000+03:00", "crawled": "2015-06-14T17:43:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}