{"organizations": ["Harry Potter Studio Tour", "Warner Brothers Leavesden Studios", "Harry Potter Films", "Gringotts Bank", "Wizarding Harry Potter Diagon Alley of   Two"], "uuid": "f25a328d52aa67575b4b1a35ac1b4ee6b4104934", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3023604/images/o-HARRY-POTTER-FANS-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/03/muggle-madness_n_7494594.html", "country": "", "title": "A 'Muggle,' In The Muggle World, Once Referred To A Marijuana Cigarette", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "A 'Muggle,' In The Muggle World, Once Referred To A Marijuana Cigarette", "spam_score": 0.0, "site_type": "news", "published": "2015-06-03T18:35:00.000+03:00", "replies_count": 0, "uuid": "f25a328d52aa67575b4b1a35ac1b4ee6b4104934"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/03/muggle-madness_n_7494594.html", "ord_in_thread": 0, "title": "A 'Muggle,' In The Muggle World, Once Referred To A Marijuana Cigarette", "locations": ["Aragog", "England", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dumbledore", "Diagon Alley", "Harry Potter"], "text": "Wonderful World Of Wizarding Harry Potter Diagon Alley of   Two girls look around the set of Dumbledore's office at the new Harry Potter Studio Tour at the Warner Brothers Leavesden Studios on March 23, 2012 in London, England. The studio includes the actual sets and special effects departments where the films were created and shot and goes on public display on March 31, 2012. A woman and her daughter have their picture taken inside the Ford Anglia that was used in 'Harry Potter and the Chamber of Secrets' (the second film in the series) at the new Harry Potter Studio Tour at Warner Brothers Leavesden Studios on March 23, 2012 in London, England. A girl rides a broomstick in front of a green screen at the new Harry Potter Studio Tour at Warner Brothers Leavesden Studios on March 23, 2012 in London, England. A model of Aragog used in 'Harry Potter and the Chamber of Secrets' (the second film in the series) is displayed at the new Harry Potter Studio Tour at Warner Brothers Leavesden Studios on March 23, 2012 in London, England. A general view inside the 'Great Hall' at the new Harry Potter Studio Tour at Warner Brothers Leavesden Studios on March 23, 2012 in London, England. Masks worn by actors who played goblins at Gringotts Bank in the Harry Potter Films are displayed at the new Harry Potter Studio Tour at Warner Brothers Leavesden Studios on March 23, 2012 in London, England. A general view of 'Hogwarts Castle' at the Harry Potter Studio Tour at Warner Brothers Leavesden Studios on March 23, 2012 in London, England. Visitors walk down Diagon Alley at the Harry Potter Studio Tour at Warner Brothers Leavesden Studios on March 23, 2012 in London, England. A general view of props used on the set of the Harry Potter films at the new Harry Potter Studio Tour at Warner Brothers Leavesden Studios on March 23, 2012 in London, England. A general view outside the new Harry Potter Studio Tour at the Warner Brothers Leavesden Studios on March 23, 2012 in London, England.  Share ", "external_links": [], "published": "2015-06-03T18:35:00.000+03:00", "crawled": "2015-06-03T18:35:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}