{"organizations": [], "uuid": "75574550ad965402aebfd12683eacb69d7010562", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051815getty.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/245495-obama-calls-sc-lawmakers-to-offer-condolences", "country": "US", "title": "Obama calls S.C. lawmakers to offer condolences", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama calls S.C. lawmakers to offer condolences", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T01:34:00.000+03:00", "replies_count": 0, "uuid": "75574550ad965402aebfd12683eacb69d7010562"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/245495-obama-calls-sc-lawmakers-to-offer-condolences", "ord_in_thread": 0, "title": "Obama calls S.C. lawmakers to offer condolences", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama calls S.C. lawmakers to offer condolences By Jordan Fabian - 06/18/15 06:34 PM EDT President Obama on Thursday called South Carolina Gov. Nikki Haley (R) and Sens. Lindsey Graham and Tim Scott in the aftermath of a mass shooting at a historic black church in Charleston. “The president offered sincere condolences on behalf of himself and the First Lady, and pledged to make available any federal resources that can support South Carolina in the aftermath of last night's tragedy,” said White House spokesman Eric Schultz. Obama placed the call from Air Force One en route to Los Angeles, where he was scheduled to attend two Democratic National Committee fundraisers. ADVERTISEMENT Nine people were killed at the Emanuel African Methodist Episcopal Church in downtown Charleston on Wednesday night after a white male shooter allegedly opened fire on congregants. The Department of Justice has opened a hate-crime investigation into the incident, and the Federal Bureau of Investigation is assisting state authorities with their probe. Earlier Thursday, Obama called the shooting a “ heartbreaking ” tragedy that should serve as a wake-up call for America to confront gun violence. “We as a country we will have to reckon with the fact that this type of mass violence doesn’t happen in other advanced countries,” Obama said during a statement at the White House. He also lamented the fact the shooting took place at a church that has deep roots in Charleston’s African-American community. “This is not the first time that black churches have been attacked,” Obama said. “The good news is I am confident that the outpouring of unity and strength and fellowship and love across Charleston today, from all races, from all faiths, from all places of worship indicates the degree to which those old vestiges of hatred can be overcome,” he added. Haley choked up during a press conference Thursday where she addressed the shooting. She also visited with families of the shooting victims at a hotel in Charleston. \"We woke up today, and the heart and soul of South Carolina was broken,\" Haley said. \"We're seeing love; we're seeing prayers; we're seeing humility,\" she added in reference to the community’s response to the shooting.", "external_links": [], "published": "2015-06-19T01:34:00.000+03:00", "crawled": "2015-06-19T02:25:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}