{"organizations": [], "uuid": "17909eb9f6df39909363231c13cd16b9caa792c7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/2003/feed#", "section_title": "The Hill: Energy & Environment Regulation", "url": "http://thehill.com/policy/energy-environment/245526-obama-seeks-24-percent-cut-in-trucks-fuel-use", "country": "US", "title": "Obama moves to slash truck pollution", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama moves to slash truck pollution", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T17:52:00.000+03:00", "replies_count": 0, "uuid": "17909eb9f6df39909363231c13cd16b9caa792c7"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/245526-obama-seeks-24-percent-cut-in-trucks-fuel-use", "ord_in_thread": 0, "title": "Obama moves to slash truck pollution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama moves to slash truck pollution Wikimedia Commons By Timothy Cama - 06/19/15 10:52 AM EDT \nThe Obama administration laid out a major step Friday in its fight against climate change with a plan it said would reduce the greenhouse gas emissions from medium and heavy-duty trucks and buses by 1 billion metric tons. \nThe matching regulations from the Environmental Protection Agency (EPA) and the Transportation Department would improve fuel efficiency standards by an average of 24 percent for medium-sized and heavy trucks, buses and big trailers through model year 2027, which would cut the output of Earth-warming carbon dioxide while saving 1.8 billion barrels of oil. ADVERTISEMENT The federal agencies said the rules, which would be the second round of truck efficiency standards from the Obama administration, would bolster energy security and spur innovation in manufacturing while saving money for consumers and businesses. “These efficiency standards are good for the environment — and the economy,” Transportation Secretary Anthony Foxx said in a statement. “When trucks use less fuel, shipping costs go down.” Mark Rosekind, head of the Transportation Department’s National Highway Traffic Safety Administration, said the rule would result in $270 billion in benefits nationally and only cost $25 billion. \" Setting and implementing national standards for cars and trucks and other transportation sources has been a top priority for this administration, because cutting oil use is critical to our economic well-being and national security, while delivering cleaner air is important to the health and well-being of every American,” he said. “And higher fuel efficiency helps us to bring these benefits to the nation, well bringing more money to the pockets of businesses and consumers .” \nWhile the new standards would add up to $12,000 to the cost of a new truck, trucking companies could recoup the costs within two years, leading the industry to $170 billion in fuel savings during the life of the vehicles. \nBig trucks and buses account for about one-fifth of the greenhouse gas emissions and fuel use in the transportation sector, a sector that produces 27 percent of the country’s emissions, second only to electricity generation. Those vehicles comprise only about 5 percent of the vehicles on the road. \nThe emissions reduction is the equivalent of the pollution from all United States residents’ energy and electricity use for a year, while the oil savings amount to the country’s annual imports from OPEC. \n“We’re delivering big time on President Obama’s call to cut carbon pollution,” said EPA head Gina McCarthy said in the statement. “With emission reductions weighing in at 1 billion tons, this proposal will save consumers, businesses and truck owners money; and at the same time spur technology innovation and job-growth, while protecting Americans’ health and our environment over the long haul.” Janet McCabe, head of the EPA’s air pollution office, said emissions from large vehicles are growing the fastest of any sector in transportation. “With this growth in mind, we need to move forward now with standards that will pay off in less carbon and lower fuel costs down the road,” she said. McCabe said that to reach the rule’s goals, truck makers will have to use some technology that is not yet commercially available. But regulators believe the technology will be fully available by the time it is needed. The rules come during a busy few months for the Obama administration’s climate agenda. \nEarlier this month, the EPA kicked off a process to regulate greenhouse gases from aircraft. \nIn August, the administration plans to make final its most controversial climate change regulation, limiting carbon output from power plants. \nAt some point this summer, the EPA will propose rules to crack down on methane emissions from the oil and natural gas sector. \nBut unlike some of Obama’s more controversial rules, the truck regulations are receiving cautious support from the trucking industry. \nThe American Trucking Associations (ATA) said it supports the rules, but it wants to make sure that the agencies do not mandate untested technology. \n“Fuel is an enormous expense for our industry — and carbon emissions carry an enormous cost for our planet,” Bill Graves, president of the trucking group, said in a statement. \nGlen Kedzie, who leads environmental policy for the ATA, said the federal government is generally following the advice that the industry suggested to keep technology attainable. \nThe industry fully supported the first round of truck efficiency rules, written in 2011. Sen. Barbara Boxer (D-Calif.), top Democrat on the Senate Environment and Public Works Committee, applauded the “true leadership” Obama is showing through the rules. “This proposed truck fuel efficiency standard is another important step forward, because the reduction in carbon pollution will be the equivalent of taking more than 210 million cars off the road for one year,” she said in a statement. \nEnvironmental groups cheered the EPA’s announcement. \n“Making our trucks go farther on less fuel will limit climate change and oil dependency while saving consumers and businesses money, and spurring innovation,” Rhea Suh, president of the Natural Resources Defense Council, said in a statement. “We will be pushing the administration to require compliance sooner, in order to deliver these benefits more quickly.” \nSara Chieffo, vice president of government affairs for the League of Conservation Voters, said the proposal “marks another important step in the Obama administration’s plan to curb carbon pollution and combat climate change. A more efficient truck fleet will save money on shipping, driving down costs for companies and consumers.” The agencies will give the public 60 days to comment on the proposed rules, and will also hold public hearings on it throughout the country . This story was updated with additional information at 12:20 p.m. Tags:", "external_links": [], "published": "2015-06-19T17:52:00.000+03:00", "crawled": "2015-06-19T20:26:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}