{"organizations": [], "uuid": "aa9927c7843a73c4d8bc530a8aed778523c029b9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/062615_an_keating_640.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/26/obama-delivers-eulogy-for-pastor-gunned-down-in-south-carolina/", "country": "US", "title": "Obama delivers eulogy for pastor killed in South Carolina", "performance_score": 4, "site": "foxnews.com", "participants_count": 27, "title_full": "Obama delivers eulogy for pastor killed in South Carolina | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T03:00:00.000+03:00", "replies_count": 33, "uuid": "7db819fb791f196eb0985371f32a955dad23c539"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/26/obama-delivers-eulogy-for-pastor-gunned-down-in-south-carolina/#post-0", "ord_in_thread": 0, "title": "Obama delivers eulogy for pastor killed in South Carolina", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print \nPresident Obama delivered an impassioned eulogy Friday for the pastor killed along with eight other churchgoers last week in South Carolina, memorializing him as a \"man of God who lived by faith\" and conducted himself with kindness and grace. \n\"What a good man,\" Obama said of state Sen. Clementa Pinckney. \nCapping a service filled with rousing gospel numbers, Obama spoke at length about Pinckney's character, but also race relations and gun violence. He included another appeal for gun regulations toward the end of his remarks, saying, \"It would be a betrayal of everything Reverend Pinckney stood for ... if we allow ourselves to slip into a comfortable silence again.\" \nObama ended by singing \"Amazing Grace,\" and was joined by the thousands in attendance. \nPinckney, a state senator and pastor, was among the nine killed at Emanuel African Methodist Episcopal Church. In Charleston for the service, Obama recalled a man dedicated to both the faith and his community, who \"was full of empathy and full of feeling and able to walk in somebody else's shoes and look in their eyes.\" \n\"I did have the pleasure of knowing and meeting him in South Carolina both when we were both a little bit younger,\" Obama said. \"The first thing I noticed was his gracious smile, his resonating baritone and deceptive sense of humor.\" \nHe noted that Pinckney had come from a long line of preachers and \"a family of protesters who fought to extend voting rights and for desegregation in the South. ... He set an example worthy of this position, wise beyond his years.\" \nPinckney, 41, and eight others were gunned down during a prayer meeting at the church on the evening of June 17. Dylann Storm Roof, 21, was arrested and charged in the murders and has allegedly confessed to the crime. Justice Department investigators are pursuing the murders as a hate crime. \nFriends and family who shared remarks ahead of Obama's remarks said Pinckney had a calling for the pulpit since and early age. Active in his community, he was first elected to the South Carolina General Assembly at the age of 23 and was later elected to the state Senate in 2000. He was appointed the pastor of the historic church, referred to as \"Mother Emanuel,\" in 2010. He had been married since 1999 to wife Jennifer, whom he met in college, and leaves two daughters, Eliana and Malana. \nThe deaths of  Pinckney and the eight others have resulted in a debate in Southern states over the Confederate battle flag. A number of stores began pulling Confederate flag merchandise from their shelves after Roof appeared with in photos holding it. South Carolina Gov. Nickki Haley has called for the removal of the flag from the Statehouse grounds, where it has been flying since 1962. \nObama said that \"for too long\" the nation has been \"blind to the pain the Confederate flag stirred ... it has always represented more than just ancestral pride. For many, black and white, that flag is reminder of systematic oppression and racial subjugation.\" He said removing it from the state capital wouldn't be an act of political correctness, or an insult to the valor of the soldiers who fought for the South, but a recognition that \"slavery was wrong ... the imposition of Jim Crow [laws] after the Civil War, the resistance of civil rights for all people, was wrong.\" Taking down the flag, he added, \"would be one step in an honest accounting of America's history ... a modest and meaningful balm for many unhealed wounds.\"\nFirst lady Michelle Obama, along with Vice President Joe Biden and his wife, Jill, joined the president at the funeral, which took place at the College of Charleston. Several members of Congress were also scheduled to attend, along with Hillary Clinton, who is seeking the Democratic presidential nomination. \nObama has been called upon throughout his presidency to help soothe the pain of communities mourning gun-related tragedies.He issued a powerful call for national unity in Tucson, Arizona, after a 2011 shooting that severely injured then-Rep. Gabby Giffords. His voice was filled with emotion in 2012 when he spoke at a prayer vigil for the elementary school students and adults killed in Newtown, Connecticut. He's also addressed grief-stricken communities in Fort Hood, Texas and Aurora, Colorado, as well as his own current hometown of Washington. \nThe morning after the Charleston shooting, Obama expressed his frustration with the frequency of such tragedies.   \n\"I've had to make statements like this too many times,\" he said. \"Communities like this have had to endure tragedies like this too many times.\" \nThe Associated Press contributed to this report. \n \n    4   5 Supreme deliverance for GOP  ", "external_links": [], "published": "2015-06-26T03:00:00.000+03:00", "crawled": "2015-06-26T23:47:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}