{"organizations": [], "uuid": "195a569deef3cc44cbd1d11ebd9c2905868272ef", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/245512-obama-goofs-in-speech-at-tyler-perrys-house", "country": "US", "title": "Obama goofs in speech at Tyler Perry's house", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama goofs in speech at Tyler Perry's house", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T16:31:00.000+03:00", "replies_count": 0, "uuid": "195a569deef3cc44cbd1d11ebd9c2905868272ef"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/245512-obama-goofs-in-speech-at-tyler-perrys-house", "ord_in_thread": 0, "title": "Obama goofs in speech at Tyler Perry's house", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama goofs in speech at Tyler Perry's house By Jordan Fabian - 06/19/15 09:31 AM EDT \nPresident Obama lately has been speaking more frequently about life after the White House, but he might not have meant to on Thursday night. \nAt a fundraiser hosted by actor/filmmaker Tyler Perry in Beverly Hills, Calif., Obama slipped up and made it seem like he was a prisoner and not the president. ADVERTISEMENT “We should be reforming our criminal justice system in such a way that we are not incarcerating nonviolent offenders in ways that renders them incapable of getting a job after they leave office,” Obama said. \nThe star-studded audience broke into laughter and applause, and the president admitted he made a “Freudian slip.” \n“Little slip of the tongue there. Little Freudian slip,” he said. “Tyler is going to give me a job once I leave.” \nObama recalled that President Bill Clinton once joked that the White House “is the crown jewel of the federal penitentiary system,” prompting more laughter from the crowd. \nThe president spoke to around 250 people at Perry’s Tuscan-style villa during a fundraiser to benefit the Democratic National Committee. Supporters paid between $2,500 to $33,400 to attend. \nSpotted in attendance were “Mad Men” creator Matthew Weiner and actress January Jones, Dodgers owner Frank McCourt, former National Basketball Association player Jason Collins and Netflix chief content officer Ted Sarandos. \nEarlier in the evening, Obama attended a smaller gathering at the home of television producer Chuck Lorre, where 30 people paid up to $33,400 to attend. \nAt Perry’s house, Obama addressed the mass shooting at a historic black church and how difficult it has been to break Washington gridlock. On issues like gun violence, immigration, and helping the poor, Obama said he has “struggled against” a system that rewards polarizing politics instead of cooperation. \n“It still is broken,” the president said. \n“The problem is not that we don't know what works,” he said. “The problem is, is that too often the political system doesn’t reflect the common sense and decency of the American people.”", "external_links": [], "published": "2015-06-19T16:31:00.000+03:00", "crawled": "2015-06-19T16:49:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}