{"organizations": [], "uuid": "a3cd956eb8be657c9b70e104e3e3c0187610afd5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3052012/images/o-OBAMA-HEALTH-CARE-SPEECH-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/health-care-law/feed", "section_title": "Health Care Law on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/09/obama-health-care-speech_n_7543050.html", "country": "US", "title": "Obama Makes Moral Plea For Health Care Law As Supreme Court Ruling Looms", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Makes Moral Plea For Health Care Law As Supreme Court Ruling Looms", "spam_score": 0.0, "site_type": "news", "published": "2015-06-09T17:24:00.000+03:00", "replies_count": 0, "uuid": "a3cd956eb8be657c9b70e104e3e3c0187610afd5"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/09/obama-health-care-speech_n_7543050.html", "ord_in_thread": 0, "title": "Obama Makes Moral Plea For Health Care Law As Supreme Court Ruling Looms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Makes Moral Plea For Health Care Law As Supreme Court Ruling Looms Posted: reddit \nWASHINGTON-- President Barack Obama restated the moral case for his health care reform law during a speech Tuesday, asserting, \"Health care is not a privilege. It is a right.\" \nObama's remarks come just weeks or even days ahead of a Supreme Court ruling that could do major damage to the Affordable Care Act -- and reopen the legislative debate about the law more than five years after he signed it. Obama addressed the Catholic Health Association of the United States, a trade group of hospitals affiliated with the Roman Catholic Church, at a conference in Washington. \n\"The rugged individualism that defines America has always been bound by a shared set of values, an enduring sense that we're in this together,\" Obama said. \"America is not a place where we simply turn away from the sick, or turn our backs on the tired, the poor, the huddled masses. It is a place sustained by the idea, I am my brother's keeper, I am my sister's keeper -- that we have an obligation to put ourselves in our neighbor's shoes and see each other's common humanity.\" \nThe flaws in the American health care system, starting with tens of millions of people who had no health insurance, poor access to medical care and unlimited exposure to financial ruin from illness, were problems that needed to be solved, Obama said. \"So after nearly a century of talk, after decades of trying, after a year of sustained debate, we finally made health care reform a reality here in America,\" he said. \nObama cited the Affordable Care Act's successful reduction in the share of Americans without health coverage , and asserted that the changes brought by his reforms couldn't easily be undone. \n\"Five years in, what we are talking about is no longer just a law. It's no longer just a theory. It isn't events about the Affordable Care Act or Obamacare. This isn't about myths or rumors that folks try to sustain,\" he said. \"This is a reality that people on the ground, day to day, are experiencing. Their lives are better. This is now part of the fabric of how we care for one another. This is health care in America.\" \nObama mocked the continuing efforts to repeal or otherwise disrupt the law, and reiterated his pledge to fight them. \n\"We're not going to go backwards,\" he said. \"It seems so cynical to want to take coverage away from millions of people, to take care away from the people who need it the most, to punish millions with higher costs of care, and unravel what's now been woven into the fabric of America.\" This is now part of how we care for one another. President Barack Obama \nMore than 10 million people enrolled into private health insurance plans via the Affordable Care Act's health insurance exchange, and 87 percent of them received tax credit subsidies to help pay for the plans as of March 31, according to data published by the Department of Health and Human Services this month. The law's expansion of Medicaid to more low-income people -- despite being rejected in nearly half the states -- has extended coverage to millions more . The administration estimates 16 million fewer people are uninsured because of the law. \n\"There are outcomes that we can calculate and enumerate -- the number of newly insured families, the number of lives saved -- those numbers add up to success in this reform effort,\" Obama said. The White House launched a new website to promote the law Tuesday. \nObama touted the positive effects of his health care overhaul as he awaits a decision from the Supreme Court that could undermine the law and reverse its gains in expanding health coverage to the uninsured. \nThis month, the Supreme Court is expected to issue a ruling in King v. Burwell, a lawsuit engineered by conservative and libertarian activists that seeks to eradicate Obamacare's health insurance subsidies for millions of people. According to the plaintiffs in the case, a strict reading of the law means these tax credit subsidies are only legal for residents of states that created health insurance exchanges under the Affordable Care Act. The Obama administration argues the law clearly allows subsidies in every state, regardless of whether the state or the federal government operates the exchange marketplace. \nThe consequences of ruling against Obama would be severe, and would create pressure on Obama, Congress and the states to respond. \nThe federal government runs the exchanges in 34 states, where 6.4 million people who currently receive subsidies would lose them if the plaintiffs prevail. Since these individuals have low or moderate incomes, most are expected to lose their health coverage. The abrupt exit of millions of customers from the health insurance rolls is further expected to roil the markets in those states, because those with expensive medical conditions are considered most likely to retain their policies, driving up expenses for insurers and leading to rate hikes. Eight million or more people would wind up uninsured , according to estimates from the Rand Corp. and the Urban Institute. \nThe White House maintains it could do little to mitigate these effects, beyond assisting states that want to create their own health insurance exchanges to preserve subsidies for their residents. To date, only Delaware and Pennsylvania have initiated efforts to establish an exchange if the high court strikes down the subsidies. And Republican governors in places including Louisiana and Wisconsin have declared they wouldn't take action to restore financial assistance for Obamacare enrollees in their states. Mostly, state leaders are waiting to see how the Supreme Court rules while considering their options . \nRepublicans in Congress are deeply split about how, or whether, to respond to a high court ruling that eliminated subsidies in 34 states -- mainly in those currently governed by the GOP . \nRepublican members of Congress have floated various proposals to temporarily extend Obamacare subsidies, but these plans are predicated on eventually undoing all of the Affordable Care Act, which ultimately would result in even more people losing health coverage . Senior GOP lawmakers like Senate Majority Leader Mitch McConnell (Ky.) and House Ways and Means Committee Chairman Paul Ryan (Wis.) said Republicans won't unveil their official plans for responding to King v. Burwell until after the Supreme Court rules. But other Republicans in Congress prefer to let the subsidies lapse and do nothing. Also on HuffPost:", "external_links": [], "published": "2015-06-09T17:24:00.000+03:00", "crawled": "2015-06-09T23:12:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}