{"organizations": [], "uuid": "24a9faf26f4648dcf8c7a9042779f10c26e80c07", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3119240/images/o-PUTIN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/25/putin-obama-phone-call-iran_n_7667110.html", "country": "", "title": "Putin Calls Obama To Talk Iran, Ukraine And ISIS", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Putin Calls Obama To Talk Iran, Ukraine And ISIS", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "24a9faf26f4648dcf8c7a9042779f10c26e80c07"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/25/putin-obama-phone-call-iran_n_7667110.html", "ord_in_thread": 0, "title": "Putin Calls Obama To Talk Iran, Ukraine And ISIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Putin Calls Obama To Talk Iran, Ukraine And ISIS Reuters Updated: 06/25/2015 6:59 pm EDT Russian President Vladimir Putin attends a session of the Civic Chamber at the Kremlin in Moscow on June 23, 2015. AFP PHOTO / POOL / SERGEI KARPUKHIN (Photo credit should read SERGEI KARPUKHIN/AFP/Getty Images) | SERGEI KARPUKHIN via Getty Images reddit \nWASHINGTON, June 25 (Reuters) - Russian President Vladimir Putin phoned U.S. President Barack Obama on Thursday, their first call since February, to discuss Iran nuclear talks, \"the increasingly dangerous situation in Syria\" and the need to counter Islamic State militants, the White House said in a statement. \n\"The leaders discussed the increasingly dangerous situation in Syria, and underscored the importance of continued P5+1 unity in ongoing negotiations to prevent Iran from acquiring a nuclear weapon,\" the White House said. \nObama also told Putin that Russia needs to live to up to the terms of a ceasefire deal with Ukraine, \"including the removal of all Russian troops and equipment from Ukrainian territory,\" the White House said. (Reporting by Roberta Rampton) Also on HuffPost: Putin And The Night Wolves of   In this Monday, Aug. 29, 2011 photo, then Russian Prime Minister Vladimir Putin, center left, and leader of Nochniye Volki (the Night Wolves) biker group, Alexander Zaldostanov, also known as Khirurg (the Surgeon), right, ride bikes at a motor bikers' festival in the Black Sea port of Novorossiysk, Russia. (AP Photo/RIA Novosti, Alexei Druzhinin, POOL, file) A picture taken on July 7, 2009, shows Vladimir Putin, then Russian Prime Minister, listening to the leader of Nochniye Volki (the Night Wolves) biker group, Alexander Zaldostanov (R), also known as Khirurg (the Surgeon), during Putin's visit to the 'Night Wolves' biker club's headquarters. (ALEXEY DRUZHININ/AFP/Getty Images) Vladimir Putin, center, and leader of the Night Wolves biker group, Alexander Zaldostanov, right, as they ride bikes at a motor bikers' festival in the Black Sea port of Novorossiysk, Russia, Monday, Aug. 29, 2011. (AP Photo/Ivan Sekretarev, pool) Vladimir Putin (C) poses for a photo with members of the 'Night Wolves' bikers' movement after watching a friendly football match between of Serbia's FC Crvena Zvezda Belgrade and Russia's FC Zenit St Petersburg junior teams at Marakana Stadium in Belgrade, on March 23, 2011. (ALEXEI NIKOLSKY/AFP/Getty Images) Russian President Vladimir Putin (C) and Night Wolves Moscow Bikers club leader Alexander 'Khirurg' Zaldostanov (L) attend the opening of the Barmaley Fountain during a wider ceremony to remember the 40, 000 people who died on this day in 1942, when the city was bombed by Nazi Germany, on August 23, 2013 in Volgograd, Russia. (Sasha Mordovets/Getty Images) Vladimir Putin (R) speaks with a biker as he takes part in the 16th annual motorbike festival held by 'The Night Wolves' youth organization in the southern Russian town of Novorossiysk, on August 29, 2011. (ALEXEY DRUZHININ/AFP/Getty Images) Vladimir Putin (L) hands over a medal to the leader of the Night Wolves biker group, Alexander Zaldostanov, during Putin's meeting with members of the Military History Society in the Novo-Ogaryovo residence outside Moscow, on March 14, 2013. (MIKHAIL KLIMENTYEV/AFP/Getty Images) Vladimir Putin pays a surprise visit to the headquarters of the 'Night Wolves' biker club in Moscow on July 7, 2009. (ALEXEY DRUZHININ/AFP/Getty Images) Vladimir Putin, center, and leader of the Night Wolves biker group, Alexander Zaldostanov, right, pose for a press attending a meeting of motorbikers at their camp at Gasfort lake near Sevastopol in Ukraine's Crimea Peninsula, Saturday, July 24, 2010. (AP Photo/Alexander Zemlianichenko, Pool)  Share ", "external_links": [], "published": "2015-06-26T03:00:00.000+03:00", "crawled": "2015-06-26T08:52:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}