{"organizations": [], "uuid": "14b157711d5f21f9d4da3e113540634b3a70fa8e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3062214/images/o-LUIS-GUTIERREZ-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/bernie-sanders/feed", "section_title": "Bernie Sanders on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/11/luis-gutierrez-bernie-sanders-immigration_n_7562320.html", "country": "US", "title": "Democratic Congressman: Why Is Bernie Sanders Silent About Immigration?", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Democratic Congressman: Why Is Bernie Sanders Silent About Immigration?", "spam_score": 0.0, "site_type": "news", "published": "2015-06-11T17:16:00.000+03:00", "replies_count": 0, "uuid": "14b157711d5f21f9d4da3e113540634b3a70fa8e"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/11/luis-gutierrez-bernie-sanders-immigration_n_7562320.html", "ord_in_thread": 0, "title": "Democratic Congressman: Why Is Bernie Sanders Silent About Immigration?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nWASHINGTON -- Sen. Bernie Sanders (I-Vt.) has spoken a lot about the corroding influence of large sums of money on the American political system. He regularly warns about the harmful effects of climate change and Republicans' failure to confront it. And he frequently laments America's standing in the world on inequality and paid sick leave. But an issue you may not hear him speak as frequently about is immigration, as one leading Democrat on immigration reform noted Thursday. \nSpeaking with Larry King on his show, \"PoliticKING,\" Rep. Luis Gutierrez (D-Ill.) gave other Democratic presidential contenders like Hillary Clinton and Martin O'Malley passing grades on immigration. But Sanders, who announced his run for the White House last month, failed to make the cut. \n\"I don’t know if he likes immigrants, because he doesn't seem to talk about immigrants. But sooner or later he’ll tell us. I hope he likes immigrants. I haven’t heard him say anything. He’s been kind of quiet and silent. So I hope that when he sees this program he sees that there’s a lot of people waiting to hear from him,\" said Gutierrez, a member of the House Judiciary Committee who advocates on behalf of comprehensive immigration reform. \nA spokesperson for Sanders' campaign did not immediately return a request for comment. \nGutierrez is notably the first member of Congress to call out Sanders for failing to give voice to an issue that has dominated the debate within the Democratic Party in recent years. But he's not the first progressive to do. Last month, MSNBC host Chris Hayes noted that Sanders would have trouble on his path to the nomination without courting members of the coalition that twice elected Barack Obama to the White House: minorities, women and young people. Over at the conservative Washington Examiner, Byron York similarly wrote that Sanders' \"progressive whiteopia\" lacked focus on issues like immigration and race and policing, especially in the wake of protests in Baltimore, New York and Ferguson, Missouri. \nSanders hasn't been completely silent on challenges faced by both Hispanics and African Americans. On Wednesday, he delivered a speech on the floor of the Senate tying the issue of unemployment to incarceration rates of minorities. And on Thursday, the National Association of Latino Elected and Appointed Officials announced Sanders would address its annual conference of policymakers in Las Vegas later this month and speak \"on the issues most important to the Latino community.” \n“The answer to unemployment and poverty is not and cannot be the mass incarceration of young African Americans,” Sanders said in the Senate on Wednesday. “It's time to bring hope and economic opportunity to communities across the country.” \nGutierrez, a leading proponent of immigration reform on the Hill, argued in his interview with King that immigration would continue to be on the forefront of the Democratic agenda because of wide support among the American electorate. \n\"The majority of Democrats in this country believe in immigration reform. The majority of Independents believe in immigration reform. The majority of Republicans believe in immigration reform. Unfortunately, the majority of those that sit in the House of Representatives do not, and they're stymying the future of our immigration promises,\" he said. Also on HuffPost:", "external_links": [], "published": "2015-06-11T17:16:00.000+03:00", "crawled": "2015-06-11T21:35:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}