{"organizations": ["Fox News Latino BOONE", "GOP", "NALEO"], "uuid": "913e2116cf009f54b75e337c31867d761fa475e0", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/ben%20carson%20naleo.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/17/ben-carson-lone-republican-at-naleo-says-immigration-talk-is-pigeonholing/", "country": "", "title": "Ben Carson, lone GOP candidate at NALEO, says immigration talk is 'pigeonholing' | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Ben Carson, lone GOP candidate at NALEO, says immigration talk is 'pigeonholing' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "913e2116cf009f54b75e337c31867d761fa475e0"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/17/ben-carson-lone-republican-at-naleo-says-immigration-talk-is-pigeonholing/", "ord_in_thread": 0, "title": "Ben Carson, lone GOP candidate at NALEO, says immigration talk is 'pigeonholing' | Fox News Latino", "locations": ["IA", "Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ben Carson"], "text": "Ben Carson, lone GOP candidate at NALEO, says immigration talk is 'pigeonholing' Published June 17, 2015 Fox News Latino BOONE, IA - JUNE 06: Republican presidential hopeful Dr. Ben Carson speaks at a Roast and Ride event hosted by freshman Senator Joni Ernst (R-IA) on June 6, 2015 in Boone, Iowa. Ernst is hoping the event, which featured a motorcycle tour, a pig roast, and speeches from several 2016 presidential hopefuls, becomes an Iowa Republican tradition. (Photo by Scott Olson/Getty Images) 2015 Getty Images \nPresidential candidate Ben Carson, a Republican neurosurgeon, speaking at the largest gathering of Latino policymakers and leaders, denounced efforts to create divisions based on such things as gender and race. \nCarson said some had advised him to speak about immigration at the National Association of Latino Elected and Appointed Officials convention, which is being held in Nevada. \nCarson said he considered that idea pigeonholing, and said people of all ethnicities and races cared about a variety of issues, not just one. \n“We’re allowing the purveyors of division to come into our midst,” said Carson, who grew up in a poor home in Detroit, and graduated from Yale University. “Our strength lies upon our unity…We the American people are not each other’s enemies. It’s the people who try to divide us who are our enemies.” \nCarson did address immigration, however, saying he couldn’t altogether avoid the topic. \nHe called for sealing all borders – north, south, east and west – “completely.” \nHe said it’s “not because I’m afraid of somebody from Honduras, but because I’m afraid of someone from Syria who wants to kill us. \nCarson also called for helping people in other nations achieve their dreams, to lessen the desperation to come here illegally. As for the 11 million people believed to be living in the United States illegally, Carson said those who qualify could possibly get the opportunity to live here, perhaps by becoming guest workers. If they want citizenship, he said, they would have to get in “the back of the line.” \nThe non-partisan group’s constituency includes more than 6,000 officials. NALEO officials say they invited all 2016 presidential contenders. \nFormer Secretary of State Hillary Clinton, a presidential candidate, is scheduled to speak Thursday. Fellow Democrat, as well as presidential contender, Sen. Bernie Sanders of Vermont, is scheduled to speak on Friday. \nOn Wednesday, Julian Castro, the former San Antonio mayor and current Housing and Urban Development Secretary, spoke about how Latinos had advanced in the U.S. \n“Today the Latino high school graduation rate is near an all-time high,” he said. “Latino-owned businesses are growing faster than just about any other segment. More name plates in professional buildings bear names like Garcia and Rodriguez and Gonzalez, doctors offices, engineers offices, lawyers offices. \n“There is a Sotomayor on the Supreme Court. And soon enough, I have no doubt, in due course, there will be a Latino—or a Latina—in the White House,” his remarks said. “That is the magic of America. A place of common ground, of people committed to the idea that what counts is the strength of your work ethic, the size of your dreams and your willingness to go for it.” \nCastro, who is considered a potential vice presidential candidate for 2016, called for raising the minimum wage, making pre-K universal, and passing comprehensive immigration reform. \nLike us on Facebook ", "external_links": [], "published": "2015-06-18T03:00:00.000+03:00", "crawled": "2015-06-18T17:39:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}