{"organizations": [], "uuid": "f17e7acc855e592b1b8212573cb39285e714d434", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/kidney%20transplant%20wife%20Latino.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/health/2015/06/15/immigration-status-preventing-woman-with-kidney-failure-from-getting-transplant/", "country": "", "title": "Immigration status preventing woman with kidney failure from getting transplant | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration status preventing woman with kidney failure from getting transplant | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "f17e7acc855e592b1b8212573cb39285e714d434"}, "author": "", "url": "http://latino.foxnews.com/latino/health/2015/06/15/immigration-status-preventing-woman-with-kidney-failure-from-getting-transplant/", "ord_in_thread": 0, "title": "Immigration status preventing woman with kidney failure from getting transplant | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration status preventing woman with kidney failure from getting transplant Published June 15, 2015 Fox News Latino Doctors in a kidney transplant operation, 26th October 2010. (Photo by Xurxo Lobato/Cover/Getty Images) \nRuth Villalta needs a kidney transplant, and her husband, Francisco, is willing to give her one should he prove a suitable donor. \nBut chances are very poor that it will ever happen for the Salvadoran-born resident of Brentwood, New York on Long Island, whose kidneys have stopped functioning, because she is in the United States illegally. \n“If you see everyone as equal, how can you let someone die because they don’t have documents?” Villalta asked, according to the New York Daily News . \nVillalta told the newspaper that her doctors at first spoke to her about getting a kidney transplant, but stopped when they learned about her immigration status. \n“When they asked me for the documents, everything stalled,” she said. \nThe Daily News cited U.S. Renal Data System data suggesting that it would be much less expensive to perform the transplant in the long run. While Medicare pays out around $106,000 for transplant surgery, a year’s-worth of dialysis runs to $72,000. \nRuth immigrated to Long Island with her husband Francisco in 2009. He worked construction jobs, while she got a job at a pharmaceutical factory. \n“I started to feel poorly,” she told the Daily News, “and left my job. I felt worse and worse. I was tired, weak, sometimes my head hurt so bad.” \nBut Villalta, who is now 30, didn’t seek medical attention. \n“I was afraid of the bills – and because I didn’t have papers, I didn’t think I could go to the doctor,” she said. \nThen in 2013, she had a miscarriage and was rushed to Southside Hospital. \n“They told me that I had lost the baby because I had renal failure,” Villalta said. “They wouldn’t let me leave the hospital. They said I would die if I did. I had to go into dialysis immediately.” \nShe’s been receiving twice-weekly dialysis ever since, which, as an undocumented immigrant, gets covered through emergency Medicaid. \nA spokesperson for the North Shore-LIJ Health System (NSHS), which operates Southside Hospital, told Fox News Latino in a statement, that NHSH \"cares for all patients, regardless of their immigration status or ability to pay.\" \nVillalta said she is grateful for the medical help she has received despite being undocumented, but she still hopes for a transplant. \n“My dream is to be able to find a way, something that will give me the opportunity to live without dialysis,” Villalta told the Daily News recently, after she coughed up blood and experienced a temporary loss of vision and wound up in the ER. \nVillalta has received her regular dialysis treatment at the community care center of the Good Samaritan Hospital Medical Center. \nLike us on Facebook ", "external_links": [], "published": "2015-06-16T03:00:00.000+03:00", "crawled": "2015-06-17T03:21:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}