{"organizations": [], "uuid": "a02f5f1f81281aa0a673ec9685210e1b32f034a9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3033256/images/o-MARIJUANA-PARASITES-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/news.xml", "section_title": "The Huffington Post | Full News Feed", "url": "http://www.huffingtonpost.com/2015/06/05/marijuana-parasites-deworming_n_7497222.html", "country": "US", "title": "New Look At Pot-Smoking Pygmies Suggests Marijuana Helps Deter Parasites", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "New Look At Pot-Smoking Pygmies Suggests Marijuana Helps Deter Parasites", "spam_score": 0.0, "site_type": "news", "published": "2015-06-05T15:13:00.000+03:00", "replies_count": 0, "uuid": "a02f5f1f81281aa0a673ec9685210e1b32f034a9"}, "author": "Macrina Cooper-White", "url": "http://www.huffingtonpost.com/2015/06/05/marijuana-parasites-deworming_n_7497222.html", "ord_in_thread": 0, "title": "New Look At Pot-Smoking Pygmies Suggests Marijuana Helps Deter Parasites", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThe Aka pygmies of Africa's Congo basin are known to smoke a lot of pot, and a new study suggests there may be a big benefit to all that toking, at least for the men: those who smoked the most marijuana were significantly less likely to be heavily infected with parasitic worms . \nTaste for drugs. The researchers behind the study believe the finding helps explain why humans have a taste for all sorts of drugs. Previous research conducted by the team found that Aka who smoked more tobacco also had fewer parasites . \n\"The gist is that most popular drugs, including nicotine, THC [tetrahydrocannabinol, pot's main psychoactive component], cocaine, caffeine, and opium, are plant neurotoxins that evolved to deter, not reward, plant consumption. So why do humans everywhere enthusiastically consume such plant neurotoxins?\" Dr. Edward Hagen , an anthropologist at Washington State University in Vancouver, told The Huffington Post in an email. \"Non-human animals often consume plant toxins to kill their own parasites, and we thought maybe humans might be doing the same thing.\" \nFor the study, Hagen and his colleagues surveyed more than 370 men and women living along the Lobaye River in the Central African Republic. They found that 70 percent of the men reported smoking marijuana. Only 6 percent of women did -- which the researchers attribute to the fact that in the absence of modern birth control, most women between the ages of 18 and 40 are pregnant or nursing. \nUrine samples taken from the men confirmed that 68 percent of them had smoked recently. \nWorm burden. When the researchers took stool samples from the men to assess their \"worm burden,\" they found that 95 percent of them were infected with parasites. High concentrations of THCA -- a byproduct of THC in the urine -- were associated with a low number of worms. \nStill, it's not entirely clear that pot is what kept the heavy smokers' parasites in check. Previous studies showed that marijuana does kill worms in petri dishes, but according to Hagen that doesn't necessarily mean pot has the same effect in humans. \n\"We have one study in one population,\" he said in the email. \"Many more studies are needed to confirm that cannabis actually does reduce worm infections in a live human being.\" \nCloser look at the link. The researchers are calling for more research into the link between THC and the immune system. \nThe study was published online on May 29, 2015 in the American Journal of Human Biology. Also on HuffPost:", "external_links": [], "published": "2015-06-05T15:13:00.000+03:00", "crawled": "2015-06-05T15:30:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}