{"organizations": ["Departing Seattle", "Offutt Air Force Base", "Elmendorf Air Force Base", "University of Texas", "Cadillac Mountain", "Plaza Towers Elementary School", "Gateway Breakfast House", "Gulfport Coast Guard Station", "Sandy Hook Elementary School", "Dover Air Force Base", "Acadia National Park", "La Follette Lancers", "Hill Air Force Base", "Yellowstone National Park", "Morehouse College", "Henry Ford Museum", "U.S. Naval Academy"], "uuid": "63066c18b029afc4245a0d6f88349aa8fc775c97", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150511085228-obama-in-south-dakota-2015-large-169.jpeg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss&author=CNN&title=Politics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/06/08/politics/hillary-clinton-libya-election-2016/index.html", "country": "US", "title": "Obama in 50 states", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama in 50 states", "spam_score": 0.0, "site_type": "news", "published": "2015-06-09T17:21:00.000+03:00", "replies_count": 0, "uuid": "d6033b2ef507639c92906df195a3b6404c00b8c3"}, "author": "", "url": "http://edition.cnn.com/2015/05/08/politics/gallery/obama-in-50-states/index.html", "ord_in_thread": 0, "title": "Obama in 50 states", "locations": ["South Carolina", "Rhode Island", "Portsmouth", "Albuquerque", "New Mexico", "Afghanistan", "Kokomo", "Florida", "Alabama", "Fort Campbell", "New Hampshire", "California", "San Francisco", "Osawatomie", "Newport", "Massachusetts", "Charleston", "Tennessee", "Louisiana", "Maryland", "Memphis", "West Virginia", "Ohio", "Millers Creek", "Omaha", "Idaho", "Burlington", "Virginia", "Cannon Ball", "Mississippi", "Atlanta", "Dearborn", "Minneapolis", "Vermont", "Portland", "Selma", "Wyoming", "New York", "Anchorage", "Kansas", "Columbia Metropolitan Airport", "Grand Isle", "New Jersey", "Michigan", "Pennsylvania", "Colorado", "Maine", "Arkansas", "Vilonia", "Missouri", "Madison", "Richmond", "Chicago", "Iowa", "Gulf of Mexico", "Pyramid Rock Beach", "Oregon", "North Dakota", "Austin", "Indiana", "Wisconsin", "Salt Lake City", "Nevada", "Bismarck", "New Orleans", "Minnesota", "Washington", "Delaware", "Illinois", "Philadelphia", "Hawaii", "Oahu", "Urbandale", "Annapolis", "Connecticut", "Montana", "Youngstown", "Kaneohe Bay", "Oklahoma", "Newtown", "North Carolina", "Arizona", "Watertown", "Denver", "Kentucky", "Moore", "Alaska", "Utah", "Georgia", "Nebraska", "Boise Airport", "Brenton Point", "South Dakota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rebecca", "Sandy", "Joe Biden", "Barack Obama", "John Hickenlooper", "Ferguson", "Glen Allen", "Bill Clinton", "Amy Simpson", "George W. Bush", "Rebekah Erler", "Rebecca Kelley", "Robert C. Byrd", "Etta Cavalier", "Joplin", "Obama", "Pete Souza", "Martha", "Michelle Obama", "Booker T. Washington", "Matt", "Laura Bush", "Andy", "Chris Christie", "Bozeman"], "text": "Updated 1438 GMT (2138 HKT) May 11, 2015 Obama in 50 states 50 photos President Barack Obama, visiting Watertown, South Dakota, on Friday, May 8, shows off a note given to him by 11-year-old Rebecca Kelley. Rebecca had written him a letter asking him to visit South Dakota, which is the 50th state Obama has visited during his time in office. White House photographer Pete Souza highlights a picture from each state. Hide Caption Obama in 50 states 50 photos Marching at the 50th anniversary of Bloody Sunday in Selma, Alabama, on March 7, 2015. Hide Caption 2 of 50 Obama in 50 states 50 photos Air Force One refueling at Elmendorf Air Force Base near Anchorage, Alaska, on November 12, 2009. Hide Caption Obama in 50 states 50 photos Viewing the Grand Canyon in Arizona on August 16, 2009. Hide Caption Obama in 50 states 50 photos Touring tornado damage in Vilonia, Arkansas, on May 7, 2014. Hide Caption Obama in 50 states 50 photos Viewing the Golden Gate Bridge in San Francisco, California, on July 23, 2014. Hide Caption Obama in 50 states 50 photos Playing pool with Gov. John Hickenlooper in Denver, Colorado, on July 8, 2014. Hide Caption 7 of 50 Obama in 50 states 50 photos Making last-minute edits to his speech in Newtown, Connecticut, before a vigil for those killed at Sandy Hook Elementary School on December 16, 2012. Hide Caption 8 of 50 Obama in 50 states 50 photos Honoring fallen soldiers from Afghanistan at Dover Air Force Base in Delaware on October 29, 2009. Hide Caption 9 of 50 Obama in 50 states 50 photos Keeping his distance from a baby alligator on Earth Day at Everglades National Park in Florida on April 22, 2015. Hide Caption 10 of 50 Obama in 50 states 50 photos Graduates cheering the President during a heavy downpour at Morehouse College in Atlanta, Georgia, on May 19, 2013. Hide Caption Obama in 50 states 50 photos Swimming at Pyramid Rock Beach in Kaneohe Bay, Oahu, Hawaii, on January 1, 2012. Hide Caption Obama in 50 states 50 photos Posing for a photo with kids at Boise Airport in Idaho on January 21, 2015. Hide Caption Obama in 50 states 50 photos Viewing Chicago, Illinois, at sunset from Marine One on January 11, 2012. Hide Caption 14 of 50 Obama in 50 states 50 photos Dropping by the Gingerbread House Bakery in Kokomo, Indiana, with Vice President Joe Biden on November 23, 2010. Hide Caption 15 of 50 Obama in 50 states 50 photos Speaking at a grassroots campaign event at Living History Farms in Urbandale, Iowa, on September 1, 2012. Hide Caption Obama in 50 states 50 photos Waving to people after his economic speech in Osawatomie, Kansas, on December 6, 2011. Hide Caption 17 of 50 Obama in 50 states 50 photos Greeting troops with Vice President Joe Biden at Fort Campbell in Kentucky on May 6, 2011. Hide Caption 18 of 50 Obama in 50 states 50 photos Flying over the Gulf of Mexico from Grand Isle to New Orleans, Louisiana, after the BP oil spill on June 4, 2010. Hide Caption 19 of 50 Obama in 50 states 50 photos Hiking with the family on Cadillac Mountain at Acadia National Park in Maine on July 16, 2010. Hide Caption Obama in 50 states 50 photos Graduates celebrating at the U.S. Naval Academy in Annapolis, Maryland, on May 22, 2009. Hide Caption 21 of 50 Obama in 50 states 50 photos Discussing the situation in Ferguson, Missouri, while on vacation in Martha's Vineyard, Massachusetts, on August 14, 2014. Hide Caption 22 of 50 Obama in 50 states 50 photos Sitting on the famed Rosa Parks bus at the Henry Ford Museum in Dearborn, Michigan, on April 18, 2012. Hide Caption 23 of 50 Obama in 50 states 50 photos Talking with letter writer Rebekah Erler at Matt's Bar in Minneapolis, Minnesota, on June 26, 2014. Hide Caption 24 of 50 Obama in 50 states 50 photos Meeting on the BP oil spill in the Gulf of Mexico at the Gulfport Coast Guard Station in Mississippi on June 14, 2010. Hide Caption Obama in 50 states 50 photos Consoling families affected by the deadly tornadoes in Joplin, Missouri, on May 29, 2011. Hide Caption Obama in 50 states 50 photos Fly fishing near Bozeman, Montana, on August 14, 2009. Hide Caption Obama in 50 states 50 photos Greeting military personnel at Offutt Air Force Base near Omaha, Nebraska, on August 13, 2012. Hide Caption Obama in 50 states 50 photos Viewing the Hoover Dam in Nevada on October 2, 2012. Hide Caption 29 of 50 Obama in 50 states 50 photos Joking with Vice President Joe Biden before a campaign rally in Portsmouth, New Hampshire, on September 7, 2012. Hide Caption 30 of 50 Obama in 50 states 50 photos Highlighting the opening of the Point Pleasant Beach boardwalk on May 28, 2013, with New Jersey Gov. Chris Christie and his family after Superstorm Sandy's devastation the previous September. Hide Caption 31 of 50 Obama in 50 states 50 photos Having lemonade with Andy and Etta Cavalier at their home in Albuquerque, New Mexico, on September 28, 2010. Hide Caption 32 of 50 Obama in 50 states 50 photos Greeting families with former first lady Laura Bush (from left), former President George W. Bush and first lady Michelle Obama before a commemoration ceremony on the 10th anniversary of the 9/11 terrorist attacks in New York on September 11, 2011. Hide Caption 33 of 50 Obama in 50 states 50 photos Listening to the President's remarks in Millers Creek, in the foothills of the Appalachians in North Carolina, on October 17, 2011. Hide Caption 34 of 50 Obama in 50 states 50 photos Greeting a young boy during a Flag Day celebration on June 13, 2014, at the Standing Rock Sioux Tribe Reservation in Cannon Ball, North Dakota. Cannon Ball is south of Bismarck. Hide Caption 35 of 50 Obama in 50 states 50 photos Greeting workers during a shift change at V&M Star, a manufacturer of steel products, in Youngstown, Ohio, on May 18, 2010. Hide Caption 36 of 50 Obama in 50 states 50 photos Hugging Amy Simpson, principal of Plaza Towers Elementary School, while viewing the remains of the school after a tornado in Moore, Oklahoma, on May 26, 2013. Hide Caption 37 of 50 Obama in 50 states 50 photos Reacting to a quip from a patron at the Gateway Breakfast House in Portland, Oregon, on July 24, 2012. Hide Caption Obama in 50 states 50 photos Addressing a rally in Philadelphia, Pennsylvania, on October 10, 2010. Hide Caption Obama in 50 states 50 photos Viewing the ocean at Brenton Point in Newport, Rhode Island, on August 29, 2014. Hide Caption 40 of 50 Obama in 50 states 50 photos Reacting to an enthusiastic greeter at Columbia Metropolitan Airport in South Carolina on March 6, 2015. Hide Caption 41 of 50 Obama in 50 states 50 photos Shaking hands with Booker T. Washington students before their commencement ceremony in Memphis, Tennessee, on May 16, 2011. Hide Caption 42 of 50 Obama in 50 states 50 photos Trying on a pair of cowboy boots at the University of Texas in Austin on August 9, 2010. Hide Caption 43 of 50 Obama in 50 states 50 photos Viewing solar panels at Hill Air Force Base, north of Salt Lake City, in Utah on April 3, 2015. Hide Caption Obama in 50 states 50 photos Greeting the crowd in Burlington, Vermont, on March 30, 2012. Hide Caption 45 of 50 Obama in 50 states 50 photos Speaking during a rainstorm in Glen Allen, Virginia, on July 14, 2012. Glen Allen is near Richmond. Hide Caption Obama in 50 states 50 photos Departing Seattle, Washington, on a foggy morning on November 25, 2013. Hide Caption 47 of 50 Obama in 50 states 50 photos Celebrating the life of Sen. Robert C. Byrd with Vice President Joe Biden and former President Bill Clinton, at a memorial service in Charleston, West Virginia, on June 28, 2010. Hide Caption 48 of 50 Obama in 50 states 50 photos Cheering with the La Follette Lancers football team during their practice in Madison, Wisconsin, on September 28, 2010. Hide Caption Obama in 50 states 50 photos Watching geysers with the family at Yellowstone National Park in Wyoming on August 15, 2009. Hide Caption 50 of 50 President Barack Obama recently visited South Dakota, marking the 50th state that he has visited as president. White House photographer Pete Souza highlights a picture from each state. More from Politics", "external_links": [], "published": "2015-06-09T17:21:00.000+03:00", "crawled": "2015-06-09T18:05:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}