{"organizations": [], "uuid": "3e14b7cca493be1ab8a88ee75a38ab27b047022e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/243812-obama-budget-chief-criticizes-senate-energy-spending-bill", "country": "US", "title": "Obama budget chief criticizes Senate energy spending bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama budget chief criticizes Senate energy spending bill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-03T00:29:00.000+03:00", "replies_count": 0, "uuid": "3e14b7cca493be1ab8a88ee75a38ab27b047022e"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/243812-obama-budget-chief-criticizes-senate-energy-spending-bill", "ord_in_thread": 0, "title": "Obama budget chief criticizes Senate energy spending bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama budget chief criticizes Senate energy spending bill By Devin Henry - 06/02/15 05:29 PM EDT \nThe head of the White House's Office of Management and Budget (OMB) rebuked a Senate energy and water spending bill on Tuesday, saying it underfunds \"important investments\" in the energy sector proposed by President Obama. \nOMB Director Shaun Donovan sent a letter to Appropriations Committee chairman Sen. Thad Cochran (R-Miss.) saying the White House has \"serious concerns\" with the committee's $35.4 billion energy and water appropriations package. ADVERTISEMENT The White House's basic objection to the bill is its adherence to \"sequestration\" spending caps Obama wants to remove. Donovan wrote a similar letter about the Senate's military construction and veterans affairs budget, and he sent one to House appropriators about their energy and water funding bill in April.\nObama's budget proposal ignores the spending caps, and the Senate's energy and water appropriations bill is $666 million lower than what Obama wants to spend next year. \nIn his letter, Donovan wrote that the Senate's bill underfunds the Department of Energy's Office of Energy Efficiency and Renewable Energy, which he said \"would slash the number of research, development, and demonstration projects supported in cooperation with industry, universities, and the national labs.\" \nThe bill cuts funding for electric grid reliability by 44 percent compared to Obama's budget, and Donovan said that would hurt efforts to modernize the grid. He slammed the bill for underfunding an energy research agency and cutting spending on climate change programs. \nThe bill has \"ideological riders\" related to information technology oversight at Department of Energy labs, Donovan wrote, which \"threatens to undermine an orderly appropriations process.\" \nThe Appropriations Committee approved the energy and water bill in May. Many Democrats on the committee supported it, and Republicans said they kept the most controversial riders off the bill, though they could come up in floor debate later on. \nDonovan's letters portend a larger fight between the administration and Congress on overall spending levels this session. \n\"The President's senior advisors would recommend that he veto any legislation that implements the current Republican budget framework, which blocks the investments we need for our economy to compete in the future,\" Donovan wrote. Tags: Paul joins crusade to expose... The Bush administration blacked out 28 pages extracted from a... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-03T00:29:00.000+03:00", "crawled": "2015-06-03T02:21:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}