{"organizations": [], "uuid": "bd12435a78212a67a87c056f1724af6cb643b094", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/assets/0/0/obamagovpoll.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/30/fox-news-poll-voters-distrust-government-say-obama-not-most-transparent/", "country": "US", "title": "Fox News Poll: Voters distrust government, say Obama not most transparent", "performance_score": 3, "site": "foxnews.com", "participants_count": 16, "title_full": "Fox News Poll: Voters distrust government, say Obama not most transparent | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T03:00:00.000+03:00", "replies_count": 18, "uuid": "3042756921df442ef5d414bd625f4b2f08b745ea"}, "author": "Dana Blanton", "url": "http://www.foxnews.com/politics/2015/06/30/fox-news-poll-voters-distrust-government-say-obama-not-most-transparent/#post-0", "ord_in_thread": 0, "title": "Fox News Poll: Voters distrust government, say Obama not most transparent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Dana Blanton \nPublished June 30, 2015 FoxNews.com   livefyre Email Print June 29, 2015: President Obama speaks in the East Room of the White House in Washington before signing H.R. 2146 Defending Public Safety Employees Retirement Act and H.R. 1295 Trade Preferences Extension Act of 2015.  (AP Photo/Evan Vucci) \nThe nation’s upcoming birthday party could be awkward -- as our relationship with Uncle Sam is on the rocks. \nMost American voters distrust their government, are unsure their president is honest, and feel Barack Obama has made false claims about transparency in his administration.\nThe latest Fox News national poll finds that 61 percent don’t trust the federal government. That’s just one percentage point below the record high of 62 percent distrust in both 2013 and 2011. And it’s a reversal from 2002, soon after the 9/11 attacks, when a 54-percent majority trusted Uncle Sam and only 36 percent didn’t (June 2002). \nClick to read the full poll results \nTrust among Democrats has gone up since 2002, when George W. Bush was president. It was 47 percent then compared to 54 percent in the new poll. \nTrust has precipitously dropped among independents (-32 points) and Republicans (-38 points) over that same time period. Among independents, 53 percent trusted the government in 2002, while 21 percent say the same now. For Republicans, trust was 63 percent then and it’s 25 percent now.\nMeanwhile, voters continue to disagree with the administration’s repeated claim that it is the “most transparent administration in history.” Only 29 percent agree with that. Two-thirds say this isn’t the most open White House (67 percent). Last year, it was 28-68 percent (July 2014).\nThe reviews are far from glowing even among the president’s party faithful: 49 percent of Democrats say Obama is the most transparent, while 46 percent disagree.\nOverall, 47 percent of voters think President Obama is honest and trustworthy, yet slightly more -- 50 percent -- say he isn’t. That’s almost identical to last year when it was 48-50 percent (July 2014).\nObama’s high honesty mark was in April 2009, when he had been in office about 100 days. At that time, 73 percent said he was honest and trustworthy and 22 percent disagreed.\nFully 94 percent of Democrats said Obama was honest and trustworthy in 2009. That’s down 14 points to 80 percent in the new poll. For independents, it’s a 32-point drop: 73 percent honest in 2009 and 41 percent now. Among Republicans: 43 percent said Obama was honest in 2009, while just 13 percent say the same today (-30 points).\nThe Fox News poll is based on landline and cell phone interviews with 1,005 randomly chosen registered voters nationwide and was conducted under the joint direction of Anderson Robbins Research (D) and Shaw & Company Research (R) from June 21-23, 2015. The full poll has a margin of sampling error of plus or minus three percentage points.", "external_links": [], "published": "2015-06-30T03:00:00.000+03:00", "crawled": "2015-06-30T17:04:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}