{"organizations": [], "uuid": "bdb703fba59263bf752605d28f406d270885e103", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/putinvladimir_obamabarack_061912getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/246222-putin-phones-obama-ahead-of-iran-nuke-deadline", "country": "US", "title": "Putin phones Obama ahead of Iran nuke deadline", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Putin phones Obama ahead of Iran nuke deadline", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T01:41:00.000+03:00", "replies_count": 0, "uuid": "bdb703fba59263bf752605d28f406d270885e103"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/246222-putin-phones-obama-ahead-of-iran-nuke-deadline", "ord_in_thread": 0, "title": "Putin phones Obama ahead of Iran nuke deadline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Putin phones Obama ahead of Iran nuke deadline By Jordan Fabian - 06/25/15 06:41 PM EDT Russian President Vladimir Putin called President Obama on Thursday as a group of six world powers, including Russia and the U.S., rushes to complete a nuclear agreement with Iran. The two leaders “underscored the importance of continued P5+1 unity in ongoing negotiations to prevent Iran from acquiring a nuclear weapon,” the White House said in a statement. The call came as negotiators meeting in Vienna are trying to hammer out the final details of a pact that would curb Teheran’s nuclear program in exchange for sanctions relief before a self-imposed June 30 deadline. ADVERTISEMENT Western nations have expressed concern that Russia would be unwilling to reimpose international sanctions related to Iran’s nuclear activities if it decides to violate the terms of the agreement, a key U.S. demand in the talks. During the rare call with the Russian leader, Obama also voiced concern with Russia’s support for separatists operating in eastern Ukraine. “President Obama reiterated the need for Russia to fulfill its commitments under the Minsk agreements, including the removal of all Russian troops and equipment from Ukrainian territory,” the White House statement said. Three weeks ago, Obama met with other leaders of industrial democracies at the Group of Seven summit in Germany, where they sought to reinforce their efforts to isolate Putin. Leaders agreed to maintain sanctions on Russia as long as it continues to fuel the ongoing conflict in Ukraine. “Does he continue to wreck his country’s economy and continue Russia’s isolation in pursuit of a wrongheaded desire to recreate the glories of the Soviet empire?” Obama said at the close of the summit. “Or does he recognize that Russia’s greatness does not depend on violating the territorial integrity and sovereignty of other countries?” Putin and Obama also discussed other topics, such as the fight against the Islamic State in Iraq and Syria and the Syrian civil war. Tags:", "external_links": [], "published": "2015-06-26T01:41:00.000+03:00", "crawled": "2015-06-26T03:50:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}