{"organizations": [], "uuid": "cd73b506a5aafc9b02e46d3a849356f1867f300a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3081562/images/o-JOHN-BOEHNER-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/16/tpa-path-forward_n_7599830.html", "country": "", "title": "Path Forward For Obama And Boehner's Trade Agenda Is A Game Theory Jumble", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Path Forward For Obama And Boehner's Trade Agenda Is A Game Theory Jumble", "spam_score": 0.0, "site_type": "news", "published": "2015-06-17T07:05:00.000+03:00", "replies_count": 0, "uuid": "cd73b506a5aafc9b02e46d3a849356f1867f300a"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/16/tpa-path-forward_n_7599830.html", "ord_in_thread": 0, "title": "Path Forward For Obama And Boehner's Trade Agenda Is A Game Theory Jumble", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boehner", "Obama"], "text": "Path Forward For Obama And Boehner's Trade Agenda Is A Game Theory Jumble Posted: \nWASHINGTON -- The path ahead for President Barack Obama's battered trade agenda is coming into focus. Here’s how it is likely to unfold, according to well-placed House and Senate sources. \nFirst, a few definitions. \nTPA: Trade promotion authority, aka \"fast track.\" Obama and House Speaker John Boehner (R-Ohio) want it, while progressive Democrats and tea party Republicans oppose it. If Obama gets TPA, he can push the 12-nation Trans-Pacific Partnership, or TPP, through Congress. It can't be filibustered or amended, so the vote on fast track is the whole ballgame. If fast track gets through, TPP is almost guaranteed to be approved. \nTAA: Trade adjustment assistance. Trade deals and corporate governance partnerships cost American jobs. Workers dislocated by trade deals are eligible for assistance that helps them get trained for new work. It's not very effective, but at least it's something. \nNow, here's where we're headed: \n1. The House will take up fast track without TAA \nRepublicans called off Tuesday night's Rules Committee meeting lest Democrats feel pressured, and to make sure no surprises awaited on the House floor. Republicans are confident all 28 Democrats who backed fast track last week will stick around. With 219 votes, they can only stand to lose two, if everybody shows up. One of those 28 told HuffPost he doesn't see \"how I can support TPA without TAA.\" But even if some of the 28 drop off, Boehner may have had some votes in reserve he could call on in a pinch. If TPA passes the House, it goes to the Senate. But first: \n2. The Senate takes up AGOA, and amends it with TAA \nIn a clever move, the Senate will then vote on the House version of the African Growth and Opportunity Act, or AGOA, which boosts trade from some sub-Saharan African countries and is a priority of many Democrats, including those in the Congressional Black Caucus. Adding TAA only makes it that much more of a Democratic bill. Absent tactical plays from Senate Democrats, it will pass easily. \nBut tactics could come into play: Senate Democrats could conceivably refuse to support fast track before the House proves that it can pass TAA, arguing that Republicans could always stymie the aid to workers after they get what they want, which is fast track. \"Some pro-trade Senate Ds are uncomfortable betting that TAA will pass,\" said one senior Democratic aide. HuffPost spotted Senate Majority Leader Mitch McConnell (R-Ky.) in the Capitol on Tuesday evening and asked if he could pass fast track without TAA. \"We're working on it,\" he said in an unusually verbose response. (He normally just feigns deafness to reporters.) \n\"TPA has to be on track to make it to potus before TAA, otherwise Ds on the House side will continue to strategically vote,\" one House Republican aide said. \"We have to make TPA a fait accompli to House Ds, while simultaneously committing to Senate Ds that TAA will get done.\" \nThe path forward has led to an unusual situation: Senate GOP leadership is working to find Democratic votes to pass fast track, but isn't there yet, while House GOP leadership is working to find Republican votes for TAA, but isn't there yet. \nIf it becomes a staring contest over who should approve TAA first, fast track could be in trouble. If you're a Senate Democrat, how much of your political fortune do you want to risk trusting Boehner? But the president will be able to argue that he has a commitment from Boehner in the House to move TAA through. Unlike the House, where Obama spoke before a large group and did damage to his own cause, he can work senators individually. If the Senate passes AGOA with TAA attached: \n3. The Senate takes up fast track \nThe Senate would likely be unable to pass fast track without TAA, but given that senators will have just voted to approve it in a separate bill, there is a good chance the 62 votes that were there last time will still be there. The spotlight will be on Sen. Maria Cantwell (D-Wash.) and three other Democrats who only voted for fast track after getting a promise of a vote on reauthorizing the Export-Import Bank. The gang of four feel like McConnell didn't follow through on the promise in a real way. Look for them to demand a full, meaningful vote in both the House and Senate in order to go along with fast track. Without authorization, the bank's charter expires June 30. \nIf fast track passes, it heads to the president's desk for his signature. Then: \n4. The House takes up AGOA with TAA attached to it \nBy now, House Democrats know that Congress has approved fast track, and it merely awaits the president's signature. The president has promised he won't sign fast track without aid for dislocated workers, but he also knows that if he does, Democrats will cave and give it to him. Progressive Democrats are the last group of legislators who would reject aid for workers out of spite if they've already lost. So the president will sign fast track into law, and the House will take up AGOA with TAA attached. At this point, Boehner has little interest in whether it pases, but with unanimous Democratic support, not many Republicans would be needed. Then: \n5. China surrenders ", "external_links": [], "published": "2015-06-17T07:05:00.000+03:00", "crawled": "2015-06-17T07:05:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}