{"organizations": ["UN"], "uuid": "ea0df14a22a46fb77c9e09c412a7a1948f9b1ba9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3085592/images/o-BERNARDINO-LEON-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/17/libya-peace-uae-qatar_n_7605898.html", "country": "", "title": "Obama Brokered A Secret Deal Between Two Arab States That Could Help End Libya's Civil War", "performance_score": 4, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Brokered A Secret Deal Between Two Arab States That Could Help End Libya's Civil War", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T00:26:00.000+03:00", "replies_count": 0, "uuid": "ea0df14a22a46fb77c9e09c412a7a1948f9b1ba9"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/17/libya-peace-uae-qatar_n_7605898.html", "ord_in_thread": 0, "title": "Obama Brokered A Secret Deal Between Two Arab States That Could Help End Libya's Civil War", "locations": ["Morocco", "Libya Dawn", "Libya", "Tripoli"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bernardino Leon", "Obama"], "text": "Obama Brokered A Secret Deal Between Two Arab States That Could Help End Libya's Civil War Posted: Updated: 24 minutes ago Libyan supporters of 'Fajr Libya' (Libya Dawn), a mainly-Islamist alliance, shout slogans during a protest againt the UN-brokered talks in Morocco between Libya's two rival parliaments on March 6, 2015 in Tripoli's central Martyr's Square. UN envoy Bernardino Leon shuttled between representatives of the two rival parliaments in Morocco, aiming to broker a deal on a national unity government and finding someone to head it. AFP PHOTO / MAHMUD TURKIA (Photo credit should read MAHMUD TURKIA/ | MAHMUD TURKIA via Getty Images reddit \nWASHINGTON -- Qatar and the United Arab Emirates, two U.S. allies that have been fighting a proxy war in Libya since shortly after the 2011 overthrow of Libyan dictator Muammar Gaddafi , have agreed in principle to resolve their differences, The Huffington Post has learned. This previously unreported commitment, made between top leaders under pressure from President Barack Obama during talks at Camp David on May 14, suggests that peace negotiations in Berlin between the Gulf states' Libyan proxies may yet bear fruit. \nThe Qatar-backed, Islamist-aligned Tripoli government controls most of western Libya, while the UAE-linked, internationally recognized Tobruk government dominates the east. Peace between them would allow the two governments, their Gulf allies and the U.S. to focus on fighting the al Qaeda- and Islamic State-affiliated militant groups that have gained ground in Libya during its ongoing civil war. \nObama was the first to bring up the Gulf states' proxy war at the Camp David summit, according to a senior Gulf diplomat present at the meeting. \"The president said people from this table are supporting each side in Libya,\" the diplomat told HuffPost. Obama emphasized that he would like to see an \"inclusive\" political solution -- implying he was unwilling to allow the UAE-backed Tobruk government to dominate other actors, specifically the Qatar-backed Islamists in Tripoli. The president's comment prompted Qatar's ruler, Sheikh Tamim bin Hamad Al-Thani, to appeal to the top official present from the UAE, Crown Prince Muhammed Bin Zayed Al Nahyan, to agree to a political solution, according to the diplomat. \nZayed then said he would work with the Qataris in Libya, according to multiple diplomatic sources. \nThe Gulf diplomat present at the meeting, who is familiar with the past few years of Qatari and UAE involvement in Libya, called that commitment a first-of-its-kind agreement. It is understood to have paved the way for the current talks, particularly because the two Gulf states agreed not to criticize the peace process publicly. \nThe revelation suggests that Obama's Camp David summit accomplished more than has been previously appreciated. A White House spokesman declined to comment on the specific conversation, but noted that Libya was a pressing worry discussed at the summit. \"All leaders at Camp David decided to move in concert to convince all Libyan parties to accept an inclusive power-sharing agreement based on proposals put forward by the UN and to focus on countering the growing terrorist presence in the country,\" said Alistair Baskey, a spokesman for the National Security Council. \"There was a shared recognition that there is no military solution to the conflict, and that it can only be resolved through political and peaceful means.” \nThe agreement between Qatar and the UAE represents a noteworthy softening in the positions of the two countries, which have dramatically different views of political Islam. Qatar and its ally, the Islamist government of Turkey, have proved willing to back Islamist groups throughout the Muslim world in the wake of the Arab Spring. The UAE and its ally, Egypt, which often equate political Islam with extremism, have gone so far as to intervene directly to undermine Islamists, launching air strikes within Libya. \nThe dispute has become especially bitter as extremists have flexed their muscles in Libya. In February, after ISIS slaughtered 21 Egyptian Christians in Libya, Egypt launched airstrikes there and charged Qatar with supporting terrorism. Qatar recalled its ambassador from Cairo in protest. The other Gulf states -- a majority of which, including the UAE, have supported Egyptian President Abdel Fattah al-Sisi in his crackdown on Islamists in his country -- struggled to diplomatically express support for both sides and reduce tension. \nIslamic State-affiliated militants like those who killed the Egyptian Christians have gained ground while the Qatari- and Emirati-backed proxies have fought for control of the country. This month, ISIS-tied militants captured a power plant outside the western Libyan city of Sirte from Qatar-backed Libya Dawn, then seized control of parts of the city itself. The militants' advance underscored that both sides in Libya are at risk because of the extremists -- a point observers continue to make even as the UAE-backed government has denied the Islamists' political legitimacy. \nMeanwhile, al Qaeda affiliates like the group that attacked the U.S. consulate in Benghazi in 2012 continue to operate in Libya: On Sunday, the U.S. announced that American fighter jets had targeted a former top al Qaeda operative in the eastern city of Ajdabiya. \nRecent developments in Berlin suggest Obama's push for peace may succeed. Last week, political representatives from the Qatar-aligned Tripoli faction and the UAE-linked Tobruk coalition sat down at the same table for the first time since they established separate governments last year. And the Qatar-backed Tripoli side's principal fighters, those from the port city of Misrata, reduced international fears about Islamist influence in their coalition by declaring that they would cut ties to extremists. Bernardino Leon, the United Nations special envoy for Libya and the convenor of the talks, said he aims to reach an agreement between them by Thursday, the beginning of the Islamic holy month of Ramadan. \nBut another Gulf diplomat told The Huffington Post it remained to be seen whether the two sides' proxies would agree to the United Nations proposal for a unity government. A chief concern is that Khalifa Haftar, a powerful militia leader working alongside the UAE-supported Tobruk government, might not put down arms even if his political allies agree to make peace in Berlin. Haftar said during an earlier round of peace talks that he was \"betting on a military solution.\" \nBut other analysts argue that Haftar and other militia leaders are simply bargaining chips in the broader peace process, and aren't strong enough to derail a peace process that all the key players -- from the Obama administration to the Libyan factions' principal backers -- now appear to want. Achieving peace in Libya is an especially important goal for European policy-makers, not only because of the militant threat but also because Libya's chaos has enabled a flourishing human trafficking industry that shuttles thousands of Africans across the Mediterranean. “We have to try and bring more stability to Libya,\" German foreign minister Frank-Walter Steinmeier said in April . \"Only that way can we stop Libya from continuing to be used by people-smugglers.” \nLeon, the UN envoy, said last week that reaching an agreement before Thursday was not \"a sacred goal.\" But Steinmeier, standing by Leon's side, warned that the peace talks were \"perhaps the last chance for a long time for Libya to avoid breaking apart.\" Also on HuffPost: ", "external_links": [], "published": "2015-06-18T00:26:00.000+03:00", "crawled": "2015-06-18T00:32:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}