{"organizations": [], "uuid": "6e1b2cc4d5ca852ed36d9a4dd907317ec2fb81d6", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/061815_out_obama_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/18/obama-hits-gun-control-theme-in-reaction-to-church-shootings/", "country": "US", "title": "Obama hits gun control theme in reaction to church shootings", "performance_score": 0, "site": "foxnews.com", "participants_count": 16, "title_full": "Obama hits gun control theme in reaction to church shootings | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T03:00:00.000+03:00", "replies_count": 19, "uuid": "ca14f6bcc33a5ef79e82e81b52b97d8d232b7565"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/18/obama-hits-gun-control-theme-in-reaction-to-church-shootings/#post-0", "ord_in_thread": 0, "title": "Obama hits gun control theme in reaction to church shootings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 18, 2015 FoxNews.com livefyre Email Print\nPresident Obama on Thursday linked gun control to the Charleston church shooting in his first statement on Thursday, saying the nation needed to “come to grips” with the issue in the wake of the massacre that killed nine people.\n“At some point, we as a country will have to reckon with the fact that this type of mass violence does not happen in other advanced countries. It doesn’t happen in other places with this kind of frequency,” Obama said. “And it is in our power to do something about it.”\nObama’s Justice Department is investigating the mass shooting as a hate crime. But as the president addressed the tragedy in the White House briefing room, he also turned to politics -- trying to focus the national conversation not just on race and violence, but gun laws.\nOnce again, the president said, someone who wanted to do harm “had no trouble getting their hands on a gun.” The man arrested in the killings, Dylann Roof, reportedly received a .45-caliber pistol from his father for his 21st birthday in April.\nDespite his raising the issue, Obama seemed aware of the challenge of passing any gun control measures in the current environment, saying “politics” in Washington “foreclose a lot of those avenues right now.”\nSpeaking after previous mass shootings, Obama has on several occasions said more gun laws could help prevent such violence.\nAfter the shooting at the Sandy Hook, Conn., Elementary School in 2012, the Obama administration launched a push with pro-gun control allies in Congress to pass new gun and background check restrictions. The effort failed.\nAdvertisement\nTrending in Politics 1 Supreme Court: Texas can refuse to issue Confederate flag license plate 2 Cruz moves to fine State Department for illegally withholding key Iran report 3 House OKs Obama trade agenda on 2nd try, bill heads to Senate 4 S.C. pastor killed in church attack a leader in religious, political communities 5 Justices rule for small Arizona church in sign dispute See all Trends Advertisement", "external_links": [], "published": "2015-06-18T03:00:00.000+03:00", "crawled": "2015-06-18T22:20:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}