{"organizations": ["White House"], "uuid": "4da75110e50da5cc4b2ddddd256dac6d1a1b33d9", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Obama%20Scolds%20Heckler.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/25/obama-scolds-transgender-immigrant-who-heckled-him-at-white-house-shame-on/", "country": "", "title": "Obama scolds transgender immigrant who heckled him at White House: 'Shame on you!' | Fox News Latino", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama scolds transgender immigrant who heckled him at White House: 'Shame on you!' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "4da75110e50da5cc4b2ddddd256dac6d1a1b33d9"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/25/obama-scolds-transgender-immigrant-who-heckled-him-at-white-house-shame-on/", "ord_in_thread": 0, "title": "Obama scolds transgender immigrant who heckled him at White House: 'Shame on you!' | Fox News Latino", "locations": ["East Room", "Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Obama"], "text": "Obama scolds transgender immigrant who heckled him at White House: 'Shame on you!' Published June 25, 2015 Fox News Latino President Barack Obama responds to a heckler as he speaks during a reception to celebrate LGBT Pride Month in the East Room of the White House, on Wednesday, June 24, 2015, in Washington. (AP Photo/Evan Vucci) \nPresident Barack Obama scolded a heckler at a gay pride month reception at the White House Wednesday, saying that the protester was being disrespectful in \"my house.\" \nThe heckler, Jennicet Gutiérrez, had interrupted Obama's remarks by protesting the detention and deportation of gay, lesbian and transgender immigrants. \nGutiérrez is a transgender immigrant from Mexico and a member of FAMILIA TQLM, established to advocate for LGBTQ immigrants often excluded in the immigration debate. \n\"President Obama, release all LGBTQ immigrants from detention and stop all deportations.\" Gutiérrez said, adding that she could not celebrate while some 75 transgender detainees were still in ICE custody. \nThe president responded to Gutiérrez's interruption by saying, \"Hold on a second.\" When the heckler persisted, Obama, flashing an exasperated look, countered, \"OK, you know what?\" Wagging his finger and shaking his head, Obama said, \"No, no, no, no, no,\" repeating the word more than a dozen times. \nAs the heckler continued to talk over him, Obama took it up a notch. \n\"Hey. Listen. You're in my house,\" he said to laughter and woos from the crowd. \"You know what? It's not respectful when you get invited to somebody. You're not going to get a good response from me by interrupting me like this. I'm sorry. I'm sorry ... Shame on you, you shouldn't be doing this.\" \nIn his remarks, Obama said that regardless of how the Supreme Court rules in an upcoming decision on gay marriage, there has been an undeniable shift in attitudes across the country. He said he's closely watching the decisions the high court will announce in the coming days, which include a case that could affirm the right of gay couples nationwide to marry. \nThe president singled out discrimination facing transgender Americans as an area where more progress needs to be made. \nObama's comments appeared to do little to appease Gutiérrez, whose comments to the immigrant rights group #Not1More echoed what she told the president. \n\"The White House gets to make the decision whether it keeps us safe,\" explains Gutiérrez \"There is no pride in how LGBTQ and transgender immigrants are treated in this country. If the President wants to celebrate with us, he should release the LGBTQ immigrants locked up in detention centers immediately.\" \nThe Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-06-25T03:00:00.000+03:00", "crawled": "2015-06-26T09:27:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}