{"organizations": ["Fox News Latino", "Fox News Latino Rubio"], "uuid": "9ea833c5bf0820da79104abea15b9250631ad346", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Rubio%20Retirement%20Fund.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/18/rubio-slams-obama-for-not-immediately-releasing-details-government-hack/", "country": "", "title": "Rubio slams Obama for not 'immediately' releasing details of government hack | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Rubio slams Obama for not 'immediately' releasing details of government hack | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "9ea833c5bf0820da79104abea15b9250631ad346"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/18/rubio-slams-obama-for-not-immediately-releasing-details-government-hack/", "ord_in_thread": 0, "title": "Rubio slams Obama for not 'immediately' releasing details of government hack | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama", "Rubio"], "text": "Rubio slams Obama for not 'immediately' releasing details of government hack Published June 18, 2015 Fox News Latino (AP Photo/David Goldman) \nFlorida Sen. Marco Rubio demanded on Thursday that the Obama administration \"immediately\" release all information about the massive hack that has affected roughly 4.2 million current and former government branch workers. \nThe Republican presidential hopeful made his comments only hours after it was revealed that the White House waited roughly four weeks before telling the public that hackers had stolen the personal information. \n\"All details that can be shared with the public, and especially those affected, should be released immediately to halt the slow, trickle of bad news that keeps coming from this attack,\" Rubio said in a statement . \nA White House official, who was not authorized to speak publicly about the break-in, justified the delay saying it was needed to identify what information was exposed and how many people were affected, and ensure that a public announcement wouldn't interfere with the investigation and establish a process to notify affected employees. \nWeeks later, the U.S. still doesn't know exactly what information was exposed or how many people were affected, and it has not provided detailed warnings to employees whose information was compromised. \n\"We are working with the agencies right now to determine how many of their employees were affected,\" the U.S. Office of Personnel Management’s director, Katherine Archuleta, said on Capitol Hill. \"We do not have that number at this time.\" \nRubio has also used the breach to rail against the Obama administration’s handling of its relations with China. The Obama administration is increasingly confident that China's government, not criminal hackers, was responsible for the hack. \n\"With its growing regional expansionism and illegitimate territorial claims in the South China Sea, its rapid military buildup in defense capabilities, its provocative activities in space and its 24-7 offensive cyber attacks against the U.S. government and private sector, it’s clear the past six and a half years of the Obama foreign policy have sent the wrong message to Beijing,\" Rubio said. \nChina has openly denied involvement in the break-in, and the U.S. has publicly provided no direct evidence proving China was responsible. \nInvestigators inside U.S. intelligence and law enforcement agencies, using secret \"beacons\" employed across the Internet, have been monitoring data transmissions across overseas networks for the file properties associated with the American personnel records, and scouring communications among targeted foreign hackers for credible references to the theft, two people directly involved in the investigation said. They spoke on condition of anonymity because parts of the case and techniques being used are classified. \nThe investigation is being coordinated at the little-known National Cyber Investigative Joint Task Force, which is led by the FBI and includes 19 intelligence agencies and law enforcement, including the National Security Agency, CIA, Homeland Security Department, Secret Service and U.S. Cyber Command. \nInvestigators also have watched underground markets where identity thieves peddle information and found no trace of the data stolen from the U.S. Office of Personnel Management, they said. In the chessboard world of espionage, they also acknowledged that by revealing what they said was indirect evidence that spying was actually the motive, it might encourage Beijing's government to sell at least some of the data surreptitiously to implicate identity thieves in what would be a counter-counterintelligence false-flag operation. \nThe administration acknowledged earlier this month that hackers stole the personnel files and background investigations of current and former civilian, intelligence and military employees, contractors and even job applicants. Initially, the U.S. said the stolen data included Social Security numbers, birth dates, job actions and other private information for 4.2 million workers. \nDays later, it acknowledged that the cyber spies obtained detailed background information on millions of military, intelligence and other personnel who have been investigated for security clearances. That information included details about drug use, criminal convictions, mental health issues and the names and addresses of relatives and any foreigners with whom they had contact. \nThe Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-06-19T03:00:00.000+03:00", "crawled": "2015-06-20T05:43:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}