{"organizations": [], "uuid": "12ef6d7f18b8bcd493899d87b3b774951df9534e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3058472/images/o-MIMI-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/15/gillian-jacobs-girls_n_7556776.html", "country": "", "title": "Gillian Jacobs Discusses Her Abortion Storyline On 'Girls'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Gillian Jacobs Discusses Her Abortion Storyline On 'Girls'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-15T18:10:00.000+03:00", "replies_count": 0, "uuid": "12ef6d7f18b8bcd493899d87b3b774951df9534e"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/15/gillian-jacobs-girls_n_7556776.html", "ord_in_thread": 0, "title": "Gillian Jacobs Discusses Her Abortion Storyline On 'Girls'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gillian Jacobs"], "text": "Gillian Jacobs Discusses Her Abortion Storyline On 'Girls' Posted: \nLast season, \"Girls\" took on abortion and handled the subject matter with a frankness rarely seen on TV . \nIn one of the more important scenes of the show, Mimi-Rose, played by Gillian Jacobs, tells Adam (Adam Driver) that she can't go for a run because she had an abortion. When he responds with a very Adam-like tantrum, Mimi-Rose remains calm. \"It was smaller than a seed pearl,\" she says. \"It didn't have a penis or a vagina.\" \nTaken as a whole, the episode offers a refreshing look at abortion, presenting it as a reality of many women's lives as opposed to some melodramatic tragedy, as it so often appears. As Emmy nominations approach, The Huffington Post spoke to Jacobs about crafting the character of Mimi-Rose and the state of abortion representation on TV. \nWhat were your thoughts when you first saw the script with Mimi-Rose's abortion storyline? I think that Jenni Konner and Lena Dunham wanted to tell a different sort of story in regards to that episode. I think it was a very different approach to that storyline than you normally see on TV. And I know that Jenni and Lena work with Planned Parenthood and they consulted with them on the show. So, I thought it was very well done. \nWe don't often see such frank discussions of abortion on TV. The success of \"Obvious Child\" definitely made room for different sorts of storytelling around that topic. After Gillian Robespierre and Jenny Slate's film, it felt like a continuation of that conversation. Hopefully there's continued space for women to tell different sorts of stories in that arena. \nDo you think it's easier to handle the topic on TV or in film? I'm not the person to ask! I'm not creating the content. But I do think Jenni Konner and Lena Dunham have carved out a space on television where they're able to speak frankly on a number of different topics involving women and various issues of reproductive rights. So, I would certainly say that \"Girls\" has created a space on TV for these issues to be discussed. And I know how hard it is to make indie films. But hopefully given the success of \"Obvious Child\" and the success of \"Girls,\" more women will be given the opportunity. \nHow did you end up joining \"Girls\"? Well, it's going to sound fake, but I was walking down the street in New York, I could tell that something was shooting and in the back of my head I thought, \"Maybe it's 'Girls.'\" And I've known Lena for a long time and I knew Jenni Konner. Soon I realized it was \"Girls,\" and I looked through the window and made eye contact with Jenni, and she kind of waved me in. \nSo I found myself kind of on the set, saying, \"Hi,\" to the actors I knew that were working that day and hanging out by the monitor with Jenni, and she said, \"Oh, have they spoken to you about the part?\" I said, \"What are you talking about?\" She's like, \"Oh, we were thinking about you for this role!\" And then I left the set, I get a call from my agent saying \"Girls\" wanted to talk to me about this part, and I was like, \"Well, I know, because I was just on set.\" It was very kind of serendipitous. \nYou're right, that sounds fake. I think they had been thinking about me! But me winding up on the set maybe pushed me more into the forefront of their minds. I don't know, you'd have to talk to Jenni and Lena about that one. I think the call had already been made before I showed up on set. I think that just made me more present in their mind. \nHow was Mimi-Rose presented to you? She's pretty awful to Adam in that last episode they share. In one of the first times you see her, she's giving that sort of fake TED Talk that Hannah's watching on her phone, and she's describing her philosophy on relationships and how romantic relationships create all this artificial strife and that a lot of issues in life come from romantic relationships. [She says] you just have to separate yourself from that to treat yourself well and she really believes that! I mean, as evidenced by her breaking up with Adam in a very abrupt manner. You know, it's not the way I'd handle a break up, but she's staying true to herself and choosing no one. Not to say I don't think she could get back together with Ace at some point down the road. But in that moment, she's choosing herself. \nShe's an interesting take on the frighteningly perfect new girlfriend. I think they also liked the notion of plopping a woman who was more successful than the rest of the girls in the group in their midst. She's not struggling as much as they are. She has challenges professionally, but on the surface, she's a lot further along than they are in her career. And I think that naturally fosters an insecurity [in Hannah] in comparing herself to Mimi-Rose. \nDo you know if you'll be back? I don't know. I've told them on many occasions that I'm ready and willing to be back. I have no idea, but I'd love to come back ... \"Community\" famously has been a very dramatic up-and-down roller coaster separate from the show. You know, we've been cancelled and un-cancelled, we've had our creator fired and rehired, we've had cast members leave. \"Girls\" was just a respite from all that drama. \nThis interview has been edited and condensed. Related on HuffPost: ", "external_links": [], "published": "2015-06-15T18:10:00.000+03:00", "crawled": "2015-06-15T18:42:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}