{"organizations": [], "uuid": "163f3953c93730cf6249e65f4bf91476b65b9e76", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/micajohnmarijuanafakejoint_060814getty.jpg", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/regulation/legislation/243632-lawmakers-pushing-for-marijuana-vote-a-rama", "country": "US", "title": "Lawmakers brace for 'marijuana-vote-a-rama'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Lawmakers brace for 'marijuana-vote-a-rama'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-01T21:26:00.000+03:00", "replies_count": 0, "uuid": "163f3953c93730cf6249e65f4bf91476b65b9e76"}, "author": "Tim Devaney", "url": "http://thehill.com/regulation/legislation/243632-lawmakers-pushing-for-marijuana-vote-a-rama", "ord_in_thread": 0, "title": "Lawmakers brace for 'marijuana-vote-a-rama'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Tim Devaney - 06/01/15 02:26 PM EDT Lawmakers are prepping for what could turn into a \"marijuana vote-a-rama\" Wednesday, sources say. Pot advocates expect lawmakers to introduce at least half a dozen marijuana-related appropriations amendments that would roll back the Justice Department’s authority to enforce drug laws around the country. The marijuana amendments would handicap the Department of Justice (DOJ) in its fight with states over the enforcement of local pot laws. ADVERTISEMENT “The politics have continued to shift in favor of marijuana law reform,” said Tom Angell, chairman of the Marijuana Majority. \"For a long time, lawmakers treated marijuana as a third-rail issue that was too dangerous to touch,” he added. \"But now that polling shows a growing majority of voters supports ending prohibition, more and more elected officials are starting to realize that demonstrating leadership on this issue has political benefits instead of harms.” The marijuana amendments come as part of the Justice Department’s funding bill, which dictates the terms in which the agency can use the money. Pot advocates are making a big push in advance of the vote to rally lawmakers to their side. The Justice Department would be prohibited from using federal funds to interfere with states’ medical marijuana laws under an amendment expected from the California delegation — Reps. Dana Rohrabacher (R) and Sam Farr (D). The measure was approved by Congress for the first time in 2014 but it must be renewed each year when the DOJ’s spending bill expires. Some lawmakers hope to push the boundaries even further. An amendment from Reps. Tom McClintock (R-Calif.) and Jared Polis (D-Colo.) would prohibit DOJ from using federal funds to interfere with any state marijuana law, including laws permitting the recreational use of pot. \"This amendment will not only protect critically ill medical marijuana patients from federal prosecution but, unlike previous versions, will also apply to adult [recreational] use of marijuana in states where it is legal, like Colorado and Washington,” wrote Dan Riffle, director of federal policies at the Marijuana Policy Project, in an email to supporters asking them to lobby their congressmen on the issue. Another amendment, from Rep. Suzanne Bonamici (D-Ore.), would protect state hemp laws from DOJ interference. This would pave the way for farmers to grow hemp in the U.S. Hemp comes from the same plant as pot, but it does not have the same intoxicating effect, Angell said. Instead, hemp is used to make things like paper, rope and textiles. \"You don’t smoke hemp,” Angell said. \"It wouldn’t get you high.\" Several other pot amendments are still in the works, including one that would shift money in the Drug Enforcement Agency's budget away from enforcing marijuana laws toward solving the rape kit backlog and funding treatment programs for veterans, Riffle said.", "external_links": [], "published": "2015-06-01T21:26:00.000+03:00", "crawled": "2015-06-02T01:17:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}