{"organizations": [], "uuid": "ba9ab8fb88c156ea3406107a872cf48d27fad67e", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/RAW-NVHRCATNALEOPOOLRAW-2TPVT6QA_FNC_061815_16-28.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/18/hillary-clinton-promises-to-go-further-then-obama-on-immigration-everything/", "country": "", "title": "Hillary Clinton reiterates promise to go far on immigration, calls for action on guns | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Hillary Clinton reiterates promise to go far on immigration, calls for action on guns | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "ba9ab8fb88c156ea3406107a872cf48d27fad67e"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/18/hillary-clinton-promises-to-go-further-then-obama-on-immigration-everything/", "ord_in_thread": 0, "title": "Hillary Clinton reiterates promise to go far on immigration, calls for action on guns | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton"], "text": "Hillary Clinton reiterates promise to go far on immigration, calls for action on guns Published June 18, 2015 Will campaign relaunch help Hillary Clinton? \nHillary Clinton told a group assembled at the National Association of Latino Elected Officials (NALEO) conference that if she was elected president she would do everything “under the law” to pass comprehensive reform, while also calling for action on gun control following the horrific church shooting Wednesday night in Charleston, S.C. \nIn a speech clocking in at just over half an hour, Clinton started out by offering her thoughts and prayers to the nine victims murdered in one of the oldest black churches in the South. She then addressed what she called a need to end gun violence. \n\"How many people do we need to see cut down before we act?\" Clinton asked. \"In order to make sense of it, we have to be honest. We have to face hard truths about race, violence, guns and division.” \nSpeaking to a packed house in Las Vegas, the Democratic presidential candidate echoed comments she made during a speech earlier this year in Nevada as well as her announcement speech Saturday in New York City by highlighting the need for a path to citizenship for undocumented immigrants. \n“I will continue to fight for comprehensive immigration reform with a real path to citizenship.” Clinton said. “If Congress refuses to act I will do everything I can under the law to go farther than President Obama has done to achieve what needs to be achieved.” \nClinton vowed in May that she would not only try to keep President Obama's executive actions, which have allowed undocumented immigrants to stay temporarily and receive work permits, but she would expand the deportation relief actions to include parents of Dreamers, young undocumented immigrants who came to the U.S. as children. \nClinton's speech at the annual Latino gathering rehashed many of the topics and anecdotes from her speech in New York over the weekend, including a number of stories about her mother. She also laid down her stance on early childhood education. \n“One quarter of children under five years old are Latino and they are affected by this gap,” she said. “Some families have been told that they shouldn’t speak to their children in their native language, but that is just not correct.” \nClinton added: “The more you talk in Spanish, the more those neurons and synapses start to fire and the more likely your child will be bilingual, which I envy because I’m barely monolingual.” \nOther issues addressed during her speech were student loan debt, the job market and voter rights. \n“I believe that in the greatest democracy on earth we should be making it easier for people to vote, not putting up new barriers,” Clinton said. “You know who those barriers are aimed at.” \nThe NALEO conference, the largest gathering of Latino policymakers and leaders, in Las Vegas has featured other speakers including Republican candidate Ben Carson. \nCarson, a neurosurgeon, on Wednesday told the conference that talking to Latinos just about immigration is pigeonholing, and said people of all ethnicities and races cared about a variety of issues, not just one. ", "external_links": [], "published": "2015-06-19T03:00:00.000+03:00", "crawled": "2015-06-20T05:43:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}