{"organizations": [], "uuid": "021d85a8855d69fd0f20e0712ff447ee9be21389", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/national", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2015/06/10/georgia-woman-jailed-on-murder-charge-after-taking-abortion-pills/", "country": "US", "title": "Georgia woman jailed on murder charge after taking abortion pills", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Georgia woman jailed on murder charge after taking abortion pills", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T07:15:00.000+03:00", "replies_count": 0, "uuid": "021d85a8855d69fd0f20e0712ff447ee9be21389"}, "author": "", "url": "http://www.foxnews.com/us/2015/06/10/georgia-woman-jailed-on-murder-charge-after-taking-abortion-pills/", "ord_in_thread": 0, "title": "Georgia woman jailed on murder charge after taking abortion pills", "locations": ["Georgia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Georgia woman jailed on murder charge after taking abortion pills Published June 10,   livefyre Email Print \nA Georgia woman’s arrest on murder charges after terminating a pregnancy by taking abortion pills drew scrutiny from advocates on both sides of the abortion debate. \nKenlissa Jones, 23, was being held at the Dougherty County jail on charges of malice murder and possession of a dangerous drug. District Attorney Greg Edwards said Tuesday that he is reviewing the case, but “as of right now she’s still charged.” \nJones was arrested Saturday after a county social services worker called police to a hospital, according to the police report. The hospital social worker told police that Jones said she had taken four pills she purchased over the Internet “to induce labor” because she and her boyfriend broke up. \nThe social worker told police Jones went into labor and delivered the fetus in a car on the way to the hospital. The fetus did not survive. WALB-TV reported that authorities said Jones was about 5 ½ months pregnant. \nLynn Paltrow, an attorney and executive director of National Advocates for Pregnant Women, a New York legal group, said prosecuting Jones seems at odds with Georgia case law. She noted state law explicitly prohibits prosecuting women for feticide involving their own pregnancies. A Georgia appeals court ruled in 1998 that a teenage whose fetus was stillborn after she shot herself in the abdomen could not be prosecuted for performing an illegal abortion. Prosecutors ended up dropping the case. \n\"We don't believe there is any law in Georgia that allows for the arrest of a woman for the outcome of her pregnancy,\" said Paltrow, whose group is offering free legal aid to Jones. \nGenevieve Wilson, a director of the anti-abortion group Georgia Right to Life, said this is the first time she has heard of a woman in Georgia facing a murder charge for ending her pregnancy. And Wilson agreed with Paltrow that feticide and abortion laws in the state have not been used to target women who end their own pregnancies. \n\"I am very surprised by the arrest,\" Wilson said. \"And I'm thinking that perhaps whoever made the arrest may not have known what the laws really are.\" \nEdwards said he is taking a close look before deciding ultimately whether to follow through with prosecuting Jones. \n\"Those are the issues that we're trying to unravel,\" said Edwards, who declined to discuss details of the case. \"We're looking as best we can at what's going on with the investigation and the law.\" \nJones' grandmother, Mary Lee Jones, said she didn't know her granddaughter was pregnant. She said her granddaughter often seems troubled and likely needs professional counseling more than jail. \n\"I think now, in the position she's in, she needs to be evaluated,\" Jones' grandmother said. \"She's just not herself.\" \nThe Associated Press contributed to this report Advertisement", "external_links": [], "published": "2015-06-10T07:15:00.000+03:00", "crawled": "2015-06-10T08:41:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}