{"organizations": ["Obama Calls Supreme Court Health Care Ruling"], "uuid": "3097a905a059bc3d10dce16c53965c6e72618eb0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3116826/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/25/obama-scotus-health-care-ruling_n_7662518.html", "country": "", "title": "Obama Calls Supreme Court Health Care Ruling A 'Victory': 'The Affordable Care Act Is Here To Stay'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Calls Supreme Court Health Care Ruling A 'Victory': 'The Affordable Care Act Is Here To Stay'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T18:49:00.000+03:00", "replies_count": 0, "uuid": "3097a905a059bc3d10dce16c53965c6e72618eb0"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/25/obama-scotus-health-care-ruling_n_7662518.html", "ord_in_thread": 0, "title": "Obama Calls Supreme Court Health Care Ruling A 'Victory': 'The Affordable Care Act Is Here To Stay'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Calls Supreme Court Health Care Ruling A 'Victory': 'The Affordable Care Act Is Here To Stay' Posted: \nPresident Barack Obama reacted to the Supreme Court's ruling on the Affordable Care Act Thursday, calling it a \"victory\" for hardworking Americans. \n\"As the dust has settled, there can be no doubt that this law is working. It has changed, and in some cases, saved, American lives,\" Obama said. \n\"Today after more than 50 votes in Congress to repeal or weaken this law, after a presidential election based in part on preserving or repealing this law, after multiple challenges to this law in front of the Supreme Court, the Affordable Care Act is here to stay,\" Obama added. \nThe Supreme Court rejected a major lawsuit against the law, preserving health insurance for millions of Americans. HuffPost's Jonathan Cohn and Jeffrey Young report on the White House's victory: \nOn Thursday, for the second time in three years, the Supreme Court rejected a major lawsuit against the Affordable Care Act -- thereby preserving the largest expansion in health coverage since the creation of Medicare and Medicaid half a century ago. \nThe stakes of the case, King v. Burwell, were enormous. Had the plaintiffs prevailed, millions of people who depend upon the Affordable Care Act for insurance would have lost financial assistance from the federal government. Without that money, most of them would have had to give up coverage altogether. And the loss of so many customers would have forced insurers to raise premiums, seriously disrupting state insurance markets. \nBut two of the court’s conservatives, Chief Justice John Roberts and Justice Anthony Kennedy, joined the court’s four liberals in rejecting the lawsuit in a 6-3 decision. Roberts delivered the opinion for the majority. And the decision was a concise, stinging rebuke of the plaintiffs, who contended that Congress intended to write a law that would leave so many people without coverage, and cause such disarray. \nObama said the Affordable Care Act is working better than expected, and argued it shouldn't be used as a partisan argument any longer. \n\"This is not an abstract thing anymore. This is not a set of political talking points,\" Obama said. \"This is reality.\" \n\"We’ve got work to do. But what we’re not going to do is unravel what has been woven into the fabric of America,\" Obama added, saying he wants to \"build something better for generations to come.\" \nSome politicians echoed Obama's praise of the court's decision, with Democratic presidential candidate Hillary Clinton tweeting \"YES!\" and Sen. Bernie Sanders (I-Vt.), also a Democratic candidate, saying it \"would have been an outrage to throw 6.4 million more people off health insurance.\" Not all agreed, with many Republicans denouncing the court's decision. \nRead more on the Supreme Court's decision here . Also on HuffPost: ", "external_links": [], "published": "2015-06-25T18:49:00.000+03:00", "crawled": "2015-06-25T19:22:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}