{"organizations": [], "uuid": "622d627b689ec6a9d8fde32961880bffcba4ef6b", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/18/politics/obama-shootings-responses/index.html", "country": "", "title": "Watch Obama react to mass U.S. shootings - CNNPolitics.com", "performance_score": 3, "site": "cnn.com", "participants_count": 0, "title_full": "Watch Obama react to mass U.S. shootings - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "622d627b689ec6a9d8fde32961880bffcba4ef6b"}, "author": "", "url": "http://www.cnn.com/2015/06/18/politics/obama-shootings-responses/index.html", "ord_in_thread": 0, "title": "Watch Obama react to mass U.S. shootings - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Watch Obama react to mass U.S. shootings Updated 2200 GMT (0500 HKT) June 18, 2015 JUST WATCHED How Obama responds to shooting attacks 02:08 Washington (CNN) Speaking somberly at the White House Thursday, President Barack Obama noted that his statement in the wake of the Charleston, South Carolina church shooting was not the first time he's addressed mass murder due to gun violence. \"I've had to make statements about tragedies like this too many times,\" the President noted. In fact, he's personally made statements about shootings more than a dozen times since taking office six years ago. Here's a look at what he's had to say: Nov. 5, 2009 Remarks by the President on the shooting at Fort Hood \"As Commander-in-Chief, there's no greater honor but also no greater responsibility for me than to make sure that the extraordinary men and women in uniform are properly cared for and that their safety and security when they are at home is provided for.\" Nov. 10, 2009 Remarks by the President at a memorial service for Fort Hood victims \"This is a time of war. Yet these Americans did not die on a foreign field of battle. They were killed here, on American soil, in the heart of this great state and the heart of this great American community. This is the fact that makes the tragedy even more painful, even more incomprehensible.\" Jan. 12, 2011 Obama's remarks at a memorial service for the victims in Tucson, Arizona \"For the truth is none of us can know exactly what triggered this vicious attack. None of us can know with any certainty what might have stopped these shots from being fired, or what thoughts lurked in the inner recesses of a violent man's mind. Yes, we have to examine all the facts behind this tragedy. We cannot and will not be passive in the face of such violence.\" July 20, 2012 Obama responds to the Aurora, Colorado movie theater shooting \"Now, even as we learn how this happened and who's responsible, we may never understand what leads anybody to terrorize their fellow human beings like this. Such violence, such evil is senseless. It's beyond reason. But while we will never know fully what causes somebody to take the life of another, we do know what makes life worth living.\" July 22, 2012 Obama's remarks after visiting Aurora victims in the hospital \"I confessed to them that words are always inadequate in these kinds of situations, but that my main task was to serve as a representative of the entire country and let them know that we are thinking about them at this moment and will continue to think about them each and every day, and that the awareness that not only all of America but much of the world is thinking about them might serve as some comfort.\" July 22, 2012 Transcript of Obama's remarks in Aurora, Colorado \"Although the perpetrator of this evil act has received a lot of attention over the last couple of days, that attention will fade away. And in the end, after he has felt the full force of our justice system, what will be remembered are the good people who were impacted by this tragedy.\" Aug. 10, 2012 Obama speaks on Wisconsin Sikh temple shooting \"Tonight, our prayers, in particular, are with our friends and fellow Americans in the Sikh community. We mourn those who were senselessly murdered and injured in their place of worship. And while we may never fully understand what motivates such hatred, such violence, the perpetrators of such despicable acts must know that your twisted thinking is no match for the compassion and the goodness and the strength of our united American family.\" Dec. 14, 2012 Obama's statement after the Newtown, Connecticut school shooting \"This evening, Michelle and I will do what I know every parent in America will do, which is hug our children a little tighter and we'll tell them that we love them, and we'll remind each other how deeply we love one another. But there are families in Connecticut who cannot do that tonight.\" Dec. 16, 2012 Obama's remarks at the Sandy Hook interfaith prayer vigil \"This is our first task -- caring for our children. It's our first job. If we don't get that right, we don't get anything right. That's how, as a society, we will be judged. And by that measure, can we truly say, as a nation, that we are meeting our obligations? Can we honestly say that we're doing enough to keep our children -- all of them -- safe from harm?\" Sept. 16, 2013 Obama speaks on the Washington Navy Yard shooting \"It's a shooting that targeted our military and civilian personnel. These are men and women who were going to work, doing their job, protecting all of us. They're patriots, and they know the dangers of serving abroad -- but today, they faced unimaginable violence that they wouldn't have expected here at home.\" Sept. 22, 2013 Obama's remarks at the memorial service for victims of the Navy Yard shooting \"As President, I have now grieved with five American communities ripped apart by mass violence. Fort Hood. Tucson. Aurora. Sandy Hook. And now, the Washington Navy Yard. And these mass shootings occur against a backdrop of daily tragedies, as an epidemic of gun violence tears apart communities across America -- from the streets of Chicago to neighborhoods not far from here.\" April 2, 2014 Obama's remarks on the second Fort Hood shooting \"Any shooting is troubling. Obviously this reopens the pain of what happened at Fort Hood five years ago. We know these families. We know their incredible service to our country and the sacrifices that they make. Obviously our thoughts and prayers were -- are with the entire community. And we are going to do everything we can to make sure that the community at Fort Hood has what it needs to deal with the current situation, but also any potential aftermath.\" April 9, 2014 Remarks by Obama at the 2014 Fort Hood memorial service \"We must honor these men by doing more to care for our fellow Americans living with mental illness, civilian and military. Today, four American soldiers are gone. Four Army families are devastated. As commander-in-chief, I'm determined that we will continue to step up our efforts -- to reach our troops and veterans who are hurting, to deliver to them the care that they need, and to make sure we never stigmatize those who have the courage to seek help.\" June 10, 2014 The President's remarks following a school shooting in Portland, Oregon \"I will tell you, I have been in Washington for a while now. Most things don't surprise me. The fact that 20 six-year-olds were gunned down in the most violent fashion possible and this town couldn't do anything about it was stunning to me.\" June 18, 2015 Obama responds to the church shooting in Charleston, South Carolina \"I've had to make statements like this too many times. Communities like this have had to endure tragedies like this too many times. We don't have all the facts, but we do know that, once again, innocent people were killed in part because someone who wanted to inflict harm had no trouble getting their hands on a gun. Now is the time for mourning and for healing. But let's be clear: At some point, we as a country will have to reckon with the fact that this type of mass violence does not happen in other advanced countries. It doesn't happen in other places with this kind of frequency. And it is in our power to do something about it.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics ", "external_links": [], "published": "2015-06-19T03:00:00.000+03:00", "crawled": "2015-06-19T16:05:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}