{"organizations": ["Fifth Circuit Court of Appeals", "United States Court of Appeals for the Fifth Circuit", "CNNPolitics.com Court", "Supreme Court"], "uuid": "aeebb8a0a87f2045d83375d349fd96aa8ea333d3", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/29/politics/texas-abortion-clinic-supreme-court/index.html", "country": "", "title": "Supreme Court allows abortion clinics to remain open - CNNPolitics.com", "performance_score": 6, "site": "cnn.com", "participants_count": 0, "title_full": "Supreme Court allows abortion clinics to remain open - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "aeebb8a0a87f2045d83375d349fd96aa8ea333d3"}, "author": "", "url": "http://www.cnn.com/2015/06/29/politics/texas-abortion-clinic-supreme-court/index.html", "ord_in_thread": 0, "title": "Supreme Court allows abortion clinics to remain open - CNNPolitics.com", "locations": ["United States", "San Francisco", "Detroit", "New York", "Washington", "Clermont", "Brooklyn", "New England", "Texas", "Maryland", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Larry Hickam", "Justices Scalia", "Andrew Zibell", "Mike May", "Ashley Codianni", "Scalia", "Sarah Rauber", "Stuart Gaffney", "Stephanie Jones", "Paxton", "McKenna Inskeep", "Rick Perry", "Allie Lewya", "Catherine Quinn", "Kevin Rosseel", "Diana Iwanski", "Cecile Richards", "John Roberts", "Stephen Collinson", "Clarence Thomas", "Antonin", "Andrew Damron", "Samuel Alito", "John Lewis", "Ken Paxton", "Tishun"], "text": "Court allows Texas abortion clinics to stay open 01:02 Washington (CNN) (CNN) -- The Supreme Court on Monday granted a request from abortion clinics in Texas to put on hold a lower court ruling that would have shuttered all but a handful of abortion clinics, while the clinics appeal the case to the Supreme Court. In a one-page order the Court said \"the application for stay presented by Justice (Antonin) Scalia and referred to him by the Court is granted and the issuance of the mandate of the United States Court of Appeals for the Fifth Circuit in case No. 14-50928 is stayed pending the timely filing and disposition of a petition for a writ of certiorari.\" It was 5-4 vote, the order noted that Chief Justice John Roberts and Justices Scalia , Clarence Thomas and Samuel Alito would deny the application. RELATED: Supreme Court backs use of lethal injection drug The case concerns two provisions of a 2013 law that pro-choice groups say has caused more than a 75% reduction in abortion facilities in a two-year period. At issue is the so called Ambulatory Surgical Center requirement that mandates that abortion facilities must upgrade facilities to hospital-like standards, as well as the admitting privileges requirement that provides that the physician performing the abortion must have privileges at a local hospital. A lower court largely upheld the provisions. In Court briefs, the clinics argued that before the law was enacted there were 41 licensed facilities providing abortions in Texas and currently there are 19. That number would drop to nine if the ruling by the Fifth Circuit Court of Appeals is not put on hold. The many signs of #SCOTUS 14 photos Outside the Supreme Court of the United States, people hold signs calling for \"equal justice under law.\" Hide Caption The many signs of #SCOTUS 14 photos A group against same-sex marriage prays in an \"appeal to heaven\" outside the Supreme Court. Hide Caption The many signs of #SCOTUS 14 photos Catherine Quinn of Detroit holds up her sign supporting same-sex marriage outside the Supreme Court. Hide Caption 3 of 14 The many signs of #SCOTUS 14 photos Pastor Larry Hickam holds a sign of what he says is the definition of marriage outside the Supreme Court. Hide Caption 4 of 14 The many signs of #SCOTUS 14 photos Kevin Rosseel of Washington stands outside the Supreme Court with his sign in support of same-sex marriage. Hide Caption 5 of 14 The many signs of #SCOTUS 14 photos Stephanie Jones and Diana Iwanski of Clermont, Florida, share their sign in support of same-sex marriage outside the Supreme Court. Hide Caption The many signs of #SCOTUS 14 photos Sarah Rauber of Maryland stands in front of the Supreme Court. Hide Caption The many signs of #SCOTUS 14 photos McKenna Inskeep hands out stickers in support of marriage equality outside the Supreme Court. Hide Caption The many signs of #SCOTUS 14 photos Mike May of Cleveland argues against same-sex marriage in a debate outside the Supreme Court. Hide Caption 9 of 14 The many signs of #SCOTUS 14 photos Outside the Supreme Court, John Lewis and Stuart Gaffney of San Francisco hold signs celebrating their marriage. Hide Caption 10 of 14 The many signs of #SCOTUS 14 photos Senior Novice Sister Sedusa Poly Tishun shows off her face paint outside the Supreme Court. \"We're here raising up our voices and our glitter in shouts of joy in support of marriage equality,\" Tishun said. Hide Caption 11 of 14 The many signs of #SCOTUS 14 photos Andrew Damron of Brooklyn, New York, holds up a sign with the motto \"You Only Live Once\" in support of same-sex marriage. Hide Caption 12 of 14 The many signs of #SCOTUS 14 photos Andrew Zibell of Brooklyn, New York, holds a sign in front of the Supreme Court that shows his support of same-sex marriage. Hide Caption 13 of 14 The many signs of #SCOTUS 14 photos Senior Novice Sisters Ray Deeo Active and Allie Lewya show off their face paint in support of same-sex marriage. Hide Caption 14 of 14 \"The Fifth Circuit's conclusion that the drastic reduction in the number and geographic distribution of abortion providers caused by the challenged requirement does not operate as a substantial obstacle to abortion access in Texas is plainly wrong and reflects profound errors in the Court's understanding and application of controlling legal principles,\" wrote lawyers for the clinics. But Texas Attorney General Ken Paxton had urged the justices to allow the law to go into effect saying it \"protects women's health.\" Paxton, reacting to the ruling, said the Supreme Court \"just put Texes women in harm's way.\" \"HB 2 ensures abortion clinics and doctors meet basic health standards if they choose to operate their businesses in Texas,\" he said in a statement. \"Today's delay subjects Texas women to substandard care all to the benefit of the abortion industry's bottom line.\" Planned Parenthood President Cecile Richards said her organization was grateful for the Supreme Court's action. \"Restricting or banning abortion blocks women from getting safe medical care,\" she said in a statement. \"This dangerous law never should have passed in the first place -- which is why we need to elect leaders who will champion women's health and rights.\" Former Texas Gov. Rick Perry said he was confident the Supreme Court decision was only a temporary setback. \"The Supreme Court's stay unnecessarily puts lives in danger by allowing unsafe facilities to continue to perform abortions,\" said the Republican presidential candidate in a statement. \"I am confident the court will ultimately uphold these commonsense measures to protect the health and safety of Texas women.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Politics Originals Story by Stephen Collinson and video by Ashley Codianni It wouldn't be the first time a revolution sparked in New England changed the world. ", "external_links": [], "published": "2015-06-30T03:00:00.000+03:00", "crawled": "2015-06-30T10:04:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}