{"organizations": [], "uuid": "99996593e574cdb4e5bed3a0a0ccec399de34f70", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3112964/images/o-OBAMACARE-SUPREME-COURT-STATES-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/news.xml", "section_title": "Business News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/24/obamacare-supreme-court-states_n_7655032.html?utm_hp_ref=business&ir=Business", "country": "US", "title": "Obama May Have To Lean On Democratic Governors To Resell His Health Care Law", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama May Have To Lean On Democratic Governors To Resell His Health Care Law", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T00:01:00.000+03:00", "replies_count": 0, "uuid": "99996593e574cdb4e5bed3a0a0ccec399de34f70"}, "author": "Jeffrey Young", "url": "http://www.huffingtonpost.com/2015/06/24/obamacare-supreme-court-states_n_7655032.html?utm_hp_ref=business&ir=Business", "ord_in_thread": 0, "title": "Obama May Have To Lean On Democratic Governors To Resell His Health Care Law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama May Have To Lean On Democratic Governors To Resell His Health Care Law Posted: Updated: 12 minutes ago Kentucky is standing by to help other states if the Supreme Court invalidates health insurance subsidies in states that don't have health insurance exchanges of their own, Gov. Steve Beshear (D) said. | AP Photo/Timothy D. Easley reddit \nWASHINGTON -- If the Supreme Court strikes down Obamacare subsidies in two-thirds of the country, President Barack Obama won't be the only leader offering to assist states that want to undo the damage. \nOfficials in states that created their own health insurance exchanges under the Affordable Care Act -- thereby shielding their residents from the possible consequences of the lawsuit currently pending before the high court -- are standing by to help their counterparts in other states get marketplaces up and running that would allow subsidies in those states to flow again. \n\"If, for any reason, the court rules for the plaintiffs in this case, I'm going to be communicating with my fellow governors about exploring together what we might do,\" Kentucky Gov. Steve Beshear (D) told The Huffington Post. \"I would be open to exploring any and all possibilities.\" \nThe Supreme Court could issue a ruling as soon as Thursday in King v. Burwell , a lawsuit brought by conservative and libertarian activists that alleges the Affordable Care Act doesn't permit subsidies for residents of any state where the federal government, and not the state itself, operates the health insurance exchange. If the challenge prevails, 6.4 million people in 34 states will lose the tax credits that help pay for their health coverage, and an even greater number of people are expected to become uninsured, because such a decision would roil the insurance markets in those states . \nKentucky is one of 16 states, plus the District of Columbia , that established health insurance exchanges under the law, so it wouldn't be affected by a ruling that erases subsidies elsewhere. Kentucky's marketplace, called Kynect , enjoyed a much smoother launch than the markets in most other states, and has experienced far fewer problems than the federal system using HealthCare.gov , which had an infamously rocky rollout in 2013. Kynect has proven popular with residents of the Bluegrass State. \n\"Ours is a national model,\" Beshear said. \"We know how to do this, and there may be some scenarios where we can work together [with other states].\" \nBeshear said he hasn't talked with other governors about opportunities for Kentucky to collaborate with them in advance of the ruling. \"I don't hear that discussed yet,\" he said, \"because, for the most part, no one wants to discuss scenarios that are opposite of where they hope the court will come out.\" \nThe most important factor in each of the states with federally run exchange marketplaces will be whether leaders there have the political will to embark on the costly and risky mission of creating a new exchange. Every one of those states, except Delaware, has a Republican governor, legislature or both, which makes it highly uncertain that the necessary momentum would exist in many places. In states like Louisiana, Texas and Wisconsin, the Republican governors have made it clear that they won't seek a state exchange, and 11 states have already enacted laws making it harder to set up those marketplaces. \nBut given the turmoil that would result if the high court rules to eliminate subsidies, some other states may decide to act. Ten states using federal exchanges have asked the Supreme Court not to block subsidies for their residents, and seven states using the federal exchanges are doing so in formal \"partnerships\" with federal authorities. \nObama and his lieutenants have stressed that they wouldn't be able to undo a Supreme Court decision eliminating subsidies in federal exchange states without additional legislation -- and the distance between Democrats and Republicans on how to respond to such a ruling is vast. But Health and Human Services Secretary Sylvia Mathews Burwell has said the administration will do what it can to help states seeking to get new exchanges online. \nThat's where states like Kentucky could come in. In addition to providing general guidance to leaders in other states looking to set up their own health insurance exchanges, Kentucky could, for example, lease out its enrollment technology or partner with other states on certain functions of the marketplace, like customer service. \"Obviously, it would be easier today to know how to do this than it was two, three years ago,\" Beshear said. \nConnecticut already took advantage of the success of its Obamacare portal, Access Health CT , by charging Maryland for its technology last year after the disastrous rollout of Maryland Health Connection in 2013. Connecticut is also reportedly in talks with the state-run exchanges in Rhode Island and Vermont about moneymaking and money-saving partnerships. \n\"We've been trying to help out other states,\" Connecticut Lt. Gov. Nancy Wyman (D) told HuffPost. \"We can hook up with another state and we can go in together and get a call center together. We can bring up their technology through our technology and we can work together that way. And then they will be recognized as an exchange.\" \nThe federal government has signaled its flexibility in advance of the court's ruling. New Mexico, Nevada and Oregon, all of which established exchanges but encountered significant problems, have already ceded the enrollment process to HealthCare.gov while continuing to perform other exchange functions, and Hawaii is poised to join them next year. The Department of Health and Human Services also quickly offered conditional approval this month to Delaware's and Pennsylvania's plans to set up marketplaces for 2016, and it did the same for Arkansas' proposal to do so the following year. But other states are essentially just waiting for the Supreme Court decision . \nCollaboration between states that already operate exchanges and those hoping to do so could hasten the establishment of new exchanges, and provide opportunities for each state to spend less than they would going it alone. State-run exchanges have already been through two Obamacare enrollment periods, during which they have refined their activities and worked out many of their technical glitches. \n\"We know from the first go-around that starting this from scratch is very difficult, and at this stage of the game, there is no reason anyone should start from scratch,\" said Alan Weil, an expert on state health policy and editor-in-chief of the journal Health Affairs. \nState leaders who want to create some form of exchange that would restore the subsidies if the Supreme Court takes them away have several ways of going about it, according to a brief published in March by the National Academy for State Health Policy. \nThe first option would be to set up a full state-run marketplace like those in Connecticut, Kentucky and 12 other jurisdictions . This would be the most expensive and most difficult route for states, because it would require building the entire regulatory and technological infrastructure to manage their new marketplaces. \nAlternatively, states could copy Hawaii, New Mexico, Nevada and Oregon by taking on some responsibilities for overseeing this part of the health insurance market but directing residents to the federal system to actually sign up for insurance. A third option would be to pay other states for the use of at least parts of their existing exchanges, akin to Maryland's deal with Connecticut. Some experts argue that states could take a similar tack and pay to use the federal system. Or multiple states could band together into a regional exchange, which is allowed under the Affordable Care Act. \nNone of these approaches would be easy, even with help from other states that have exchanges in place, Weil said. The technology that checks eligibility for subsidies and manages enrollments could easily be transferred to other states, and states could collaborate to handle features like customer support, but a new exchange would still take a lot of work to set up. For example, said Weil, states would continue to regulate insurance within their own borders and would have to integrate a newly created exchange with their Medicaid programs. \n\"This is sort of the transplant analogy, which is, you can take someone's heart and put it in, but it's all the connections that matter,\" Weil said. \nAnd regardless of what states decide if the Supreme Court rules against subsidies in federal exchanges, residents are likely to lose their subsidies this year unless the court takes the unusual step of delaying the effective date of its decision. Governors and legislators in each state will have to debate what action, if any, to take, and only then could they begin the process of actually building any form of health insurance exchange . The odds of all those things happening before the end of the year appear slim. \nRead more on the latest Obamacare Supreme Court case below:", "external_links": [], "published": "2015-06-25T00:01:00.000+03:00", "crawled": "2015-06-25T00:17:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}