{"organizations": ["MacDill Air Force Base", "National Medical Center", "Clarence Tinker Elementary School", "Powell Elementary School", "U.S. Embassy"], "uuid": "aedfcd26f6733d0a1bdbd55186f58f9fe66fbfe3", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150605141143-obama-baby-walk-update-story-top.jpg", "site_section": "http://rss.cnn.com/rss/cnn_living.rss", "section_title": "CNN.com - Living", "url": "http://edition.cnn.com/2015/06/05/living/barbie-flat-feet-more-diverse-feat/index.html", "country": "US", "title": "President Obama and his young constituents", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "President Obama and his young constituents", "spam_score": 0.0, "site_type": "news", "published": "2015-06-05T23:15:00.000+03:00", "replies_count": 0, "uuid": "b06206fe72d1b1df6c7332c1f94d3043ced7067c"}, "author": "", "url": "http://edition.cnn.com/2015/06/05/politics/gallery/president-obama-kids/index.html", "ord_in_thread": 0, "title": "President Obama and his young constituents", "locations": ["North Dakota", "Philippines", "Tulsa", "Oklahoma", "Kansas", "Washington", "Cannon Ball", "Tampa", "West Wing of", "Manila", "Maryland", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Edwin Caleb", "Malia", "Laura Moser", "Ferial Govashiri", "Barack", "Ben Rhodes", "Obama", "Pete Souza", "Maurice Sendak", "Michelle Obama", "Marcus Wesby", "Akira Cooper", "London Rakestraw", "Ella Harper Rhodes", "Lindsay Hayes", "Claudia Moser", "Souza", "Darienne Page Rakestraw", "Luca Martinez", "Sasha"], "text": "Presidential playmate: Obama and kids Updated 2111 GMT (0411 HKT) June 5, 2015 Presidential playmate: Obama and kids 26 photos Here's one demographic with which President Obama seems to not have much trouble: children. White House photographer Pete Souza regularly captures Obama playing with small visitors, saying, \"Some are serious and some are humorous. And of course, some are with babies (since the President loves babies).\" Hide Caption 1 of 26 Presidential playmate: Obama and kids 26 photos Obama plays in the Oval Office with Ella Harper Rhodes , daughter of Deputy National Security Adviser Ben Rhodes, on June 4. Hide Caption 2 of 26 Presidential playmate: Obama and kids 26 photos Obama reacts to Claudia Moser, journalist Laura Moser's daughter, who threw a tantrum at the White House while attending Passover dinner in April. Hide Caption 3 of 26 Presidential playmate: Obama and kids 26 photos Obama poses with a Girl Scout Brownie from Tulsa, Oklahoma, after they showed off a science fair exhibit, a flood-proof bridge made of Legos. Hide Caption 4 of 26 Presidential playmate: Obama and kids 26 photos \" 'Don't make rabbit ears,' Obama told this group of students at an elementary school at MacDill Air Force Base in Tampa, Florida,\" Souza recalled. So, of course, some couldn't resist. Hide Caption 5 of 26 Presidential playmate: Obama and kids 26 photos As he departs the White House in May, Obama fist bumps with 4-year-old Luca Martinez, who is wearing a superhero costume. Hide Caption 6 of 26 Presidential playmate: Obama and kids 26 photos Obama reads to children from the book \"Where the Wild Things Are\" by Maurice Sendak during the White House Easter Egg Roll in April 2014. Hide Caption 7 of 26 Presidential playmate: Obama and kids 26 photos Obama and first lady Michelle Obama greet children during the White House Easter Egg Roll in April 2014. Hide Caption 8 of 26 Presidential playmate: Obama and kids 26 photos Obama poses with a Girl Scout Daisy troop from Tulsa, Oklahoma, during the White House Science Fair in March. Hide Caption 9 of 26 Presidential playmate: Obama and kids 26 photos Obama beckons for help to get up after posing for a photograph with children at the U.S. Embassy in Manila, Philippines. Hide Caption 10 of 26 Presidential playmate: Obama and kids 26 photos Obama puts student Marcus Wesby in his lap as he sits with children during a tour of a pre-K classroom at Powell Elementary School in Washington in March 2014. Hide Caption 11 of 26 Presidential playmate: Obama and kids 26 photos Obama talks with Akira Cooper during a visit to a classroom at the Community Children's Center, one of the country's oldest Head Start providers, in Lawrence, Kansas, in January. Hide Caption Presidential playmate: Obama and kids 26 photos Obama greets trick-or-treaters at the White House in October 2014. Hide Caption 13 of 26 Presidential playmate: Obama and kids 26 photos Obama stops by a Halloween party at the chief of staff's office in the West Wing of the White House in October. Hide Caption 14 of 26 Presidential playmate: Obama and kids 26 photos Obama greets a little boy held by Ferial Govashiri, personal aide to the president, in October. Hide Caption Presidential playmate: Obama and kids 26 photos Obama greets departing staff member Lindsay Hayes and her family in September. Hide Caption Presidential playmate: Obama and kids 26 photos Obama holds a baby during the Congressional Picnic at the White House in September. Hide Caption 17 of 26 Presidential playmate: Obama and kids 26 photos Obama allows first-grader Edwin Caleb to touch his hair during a classroom visit at Clarence Tinker Elementary School at MacDill Air Force Base in Tampa, Florida, in September. Hide Caption Presidential playmate: Obama and kids 26 photos Obama greets a child during a tour of the White House in September. Hide Caption 19 of 26 Presidential playmate: Obama and kids 26 photos Obama holds the daughter of former staff members Darienne Page Rakestraw and London Rakestraw at the White House in July. Hide Caption 20 of 26 Presidential playmate: Obama and kids 26 photos A student takes a selfie as Obama makes a surprise visit to the White House Talent Show in May 2014. Hide Caption Presidential playmate: Obama and kids 26 photos Obama greets Girl Scouts in Maryland in May 2014. Hide Caption 22 of 26 Presidential playmate: Obama and kids 26 photos Obama holds a child as he poses with Native American performers during the Cannon Ball Flag Day Celebration in Cannon Ball, North Dakota, in June 2014. Hide Caption 23 of 26 Presidential playmate: Obama and kids 26 photos Obama and a young boy point at each other at Marine Corps Base Hawaii on Christmas Day. Hide Caption Presidential playmate: Obama and kids 26 photos Obama speaks with children at Children's National Medical Center in December 2013. Hide Caption 25 of 26 Presidential playmate: Obama and kids 26 photos Obama buys books with his own kids, Sasha, center, and Malia, at Politics and Prose bookstore in Washington in November. Hide Caption Here's a look back at some of President Barack's Obama's most memorable moments with children. More from Politics", "external_links": [], "published": "2015-06-05T23:15:00.000+03:00", "crawled": "2015-06-06T00:21:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}