{"organizations": ["Arizona"], "uuid": "ea2b4f11dbf01f2578bb3cd360dd36b42f3e7113", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3058716/images/o-RAUL-GRIJALVA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/10/climate-fast-track-democrats_n_7557508.html", "country": "", "title": "Anti-Climate Provision Gives Democrats Fresh Reason To Oppose Obama On Trade", "performance_score": 4, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Anti-Climate Provision Gives Democrats Fresh Reason To Oppose Obama On Trade", "spam_score": 0.0, "site_type": "news", "published": "2015-06-11T04:23:00.000+03:00", "replies_count": 0, "uuid": "ea2b4f11dbf01f2578bb3cd360dd36b42f3e7113"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/10/climate-fast-track-democrats_n_7557508.html", "ord_in_thread": 0, "title": "Anti-Climate Provision Gives Democrats Fresh Reason To Oppose Obama On Trade", "locations": ["Tuscon", "U.S.", "Arizona", "TUSCON", "AZ"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Raul Grijalva", "John Moore", "John", "Grijalva"], "text": "Anti-Climate Provision Gives Democrats Fresh Reason To Oppose Obama On Trade Posted: Updated: 8 minutes ago TUSCON, AZ - APRIL 24: U.S. Rep. Raul Grijalva (D-AZ) denounces Arizona's tough new immigration law on April 24, 2010 in Tuscon, Arizona. Grijalva, who shut his Tuscon office the day before because of death threats, called for an economic boycott of Arizona because of the new law, which he called racist. (Photo by John Moore/Getty Images) | John Moore via Getty Images reddit \nWASHINGTON -- A measure that would excuse the U.S. from any trade deal obligations to address climate change adds a fresh wrinkle to the tense debate in the House over President Barack Obama’s trade agenda. \nHouse Democrats opposing legislation that would grant Obama fast-track authority to funnel trade deals through Congress are pressuring undecided members of their caucus, pointing to the anti-climate language as reason enough to vote no. \nThe House is poised to vote on a package of trade bills, including fast-track authority for Obama, as early as Friday. Three additional trade bills will be considered, including a customs enforcement bill. Within the customs bill is the anti-climate language added by Rep. Paul Ryan (R-Wis.), who has acted as the administration's go-to person in the House on trade. Unless that language is first changed by the Rules Committee, it will stay in the bill. \nProgressive Democrats and green groups argue the anti-climate provision included in a customs enforcement bill would “threaten” the administration’s push to stave off an increase in the planet’s temperature and undermine work toward an ambitious international treaty to cut greenhouse gas emissions. \nRep. Raul Grijalva (D-Ariz.), a progressive leader among Democrats, said he hopes the climate provision makes his colleagues rethink their positions on customs and fast track. Fast track would allow the administration to present Congress with trade deals for an up-or-down vote, without amendments or filibusters. \nIn an interview with The Huffington Post on Wednesday, Grijalva said there are about \"27 or so\" Democrats, including Rep. Beto O’Rouke (D-Texas) and Rep. Kristen Sinema (D-Ariz.), who are undecided. \"They need to think twice when they see this,” Grijalva quickly added. \n“What we are doing is going along with the deniers and saying [climate change] doesn’t exist to this small set of brains, and now we are going to make that part of this super-duper trade agreement to end all trade agreements, so people should think about it,” Grijalva said. \nIt’s no secret Grijalva fiercely opposes giving Obama expedited powers on trade, and is against the ongoing negotiations by the White House with 11 Pacific nations in the Trans-Pacific Partnership. He contends the anti-climate language “weakens” America’s position going into United Nations climate change talks in Paris later this year, where the White House will try to convince more than 180 countries to join a treaty. Instead of living up to the hype of crafting the “toughest” trade policy on environmental protections, Grijalva said, the White House and Congress will be promoting a “cowardly” trade agreement. \nGrijalva admitted it won't be easy, and said he thinks the final vote to give Obama fast-track authority will be close. \n“They’ve got 19 [Democrats] that have said 'yes' and some of those should think about it when they see this language, but I won’t name names,” Grijalva said of those in his caucus who have joined Republicans on trade. \nRep. Sander Levin (D-Mich.), a key Democratic voice in the trade debate and ranking member on the House Ways and Means Committee, also issued a call to members of his party Wednesday, pressing them to pay attention to the climate language. \n“Anyone who is thinking of supporting TPA must consider the amendments to TPA incorporated in the customs bill,” Levin said, referring to fast-track by its more formal name of trade promotion authority. “House Republicans are using the customs bill as a vehicle to further in TPA their rigid ideological agenda.” \nRyan offered the climate amendment to appeal to Republican concerns that Obama might use his trade powers to act on climate change. The measure would \"ensure that trade agreements do not require changes to U.S. law or obligate the United States with respect to global warming or climate change.\" \nRyan explained the language during a Rules Committee meeting Wednesday evening. \n“It’s just making sure that if the administration wants to go down a path of seeking legislative changes in climate or immigration, they can’t do it through trade agreements,” Ryan said. \nBut Ryan's gambit is failing to win over the right-wing groups, such as Americans for Limited Government , whose president, Rick Manning, slammed Ryan for cynical deal-making that didn't do enough to shield the United States from addressing climate change. Manning also hammered other deals Ryan offered, such as a measure to curb Chinese steel dumping that aims to appeal to Democrats, and a provision to prevent immigration law changes that is meant to soothe Republicans. \n\"Paul Ryan is treating the customs bill as his own personal fast-track favor factory,\" Manning said in a statement. \"This is a desperate attempt to attract votes to the flawed [fast-track] bill. Even if the customs bill were to pass and be signed by the President, none of the provisions would compel President Obama to comply with them in any treaty that he should submit to Congress.\" He added: \"Voting to give Obama fast-track trade authority based on the slim hope he will follow a non-binding suggestion -- when he doesn't even follow the law as written -- is both irresponsible and foolish.\" \nGreen groups plan to join in appeals for Democrats to vote against fast track. Karthik Ganapathy, spokeswoman for 350.org, expressed confidence that the language would hurt Republican chances of passing fast track. \n“Forbidding U.S. negotiators from ever addressing climate change in trade deals might might win over a couple of votes on the far right, but it'll lose many more in the center and on the left because the new language is a disaster for our climate,” Ganapathy said. “Bills like this one undermine President Obama's other accomplishments in the issue, and simply don't line up with doing what it takes to prevent catastrophic climate change.” \nBen Schreiber, of Friends of the Earth, said the language barring trade deals from including requirements to act on climate change “will have significant impacts on any agreement that in reached in Paris.” \nMichael McAuliff contributed reporting. ", "external_links": [], "published": "2015-06-11T04:23:00.000+03:00", "crawled": "2015-06-11T04:23:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}