{"organizations": [], "uuid": "84fc7970b70d9f5770b665bb4678990246784546", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Immigration%20Reform2.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/opinion/2015/06/25/evangelical-call-for-immigration-reform-resounds/", "country": "", "title": "Opinion: Evangelical call for immigration reform resounds, reaches to the pews | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Opinion: Evangelical call for immigration reform resounds, reaches to the pews | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "84fc7970b70d9f5770b665bb4678990246784546"}, "author": "", "url": "http://latino.foxnews.com/latino/opinion/2015/06/25/evangelical-call-for-immigration-reform-resounds/", "ord_in_thread": 0, "title": "Opinion: Evangelical call for immigration reform resounds, reaches to the pews | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fox News Latino Getty \nThree years ago, the two of us joined several other Christian leaders at an event on Capitol Hill to launch the Evangelical Statement of Principles for Immigration Reform. Since that day, we have witnessed a remarkable coalescence of evangelical Christians around support for immigration reform that, we believe, would reflect biblical principles of hospitality, family unity, and respect for the rule of law. As Christians throughout the country increasingly interact with the people whom our broken system burdens, our resolve has only increased: we need Congress to act on bipartisan immigration reforms consistent with our values, and we are praying that they will do so now. \n- N. Castellanos and S. Bauman \nFrustratingly, though, we have seen very little change in terms of immigration legislation, as Congress has failed to pass any meaningful reforms. It’s time for Congress to act. \nThe institutions we lead—the Christian Community Development Association and World Relief, respectively—each have long histories of serving immigrants in local communities as an expression of our Christian faith. Our colleagues and partners working with local churches and ministries throughout the United States witness on a regular basis the devastating impacts that our nation's immigration laws have on families and communities. \nChildren suffer when a father is deported. A mother yearns to be reunited with a son stuck in family reunification backlogs that can last a decade or more. Church-based volunteers who for years have tutored and mentored a young person are devastated when the student’s lack of legal status stymies her chance of pursuing college. Pastors struggle with how to guide undocumented members of their congregations torn between the biblical commands to provide for one’s family, on one hand, and to subject themselves to the law of the land, on the other, desperate for a process of reconciliation that would allow them to make amends for a violation of law and stay with and support their families. \nThe Church can do much to meet tangible needs, and to proclaim the hope of the gospel. But we continue to run up against problems that require a structural, legislative solution. \nThe Evangelical Statement of Principles for Immigration Reform has been our effort to spur our elected officials toward a bipartisan solution to these challenges. In June 2012, we called for a bipartisan immigration solution that: \n• Respects the God-given dignity of every person • Protects the unity of the immediate family • Respects the rule of law • Guarantees secure national borders • Ensures fairness to taxpayers • Establishes a path toward legal status and/or citizenship for those who qualify and who wish to become permanent residents \nWhen we launched, we had about 150 individuals on board, most of them national leaders. Over three years, though, this movement has spread, earning the endorsement of more than 1,600 evangelical leaders, most of them local pastors. The range of leaders at both the national and local level who have signed on to this Statement is very broad, spanning from coast to coast and to big cities, suburbs, and small towns in between, across the ethnic diversity of American evangelicalism, and over a broad range of theological and political convictions. \nWhat unites us—beyond our hope in the gospel and our commitment to the authority of the Bible—is a desire to see Congress finally act to fix a dysfunctional system that is significantly impacting our community. \nWhat began primarily as an initiative mainly on the national level is reaching to the pews. A LifeWay Research poll conducted earlier this year found that a majority of evangelical Christians nationally support each of our six principles. It also found that Christians across the country are beginning to feel the same urgency that we do: about seven out of ten evangelicals said it was important to them that Congress pass significant new immigration legislation this year. \nWhile not every evangelical Christian shares our approach, the significant majority now do: LifeWay Research’s poll finds that about seven in ten evangelicals support reforms that would include both increased border security and establishing a process by which the undocumented could earn eventual citizenship if they meet certain requirements. As more and more pastors engage the topic of immigration from a biblical perspective, reminding their congregations that the Scriptures actually speak frequently and quite clearly as to how God’s people should treat immigrants, we expect this support to continue to grow. \nOf course, evangelical Christians are not the only constituency advocating for these reforms: Catholic and Mainline Protestant Christians have urged similar reforms for many years now, as have Mormon, Jewish, Muslim and other religious communities. Business and labor leaders have been outspoken in their support for reform, which they believe is firmly in the economic interests of the nation and its workers, as have law enforcement officers who see reform as a matter of public safety. A Pew Research Center report this month found that fully 72 percent of Americans believe that undocumented immigrants should have a path to legal status and/or citizenship, including majorities of Republicans, Democrats, and Independents. \nWe’re still waiting, though, for Congress. Despite good-faith efforts by a bipartisan group of senators in 2013, the House of Representatives has yet to take action, and we’re faced with the status quo. \nAs Christians throughout the country increasingly interact with the people whom our broken system burdens, our resolve has only increased: we need Congress to act on bipartisan immigration reforms consistent with our values, and we are praying that they will do so now. \nNoel Castellanos is the CEO of the Christian Community Development Association. \nStephan Bauman is the President and CEO of World Relief. \nLike us on Facebook ", "external_links": [], "published": "2015-06-25T03:00:00.000+03:00", "crawled": "2015-06-26T09:27:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}