{"organizations": [], "uuid": "d75ac4226208f920da5db25f92757261b8312e47", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/pot.jpg", "site_section": "http://thehill.com/taxonomy/term/49/feed#", "section_title": "The Hill: All Regulation", "url": "http://thehill.com/regulation/244726-marijuana-legislation-clears-senate-panel", "country": "US", "title": "Marijuana reform measure clears Senate panel", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Marijuana reform measure clears Senate panel", "spam_score": 0.0, "site_type": "news", "published": "2015-06-11T22:49:00.000+03:00", "replies_count": 0, "uuid": "d75ac4226208f920da5db25f92757261b8312e47"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/244726-marijuana-legislation-clears-senate-panel", "ord_in_thread": 0, "title": "Marijuana reform measure clears Senate panel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marijuana reform measure clears Senate panel By Tim Devaney - 06/11/15 03:49 PM EDT The Senate is tackling marijuana reform through a series of government funding bills. The medical marijuana provision approved Thursday by the Senate Appropriations Committee would prohibit the Justice Department from interfering with state laws, and comes just a week after the House passed similar legislation . Pot advocates say this all but assures the measure will be included in the final government spending bill that Congress sends to President Obama. ADVERTISEMENT \"Congress is making it clear that the Department of Justice and the [Drug Enforcement Administration] have no business interfering in state medical marijuana laws,” said Dan Riffle, director of federal policies at the Marijuana Policy Project. The pot amendment introduced by Sen. Barbara Mikulski (D-Md.) effectively paves the way for the legalization of medical marijuana. While some states may still choose to prohibit the medicinal use of pot, the federal government would not be allowed to overrule states that allow it. The Senate committee approved the amendment 20-10 on Thursday, just a week after Reps. Dana Rohrabacher (R-Calif.) and Sam Farr (D-Calif.) pushed a similar measure through the House as part of a marijuana vote-a-rama . This is also the second medical marijuana provision to make its way into the Senate version of a government spending bill. Last month, the same Senate committee voted to give veterans more access to medical marijuana as part of another funding bill, for the military. VA doctors would no longer be prohibited from prescribing pot to sick military veterans. \"We’re entering an era where marijuana reform is accepted as mainstream and not seen as controversial, and that’s exactly where we want to be,” said Tom Angell, chairman of the Marijuana Majority. Past: 1 day House Democrat says Obama has lost... Rep. Brad Sherman said opponents of the trade bill \"don’t live in a... Obama smoking? President caught on... President Obama may have been caught on camera holding a pack of... Fast talk from the fast-track... Some GOP members say that TPA will \"constrain the president,\" but it's... Bill would require trade deals to... A House trade vote could come as soon as this week. Sanders blasts Internet 'nonsense... “That’s some of the nonsense that goes on in the Internet,” Sanders said... Dems set budget trap for GOP Dems say they will block spending bills without a summit. Republicans fear they will win... Republicans in Congress are worried the Supreme Court will hand them a... Last-second objections threaten... Democrats want a Medicare fix attached to the must-pass bill. Benghazi chairman pushes back... Trey Gowdy has been accused of using the Benghazi investigation to raise... Michelle Obama tells Chicago grads... Obama encouraged those in attendance to take a page from her book. Sanders wants war spending paid for The 2016 contender is attaching the issue to an annual defense policy bill... White House: Obama wasn't holding... A spokesman did not identify the object Obama is holding in widely... Rubio revels in 'media attacks' Rubio’s quest for the Republican presidential nomination is getting an... Bernie Sanders's great idea: Free... Nothing would do more to bring opportunity to young men and women... Senators vote to block Obama’s... The GOP-backed measure cleared a key panel on a party-line vote. House passes funding for... Lawmakers approved the $55.3 billion measure in a 216-210 vote. Bill Press: Why not Joe for 2016? OPINION | Why isn’t Vice President Joe Biden at the top of the list of... White House: 'Prudent' for Texas... Images of the McKinney, Texas, incident “have a detrimental impact,\" Josh... Obama admin OK with Alaska... The Obama administration “does not object” to changing the name of North... Fast-track holdouts play ‘let’s... Dozens of votes could be in play for the right deal. Top Senate Dem warns GOP: Deal now... \"Republicans have a choice,\" Sen. Patty Murray said Wednesday. Senator reveals Parkinson's... Johnny Isakson said the disease won't impact his run for reelection in... The Hill's Whip List: Trade bill... Over 100 Democrats are opposing fast-track in the House. Bachelor Graham hints at 'rotating... “Well, I've got a sister. She could play that role if necessary,” Graham...", "external_links": [], "published": "2015-06-11T22:49:00.000+03:00", "crawled": "2015-06-12T07:45:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}