{"organizations": [], "uuid": "cb2701acb22cf0a2401e1925363f43525030581b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3076528/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/impact/news.xml", "section_title": "Impact News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/15/obama-government-it_n_7589336.html?utm_hp_ref=impact&ir=Impact", "country": "US", "title": "Obama Says He 'Should Have Anticipated' IT Issues With Healthcare.gov. Here's How He's Avoiding A Repeat.", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Says He 'Should Have Anticipated' IT Issues With Healthcare.gov. Here's How He's Avoiding A Repeat.", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T03:33:00.000+03:00", "replies_count": 0, "uuid": "cb2701acb22cf0a2401e1925363f43525030581b"}, "author": "Alexander Howard", "url": "http://www.huffingtonpost.com/2015/06/15/obama-government-it_n_7589336.html?utm_hp_ref=impact&ir=Impact", "ord_in_thread": 0, "title": "Obama Says He 'Should Have Anticipated' IT Issues With Healthcare.gov. Here's How He's Avoiding A Repeat.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Says He 'Should Have Anticipated' IT Issues With Healthcare.gov. Here's How He's Avoiding A Repeat. Posted: Updated: 2 hours ago President Barack Obama has launched tech initiatives to avoid the kind of IT bungling that bedeviled Healthcare.gov. | MANDEL NGAN via Getty Images reddit \nPresident Barack Obama said he \"should have caught\" the technology procurement issues that would bedevil Healthcare.gov, the federal health insurance marketplace, for months after its launch in October 2013. \nObama's statement, in an interview with Fast Company published online Monday, wasn't the first time he has noted there are problems with the way the federal government buys and builds information technology. But it was the clearest mea culpa he's issued thus far. Here's an excerpt from the interview: \nPart of the problem with Healthcare.gov was not that we didn’t have a lot of hardworking people paying attention to it, but traditionally the way you purchase IT services, software, and programs is by using the same procurement rules and specification rules that were created in the 1930s. ... What we know is, the best designs and best programs are iterative: You start out with, \"What do you want to accomplish?\" The team starts to brainstorm and think about it, and ultimately you come up with something and you test it. And that’s not how we did Healthcare.gov. It’s something, by the way, I should have caught, I should have anticipated: that you couldn’t use traditional procurement mechanisms in order to build something that had never been built before and was pretty complicated. So part of what we’re going to have to do is just change culture, change administrative habits, and get everybody thinking in a different way. \nThe story of how Obama could run the most tech-savvy presidential campaign in U.S. history and later oversee the most high-profile IT failure in U.S. history is more complicated than some accounts suggest. Poor project management and oversight , no single point of leadership, bureaucratic culture, insularity , a procurement system that can sometimes resemble legalized corruption and intense political pressure to launch the project on time all contributed to the disaster. \nThe good news is that the Obama administration has been taking substantive steps to avoid another Healthcare.gov-type crisis . The White House has published playbooks -- collections of best practices and lessons learned -- for IT procurement and digital services . And two Obama administration initiatives -- the U.S. Digital Service , a government management consultancy inside the Office of Management and Budget , and 18F , a software development shop within the General Services Administration -- are working to prevent future IT catastrophes by applying the same analytical and management techniques that rescued Healthcare.gov and building IT projects iteratively in the open , using modern software techniques and tools. Together, the two efforts could be viewed as a public interest startup, USDS Deputy Administrator Haley van Dyck said at the 2015 Personal Democracy Forum conference earlier this month. \nThe USDS grew out of the trauma team the government hired to fix Healthcare.gov, but 18F was already in the works prior to that debacle. The software shop, which is located within the General Services Administration, developed out of the Presidential Innovation Fellowship program , which offers technologists yearlong tours of duty in government service, as well as the Consumer Financial Protection Bureau's efforts to use IT more effectively. \nThe geeks who have entered public service in the final years of the Obama administration want to make digital government work better, and success stories already exist. For the first time, for instance, people can renew a green card online . In the video below, recorded at O'Reilly Media's Velocity Conference on May 29, USDS Administrator Mikey Dickerson talks about what the group accomplished in its first year. \nThe challenge for 18F and the USDS is that the beasts of bureaucracy they are trying to tame are no less real than they were in 2010, when hopes for digital transformation crested in the nation's capital. Five years later, the USDS has a mandate for change and statutory authority under the E-Government Act of 2002. 18F is under heavy demand from agencies interested in its services. They both also have the backing of the most powerful man in the world: Obama told Fast Company that he's personally involved in recruiting technology talent and making calls about digital projects: \nPart of the reason why we’ve been successful so far is I have essentially provided air cover for these teams because I can call up the secretary of transportation, or HUD, or the Small Business Administration, and say, \"I want this to happen. And I don’t want us to find a reason not to do it just because it hasn’t been done before. And I want us to bring together a team to be as creative as possible.\" \nBut Obama leaves office in 19 months, and neither initiative is guaranteed a future in the next administration. (No presidential candidate has publicly committed to keeping either entity.) In an era when the public's trust in federal government is at abysmal lows, demonstrating that federal agencies can deliver secure, effective digital services will be critical to ensuring that these initiatives endure. \nHackers' misuse of the Internal Revenue Service's \"Get Transcript\" feature and the recent data breach at the Office of Personnel Management show what can happen when the government gets IT wrong. In the year and a half to come, hundreds of millions of Americans could benefit if the USDS and 18F are able to show what happens when the government gets it right. More:", "external_links": [], "published": "2015-06-16T03:33:00.000+03:00", "crawled": "2015-06-16T06:51:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}