{"organizations": [], "uuid": "de495a4f15e7a85d623cb1dba05eb5c6d826e7e1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/062515_dotcom_emails_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/06/29/benghazi-night-call-between-clinton-and-obama-withheld-documents-show/", "country": "US", "title": "Benghazi night call between Clinton and Obama withheld, documents show", "performance_score": 10, "site": "foxnews.com", "participants_count": 29, "title_full": "Benghazi night call between Clinton and Obama withheld, documents show | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-29T03:00:00.000+03:00", "replies_count": 30, "uuid": "db8ed123143304b11c8714bc5758e450180fe779"}, "author": "Catherine Herridge", "url": "http://www.foxnews.com/politics/2015/06/29/benghazi-night-call-between-clinton-and-obama-withheld-documents-show/#post-0", "ord_in_thread": 0, "title": "Benghazi night call between Clinton and Obama withheld, documents show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Catherine Herridge\nPublished June 29, 2015 FoxNews.com livefyre Email Print\nNew documents released by a federal court show President Obama called then-Secretary of State Hillary Clinton on the night of the 2012 Benghazi attack -- but the contents are being withheld by the State Department.\nIt had previously been disclosed that Clinton and Obama spoke the night of the terror attacks. But the documents offer additional information about the timing of the call -- after the initial attack on the U.S. consulate, but before the second wave where mortars hit the nearby CIA annex and killed former Navy SEALs Ty Woods and Glen Doherty.\nThe contents of the call, however, are being withheld, not because the information is classified but because the administration claims they represent internal deliberations about the 2012 terror assault.\nThe claim comes as Clinton also faces accusations that she withheld Benghazi-related emails from her private server in the trove of emails handed over to the State Department.\nThe contents of the call were only shared with Obama's and Clinton's closest aides. Deputy National Security Adviser Ben Rhodes sent an email on the call to State Department officials Jake Sullivan and Philippe Reines, and National Security Council spokeswoman Bernadette Meehan.\nThe email was released as part of an ongoing lawsuit by conservative watchdog group Judicial Watch.\nThe email on the Obama-Clinton phone call bears the subject line, \"Call.\" The text of the email says, \"Readout of President's Call to Secretary Clinton,\" but the rest of the details are fully redacted. The State Department cited the so-called \"B5\" exception for internal deliberations.\nThe emails also show that Rhodes, on the night of Sept. 11, 2012, and before the attack was over, endorsed a statement from Clinton that cited an anti-Islam Internet video.\nThat statement noted some tried to justify the assault \"as a response to inflammatory material posted on the Internet.\" Rhodes told Clinton's aides that \"we should let State Department statement be our comment for the night.\"\nThe following day, Sept. 12, Meehan sent an email to State and NSC officials saying Rhodes would host a conference call that morning \"to ensure we are all in sync on messaging for the rest of the day.\"\nThe narrative about protests over an Internet video would later become a point of major controversy. Fox News was first to report, on Sept. 17, 2012, there was no demonstration before the attack.\nJudicial Watch President Tom Fitton said in a statement: \"It is little wonder that Mrs. Clinton and the entire Obama administration have fought so hard to keep these documents from the American people -- they shine a spotlight on the administration's incompetence and indifference. All evidence now points to Hillary Clinton, with the approval of the White House, as being the source the Internet video lie.\"\nOther emails from Judicial Watch lawsuits have, separately, shown Rhodes played a central role in preparing former U.N. ambassador Susan Rice for her Sunday show appearances that weekend where she blamed protests over the Internet video.\nIn that Sept. 14 email, Rhodes specifically draws attention to the video, without distinguishing whether the Benghazi attack was different from protests elsewhere in the region.\nThe email lists the following two goals, among others:\n\"To underscore that these protests are rooted in an Internet video, and not a broader failure of policy.\"\n\"To reinforce the President and Administration's strength and steadiness in dealing with difficult challenges.\"\nCatherine Herridge is an award-winning Chief Intelligence correspondent for FOX News Channel (FNC) based in Washington, D.C. She covers intelligence, the Justice Department and the Department of Homeland Security. Herridge joined FNC in 1996 as a London-based correspondent.\nAdvertisement\nTrending in Politics 1 Judge orders Brady Center to pay ammo dealer’s legal fees after dismissing lawsuit 2 Supreme Court upholds use of drug implicated in botched executions 3 Puerto Rico governor warns public debt not payable 4 Benghazi night call between Clinton and Obama withheld, documents show 5 Scott Walker: I'd 'absolutely' nuke the filibuster to repeal ObamaCare See all Trends Advertisement", "external_links": [], "published": "2015-06-29T03:00:00.000+03:00", "crawled": "2015-06-29T18:26:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}