{"organizations": ["Mandalay Bay Events Center", "Trump Organization", "Pease International Trade Port", "New Hampshire Primary", "Tower Dubai", "ISIS Donald Trump", "CNN", "Lincoln Center", "Lobster House", "U.S. Trump", "ISIS", "Trump Entertainment Resorts", "Trump International Hotel & Tower Dubai", "Iowa Freedom Summit", "New York Hilton", "Gucci", "Republican Leadership Conference", "NBC Universal", "Donald Trump Friars Club Roast Luncheon", "Univision"], "uuid": "1b7e764f96c02c07b8137ae033443585038da91a", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150616121401-donald-trump-cnn-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/06/28/politics/donald-trump-immigration-gay-marriage-2016/index.html", "country": "US", "title": "Trump talks immigration, marriage and ISIS", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Trump talks immigration, marriage and ISIS", "spam_score": 0.0, "site_type": "news", "published": "2015-06-28T17:00:00.000+03:00", "replies_count": 0, "uuid": "1b7e764f96c02c07b8137ae033443585038da91a"}, "author": "", "url": "http://edition.cnn.com/2015/06/28/politics/donald-trump-immigration-gay-marriage-2016/index.html", "ord_in_thread": 0, "title": "Trump talks immigration, marriage and ISIS", "locations": ["Las Vegas", "Iran", "Washington", "Portsmouth", "Dover", "Florida", "Boca Raton", "Iowa", "Iraq", "Des Moines", "Sanborn Square", "New Hampshire", "New York City", "New York", "Mexico", "U.S.", "New England", "Alaska", "Louisiana", "Nevada", "China", "Central Park", "New Orleans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush", "Heidi Klum", "Jack Nicklaus", "Serena Williams", "Donald Trump", "Trump", "Ivanka", "Stefania Fernandez", "Ashley Codianni", "Stephen Collinson", "Marla Maples", "Sarah Palin", "Ivana", "Eric", "Melania", "Donald Jr.", "Jake Tapper", "Barron"], "text": "Donald Trump doubles down on calling Mexicans 'rapists' 04:36 Washington (CNN) Presidential candidate Donald Trump touched on a wide range of issues in an interview aired Sunday on CNN's \"State of the Union,\" including his continued support for traditional marriage, immigration issues with Mexico and his desire to bring outsourced jobs back to the U.S. Trump, whose comments on undocumented immigrants from Mexico led to Univision deciding not to air the Miss Universe pageant -- co-owned by Trump and NBC Universal -- doubled-down on his plan to build a wall along the U.S.-Mexican border. Trump has since said he intends to sue Univision . \"I like Mexico. I love the Mexican people. I do business with the Mexican people, but you have people coming through the border that are from all over. And they're bad. They're really bad,\" he told CNN's Jake Tapper. \"You have people coming in, and I'm not just saying Mexicans, I'm talking about people that are from all over that are killers and rapists and they're coming into this country,\" he maintained. The real estate mogul revisited his socially conservative views on abortion and marriage with awareness that they are difficult for many to understand given his personal history. \"I'm (for) traditional marriage,\" he said. When asked how Trump reconciles the notion of \"traditional marriage\" with his personal history of being married three times and divorced twice, Trump conceded the point. \"I have a good wife now,\" Trump said. \"My (first) two wives were very good. And I don't blame them, but I was working ... 22 hours a day.\" Trump, who in his presidential announcement said he'd be the \"best jobs president that God ever created,\" emphasized the need to get more Americans back to work. \"You have to bring in jobs, you have to take the jobs back from China, you have to take the jobs back from Mexico,\" he said. But he argued that producing his own brand's clothing in China doesn't make him hypocritical on outsourcing. \"They've manipulated their currency to such a point that it's impossible for our companies to compete with them,\" he said. \"It's very, very hard to have anything in apparel made in this country.\" Donald Trump in the public eye 20 photos Real estate mogul and billionaire Donald Trump attends golf legend Jack Nicklaus' Congressional Gold Medal ceremony on March 24, 2015, in the U.S. Capitol Rotunda. Trump announced on March 18 that he has launched a presidential exploratory committee. Hide Caption 1 of 20 Donald Trump in the public eye 20 photos Trump speaks to guests at the Iowa Freedom Summit on January 24, 2015, in Des Moines, Iowa. Hide Caption 2 of 20 Donald Trump in the public eye 20 photos As chairman and president of the Trump Organization and the founder of Trump Entertainment Resorts, Trump speaks during day two of the Republican Leadership Conference on May 30, 2014, in New Orleans, Louisiana. Hide Caption 3 of 20 Donald Trump in the public eye 20 photos Former U.S. vice presidential candidate and Alaska Gov. Sarah Palin and Trump walk toward a limousine after leaving Trump Tower, at 56th Street and 5th Avenue, on May 31, 2011, in New York City. Hide Caption 4 of 20 Donald Trump in the public eye 20 photos Trump looks out the window of his limousine after visiting Newick's Lobster House on April 27, 2011, in Dover, New Hampshire. Hide Caption 5 of 20 Donald Trump in the public eye 20 photos Trump speaks to the media at Pease International Trade Port on April 27, 2011, in Portsmouth, New Hampshire. Hide Caption 6 of 20 Donald Trump in the public eye 20 photos Trump speaks to a crowd at the Palm Beach County Tax Day Tea Party on April 16, 2011, at Sanborn Square in Boca Raton, Florida. Hide Caption 7 of 20 Donald Trump in the public eye 20 photos Trump and his wife, Melania, attend the Michael Kors Spring 2011 fashion show during Mercedes-Benz Fashion Week at The Theater at Lincoln Center on September 15, 2010, in New York City. Hide Caption 8 of 20 Donald Trump in the public eye 20 photos Trump kisses Miss Universe 2009 Stefania Fernandez as they arrive at the 2010 Miss Universe Pageant at the Mandalay Bay Events Center on August 23, 2010, in Las Vegas, Nevada. Hide Caption 9 of 20 Donald Trump in the public eye 20 photos Trump and his children Eric (second from left), Ivanka and Donald Jr. attend the ribbon-cutting ceremony for Trump SoHo New York at Trump SoHo on April 9, 2010, in New York City. Hide Caption 10 of 20 Donald Trump in the public eye 20 photos Trump, his daughter Ivanka, wife Melania and son Barron attend the \"The Trump Card: Playing to Win in Work and Life\" book launch celebration at Trump Tower on October 14, 2009, in New York City. Hide Caption 11 of 20 Donald Trump in the public eye 20 photos Trump and professional tennis player Serena Williams attend the Gucci cocktail party for the Foundation For the Advancement of Women Now at Gucci Fifth Avenue on September 16, 2009, in New York City. Hide Caption 12 of 20 Donald Trump in the public eye 20 photos Trump's wife, Melania (left), Trump and model Heidi Klum attend the launch of Trump International Hotel and Tower Dubai on June 23, 2008, at the Park Avenue Plaza in New York City. Hide Caption 13 of 20 Donald Trump in the public eye 20 photos Trump attends the debut of a Lego replica of the Trump International Hotel & Tower Dubai on June 23, 2008, at Central Park in New York City. Hide Caption 14 of 20 Donald Trump in the public eye 20 photos Trump attends the announcement of a partnership with Affliction Entertainment on June 5, 2008, at Trump Tower in New York City. Hide Caption 15 of 20 Donald Trump in the public eye 20 photos Trump attends the Donald Trump Friars Club Roast Luncheon at the New York Hilton on October 15, 2004, in New York City. Hide Caption 16 of 20 Donald Trump in the public eye 20 photos Trump poses with the new Donald Trump 12-inch talking doll September 29, 2004, at the Toys 'R' Us store in New York City. Hide Caption 17 of 20 Donald Trump in the public eye 20 photos Trump arrives at \"The Apprentice\" casting call in Trump Tower on July 30, 2004, in New York City. Hide Caption 18 of 20 Donald Trump in the public eye 20 photos Trump dips Marla Maples after the couple married in a private ceremony amid tight security at the Plaza Hotel on December 20, 1993, following a six-year courtship. Hide Caption 19 of 20 Donald Trump in the public eye 20 photos Trump and his wife, Ivana, arrive at a social engagement December 4, 1989, in New York. Hide Caption 20 of 20 Trump shared his plan to bomb the oil fields of Iraq to end ISIS's funding source, and his lack of respect for the Iraqi government in part because of their relationship with Iran. \"I don't care about the government of Iraq. They're corrupt. The government of Iraq is totally corrupt,\" he said. But Trump maintains he's a serious candidate. \"It's something that I've looked at over the years, I looked at it very seriously, as you know, four years ago,\" he said. Trump has surprised some by polling second behind former Florida Gov. Jeb Bush in a recent CNN/WMUR New Hampshire Primary poll . <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Politics Originals Story by Stephen Collinson and video by Ashley Codianni It wouldn't be the first time a revolution sparked in New England changed the world.", "external_links": [], "published": "2015-06-28T17:00:00.000+03:00", "crawled": "2015-06-28T17:06:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}