{"organizations": ["Slain South Carolina Pastor Clementa Pinckney Obama To Deliver Eulogy For Slain South Carolina Pastor Clementa Pinckney Reuters"], "uuid": "f80191f248451214732c1037cf0d3ba766939b5d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3121186/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/26/obama-eulogy_n_7670764.html", "country": "", "title": "Obama To Deliver Eulogy For Slain South Carolina Pastor Clementa Pinckney", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama To Deliver Eulogy For Slain South Carolina Pastor Clementa Pinckney", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T16:54:00.000+03:00", "replies_count": 0, "uuid": "f80191f248451214732c1037cf0d3ba766939b5d"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/26/obama-eulogy_n_7670764.html", "ord_in_thread": 0, "title": "Obama To Deliver Eulogy For Slain South Carolina Pastor Clementa Pinckney", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama To Deliver Eulogy For Slain South Carolina Pastor Clementa Pinckney Reuters reddit \nBy David Adams \nCHARLESTON, S.C., June 26 (Reuters) - South Carolina will take a step forward in healing the wounds of last week's mass shooting when President Barack Obama arrives on Friday to deliver the eulogy for the pastor of the historic church where the attack took place. \nReverend Clementa Pinckney, a widely admired state senator and pastor of Charleston's Emanuel African Methodist Episcopal Church, was among the nine people who died when a gunman opened fire during Bible study. \nThe massacre has sparked an intense dialog across the southern United States over the legacy of slavery and its symbols, centering on the Civil War-era battle flag of the Confederacy. \nAddressing the shooting last week, Obama said it raised questions \"about a dark part of our history.\" \nNicknamed \"Mother Emanuel,\" the Gothic Revival-style house of worship is the oldest A.M.E. church in the southeastern United States, and was founded by slaves. \nIn an unusual step, Obama will be accompanied by both First Lady Michele Obama and Vice President Joe Biden for the funeral in a Charleston college arena. All three knew Pinckney personally. \nDuring his presidency, Obama has spoken at half a dozen memorial services for victims of mass shootings in Texas, Arizona, Colorado and Connecticut. \n\"I've had to make statements like this too many times,\" a visibly upset Obama said from the White House last week. \"Communities like this have had to endure tragedies like this too many times.\" \nObama repeated previous calls he has made for tougher gun laws, a politically thorny issue in the United States where the constitution guarantees the right to own guns. \n\"At some point, we as a country will have to reckon with the fact that this type of mass violence does not happen in other advanced countries. It doesn't happen in other places with this kind of frequency,\" he said. \nMarried with two children, Pinckney was a talented orator with a baritone voice and began preaching at 13. A Democrat, at 23 he became the youngest African-American in South Carolina history to be elected to the state legislature. \nSeveral thousand turned out on Thursday evening for Pinckney's wake at Emanuel, the line of mourners stretching for three blocks, including 200 college fraternity brothers, friends, politicians and members of the public, both black and white. \n\"I cried when I got here,\" said Katharine Moseley, a Texas bus driver who drove 20 hours from Austin. \"I was raised in the A.M.E. church.\" \nLutheran bishop Mike Rhyne also drove down with his wife and three children from central Pennsylvania to pay tribute to his friend and fellow seminary student. \"He was one of the best men I have ever met,\" he said. \nPinckney's high school friends Kevin Riley, 41, and Lachandra Colbert, 42, traveled from Maryland for the funeral. \"We wouldn't miss this. He was our classmate,\" said Riley. \"He was on track to be someone really important,\" Riley added. \nMourners universally echoed the words of forgiveness by relatives of their slain churchgoers for the white man, Dylann Roof, accused of the murders. \n\"We are not the ones to judge, we leave that to God,\" said Maxine Frasier Riley, 65, a retired school guidance counselor. \nThe Department of Justice has opened a hate crime investigation into the shooting. \nRoof posed with the Confederate flag in photos posted online and allegedly made racist remarks to his victims as he opened fire. \nIn the aftermath of the slayings, South Carolina Governor Nikki Haley and other Republicans have called for the flag's removal from the State House grounds, saying it is divisive. \nThe controversy has spread across the country, with politicians adding to voices clamoring for the removal of Confederate symbols and names, and major retailers removing merchandise with Confederate images from stores and websites. (Additonal reporting by Roberta Rampton in Washington and Harriet McLeod in Charleston; Editing by Nick Macfie) Also on HuffPost:   \"My heart is breaking for Charleston and South Carolina tonight. This senseless tragedy at a place of worship - where we come together to laugh, love and rejoice in God's name - is absolutely despicable and can never be understood. Tonight we stand together in prayer for Pastor Pinckney and his congregation at Emanuel AME, and for the families who are enduring unimaginable pain at the loss of their loved ones. We will come together as a city and as a state to lift up those who need us most right now. I hope for their sake, and for the people of Charleston, that the perpetrators of this terrible crime are swiftly brought to justice.\" “Our prayers are with the families of the victims and the people of Charleston. We are all heartbroken by this tragedy. “To the families of the victims, please know that you are being prayed for and loved by so many in the community and across the nation. I pray that God will provide you healing in the coming days. “There are bad people in this world who are motivated by hate. Every decent person has been victimized by the hateful, callous disregard for human life shown by the individual who perpetrated these horrible acts. \"Our sense of security and well-being has been robbed and shaken.” \"Today we say to families of Mother Emanuel, you do not walk alone,\" Clinton said at the 2015 NALEO Convention. \"How many people do we need to see cut down before we act?\" she added. \"Michael, Rena, Nalin and I are praying for the victims and families touched by tonight's senseless tragedy at Emanuel AME Church. While we do not yet know all of the details, we do know that we'll never understand what motivates anyone to enter one of our places of worship and take the life of another. Please join us in lifting up the victims and their families with our love and prayers.\" \"There can be no trying to understand or explain away this evil behavior,\" Jindal said in an interview on CNN. \"I do hope this community will be able to find some comfort in their faith,\" he added. \"Today, the nation mourns as we learn more about the harrowing shooting at the historic Emanuel AME Church in Charleston, South Carolina. As law enforcement continues its work and as the victims' families and community begin to heal, we are heartbroken and painfully reminded that our work is far from done. No one should ever have a reason to be afraid to go to their place of worship. We must recommit to ensuring our communities are safe from senseless and hateful acts of violence.\" \"The Charleston church killings are a tragic reminder of the ugly stain of racism that still taints our nation. This senseless violence fills me with outrage, disgust and a deep, deep sadness. The hateful killing of nine people praying inside a church is a horrific reminder that, while we have made significant progress in advancing civil rights in this country, we are far from eradicating racism. Our thoughts and prayers are with the families and their congregation.\" “My heart and prayers go out to the entire Charleston community and the families and loved ones of victims in this horrific hate crime, as gun violence again grips our nation. Mass murder and gun violence have killed children and educators in their Sandy Hook school, moviegoers in Colorado, and men and women in their workplaces and neighborhoods across America. Last night gun violence invaded yet another sacred place – a site of ultimate sanctity and safety. We are far beyond saying ‘enough is enough’ and in danger of being numb to the scourge of gun violence plaguing our country. Numbness to gun violence is consummate complicity.\" “The brutal killing of nine innocent African-Americans at the historically black Emmanuel AME Church in South Carolina, including pastor and State Senator Clementa Pinckney, is an unspeakable and horrific tragedy by any measure. These individuals simply gathered to worship and study the Bible in a sanctuary and place of refuge as they did every week, but were senselessly killed. My most heartfelt condolences go out to all of the families and friends of the victims as well as the entire community. “It is my hope that all levels of state, local and federal law enforcement work together to capture this brutal killer before any more senseless violence occurs. I commend the Department of Justice for their swift determination to open a federal hate crimes investigation.” “Like all Americans, Marcelle and I are shaken by the horrific tragedy in Charleston. We all deserve to feel safe regardless of who we are, who we love, or what religion we choose to practice. Our thoughts and prayers are with the grieving families and parishioners whose right to feel safe in their community and their place of worship was taken from them yesterday. “I appreciate the swift engagement by the Department of Justice to monitor the situation and to assist in any way possible. Today, we stand with the people of Charleston and with the brave law enforcement officers and agents who are working to bring to justice the person or persons responsible for these heinous acts.” \"My thoughts and prayers are with the families of the victims of last night's shooting in Charleston, who were tragically taken from us as they gathered together in prayer inside their place of worship. While details are still emerging, I have faith in law enforcement that the perpetrator of this evil and senseless act will be brought to justice and prosecuted to the fullest extent of the law.\" \"This was an absolutely troubling and heart wrenching moment. The fact is that nine innocent lives are lost. Our hearts go out to the people of Charleston. Our hearts go out to the members of the Emanuel African Methodist Episcopal Church. We in this city feel the pain of people anywhere in this country, anywhere in this globe, because we’re so connected to each and every part of the country and the world. There are so many people here who hail from South Carolina, and it’s a very, very painful moment for all of us. I want everyone to know there’s no place in New York City for this kind of hatred, and that we, through the NYPD, have increase our resources directed at protecting African-American churches in this city as a precaution.\" \"Hate has once again been let loose in an American community. And the senseless actions of a coward have once again cut short so many lives with so much promise. Our hearts ache with sorrow with the entire Emanuel AME Church family as they seek solace and comfort in the shadow of a gunman’s act of pure evil and hatred. Our love and prayers are with them. \"We last saw Reverend Clementa Pinckney less than a year ago at a prayer breakfast in Columbia. He was a good man, a man of faith, a man of service who carried forward Mother Emaunel’s legacy as a sacred place promoting freedom, equality, and justice for all. We pray for him and his sister as we do for the seven other innocent souls who entered that storied church for their weekly Bible study seeking nothing more than humble guidance for the full lives ahead of them. \"We have no doubt the coward who committed this heinous act will be brought to justice. But as a nation we must confront the ravages of gun violence and the stain of hatred that continues to be visited on our streets, in our schools, in our houses of worship, and in our communities. \"As Mayor Riley made clear, all of Charleston’s heart bleeds today—but the overwhelming display of unity will bring forth the city’s healing. We will never forget those innocent souls who lost their lives. We will be there with all the strength and support and prayers we can offer to the families who now grieve. And as a nation we will come together.\" “I commend law enforcement officials for their work to apprehend the suspect in the shooting at Emanuel African Methodist Episcopal Church in Charleston, South Carolina. There are no words to express the anguish and shock felt by people across the nation from this massacre. As the son of two preachers, I know the sanctity and security the church offers for people of faith. It is unimaginable that someone would commit such an act of violence in a place of worship that resulted in the loss of nine lives. “My prayers are with the families and loved ones of those who were killed and for the Charleston community as they begin the healing process.”  Share ", "external_links": [], "published": "2015-06-26T16:54:00.000+03:00", "crawled": "2015-06-26T17:00:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}