{"organizations": [], "uuid": "5c40986487cced7d0578c2f88e7b089a9c450f53", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/soldieriraq_061015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/244544-obama-sending-more-us-troops-to-iraq", "country": "", "title": "Obama sending more US troops to Iraq | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama sending more US troops to Iraq | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "5c40986487cced7d0578c2f88e7b089a9c450f53"}, "author": "", "url": "http://thehill.com/policy/defense/244544-obama-sending-more-us-troops-to-iraq", "ord_in_thread": 0, "title": "Obama sending more US troops to Iraq | TheHill", "locations": ["Jordan Fabian", "US", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama sending more US troops to Iraq Getty Images By Jordan Fabian - 06/10/15 12:23 PM EDT \nThe White House announced Wednesday it will send more military personnel to Iraq to train forces fighting the Islamic State in Iraq and Syria (ISIS). ADVERTISEMENT It will also establish a new military base in Anbar Province to assist Iraqi forces in retaking the capital there, Ramadi.\nPresident Obama has authorized up to 450 additional U.S. troops “to train, advise, and assist” Iraqi forces fighting ISIS, White House spokesman Josh Earnest said. \nThe troops will not serve in a combat role. There are currently 3,100 troops deployed to Iraq to help train military forces there. \nThe decision comes after Ramadi’s fall last month, a major victory for ISIS that prompted the administration to review its training and equipping mission. \nObama telegraphed tweaks to the plan on Monday, when he said “we don’t have a complete strategy yet” to train and equip the Iraqi military. But he said the Pentagon was working on a new plan. \nObama’s moves came at the request of Iraqi Prime Minister Haider al-Abadi, who has pleaded with the U.S. and its coalition partners for more military and intelligence backing in combating the terrorist group. \nThe president met with the Iraqi leader on the sidelines of the Group of Seven summit of leading industrial nations on Monday in Germany, where Obama pledged more assistance. \nBut Obama also called on Abadi to do more to recruit fighters to government forces and Sunni militias fighting ISIS extremists. \n“What is fair to say is that all the countries in the international coalition are prepared to do more to train Iraqi security forces if they feel that additional work is taken advantage of,” he said. \nThe president’s plan was met with skepticism on Capitol Hill from both Republicans and Democrats. \nRep. Chris Van Hollen (D-Md.), who supports the training and equipping mission, expressed “grave concern” that sending additional troops to Iraq would result in “mission creep.” \n“This is a fight where the Iraqi forces need to take on responsibility and we can’t have a situation where the United States is once again putting people on the ground in combat situations,” he said. \nSen. Joe Manchin (D-W.Va.) a member of the Senate Armed Forces Committee, called for a new approach in Iraq . He even floated the idea of splitting the country into three separate states to eliminate sectarian violence, an idea that had previously been ridiculed in Washington when Vice President Biden suggested it years ago while serving in the Senate. \n“Past results have not been very good,” he said on MSNBC. “Insanity is doing the same thing over and over and thinking you're going to change and have a different result.” \nSpeaker John Boehner (R-Ohio) said the president still lacks a clear strategy to confront terrorist threats in the Middle East. \n“It’s a step in the right direction, but as the president admitted the other day, he has no strategy to win,” he told reporters at a press conference. \n“This is another tactical move. I support the tactical move the president is taking, but where is the overarching strategy to deal with the largest state sponsor of terror in the region, Iran, and to deal with ISIL and all of their related groups?” Boehner said, using an alternate acronym for ISIS. \nThe U.S. will set up a new training site for Iraqi troops at Taqaddum military base in eastern Anbar Province, adding to four existing training facilities. \nU.S. officials have expressed concern about the pace of the Iraqi government’s recruitment efforts. One of the training sites, Al Asad Air Base, has not received any new recruits in four to six weeks. \nDefense Secretary Ash Carter said Iraqi forces who were defeated at Ramadi lacked the \"will to fight.\" But tribal fighters there had complained of not receiving any training or equipment from the central government. \n\"One of the things that we're still seeing is, in Iraq, places where we've got more training capacity than we have recruits,\" Obama said Monday after his meeting with Abadi. \nMore than 9,000 Iraqi troops have been trained by U.S. personnel and an additional 3,000 are currently in training, according to the White House. \nObama also directed “expedited delivery” of military equipment and weapons to Iraqi military forces as well as other tribal fighters operating under Iraqi command. \n— This report was updated at 1:07 p.m. Tags: ", "external_links": [], "published": "2015-06-10T03:00:00.000+03:00", "crawled": "2015-06-11T00:16:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}