{"organizations": [], "uuid": "2dc572b12000a31409808ffdf702ad1ea961a41c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/06/24/fast-track-trade-measure-sought-by-obama-wins-final-approval-in-senate/", "country": "US", "title": "‘Fast track’ trade measure sought by Obama wins final approval in Senate", "performance_score": 5, "site": "foxnews.com", "participants_count": 5, "title_full": "‘Fast track’ trade measure sought by Obama wins final approval in Senate | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T03:00:00.000+03:00", "replies_count": 4, "uuid": "34755f7e7c2d83532e6eb96305baec7a87976974"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/06/24/fast-track-trade-measure-sought-by-obama-wins-final-approval-in-senate/#post-0", "ord_in_thread": 0, "title": "‘Fast track’ trade measure sought by Obama wins final approval in Senate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print A key plank of President Obama’s trade agenda won final approval in the U.S. Senate on Wednesday, capping a dramatic few weeks that saw the legislation nearly collapse amid Democratic infighting.\nThe Senate voted 60-38 for a bill giving Obama so-called “fast track” authority to negotiate trade deals. The bill, already approved by the House, now goes to Obama’s desk.\nThe vote marks a remarkable turnaround for an initiative that House Democrats nearly killed earlier this month. \nThough both parties have been divided on the issue, it was particularly problematic in the Democratic caucus – in the end, Obama’s biggest allies were Republican congressional leaders.\nOpening Senate debate on Wednesday, Senate Majority Leader Mitch McConnell, R-Ky., a frequent Obama antagonist, credited the president and Democrats who joined the GOP on the bipartisan measure.\n\"We were really pleased to see President Obama pursue an idea we've long believed in,\" McConnell said. \"We thank him for his efforts to help us pass a bill to advance it.\"\nThe “fast track\" authority would let Obama negotiate deals that Congress can ratify or reject, but not change.\nHe wants that power to advance the so-called Trans-Pacific Partnership with Japan, Mexico, Canada and several other countries.\nUnions and most congressional Democrats say free-trade deals cost U.S. jobs and reward countries that pollute and mistreat workers. But Obama and most Republican leaders say U.S. products must reach broader markets.\nThe Senate also plans to vote on three other trade-related bills. The most important would extend a job retraining program for workers displaced by international trade. That program would require House approval, too.\nSome anti-trade groups say they will strongly oppose the Pacific pact. Others seem more resigned to the likelihood of new U.S. trade agreements in Obama's final months in office.\nThe Associated Press contributed to this report. \n ", "external_links": [], "published": "2015-06-24T03:00:00.000+03:00", "crawled": "2015-06-24T23:47:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}