{"organizations": ["The Supreme Court", "Senate", "Republican House", "Kaiser Family Foundation", "Congress", "Manhattan Institute", "Health and Human Services", "Supreme Court"], "uuid": "97f4fffc58d320db23abf1661cadc493b6958260", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/24/opinions/walker-affordable-care-act-decision/index.html", "country": "", "title": "Walker: Obama can't pass buck on Affordable Care Act - CNN.com", "performance_score": 7, "site": "cnn.com", "participants_count": 0, "title_full": "Walker: Obama can't pass buck on Affordable Care Act - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "97f4fffc58d320db23abf1661cadc493b6958260"}, "author": "", "url": "http://www.cnn.com/2015/06/24/opinions/walker-affordable-care-act-decision/index.html", "ord_in_thread": 0, "title": "Walker: Obama can't pass buck on Affordable Care Act - CNN.com", "locations": ["Washington", "Wisconsin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["P.J. O'Rourke", "Sylvia Mathews Burwell", "Burwell", "Scott Walker", "Obama", "Obamacare"], "text": "Obamacare at the Supreme Court in less than three minutes 02:52 Story highlights The Supreme Court is set to decide a key case on health exchange subsidies Scott Walker: It's clear Obamacare must be repealed Scott Walker is the governor of Wisconsin. The views expressed are his own. (CNN) The Obama administration has had plenty of advance notice about the King v. Burwell decision and the potential outcomes, but it seems the President's only plan is to continue pointing his finger at the states for a problem he created. In fact, when testifying recently about Obamacare implementation and the upcoming court decision, Health and Human Services Secretary Sylvia Mathews Burwell refused to give concrete answers to basic questions about the administration's contingency plan or willingness to work with Congress on a fix. Just last week, Secretary Burwell was in Wisconsin. She could have used the opportunity to tell Wisconsin residents how the federal government is going to solve its Obamacare mess, but instead she promoted the use of \"free\" Obamacare services. Free for who? According to data gathered by the Manhattan Institute , individual insurance premiums in Wisconsin for a 40-year-old male climbed 83% compared with pre-Obamacare numbers, and 38% for a 40-year-old woman. For a 27 year-old, the hike was even greater. It seems that P.J. O'Rourke was frighteningly accurate when he said: \"If you think health care is expensive now, wait until you see what it costs when it's free.\" When the federal government pushed Wisconsin to expand Medicaid, holding out the promise of millions in federal funds in 2013, we said \"No thank you.\" We knew trusting the federal government to follow through on its promises would end with Wisconsin taxpayers on the hook. Forced to accept the confines of Obamacare, our goal was to chart a path to protect those in Wisconsin who needed Medicaid the most, while moving people toward true independence. Wisconsin is the only state that didn't accept the Medicaid expansion funds and that has no gap in coverage, according to the Kaiser Family Foundation . For the first time in state history, everyone living in poverty has access to coverage. But despite our best efforts to mitigate the damage of Obamacare, the consequences of the law have been profound as employers have cut hours , while some workers lost their insurance altogether and are struggling to pay the dramatic premium increases. Meanwhile, even many families that have Obamacare coverage can't afford the deductible and doctor fees, while others can no longer see trusted doctors. It's clear Obamacare must be repealed and replaced with a plan that puts patients and their families back in charge. From the beginning, the President's implementation of Obamacare has been called into question, and in the next week, the Supreme Court is expected to rule on King v. Burwell, deciding a central component of Obamacare's structure: Can the federal government subsidize healthcare plans purchased on the federal exchange? If the high court rules in favor of the administration, Obamacare will continue, unchanged. And that means the Republican House and Senate must redouble the fight to repeal and replace Obamacare. But if the ruling goes against the Obama administration, roughly 6 million people nationwide, including 184,000 in my home state , could lose their health insurance without immediate action by the President to work with Congress. This is a big problem. Forced to acknowledge that Obamacare is broken, will the President admit his failure, and prevent millions from losing health insurance by acting to repeal and replace his failed experiment? Will he do the right thing and work with Republicans in Congress to ensure those impacted are transitioned appropriately post-Obamacare? So far, the only answer Americans have had from the President is finger pointing. The decision will be a turning point. States didn't create this problem, Washington did. Governors across the country have been clear: If the Supreme Court strikes down the Obama executive overreach, we will not bail out Obama at the expense of the American people. We will not set up state exchanges under the rules of Obamacare. From the beginning, it was clear that Obamacare would fail the American people. The administration and Congress owe it to them to detail their plan to protect Americans whose access to health care could be impacted by the court's decision. That plan should be to repeal and replace Obamacare and put patients back in charge of health care for themselves and their families. ", "external_links": [], "published": "2015-06-24T03:00:00.000+03:00", "crawled": "2015-06-24T18:53:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}