{"organizations": [], "uuid": "32999c781fd88d79e9491cd2cf2bfa2416c76679", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/lifestyle/2015/06/01/products-for-growing-marijuana-hit-market-in-uruguay/", "country": "IL", "title": "Products for growing marijuana hit the market in Uruguay", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Products for growing marijuana hit the market in Uruguay", "spam_score": 0.0, "site_type": "news", "published": "2015-06-01T16:11:00.000+03:00", "replies_count": 0, "uuid": "32999c781fd88d79e9491cd2cf2bfa2416c76679"}, "author": "", "url": "http://latino.foxnews.com/latino/lifestyle/2015/06/01/products-for-growing-marijuana-hit-market-in-uruguay/", "ord_in_thread": 0, "title": "Products for growing marijuana hit the market in Uruguay", "locations": ["Uruguay"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Products for growing marijuana hit the market in Uruguay Published June 01, 2015 EFE \nBy Patricia Alvares. \nSpecial soil, humidity gauges, pruning shears and books on growing cannabis are among the items in demand in Uruguay a year after the regulations for producing and marketing marijuana under government control took effect. \n\"We noticed that there has been increased demand, and it continues because the market was created and it will keep growing,\" Manuel Varela, owner of a downtown Montevideo store offering items for growing marijuana, told Efe. \n\"And we also see the growing number of stores like this over the past year,\" Varela said. \"There are now about 20.\" \nVarela said his store offered plant food, tools, additives to germinate seeds in pots, irrigation systems, greenhouses that allow plants to grow in enclosures, temperature and humidity monitors, special pruning shears, rolling paper, books \"and everything related to the cultivation of cannabis.\" \nVarela said he and a friend decided to set up the business in 2012, when the legalization of marijuana \"still looked like something distant,\" and sales began to increase when the bill was passed by the lower house of Congress in mid-2013. \nThe legislation was approved by the full Congress on Dec. 10, 2013, and the regulations were signed into law by then-President Jose Mujica, the promoter of the initiative, in May 2014. \nRegistration for growers - or \"self-growers\" as they are called - opened in August 2014, allowing individuals to have up to six marijuana plants in their homes. \nAlong with the items offered in stores specializing in the cannabis trade, a special type of soil said to be better for growing marijuana appeared earlier this year on the shelves of several major supermarket chains. \n\"We took advantage of the enthusiasm about the legislation and we produced a video about the soil for marijuana,\" Carlos Mollo, who produces garden soil, told Efe. \"People identify the leaves and Bob Marley's colors.\" \n\"I retired from my job as an ad man and have many ideas,\" Mollo said. \"All the soils now in the market bet a lot on the packaging.\" \nMollo said his soil had gained acceptance in supermarkets, which account for \"55 percent of our total sales.\" \n\"I don't know if buyers are growing marijuana or are just growers in general, because people using the soil know the components are very good, with assurances that between 80 and 85 percent of the seeds will germinate,\" Mollo said, adding that he did not know \"how marijuana seeds look.\" EFE \nPab/jab/hv", "external_links": [], "published": "2015-06-01T16:11:00.000+03:00", "crawled": "2015-06-01T17:16:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}