{"organizations": [], "uuid": "b5215241a84793cd462771764a90c2dafd28bd74", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/trumkatichard_103113gn.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/244584-labor-chief-rips-obama-spin-on-trade", "country": "", "title": "Labor chief rebukes Obama in letter | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Labor chief rebukes Obama in letter | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "b5215241a84793cd462771764a90c2dafd28bd74"}, "author": "", "url": "http://thehill.com/policy/finance/244584-labor-chief-rips-obama-spin-on-trade", "ord_in_thread": 0, "title": "Labor chief rebukes Obama in letter | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Greg Nash", "Vicki Needham", "Obama"], "text": "Labor chief rebukes Obama in letter Greg Nash By Vicki Needham - 06/10/15 04:42 PM EDT \nAFL-CIO President Richard Trumka this week sent President Obama a five-page letter slamming his push for fast-track trade authority, arguing labor unions have been treated unfairly throughout the process. \nTrumka railed against Obama in the letter, which was sent on Monday, asserting that he has “repeatedly isolated and marginalized labor and unions as the only opponents of fast track” and the Trans-Pacific Partnership (TPP). ADVERTISEMENT \"I am sure you are aware, however, that the critics of the current TPP encompass a broad, deep, and intellectually impressive swath of public opinion,\" Trumka wrote in the letter, which was obtained by The Hill and first reported by The Washington Post .\nSaying he wanted to “correct the record,” the leader of the labor federation said he took “particular exception” to statements that Obama has made about labor unions opposing trade on principle. \n\"I would ask that you not mischaracterize our positions and views — even in the heat of a legislative battle,\" Trumka wrote. \nTrumka, who said in his letter that he was “proud” to have campaigned for the president twice, said unions have supported trade in the past when “warranted,” citing the example of the U.S.-Jordan free trade pact in 2000. \nHe highlighted labor's long-standing chief complaint — that the White House and the Office of the U.S. Trade Representative (USTR) have virtually ignored the AFL-CIO’s ideas to improve TPP and global trade rules. \n\"Our efforts have largely been rebuffed,\" Trumka wrote. \"Rather than engaging in a real dialogue with us about reforming the trade model and making changes to reflect our concerns, USTR's primary response has been to change its talking points. This is not engagement, it is public relations spin.\" \nThe U.S. Trade Representative's office has argued that during Obama's tenure the dialogue over trade deals have been opened up to include more suggestions from labor unions. \n“Our current trade policies need serious and deep reform — not just tweaks around the edges,” Trumka said. \nTrumka pointed to the African Growth and Opportunity Act, the Generalized System of Preferences and reauthorization of the Export-Import Bank as trade efforts that the labor federation supports. \n“What we do not support are trade deals that benefit Wall Street and decimate Main Street,” he wrote. \nTrumka has joined forces with other labor unions as well as environmental and religious groups in a full-court press against oppose fast-track legislation, which is speeding toward a vote in the House on Friday. \n\"Our goal is to ensure that as trade expands, growth is inclusive and prosperity is shared,\" Trumka wrote. \"Unfortunately, current trade policies have achieved the opposite: While the U.S. economy continues to grow, the share going to working families is shrinking.\" \nThe House is expected to vote on Friday on a package of trade bills, including fast-track, which would streamline trade agreements like the 12-nation TPP that is nearing completion. \nTrumka said he expects the efforts of the AFL-CIO and other like-minded groups to stop fast-track from passing. \n\"I think we're going to win on Friday,\" he said Wednesday on MSNBC. \"I think we have the votes, but we'll see. It will be a very close vote.\" \nThe White House has struggled to build support in the House among Democrats, with many of them coming under intense pressure to vote against fast-track from liberal groups and labor unions. \nSo far, 19 House Democrats have publicly said that they support the bill. \nAs the House nears a vote, letters of support and opposition are pouring into congressional offices. \nThe AFL-CIO also sent out a letter to all lawmakers on Wednesday asking them to reject the Trade Adjustment Assistance bill for several reasons, including that it is paid for using a cut in Medicare. \nThe AFL-CIO has vowed to punish Democrats who back the trade bill in the next election. \nThey have already launched ad campaigns against Reps. Ami Bera (D-Calif.) and Kathleen Rice (D-N.Y.), who both support fast-track. ", "external_links": [], "published": "2015-06-10T03:00:00.000+03:00", "crawled": "2015-06-11T00:16:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}