{"organizations": ["White House Commission Obama", "Commission"], "uuid": "b17c65c50c4f96693b947b2cc986c31bfee02ee5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3047914/images/o-SHANNON-MINTER-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/08/obama-transgender-lgbt-rights_n_7538008.html", "country": "", "title": "Obama Appoints Transgender Attorney Shannon Minter To White House Commission", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Appoints Transgender Attorney Shannon Minter To White House Commission", "spam_score": 0.0, "site_type": "news", "published": "2015-06-09T01:49:00.000+03:00", "replies_count": 0, "uuid": "b17c65c50c4f96693b947b2cc986c31bfee02ee5"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/08/obama-transgender-lgbt-rights_n_7538008.html", "ord_in_thread": 0, "title": "Obama Appoints Transgender Attorney Shannon Minter To White House Commission", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Shannon Minter", "Obama"], "text": "Obama Appoints Transgender Attorney Shannon Minter To White House Commission Posted: Updated: 20 minutes ago President Obama has appointed transgender attorney Shannon Minter, center, to the President's Commission on White House Fellowships. | ASSOCIATED PRESS reddit \nWASHINGTON -- President Barack Obama on Monday appointed transgender attorney Shannon Price Minter to the President's Commission on White House Fellowships. \nMinter, who is the legal director of the National Center for Lesbian Rights, has been lead counsel in a number of legal wins for the LGBT community. He gained national attention in 2001 when he represented the lesbian partner of Diane Whipple in a wrongful death case stemming from a dog mauling. That case resulted in a landmark decision in California that extended tort claims to same-sex domestic partners. \nMinter was also the lead attorney arguing before the California Supreme Court to overturn Proposition 8, a state ballot measure that banned same-sex marriage in the state. The U.S. Supreme Court in 2013 let a lower court decision go into effect that struck down the ban. \n\"I am confident that these experienced and hardworking individuals will help us tackle the important challenges facing America, and I am grateful for their service,\" Obama said in a statement, of Minter and a handful of other new nominees. \"I look forward to working with them.” \nThe Commission on White House Fellowships interviews and then recommends people to the president for appointment as White House Fellows, who typically spend a year as full-time, paid assistants to senior White House staff. \nMinter is one of a number of transgender appointees in the Obama administration. Others include Amanda Simpson and Shawn Skelly at the Defense Department and Jay Davis at the Environmental Protection Agency. More: ", "external_links": [], "published": "2015-06-09T01:49:00.000+03:00", "crawled": "2015-06-09T01:49:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}