{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "cdf6cea8e6d9c0764fd64013c91802f08738423c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/ff_gitmo_061415.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/06/25/fox-news-poll-obama-too-soft-on-islamic-extremists-keep-gitmo-open/", "country": "", "title": "Fox News Poll: Obama too soft on Islamic extremists, keep Gitmo open | Fox News", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Fox News Poll: Obama too soft on Islamic extremists, keep Gitmo open | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T00:48:00.000+03:00", "replies_count": 0, "uuid": "cdf6cea8e6d9c0764fd64013c91802f08738423c"}, "author": "", "url": "http://www.foxnews.com/politics/2015/06/25/fox-news-poll-obama-too-soft-on-islamic-extremists-keep-gitmo-open/", "ord_in_thread": 0, "title": "Fox News Poll: Obama too soft on Islamic extremists, keep Gitmo open | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nAmerican voters think Barack Obama is too soft on Islamic extremists, and that the U.S. fight against them is going badly. \nFifty-eight percent in the latest Fox News poll say the president is too soft on Islamic extremists, including nearly four in 10 Democrats (37 percent). That climbs to 57 percent among independents and 83 percent for Republicans. \nOverall, 61 percent of voters think America’s fight against ISIS is going badly. And they are nearly 10 times as likely to say it’s going “very badly” (28 percent) as they are to say it’s going “very well” (3 percent). \nThat sentiment fuels fear at home: 69 percent are worried about “attacks by Islamic terrorists” happening in the United States. That includes 27 percent who are “extremely” concerned, up from 22 percent who felt that way about terrorist attacks in 2013. \nCLICK HERE TO READ THE POLL RESULTS \nMeanwhile, ISIS tops the list as the greatest long-term threat to the United States. Thirty-three percent feel that way. Twenty-six percent think China poses the biggest threat. Just nine percent say Russia, seven percent Iran and five percent al Qaeda. \nEarlier this month the Pentagon reported six Yemeni detainees from the military prison in Guantanamo Bay were being transferred to Oman. The Obama administration has encouraged the transfer of prisoners as it seeks to fulfill a 2008 campaign promise to close Gitmo. \nBut voters think the prison should stay open. The poll asks which action would be best for U.S. national security and a 53-percent majority says keeping Guantanamo Bay open and continuing to hold suspected terrorists there is the right thing to do. The rest say close it, but split between wanting to move the detainees to U.S. federal prisons (21 percent) and sending them to other countries (20 percent). \nViews are mixed over Obama’s withdrawal of U.S. troops from Iraq in 2011. While 50 percent think Obama did the right thing, another 45 percent call it a mistake. A year ago, 55 percent said “right thing” vs. 41 percent “mistake” (June 2014). \nMost Democrats say the troop withdrawal was the right thing to do (74 percent), while most Republicans think it was a mistake (75 percent). \nGiven the negative sentiment on the fight against Islamic extremists, it’s no surprise that by a 21-point margin, more voters disapprove than approve of the job Obama is doing handling ISIS (56 percent disapprove vs. 35 percent approve). \nFor President Obama’s overall job rating, 44 percent approve, while 50 percent disapprove. Last month it was 45-48 percent, and a year ago it was 41-54 percent (June 2014). \nThe Fox News poll is based on landline and cell phone interviews with 1,005 randomly chosen registered voters nationwide and was conducted under the joint direction of Anderson Robbins Research (D) and Shaw & Company Research (R) from June 21-23, 2015. The full poll has a margin of sampling error of plus or minus three percentage points. Advertisement ", "external_links": [], "published": "2015-06-26T00:48:00.000+03:00", "crawled": "2015-06-26T00:49:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}