{"organizations": ["LOEB Obama", "The Pump House", "Iowa State Fair", "National Team", "Harvard", "Obamas", "AP Photo/Alex Brandon", "AP", "Verizon Center"], "uuid": "e7e6c017ec2c051c2ef0dbcd982660f6f2c3bb05", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3063604/images/o-OBAMA-LAUGHING-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/11/obama-responds-to-his-trolls_n_7565558.html", "country": "", "title": "Obama Actually Writes Back To People Who Call Him An Idiot", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Actually Writes Back To People Who Call Him An Idiot", "spam_score": 0.0, "site_type": "news", "published": "2015-06-12T02:41:00.000+03:00", "replies_count": 0, "uuid": "e7e6c017ec2c051c2ef0dbcd982660f6f2c3bb05"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/11/obama-responds-to-his-trolls_n_7565558.html", "ord_in_thread": 0, "title": "Obama Actually Writes Back To People Who Call Him An Idiot", "locations": ["County Offaly", "Washington", "Mass.", "Va.", "Ireland", "Orlando", "Florida", "Iowa", "D.C.", "Amherst", "Des Moines", "Moneygall", "Cedar Falls", "USA", "Pennslyvania", "U.S.", "Gator", "Brazil", "Norfolk", "Cambridge", "Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Watson Obama", "Malia", "Joe Biden", "Barack Obama", "Martinez Monsivais", "Kaster", "Michelle", "Henry Louis Gates Jr.", "Jennifer Klanac", "Obama", "James Crowley", "Saul LOEB", "Mike Cunningham III", "Brandon", "Falmouth Kearney", "Saul LOEB Obama", "Suzanne Woods"], "text": "  President Barack Obama holds a beer during a visit to Gator's Dockside restaurant in Orlando, Florida, on September 8, 2012 during the first day of a 2-day bus tour across Florida. AFP PHOTOS/SAUL LOEB Obama picks up a beer during a visit to Gator's Dockside restaurant in Orlando, Florida, September 8, 2012 during the first day of a 2-day bus tour across Florida. AFP PHOTO / Saul LOEB Obama drinks a beer at Gator's Dockside restaurant in Orlando. AFP PHOTO / Saul LOEB Obama gets a beer and a pork chop as he visits the Iowa State Fair in Des Moines on August 13, 2012 during an unannounced stop on his three-day campaign bus tour. AFP PHOTO/Jim WATSON Obama has a beer with Mike Cunningham III and other workers at the beer stand at the Iowa State Fair, Monday, Aug. 13, 2012. (AP Photo/Carolyn Kaster) Obama drinks a beer as he sits with his wife Michelle, daughter Malia, and Vice President Joe Biden, as the U.S. Senior Men's National Team and Brazil play during a pre-Olympic exhibition basketball game at the Verizon Center on July 16, 2012 in Washington, D.C. (Photo by Patrick Smith/Getty Images) Obama shares a beer with Suzanne Woods (R) and Jennifer Klanac (L) during at Ziggy's Pub and Restaurant Amherst, Ohio, July 5, 2012, during an unannounced visit while on a bus tour of Ohio and Pennslyvania. AFP PHOTO/Jim Watson Obama raises his glass while drinking Guinness at The Dubliner pub on March 17, 2012 in Washington. Obama went to the bar to celebrate St. Patrick's Day. AFP PHOTO/Brendan SMIALOWSKI Obama drinks a Guinness beer at The Dubliner pub on March 17, 2012 in Washington. AFP PHOTO/Brendan SMIALOWSKI Obama holds up a bottle of beer as he delivers a case of White House brewed beer to the fire fighters at Fire Station No. 14, during an unscheduled stop, Tuesday, Sept. 4, 2012, in Norfolk, Va. (AP Photo/Pablo Martinez Monsivais) In this July 16, 2012 file photo, Obama sips his beer as he watches Team USA and Brazil during the first half of an Olympic men's exhibition basketball game, in Washington. (AP Photo/Alex Brandon, File) In this July 5, 2012 file photo, Obama has a beer as he talks with patrons as he stops for a beer at Ziggy's Pub and Restaurant in Amherst, Ohio. (AP Photo/Susan Walsh, File) Obama stops for a beer at The Pump House, a pub and grill, Tuesday, Aug. 14, 2012, in Cedar Falls, Iowa, during a three day campaign bus tour through Iowa. (AP Photo/Carolyn Kaster) Obama clinks beer glasses with unemployed construction workers as they sit down for a discussion at the Harp and Celt Restaurant and Irish Pub in Orlando, Florida, October 11, 2011. AFP PHOTO / Saul LOEB The Obamas sip Guinness at a pub as they visit Moneygall village in rural County Offaly, Ireland, where the President's great-great-great grandfather Falmouth Kearney hailed from, on May 23, 2011. Obama landed in Ireland on May 23, 2011 for a visit celebrating his ancestral roots, kicking off a four-nation European tour. AFP PHOTO/ JEWEL SAMAD In this July 30, 2009 file photo, Obama and Vice President Joe Biden have a beer with Harvard scholar Henry Louis Gates Jr., second from left, and Cambridge, Mass., police Sgt. James Crowley in the Rose Garden of the White House in Washington. (AP Photo/Alex Brandon, File)  Share ", "external_links": [], "published": "2015-06-12T02:41:00.000+03:00", "crawled": "2015-06-12T02:41:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}