{"organizations": [], "uuid": "3e5c7c1c37e85cae39512a60a5d73dfd9c6cbe75", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3045970/images/o-OBAMA-G7-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/obamacare/feed", "section_title": "Obamacare on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/08/obamacare-supreme-court_n_7535472.html", "country": "US", "title": "Obama: Supreme Court Should Not Have Accepted Obamacare Challenge", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama: Supreme Court Should Not Have Accepted Obamacare Challenge", "spam_score": 0.0, "site_type": "news", "published": "2015-06-08T14:29:00.000+03:00", "replies_count": 0, "uuid": "3e5c7c1c37e85cae39512a60a5d73dfd9c6cbe75"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/08/obamacare-supreme-court_n_7535472.html", "ord_in_thread": 0, "title": "Obama: Supreme Court Should Not Have Accepted Obamacare Challenge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Supreme Court Should Not Have Accepted Obamacare Challenge Posted: reddit \nOn Monday, President Barack Obama said the Supreme Court should not have taken up the challenge to the Affordable Care Act in King v. Burwell. \n\"This should be an easy case. Frankly, it probably should not even have been taken up,\" Obama said during a press conference at the G-7 summit in Germany. \nWhen asked whether the administration had a \"plan B,\" in the event that the Supreme Court strikes down subsidies in states that do not run their own health insurance exchanges, Obama said there are no easy solutions. \n\"You have a model where all the pieces connect,\" he said. \"And there are a whole bunch of scenarios -- not just with relation to health care but all kinds of stuff I do -- where if somebody does something that does not make any sense, it is hard to fix. This would be hard to fix.\" \nThe president called the legal challenge “bizarre” in light of the law’s successful implementation. \n“What’s more the thing’s working,” Obama said. “Part of what is bizarre about the whole thing is that we have not had a lot of conversation about the horrors of Obamacare because none of them have come to pass.” \nThe Supreme Court will announce a ruling this month on whether the Affordable Care Act's designation of an \"exchange established by the state\" means that the law can only provide subsidies to individuals in states that run their own exchanges. If the court strikes down that provision of the law, 6.4 million people in 34 states will lose their subsidies, leaving many unable to afford insurance. Also on The Huffington Post Close Health Care Reform Efforts Throughout History of   Former President Theodore Roosevelt champions national health insurance as he unsuccessfully tries to ride his progressive Bull Moose Party back to the White House. (Photo by Topical Press Agency/Getty Images) President Franklin D. Roosevelt favors creating national health insurance amid the Great Depression but decides to push for Social Security first. (Photo by Keystone/Getty Images) Roosevelt establishes wage and price controls during World War II. Businesses can't attract workers with higher pay so they compete through added benefits, including health insurance, which grows into a workplace perk. (Photo by Hulton Archive/Getty Images) President Harry Truman calls on Congress to create a national insurance program for those who pay voluntary fees. The American Medical Association denounces the idea as \"socialized medicine\" and it goes nowhere. (Photo by Keystone/Getty Images) John F. Kennedy makes health care a major campaign issue but as president can't get a plan for the elderly through Congress. (Photo by Keystone/Getty Images) President Lyndon B. Johnson's legendary arm-twisting and a Congress dominated by his fellow Democrats lead to creation of two landmark government health programs: Medicare for the elderly and Medicaid for the poor. (AFP/AFP/Getty Images) President Richard Nixon wants to require employers to cover their workers and create federal subsidies to help everyone else buy private insurance. The Watergate scandal intervenes. (Photo by Keystone/Getty Images) President Jimmy Carter pushes a mandatory national health plan, but economic recession helps push it aside. (Photo by Central Press/Getty Images) President Ronald Reagan signs COBRA, a requirement that employers let former workers stay on the company health plan for 18 months after leaving a job, with workers bearing the cost. (MIKE SARGENT/AFP/Getty Images) Congress expands Medicare by adding a prescription drug benefit and catastrophic care coverage. It doesn't last long. Barraged by protests from older Americans upset about paying a tax to finance the additional coverage, Congress repeals the law the next year. (TIM SLOAN/AFP/Getty Images) President Bill Clinton puts first lady Hillary Rodham Clinton in charge of developing what becomes a 1,300-page plan for universal coverage. It requires businesses to cover their workers and mandates that everyone have health insurance. The plan meets Republican opposition, divides Democrats and comes under a firestorm of lobbying from businesses and the health care industry. It dies in the Senate. (PAUL J. RICHARDS/AFP/Getty Images) Clinton signs bipartisan legislation creating a state-federal program to provide coverage for millions of children in families of modest means whose incomes are too high to qualify for Medicaid. (JAMAL A. WILSON/AFP/Getty Images) President George W. Bush persuades Congress to add prescription drug coverage to Medicare in a major expansion of the program for older people. (STEPHEN JAFFE/AFP/Getty Images) Hillary Rodham Clinton promotes a sweeping health care plan in her bid for the Democratic presidential nomination. She loses to Obama, who has a less comprehensive plan. (PAUL RICHARDS/AFP/Getty Images) President Barack Obama and the Democratic-controlled Congress spend an intense year ironing out legislation to require most companies to cover their workers; mandate that everyone have coverage or pay a fine; require insurance companies to accept all comers, regardless of any pre-existing conditions; and assist people who can't afford insurance. (Alex Wong/Getty Images) With no Republican support, Congress passes the measure, designed to extend health care coverage to more than 30 million uninsured people. Republican opponents scorned the law as \"Obamacare.\" (Mark Wilson/Getty Images) On a campaign tour in the Midwest, Obama himself embraces the term \"Obamacare\" and says the law shows \"I do care.\" (BRENDAN SMIALOWSKI/AFP/Getty Images)  Share", "external_links": [], "published": "2015-06-08T14:29:00.000+03:00", "crawled": "2015-06-08T20:58:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}