{"organizations": [], "uuid": "193ac3a112b1184920213f170c4f6e5359f0496c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3077948/images/o-OBAMA-SAD-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/16/the-morning-email_n_7593200.html", "country": "", "title": "Tuesday's Morning Email: Obama Scrambles To Resurrect Trade Plan", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Tuesday's Morning Email: Obama Scrambles To Resurrect Trade Plan", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T15:20:00.000+03:00", "replies_count": 0, "uuid": "193ac3a112b1184920213f170c4f6e5359f0496c"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/16/the-morning-email_n_7593200.html", "ord_in_thread": 0, "title": "Tuesday's Morning Email: Obama Scrambles To Resurrect Trade Plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tuesday's Morning Email: Obama Scrambles To Resurrect Trade Plan Posted: \nTOP STORIES \nTo get The Morning Email, HuffPost's daily roundup of the news, in your inbox, sign up here. \nOBAMA SCRAMBLES TO RESURRECT TRADE PLAN With House Speaker John Boehner and House Democratic Leader Nancy Pelosi refusing to come back to the table to negotiate a workable version of Obama's trade agenda and today's vote postponed , \"it's difficult to see how Obama's trade agenda can be revived.\" And Hillary Clinton's criticism of the controversial trade agenda might be the final blow to Obama's \"top legislative priority.\" [ Ryan Grim and Jennifer Bendery, HuffPost ] AL-QAIDA SECOND-IN-COMMAND KILLED IN U.S. STRIKE \"A U.S. airstrike has killed Al-Qaida's No. 2 leader, who commanded its powerful Yemeni affiliate, dealing the global network its biggest blow since the killing of Osama bin Laden and eliminating a charismatic leader at a time when it is vying with the Islamic State group for the mantle of global jihad.\" [ AP ] \nPOPE FRANCIS' LEAKED ENCYCLICAL PLACES BLAME FOR GLOBAL WARMING WITH HUMANS While the final text will be released Thursday, Pope Francis' 192-page draft stressed the need for action, saying, \"Today we cannot help but recognize that a true ecological approach always becomes a social approach, which must integrate justice in the discussions of the environment, to hear the cry of the earth as much as the cry of the poor.\" [ Antonia Blumberg, HuffPost ] \nOVER 390,000 HOMELAND SECURITY EMPLOYEES HACKED Always good when the division with the word \"security\" in the title gets hacked. [ AP ] \nGAP TO CLOSE 175 STORES The company also plans to cut 250 corporate jobs as it struggles to find a market for the uniform-look that made it famous among today's millennial shoppers . [ AP ] \nCHARITABLE DONATIONS BEAT PRE-RECESSIONAL LEVELS FOR 2014 There's hope for the world just yet: charitable donations totaled over $358 billion dollars for 2014 according to Giving USA Foundation. [ NYT ] \nPREPARE FOR HIGHER SHIPPING FEES UPS plans to do away with big breaks for larger packages as online shopping for oversized items like grills and furniture has caused the number of large deliveries to skyrocket. [ WSJ ] \nWHAT’S BREWING \nBLACKHAWKS WIN THIRD STANLEY CUP IN SIX YEARS There's now another shiny piece of hardware elevating the Chicago Blackhawks to legendary status . [ AP ] \nEMMY NOMINATION WISH LISTS It's going to be a Cookie-Annalise Keating showdown for Outstanding Lead Actress in a Drama Series. Better hope nobody gives Cookie a broom . [ HuffPost ] \nANNA KENDRICK AND REBEL WILSON IN FOR 'PITCH PERFECT 3' And the money making singing machine rolls on. [ AP ] \nMOMENTS, FACEBOOK'S LATEST PHOTO APP, FINALLY GETS IT RIGHT \"The company’s new app ... is a combination of the two earlier ideas -- it’s photo storage and auto-syncing meets private sharing, with some impressive facial recognition features.\" [ Wired ] \nMEET SPOKEN It's basically the radio/podcast version of Medium. [ Spoken ] \nLIVING WITH SEVERE LYME DISEASE \"My instincts were always screaming, This is not stress. But after several years, you do start to think, Are they right? I tried alternative therapies, none of which made a difference, and that really heightened my concern. The more I was told that it was stress the more I was convinced that something was wrong.\" [ New York Magazine ] \nTHE 'BEST THINGS YOU CAN DO FOR YOUR BODY' Guys, eating chocolate is on this list. [ HuffPost ] \nWHAT'S WORKING \nHAVE 20 SECONDS? \"Goodeed, an online platform that launched its global website on Thursday, allows users to watch 20 seconds of an ad in order to donate to a cause of their choice. Supports can help distribute vaccines in developing regions, plant trees to protect the earth or provide meals to fight global hunger.\" [ HuffPost ] \nON THE BLOG \nHOWARD FINEMAN: THE BUSHES ARE BACK \"In theory, the world’s oldest modern democracy should see a constant churn of names and faces in high places. In truth, political dynasties in America are common and, arguably, becoming more so at a time when Big Money -- personal and corporate -- means so much to the conduct of elections.\" [ HuffPost ] \nBEFORE YOU GO \n~ Yep, Jeb already lost the logo war . \n~ Tip for Ed Sheeran fans: just play his song in a mall until it magically summons him to duet with you. Totally works. \n~ Rewind your Spotify taste . Trust us, it'll reveal all the love you didn't know you had for Small Faces and The Clash. \n~ Cambridge offers a \"Lego Professorship,\" which means you all may have to find a new author for The Morning Email. \n~ The latest British odds have Idris Elba and Damian Lewis as the leading contenders to be the next James Bond. \n~ A first look at Gucci's fall campaign . \n~ The U.S. city that would be the best site for a Jurassic World. \n~ In a survey, 80% of millennial women said they avoided activities like going to the beach because they felt \"body-conscious.\" \n~ How to combat that summer frizz , not that we know how that feels or anything. \n~ Despite denials all around, sounds like Prince rocked a White House concert . \n~ And all the questions we are still left reeling with after Sunday's \"Game of Thrones.\" It's gonna be a long ten months. \nSend tips/quips/quotes/stories/photos/events/scoops to Lauren Weber at lauren.weber@huffingtonpost.com. Follow us on Twitter @LaurenWeberHP . And like what you're reading? Sign up here to get The Morning Email delivered to you. More: ", "external_links": [], "published": "2015-06-16T15:20:00.000+03:00", "crawled": "2015-06-16T15:29:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}