{"organizations": [], "uuid": "b7131935c8b2e40ae05281ead04e99eaf3c88c48", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/06/01/obama-to-name-roberta-jacobson-new-ambassador-to-mexico/", "country": "IL", "title": "Obama to name Roberta Jacobson new ambassador to Mexico", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama to name Roberta Jacobson new ambassador to Mexico", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T02:38:00.000+03:00", "replies_count": 0, "uuid": "b7131935c8b2e40ae05281ead04e99eaf3c88c48"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/01/obama-to-name-roberta-jacobson-new-ambassador-to-mexico/", "ord_in_thread": 0, "title": "Obama to name Roberta Jacobson new ambassador to Mexico", "locations": ["Mexico", "Mexico Obama"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Roberta Jacobson", "Obama"], "text": "Obama to name Roberta Jacobson new ambassador to Mexico   EFE \nU.S. President Barack Obama on Monday announced his intention to nominate Roberta Jacobson, the assistant secretary of state for Latin America and the chief U.S. negotiator at the talks to resume diplomatic relations with Cuba, as the new ambassador to Mexico, the White House announced in a communique. \nJacobson will replace Anthony Wayne, who has been the U.S. envoy since 2011, if she is confirmed by the Senate, which must approve all ambassadorial appointments. \nObama, who also named three other top officials to federal agencies on Monday, said that the nominees have demonstrated knowledge and dedication during their entire careers. \nJacobson's nomination as U.S. ambassador to Mexico, a key partner and neighbor for Washington, comes after in 2012 she was named the new head of diplomatic affairs for Latin America. \nIn that post, Jacobson has headed the U.S. effort to restore diplomatic ties with Cuba, a move announced last December after being negotiated in secret between Washington and Havana for months. \nAfter the joint announcement by Obama and his Cuban counterpart, Raul Castro, Jacobson has headed four rounds of talks with the Cuban negotiating team to reopen embassies and lift part of the economic sanctions imposed by Washington on the communist island more than 50 years ago. \nJacobson is one of Obama's most high-profile diplomats and is an expert in U.S. relations with countries in North America, a fact that will presumably help her confirmation move forward with few, if any, snafus in the Senate. \nBetween 2007 and 2010, Jacobson, who speaks fluent Spanish, worked as deputy assistant secretary for Canada, Mexico and NAFTA issues, and from 2003 to 2007 she had been the director of the State Department's Office of Mexican Affairs. \nHer extensive Latin American experience includes serving as a member of the diplomatic corps at the U.S. Embassy in Lima, Peru. EFE", "external_links": [], "published": "2015-06-02T02:38:00.000+03:00", "crawled": "2015-06-02T03:07:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}