{"organizations": [], "uuid": "68546955d21e59d87bb2ac67fdf64bd757b24f19", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Health/0/0/MarijuanaRx.jpg", "site_section": "http://www.foxnews.com/health/index.html", "section_title": "Health News | Latest Medical, Fitness, Healthcare &amp; Nutrition News | Fox News", "url": "http://www.foxnews.com/health/2015/06/16/medical-marijuana-laws-dont-increase-teen-use-study-suggests/", "country": "US", "title": "Medical marijuana laws don’t increase teen use, study suggests", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Medical marijuana laws don’t increase teen use, study suggests | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "68546955d21e59d87bb2ac67fdf64bd757b24f19"}, "author": "Rachael Rettner", "url": "http://www.foxnews.com/health/2015/06/16/medical-marijuana-laws-dont-increase-teen-use-study-suggests/", "ord_in_thread": 0, "title": "Medical marijuana laws don’t increase teen use, study suggests", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Rachael Rettner\nPublished June 16, 2015 Email Print\nTeen use of marijuana doesn't seem to change when states pass laws legalizing the drug for medical purposes, a new study suggests.\nResearchers analyzed information from more than 1 million U.S. teens in grades 8, 10 and 12, who were asked whether they'd used marijuana in the past month. The researchers collected 24 years' worth of survey data, spanning 1991 to 2014.\nOverall, teen marijuana use was more common in states that had passed medical marijuana laws as of 2014 — nearly 16 percent of teens in states where medical marijuana is legal said they had used marijuana in the past month, compared with 13 percent of teens in states where medical marijuana is not legal.\nBut when researchers looked at marijuana use over time in the 21 states where medical marijuana was legal by 2014, they found no change in marijuana use after a medical marijuana law was passed, compared with before. About 16 percent of teens said they had used marijuana in the past month before a law was passed, compared with 15 percent who said the same after a law was passed.\nTwo earlier studies also found that marijuana use among teens did not increase following the legalization of medical marijuana, but these studies were smaller, conducted in just four to five states.\nThe new findings \"provide the strongest evidence to date that marijuana use by teenagers does not increase after a state legalizes medical marijuana, study co-author Deborah Hasin, a professor of epidemiology at Columbia University Medical Center, said in a statement. \"Rather, up to now, in the states that passed medical marijuana laws, adolescent marijuana use was already higher than in other states,\" he said. [ The Drug Talk: 7 New Tips for Today's Parents ]\nSome people have been concerned that legalizing medical marijuana could lead to an increased use of the drug among adolescents, because teens might view the drug as more acceptable or less harmful when such laws are passed. But the new study suggests that these concerns \"seem unfounded,\" the researchers said.\n\"Our study findings suggest that the debate over the role of medical marijuana laws in adolescent marijuana use should cease, and that resources should be applied to identifying the factors that do affect risk,\" the researchers wrote in the June 16 issue of the journal The Lancet Psychiatry.\nDr. Seth Ammerman, a clinical professor of pediatrics at Stanford University School of Medicine, who was not involved in the new study, called the findings \"reassuring,\" because they show \"if a state does put in medical marijuana laws, that that’s not going to significantly affect adolescent use.\"\nThe fact that states with legalized medical marijuana have higher teen marijuana use in general — both before and after laws were passed — could be because people in those states have a more liberal attitude toward the drug, Ammerman said.\nThe researchers noted that because the study looked at medical marijuana laws only, the findings do not address whether laws allowing the recreational use of marijuana would affect teen marijuana use, the researchers said. In addition, because some states in the study had only recently passed medical marijuana laws, the analysis should be repeated after more years of data have been collected, the researchers said.\nOther studies suggest that laws that legalize marijuana may increase the risk of marijuana exposure in very young children, who may accidentally swallow edible forms of marijuana. A study published earlier this month found that, in states that legalized marijuana between 2000 and 2013, the rate of marijuana exposure among children ages 5 and younger increased about 16 percent each year.\nEarlier this year, the American Academy of Pediatrics issued a statement opposing use of marijuana for medical purposes, except for drugs that are approved by the Food and Drug Administration. The main concern with medical marijuana is that it is not standardized, so the term really applies to any part of the Cannabis plant, Ammerman said.\nUntil the compounds in marijuana go through the same approval process that other drugs go through, where they are required to show risks and benefits, \"it's hard to recommend it,\" Ammerman said.\nMarijuana Science: Why Today's Pot Packs a Bigger Punch Where Americans Smoke and Grow Marijuana (Maps) Pot Quiz: Test Your Marijuana Knowledge, Dude! Copyright 2015 LiveScience , a Purch company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\n ", "external_links": ["http://www.livescience.com/", "http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffoxnewshealth&width&layout=button_count&action=like&show_faces=true&share=false&height=21", "http://www.livescience.com/36148-talk-kids-drugs-alcohol-tips.html", "http://www.livescience.com/48606-marijuana-maps-of-united-states.html", "http://www.livescience.com/45729-pot-quiz-test-your-marijuana-knowledge-dude.html", "http://www.cancercenter.com/", "http://www.livescience.com/50220-marijuana-science-potency-thc-levels.html", "http://global.fncstatic.com/static/managed/img/share/source/live-science.png"], "published": "2015-06-16T03:00:00.000+03:00", "crawled": "2015-06-16T18:18:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}