{"organizations": [], "uuid": "0f339455ab8f048a204bece6d77c280fd5eed608", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabiden_091414getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/news/administration/244179-in-grief-biden-leans-on-obama", "country": "", "title": "In grief, Biden leans on Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "In grief, Biden leans on Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-06T14:02:00.000+03:00", "replies_count": 0, "uuid": "0f339455ab8f048a204bece6d77c280fd5eed608"}, "author": "", "url": "http://thehill.com/news/administration/244179-in-grief-biden-leans-on-obama", "ord_in_thread": 0, "title": "In grief, Biden leans on Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Peter Schroeder", "Bernie Becker", "Biden", "Obama"], "text": "In grief, Biden leans on Obama By Peter Schroeder and Bernie Becker - 06/06/15 06:00 AM EDT \nPresident Obama’s eulogy on Saturday for Vice President Joe Biden's son will bring into public display the bond the two unlikely political allies have cemented over the last seven years. \nAt first glance, the two men would appear to have little in common. ADVERTISEMENT They hail from different generations and opposite sides of the country – Obama growing up in Hawaii, and Biden in Pennsylvania and Delaware.\nObama is famous for his cool, detached demeanor, while Biden — despite a personal history marked by repeated tragedy — is the picture of the jovial, back-slapping politician. \nObama has sometimes made Biden the butt of jokes, and there have been times when the vice president’s candor have clearly gotten under the president’s skin. \nYet current and former aides paint a picture of a relationship that has grown stronger by the year, and that has been deepened by the friendship between Michelle Obama and Jill Biden, as well as Obama’s children and Biden’s grandchildren. \n“We made a deal early on, when either one of us are dissatisfied we just flat tell the other person. And so one — lunch once a week, you know, that’s when we talk,” Biden himself said in a 2013 interview with CNN. \n“When he hasn’t liked something I’ve done, he just flat tells me…or I will say, ‘Hey, look, man, I don’t like the way this is going,’” Biden added. \nThe two men agreed that Obama would deliver the eulogy at Beau Biden’s funeral in a phone call shortly after the 46-year-old’s death on May 30. \nThe Bidens “have more family than they know,” Obama said in a statement issued shortly after Beau’s death. \n“They have a family right here in the White House.” \nObama and Biden first met at the 2004 Democratic Convention, where the soon-to-be Illinois senator rocketed into the public eye with his keynote address. \nThey spent some time together during Obama’s brief stint in the Senate, where he served as a member of the Foreign Relations Committee — which Biden led after Democrats won back the majority in 2006. \nA short time later, the two found themselves competing for the Democratic nomination. \nShortly after Biden entered the race in 2007, he made headlines with remarks to the New York Observer about Obama. \n“I mean, you got the first mainstream African-American who is articulate and bright and clean and a nice-looking guy,” Biden said. “I mean, that's a storybook, man.” \nBiden later apologized for any offense the comments might have made. Obama told reporters at the time that he didn’t think Biden meant to offend anyone, and that there were more important things to worry about. \n“He was very gracious and I have no problem with Joe Biden,” Obama said. \nA senior White House official said Obama and Biden established a “mutual respect” during the Democratic primary debates, while a former Biden aide went one step further, saying that the primary season was an eye-opener for the future vice president. \n“He always liked to say that, on the debate stage during the primaries, Obama was the only one he agreed with on everything,” the aide said. \nThe mutual respect led Obama to tap Biden as his vice presidential pick in the summer of 2008 — and Biden became the president’s emissary to his old stomping grounds in the Senate. \nThe new president relied at times on Biden’s long-standing relationships and personal touch with senators from both parties. \nBiden was influential in getting three Republican senators to back the 2009 stimulus bill, and he lobbied Sen. Arlen Specter (Pa.) to switch from the Republican to the Democratic Party as the two traveled to their home states on Amtrak. Specter became a Democrat and ended up voting for the president’s signature healthcare law. \nThe vice president has continued to be a player on Capitol Hill, through fights over the budget and raising the debt ceiling that have dominated Obama’s presidency. \nObama stuck with Biden amid some calls to shake up the presidential ticket in 2012, and the two continue to have lunch once a week — though the relationship has had its share of bumps. \nLess than a month after taking office, Biden said there was a 30 percent shot that Obama’s stimulus program wouldn’t work, even if the administration did everything right. \n“I don't remember exactly what Joe was referring to. Not surprisingly,” Obama jabbed in response, in a nationally televised prime time news conference. \nAnd Biden infamously stepped on Obama’s toes in 2012, when he announced support for gay marriage on national television. The remarks set off a scramble in the White House, forcing the president to complete his “evolution” on matter just days later, when he announced his own support for same-sex relationships. \nBut aides say Obama and Biden’s mutual love of family helped paper over any raw feelings that stemmed from the two men’s different political styles. \nBiden famously delayed his entry into the Senate, at just 30 years old, after his first wife and daughter died in a 1972 car crash – leaving Biden a single father to Beau and his second son, Hunter. \nAlmost four decades later, Obama and Biden bonded after the president’s daughter Sasha and the vice president’s granddaughter Maisy became teammates on a basketball team. Just this week, days after Beau Biden’s death, both the president and vice president attended Sasha and Maisy’s middle school graduation. \n“Their two daughters and two of my granddaughters are each other’s best friend,” said Biden at an event in December. “They vacation together, they spend time together.” \nBeau Biden’s previous health issues also brought his father and the president closer together, according to the book Game Change about the 2012 election. \nThe president sprinted down the hall to embrace Joe Biden once Beau Biden turned the corner after a life-threatening stroke in 2010, according to the book, and the elder Biden said that Beau’s thoughtfulness and calm under pressure reminded him of Obama. \n“People say this guy Obama is lacking in emotion – don’t buy it,” Biden said after Beau’s stroke, according to the authors Mark Halperin and John Heilemann. \nThat sort of resiliency in the two men’s relationship is backed up by some of Obama’s closest advisers. \nDan Pfeiffer told The Huffington Post in January that the two have grown “very close personally.” And while Biden may draw headlines for off-kilter remarks occasionally, Obama still sees him as a political and personal ally. \n“Everyone loves Joe Biden,\" said Pfeiffer, who left the White House in March. “For every time you pick one thing where he gets in a little bit of trouble, there's 1,000 times he's gone out and campaigned his tail off. ... He was a huge asset in why we got re-elected, both times.” \nBiden’s former aide said Obama’s personal visit to the vice president’s home on Sunday, the day after Beau’s death, also speaks to the two men’s bond. \n“I think that’s just so telling,” the aide said. “That doesn’t happen often, because it’s just so hard to transport the president.” \n", "external_links": [], "published": "2015-06-06T14:02:00.000+03:00", "crawled": "2015-06-06T14:02:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}