{"organizations": [], "uuid": "4f6f37649dca055e868d996200c8fe6bb0cfded9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3114288/images/o-VANCOUVER-CANADA-MARIJUANA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/24/vancouver-canada-marijuana_n_7657420.html", "country": "US", "title": "First City In Canada Now Regulating Medical Marijuana", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "First City In Canada Now Regulating Medical Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T20:26:00.000+03:00", "replies_count": 0, "uuid": "4f6f37649dca055e868d996200c8fe6bb0cfded9"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/06/24/vancouver-canada-marijuana_n_7657420.html", "ord_in_thread": 0, "title": "First City In Canada Now Regulating Medical Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Medical Marijuana In Canada: Commercial Producer MediJean of   MediJean, based in Richmond, B.C., has a licence from Health Canada to grow marijuana for research and development purposes. MediJean Chief Operating Officer Chris Dollard, left, and Chief Strategy Officer Anton Mattadeen stand inside a secure vault that will be used as a final holding area for marijuana being distributed at the medical marijuana facility in Richmond, B.C. The company currently has a license from Health Canada to grow marijuana for research and development purposes. Marijuana plant strains are held in jars as MediJean senior lab technician Sultana Kamruzzahan works in the research and tissue culture development lab at the medical marijuana facility in Richmond, B.C. Cultures from every strain of the plant grown at the facility are stored for research and later production. MediJean has a licence from Health Canada to grow marijuana for research and development purposes. MediJean, based in Richmond, B.C., has a licence from Health Canada to grow marijuana for research and development purposes. MediJean, based in Richmond, B.C., has a licence from Health Canada to grow marijuana for research and development purposes. Marijuana plant strains are held in jars as MediJean lab manager Abdul Ahad works in the research and tissue culture development lab at the medical marijuana facility in Richmond, B.C. Cultures from every strain of the plant grown at the facility are stored for research and later production. MediJean has a licence from Health Canada to grow marijuana for research and development purposes. MediJean, based in Richmond, B.C., has a licence from Health Canada to grow marijuana for research and development purposes. MediJean, based in Richmond, B.C., has a licence from Health Canada to grow marijuana for research and development purposes. MediJean Chief Operating Officer Chris Dollard, left, and Chief Strategy Officer Anton Mattadeen. NEXT: Tweed Inc. - Legal Marijuana Grow-Op The Tweed Inc. medical marijuana facility is across the street from the Smith’s Falls police detachment. The police have toured the plant and had one request: don’t put a giant marijuana leaf on the front of the building. Tweed CEO Chuck Rifici stands in front of the hydroponics centre. The black vats contain fertilizer, while the silver ones are refurbished sugar containers from the Hershey’s operation which now contain water. Tweed has been busy transforming the former chocolate factory into a massive marijuana growing operation that will cover 150,000 square feet. A Tweed employee re-pots some plants in the “mother room,” home to the 1,300 starter plants that are used to propagate more. Rifici stands in front of the company’s 5,000-square-foot vault that can store up to 15 million grams, or $150 million-worth, of dried marijuana. Each of Tweed’s plants is labelled with a bar code identifying its strain and origin so that it can be traced throughout the growing process. A view of Tweed’s mother room, where plants are subjected to 24 hours of light each day to encourage growth. Rifici stands in front of the highly secure and sanitary mother room. Heating, ventilation, and air conditioning are Tweed’s biggest expense, but the company also uses low-tech fans from Canadian Tire to keep air flowing. The entrance to the Tweed facility. The golden letters that once adorned the front of the Hershey’s factory now lie in an unused corner of the building. The old Hershey’s Canada plant was shuttered in 2008, putting some 600 people out of work. NEXT: WHICH PROVINCE TOKES THE MOST? 3,429,678 people These are the StatsCan totals for Canadians age 15 years and older in the 12 months of 2012. Use included cannabis and hashish. 81,676 people", "external_links": [], "published": "2015-06-24T20:26:00.000+03:00", "crawled": "2015-06-25T02:39:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}