{"organizations": ["DPRK", "Departments of Defense", "al-Nusra Front", "U.S. Army", "U.N.", "Treasury", "Merrill Newman", "CIA", "CNN", "Bae", "Fowle", "FBI", "State", "ISIS", "National Security Council", "White House", "House", "Muslim Brotherhood", "U.S. Embassy", "State Department"], "uuid": "54fb972381c2df2df57e856b260ad55caf40c806", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/23/politics/hostage-policy-review-changes-white-house/index.html", "country": "", "title": "Obama to okay negotiating with terrorists over hostages - CNNPolitics.com", "performance_score": 6, "site": "cnn.com", "participants_count": 0, "title_full": "Obama to okay negotiating with terrorists over hostages - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-23T19:40:00.000+03:00", "replies_count": 0, "uuid": "54fb972381c2df2df57e856b260ad55caf40c806"}, "author": "", "url": "http://www.cnn.com/2015/06/23/politics/hostage-policy-review-changes-white-house/index.html", "ord_in_thread": 0, "title": "Obama to okay negotiating with terrorists over hostages - CNNPolitics.com", "locations": ["Seoul", "United States", "Cuba", "Iran", "Tehran", "Washington", "Pakistan", "American", "DC", "North Korea", "New Mexico", "Afghanistan", "California", "Egypt", "Cairo", "America", "Aijalon Gomes", "Mexico", "U.S.", "Venezuela", "Palo Alto", "China", "Pyongyang"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robert King", "al Qaeda", "Anderson Cooper", "Esfandiari", "Bill Clinton", "Hugo Chavez", "Junwas", "Warren Weinstein", "Matthew Todd Miller", "Shane Bauer", "Euna Lee", "Jim", "Nicolas Maduro", "Sarah Shourd", "Lisa Monaco", "Kim", "Mohamed Soltan", "Jeffrey Edward Fowle", "Timothy Tracy", "Bowe Bergdahl", "Eddie Yong", "Bergdahl", "Arthur Schneier", "Laura Ling", "Duncan Hunter", "Obama", "Abedini", "Kevin Liptak", "Bauer", "Fowle", "Haleh Esfandiari", "Robert Levinson", "Miller", "Robert Becker", "Kenneth Bae", "Park", "Barack Obama", "Elaine Weinstein", "Hekmati", "Bill Richardson", "Josh Fattal", "Fattal", "Saeed Abedini", "Jeff Newman", "Yanira Maldonado", "Amir Hekmati", "Soltan", "Jimmy Carter", "Robert Park", "Hunter", "Peter Theo Curtis", "James Foley", "Merrill Newman", "Weinstein", "Diane Foley", "Alan Gross", "Aijalon Gomes", "Foley", "Levinson", "Gary", "Newman", "Kim Jong Il", "Shourd", "Tracy"], "text": "James Foley's parents speak out on U.S. hostage policy 07:32 Washington (CNN) The White House will release on Wednesday a presidential directive and an executive order that will allow the government to communicate and negotiate with terrorist groups holding Americans hostage, a source briefed on the matter told CNN. While the government will maintain its policy of not making \"substantive concessions\" to captors or paying ransoms, the White House will announce that officials will no longer threaten with criminal prosecution the families of American hostages who do pay ransoms to their relatives' captors, according to a senior administration official. Family members of former hostages were meeting at the White House on Tuesday to learn of the administration's decisions after a months-long review of U.S. policies in dealing with American citizens held captive. The families were set to meet with President Barack Obama on Wednesday. READ: FBI assisted Weinstein family with ransom payment The payment of ransoms to terror groups like ISIS and al Qaeda has long been tolerated, though it is technically illegal. The administration has looked the other way when families of Americans held overseas have paid ransoms. On Wednesday, the White House will explicitly indicate that families should not fear criminal prosecution if they choose to make ransom payments. The new directive will not include a formal change to existing laws. But administration officials will state publicly, for the first time, that ransom payments will be tolerated. Officials said the administration will offer clear internal guidance to federal agencies on how to discuss the ransom issue with families to avoid confusion or mixed signals from the government. However, the longstanding administration policy against government concessions to hostage takers, including paying ransoms, will be reiterated and not be altered. Other changes expected in Wednesday's announcement include the formation of a \"Hostage Recovery Fusion Cell,\" which officials described as a full-time, inter-agency body with the goal of coordinating the U.S. government's response to hostage-takings. It will include the appointment of a director responsible for overseeing hostage recovery strategies. A senior administration official said the first director of the Fusion Cell will be a senior FBI official, with deputies assigned from the State Department and the Pentagon. The office will be housed in the FBI. Future directors will be chosen in three years and could be from any of those three agencies. Americans detained abroad 21 photos Mohamed Soltan – Jailed since 2013 and sentenced to life for supporting the Muslim Brotherhood in Egypt, Mohamed Soltan has been released , the U.S. Embassy in Cairo said on Saturday, May 30, 2015. Soltan's family denies he belonged to the Brotherhood. Soltan had been a dual U.S. and Egyptian citizen, but renounced his Egyptian citizenship as a condition of his release. Hide Caption 1 of 21 Americans detained abroad 21 photos Warren Weinstein – U.S. officials revealed on Thursday, April 23, that Weinstein, a 73-year-old American aid worker who had been held hostage in Pakistan since August 2011, had been accidentally killed in a U.S. drone strike targeting al Qaeda. Hide Caption 2 of 21 Americans detained abroad 21 photos Jeffrey Edward Fowle – One of three Americans detained in North Korea, Fowle was released and is now on his way home, a State Department official told CNN on Tuesday, October 21. Fowle was accused of leaving a Bible in a hotel where he was staying. North Korea announced Fowle's detention in June, saying he had violated the law by acting \"contrary to the purpose of tourism.\" Fowle told CNN: \"I've admitted my guilt to the government and signed a statement to that effect and requested forgiveness from the people and the government of the DPRK.\" Hide Caption 3 of 21 Americans detained abroad 21 photos Kenneth Bae – In May 2013, a North Korean court sentenced Bae, a U.S. citizen, to 15 years of hard labor for committing \"hostile acts\" against the state. North Korea claimed Bae was part of a Christian plot to overthrow the regime. In a short interview with CNN on Monday, September 1, Bae said he is working eight hours a day, six days a week at a labor camp. \"Right now what I can say to my friends and family is, continue to pray for me,\" he said. Hide Caption 4 of 21 Americans detained abroad 21 photos Matthew Todd Miller – Miller , the American sentenced to six years of hard labor in North Korea began serving his six-year sentence on September 25. He is one of three Americans detained in North Korea, who spoke to CNN's Will Ripley in September 2014 and implored the U.S. government for help. The 24-year-old is accused of tearing up his tourist visa and seeking asylum upon entry. Hide Caption 5 of 21 Americans detained abroad 21 photos Peter Theo Curtis – American journalist Peter Theo Curtis was handed over to U.N. peacekeepers on August 24 after nearly two years in captivity. He is believed to have been captured in October 2012 and held by the al-Nusra Front, a Syrian rebel group with ties to al Qaeda. Hide Caption 6 of 21 Americans detained abroad 21 photos Alan Gross – Gross, at right with Rabbi Arthur Schneier, has been in Cuban custody since December 2009, when he was jailed while working as a subcontractor. Cuban authorities say Gross tried to set up illegal Internet connections on the island. Gross says he was just trying to help connect the Jewish community to the Internet. Former President Jimmy Carter and New Mexico Gov. Bill Richardson have both traveled to Cuba on Gross' behalf, but they were unable to secure his release. Hide Caption 7 of 21 Americans detained abroad 21 photos Sgt. Bowe Bergdahl – This undated image provided by the U.S. Army shows Bergdahl, who had been held by insurgents in Afghanistan since 2009. The White House announced Bergdahl's release on May 31. Bergdahl was released in exchange for five senior Taliban members held by the U.S. military. Hide Caption 8 of 21 Americans detained abroad 21 photos Amir Hekmati – An Iranian court threw out a 2011 death sentence forAmir Hekmati, a former U.S. Marine charged with spying. But he was secretly retried in Iran and convicted of \"practical collaboration with the U.S. government,\" his sister told CNN on April 11. He has been sentenced to 10 years in prison, she said. Hekmati was detained in August 2011 during a visit to see his grandmother. His family and the Obama administration deny accusations he was spying for the CIA. Hide Caption 9 of 21 Americans detained abroad 21 photos Robert Levinson – Retired FBI agent Robert Levinson has been missing since 2007 . His family says he was working as a private investigator in Iran when he disappeared, and multiple reports suggest Levinson may have been working for the CIA. His family told CNN in January that they have long known that Levinson worked for the CIA, and they said it's time for the government to lay out the facts about Levinson's case. U.S. officials have consistently denied publicly that Levinson was working for the government, but they have repeatedly insisted that finding him and bringing him home is a \"top\" priority. Hide Caption 10 of 21 Americans detained abroad 21 photos Merrill Newman – U.S. tourist and Korean War veteran Merrill Newman arrives at the Beijing airport on December 7, 2013, after being released by North Korea. Newman was detained in October 2013 by North Korean authorities just minutes before he was to depart the country after visiting through an organized tour. His son Jeff Newman said the Palo Alto, California, man had all the proper paperwork and set up his trip through a North Korean-approved travel agency. Hide Caption 11 of 21 Americans detained abroad 21 photos Yanira Maldonado – Mexican authorities arrested Yanira Maldonado, a U.S. citizen, right, in May 2013, for alleged drug possession. She and her husband, Gary, were traveling from Mexico back to the United States when their bus was stopped and searched. She was released a few days later and is now back in the United States. Hide Caption 12 of 21 Americans detained abroad 21 photos Saeed Abedini – A 33-year-old U.S. citizen of Iranian birth, Abedini was sentenced to eight years in prison in January 2013. He was accused of attempting to undermine the Iranian government and endangering national security by establishing home churches. Hide Caption 13 of 21 Americans detained abroad 21 photos Laura Ling and Euna Lee – North Korea has arrested Americans before, only to release them after a visit by a prominent dignitary. Journalists Laura Ling, center, and Euna Lee, to her right, spent 140 days in captivity after being charged with illegal entry to conduct a smear campaign. They were freed in 2009 after a trip by former President Bill Clinton. Hide Caption 14 of 21 Americans detained abroad 21 photos Aijalon Gomes – Former President Jimmy Carter negotiated the release of Aijalon Gomes, who was detained in 2010 after crossing into North Korea illegally from China. Analysts say high-level visits give Pyongyang a propaganda boost and a way to save face when it releases a prisoner. Hide Caption 15 of 21 Americans detained abroad 21 photos Eddie Yong Su Jun – Detained in April 2011, Junwas released by North Korea a month afterward. His alleged crime was not provided to the media. The American delegation that secured his freedom included Robert King, the U.S. special envoy for North Korean human rights issues. Hide Caption 16 of 21 Americans detained abroad 21 photos Robert Park – Without any apparent U.S. intervention, Park was released by North Korea in 2010. The Christian missionary crossed into North Korea from China, carrying a letter asking Kim Jong Il to free political prisoners and resign. North Korea's state-run news agency said Park was released after an \"admission and sincere repentance of his wrongdoings.\" Here, Park holds a photo of Kim and a malnourished child during a protest in Seoul. Hide Caption 17 of 21 Americans detained abroad 21 photos Josh Fattal, Sarah Shourd and Shane Bauer – Josh Fattal, center, Sarah Shourd, left, and Shane Bauer were detained by Iran while hiking near the Iraq-Iran border in July 2009. Iran charged them with illegal entry and espionage. Shourd was released on bail for medical reasons in September 2010; she never returned to face her charges. Bauer and Fattal were convicted in August 2011, but the next month they were released on bail and had their sentences commuted. Hide Caption 18 of 21 Americans detained abroad 21 photos Haleh Esfandiari – Esfandiari, an Iranian-American scholar, was detained at Iran's Evin Prison, spending months in solitary confinement before Iran released her on bail in August 2007. Esfandiari was visiting her ailing mother in Tehran when she was arrested and charged with harming Iran's national security. Hide Caption 19 of 21 Americans detained abroad 21 photos Robert Becker – Sixteen Americans were among the dozens arrested in December 2011 when Egypt raided the offices of 10 nongovernmental organizations that it said received illegal foreign financing and were operating without a public license. Many of the employees posted bail and left the country after a travel ban was lifted a few months later. Robert Becker, right, chose to stay and stand trial. Hide Caption 20 of 21 Americans detained abroad 21 photos Timothy Tracy – Filmmaker Timothy Tracy was arrested in Venezuela in April 2013 on allegations of funding opponents of newly elected President Nicolas Maduro, successor to the late Hugo Chavez. Tracy went to Venezuela to make a documentary about the political division gripping the country. He was released in June 2013. Hide Caption 21 of 21 Two new positions within the government are also expected to be created: a family engagement coordinator to act as a single point of contact for families of hostages, and the designation of a senior representative from the State Department for diplomatic outreach abroad. The review process has relied heavily on the input of former hostages and their families. Administration officials conducted over 40 interviews with 24 families and former hostages through three rounds of feedback. The administration also consulted with five intermediaries, three international organizations, two hostage experts and four foreign countries. The interviews with former hostages or families took place in their hometowns or in Washington. The review was led by Lisa Monaco, Obama's top counterterrorism adviser. Monaco sent letters to 82 families and former hostages dating back to 2001, inviting them to be part of the review process and to provide their views based on their personal experiences. \"We understand this is incredibly difficult and painful for the families and we appreciate their feedback,\" a senior official said. \"(Their feedback) has been invaluable and helped us examine ways to improve our processes and communicate with the families most effectively to achieve our shared objective of ensuring the safe return of a loved one.\" READ: Bowe Bergdahl rescuer warns of 'broken' hostage system Some families, like that of James Foley, an American journalist beheaded by ISIS last August, have been critical of the administration's handling of hostage situations. His mother, Diane Foley, told CNN's Anderson Cooper in September that she was \"embarrassed and appalled\" by how the U.S. government dealt with her son's case. \"I think our efforts to get Jim freed were an annoyance\" to the U.S. government, Foley said. \"It didn't seem to be in (the U.S.) strategic interest.\" The wife of Warren Weinstein, an American aid worker accidentally killed by a U.S. drone strike in April, said on Tuesday that during her husband's captivity, \"elements of the U.S. government fell short.\" \"We hope to be the last family that fails to receive the level of coordinated government support that those who serve abroad deserve when trouble finds them,\" Elaine Weinstein said. \"We believe the creation of a fusion cell is a good idea, but we believe establishing a sole individual with overall policy responsibilities for safe hostage recovery would have been best positioned at the National Security Council, since that would not only give the position more inter-agency coordinating authority but also ensure that those debating counter-terrorism activities and hostage recovery efforts were sitting in the same room,\" she said. Rep. Duncan Hunter (R-CA) speaks during a news conference held by House Republicans on 'Protecting America's Veterans' at the U.S. Capitol May 29, 2014 in Washington, DC. California Republican Rep. Duncan Hunter, who pushed the administration to conduct the review, was similarly skeptical of early details about the hostage review. \"The changes offered up by the White House prove that neither the right questions were asked nor were any lessons learned,\" Hunter said. \"Wholesale changes are needed, but what's being put forward is nothing more than window dressing, I fear.\" He continued, \"It's a pathetic response to a serious problem that has plagued the ability of the U.S. to successfully recover Americans held captive in the post-9/11 era.\" Hunter said housing the Fusion Cells within the FBI was a mistake, claiming the agency was ill-equipped to handle foreign hostage crises. The team that carried out the administration's hostage review was comprised of officials from the Departments of Defense, State, Justice, Treasury and the intelligence community. An administration official said the U.S. government has observed a \"significant shift\" in hostage-takings abroad by terrorists and criminal groups, requiring the policy to also evolve with new and more pronounced challenges. \"Terrorist groups have become increasingly willing to engage in publicized and repugnant murders of hostages if they are unable to extract concessions,\" the administration official said. \"They deliberately target private citizens as well as government officials to garner media attention and attempt to extract political and financial concessions.\" CNN's Kevin Liptak contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News ", "external_links": [], "published": "2015-06-23T19:40:00.000+03:00", "crawled": "2015-06-23T22:23:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}