{"organizations": ["Fox News Latino", "Fox News Latino Anti-illegal"], "uuid": "40e89b3a87fe3b9b6382a1736f9452328dd2a9c8", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/rising.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/18/anti-immigrant-activists-file-complaint-claiming-were-denied-entry-to-ca-event/", "country": "", "title": "Anti-illegal immigration activists claim they were unlawfully banned at public event | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Anti-illegal immigration activists claim they were unlawfully banned at public event | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "40e89b3a87fe3b9b6382a1736f9452328dd2a9c8"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/18/anti-immigrant-activists-file-complaint-claiming-were-denied-entry-to-ca-event/", "ord_in_thread": 0, "title": "Anti-illegal immigration activists claim they were unlawfully banned at public event | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Anti-illegal immigration activists claim they were unlawfully banned at public event Published June 18, 2015 Fox News Latino youtube \nMembers of “We The People Rising,” a grassroots organization that opposes granting benefits to undocumented immigrants in the U.S., have started a legal action claiming they were not allowed into a meeting called by a California state senator. \nThe event, co-sponsored by UCLA, was open to the public, with invitations sent out by state Sen. Ricardo Lara. It was held at the South Gate Park Auditorium on March 27. \nThe activists say they were discriminated against and are accusing Lara, a Democrat, of violating California's Unruh Civil Rights Act. \nThe California Department of Fair Employment and Housing is looking into the complaints filed by four activists, the newspaper said. \nRobin Hvidston, executive director of the organization, told Fox News Latino that members were only allowed in at the end of the event under police escort and they were ordered to remain silent. \n“We were absolutely stunned when we arrived at the meeting,” she said. “Sen. Lara and he staff deployed the California Highway Patrol to tell us we were not allowed in the meeting. We were absolutely flabbergasted.” \nShe said members “had no intention of being disruptive.” \nRaul Rodriguez Jr., another of the activists in the complaint, told the Los Angeles Times that when they were finally allowed inside they were banned from expressing their point of view. \"We could not exercise our 1st Amendment rights,\" he said. \nThe anti-illegal immigration activists said they confirmed their attendance by responding to an RSVP request in advance, but when 12 of them showed up they were denied entry by California Highway Patrol officers providing security at the door. \nCiting fears of disruption, the officers ordered them to leave the premises or face being detained, according to a video of the encounter posted online by a group member. \nComplaints have also been filed against the California Highway Patrol. \nIn a statement to the Times, Sen. Lara refused to comment on the incident, saying only that members of We The People Rising have met on several occasions with his staff. “[They] have had the opportunity to express their views,” he said. \"They have also attended Senate events and at times disrupted official Senate business.\" \nThe complaints come as California is on the cusp of extending subsidized health care coverage to children who are in the state illegally. On Wednesday, Gov. Jerry Brown and legislative leaders announced a $115.4 billion budget agreement that for the first time includes state funding to cover low-income children under 19 regardless of their legal status in Medi-Cal, the state's health care program for the poor. \nLike us on Facebook ", "external_links": [], "published": "2015-06-19T03:00:00.000+03:00", "crawled": "2015-06-20T05:43:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}