{"organizations": ["Anti-Choice Advocates Doubtful Of Murder Case Against Woman Who Allegedly Took Abortion Pill Even Anti-Choice"], "uuid": "1d9b366f17f2093512fdb50421696c933c4015c5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3049632/images/o-CYTOTEC-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/10/abortion-pill-murder-case-doubtful_n_7552146.html", "country": "", "title": "Even Anti-Choice Advocates Doubtful Of Murder Case Against Woman Who Allegedly Took Abortion Pill", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Even Anti-Choice Advocates Doubtful Of Murder Case Against Woman Who Allegedly Took Abortion Pill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T18:45:00.000+03:00", "replies_count": 0, "uuid": "1d9b366f17f2093512fdb50421696c933c4015c5"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/10/abortion-pill-murder-case-doubtful_n_7552146.html", "ord_in_thread": 0, "title": "Even Anti-Choice Advocates Doubtful Of Murder Case Against Woman Who Allegedly Took Abortion Pill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Even Anti-Choice Advocates Doubtful Of Murder Case Against Woman Who Allegedly Took Abortion Pill Posted: stumble \nRUSS BYNUM, Associated Press \nEven opponents of abortion say it may be hard for Georgia authorities to follow through with prosecuting a woman who was charged with murder because she took a pill to terminate her pregnancy. \n\"I have been involved in the pro-life movement for well over 20 years, and I'm not aware of a situation like this ever,\" said Genevieve Wilson, a director of the anti-abortion group Georgia Right to Life. \"I'm very surprised by it.\" \nKenlissia Jones, 23, of Albany was being held at the Dougherty County jail on charges of malice murder and possession of a dangerous drug. Albany is about 180 miles south of Atlanta. \nDistrict Attorney Greg Edwards said Tuesday evening he's reviewing the case and is unsure whether he'll ultimately prosecute Jones, though he said that \"as of right now she's still charged.\" \nJones was arrested Saturday after a county social services worker called police to a hospital, according to an Albany police report. A hospital social worker told police that Jones said she had taken four pills she purchased over the Internet \"to induce labor\" because she and her boyfriend had broken up. \nThe social worker told police Jones went into labor and delivered the fetus in a car on the way to the hospital. The fetus did not survive. The police report does not say how far along Jones was in her pregnancy. WALB-TV reported (http://bit.ly/1Irtzju) earlier that authorities said Jones was about 5 ½ months pregnant. \nProsecuting Jones seems at odds with Georgia case law, said Lynn Paltrow, an attorney and executive director of National Advocates for Pregnant Women, a legal group in New York. She noted state law explicitly prohibits prosecuting women for feticide involving their own pregnancies. And a Georgia appeals court ruled in 1998 that a teenager whose fetus was stillborn after she shot herself in the abdomen could not be prosecuted for performing an illegal abortion. Prosecutors ended up dropping that case. \n\"We don't believe there is any law in Georgia that allows for the arrest of a woman for the outcome of her pregnancy,\" said Paltrow, whose group is offering free legal aid to Jones. \nWilson agreed that feticide and abortion laws in the state have not been used to target women who end their own pregnancies. \n\"I'm thinking that perhaps whoever made the arrest may not have known what the laws really are,\" Wilson said. \nJones' grandmother, Mary Lee Jones, said she didn't know her granddaughter was pregnant. She said her granddaughter often seems troubled and likely needs professional counseling more than jail. \n\"I think now, in the position she's in, she needs to be evaluated,\" Jones' grandmother said. \"She's just not herself.\" \nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. More: ", "external_links": [], "published": "2015-06-10T18:45:00.000+03:00", "crawled": "2015-06-10T19:38:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}