{"organizations": [], "uuid": "9d19906488b04899909f77b8f6266082db35d7d1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3034868/images/o-DOCTOR-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/04/arizona-abortion-lawsuit-_n_7513688.html", "country": "", "title": "Doctors Sue Arizona Over Abortion Law That 'Forces Doctors To Lie To Patients'", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Doctors Sue Arizona Over Abortion Law That 'Forces Doctors To Lie To Patients'", "spam_score": 0.0, "site_type": "news", "published": "2015-06-05T00:49:00.000+03:00", "replies_count": 0, "uuid": "9d19906488b04899909f77b8f6266082db35d7d1"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/04/arizona-abortion-lawsuit-_n_7513688.html", "ord_in_thread": 0, "title": "Doctors Sue Arizona Over Abortion Law That 'Forces Doctors To Lie To Patients'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Doctors Sue Arizona Over Abortion Law That 'Forces Doctors To Lie To Patients' Posted: reddit \nA new Arizona law would unconstitutionally force doctors to lie to their patients about the reversibility of medical abortions, according to a lawsuit filed in federal court Thursday by the American Civil Liberties Union on behalf of Planned Parenthood and various Arizona health care providers. \nThe lawsuit challenges the recently passed SB 1318, which adds new restrictions for women seeking abortion. Specifically, the plaintiffs are seeking an injunction to stop the law from taking effect over a provision that requires doctors to tell their patients that it \"may be possible\" to reverse the effects of a medical abortion. \n\"This dangerous law forces doctors to lie to their patients,\" Dr. Ilana Addis, chair of the Arizona Section of the American Congress of Obstetricians and Gynecologists, said in a press call Thursday. Addis said there is no credible medical science to support the claim that medical abortions are reversible. \n\"It’s stunning to me that politicians think they’re qualified to dispense medical advice,\" Addis noted. \nThe bill specifies that doctors must must tell a woman seeking an abortion both on the phone and in person that it \"may be possible to reverse the effects of a medication abortion if the woman changes her mind but that time is of the essence,\" and that \"information on and assistance with reversing the effects of a medication abortion is available on the Department of Health Services website.” \nAbout three-fourths of the abortions provided in Arizona are surgical, the lawsuit states. \nAddis said heath care providers are ethically obligated to provide patients \"[medically] accurate, unbiased information about their options\" so that patients can make an informed decision on their own. \n\"Politicians are putting words in doctors' mouths that the doctors should't have to say,\" ACLU staff attorney Andrew Beck said Thursday. \"Forcing doctors to make these misleading statements to women is just bad medicine.\" \nIn forcing doctors to \"unwillingly and against their best medical judgment\" give patients \"a state-mandated message that is neither medically nor scientifically supported,\" plaintiffs argue the law in question also violates doctors' First Amendment rights. \nDavid Brown, a staff attorney with the Center for Reproductive Rights, said the law \"may result in women beginning the [abortion] process before they’re totally ready because they think it can be reversed.\" \nMedical abortions, also known as non-surgical abortions, typically consist of taking two prescribed medications -- mifepristone and misoprostol -- within days of one another, according to the University of California San Francisco Medical Center. \nThe claim that medical abortions are \"reversible\" largely traces back to George Delgado, an anti-abortion gynecologist in San Diego. Delgado backs an experimental procedure in which a woman who doesn't take the dose of misoprostol can be injected with progesterone (considered an \"off label\" use by the FDA) to \"reverse\" the abortion. \nBut the American Congress of Obstetricians and Gynecologists notes that -- regardless of a progesterone injection -- pregnancies continue in 30-50 percent of women if they only take the first drug but not the second phase, The National Journal reports. \nThe lawsuit, filed in the U.S. District Court for the District of Arizona, names Arizona Attorney General Mark Brnovich and Arizona Department of Health Services Director Cara Christ in the complaint. Also on HuffPost: 10 Myths About Abortion That Need To Be Busted of   REALITY: Over 99.75 percent of abortions do not cause major medical problems. Less than one-quarter of 1 percent of abortions performed in the United States lead to major health complications, according to a 2014 study from the University of California, San Francisco, that tracked 55,000 women for six weeks after their abortions. The researchers note that this makes an abortion statistically about as risky as a colonoscopy. If that fact seems surprising, consider how American pop culture misrepresents the risks of abortion: Nine percent of film and television characters who have abortions die as a direct result of the procedure, according to another 2014 study from UCSF. REALITY: About one in five abortions are medical abortions. The Centers for Disease Control and Prevention found that 19 percent of abortions in 2011 were medical abortions and that 28.5 percent of those took place in the first nine weeks of pregnancy. The Guttmacher Institute also found that medical abortions increased substantially from 2008 to 2011, meaning more women have ended their pregnancies with this alternative to surgery. REALITY: Most women will not regret their decision, and are no more likely to experience mental health problems than women who carry an unplanned pregnancy to term. While many women experience mixed emotions after an abortion, 95 percent of women who have abortions ultimately feel they have made the right decision, according to an August 2013 study from UCSF. \"Experiencing negative emotions postabortion is different from believing that abortion was not the right decision,\" the researchers explained. Furthermore, while unplanned pregnancies often cause emotional stress, there is no evidence to suggest that women who choose to terminate their pregnancies will be more likely to suffer from mental health issues, according to a 2008 report from the American Psychological Association that investigated all relevant medical studies published since 1989. The APA found that past studies claiming abortion causes depression and other mental health problems consistently failed to account for other risk factors, particularly a woman's medical history. The APA accounted for these factors and found that, among women who have an unplanned pregnancy, those who have abortions are no more likely to experience mental health problems than those who carry the pregnancy to term. REALITY: Fetuses cannot feel pain until at least the 24th week of pregnancy. Experts ranging from Britain’s Royal College of Obstetricians and Gynaecologists to the American Congress of Obstetricians and Gynecologists agree with that timeline. In fact, research from UCSF found that fetuses can't perceive pain before 29 or 30 weeks of development. Then why have so many states banned abortions after 20 weeks of pregnancy? Perhaps misrepresentation of research is partly to blame: Many of the researchers most frequently cited by pro-life politicians told The New York Times that their research does not prove anything about fetal pain. REALITY: Most Americans support a woman's right to choose. According to a Gallup poll from 2014, 78 percent of Americans think abortion should be legal in some or all circumstances. (Fifty percent said \"some circumstances,\" while 28 percent said all.) What's more, in 2012, Gallup found that 61 percent of Americans think abortions that take place during the first trimester of pregnancy should be legal. (Nine out of 10 abortions in the U.S. do take place during that time period, according to Guttmacher.) REALITY: The abortion rate in the United States is the lowest it's been since 1973. The abortion rate has been on the decline for years, and hit its lowest level in 2011, according to the latest data available from the Guttmacher Institute. The study's author partially credited the decline to better contraceptive use and more long-term contraceptive options, such as the IUD. REALITY: Women face a growing number of barriers to accessing abortions. More than 57 percent of American women live in states that are hostile or extremely hostile to abortion rights, according to the Guttmacher Institute. That represents a marked increase from 2000, when 31 percent of American women lived in such states. In 2011, 89 percent of counties in America had no abortion clinics. This is no accident: Across the U.S., lawmakers have enacted 231 new abortion restrictions over the past four years, according to a Guttmacher analysis from January 2015. As a result, many women have to travel great distances to reach an abortion clinic, where they may face 24-hour wait periods. These barriers particularly affect women living in rural areas and low-income women, who often can't afford to take time off work and pay for gas and a hotel room. Other laws force women to go through potentially distressing procedures, such as viewing their own ultrasound photos, in order to move forward with an abortion. REALITY: Women rarely cite pressure from family or partners as leading to their decision to abort. A 2005 study from the Guttmacher Institute found that less than 1 percent of women surveyed cited such pressure among their main reasons for having an abortion. A 2013 study from UCSF reached a similar conclusion, and found that while women rarely cited partner coercion as a reason they sought an abortion, many did cite the desire to escape a bad relationship or domestic violence. REALITY: Most women who have abortions are already mothers. Sixty-one percent of women who had abortions in 2008 were mothers, and 34 percent had two or more children, according to the Guttmacher Institute. That number only increased after the 2009 financial downturn. The National Abortion Federation told Slate that between 2008 and 2011, 72 percent of women seeking abortions were already mothers. A study from Guttmacher found that mothers typically have abortions to protect the children they already have; they simply cannot afford to raise another child. REALITY: Requiring abortion clinics to meet these standards does little to improve patient safety and forces many to shut down. Currently, 22 states require abortion clinics to meet a set of restrictive and often arbitrary standards, dictating that they be close to hospitals and that their hallways and closets meet certain measurements. Clinics often need to undergo expensive renovations in order to comply, and leading doctors' groups say the laws do little to improve patient safety. What's more, 11 states now require that doctors at abortion clinics obtain admitting privileges at a nearby hospital, but many hospitals flat-out refuse to grant these privileges. As a result, hospitals essentially have the power to shut down nearby clinics.  Share ", "external_links": [], "published": "2015-06-05T00:49:00.000+03:00", "crawled": "2015-06-05T00:49:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}