{"organizations": [], "uuid": "fbae5db70bfb963ff9cea1cd7c4804bb6973bf3a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/pelosiboehnerobama_061715getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/finance/245284-white-house-open-to-separate-fast-track-trade-assistance-bills", "country": "US", "title": "Obama meeting with pro-trade Democrats at White House", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama meeting with pro-trade Democrats at White House", "spam_score": 0.0, "site_type": "news", "published": "2015-06-17T21:09:00.000+03:00", "replies_count": 0, "uuid": "fbae5db70bfb963ff9cea1cd7c4804bb6973bf3a"}, "author": "Jordan Fabian", "url": "http://thehill.com/policy/finance/245284-white-house-open-to-separate-fast-track-trade-assistance-bills", "ord_in_thread": 0, "title": "Obama meeting with pro-trade Democrats at White House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama meeting with pro-trade Democrats at White House Getty Images By Jordan Fabian - 06/17/15 02:09 PM EDT \nPresident Obama is meeting with pro-trade Democrats from the House and Senate at the White House, seeking a way to move a legislative package forward on Capitol Hill. \nObama and congressional Republicans have zeroed in on a strategy in which the House and Senate vote for a second time on passing fast-track, which would make it easier for Obama to negotiate a sweeping Pacific trade deal. \nSeparately, Congress would approve legislation granting aid to workers displaced by trade, a program known as Trade Adjustment Assistance (TAA). \n\nThe problem for Obama and Republicans is that they must first convince Senate Democrats to vote for fast-track on the promise the TAA bill would be finished later. \nWhite House spokesman Josh Earnest on Wednesday signaled Obama is open to Congress sending him the two measures separately. ADVERTISEMENT Earnest said both measures must be delivered to Obama’s desk.\n“The only legislative strategy the president can support is one that will result in both pieces of legislation arriving at his desk,” he said. \nBut he said they did not need to be packaged together and did not comment on timing. \n“There is also this fundamental question ... about whether or not they need to arrive at the same time, on the same day, as part of the same legislative vehicle or separately. That's exactly what's being discussed on Capitol Hill right now,” Earnest said. \nHe also dodged a question on whether Obama would veto fast-track legislation that did not come alongside the workers' assistance bill, saying, “I don’t think it’s going to come to that.” \nGetting fast-track done before the TAA bill could make it easier to pass the latter measure. \nIn the House, Democrats, who have typically backed TAA, voted it down last week as a way of killing fast-track. Both measures had to be approved under the floor procedure set up by House Republicans. \nIf the fast-track bill were already law, it would take away the incentive for House Democrats to vote against TAA. \nIn the House, Rep. Gregory Meeks (D-N.Y.) told The Hill that Democrats who voted for fast-track in last week's vote are willing to do so again. \nIn the Senate, it's not as clear that pro-trade Democrats are ready to endorse the new strategy. \nThe White House has been in constant communication with lawmakers since the trade package failed Friday. The president has spoken on the phone with members of Congress, mostly Democrats, as recently as Wednesday morning. \nOn Wednesday evening, Obama will host lawmakers including House Democratic Leader Nancy Pelosi (Calif.) for a congressional picnic on the South Lawn of the White House. But Earnest has said there won’t be arm-twisting on trade at the event. \nHe brushed aside a suggestion the event will be awkward because of the divide between Obama and Democrats on trade. It’s a “goodwill gesture and a purely social occasion,” Earnest said. But Earnest also took a jab at Pelosi, whom the president has not spoken to since she voted to derail his trade package last Friday. “The people who are most relevant to trying to finding this path forward are people who are part of the bipartisan majority that have allowed this legislation to advance,\" he said. “She doesn’t want the legislation to advance.” \nScott Wong and Vicki Needham contributed. \nThis story was updated at 3:18 p.m. Tags:", "external_links": [], "published": "2015-06-17T21:09:00.000+03:00", "crawled": "2015-06-18T00:31:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}