{"organizations": [], "uuid": "3db26be3ff39db4951cdd54bf26de679d6c93d69", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3062796/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/index.xml", "section_title": "Business - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/11/obama-affordable-care-act_n_7563822.html?utm_hp_ref=business&ir=Business", "country": "US", "title": "Obama Exaggerates Effects Of Affordable Care Act", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Exaggerates Effects Of Affordable Care Act", "spam_score": 0.0, "site_type": "news", "published": "2015-06-11T22:03:00.000+03:00", "replies_count": 0, "uuid": "3db26be3ff39db4951cdd54bf26de679d6c93d69"}, "author": "Sam Levine", "url": "http://www.huffingtonpost.com/2015/06/11/obama-affordable-care-act_n_7563822.html?utm_hp_ref=business&ir=Business", "ord_in_thread": 0, "title": "Obama Exaggerates Effects Of Affordable Care Act", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Exaggerates Effects Of Affordable Care Act Factcheck.org | By Lori Robertson Updated: 3 minutes ago US President Barack Obama speaks about healthcare reforms and the Affordable Care Act, known as Obamacare, during the Catholic Hospital Association Conference in Washington, DC, June 9, 2015. AFP PHOTO / SAUL LOEB (Photo credit should read SAUL LOEB/AFP/Getty Images) | SAUL LOEB via Getty Images reddit \nThe following post first appeared on FactCheck.org . \nPresident Barack Obama made misleading and exaggerated claims in a speech boasting of the accomplishments of the Affordable Care Act. Obama claimed that those who already had insurance before the law was passed “got a better deal now” than they did before, because of insurance coverage protections and requirements in the law. But those added benefits came at a higher cost for some. Better coverage didn’t mean a “better deal” for everyone. The Web page promoting the speech claims that “129 million people who could have otherwise been denied or faced discrimination now have access to coverage.” But most of those individuals already had “access to coverage” — they got it through their employers before the ACA’s marketplaces were launched. Obama said the rate of the uninsured is at “its lowest level ever.” That’s unclear. His Council of Economic Advisers analyzed National Health Interview Survey data, which show the uninsured rate for the first nine months of 2014 (the most recent data available) was slightly higher than a few years several decades ago. The president said family premiums are “$1,800 lower today” on average than they would have been if premium trends that existed before the ACA had continued. It’s true premiums have increased more slowly in recent years than they did before the ACA, but even the president’s own economic advisers say the law isn’t responsible for the entire slowdown. A ‘Better Deal’ Obama spoke on June 9 at the Catholic Health Association Conference in Washington, D.C. His remarks came at a critical time for the Affordable Care Act: The Supreme Court is expected to rule soon on a case that could impact subsidies available through state marketplaces run by the federal government . The president said that before the ACA was passed, 85 percent of Americans already had health insurance. ( That’s about right .) He went on to say that they still got “a better deal” under the health care law. Obama, June 9: That 85 percent who had health insurance, they may not know that they got a better deal now than they did, but they do. Americans can no longer be denied coverage because of preexisting conditions, from you having had cancer to you having had a baby. Women can’t be charged more just for being a woman. And they get free preventive services, like mammograms. And there are no more annual or lifetime caps on the care patients receive. The ACA did include all of those insurance coverage mandates, which strengthen coverage and protections for individuals. But is that “a better deal” for everyone who had insurance before the ACA? Certainly not. As we’ve long said , individual market coverage, for those who bought their own insurance, varied widely in terms of coverage and premiums before the health care law was passed. For those who were healthy, premiums could be significantly less than what others were charged. But not anymore. The ACA doesn’t allow insurers to vary rates based on health status. And it requires a certain level of minimum benefit standards. That’s good news for some — such as people with health conditions that boosted their premiums. Others now pay more, as basic plans for healthy folks are no longer available. \nWith such major changes to how the individual market is priced and how it operates, there were going to be some who got better deals and others who didn’t. Even then-Health and Human Services Secretary Kathleen Sebelius acknowledged that before the exchanges launched. In March 2013, she said : “Women are going to see some lower costs, some men are going to see some higher costs. It’s sort of a one-to-one shift … some of the older customers may see a slight decline, and some of the younger ones are going to see a slight increase.” Access to Coverage The White House promoted the president’s speech with a Web page that made the misleading claim that “129 million people who could have otherwise been denied or faced discrimination now have access to coverage.” This is an old claim we first wrote about in 2011 , but the White House has been pushing it again . The number is the high end of an administration estimate of non-elderly adults who could be denied coverage if they were seeking it on the pre-ACA individual market. (Insurers on the individual market used to be able to deny coverage for medical reasons, but now insurance companies have to offer insurance to anyone who wants it.) But most people weren’t seeking insurance on the individual market before the ACA, nor are they doing it now. And these 129 million people — that’s half of all non-elderly adults in the United States — didn’t lack “access to coverage.” In fact, the vast majority already had it. The administration analysis — released by the Department of Health and Human Services — found that this 129 million number included “[a]s many as 82 million Americans with employer-based coverage” who had a preexisting condition “ranging from life-threatening illnesses like cancer to chronic conditions like diabetes, asthma, or heart disease.” Before the ACA, those with coverage through a large employer already had protections for preexisting conditions, including protections through the Health Insurance Portability and Accountability Act of 1996 . The administration does have a point in that these individuals could have been denied coverage, charged a higher premium or had their coverage of preexisting conditions limited if they had to seek coverage on the individual market without the Affordable Care Act’s protections. HHS wrote in the report: “Without the Affordable Care Act, such conditions limit the ability to obtain affordable health insurance if they become self-employed, take a job with a company that does not offer coverage, or experience a change in life circumstance, such as divorce, retirement, or moving to a different state.” That’s correct. But with or without the health care law, most Americans would still get their insurance coverage through work (see the Congressional Budget Office’s latest table on the effects of the law on insurance coverage). The HHS report said that the 129 million number included 25 million who were uninsured. It also said 43 percent of those who had coverage on the individual market had a preexisting condition. A Kaiser Family Foundation report published in May estimated that 10.9 million people were on this market in 2011, when the HHS report was released. These individuals — the uninsured and individual market policyholders — are most likely to be affected by the ACA’s mandate that they not be denied or charged more for preexisting conditions. And some who had coverage through work may have held onto their jobs just for the insurance. But it’s misleading and an exaggeration for the Obama administration to claim that 129 million people with preexisting conditions “now have access to coverage” because of the ACA. The Uninsured Obama repeated a version of a claim he made in January during his State of the Union address , saying that the “uninsured rate” was at “its lowest level ever.” This could turn out to be the case, once data for all of 2014 and early 2015 are available. But the most recent government data only capture the first nine months of 2014, when the rate of the uninsured was slightly higher than the rate for 1974, 1978 and 1980. The president’s claim is based on an analysis of data released by the Centers for Disease Control and Prevention’s National Center for Health Statistics. The data come from the National Health Interview Survey conducted by the Census Bureau. The latest release includes data from more than 85,000 people, so it’s comprehensive — but only encompasses January through September for 2014. The percentage of uninsured, for all ages, for those nine months was 11.9 percent, a significant drop from the 16 percent uninsured for 2010, the year the ACA was enacted. But 11.9 percent isn’t the “lowest level ever.” Obama’s Council of Economic Advisers analyzed NHIS data in December 2014 , adjusting some previous years’ figures for changes in survey construction. Its chart on years dating back to 1963 show that there was a lower rate of uninsured (11.4 percent) in 1974, 1978 and 1980 (see the table on page 11). It’s possible the uninsured rate for all of 2014, and the first quarter of 2015, will be lower than it was for just the first nine months of last year. The open enrollment period for the insurance marketplaces didn’t begin until Nov. 15, 2014. The Gallup-Healthways Well-Being Index survey , which included more than 43,000 adults for the first quarter of 2015, put the uninsured rate for adults, age 18 and older, at 11.9 percent. That’s the lowest rate the survey has found, but it only began tracking such figures in 2008. Lower Premiums The president improved upon a claim about premiums that we fact-checked in March. In his June 9 speech, Obama said: “The average family premium is $1,800 lower today than it would have been had trends over the decade before the ACA passed continued.” That’s correct. Last time , Obama said this was “$1,800 in people’s pockets,” which is false. We’ll still note that the slower-than-expected growth in premiums is only partly attributable to the ACA, according to the president’s Council of Economic Advisers. \nThe CEA’s September 2014 report used information from the Kaiser Family Foundation’s annual surveys of employer-sponsored health plans to determine that “[i]f premiums growth had matched its 2000-2010 average since 2010, the average premium would be $1,800 higher today.” \nPremiums for employer plans have been growing at low rates in recent years, but as we have written before , experts attribute the slowdown mostly to the sluggish economy. The CEA gave the health care law more credit, saying “a significant fraction of the recent slowdown in health care price inflation can be linked to Medicare reforms in the Affordable Care Act.” But it didn’t say how much of the $1,800 difference was due to the ACA. Also on HuffPost: Lies And Distortions Of The Health Care Debate of   One of the more positive sounding admonitions from health care reform opponents was that the United States had \"the best health care in the world,\" so why would you mess with it? Well, it's true that if you want the experience the pinnacle of medical care, you come to the United States. And if you want the pinnacle of haute cuisine, you go to Per Se. If you want the pinnacle of commercial air travel, you get a first class seat on British Airways. Now, naturally, you wouldn't let just anyone mess with someone's tasting menu or state-of-the-art air-beds. But like anything that's \"the best,\" the best health care in the world isn't for everybody. The costs are prohibitively high, the access is prohibitively exclusive, and the resources are prohibitively scarce. What do the people in America who \"fly coach\" in the health care system get? Well, at the time of the health care reform debate, they were participating in a system that was, by all objective measurements, overpriced and underperforming -- if you were lucky enough to be participating in it. As anyone who's fortunate enough to have employer based health care or unfortunate enough to have a pre-existing condition can tell you, health care for ordinary people already involved all of those things that we were told would be a feature of the Affordable Care Act -- long waits, limited choice, and rationing. When the Commonwealth Fund rated health care systems by nation, the top marks in the surveyed categories went to the United Kingdom, New Zealand and the Netherlands. Ezra Klein examined the study, and observed: \"The issue isn't just that we don't have universal health care. Our delivery system underperforms, too. 'Even when access and equity measures are not considered, the U.S. ranks behind most of the other countries on most measures. With the inclusion of primary care physician survey data in the analysis, it is apparent that the U.S. is lagging in adoption of national policies that promote primary care, quality improvement, and information technology.'\" The only thing that perhaps matched the vastness of the spread or the depth of the traction of the \"death panel\" lie was the predictability that such a lie would come to be told in the first place. After all, this was a Democratic president trying to sell a new health care reform plan with the intention of opening access and reducing cost to millions of Americans who had gone without for so long. What's the best way to counter it? Tell everyone that millions of Americans would have increased access ... to Death! The best account of how the \"death panel\" myth was born into this world and spread like garbage across the landscape has been penned by Brendan Nyhan, who in 2010 wrote \"Why the \"Death Panel\" Myth Wouldn't Die: Misinformation in the Health Care Reform Debate.\" You should go read the whole thing. But to summarize, the lie began where many lies about health care reform begin -- with serial liar Betsy McCaughey, who in 1994 polluted the pages of the New Republic with a staggering pile of deception in an effort to scuttle President Bill Clinton's health care reform. As Nyhan documents, she re-emerged in 2009 when \"she invented the false claim that the health care legislation in Congress would result in seniors being directed to 'end their life sooner.'\" Nyhan: \"McCaughey's statement was a reference to a provision in the Democratic health care bill that would have provided funding for an advanced care planning for Medicare recipients once every five years or more frequently if they become seriously ill. As independent fact-checkers showed (PolitiFact.com 2009b; FactCheck.org 2009a), her statement that these consultations would be mandatory was simply false--they would be entirely voluntary. Similarly, there is no evidence that Medicare patients would be pressured during these consultations to \"do what's in society's best interest...and cut your life short.\" But the match that lit the death panel flame was not McCaughey, it was Sarah Palin, who repeated McCaughey's claims in a Facebook posting and invented the term \"death panel.\" As Nyhan reports, Palin's claims were met with condemnation from independent observers and factcheckers, but the virality of the term \"death panel\" far outstripped its own debunking. To this day, the shorthand for this outrageous falsehood remains more firmly planted in the discourse than the truth. One thing worth pointing out is that Palin, in creating the term \"death panel,\" intended to deceive people with it. In an interview with the National Review, Palin admitted: \"The term I used to describe the panel making these decisions should not be taken literally.\" Rather, it was \"a lot like when President Reagan used to refer to the Soviet Union as the 'evil empire.' He got his point across.\" Of course, while Reagan was exaggerating for effect, he wasn't trying to prey on the goodwill of those who were listening to him. Naturally, the GOP greeted anything that the Obama White House did -- from regulating pollution to flossing after meals -- as something that would \"kill jobs.\" The Affordable Care Act was no different. As you might recall, Republicans' first attempt at repeal came in the form of an inartfully named law called the \"Repealing the Job-Killing Health Care Law Act.\" But did the health reform plan threaten jobs? Not by any honest measure. Per McClatchy Newspapers: \"The claim has no justification,\" said Micah Weinberg, a senior research fellow at the centrist New America Foundation's Health Policy Program. Since the law contains dual mandates that most individuals must obtain health insurance coverage and most employers must offer it by 2014, \"the effect on employment is probably zero or close to it,\" said Amitabh Chandra, a professor of public policy at Harvard University. As McClatchy reported, the \"job-killing\" claim creatively used the \"lie of omission\" -- relying on \"out of date\" data or omitting \"offsetting information that would weaken the argument.\" The Congressional Budget Office, playing it straight, deemed it essentially too premature to measure what the effect the bill would have on the labor market. At the time, Speaker John Boehner dismissed the CBO, saying, \"CBO is entitled to their opinion.\" Perhaps, but lately, job growth in the health care industry has bucked the economic downturn and health care has remained a robust sector of employment. And it stands to reason that enrolling another 30 million Americans into health insurance will increase the demand for health care services and products, which in turn should trigger the creation of more jobs. Is there a downside? Sure. More demand, and greater labor costs, could push health care prices upward even as other effects of health reform push them down. But it's more likely that repealing the bill will have a negative impact on jobs than retaining it. The only thing more important than painting the Affordable Care Act as a certain killer of jobs was to paint it as a certain murderer of America's fiscal future. Surely this big government program was going to push indebtedness to such a height that our servitude to our future Chinese overlords was a fait accompli. As Ryan Grim reported in May of 2010, the CBO disagreed: Comprehensive health care reform will cost the federal government $940 billion over a ten-year period, but will increase revenue and cut other costs by a greater amount, leading to a reduction of $138 billion in the federal deficit over the same period, according to an analysis by the Congressional Budget Office, a Democratic source tells HuffPost. It will cut the deficit by $1.2 trillion over the second ten year period. The source said it also extends Medicare's solvency by at least nine years and reduces the rate of its growth by 1.4 percent, while closing the doughnut hole for seniors, meaning there will no longer be a gap in coverage of medication. Recently, the CBO updated its ten-year estimate by dropping off the first two years of the law (where there was little to no implementation) and adding two years at the back end (during which time there would be full implementation). As you might imagine, replacing two years of low numbers with two years of higher numbers increased the ten-year estimate. But opponents of the bill immediately freaked out and declared the costs to have skyrocketed. As Jonathan Chait reported: The outcry was so widespread that the CBO took the unusual step of releasing a second update to explain to outraged conservatives that they were completely misreading the whole thing: \"Some of the commentary on those reports has suggested that CBO and JCT have changed their estimates of the effects of the ACA to a significant degree. That's not our perspective. ... Although the latest projections extend the original ones by three years (corresponding to the shift in the regular ten-year projection period since the ACA was first being developed), the projections for each given year have changed little, on net, since March 2010.\" That is CBO-speak for: \"Go home. You people are all crazy.\" As Chait goes on to note, the CBO now projects that \"the law would reduce the deficit by slightly more than it had originally forecast.\" Normally, if you tell Republicans that you're going to cut $500 billion from Medicare, they will respond by saying, \"Hooray, but could we make it $700 billion?\" But the moment they got it into their heads that the Affordable Care Act would make that cut from Medicare, suddenly everyone from the party of ending Medicare As We Know It, Forever got all hot with concern about what would happen to these longstanding recipients of government health care. In fairness, as Factcheck pointed out, the GOP opponents of Obama's plan were simply picking up a cudgel that had recently been wielded by the president himself: Whether these are \"cuts\" or much-needed \"savings\" depends on the political expedience of the moment, it seems. When Republican Sen. John McCain, then a presidential candidate, proposed similar reductions to pay for his health care plan, it was the Obama camp that attacked the Republican for cutting benefits. Nevertheless! Whatever you want to call them, it's a $500 billion reduction in the growth of future spending over 10 years, not a slashing of the current Medicare budget or benefits. It's true that those who get their coverage through Medicare Advantage's private plans (about 22 percent of Medicare enrollees) would see fewer add-on benefits; the bill aims to reduce the heftier payments made by the government to Medicare Advantage plans, compared with regular fee-for-service Medicare. The New England Journal of Medicine concurred: A phased elimination of the substantial overpayments to Medicare Advantage plans, which now enroll nearly 25% of Medicare beneficiaries, will produce an estimated $132 billion in savings over 10 years. [...] The ACA also produces nearly $200 billion in savings by assuming that providers can improve their productivity as firms in other industries have done. On the basis of this presumed improvement, the law reduces Medicare's annual \"market basket\" updates for most types of providers - a provision that has generated controversy. The law doesn't cut any customer benefits, just the amount that providers get paid. Hospitals and drug companies agreed to these cuts based on the calculation that more people with insurance meant more people consuming what they sell and, more importantly for the hospitals, fewer people getting treated and simply not paying for it. This lie was launched to prominence with the help of a false accuser, South Carolina Rep. Joe Wilson, who famously heckled President Barack Obama during an address to a Joint Session of Congress by yelling \"You lie!\" after the president had mentioned that undocumented immigrants would not be eligible for the credits for the bill's proposed health care exchanges. As Time's Michael Scherer pointed out, this was not much of a challenge for factcheckers: In the Senate Finance Committee's working framework for a health plan, which Obama's speech seemed most to mimic, there is the line, \"No illegal immigrants will benefit from the health care tax credits.\" Similarly, the major health-care-reform bill to pass out of committee in the House, H.R. 3200, contains Section 246, which is called \"NO FEDERAL PAYMENT FOR UNDOCUMENTED ALIENS.\" In fact, as Ezra Klein pointed out, the Affordable Care Act \"goes out of its way to exclude\" undocumented immigrants: As the AP points out...there are about 7 million unauthorized immigrants who will be prohibited from buying insurance on the newly created exchanges, even if they pay out of their own pocket. And the exclusion of this group from health reform -- along with other restrictions that affect fully legal immigrants as well -- could create a massive coverage gap that puts a strain on the rest of the health system as well. Klein goes on to add that \"immigrants-rights advocates tried to prevent this scenario from happening,\" but they ended up losing to the politics of the day. The concession they won was a promise from the president that he would shepherd a comprehensive immigration reform package through the legislature. They lost that round, too. Were health care policies dear to Republicans left out of the health care reform bill? Totally! Unless we're counting the following: --Deficit-neutral bill --Longterm cost reduction --Interstate competition that allows consumers to purchase insurance across state lines --Medical malpractice reform --High-risk pools --An extension of the time young people were allowed to remain on their parents' policies --No public money for abortion --Small business exemptions/tax credits --Job wellness programs --Delivery system reform In fact, the Democrats were eager to get GOP input and enthusiastic about including many of their desired components in the bill. Oh, and did we mention that the Affordable Care Act was modeled on a reform designed and implemented by a former Republican governor and presidential candidate, whose innovation was widely celebrated by the GOP while said former governor was running for president? And did we mention that the individual mandate that was used in Romneycare to ensure \"no free riders\" was originally dreamed up by the Heritage Foundation? And did we add that additional DNA of the Affordable Care Act was borrowed from the Senate GOP alternative to the Clinton plan in the 1990s and the 2009 Bipartisan Policy Committee plan, which was endorsed by Tom Daschle, Howard Baker, and Bob Dole? As for the process, you might recall that the White House very patiently waited for the bipartisan Gang Of Six to weigh in with its own solution, and openly courted one Republican gang member, Sen. Chuck Grassley, long after it was clear to every reporter inside the Beltway that Grassley was intentionally acting in bad faith. And perhaps you don't recall the bipartisan health care summit that was held in March of 2009? if so, don't feel bad about it -- RNC Chairman Michael Steele couldn't remember it either, when he yelled at the president for not having one. So, here's a fun little story about obscure parliamentary procedures. In May of 2010, as the health care reform michegas was steaming toward its endgame, it looked like the measure might fall. The Senate had passed a bill, but the House was stuck in a bit of a jam. It had no other choice but to take a vote on the Senate's bill, because if the House bill ended up in a conference committee to be reconciled with the Senate's, the whole resulting she-bang was assured of a filibuster, as the Democrats had, in the intervening period, lost their Senate supermajority. But the House had a problem. As I wrote at the time: House members are averse to doing anything that looks like they approve of the various side-deals that were made in the Senate -- like the so-called \"Cornhusker Kickback.\" The House intends to remove those unpopular features in budget reconciliation, but if they pursue budget reconciliation on a standard legislative timeline -- where they pass the Senate bill outright first and then go back to pass a reconciliation package of fixes -- they'd still appear to be endorsing the sketchy side deals, and then the GOP would jump up and down on their heads. Enter \"deem and pass.\" Under this process, the House will simply skip to approving the reconciliation fixes, and \"deem\" the Senate bill to be passed. By doing it this way, the Democrats get the Senate bill passed while simultaneously coming out against the unpopular features of the same. \"Deem and pass\" is the aforementioned obscure parliamentary procedure. And here's the thing about obscure parliamentary procedures -- everyone loves them when their side is doing them, but when they're being done to you, then they are basically evil schemes from the blasted plains of Hell. So if you're guessing that the Republicans declared the Democrats' use of \"deem and pass\" -- which also carried the moniker \"the Slaughter Rule,\" after Rep. Louise Slaughter, who proposed its use in this instance -- to be a monstrous and unprecedented abuse of power, then give yourself a prize! And give yourself a bonus if you guessed that in reality, the GOP had used \"deem and pass\" lots of times. As Ryan Grim reported, \"deeming resolutions\" had been in use dating back to 1933, and in 2005 and 2006, Republicans employed them 36 times. Other Republicans complained that Slaughter was supporting a tactic that she once vigorously opposed. That's true! She fought the \"deem and pass\" during the Bush administration and lost. Which is precisely when she learned how effective it could be! Lots of people wouldn't mind having better access to more affordable health care. But what if it came with thousands of IRS agents, picking through your stool sample? That sounds pretty bad. It also sounds pretty implausible! But that was no impediment to multiple health care reform opponents making claims that the tax man was COMMINAGETCHA! In this case, the individual mandate -- which requires people to purchase insurance or incur a tax penalty -- provided the fertile soil for this deception to spread. A March 2010 floor speech from a panicked Sen. John Ensign was typical of the genre: My amendment goes to the heart of one of the problems with this bill. There is an individual mandate that puts fines on people that can also attach civil penalties. And 16,500 new IRS agents are going to be required to be hired because of the health care reform bill. March of 2010 was a pretty great time for this particular lie. In one five day period, Ensign was joined by Reps. Paul Ryan (\"There is an individual mandate. It mandates individuals purchase government-approved health insurance or face a fine to be collected by the IRS which will need $10 billion additional and 16,500 new IRS agents to police and enforce this mandate.\"), Pete Sessions (\"16,000 new IRS agents will be hired simply to make sure that this health care bill is enforced.\") and Cliff Stearns (\"There is $10 billion to hire about 16,000 new IRS agents to enforce the individual mandate on every American\"). All wrong! Per Factcheck: This wildly inaccurate claim started as an inflated, partisan assertion that 16,500 new IRS employees might be required to administer the new law. That devolved quickly into a claim, made by some Republican lawmakers, that 16,500 IRS \"agents\" would be required. Republican Rep. Ron Paul of Texas even claimed in a televised interview that all 16,500 would be carrying guns. None of those claims is true. The IRS' main job under the new law isn't to enforce penalties. Its first task is to inform many small-business owners of a new tax credit that the new law grants them -- starting this year -- which will pay up to 35 percent of the employer's contribution toward their workers' health insurance. And in 2014 the IRS will also be administering additional subsidies -- in the form of refundable tax credits -- to help millions of low- and middle-income individuals buy health insurance. The law does make individuals subject to a tax, starting in 2014, if they fail to obtain health insurance coverage. But IRS Commissioner Douglas Shulman testified before a hearing of the House Ways and Means Committee March 25 that the IRS won't be auditing individuals to certify that they have obtained health insurance. As Factcheck goes on to note, on page 131 of the bill that was passed, the IRS is explicitly prohibited from \"from using the liens and levies commonly used to collect money owed by delinquent taxpayers, and rules out any criminal penalties for individuals who refuse to pay the tax or those who don't obtain coverage.\" Oh, Congresscritters, the poor dears! So many bills to read and so little time -- between raising campaign cash at lush fundraisers and receiving marching orders from powerful corporate interests -- to actually read them all. And this Affordable Care Act was a real humdinger of a long bill. And long bills are bad because length implies complication and complication requires study and study implies some form of \"work.\" So the proper thing to do is to mulch the entire print run of the bill and use it to power the boiler that heats the \"sex dungeon\" in the Longworth Office Building, the end! Actually, reading the bill is not that hard, despite the complaints. As the folks at Computational Legal Studies were able to divine: Those versed in the typesetting practices of the United States Congress know that the printed version of a bill contains a significant amount of whitespace including non-trivial space between lines, large headers and margins, an embedded table of contents, and large font. For example, consider page 12 of the printed version of H.R. 3962. This page contains fewer than 150 substantive words. We believe a simple page count vastly overstates the actual length of bill. Rather than use page counts, we counted the number of words contained in the bill and compared these counts to the number of words in the existing United States Code. In addition, we consider the number of text blocks in the bill -- where a text block is a unit of text under a section, subsection, clause, or sub-clause. As HuffPost noted in March of 2010, \"the total number of words in the House Health Reform Bill are 363,086,\" and when you throw out the words in the titles and tables of contents and whatnot, leaving only words that \"impact substantive law,\" the word count drops to 234,812. \"Harry Potter And the Order Of The Phoenix,\" a popular book read by small children, is 257,000 words long. (Although in fairness to Congress, the Affordable Care Act contains very few exciting accounts of Quidditch matches.) We couldn't have a list of Affordable Care Act distortions without noting the ways some of your 2012ers have added to the canon. Herman Cain said that if the ACA had been implemented, he'd be dead. Not likely! The new law expands coverage so that uninsured individuals who face what Cain faced (cancer) have a better chance of getting coverage, and it restricts insurers from tossing cancer patients off the rolls based on their \"pre-existing condition.\" But more to the point, Cain would have always been the wealthy guy who could afford to choose his doctor and pick the care he wanted. The Affordable Care Act doesn't prohibit wealthy people from spending money. Rick Santorum says that his daughter, who is diagnosed with a genetic disorder called trisomy 18 and who required special needs care, would be \"denied care\" under the Affordable Care Act. Nope! Again, the law restricts insurers from throwing people with pre-existing conditions off their rolls. And for individuals under 19, that went into effect in September of 2010. Michele Bachmann believes that the Affordable Care Act would open \"sex clinics\" in public schools. This is Michele Bachmann we're talking about. Do you even need to ask? And finally, Mitt Romney has said, as recently as March 5, that he never intended his CommonwealthCare reform to serve as a \"model for the nation.\" \"Very early on,\" he insisted, \"we were asked -- is what you've done in Massachusetts something you would have the entire government do, the federal government do? I said no, from the very beginning.\" Unless \"very early on\" and \"from the very beginning\" mean something different from the conventional definition of those phrases, Romney should augment his daily pharmaceutical intake with some memory-enhancing gingko biloba. Obviously, we did what we could to include as many of these lies and distortions as possible, but there's no way to include them all. If you're a completist, however, be sure to check out the Impossible Tale Of The One-Dollar Abortion, the Story of the State-Based Inflexibility That Wasn't, The Curious Case of the Politically Connected Waivers and Nancy Drew And The Hidden $105 Billion Expenditure.  Share", "external_links": [], "published": "2015-06-11T22:03:00.000+03:00", "crawled": "2015-06-11T22:21:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}