{"organizations": [], "uuid": "cb41b34e9db320bf5a8a91ddbd76a8d43fddeebd", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/william-bradley/headshot.jpg", "site_section": "http://www.huffingtonpost.com/tag/russia/feed", "section_title": "Russia on Huffington Post", "url": "http://www.huffingtonpost.com/william-bradley/jurassic-politics-hillary_b_7605700.html", "country": "US", "title": "William Bradley: Jurassic Politics: Hillary, Invoking FDR, Runs Left of Obama While Jeb Bush Does Straight Remake", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "William Bradley: Jurassic Politics: Hillary, Invoking FDR, Runs Left of Obama While Jeb Bush Does Straight Remake", "spam_score": 0.0, "site_type": "news", "published": "2015-06-17T17:16:00.000+03:00", "replies_count": 0, "uuid": "cb41b34e9db320bf5a8a91ddbd76a8d43fddeebd"}, "author": "William Bradley", "url": "http://www.huffingtonpost.com/william-bradley/jurassic-politics-hillary_b_7605700.html", "ord_in_thread": 0, "title": "William Bradley: Jurassic Politics: Hillary, Invoking FDR, Runs Left of Obama While Jeb Bush Does Straight Remake", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nIs there a certain synchronicity at work with Hillary Clinton and Jeb Bush staging their big formal campaign openings just as Jurassic World oddly enjoys the biggest opening weekend of all time with its recycled plot (albeit with new bells and whistles) about the dangerous majesty of rampaging dinosaurs? It has to be. \nHillary, at least, even as she invokes the ancient by today's amnesiac ADD standard Franklin D. Roosevelt, is running on a new storyline. Jeb Bush, that's J.E. Bush or Bush III, in contrast offers up a rehash even more thinly veiled than that of the gauzy dino extravaganza. \nFormer Secretary of State Hillary Clinton's full address on Roosevelt Island in New York's East River. \nWhile Jurassic World 's showing was foreseen by no one, the Clinton and Bush revivals have long been expected. Of the two, Hillary is by far in the best shape to end up in the general election and win the White House, despite her own problems, incessant attacks, and the hyper-partisan nature of the times reducing her once towering seeming popularity. She's well in command as Democratic frontrunner, and her assured performance over the weekend -- and the generally positive reaction to it -- only confirms that. \nJeb Bush, in contrast, has dropped from being the presumed GOP frontrunner to just one of the pack. He may yet prevail, but he has a lot of nasty bumper car scrapes ahead. \nAfter losing his narrow lead in the GOP primary fight, Bush has seemed more than a bit lost. Infamously taking a week, and five different shots at the question on different occasions to finally move off his position of support for his brother's disastrous invasion of Iraq, a horrible general election problem for him, Bush has struggled to be right-wing enough for his right-wing party in the primaries without becoming totally unelectable in November 2016. \n\"They have offered a progressive agenda that includes everything but progress. They are responsible for the slowest economic recovery ever, the biggest debt increases ever, a massive tax increase on the middle class, the relentless buildup of the regulatory state, and the swift, mindless drawdown of a military that was generations in the making.\" \nJeb Bush \nHis formal announcement of a candidacy already long underway Monday at Miami Dade College was thus a very important speech for his positioning. But it proved to be such thin gruel that positioning is most all it was. \nWhile, as Jerry Brown said, a little vagueness goes a long way in this business, Bush's supposed big speech was too thin. He attacked liberals and Hillary by name, and of course Barack Obama, intriguingly going so far as to criticize Obama for criticizing the Crusades, one of a few Jeb dog whistles for the far right. But burned by his utter fumbling on the Iraq War, he was pretty vague about geopolitics, though he promised his would be more muscular than Obama's already far-flung conflicts. \nFormer Florida Governor Jeb Bush's full address at Miami Dade College. \nIn an inapt phrase, he did say the Dems are leading us to \"military inferiority.\" Since we spend more on our armed forces than the next seven nations combined, Bush presumably anticipates fighting most of the world. Or maybe he just needs better writing. \nBush did score the uneven and anemic economic recovery from the near-Depression his brother bequeathed Obama. JEB promised four percent economic growth per year. How do we get that? By cutting environmental and other government regulations, naturally, and \"tax reform.\" \nIt wasn't an embarrassing speech, but it wasn't much. \nBush preceded it with a trip last week to Germany, Poland, and Estonia, where he impressed some Europeans by being the first Republican presidential candidate in a while not to stumble there. He talked up a big new Russian threat, of course, following in the unremembered footsteps of his father. As CIA director, George H.W. Bush enshrined the massive \"Team B\" hyping of the Soviet threat over the assessments of regular CIA analysts who served under Richard Nixon. And as president, Bush I completely misread the impact of the Gorbachev reforms, and was thus surprised by the fast collapse of the Soviet empire. \nHillary set up a vivid contrast to all this with a well-executed, much re-written (evidently mostly by the candidate herself), big rally speech at a colorful and historically resonant venue. It's been clear for some time that she's running to the left of Obama, which is ironic since he won the nomination in 2008 by running to her left. \nHer support for the Iraq War (Obama's key in '08)? A mistake, she says, she wouldn't do it again. Backing for increasingly secret trade deals? That would be no. \n\"You know, President Roosevelt's Four Freedoms are a testament to our nation's unmatched aspirations and a reminder of our unfinished work at home and abroad. His legacy lifted up a nation and inspired presidents who followed. One is the man I served as Secretary of State, Barack Obama, (cheers, applause) and another is my husband, Bill Clinton. (Cheers, applause.) \n\"Two Democrats guided by the -- (cheering) Oh, that will make him so happy. They were and are two Democrats guided by the fundamental American belief that real and lasting prosperity must be built by all and shared by all. (Cheers, applause.) \n\"President Roosevelt called on every American to do his or her part, and every American answered. He said there's no mystery about what it takes to build a strong and prosperous America: \"Equality of opportunity... Jobs for those who can work... Security for those who need it... The ending of special privilege for the few...(cheers, applause.) The preservation of civil liberties for all... (cheers, applause) a wider and constantly rising standard of living.\" \n\"That still sounds good to me. (Cheers, applause.) \n\"It's America's basic bargain. If you do your part you ought to be able to get ahead. And when everybody does their part, America gets ahead too. ... \n\"But, it's not 1941, or 1993, or even 2009. We face new challenges in our economy and our democracy. We're still working our way back from a crisis that happened because time-tested values were replaced by false promises. \n\"Instead of an economy built by every American, for every American, we were told that if we let those at the top pay lower taxes and bend the rules, their success would trickle down to everyone else.\" (Jeers, booing.) \nHillary Clinton \nIt's a recognition on her part that the center of gravity in the Democratic Party of this hyper-partisan era has shifted left, not to mention the not infrequently harsh realities of today's financialized transnational capitalism. You can't retrain folks -- a shibboleth of the old New Democrat approach -- for good new jobs that don't exist because the money mavens have chosen to sit on their capital or run it offshore. \nWhile John Ellis Bush tries to push forward with a vague sort of mush in a Republican Party that is more right-wing than the Dems are left-wing, Hillary is moving ahead with a more updated sort of Jurassic politics. There's a nostalgia factor for the best of the old Bill Clinton days -- and wouldn't it be fascinating to see what that protean figure would do now, but for that FDR-inspired term limits amendment? -- but the former secretary of state, U.S. senator, and first lady is running on her own newish hook. \nIt may be more interesting than fascinating, and I'm not scintillated by dinosaur epics after seeing the first three back in the day, but maybe Hillary will turn out to be Captain Marvel, after all. The role hasn't been cast yet ... \nFacebook comments are closed on this article. \nWilliam Bradley Archive More:", "external_links": [], "published": "2015-06-17T17:16:00.000+03:00", "crawled": "2015-06-17T21:38:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}