{"organizations": ["House"], "uuid": "c1169214bf8ef27d6105433d66795c29c5c66737", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/kingsteve_051613gn_0.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/243965-house-votes-to-prevent-obama-from-defending-immigration-actions-in-court", "country": "", "title": "House votes to block Obama from defending immigration actions in court | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "House votes to block Obama from defending immigration actions in court | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-04T02:22:00.000+03:00", "replies_count": 0, "uuid": "c1169214bf8ef27d6105433d66795c29c5c66737"}, "author": "", "url": "http://thehill.com/policy/finance/243965-house-votes-to-prevent-obama-from-defending-immigration-actions-in-court", "ord_in_thread": 0, "title": "House votes to block Obama from defending immigration actions in court | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Greg Nash", "Cristina Marcos", "Obama"], "text": "House votes to block Obama from defending immigration actions in court Greg Nash By Cristina Marcos - 06/03/15 06:42 PM EDT \nThe House on Wednesday endorsed a proposal to block the Obama administration from further pursuing its legal defense of the president’s executive actions to shield illegal immigrants from deportation. \nRep. Steve King’s (R-Iowa) amendment to the annual funding bill for the Justice Department passed on a party-line 222-204 vote. Nineteen Republicans voted with all Democrats in opposition. \nKing, one of the most vocal opponents of illegal immigration, said his amendment would prevent the Obama administration from using taxpayer dollars to defend what he described as its “unconstitutional executive amnesty position.” ADVERTISEMENT “A lot of money has been spent and wasted in an attempt to, let’s say — the gracious way to say it would be to stretch the Constitution beyond any bounds that it had been stretched before,” King said.\nA Texas district court judge in February issued a preliminary injunction to temporarily freeze the immigration executive actions announced by President Obama after the November midterm elections. \nLast week, a three-judge panel from the 5th Circuit Court of Appeals denied the Obama administration an emergency request to lift the hold on the executive actions. The court will hear oral arguments in July in New Orleans to appeal the Texas judge’s decision. \nDemocrats dismissed King’s proposal as circumventing due process. Rep. Chaka Fattah (D-Pa.), the top Democrat on the House Appropriations subcommittee overseeing the Justice Department, maintained that President Obama acted within his constitutional authority. \n“It is unfair for us to deny the executive branch an opportunity to put forth its arguments in court,” Fattah said. \nThe Pennsylvania Democrat noted that the legal process takes time, saying, “the wheels of justice grind slowly.” \nKing offered a second amendment, adopted by voice vote, that would prohibit the use of funds to negotiate immigrant visas as part of a trade agreement. The wide-ranging appropriations measure also includes funding for the Commerce Department. \nObama administration officials and the House Ways and Means Committee have maintained that the Asia-Pacific trade deal would not impact U.S. immigration policy. King maintained that his amendment should consequently be easy for supporters of President Obama’s trade agenda to endorse. \n“It has been an important issue to maintain the separation of immigration policy and the Congress from the executive branch negotiations in trade,” King said. \nFattah suggested prohibiting discussion of a topic over the course of international trade negotiations would be unrealistic. \n“I may not support what he negotiates, but to say you can’t even discuss something in a negotiation I think is unfortunate,” Fattah said. \nThe House is expected to take up legislation in the next few weeks to grant President Obama “fast-track” authority to negotiate trade deals by preventing Congress from amending them. \nWednesday’s votes marked the second time in recent weeks the House has voted on immigration policy. House Republicans stripped a provision in the annual defense authorization last month that would have edged toward allowing illegal immigrants to enlist in the military. \nThe 19 Republicans who voted against the amendment were primarily centrists and lawmakers who represent large Hispanic populations. \nThey were Reps. Mike Coffman (Colo.), Carlos Curbelo (Fla.), Jeff Denham (Calif.), Mario Diaz-Balart (Fla.), Bob Dold (Ill.), Dan Donovan (N.Y.), Chris Gibson (N.Y.), Richard Hanna (N.Y.), Joe Heck (Nev.), Bill Johnson (Ohio), David Jolly (Fla.), John Katko (N.Y.), Peter King (N.Y.), Tom MacArthur (N.J.), Martha McSally (Ariz.), Devin Nunes (Calif.), Ileana Ros-Lehtinen (Fla.), Elise Stefanik (N.Y.) and David Valadao (Calif.). Tags: ", "external_links": [], "published": "2015-06-04T02:22:00.000+03:00", "crawled": "2015-06-04T02:22:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}