{"organizations": [], "uuid": "d38e1fc7d26a0848bbb8f062d73b0b279a12d763", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/17/politics/trade-tpp-deal-obama-republicans/index.html", "country": "", "title": "Obama, GOP set to jam House Dems on trade - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama, GOP set to jam House Dems on trade - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "d38e1fc7d26a0848bbb8f062d73b0b279a12d763"}, "author": "", "url": "http://www.cnn.com/2015/06/17/politics/trade-tpp-deal-obama-republicans/index.html", "ord_in_thread": 0, "title": "Obama, GOP set to jam House Dems on trade - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Obama, GOP set to jam House Dems on trade Updated 0130 GMT (0830 HKT) June 18, 2015 JUST WATCHED Clinton: Obama should listen to Pelosi Washington (CNN) President Barack Obama and top Republican congressional leaders joined together Wednesday to make an all-out push to convince pro-trade Democrats in the House and Senate to resurrect his trade agenda. Legislation to help pave the way for a major trade deal with roughly a dozen countries was left in limbo after a massive block of House Democrats ignored a personal appeal from the President and voted down the trade package last Friday. The first step will come with a new vote on Thursday in the House on a standalone bill that would speed congressional approval of big trade deals. Multiple House Republicans told CNN they expect it to pass. In a series of hastily arranged meetings at the White House -- that included \"vigorous discussion,\" according to one attendee -- the President urged the pro-trade Democratic lawmakers to support a risky new legislative strategy GOP leaders on the Hill devised in a last ditch effort to pass both fast-track legislation and a bill to assist those workers who lose their jobs due to new trade agreements. RELATED: House Republicans moving forward with fast-track bill The GOP plan will require a series of votes in both chambers, beginning in the House Thursday. Instead of keeping two key trade bills together, it would separate a bill known as Trade Promotion Authority -- TPA -- which would streamline congressional approval of international trade deals, from Trade Adjustment Assistance -- TAA -- which provides financial aid and training to workers displaced by those trade deals. Until now, most Democrats backing new trade efforts have insisted they would oppose the fast-track authority unless the worker assistance piece -- opposed by most Republicans -- was linked to it. But the vast majority of progressive House Democrats, many of whom oppose big free trade bills, surprised the White House and GOP congressional leaders last week by voting against the worker assistance bill as a means to defeat the fast-track bill. So the White House teamed up with GOP leaders to devise a new legislative strategy that would ultimately deliver both bills to the President's desk. The strategy is to pass the fast-track bill first and force Democrats to pass the worker assistance bill they favor after -- or risk leaving the workers' assistance package behind. House Speaker John Boehner and Senate Majority Leader Mitch McConnell issued a rare joint statement vowing to meet the demands of those pro-trade Democrats that a displaced worker assistance package would be passed and signed into law. \"We are committed to ensuring both TPA and TAA get votes in the House and Senate and are sent to the President for his signature,\" said the statement from Boehner and McConnell. White House press secretary Josh Earnest said the President was on board. JUST WATCHED ", "external_links": [], "published": "2015-06-18T03:00:00.000+03:00", "crawled": "2015-06-18T04:07:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}