{"organizations": ["Fox News Latino Fox News Latino HAVANA"], "uuid": "f3662c09ad33337ef0431c2e980435b138b21d57", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/cuba%20interest%20section.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/17/obama-administration-close-to-announcing-opening-embassy-in-cuba-sources-say/", "country": "", "title": "Obama administration close to announcing opening of embassy in Cuba, sources say | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama administration close to announcing opening of embassy in Cuba, sources say | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "f3662c09ad33337ef0431c2e980435b138b21d57"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/06/17/obama-administration-close-to-announcing-opening-embassy-in-cuba-sources-say/", "ord_in_thread": 0, "title": "Obama administration close to announcing opening of embassy in Cuba, sources say | Fox News Latino", "locations": ["Cuba", "U.S.", "Havana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Fidel Castro", "Jorge", "Obama"], "text": "Fox News Latino HAVANA - MAY 14: Cuban demonstrators march in front of the U.S. Interest Section May 14, 2004 in Havana. Cuban leader Fidel Castro led the massive protest against new U.S. moves aimed at speeding the end of his communist rule, and raised the prospect of a feared U.S. invasion. (Photo by Jorge Rey/Getty Images) 2004 Getty Images \nU.S. and Cuba may be just weeks away from reopening embassies on each other’s soil, say multiple sources. \n“My impression is that all major issues have been resolved, there are still some logistical issues, but there will be an announcement to reopen the embassy in the next week or two,” said William LeoGrande, a professor of government at the American University School of Public Affairs and a former staff member of the U.S. Senate Democratic Policy Committee. \nLeoGrande, author of “Back Channel to Cuba: The Hidden History of Negotiations between Washington and Havana,” said he couldn’t elaborate further, but that he got the information regarding the time frame for reopening the embassies “from some pretty reliable sources.” \nHe said that there are some complicating factors at the moment that could delay – but not doom – the move, which would be a major step toward normalizing relations between the two long-time adversaries. \nThe announcement would pave the way for Kerry to travel to the island for a ceremony that would include a flag-raising and upgrading of the building that now is the U.S. Interests Section into a complete embassy, according to Reuters. \nThe administration would notify Congress of the reopening two weeks before the event. \nSecretary of State John Kerry, LeoGrande said, “wants to go to Havana to lead that ceremony, but he’ll be busy until June 30th with the Iranian [nuclear program] negotiations.” \n“Depending on what happens with those, a trip to Havana might have to be delayed,” he said. \nKerry recently promised to be \"absolutely, totally and fully engaged\" in nuclear negotiations with Iran, saying he remained confident the June 30 timetable for completing a deal could be achieved. \nHe said he expected to travel overseas to join in the discussions later in the month as they neared a critical juncture. \nKerry’s recently broken leg may also be an issue in his ability to travel extensively, the professor said. He was released from the hospital in recent days after breaking a femur on May 31 when he fell while bike-riding in the French Alps. \nNegotiators from both the U.S. and Cuban governments have met for months to discuss such things as trade, travel as well as more sensitive issues such as human rights in Cuba and U.S. fugitives who have been given refuge on the island. \n“In some cases they have agreed to disagree,” LeoGrande said. “But in others they have reached compromises.” \nSen. Jeff Flake, a key Republican advocate of better ties, met with Cuba's foreign minister Bruno Rodriguez and First Vice President Miguel Diaz-Canel over the weekend and told The Associated Press that an embassy opening date is \"imminent.\" \nReuters also reported in recent days that the Obama administration is preparing to announce in early July an agreement with Cuba to reopen embassies. Reuters cited “U.S. sources familiar with the matter,” but did not name them. \nWhile the president has power over establishing embassies, nominations for ambassador must go through a Senate confirmation vote. Sen. Marco Rubio, a Florida Republican and member of the Senate Foreign Relations Committee, has vowed to block any vote relating to U.S.-Cuba embassies. \nThat would not stop the reopening of the embassies, which would, in such a case, be headed by a \"mission chief\" instead of \"ambassador.\" The duties, however, would be largely similar, LeoGrande said. \nYet, even as observers say a deal is imminent, a half year later the two governments have not taken the important but symbolic step of turning their \"interests\" offices into formal embassies in Havana and Washington. \n\"It shows you the complexity of this process,\" said Jesus Arboleya, a political scientist and former Cuban diplomat in Washington. \"If the first step has taken this much time, imagine the conflicts that can develop after it gets started.\" \nThe issues on the table after the embassies open are far more complicated. They include talks on human rights; demands for compensation for confiscated American properties in Havana and damages to Cuba from the embargo; and possible cooperation on law enforcement that includes the touchy topic of U.S. fugitives being sheltered in Havana. \nAnother sticking point is how much freedom U.S. diplomats would have to travel around Cuba. One concern Cuban officials had, LeoGrande said, was the support U.S. embassy staffers would give to dissidents. \nHe said one possible compromise would be to allow U.S. officials to meet with dissidents without restraint, as was once the case before the rules were tightened. \nPlenty of people and groups oppose any U.S.-Cuba warming, including some dissidents on the island, anti-Castro Cuban-Americans and some members of Congress who believe the new policy essentially rewards Communist leaders for decades of human rights abuses. Presidential Republican candidates like Rubio, the son of Cuban immigrants, and former Florida Gov. Jeb Bush of Florida have both come out firmly against rapprochement. \nBut polls say detente has strong public backing in both countries, leading many to believe the process is irreversible. \n\"Even if it takes a while, for whatever reason, the embassy will open and relations will be re-established,\" said David Fuentes, a parking lot attendant in Havana. \"It just seems inevitable to me.\" \nThe Associated Press contributed to this report. \nElizabeth Llorente can be reached at elizabeth.llorente@foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \nLike us on Facebook ", "external_links": [], "published": "2015-06-18T03:00:00.000+03:00", "crawled": "2015-06-18T17:39:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}