{"organizations": ["Heavy-Duty Trucks Obama Administration"], "uuid": "f298c49517ad282d7e1768e862e639d7e3a51f38", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3095140/images/o-TRACTOR-TRAILERS-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/19/emission-standards-trucks_n_7622600.html", "country": "", "title": "Obama Administration Proposes New Emission Standards For Heavy-Duty Trucks", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Administration Proposes New Emission Standards For Heavy-Duty Trucks", "spam_score": 0.0, "site_type": "news", "published": "2015-06-20T00:40:00.000+03:00", "replies_count": 0, "uuid": "f298c49517ad282d7e1768e862e639d7e3a51f38"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/19/emission-standards-trucks_n_7622600.html", "ord_in_thread": 0, "title": "Obama Administration Proposes New Emission Standards For Heavy-Duty Trucks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama", "Sullivan"], "text": "Obama Administration Proposes New Emission Standards For Heavy-Duty Trucks Posted: Updated: 3 hours ago The Obama administration announced on Friday new proposed rules on emissions from medium- and heavy-duty vehicles. (AP Photo/Pat Sullivan) | ASSOCIATED PRESS reddit \nWASHINGTON -- The Environmental Protection Agency and the Department of Transportation’s National Highway Traffic Safety Administration announced new performance standards on Friday for heavy- and medium-duty trucks and tractor-trailers, a proposal they say will cut emissions by 1 billion metric tons and reduce oil use by 1.8 billion barrels. \nThe Obama administration previously announced rules for cars and light-duty trucks, and earlier this month announced it is moving toward addressing emissions from commercial airplanes . Medium- and heavy-duty trucks currently account for about 20 percent of the energy use and also 20 percent of greenhouse gas emissions in the transportation sector, the EPA said, even though the trucks account for only about 5 percent of vehicles on the road. \nAddressing vehicle pollution \"has been a top priority for this administration,\" NHTSA Administrator Mark Rosekind said in a call with reporters Friday, and \"cutting oil use is critical to our economic well-being and national security.\" \nThe proposed rules apply to model years 2021 to 2027 and will require efficiency improvements across different types of vehicles such as buses, tractor-trailers, and large vans and trucks. The agencies are also proposing efficiency standards for trailers that would begin in 2018. While the expected improvements in efficiency vary by vehicle type, the agencies said they anticipate a 24 percent reduction in emissions from the tractor portion of tractor-trailers and an 8 percent reduction for the trailer portion. The administration plans to finalize the proposed rules in 2016. \nJanet McCabe, acting assistant administrator for EPA’s Office of Air and Radiation, said the improvements can be attained through upgrades to combustion engines, improved aerodynamics and changes to tires. \nRosekind estimated the proposed efficiency improvements would allow vehicle operators to recoup the costs in fuel savings in less than two years. The improvements would cost about $25 billion, he said, but would save about $270 billion over the lifetime of the vehicles, according to the agencies' estimates. \nThe agencies predict that the measure will save average Americans $150 a year if the operators of heavy vehicles pass fuel savings onto customers. \nSeveral spokesmen for the Heavy Duty Fuel Efficiency Leadership Group, which represents an alliance of the major trucking companies, praised the announcement. “The rule, which was developed through a collaborative effort with agencies and industry partners, builds on the emissions reductions and fuel efficiency gains that the Phase I standards helped make possible,\" said Tom Linebarger, chairman and CEO of Cummins Inc. \"We look forward to the process of finalizing these new standards.\" \nSara Chieffo, vice president for government affairs at the League of Conservation Voters, also celebrated the announcement, noting that it \"marks another important step in the Obama administration’s plan to curb carbon pollution and combat climate change.\" Also on The Huffington Post Close Landmarks That Climate Change Could Ruin of   Jamestown, the birth of a nation 400 years ago. The ships Discovery, (L), and the Susan Constant, (R), are moored to a pier at Jamestown settlement in Jamestown, Virginia on April 6, 2007. (MANNIE GARCIA/AFP/Getty Images) View of the Little Blackwater River, inside the new Harriet Tubman Underground Railroad National Monument in Cambridge, Md. Bob Seger, right, and Nicki Seger, take a walk to the historic Fort Monroe, on Thursday, Sept 15, 2011 in Hampton, Va. The U.S. Army handed over responsibility on Thursday for managing historic Fort Monroe to Virginia, which wants to turn much of the fort's valuable land at the mouth of the Chesapeake Bay into a national park. (AP Photo/The Virginian-Pilot, L. Todd Spencer) This photo provided by NASA the Atlas V rocket carrying the Mars Atmosphere and Volatile Evolution (MAVEN) spacecraft sits at the launch pad at Florida's Cape Canaveral Air Force Station after rolling out from Space Launch Complex 41 on Saturday, Nov. 16, 2013. (AP Photo/NASA) The Statue of Liberty is pictured in New York, on May 14, 2014. The statue, designed by Frederic Auguste Bartholdi and dedicated on October 28, 1886, was a gift to the U.S. from the people of France. (JEWEL SAMAD/AFP/Getty Images) A boat carrying tourists arrives at Ellis Island after it was re-opened to the public on October 28, 2013 in New York City. (Photo by John Moore/Getty Images) The Los Angeles Aqueduct carries water from the snowcapped Sierra Nevada Mountains, which carry less snow than normal, to major urban areas of southern California on May 9, 2008 near Lone Pine, California. (Photo by David McNew/Getty Images)  Share ", "external_links": [], "published": "2015-06-20T00:40:00.000+03:00", "crawled": "2015-06-20T00:44:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}