{"organizations": [], "uuid": "097ba0f1d24b4750405c6796f999f45637a976df", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3109534/images/o-SCOTT-WALKER-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/23/scott-walker-abortion_n_7648740.html", "country": "", "title": "Scott Walker Reportedly Requested 20-Week Abortion Ban Without Exceptions For Rape, Incest", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Scott Walker Reportedly Requested 20-Week Abortion Ban Without Exceptions For Rape, Incest", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T01:26:00.000+03:00", "replies_count": 0, "uuid": "097ba0f1d24b4750405c6796f999f45637a976df"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/23/scott-walker-abortion_n_7648740.html", "ord_in_thread": 0, "title": "Scott Walker Reportedly Requested 20-Week Abortion Ban Without Exceptions For Rape, Incest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scott Walker"], "text": "\nAfter declining to say whether he would support a 20-week abortion ban during the 2014 election, Wisconsin Gov. Scott Walker (R) specifically requested that state legislators send such a bill to his desk without exceptions for cases of rape and incest, according to a report by The New York Times . \nWisconsin Senate Majority Leader Scott Fitzgerald (R) told the Times that Walker met with him and Robin Vos, the Republican state Assembly speaker, and told them he wanted to see a 20-week abortion ban on his desk that did not contain exceptions for rape or incest victims. \n“It sent a message to us,\" Fitzgerald said of the meeting. \nThe state Senate passed a 20-week ban without exceptions earlier this month, and Walker told reporters that he would sign it . \n“I think for most people who are concerned about that, it’s in the initial months when they are most concerned about it,” said the 2016 presidential hopeful. “In this case, it’s an unborn life, it’s an unborn child, that’s why we feel strongly about it. I’m prepared to sign it either way they send it to us.” \nLaurel Patrick, a spokesperson for Walker, confirmed the New York Times report in a statement to the Huffington Post. \n\"Governor Walker meets regularly with legislative leaders of both parties, as well as other legislators of both parties on topics of importance to them,\" she said. \"It is fairly common for Governor Walker to call for legislative action on issues that fall within his priorities. This includes his call for legislation banning abortions after 20 weeks. As Governor Walker has said publicly, he plans to sign this bill when it gets to his desk.\" \nIf Walker signs the bill, it will likely face a court challenge. The Supreme Court decided in Roe v. Wade in 1973 that states cannot ban abortions before the fetus would be viable outside the womb, which is estimated to occur between 22 to 24 weeks of pregnancy. A federal appeals court struck down Idaho's 20-week ban earlier this year, ruling it \"unconstitutional because it categorically bans some abortions before viability.\" \nThis story has been updated with a comment from Laurel Patrick. Also on HuffPost: ", "external_links": [], "published": "2015-06-24T01:26:00.000+03:00", "crawled": "2015-06-24T01:31:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}