{"organizations": ["CNN"], "uuid": "6934ae4d905f8a8d75fe3a8b6cfd3b7aa137aeaf", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/06/10/WE01219225/3617787/Obamaoutlinedthestateofhealthcar-3617787_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1248274", "country": "", "title": "Obama outlined the state of health care in America - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama outlined the state of health care in America - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "6934ae4d905f8a8d75fe3a8b6cfd3b7aa137aeaf"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1248274", "ord_in_thread": 0, "title": "Obama outlined the state of health care in America - CNN iReport", "locations": ["America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama outlined the state of health care in America By 66ivan | Posted 17 hours ago \nCNN PRODUCER NOTE President Obama outlined the state of health care in America, now that the Affordable Care Act has become part of the fabric of our health care system. In it, he told the story of Debra Lea Oren of Palmer, Pennsylvania. Debra, who suffers from osteoarthritis so severe it put her in a wheelchair, couldn’t walk or stand for years. She was in constant pain. President Obama said, “I don’t know whether this is appropriate, but I just told Sister Carol I love her. (Laughter.) On a big stage. It is true, though — I do. She is just wonderful. Her dedication to doing God’s work here on Earth, her commitment to serving “the least of these,” here steadiness, her strength, her steadfast voice have been an inspiration to me. We would not have gotten the Affordable Care Act done had it not been for her. I want to thank the entire Catholic Health Association for the incredible work you do. And it’s true, I just love nuns, generally. It is an honor to join you on your 100th anniversary of bringing hope and healing to so many. I want to acknowledge Dignity Health and its CEO, Lloyd Dean — (applause) — honored by the Catholic Health Association last night for his outstanding support of our efforts to improve health care in America. He has been a great friend. I want to thank Ascension Health, a great provider of care — that also recently raised its minimum wage.I want to thank Secretary Burwell and the members of Congress who are here today, because they have been obviously doing extraordinary work. My first job in Chicago when I moved after college to work as a community organizer — my first job was funded by the Campaign for Human Development, an anti-poverty initiative of the Catholic Church. And my first office was at Holy Rosary Church on the South Side of Chicago, across from Palmer Park. (Applause.) You’re clapping there — she knows Holy Rosary. And the task was to work with parishes and neighbors and faith and community leaders to bring low-income people together, to stitch neighborhoods together, clergy and laypeople. And the work was hard, and there were times where it was dispiriting. We had plenty of setbacks. There were times where I felt like quitting, where I wondered if the path I’d chosen was too hard. But despite these challenges, I saw how kindness and compassion and faith can change the arc of people’s lives. And I saw the power of faith — a shared belief that every human being, made in the image of God, deserves to live in dignity; that all children, no matter who they are or where they come from or how much money they were born into, ought to have the opportunity to achieve their God-given potential; that we are all called, in the words of His Holiness Pope Francis, “to satisfy the demands of justice, fairness, and respect for every human being.” And at the time, when I had just moved to Chicago, the Cardinal there was Cardinal Bernardin, an extraordinary man. And he understood that part of that commitment, part of that commitment to the dignity of every human being also meant that we had to care about the health of every human being. And he articulated that, and the Church articulated that, as we moved at the state level in the Illinois legislature, once I was elected there later on in life, to advance the proposition that health care is not a privilege, it is a right. And that belief is at the heart of the Catholic Health Association’s mission. For decades, your member hospitals have been on the front lines, often serving the marginalized, the vulnerable and the sick and the uninsured. And that belief is at the heart of why we came together more than five years ago to reform our health care system — to guarantee that every American has access to quality, affordable care. TAGS: What do you think of this story? Select one of the options below. Your feedback will help tell CNN producers what to do with this iReport. If you'd like, you can explain your choice in the comments below. Be and editor! Choose an option below: ", "external_links": [], "published": "2015-06-10T03:00:00.000+03:00", "crawled": "2015-06-11T01:04:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}