{"organizations": ["Republican", "Congress", "GOP", "Pfizer", "White House", "Buffalo Wild Wings"], "uuid": "a4c45615b955d7631f1206bbfb1e03a49a7ec458", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150612181815-president-obama-watches-senator-rand-paul-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics.rss&author=CNN&title=Politics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/06/15/politics/jeb-bush-2016-presidential-announcement/index.html", "country": "US", "title": "Being Moody: Rand Paul strikes out while Obama cheers", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Being Moody: Rand Paul strikes out while Obama cheers", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T00:20:00.000+03:00", "replies_count": 0, "uuid": "3d243ef54d05022267eadfdac85a7c9b4f09b6f9"}, "author": "", "url": "http://edition.cnn.com/2015/06/12/politics/congressional-baseball-game/index.html", "ord_in_thread": 0, "title": "Being Moody: Rand Paul strikes out while Obama cheers", "locations": ["centerfield", "Qatar", "Washington", "Capitol Hill", "Richmond", "Louisiana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul", "Barack Obama", "Koch", "Rand Paul", "Cedric Richmond", "Obama"], "text": "Rand Paul strikes out while Obama cheers 02:33 Washington (CNN) The Congressional Baseball Game is an age-old Washington tradition, dating back to 1909 -- and one of the city's most peculiar customs. Not unlike Capitol Hill, Republican lawmakers compete against Democrats.Their staffers cheer in separate sections. And the playing field is paid for mostly by lobbyists, which in years past have included the Middle Eastern nation of Qatar, Pfizer, the Koch brothers and Buffalo Wild Wings. (The only true bipartisan area of the stadium is the bar section in centerfield, where the blues and the reds drink away their misgivings about bipartisan mingling.) All proceeds from the game go to charity. It has been a tough few years for the Republican team. Before Thursday's game, the GOP had lost six straight years, suffering absolute slaughters of 22-0 two years ago and 15-6 last year. The Democrats' not-so-secret weapon is their pitcher, Louisiana Democratic Rep. Cedric Richmond, a young lawmaker who played college ball and has been known to hurl 80-mile-an-hour heat from the mound. This year, Richmond's pitches were slower due to a recent surgery, but Republicans fared no better. Democrats racked up their seventh straight victory, winning 5-2. In the middle of this year's game, President Barack Obama paid an unexpected visit. His entrance halted the game for several minutes before play resumed and he watched from the Democrats' dugout. That's when Republicans began to rally. They put two men in scoring position, and, with two outs, Rand Paul, who's in the middle of running his own campaign to replace Obama in the White House, stepped up to the plate for his chance for glory. Two strikes down, Paul swung the bat at a pitch and whiffed so hard it cooled down the fans suffering the 90-degree heat. Obama, standing near the Democrats' dugout, cheered and pumped his fist. Unfortunately for the president, his loyalty to the Democrats didn't get him far: The next day, off the field, members of his party rallied against him to kill a key part of his agenda . <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> Congress", "external_links": [], "published": "2015-06-16T00:20:00.000+03:00", "crawled": "2015-06-16T04:59:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}