{"organizations": [], "uuid": "ad2c9bfbee10eff319d1caf9bc72680fedd98a0f", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/09/politics/texas-abortion-law-federal-appeals-court/index.html", "country": "", "title": "Appeals court upholds provisions of Texas abortion law - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Appeals court upholds provisions of Texas abortion law - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T01:14:00.000+03:00", "replies_count": 0, "uuid": "ad2c9bfbee10eff319d1caf9bc72680fedd98a0f"}, "author": "", "url": "http://www.cnn.com/2015/06/09/politics/texas-abortion-law-federal-appeals-court/index.html", "ord_in_thread": 0, "title": "Appeals court upholds provisions of Texas abortion law - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Federal appeals court upholds provisions of Texas abortion law By Ariane de Vogue , CNN Supreme Court Reporter Updated 2311 GMT (0611 HKT) June 9, 2015 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – State troopers look on as a group in Austin, Texas, protests a new state abortion law in July. Parts of the law were ruled unconstitutional on Monday, October 28 -- a day before they were scheduled to take effect. Hide Caption 1 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Texas Speaker of the House Joe Straus strikes the gavel after a provisional vote on the abortion measure passed July 9. A lawsuit, filed by Planned Parenthood on behalf of more than a dozen women's health care providers across Texas, alleged that the new abortion limits violate the constitutional rights of women and put unreasonable demands on doctors who perform abortions. Hide Caption 2 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Supporters of the abortion limits react in the gallery of the Texas House after the measure was provisionally approved July 9. The measure seeks to ban abortions past 20 weeks of gestation, mandate abortion clinics to become ambulatory surgical centers, and tighten usage guidelines for the drug RU486. It would also require doctors who perform abortions to have admitting privileges at a hospital within 30 miles of the clinic where they're providing abortion services. Hide Caption 3 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Opponents of the abortion bill yell outside the Texas House after the bill is provisionally approved. Hide Caption 4 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – State Rep. Jodie Laubenberg, sponsor of the bill, leaves the Texas House floor after the bill passed in July. Hide Caption 5 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Anti-abortion activists take part in a rosary procession around the state Capitol as the House debates the bill in July. Hide Caption 6 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – State Sen. Wendy Davis speaks at a news conference outside the state Capitol as the Texas House prepares to begin debate on the bill in July. In late June, Davis blocked the bill with a filibuster, talking for more than 10 hours and running out the clock on the regular legislative session. Hide Caption 7 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Supporters of the bill listen to speakers July 8 at a rally organized by the Texas Right to Life Organization. Hide Caption Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Abortion rights activists march from the Texas Capitol on July 8. Hide Caption 9 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Members of the public line up July 8 for an opportunity to speak at a Senate hearing on the proposed bill. Hide Caption 10 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Republican Sen. Bob Deuell set two pairs of infant shoes on the counter while speaking at a Senate hearing July 8. Hide Caption 11 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Anti-abortion protesters gather on the ground floor of the state Capitol as abortion rights protesters gather on the balcony of the outdoor rotunda July 8. Hide Caption 12 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Abortion rights activists react as an anti-abortion group prays below them during the July 8 Senate hearing. Hide Caption 13 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Opponents of the abortion bill walk in circles around supporters of the bill as a committee holds hearings at the state Capitol on July 2. Hide Caption 14 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – A man blows a horn as supporters and opponents of an abortion bill gather near a hearing for the bill on July 2. Hide Caption 15 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Abortion rights activists Melissa Gabriel, Ally Parks and Tina Johnson look over anti-abortion demonstrators on July 2. Hide Caption 16 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Anti-abortion activist Pamela Whitehead, right, argues with an abortion rights activist on July 2. Hide Caption 17 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Opponents of an abortion bill chant outside a hearing for the bill on July 2. Hide Caption 18 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Davis, center, is surrounded by Texas representatives and senators July 1 after leading a rally in support of women's rights to reproductive decisions. Hide Caption 19 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Natalie Maines and her father, Lloyd Maines, play the national anthem at the rally. Hide Caption Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Women's rights demonstrators gather at the state Capitol on July 1. Hide Caption 21 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Anti-abortion demonstrators tape the word \"life\" over their mouths as they stand in the rotunda of the state Capitol on July 1. Hide Caption 22 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Supporters on both sides of the issue crowd into the rotunda of the state Capitol on July 1. Hide Caption Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Anti-abortion activists pray at the Capitol on July 1. Hide Caption Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Demonstrators on both sides gather in the Capitol on July 1. Hide Caption 25 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Davis leads a rally in support of women's rights to reproductive decisions. Hide Caption 26 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Opponents of an abortion bill yell outside a hearing on the bill July 2. Hide Caption 27 of 28 Photos: Controversial Texas abortion bill 28 photos Controversial Texas abortion bill – Protesters gather in the gallery of the Senate chamber on July 1. Hide Caption 28 of 28 Washington (CNN) A federal appeals court on Tuesday upheld portions of Texas's controversial abortion law in a ruling that pro-choice groups say could put most abortion clinics in the state at risk of closure. Soon after the ruling, the Center for Reproductive Rights, which represented clinics and doctors in the case, announced plans to ask the Fifth Circuit Court of Appeals to put the ruling on hold pending an appeal to the Supreme Court. Texas's abortion law is considered by some to be one of the toughest in the nation. At issue are provisions concerning physicians' admitting privileges in some abortion facilities as well as a requirement that clinics upgrade their facilities to meet hospital-like standards. Other provisions of the law have already gone into effect, and the ones in Tuesday's ruling were at issue in recent challenges. RELATED: Rick Perry shares top presidential priority The appeals court ruled that the law's provisions may be applied throughout the state, save for exceptions in a facility in McAllen, which is significantly far enough away from other clinics that its closure might place a substantial obstacle in the path of women seeking an abortion. The Center for Reproductive Rights believes the ruling won't go into effect for 22 days barring an emergency action by a higher court. Supporters of the law, which was enacted in 2013, say the provisions were passed to raise the standard and quality of care for women seeking abortions and to protect their health. But opponents claim the provisions are unnecessary and impose burdensome costs on clinics. Photos: Supreme Court cases that changed America 17 photos Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Hollingsworth v. Perry (2013): The Supreme Court dismissed an appeal over California's Proposition 8 on jurisdictional grounds. The voter-approved ballot measure barring same-sex marriage was not defended by state officials, but rather a private party. This ruling cleared the way for same-sex marriage in California to resume, but left open-ended the legal language of 35 other states barring same-sex marriage. Take a look at other important cases decided by the high court. Hide Caption 1 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – United States v. Windsor (2013): When her wife died in 2009, Edith Windsor, 84, was forced to pay hundreds of thousands of dollars in estate taxes because her marriage was not recognized by the federal government's Defense of Marriage Act of 1996. The Supreme Court struck down the part of the law which denied legally marriage same-sex couples the same federal benefits provided to heterosexual spouses. Hide Caption 2 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – National Federation of Independent Business v. Sebelius (2012) : The Supreme Court upheld most of the Affordable Care Act, the Obama administration's health care reform law, on June 28, 2012. The decision determined how hundreds of millions of Americans will receive health care. Hide Caption 3 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Citizens United v. Federal Election Commission (2010): Activists rally in February 2012 to urge the Supreme Court to overturn its decision that fundamentally changed campaign finance law by allowing corporations and unions to contribute unlimited funds to political action committees not affiliated with a candidate. Hide Caption 4 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Texas v. Johnson (1989): The Supreme Court overturned the decision that convicted Gregory Lee Johnson of desecrating a venerated object after he set an American flag on fire during a protest. The court ruled that Johnson (at right with his lawyer, William Kunstler) was protected under the First Amendment right to freedom of speech. Hide Caption 5 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – United States v. Nixon (1974): When President Richard Nixon claimed executive privilege over taped conversations regarding the Watergate scandal, the Supreme Court ruled that he had to turn over the tapes and other documents. The ruling set a precedent limiting the power of the president of the United States. Hide Caption 6 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Roe v. Wade (1973): Norma McCorvey, identified as \"Jane Roe,\" sued Dallas County District Attorney Henry Wade over a law that made it a felony to have an abortion unless the life of the mother was in danger. The court agreed with Roe and overruled any laws that made abortion illegal in the first trimester. Here, McCorvey, left, stands with her attorney Gloria Allred in 1989. Hide Caption 7 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Miranda v. Arizona (1966): Ernesto Miranda confessed to a crime without the police informing him of his right to an attorney or right against self-incrimination. His attorney argued in court that the confession should have been inadmissible, and in 1966, the Supreme Court agreed. The term \"Miranda rights\" has been used since. Hide Caption 8 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Gideon v. Wainwright (1963) : The Supreme Court overturned the burglary conviction of Clarence Earl Gideon after he wrote to the court from his prison cell, explaining he was denied the right to an attorney at his 1961 trial. Hide Caption 9 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Mapp v. Ohio (1961): The Supreme Court overturned the conviction of Dollree Mapp because the evidence collected against her was obtained during an illegal search. The ruling re-evaluated the Fourth Amendment, which protects citizens against unreasonable searches and seizures. Hide Caption 10 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Brown v. Board of Education (1954): Nathaniel Steward recites his lesson surrounded by white classmates at the Saint-Dominique School in Washington. In Brown v. Board of Education, the Supreme Court ruled that it was unconstitutional to separate students based on race. Hide Caption 11 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Korematsu v. United States (1944): Fred Korematsu, a Japanese-American man, was arrested after authorities found out that he claimed to be a Mexican-American to avoid an internment camp during World War II. The court ruled that the rights of an individual were not as important as the need to protect the country during wartime. In 1998, President Bill Clinton awarded Korematsu the Presidential Medal of Freedom. Hide Caption 12 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Plessy v. Ferguson (1896): Homer Plessy was arrested when he refused to leave a whites-only segregated train car, claiming he was 7/8 white and only 1/8 black. The Supreme Court ruled that \"separate but equal\" facilities for blacks were constitutional, which remained the rule until Brown v. Board of Education in 1954. Hide Caption 13 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Dred Scott v. Sandford (1857): When Dred Scott asked a circuit court to reward him his freedom after moving to a free state, the Supreme Court ruled that Congress didn't have the right to prohibit slavery and, further, that those of African-American descent were not protected by the Constitution. Hide Caption 14 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Gibbons v. Ogden (1824): This was the first case to establish Congress' power to regulate interstate commerce. The ruling signaled a shift in power from the states to the federal government. Aaron Ogden, seen here, was given exclusive permission from the state of New York to navigate the waters between New York and certain New Jersey ports. When Ogden brought a lawsuit against Thomas Gibbons for operating steamships in his waters, the Supreme Court sided with Gibbons. Hide Caption 15 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – McCulloch v. Maryland (1819): In response to the federal government's controversial decision to institute a national bank in the state, Maryland tried to tax the bank out of business. When a federal bank cashier, James W. McCulloch, refused to pay the taxes, the state of Maryland filed charges against him. In McCulloch v. Maryland, the Supreme Court ruled that chartering a bank was an implied power of the Constitution. The first national bank, pictured, was created by Congress in 1791 in Philadelphia. Hide Caption 16 of 17 Photos: Supreme Court cases that changed America 17 photos Supreme Court cases that changed America – Marbury v. Madison (1803): When Secretary of State James Madison, seen here, tried to stop Federal loyalists from being appointed to judicial positions, he was sued by William Marbury. Marbury was one of former President John Adams' appointees, and the court decided that although he had a right to the position, the court couldn't enforce his appointment. The case defined the boundaries of the executive and judicial branches of government. Hide Caption 17 of 17 EXPAND GALLERY \"Not since before Roe v. Wade has a law or court decision had the potential to devastate access to reproductive health care on such a sweeping scale,\" Nancy Northup, the president and CEO of the Center of Reproductive Rights, said in a statement. \"Once again, women across the state of Texas face the near total elimination of safe and legal options for ending a pregnancy and the denial of their constitutional rights.\" She added: \"We now look to the justices to stop the sham laws that are shutting clinics down and placing countless women at risk of serious harm.\" But Texas Gov. Greg Abbott praised the ruling in a statement. \"I am pleased with the Fifth Circuit's decision to uphold HB 2 and the State of Texas will continue to fight for higher-quality healthcare standards for women while protecting our most vulnerable: the unborn,\" he said. RELATED: Iowa is Hog heaven for GOP hopefuls A district court struck down the provisions in 2014, but last October, the appeals court allowed them to take effect while the appeal process played out. The Supreme Court stepped in soon after and reinstated the district court ruling pending appeal. In 2013, there were about 36 abortion clinics in the state. Before Tuesday's decision, that number had dwindled to around 20. The Supreme Court is currently considering whether to take up a similar case in Mississippi. Brigitte Amiri, a senior staff attorney for the American Civil Liberties Union, believes the Supreme Court is \"likely\" to be interested in the Texas case because the issues raised touch upon precedent established in other abortion rulings. ", "external_links": [], "published": "2015-06-10T01:14:00.000+03:00", "crawled": "2015-06-10T01:16:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}