{"organizations": [], "uuid": "67db789c04c2c78dd403d678482fd31cad18338e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/kelly_charles_061015.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/transcript/2015/06/11/president-obama-to-make-policing-priority-during-final-months-in-office/", "country": "US", "title": "President Obama to make policing a priority during final months in office", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "President Obama to make policing a priority during final months in office | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "67db789c04c2c78dd403d678482fd31cad18338e"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/06/11/president-obama-to-make-policing-priority-during-final-months-in-office/", "ord_in_thread": 0, "title": "President Obama to make policing a priority during final months in office", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com Email Print\nThis is a rush transcript from \"The Kelly File,\" June 10, 2015. This copy may not be in its final form and may be updated.\nMEGYN KELLY, HOST: Breaking tonight, almost a full year after America is dragged into a national debate over race and policing and the White House now says, the president will now make this a priority for his final months in office.\nGood evening, and welcome to \"The Kelly File,\" everyone. I'm Megyn Kelly.\nOver the last ten months a handful of controversial and contested cases have fueled an argument that there is no justice in many of America's minority communities and now the president is talking about taking new action. The argument started with events in Ferguson, Missouri where a white officer shot and killed a black teenager. But that cop was cleared by the Department of Justice after a grand jury determined much of what the country held as truth in Ferguson was in fact actually a lie told by a friend of Mr. Brown.\nUp next Staten Island where a grand jury including five African- Americans refused to indict a white police officer in the death of Eric Garner. Right or wrong. That was the verdict. And now we have Baltimore. Six cops hit with charges ranging from assault to second degree murder. After Freddie Gray suffers injuries in a police van that led to his death. The D.A. comes out and calls the arrest itself illegal, says there was no reason for the police's action. Then, just yesterday \"The Kelly File\" gets its hands on a memo showing the D.A.'s office was the one that ordered cops to crack down on suspected drug dealers in that very neighborhood.\nSo, now we know that while Marilyn Mosby attacked police at her news conferences, she knew that she was the one who had sent them out there to round up guys like Freddie Gray. She had an angry community rioted. And then crime rate spiked. And now police are worried that it is not just their lives in the line of fire everyday but also their freedom.\n(BEGIN VIDEO CLIP, CNN)\nUNIDENTIFIED MAN: Now they have the softer police department and this is the result that you get. And ultimately it does a disservice to the law abiding citizens. It does a disservice to business owners. It does a disservice to everybody except the criminal element because they are in their glory right now.\n(END VIDEO CLIP)\nKELLY: Joining us tonight, Fox contributor Charles Krauthammer who will get to in a moment. First, Kevin Jackson, a conservative radio host and author of the book, \"Race Pimping.\" Kevin, good to see you.\nKEVIN JACKSON, CONSERVATIVE RADIO HOST: Thank you, Megyn.\nKELLY: And so, here it is. President Obama will sweep in and make this a priority in his last months in office to try to crack down on what he may view as police who are out of control.\nJACKSON: Well, I mean, if you are looking for a comment from, one thing I can say is that if Barack Obama is going to be cracking down on police he needs to start cracking down on what is happening in these communities. You know, we have had another cop resign. And I'm not going to comment about whether or not he should or shouldn't have. What I will tell you Megyn is, thugs don't lose their jobs. In fact, when cops are not protecting neighborhoods thugs have free rein. And that is essentially the type of environment that has been created. And it is not even so much as you pointed out earlier, it's not just about cops losing their lives, they are losing jobs, they're afraid to do things. And so, I think you're going to find out that if Obama is going to be talking about a legacy and I know Charles talked about that earlier, his legacy is going to be the most corrupt, the most crime ridden administration probably in the modern era.\nKELLY: He views this, I mean, at least someone people in the administration including the DOJ view this -- as a problem with out of control racist cops and they are going to fix it. That we have seen case after case after case where a white cop shoots and sometimes kills an unarmed black defendant.\nJACKSON: It's absolute nonsense. What's happening is, every time something involves a black person you have people like DeRay McKesson or whatever his name is and other people who are waiting, Megyn, they are literally waiting for the phone call to say go stir up trouble. These things happen. Bad cops, bad policing, bad, whatever, bad doctors, bad lawyers it happens all over the country to people of all kinds of colors. You will not going to see Asians rioting over this when it happens to them. Because everybody realizes that mistakes can be made. But what's happened is, we have a situation now set by the President, established on down the food chain with Eric Holder and probably now with Loretta Lynch that says it is free reign over the cops.\nThe fact of the matter is for decades we have been dealing with problems in inner cities, problems with the black community of high crime, not because black people are necessarily bad but because black people have been put into bad situations and bad circumstances by liberal policies. Look at all of these, these are various cities and you're going to find a very easy to connect dot that says, point back to the Democrats that are in office and all the things that they are not doing to help the black community at large do better.\nKELLY: But what do you think, I mean, can the President make a difference here? Because, you know, both he and Governor Chris Christie, a republican of New Jersey pointed to Camden, New Jersey, and said, there we instituted a community policing. We sent the cops out there to sort of interface with the community. And things got a lot better. Critics said, oh, that's the hug of thug approach. And it doesn't work. But Governor Christie and President Obama democrat and republican, reveres that, seem to agree it does work.\nJACKSON: Well, the problem is, is that they do these things in one offs. But there's no, the only overarching piece that we've seen Megyn, is when Barack Obama ran to the side of color, in the Gates affair, in the Trayvon Martin affair, and practically every instance at the national level, where a cop is involved, with a community, he uses that as an opportunity to reinforce how bad it is to be an American, how bad cops are against what he calls communities of color. But then he'll go do the one off in New Jersey, which is at the bandit of a bullet hole. And the fact of the matter is, I don't believe at the overarching level -- I think most Americans, what many of the conservative Americans would agree, Barack Obama doesn't care about that. He actually wants to set the narrative that cops are targeting communities of color, disregarding the facts that unfortunately there's a lot of crimes in these communities of color.\nKELLY: He does defend the cops but it usually followed with a but this, and but that. Kevin, great to see you.\nJACKSON: The but. You too, Megyn.\nKELLY: So, the larger question. With the White House now talking about making policing a priority for the President's remaining time in office. What does that mean for the rest of America's communities?\nJust before we came to air, I spoke to Charles Krauthammer, a Fox News contributor and author of the book, \"Things That Matter.\" Which is a great Father's Day gift by the way. It's now on paperback, and has a new section on the age of Obama.\nCharles, good to see you.\nCHARLES KRAUTHAMMER, FOX NEWS CONTRIBUTOR: Pleasure to be here.\nKELLY: So now, both can rest easy because President Obama is going to make policing a priority.\nKRAUTHAMMER: Well, you know, Obama is now out for his legacy. He might as working for his legacy, I think he's working for the presidential library. Rather than stepping in the areas, turn out his problems. I know the President is a constitutional lawyer, who was a constitutional professor. But he must know that policing is a local and a state issue and for the federal government to step in, because the President wants a legacy, I think it's beyond short sided, I think it to rather self- centered. And what could that legacy be, for that string events, you have talked about, the way the media had played, the way it's been bend by certain politicians who want to take advantage of it. And the travesty that we've seen I think in Baltimore, where the DA essentially said to the people you give me peace, I'm giving you justice, let's have peace. Making it clear that what she's trying to do is to appease the bob.\nThe only consequence of this, and we see it New York, we see it Baltimore, we see it elsewhere, is to undermine people's confidence in the police, is to undermine their respect for the police, and it's essentially to undermine law and order whether you like it or not there are obviously going to be -- there are always going to be some bad police overwhelmingly they are honorable and courageous. We have been honoring them ever since in 9/11 and for good reason. But once you undermine their authority, we know what happens. The crime rate is out of control in Baltimore and it is particularly bad in the neighborhoods where people are poor, they have no defenses. The rich can defend themselves, they get the bodyguards and they have the houses that have all kinds of guards. They have the gated communities, the poor don't have that. And that's what we are seeing. This is undermining law and order. Perhaps inadvertently but it is a fact and the people who suffer the most are the people who need the protection.\nKELLY: The Department of Justice has been using these cases over and over in at least two dozen cases as an excuse to go in and essentially take over law enforcement, Charles. It has happened repeatedly. They use a case that is destined to fall apart as an excuse to go in and before you know it first Eric Holder and now Loretta Lynch are not in charge but close to it of the way the local cops are supposed to do their job.\nKRAUTHAMMER: I suspect this would be short-lived. I suspect this will be the work of his administration over the next 19 months. They will try to do this. But I think the baleful consequences, the fact that we see undermining of authority, undermining of law and order and a spike in crime is going to make a very big reaction in public opinion, not going to happen overnight but when people look around and realize that the streets are not safe the way they were before they are going to say stop. We go back to the old system. Policing should be local, the feds should keep out of it.\nKELLY: We shall see. Charles, great to see you.\nKRAUTHAMMER: My pleasure.\nKELLY: Also tonight, a left wing media outlet is attacking our coverage of this caught on tape controversy from McKinney, Texas. Howie Kurtz is next on what they are claiming and has a response.\n(END VIDEO CLIP)\nAnd then Jeb bush is accused of wanting to publicly shame America's unwed mothers. Dana Perino joins us on exactly what Jeb said and what it means for the GOP frontrunner. Well, frontrunner at some polls.\nPlus, James Rosen and his take on \"Kelly File\" investigation into why one American Embassy decided to move 4th of July celebrations so as not to class with the Muslim holiday of Ramadan.\n(COMMERCIAL BREAK)\nKELLY: Developing tonight, an attorney for the police officer in McKinney, Texas is speaking out saying the cop who has now resigned was under intense emotional strained on the day he pinned a 14-year-old girl to the ground and flashed his gun at a group of teenagers after a pool party turned violent. The lawyer for Police Corporal Eric Casebolt says, he had been called to the scene of two suicides or attempted suicides earlier that morning and lost his control of his emotions in responding to the pool incident.\nMeantime, some on the left wing press continued to use this incident to dishonestly push their own agenda. Case in point, Scott Eric Kaufman, a writer at Salon, which is a far left website that often descends into ugly partisan hackery. Mr. Kaufman repeating a Media Matters lie, that's the website devoted to killing Fox News, how's that going for you? Went up with a piece yesterday suggesting that yours truly on Monday night, Quote: , \"spent half the program\" trying to justify the police in McKinney before allegedly, Quote: , \"leaping to Corporal Casebolt's defense\" by saying that this teen was, Quote: , \"no saint either.\" Here is what actually happened. We did two segments on McKinney, the first involved an eyewitness who defended the officer. The second involved two pundits, Mark Fuhrman and Richard Fowler, both of whom more against the cop. Two segments out of six on our show. And two of the three guests, against the cop. I took no position on the matter other than to acknowledge the brutality of the cop's actions and the decision making of the young woman that brought her into his focus.\n(BEGIN VIDEO CLIPS)\nKELLY: That is hard to watch. The real pushback has been on this one police officer taking down this 14-year-old girl, African-American girl taking her down and putting a knee in her back in what is a shocking piece of videotape.\nWhat about the take down of the 14-year-old girl, Mark? Because that is the most brutal part of this. And you see him, you know, bending her limbs. It's brutal.\nIt was the head of the NAACP came out and said he treated her like chattel. The girl was no saint either. He had told her to leave and she continued to linger. And, you know, when the cops told them to leave, get out. I am not defending his actions, let me make that clear.\n(END VIDEO CLIPS)\nKELLY: Mr. Kaufman forgot to mention that last part or the fact that our liberal guests agreed with yours truly or the fact that we under scored the horrific nature of what this officer did at least five times. Several other leftwing blogs went with the narrative suggesting that our show supports the brutalization of young women. It is almost pointless to respond to these kinds of smears and I almost never do it. But this one struck me as an example of how drastically the press, really the blogs distort innocuous comments to promote their own agendas. It is not just a left wing thing to be fair. But too often it is done by the far left with glee and with total impunity.\nJoining me now with more Howie Kurtz, host of FOX News' Media Buzz. Howie, this is punching down. Right? Salon. It's like they describe themselves as a tabloid. I accept that. But over and over we see this done where they take something, they distort it. It gets repeated by all this left wing blogs and then people accept it as fact.\nHOWIE KURTZ, HOST, \"MEDIABUZZ\": Yes. It gets into the echo chamber. Shocking, brutal. That sure didn't sound like somebody rushing to the officer's defense. And the worst part of it, there are several bad parts is leaving out the comment you made seconds after you said, well, the girl wasn't a saint because she didn't listen to the officer and depart, in which you said, I am not defending his actions. That kind of selective quotation is used by writers who don't have any interests and fairness, and so this is classic case of a liberal writer with an agenda who often rails against FOX who's taking some shots at you. Trying to discredit the interviewer because he didn't like what the guest said, the guy you talked to Sean who was an eyewitness.\nKELLY: Exactly right. And I pressed Sean on every issue. You know, he took issue with me, this writer for probing who said racist things to whom. My guest made an assertion that the people climbing over the fence were yelling racist things at the residents. And I challenged him saying, what we heard is it was the opposite way around. None of this is acknowledge. My point is, there is very little desire on the part of these folks to get to truth. There is only a desire to get to agenda. And yet there seems to be an audience for that, a viewership, a readership for these blogs and some instances, you know, podcasts, what have you.\nKURTZ: It is what politicians called playing to the base. And Salon has a liberal readership, does not like FOX. But I went back to the videotape and looked at it in slow motion like you do in sports. And you were hardly a lawyer leading the witness. You asked this guy Sean about every allegation have been made whether or not Casebolt was a racist, whether it was excessive force, whether or not residents there used racial taunts against some of the black kids. No. You can't control what he says. He has different view that can fit the narrative --\nKELLY: That's the problem.\nKURTZ: Therefore somehow you are responsible for -- but then, you know, as you say in the next segment you made clear your distaste and your disgust at seeing that video which was hard to watch.\nKELLY: There is the rub is that we had the nerve to put somebody on who did defend the officer. That is what some -- and I'm not talking about left wing. I'm talking about far left. That is what they cannot stand. And the reason that Fox News Channel was born is because there were so many television channels out there who were telling only one side. And Roger Ailes had a vision, a different kind of vision where we have a news station that would tell both sides fair and balance. We had the nerve to put a guy on who defended the cop and then two guys on including Mark Fuhrman who always defends the cops but who we knew who's not going to defend the cop here. So, two guys who didn't defend him and that is too much. You can't -- if you do anything in defense of a cop for example in this situation you must be a bigot. You must hate young women.\nKURTZ: Well, we are all fair game for criticism who appear on television. But the criticism should be based on the facts and not some selective distortion. But there is a broader point here I think about media polarization now that we live in this age of cellphone videos where we can see what happens in many of these confrontations with police which is by and large a good thing, it also opens up a situation, cable news is a participant. Ideological media are a major participant where every local incident, I mean, this was a pool party, fortunately nobody was seriously hurt, you know, gets blown up into some national mellow drama in which people try to score points. And not to pick on Salon but it's another headline that says America's war on black girls based on the actions of one hot headed cop.\nKELLY: Yes. The war on black girls. And there was one who actually went back and looked, he wrote something about you one time, this guy. This is what he attributed to do, Howie Kurtz, the Duggar scandal reveals why we need more bigoted conservatives in our national media. I remember that, but it attributed to something you said on the show, Howie. I ought to review the tape.\nKURTZ: I think I have been very fair on my comments about the Duggar family. Criticizing the parents, defending the interview. But here's the thing. That was another example where whether you were left or right, whether you had sympathy or not for a Christian family, hypocrites, that very much influenced the kind of commentary you did, sometimes honest, sometimes not so much.\nKELLY: That's exactly right. Great to see you. Thanks for being here.\nKURTZ: My pleasure.\nKELLY: While so, all this attention has been focused on the officer in this case, what about the woman accused of starting this entire melee down in McKinney? The video of what she did, you are going to want to see this and the calls now for her not only to be criminally charged but fired from her job right after this break.\nPlus as the search expands and intensifies tonight for these convicted murderers, who escaped from an Upstate New York's prison, one of America's most famous bounty hunters Dog is here live and how he would get these fugitives back behind bars.\n(COMMERCIAL BREAK)\nKELLY: Developing tonight new demands that police file criminal charges against the woman who allegedly prompted the melee at the McKinney, Texas pool party. She is the blond woman on the right -- not the blond woman here. I was not there, I was here in New York. I don't know anything -- McKinney. But watch, she is going to be the blond woman wearing the black bathing suit on the right side of the screen.\n(BEGIN VIDEO CLIP)\n(Screams)\n(Bleep)\n(INAUDIBLE)\n(END VIDEO CLIP)\nKELLY: They want her charged and some want her fired from her job.\nKimberly Guilfoyle, the co-host of \"The Five\" and author of the now national bestseller \"Making the Case: How To Be Your Own Best Advocate.\" Does not include whacking the hell out of some teenagers in a pool melee --\nKIMBERLY GUILFOYLE, CO-HOST, \"THE FIVE\": No, it doesn't.\nKELLY: But that is a snippet. That is a snippet. So, what are we to make of the calls for her to be fired and charge.\nGUILFOYLE: That is a rush to judgment. That is a popular phrase. We are basically seeing a few snippets there of that. We don't know the facts and circumstances of what preceded this. So, right away now, this is rushed to make sure that she is terminated to hold her employer personally liable. But we don't know what preceded this whole incident. Why is it that she was there? What happened before that? We see one shot of it. And as a prosecutor I would go through and say, wait, wait, wait, I don't want to judge by just seeing this part of it, show me what happened before. What's the story? What is the lead up to this?\nKELLY: Uh-mm. I mean, they want her gone. I mean, not only do they want her behind bars but they want her employer to immediately fire her. She has already been placed on administrative leave. So, she lost her paycheck for the time being.\n(CROSSTALK)\nGUILFOYLE: Because of the public outcry. That is what is happening. They spiral the support to make sure to try and find somebody to take down. We want you to be held responsible. We want you to be filed charges against, we want you to be held responsible in every way. Criminally, civilly, we want your employer to be held liable because you're a bad person.\nKELLY: And yet the police and the D.A. have not told us that this woman has done anything wrong.\nGUILFOYLE: Right.\nKELLY: Yes, we don't know what proceeded, we have to wait to find out. Meantime same calls for the cop, Officer Casebolt, whose lawyer came up today and tried to explain why he acted like such a hot head on that tape. Watch.\n(BEGIN VIDEO CLIP)\nJANE BISHKIN, ATTORNEY FOR ERIC CASEBOLT: His efforts to gather information was hampered by some teenagers who were instructing others to defy police instructions. With all that had happened that day he allowed his emotions to get the better of him.\n(END VIDEO CLIP)\nKELLY: But they came up today, this group, Next Generation Action Network and said, we are not going to stop or silence until he is charged for what he did in a racially motivated action.\nGUILFOYLE: Uh-mm. Okay. So, what charges exactly are they going to bring against him? Are they going to bring assault? Perhaps civil rights charges. I don't think they're going to stop because they are not satisfied with the kind of, you know, blood loss that they have to make sure that his life is ruined. He already resigned. He stepped down. They tried to explain and get some backdrop as to why he was amped up and had this adrenaline coming. There is also in the video see these two men are coming in from the side. It's not in any way to excuse his overreaction. Okay. I think he knows that himself.\nKELLY: To explain it.\nGUILFOYLE: It is to explain it and give some context to it. When did it become a crime to give context to a situation? To create some understanding and to get all of the facts laid out? It's never enough it seems these days.\nKELLY: The attorney talked about he went, he showed up to pool side, somebody, an African-American gentleman had killed himself, shot himself in the head. He was there comforting the victims. And then another young woman had attempted suicide. He was there talking her down and then this happened.\nGUILFOYLE: And he was first on scene here, an officer of 12 years coming and trying to create some order obviously mishandled the situation.\nKELLY: Well, we'll see, that is not going to do it. He is going to have to talk himself if he wants people to give, you know, any sort of a pass. Kimberly, great to see you.\nGUILFOYLE: Great to see you.\nKELLY: Congrats on the book \"Making the Case.\" Check it out.\nWell, also tonight, Jeb Bush is accused of wanting to publically shame America's unwed mothers. Dana Perino joins us on exactly what Jeb said and what it means for his campaign.\nAnd Rosen is here with a story behind one American Embassy's decision to move its 4th of July celebration, it's an American Embassy, in order to make room for Ramadan.\n(COMMERCIAL BREAK)\nKELLY: Questions for the state department this week after reports surface that the U.S. Embassy in Jakarta moved its July 4th celebration to another date out of respect for Ramadan. Fox News Chief Washington Correspondent James Rosen is here now with more. James?\nJAMES ROSEN, FOX CHIEF WASHINGTON CORRESPONDENT: Megyn, good evening. Conservatives online are up in arms over this with Pamela Gellar asking why Islamic supremacism supersedes July 4th. And Thomas Lipson made a post on the American Thinker Blog calling this a moment of deep shame for America. It all started when it was reported this week by the Jakarta Post which I normally only read for Dunes berry that the U.S. Embassy in Indonesia held its annual 4th of July celebration a month early, on June 4th. The paper Quote: d U.S. Ambassador Robert Blake, a highly regarded Diplomat as saying this was done out of respect for the Muslim holy month of Ramadan. Queried by Fox News, the state department explained that these events are not designed to help Americans overseas celebrate but rather as a means of outreach and education for the native population.\n(BEGIN VIDEO CLIP)\nJEFF RATHKE, STATE DEPARTMENT SPOKESPERSON: In other cases when you take into account the observation of Ramadan in many predominantly Muslim countries when people are fasting and may not be able to attend an event such as this that we adjust in order to most effectively carry out our role which is to represent the United States to all countries where we are assigned.\n(END VIDEO CLIP)\nROSEN: Indeed last year July 4th events were held on June 4th at the U.S. Embassies in Senegal and Morocco and on June 24th at our embassy in Cairo. Our embassy in Riyadh has even held its July 4th event in March because the heat in Saudi Arabia in July is not for the squeamish. However, no one could recall foreign embassies in Washington bumping their national day's celebrations on account of anything going on here. So as a public service Megyn, I say here that if those foreign embassies were as keenly attuned to our sensitivities they might avoid scheduling their national day celebrations on or around the following cherished American events and happenings, number one, Super Bowl Sunday, number two the birth of the next Kimye child and the six month period immediately following the debut of any new candy featuring Reese's Peanut Butter Cups because let's face it, who would come?\nKELLY: Good points all, James Rosen, great to see you as always.\nROSEN: You too.\nKELLY: In other news, 2016 contender Jeb Bush coming under fire today for a passage from a book he wrote 20 years ago where he was talking about unwed mothers. First the Huffington Post declared Jeb Bush in 1995 unwed mothers should be publicly shamed. Then came the Daily Beast which ran the headline shaming unwed was the law in Jeb Bush's Florida. Finally this afternoon the Washington Post runs an op-ed called Jeb Bush's recipe for a better society, shame. Joining me now Former White House Press Secretary under President George W. Bush and Co-Host of The Five Dana Perino, she's also the author of \"And the good news is less sensitive advice from the bright side in stores now. So I look back to see if he said it and he does have a book in which he has a chapter called the restoration of shame. And he says one of the reasons more young women are giving birth out of wedlock is that there is no longer a stigma attached to this behavior, no reason to feel shame. Parents and neighbors have become ineffective at attaching sense of ridicule to this behavior.\nDANA PERINO, FORMER WHITE HOUSE PRESS SECRETARY: The left loves this. So Jeb Bush is out of the country. He is doing a European tour before he announces his Presidency next Monday.\nKELLY: I hope he is not planning on spending July 4th in Jakarta.\nPERINO: Probably not. I think that he'll probably be with his family, I would imagine. The left latched on to this because they want to try to find something. I do think the Democratic opposition groups might want to slow down a little bit because now they have got Marco Rubio's parking tickets. And we have a book from 20 years ago. The book does exist it's called and \"Profiles and Character\" written in 1995 before Jeb Bush became Governor. He ran once in '94 and didn't win and then ran again and becomes Governor. There's a broad construction if you go back to 1995 and the concerns about family values, how many children were being born out of wedlock. That actually has continued to increase and everything when we talk about root causes of problems in America it does come down to the break down of the family and how we can restore that. However, in 20 years later I think everyone can agree maybe the better way to say it is the toughest job in America is being a single mom. That is the kind of language he would probably use today.\nKELLY: That's not going to work. Somebody like me at a Presidential debate will drill down on that. The response is that you are trying to shame unwed mothers who already have it tough enough and they don't need Jeb Bush telling them and others that they need to be shamed.\nPERINO: I think if he gets that question in a debate I think he will have a good way to answer because what they are saying is that look at the record when he is governor. The domestic violence went down 27 percent, increased penalties for any domestic violence offenders. Child support payments up 90 percent during his tenure as governor including they added a law toe garnish wages from the worst offenders. In addition, education choice for low income kids totally focused on that most low income families are in a situation where they have a single parent.\nKELLY: Those are all things to improve family and help children.\n(CROSSTALK)\nKELLY: And what the left is going to do with candidates like Jeb Bush and Mike Huckabee and others who are big on conservative values when it comes to social issues is going to say you are out of touch. Remember binders full of women -- the comment Mitt Romney made. It successfully got spun into this he has women in binders. So something like this is going to be used against him. Huckabee's comments -- so there is going to be the out of touch Republicans.\nPERINO: Republicans are going to have to factor that in. It won't be good enough for them to say well wait a second, three years ago Hillary Clinton was against gay marriage. That was three years ago. Why isn't the left up in arms about that?\nKELLY: She might have agreed on something.\nPERINO: They will never -- right. That was just three years ago. That is not necessarily going to work for Republicans. If you look at the election now you have to get to 270 electoral votes, there are 43 to 46 percent already locked in for Hillary, 43 to 46 percent is locked for whoever the Republican is going to be. So who is most important and those independent voters a lot of that will be women so he does have a challenge. I think on balance if he can communicate the record that he had in particular on child support payments that specifically helps single unwed mothers or divorced mothers. Maybe they got remarried or whatever.\nKELLY: Unwed for one reason or another.\nPERINO: Right, things didn't work out.\nKELLY: Sorry, it happens. Up next, new developments on how two convicted murderers escaped from a New York prison. Federal marshals here and Dog the Bounty Hunter next on the massive manhunt underway.\n(COMMERCIAL BREAK)\nKELLY: Developing tonight, police now expanding their search for two escaped prisoners to the state of Vermont. Investigators also now confirming Richard Matt and David Sweat had help from a female prison worker in their elaborate escape from a maximum security prison in upstate New York, Trace Gallagher live in our West Coast Newsroom with the late breaking details, Trace?\nTRACE GALLAGHER, LOS ANGELES CORRESPONDENT: Megyn, authorities say they headed to Vermont because the escapees consider New York to be hot when it comes to law enforcement and Vermont to be cool. The massive search is focused on the shores of Lake Champlain in the Adirondack Mountains. Authorities say they have gotten 500 plus tips but zero solid leads. Forty eight year old Richard \"Ricky\" Matt and 34-year-old David Sweat used power tools to break through prison walls, cross a catwalk, cut into a steam pipe and crawl through a man hole outside the prison. Sources tell Fox News 51-year-old Joyce Tilley Mitchell gave the killer the power tools to break out and was planning to be their get away driver before she got cold feet. Mitchell's family believes if she did help she did it because she was threatened by the men. There was also a theory that she may have helped because she thought there was something more between she and Ricky Matt. Everyone from detectives to Matt's former stripper girlfriend say that when he's cleaned up, Ricky Matt is handsome and charming, he's also a psycho path who chopped up his former boss. Listen to his one-time accomplice.\n(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: If you wanted to take a picture of the devil, that's the face that you would see. And yes I have seen him kill.\n(END VIDEO CLIP)\nGALLAGHER: And Matt's family is also, \"freaked out by him\" Megyn?\nKELLY: Thank you. Trace, thank you. Joining me now with more Lenny DePaul, who's a Former Commander of the U.S. Marshall's New York and New Jersey Regional Task Force. Lenny, thank you welcome back, where do we think this Vermont tip came from?\nLENNY DEPAUL, U.S. MARSHALLS RET. COMMANDER: I'm not sure where the investigators are starting. It is still an intense man hunt even in the area they have been in New York and now into Vermont. It is also a fugitive investigation. As tips come in we are going to react to them. We are going to send leads to different states. Apparently they see Vermont as being a priority and it is full-court press. Hopefully they get to the bottom of it.\nKELLY: How about this Joyce? Why?\nDEPAUL: Apparently it's out there and in the press conference put her name out what not but if she supported these two guys I have no idea why. I'm hoping she is cooperating and at least giving what went on behind the scenes to support and help these guys get out of there.\nKELLY: How do you begin to cast the net Lenny? You used to be responsible for this. How do you cast the net at this point a couple days after?\nDEPAUL: Thank god the U.S. Marshall Service being the premiere agency in the government in hunting fugitives was on the ground all over the country and around the world. So as leads come in whether it's friends, family, somebody who needs to be surveilled, a conversation needs to be had in another state, it is a phone call away to our investigators.\nKELLY: Somebody is going to spot them right, somebody is going to spot them and call in.\nDEPAUL: They don't necessarily have to be in Vermont. There are leads up there, there are leads around the country. I know that the U.S. Marshalls have sent leads two three or four other states. They don't have to be there. So I want the audience and your viewers to know that if in fact they see them in Florida don't discard anything because we are saying they could be in Vermont.\nKELLY: They are going to have to commit a crime right, because they need money.\nDEPAUL: They must. If in fact they what is coming out about Ms. Mitchell is true and she didn't pick them up at the manhole, they have to go to plan C at this point. They could be very upset, wet, tired. God knows what they are doing.\nKELLY: Even to change their appearances if they haven't already they will need money to do that so that can potentially be a lead, Lenny thank you.\nDEPAUL: Thank you.\nKELLY: Here now with more is Duane \"Dog\" the Bounty Hunter Chapman, he's the Co-Star of the CMT Show \"Dog and Beth on the Hunt.\" Dog, good to see you tonight and so what would you do to try to find these guys?\nDUANE \"DOG\" CHAPMAN, BOUNTY HUNTER: I would be doing probably exactly the same thing the cops are to wait until they make a mistake. Everything has changed now Megyn because now the girlfriend has admitted that she was the accomplice. I thought that they had a very elaborate plan as soon as they got out of the man hole they put the sticky note and took off. Now that she's admitted it that means they are in that area because she was supposed to go pick them up. The sightings that could possibly be might be them. Their whole plan has changed. Now the luck is not on their side anymore ok. Everything has changed. Now they are on the streets. Now they become victims of the U.S. Marshals and bounty hunters. Now is when we can catch them. Right now is when we can catch them.\nKELLY: What are the odds they stick together as opposed to splitting up?\nCHAPMAN: Because they were in prison together and because they got away together I think they would stick together for a little while if nothing else because of luck. I didn't know -- I would like to see where they got the sticky note. I didn't know they had those in prison. I would like to see which pen he used to write have a nice day. It looks like he was waiting for her to show up and she didn't show up so they took off. Bloodhounds now I can see why the cops have bloodhounds trying to get a trail. Now is when the cards have turned against them. Now is where we will be able to catch them.\nKELLY: Now is when the American people need to keep eyes open but steer clear. They could not be worse criminals. Dog thanks for being here, sir.\nCHAPMAN: Thank you Megyn, very much.\nKELLY: Up next, a federal appeals court just upheld the tough abortion law passed by the Republican-led Texas legislature, 2016 Presidential hopeful Former Texas Governor Rick Perry joins us next on that.\n(COMMERCIAL BREAK)\nKELLY: A federal appeals court upholding a tough new Texas law that may close all but seven abortion clinics in the nation's second most popular state. Pro-choice critics say the law threatens the constitutional right of women to have an abortion. Former Texas Governor and 2016 Presidential Candidate Rick Perry is a champion of the law. He joins us now. Governor, did you sign this law?\nRICK PERRY, 2016 PRESIDENTIAL CANDIDATE: I did in June of 2013.\nKELLY: This is the one that Wendy Davis wore the pink sneakers and did the sort of filibuster and jumped up and down about saying this was going to effectively deny women in Texas their right to an abortion which has been recognized for better for worse -- I realize the controversy by the Supreme Court as an existing constitutional right, the right to privacy. And so on in their bodies. I assume you think the fifth circuit got it right. What do you say to those that this effectively eliminate abortion in the state of Texas?\nPERRY: It limits to 20 weeks. I think they're very wrong about the making that statement. And those facilities, there were three things in that bill, limiting it to 20 weeks. Making sure the standards were up to ambulatory surgical clinic standards. And the physician had to have admitting privileges at that facility.\nKELLY: Let me just jump in, critics say that's not necessary. The last two things are not necessary. There's been no proof that it's necessary. As a result of that the 17 abortion clinics that now exist are going to go down to seven and that millions of women -- nearly a million women will be at least 150 miles from the nearest abortion provider.\nPERRY: Megyn, what I would say in response is that the people of the state of Texas, we discussed this at length rather lengthy debate. This is really getting down to about women's health. The idea that you don't want a facility to have the same standards as an ambulatory surgical center, I think really goes counter to women's health. Admitting privileges of a physician makes sense as well. This is really about the issue of women's health. And making sure that they do have, if something does go wrong at one of the facilities, I think you would agree that you want to have pretty high standards in place to take care of them. If something did in fact go wrong.\nKELLY: Obviously the critics say it hasn't been necessary, this is a back door way of limiting abortion. Which pro-lifers say great, do it but pro-choicers say this is very controversial. They say they're going to take it up if they can to the U.S. Supreme Court. Where do you stand on the issue of abortion in terms of exceptions for rape, exceptions for incest, obviously to save the life of the mother?\nPERRY: I'm pro-life on all of those. And but Megyn I think, you know, the real issue for me is this has been settled in the state of Texas. And people may not agree across the board. Obviously they don't. From my perspective we need to be finding things that we can work together on to bring this country together. Democrats or Republicans I think we all want to have an economic climate where people can have a job. We want to have a country where our borders are secure, a country where we feel safe and secure, those are the big issues I think the bulk of the American people want to focus on.\nKELLY: Governor Rick Perry, always great to talk to you. Good night to have you given the -- we appreciate it.\nPERRY: Yes ma'am, so long.\nKELLY: By the way, in addition to our GOP primary debate on the evening of August 6th, Fox News channel also has Bill Hemmer and Martha MacCallum hosting our candidate forum earlier in the day. Then that evening, Brett Baier, Chris Wallace and yours truly will be on at around 9:00 p.m. Eastern and we will take you through the big event. Stay tuned.\n(COMMERCIAL BREAK)\nKELLY: Finally tonight, happy birthday to a \"Kelly File\" fan. Ruben Wilson is 96 years young. Would you look at this cake? He is a World War II veteran who served with the 77th Infantry in Okinawa and was the recipient of a Bronze Star. He regularly watches \"The Kelly File,\" he loves it so much, look what his family thought he would appreciate on his birthday? Look at that? Isn't that sweet? Get it. Happy birthday, Rube. We'll see you tomorrow night at 9:00.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\nthe-kelly-file The Kelly File , hosted by Megyn Kelly, airs on Weekdays at 9PM ET on Fox News Channel.\nMore on this show Advertisement\nAdvertisement", "external_links": [], "published": "2015-06-11T03:00:00.000+03:00", "crawled": "2015-06-12T00:11:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}