{"organizations": [], "uuid": "26342f9dd7853c63ad06646c4debaef4f5b943bb", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/062515_trs_trump1_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/entertainment/2015/06/26/nbc-distances-itself-from-donald-trump-over-mexican-immigration-comments/", "country": "US", "title": "NBC distances itself from Donald Trump over immigration comments", "performance_score": 4, "site": "foxnews.com", "participants_count": 25, "title_full": "NBC distances itself from Donald Trump over immigration comments | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-06-26T03:00:00.000+03:00", "replies_count": 24, "uuid": "e0c8018c899878fbf432d861e45589529bda853f"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/entertainment/2015/06/26/nbc-distances-itself-from-donald-trump-over-mexican-immigration-comments/#post-0", "ord_in_thread": 0, "title": "NBC distances itself from Donald Trump over immigration comments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published June 26, 2015 FoxNews.com livefyre Email Print\nNBC released a statement, distancing itself from GOP presidential hopeful Donald Trumps over his comments on Mexican immigrants.\n\"Donald Trump's opinions do not represent those of NBC, and we do not agree with his positions on a number of issues, including his recent comments on immigration,\" NBC said in a statement.\nTrump's fledgling GOP presidential bid quickly led to business fallout for him, with Univision saying it will drop the Miss USA pageant from its UniMas network and cut all ties with Trump.\nThe company said Thursday it was canceling its Spanish-language coverage of the pageant July 12. It also has severed its business relationship with the Miss Universe Organization, which produces the Miss USA pageant, because of what it called \"insulting remarks about Mexican immigrants\" by Trump, a part owner of Miss Universe.\nNBC remained silent about its scheduled coverage of the pageant, which has aired on the network since 2003. Trump is featured on another NBC program, \"Celebrity Apprentice.\"\nDuring his presidential campaign kickoff speech last week, Trump portrayed immigrants from Mexico as \"bringing drugs, they're bringing crime, they're rapists, and some, I assume, are good people.\" He also called for building a wall along the southern border of the U.S. The remarks drew condemnation from the Mexican government as \"biased and absurd.\"\nIn an interview Thursday, Trump said his criticism was directed against U.S. policymakers, not the Mexican people or government, adding that Univision would be defaulting on its contract if it doesn't air the pageant and he would take legal action.\n\"At Univision, we see firsthand the work ethic, love for family, strong religious values and the important role Mexican immigrants and Mexican-Americans have had and will continue to have in building the future of our country,\" said the New York-based Univision Communications Inc.\nTrump said Univision is submitting to pressure from Mexican leaders to punish him for positions he voices as a candidate on the campaign trail.\n\"They don't want me saying that Mexico is killing the United States in trade and killing the United States at the border,\" Trump said. \"Univision is totally laying down for the Mexican government. ... They want to silence Donald Trump. And Donald Trump can't be silenced. ... I have great respect for Mexico and I love the Mexican people, but my loyalty is to the United States.\"\nUnivision declined to comment on Trump's remarks. It also has the rights to air the Miss Universe pageant.\nIn an interview scheduled to air Sunday on Telemundo's \"Enfoque con José Díaz-Balart,\" Trump said that \"many bad people are coming in\" from Mexico and elsewhere.\n\"You're going to have terrorists coming through the southern border. There's no question about it,\" he said.\nThe host challenged Trump, contending there has been no act of terrorism committed by someone crossing the U.S.-Mexico border.\n\"You don't know that,\" Trump replied, adding later: \"See what happens tomorrow. See what happens in two weeks from now. ... I'm not even talking about terrorists from this region. I'm talking about from the Middle East they can come in. The border is totally open.\"\nIn severing her ties with the show, Puerto Rican actress Roselyn Sanchez, one of the two co-hosts, cited Trump's comments about immigrants.\n\"Since I heard Trump's speech, as a Latina I felt a lump in my stomach. 'It's got to be a joke,' I thought,\" the star of the Lifetime series \"Devious Maids\" told The Associated Press.\nAlso on Thursday, Chilean actor-producer Cristian de la Fuente, the show's other co-host, had strong words for Trump: \"It's a shame that such an important institution as Miss USA is now in the hands of a clown.\"\nSinger-songwriter Ricky Martin also took to Twitter to blast Trump.\n\"A lot of hatred and ignorance in his heart,\" he tweeted.\nMiss California USA Natasha Martinez was asked about Trump's comments during an interview Thursday on Los Angeles TV station KCAL and said they were \"a little bit tough to hear.\"\n\"But I know that this opportunity for me as Miss California-USA, and now competing for Miss USA, is a great bridge to kind of represent my community and let the world know that I am a proud Latino-American,\" she said.\nThis year's UniMas telecast would have been the first in a five-year contract that Trump said \"has no termination rights.\" Univision's wholly owned Spanish-language UniMas network, founded in 2013, is available in 70 million U.S. homes.\nThe Associated Press contributed to this report.\nAdvertisement\nON OUR RADAR Caitlyn Jenner pics\nTMZ Hottest WAGs in golf\nTMZ Alba's steamy photo shoot\nTMZ Stodden's mom to do sex tape?\nTMZ 'Teen Mom' mug shots\nTMZ Trending in Entertainment 1 Jason, Brie as sex addicts 2 'Bach' star: Lots of sex on show 3 Escape trick goes horribly wrong 4 Bristol Palin says she's pregnant for second time 5 Stern is quitting 'Talent' See all Trends Advertisement", "external_links": ["http://www.tmz.com/photos/2015/06/04/caitlyn-jenners-photos/images/2015/06/04/0604-caitlyn-jenner09-jpg/", "http://www.tmz.com/photos/2012/05/11/teen-mom-mugs-mugshots/images/2013/12/16/jenelle-evans-dec-2013-jpg/", "http://www.tmz.com/photos/2015/06/02/jessica-alba-shape-magazine-photos/images/2015/06/02/jessica-alba-shape-magazine-photos-01-jpg/", "http://www.tmz.com/2015/06/01/courtney-stodden-mom-porn-offer-xxx-deals-krista-keller/", "http://www.tmz.com/photos/2015/04/10/the-hottest-wags-of-golf-photos/images/2015/04/10/0410-gold-hot-wags-paulina05-jpg/"], "published": "2015-06-26T03:00:00.000+03:00", "crawled": "2015-06-26T16:35:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}