{"organizations": [], "uuid": "7cfdf98cbfe7e30ae24ccb839b3074a46f20eb09", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_040215getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/243914-obama-china-putting-out-feelers-on-joining-trade-deal", "country": "US", "title": "Obama: China ‘putting out feelers’ on joining trade deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: China ‘putting out feelers’ on joining trade deal", "spam_score": 0.0, "site_type": "news", "published": "2015-06-03T21:55:00.000+03:00", "replies_count": 0, "uuid": "7cfdf98cbfe7e30ae24ccb839b3074a46f20eb09"}, "author": "kballuck@thehill.com (Ben Kamisar)", "url": "http://thehill.com/policy/finance/243914-obama-china-putting-out-feelers-on-joining-trade-deal", "ord_in_thread": 0, "title": "Obama: China ‘putting out feelers’ on joining trade deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: China ‘putting out feelers’ on joining trade deal Getty Images By Ben Kamisar - 06/03/15 02:55 PM EDT \nChina is weighing membership in the Trans-Pacific Partnership (TPP), President Obama said Wednesday, a move that raises the stakes for the president’s signature trade deal. \nObama added that the deal would help provide a check on China, regardless of whether or not Beijing joins. \n“The fact is, if we have 11 leading economies in the Asia-Pacific region who have agreed to enforceable labor standards, enforceable environmental standards, strong IP protections, non-discrimination against foreign firms that are operating, access to those markets, reduced tariffs, then China is at least going to have to take those international norms into account,” he said. ADVERTISEMENT Obama is promoting the benefits of the TPP despite significant pressure from his own party to abandon it. That controversy led to a contentious Senate vote last week to pass a fast-track authority for Obama to negotiate the deal, with union leaders threatening political retribution against Democrats that joined with Republicans to pass it. Labor groups and some Democrats have argued that the deal would hurt American workers.\nSince holding China accountable is one of Obama’s major selling points of the deal, a decision by the world’s largest economy to join the agreement would be substantial, as Beijing would agree to play by the rules of the pact led by American negotiators. \nChinese officials have publicly gone back and forth over whether joining the TPP would benefit the country. \nEven if China decides to join, it would have to wait until the deal is completed to apply, like a handful of other countries that are weighing participation. China’s inclusion would put it alongside its main economic rival in the Pacific, Japan, which is already a part of the negotiations. \nRep. Paul Ryan (R-Wis.), a chief proponent of the deal, downplayed the idea of China joining the agreement during an interview Tuesday on Fox Business. \n“They're not anywhere near the level of being able to have a trade agreement with us because they will not agree to our standards,” he said, referring to China, on the network’s “Mornings with Maria.” \n“Maybe down the road they could, but right now they're nowhere close.” \nVotes on the fast-track legislation are expected this month in the House, where many expect a tough battle. Only 14 Democrats have agreed to support the measure, according to The Hill’s whip list , so the bill would have to pass with strong Republican support. Obama, however, says he has 20. \nWhite House press secretary Josh Earnest said in May that the administration is looking for a “slim, bipartisan majority.” \n— Vicki Needham contributed to this report. Tags:", "external_links": [], "published": "2015-06-03T21:55:00.000+03:00", "crawled": "2015-06-04T04:51:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}