{"organizations": [], "uuid": "3278a63c5fb459a7c4cef3e959dac6f39c4dd6a0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/243795-gop-obama-admin-find-common-ground-on-energy-infrastructure", "country": "US", "title": "GOP, Obama see common ground on energy infrastructure", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP, Obama see common ground on energy infrastructure", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T23:32:00.000+03:00", "replies_count": 0, "uuid": "3278a63c5fb459a7c4cef3e959dac6f39c4dd6a0"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/243795-gop-obama-admin-find-common-ground-on-energy-infrastructure", "ord_in_thread": 0, "title": "GOP, Obama see common ground on energy infrastructure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP, Obama see common ground on energy infrastructure By Timothy Cama - 06/02/15 04:32 PM EDT \nHouse Republicans have found reasons to agree with some parts of the Obama administration’s energy infrastructure proposal. \nGOP leaders in the House Energy and Commerce Committee told Energy Secretary Ernest Moniz that they are largely in agreement on the need to improve pipelines, electric transmission lines, energy storage and other pieces of infrastructure. ADVERTISEMENT Moniz testified at the hearing to promote the Quadrennial Energy Review, which the administration released in April to call for comprehensive infrastructure improvements worth billions of dollars.\n“Many people are even asking — not surprisingly — is there enough common ground between our efforts and the Obama administration to enact meaningful energy legislation,” Rep. Ed Whitfield (R-Ky.), chairman of the energy and power subcommittee, said at the Tuesday hearing. \n“I do believe that this question was answered with a clear ‘yes’ when the Department of Energy’s first installment of its Quadrennial Energy Review was released last April,” he said. \n“This detailed study focuses on the infrastructure implications of America’s new energy boom, and many of its recommendations overlap with provisions in our draft energy bill,” he continued. \nRep. Fred Upton (R-Mich.), the full committee’s chairman, agreed with Whitfield’s assessment and cited last month’s oil pipeline breach in California as a sign of the need. \n“Both the energy legislation and the QER include a number of ideas for upgrading and expanding the nation’s energy infrastructure,” Upton said. \n“And in light of the recent pipeline spill in California, I would add that both aim to ensure that this new infrastructure is built with state-of-the-art technologies that reduce the environmental and safety risks,” he said. \nMoniz said he was glad to see the Republicans’ willingness to work with Democrats and the administration in upgrading infrastructure. \n“I look forward to working with you to move these ideas forward, and I really appreciate in the opening remarks the statements about common ground and the opportunities we have to work together,” he said. \nInfrastructure is one piece of the House GOP’s ongoing effort to write a comprehensive energy reform package. Tags: Paul joins crusade to expose... The Bush administration blacked out 28 pages extracted from a... OSHA issues guidance on... Employees should have access to the restroom corresponding with their... Senate approves sweeping reforms... Senators voted more than 36 hours after parts of the Patriot Act expired. Lawmakers brace for marijuana vote... Pot advocates are expecting at least half a dozen pot and hemp measures to... Paul: 'I’m not going to take it... Roughly two dozen supporters of Paul crowded the Senate gallery. Administration preps new gun... The Justice department is moving forward with a flurry of new rules. Patriot Act expires as Paul blocks... Rare Senate Sunday session highlights tensions over NSA. McCain, Paul scuffle amid NSA... \"The senator from Kentucky needs to learn the rules of the Senate,\" McCain... Dennis Hastert's weird 2014 call... “Do you remember me from Yorkville?\" the caller asked. Juan Williams: Supreme Court risks... OPINION: Partisanship on the bench could gut the Affordable Care Act. TSA fails internal test, lets fake... The agency reportedly failed 67 of 70 internally conducted exams. Patriot Act's fate now in Rand... The only question now is how far the 2016 hopeful will go to kill the law. Mixing Christianity and politics... Right wing demagoguery is not Christianity in action. Sanders hits 'billionaire class'... \"This country and our government belong to all of us. Enough is enough,\"... Democrats buck Obama on water rule Dozens of Democrats are joining the GOP to fight the new EPA rule. Pro-Paul group unleashes fiery... The over-the-top ad slams Graham and the “capitulating Canadian” Cruz. Thousands of websites block... More than 10,000 sites are redirecting visitors from congressional IP... O’Malley looks for his opening Democrats interviewed by The Hill insist Martin O’Malley has a chance. Court sets July hearing on Obama's... The 5th Circuit Court of Appeals in New Orleans will hear arguments in... Clinton Foundation paid Blumenthal... Hillary Clinton had said Sidney Blumenthal's emails were \"unsolicited.\" Justice Department indicts former... Hastert is accused of lying to the FBI and illegally transferring millions... Judge skeptical of Obama’s call to... House Republicans are challenging Obama's use of executive power. Walker: EPA carbon rule '... The governor has “deep concerns\" about the state's ability to comply. Actuaries: GOP plans won't prevent... They say a ruling against the law would cause massive turmoil in the... ObamaCare expected to dominate... Republicans say the healthcare law will be a problem for the Democrat.", "external_links": [], "published": "2015-06-02T23:32:00.000+03:00", "crawled": "2015-06-03T02:21:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}