{"organizations": ["Fox News Latino Ellis Island Museum"], "uuid": "0330ba0aa2d6fe1fe3ee6dffd611520a4dcca3bc", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/lifestyle/0/0/Ellis%20Island%20Immigrat_Vros%20(8).jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/opinion/2015/06/02/opinion-real-leadership-on-immigration-is-emerging-in-unlikely-places/", "country": "", "title": "Opinion: Real leadership on immigration is emerging in unlikely places | Fox News Latino", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Opinion: Real leadership on immigration is emerging in unlikely places | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "0330ba0aa2d6fe1fe3ee6dffd611520a4dcca3bc"}, "author": "", "url": "http://latino.foxnews.com/latino/opinion/2015/06/02/opinion-real-leadership-on-immigration-is-emerging-in-unlikely-places/", "ord_in_thread": 0, "title": "Opinion: Real leadership on immigration is emerging in unlikely places | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ellis Island Museum to update story of immigration \nThe new exhibition is heavily interactive, and visual, with video snippets from immigrants telling their stories. \nNews reports would have you believe the courts are an insurmountable obstacle for President Obama’s executive action on immigration. \nFirst of all, not so fast. Second, and even better, the real action on immigration lies with states and with local leaders. \nAs for executive action, last week the Fifth Circuit Court of Appeals ruled 2-1 to deny a motion by the Obama administration that would have allowed expanded deferred action, a central part of the executive action Obama announced in November, to take effect while an underlying legal challenge moves through the courts. \nIt wasn’t good news for the administration, but we are far from a last word. In early July the Fifth Circuit will rule on the actual merits of the case. Most think the case will end up in front of the Supreme Court sometime in the next 12 months. \nBut real leadership on immigration is emerging in unlikely places: Nebraska, Iowa, South Carolina and Alabama. \nIn each of these states, conservative voices are speaking in favor of a more compassionate conversation about immigration and for action from Congress. \nOn Thursday, the Nebraska legislature overrode the governor’s veto to pass a law that allows Dreamers to seek driver’s licenses, which they now can do in all 50 states. Conservative business and faith leaders in Nebraska led the way and cheered the result . The vote was a resounding 34-10. \nThis in a state that is 86 percent white and only 9 percent people of Hispanic origin. The Nebraska Republican Party controls five out of six statewide offices, both of the state's U.S. Senate seats and two of the state's three U.S. House seats. The legislature is officially nonpartisan, but legislators' political affiliations reveal a Republican supermajority. \nMeanwhile, early last week, the Rev. Robbie McAlister of Riverbend Church in Lexington, S.C., penned an op-ed in that state’s largest newspaper. Pastor McAlister urged the candidates for president in 2016 to engage in a different conversation about immigrants and immigration. \nOther evangelical leaders are making the same arguments, including the Revs. John Opgenorth and John Shaull in Iowa and the Rev. Alan Cross in Alabama. \nHere’s the thing: These unusual voices aren’t so unusual anymore. Around the country, not just faith but also law enforcement, business and community leaders have rejected politicking about immigration. \nThat’s because they recognize that America thrives when immigrants have access to the opportunities, skills and status that allow them to reach their fullest potential. \nThey are working to meet President Reagan’s vision of a “shining city on a hill … teeming with people of all kinds living in harmony and peace.” \nThanks to this different conversation, Congress has the opportunity to take action – right now – and replace our broken immigration system. \nRepublicans can pass real, permanent reform that makes executive action moot and take credit for a new process that respects the rule of law, boosts our economy and keeps families intact. Or they can take credit for perpetuating a system that is failing all of us. \nTheir choice has implications for 2016. With broad American consensus in favor of immigration reform and without progress in Congress, it is no surprise that immigration is playing so prominently in the presidential race. \nSerious candidates know pro-reform voters across party lines are up for grabs. Candidates need to talk about the real costs of a broken system, while also addressing what they’re going to do about 11 million undocumented immigrants who have no path forward. \nThese are real people and families who are part of our communities, and they should have the opportunity to come forward and earn eventual legal status and citizenship. \nPeople recognize how greatly we will benefit when everyone can contribute fully, no matter where they were born. \nVoters expect the same from Congress and from candidates. \nAli Noorani is Executive Director of the National Immigration Forum. \nLike us on Facebook ", "external_links": [], "published": "2015-06-03T03:00:00.000+03:00", "crawled": "2015-06-03T17:26:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}