{"organizations": ["Iran", "Channel", "U.N.", "Congress", "General Assembly", "Israeli Cabinet", "U.N. General Assembly", "Likud", "State", "White House", "House", "United Nations", "Knesset", "U.S. House Government Reform Committee", "U.S. Congress"], "uuid": "0a0fc03c21b89764fbb130706114209a78b99d61", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/06/01/politics/obama-iran-israel/index.html", "country": "", "title": "Obama: U.S. strike won't end Iran's nuclear program - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama: U.S. strike won't end Iran's nuclear program - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-06-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "0a0fc03c21b89764fbb130706114209a78b99d61"}, "author": "", "url": "http://www.cnn.com/2015/06/01/politics/obama-iran-israel/index.html", "ord_in_thread": 0, "title": "Obama: U.S. strike won't end Iran's nuclear program - CNNPolitics.com", "locations": ["United States", "Iran", "Gaza", "West Bank", "Entebbe Airport", "Israel", "London", "Caesarea", "California", "Jordan", "Judean Desert", "Vienna", "Middle East", "Tel Aviv", "Tehran", "Washington", "Madrid", "Uganda", "Sayeret Matkal", "Israeli", "Likud-Beiteinu", "Egypt", "New York", "U.S.", "Beverly Hills", "Sharm El-Sheikh", "Jerusalem"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Hassan Rouhani", "Bill Clinton", "Avner", "Madeleine Albright", "Benjamin Netanyahu", "Annan", "Elyakim Rubinstein", "Shimon Peres", "Hillary Clinton", "Miriam", "Mahmoud Abbas", "Netanyahu", "David Levy", "Abbas", "Hassan", "Kofi Annan", "Yonatan", "Douglas", "Arafat", "Hussein", "Kirk Douglas", "Christie", "Tzipi Livni", "Yasser Arafat", "Ariel Sharon", "Obama", "Avigdor Lieberman", "Hosni Mubarak", "David Cameron", "Sara", "Yitzhak Shamir", "Nachum Braverma", "Zalman Shazar", "Cruz", "Sorin Hershko", "Shamir", "Noa"], "text": "What's next: Iran nuclear talks resume in Vienna 05:07 Washington (CNN) Conducting a military strike on Iran would stall the country's nuclear program but ultimately wouldn't stop Tehran from obtaining a nuclear weapon, President Barack Obama said in an interview with an Israeli television station. Obama and his administration have one month to finalize a deal with Tehran to curb its nuclear activity. Critics of the agreement, including Israeli Prime Minister Benjamin Netanyahu, claim it will empower Iran by loosening longstanding sanctions without sufficient concessions in return. READ: Cruz, Christie go after Obama on Israel But the President told Israel's Channel 2 Friday that the deal he hopes to complete by July 1 is the only way to keep Iran from obtaining a nuclear weapon. \"The best way to prevent Iran from having a nuclear weapon is a verifiable, tough, agreement,\" he said in a excerpt of the interviewed released Monday. \"A military solution will not fix it, even if the United States participates. It would temporarily slow down an Iranian nuclear program but it would not eliminate it.\" Netanyahu's life in pictures 38 photos Israeli Prime Minister Benjamin Netanyahu speaks in Jerusalem during a weekly Cabinet meeting in November 2013. Click through to see more photos from his life and career. Hide Caption 1 of 38 Netanyahu's life in pictures 38 photos Netanyahu, right, sits with a friend at the entrance to his family home in Jerusalem on July 1, 1967. The Israeli prime minister was born October 21, 1949. Hide Caption Netanyahu's life in pictures 38 photos Netanyahu, right, with a friend in the Judean Desert on May 1, 1968. Hide Caption 3 of 38 Netanyahu's life in pictures 38 photos Netanyahu serves in the Sayeret Matkal, an elite commando unit of the Israeli army, in 1971. He spent five years in the unit. Hide Caption 4 of 38 Netanyahu's life in pictures 38 photos Netanyahu shakes hands with Israeli President Zalman Shazar during a November 1972 ceremony honoring the Sayeret Matkal soldiers who freed hostages in a hijacking earlier that year. Hide Caption Netanyahu's life in pictures 38 photos Netanyahu and his first wife, Miriam, in June 1980. Hide Caption Netanyahu's life in pictures 38 photos Netanyahu and his daughter, Noa, in June 1980. Hide Caption 7 of 38 Netanyahu's life in pictures 38 photos Netanyahu speaks in July 1986 with Sorin Hershko, one of the Israeli soldiers wounded in Operation Entebbe. It was the 10th anniversary of Operation Entebbe, a dramatic rescue of Jewish hostages at Uganda's Entebbe Airport. Netanyahu's brother, Yonatan, was killed leading Operation Entebbe in 1976. Affected by his brother's death, Netanyahu organized two international conferences on ways to combat terrorism, one in 1979 and another in 1984. Hide Caption Netanyahu's life in pictures 38 photos From 1984 to 1988, Netanyahu was Israel's ambassador to the United Nations. Hide Caption 9 of 38 Netanyahu's life in pictures 38 photos Netanyahu talks to Israeli Prime Minister Yitzhak Shamir on a stroll in New York's Central Park in November 1987. Hide Caption 10 of 38 Netanyahu's life in pictures 38 photos Netanyahu, as Israel's deputy foreign minister, goes through some papers as Government Secretary Elyakim Rubinstein recites morning prayers on a flight from New York to Washington in April 1989. Hide Caption Netanyahu's life in pictures 38 photos Shamir speaks with Netanyahu at a Middle East peace conference in Madrid in October 1991. Hide Caption Netanyahu's life in pictures 38 photos Netanyahu celebrates after being elected chairman of the right-wing Likud party on March 21, 1993. Hide Caption 13 of 38 Netanyahu's life in pictures 38 photos Netanyahu and former foreign minister David Levy sit in the Knesset during the vote for a new Israeli President on March 24, 1993. Hide Caption 14 of 38 Netanyahu's life in pictures 38 photos Netanyahu meets with King Hussein of Jordan, center, and Crown Prince Hassan in December 1994. It was Netanyahu's first visit to Jordan. Hide Caption 15 of 38 Netanyahu's life in pictures 38 photos Netanyahu shakes hands with outgoing Israeli Prime Minister Shimon Peres before taking the office himself in June 1996. Hide Caption 16 of 38 Netanyahu's life in pictures 38 photos Netanyahu meets with Palestinian leader Yasser Arafat for the first time on September 4, 1996, at an Israeli army base at the Erez Checkpoint in Gaza. Hide Caption Netanyahu's life in pictures 38 photos Netanyahu meets with U.S. Secretary of State Madeleine Albright in Washington in February 1997. Hide Caption 18 of 38 Netanyahu's life in pictures 38 photos Netanyahu spends the day on the beach with his wife, Sara, and son Avner in Caesarea, Israel, on August 16, 1997. Hide Caption 19 of 38 Netanyahu's life in pictures 38 photos Actor Kirk Douglas holds the King David Award, presented to him by the Jerusalem Fund Aish Ha Torah during a dinner in Beverly Hills, California, on November 17, 1997. Douglas was honored for his inspirational commitment to Israel and the Jewish people and in recognition of his new book \"Climbing the Mountain.\" Netanyahu is on the left. To the right is Rabbi Nachum Braverma, director of the Jerusalem Fund Aish Ha Torah. Hide Caption 20 of 38 Netanyahu's life in pictures 38 photos Netanyahu looks through binoculars during a tour of the West Bank with the Israeli Cabinet on December 28, 1997. Hide Caption 21 of 38 Netanyahu's life in pictures 38 photos Netanyahu and U.N. Secretary-General Kofi Annan meet in Annan's office in New York on May 15, 1998. Hide Caption 22 of 38 Netanyahu's life in pictures 38 photos From left, Arafat, King Hussein, U.S. President Bill Clinton and Netanyahu sign an interim Middle East peace agreement in October 1998. Hide Caption 23 of 38 Netanyahu's life in pictures 38 photos Netanyahu thanks a crowd of supporters in Tel Aviv, Israel, at a Likud party meeting in May 1999. The outgoing Prime Minister announced that he was quitting the Knesset and stepping down as party leader 10 days after being defeated in elections. Hide Caption 24 of 38 Netanyahu's life in pictures 38 photos Netanyahu testifies before the U.S. House Government Reform Committee on September 20, 2001. The committee was conducting hearings on terrorism following the September 11 attacks. Hide Caption 25 of 38 Netanyahu's life in pictures 38 photos Netanyahu, as Israel's foreign minister, laughs with Israeli Prime Minister Ariel Sharon at the start of a Likud convention in Tel Aviv on November 12, 2002. Hide Caption 26 of 38 Netanyahu's life in pictures 38 photos Netanyahu and his wife, Sara, are seen at a polling station in Jerusalem on August 14, 2007. He was re-elected as head of the Likud party. Hide Caption 27 of 38 Netanyahu's life in pictures 38 photos Netanyahu shakes hands with Israeli President Shimon Peres in February 2009 after Netanyahu won backing from the Israeli parliament to become Prime Minister again. A close election between Netanyahu and rival Tzipi Livni had left the results unclear until the parliament's decision. Hide Caption 28 of 38 Netanyahu's life in pictures 38 photos From left, Egyptian President Hosni Mubarak, Netanyahu, U.S. President Barack Obama, Palestinian President Mahmoud Abbas and Jordan's King Abdullah II walk to the East Room of the White House to make statements on the Middle East peace process on September 1, 2010. Hide Caption Netanyahu's life in pictures 38 photos Obama meets with Netanyahu at the White House in September 2010. Hide Caption 30 of 38 Netanyahu's life in pictures 38 photos U.S. Secretary of State Hillary Clinton looks on as Abbas and Netanyahu shake hands in Sharm El-Sheikh, Egypt, on September 14, 2010, during a second round of Middle East peace talks. Hide Caption 31 of 38 Netanyahu's life in pictures 38 photos British Prime Minister David Cameron welcomes Netanyahu to 10 Downing Street in London on May 4, 2011. Hide Caption 32 of 38 Netanyahu's life in pictures 38 photos Netanyahu address a joint session of the U.S. Congress on May 24, 2011. He said that he was prepared to make \"painful compromises\" for a peace settlement with the Palestinians, but he repeated that Israel will not accept a return to its pre-1967 boundaries. Hide Caption 33 of 38 Netanyahu's life in pictures 38 photos Netanyahu uses a diagram of a bomb to describe Iran's nuclear program while delivering an address to the U.N. General Assembly on September 27, 2012. Netanyahu exhorted the General Assembly to draw \"a clear red line\" to stop Iran from developing nuclear weapons. Hide Caption 34 of 38 Netanyahu's life in pictures 38 photos Netanyahu and Avigdor Lieberman of the Likud-Beiteinu coalition party greet supporters as they arrive onstage on election night in January 2013. The Likud-Beiteinu won 31 seats in the Knesset. Hide Caption 35 of 38 Netanyahu's life in pictures 38 photos Netanyahu speaks at the U.N. General Assembly on October 1, 2013. He accused Iranian President Hassan Rouhani of seeking to obtain a nuclear weapon and described him as \"a wolf in sheep's clothing, a wolf who thinks he can pull the wool over the eyes of the international community.\" Hide Caption 36 of 38 Netanyahu's life in pictures 38 photos In December, Netanyahu called for early elections as he fired two key ministers for opposing government policy. Hide Caption 37 of 38 Netanyahu's life in pictures 38 photos Netanyahu is greeted by members of Congress as he arrives to speak in the House chamber on Tuesday, March 3. Hide Caption 38 of 38 The proposed deal with Iran has strained U.S.-Israel ties, with Obama repeatedly defending his commitment to Israel's security. He spoke last month at a synagogue in Washington and told the audience that the Iran deal would ensure Iran doesn't acquire nuclear weapons. In the Channel 2 interview, Obama told Israelis: \"I understand your concerns and I understand your fears.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News ", "external_links": [], "published": "2015-06-02T03:00:00.000+03:00", "crawled": "2015-06-02T04:47:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}