{"organizations": [], "uuid": "cadf764e544ec8dd38029edb34c49ed6415e90b4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3091318/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/06/18/obama-gun-violence-_n_7615838.html", "country": "", "title": "Watch Obama Address Homicidal Gun Violence Again, And Again, And Again, And Again, And...", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Watch Obama Address Homicidal Gun Violence Again, And Again, And Again, And Again, And...", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T01:56:00.000+03:00", "replies_count": 0, "uuid": "cadf764e544ec8dd38029edb34c49ed6415e90b4"}, "author": "", "url": "http://www.huffingtonpost.com/2015/06/18/obama-gun-violence-_n_7615838.html", "ord_in_thread": 0, "title": "Watch Obama Address Homicidal Gun Violence Again, And Again, And Again, And Again, And...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Watch Obama Address Homicidal Gun Violence Again, And Again, And Again, And Again, And... Posted: reddit \nPresident Barack Obama found himself in a familiar, dark place on Thursday: addressing the nation about a shooting that had taken multiple lives. \nIt was the 14th time during his administration that he had been forced to issue a statement in response to a mass killing, according to CBS’ Mark Knoller . And his frustration over having to repeatedly mark these morose occasions clearly weighed on him. The president spent a large part of his remarks bemoaning how the political system has completely failed to respond to gun violence. \nA look back underscores the growing sense of hopelessness the president must feel. Once clinical and business-like when responding to tragedy, Obama now seems emotionally worn down and at times overtly angry when these incidents occur. Above is footage of the president in the wake of gun-related violence: from the shooting at Fort Hood, Texas, to the killings in Aurora, Colorado; the near-assassination of Gabby Giffords to the slaughtering of children in Newtown, Connecticut; the murders at a Sikh temple in Milwaukee to the latest deaths at a black church in Charleston, South Carolina. Watch the video above. How The Media Covered The Most Heinous Attack On A Black Church In U.S. History \nFor a window into the public reaction to the 1963 bombing, here are some of the front pages of local newspapers from across the country the day after the attack. Virtually all of the articles themselves are the same Associated Press or United Press International wire stories. But the headlines, photos and placement of the stories hint at the varying degrees of shock, grief, fear and indifference with which different communities reacted to the crime. \nThe Anniston Star, Anniston, Alabama. What Dylann Roof's Rhodesian Flag Tells Us \n\"The Rhodesian flag is important in terms of symbolism, for Rhodesia subscribed to white supremacy,\" Blessing-Miles Tendi, a lecturer in African history and politics at Oxford, explained in an email. \"A minority, racist, colonial white settler state subjugated a majority black population in the then Rhodesia for approximately a century.\" \nDylann Roof, pictured in a photo uploaded to Facebook last month, is suspected of shooting nine people dead in Charleston, South Carolina, on Wednesday night. \nDespite its obscurity in American political discourse, Rhodesia is well-known to white racists. Rhodesian flag patches are often \"sold at National Alliance, Aryan Nation, and Ku Klux Klan events,” Todd Blodgett, who once co-owned a white nationalist record label, told The Wall Street Journal Thursday. Charleston Heckler Calls CNN's Don Lemon And Obama 'Uncle Toms' \nHuffPost's Gabriel Arana reports: For once, CNN anchor Don Lemon isn't making news for malapropisms or off-color questions . \nDuring a live segment Thursday in Charleston, South Carolina, following the church massacre there, a black woman heckled Lemon and CNN co-host John Berman on camera, calling Lemon and President Barack Obama “Uncle Toms” -- a derogatory term for black people who are considered subservient to whites. This Map Shows Why The Charleston Shooting Wasn't Just \"Anti-Christian\" \nFollowing the mass shooting Wednesday night at a historic black church in Charleston, South Carolina, some conservatives have suggested that the tragedy had less to do with race and more to do with a supposed anti-Christian vendetta. A closer look at the neighborhood, however, reveals the shakiness of that theory... With respect to idea this wasn’t about race, gotta ask why this specific church w/ so many others around it? pic.twitter.com/K4CPqTT15o \n— Sam Stein (@samsteinhp) June 18, 2015 \nA glance at the neighborhood surrounding the AME Church -- which is the oldest African Methodist Episcopal church in the South, and was founded by former slave Denmark Vesey -- shows there are numerous other Christian houses of worship in the area. It's worth asking, then, why a gunman simply looking to target Christians would have chosen this particular church. \nTa Nehisi-Coates writes in The Atlantic that the confederate flag flying in front of the South Carolina Capitol represents everything Dylann Roof stands for: \nTake down the flag. Take it down now. \nPut it in a museum. Inscribe beneath it the years 1861-2015. Move forward. Abandon this charlatanism. Drive out this cult of death and chains. Save your lovely souls. Move forward. Do it now. Family Says Suspect Espoused Racist Views \nDylann Roof's family told The Wall Street Journal that he had espoused racist views and become a loner in the last couple of years. According to the Journal's report, Roof was a good student as a child, but stopped going to high school in 2010. \n“He apparently told people that he was involved in groups, racist groups,” a woman who said she was the mother of Mr. Roof’s former stepmother told the Journal. \nRoof was arrested on February 28 at a Columbia, SC mall, where he \"was wearing all black and rattling employees at two stores with unusual questions about staffing and operating hours.\" He was found with the powerful narcotic Suboxone at the time of his arrest. He was arrested again in April when he was spotted at the mall, violating a yearlong ban. \nThe man suspected of killing nine people at a Charleston, South Caroline church Wednesday night and then fleeing north has reportedly waived extradition and is headed back to South Carolina, the Associated Press reports . \n--Kim Bellware Hillary Clinton: U.S. Must 'Face Hard Truths' On Race And Violence \nA day after nine people were shot and killed in a historically black church in Charleston, South Carolina, Democratic presidential candidate Hillary Clinton urged the country to \"face hard truths about race, violence, guns and division,\" including hateful rhetoric directed at immigrants. \n\"When I hear words of hatred and anger directed at any of our fellow human beings, I ask myself, what is motivating that?\" she said in a speech at the National Association of Latino Elected Officials conference in Las Vegas. \"Do the people who feel so much hatred and anger ever look in the mirror and realize that they too are fellow human beings?\" \nRead the full story here . \n-- Elise Foley \nDebbie Dillis, a bookkeeper working in the North Carolina town where Dylann Roof was captured, told ABC News how she was able to tip off the police to his whereabouts. NEW: Tipster called 911 after realizing driver with bowl haircut was church shooting suspect: http://t.co/ebjKvvix0f pic.twitter.com/ZUySET80JD \n— ABC News (@ABC) June 18, 2015 \nShe spotted the suspected shooter in the car next to her and recognized his bowl haircut, she told ABC News , as well as a tag on his car cited in a police report. She called her husband who contacted the authorities. \nRead the full story here . \n-- Sam Stein and Paul Raushenbush It's Actually Illegal To Remove The Confederate Flag From South Carolina's Statehouse \nThe fact that the Confederate flag was waving high in the state capital of Columbia hours after suspected gunman Dylann Roof carried out what's believed to be a racially motivated attack sparked outrage. But despite calls for the flag's removal, the Confederate flag's presence on the statehouse grounds remains legally protected under the 2000 South Carolina Heritage Act. Watch Obama Address Homicidal Gun Violence Again, And Again, And Again... \nPresident Barack Obama found himself in a familiar, dark place on Thursday: addressing the nation about a shooting that had taken multiple lives. \nIt was the 14th time during his administration that he had been forced to issue a statement in response to such a mass killing, according to CBS’s Mark Knoller . And his frustration over having to repeatedly mark these morose occasions clearly weighed on him. The president spent a large part of his remarks bemoaning how the political system has completely failed to respond to gun violence. Tip From Florist Led To Suspect's Arrest \nA florist in the town of Shelby, NC gave the police a tip that led to Charleston shooting suspect Dylann Roof's arrest, reports the Shelby Star . Debbie Dills, who was running late for work, spotted Roof driving on Highway 74. She then called her boss, Todd Frady, for advice. Frady called the police, who apprehended Roof within minutes. Bernie Sanders Postpones Trip To Charleston \nDemocratic presidential hopeful Bernie Sanders is postponing a planned trip to Charleston, he said in an email to supporters. Sanders encouraged his supporters to donate to the Emanual AME Church . \n“The Charleston church killings are a tragic reminder of the ugly stain of racism that still taints our nation,\" Sanders said in a statement. \"This senseless violence fills me with outrage, disgust and a deep, deep sadness. The hateful killing of nine people praying inside a church is a horrific reminder that, while we have made significant progress in advancing civil rights in this country, we are far from eradicating racism. Our thoughts and prayers are with the families and their congregation.” \n-- Paige Lavender Roommate: Suspect 'Wanted To Start A Civil War' \nABC News reports that Dalton Tyler, the roommate of suspect Dylann Roof, said that Roof had shown warning signs of his impending act of violence. Tyler claimed that Roof had been “planning something like that for six months.\" He also said that Roof was \"big into segregation and other stuff,\" and that he \"wanted to start a civil war. He said he was going to do something like that and then kill himself.” Emanuel AME's Long History Of Civil Rights Work \nEmanuel African Methodist Episcopal Church in Charleston, South Carolina, where a shooting left nine people dead Wednesday night, has a history of civil rights activism and has long been one of the most prominent historic black churches in the South. \nCalled “Mother Emanuel,” the church -- home to one of oldest black Christian communities in the country -- was established in 1816 after black members of the city’s main Methodist church left because of racial discrimination. For nearly 200 years, it has been home to clergy who have gone on to become politicians, leaders of the abolition movement and civil rights crusaders. One of the shooting’s victims, church pastor Rev. Clementa Pinckney, was a Democratic state senator. \nThroughout the church's history, it has hosted speakers including Booker T. Washington -- who brought a crowd of white supporters to its pews during a 1909 speech -- Martin Luther King Jr. and Wyatt T. Walker of the Southern Christian Leadership Conference. King’s widow, Coretta Scott King, led a march toward the church in 1969 to support the city’s striking hospital workers. Statement From NAACP On Roof's Arrest \nNAACP President and CEO Cornell William Brooks issued a statement on the arrest of Dylann Roof: \n“We are as thankful for the apprehension of the alleged Charleston shooter as we are horrified by the blood curdling heinousness of this act. We appreciate the swift work of federal, state, and local authorities in apprehending the alleged shooter. We commend, encourage, and will continue to support the ongoing investigation and prosecution of the person responsible for the deaths of nine students of scripture in a beloved sanctuary. The NAACP family continues to pray for the family of Emanuel African Methodist Episcopal Church, the late pastor, the Reverend Clementa Pinckney, and those who lost their lives in the Bible study. As we mourn their senseless deaths, we remain resolved to continue facing evil and fighting for justice in every corner of America. \nOur century-old, ongoing work of confronting violence with nonviolence, hate with love, and racism with the highest ideas of our democracy yet continues. The mayor, police chief, and witnesses describe this shooting as a hate crime. The coward who murdered nine parishioners in a church set a new and depraved standard of inhumanity. We, as Americans, by our resolve, determination, and commitment, through our faith, will set an infinitely higher standard of humanity.” ", "external_links": [], "published": "2015-06-19T01:56:00.000+03:00", "crawled": "2015-06-19T02:24:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}