{"organizations": [], "uuid": "d40a7ff1fe3f6a5aa024d0e96cd4a03dab4a0141", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3092008/images/o-MCCONNELL-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/dc/news.xml", "section_title": "DC News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/06/18/senate-fast-track_n_7617596.html?utm_hp_ref=dc&ir=DC", "country": "US", "title": "McConnell Tries 'Trust Me' Strategy To Pass Obama Trade Bills", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "McConnell Tries 'Trust Me' Strategy To Pass Obama Trade Bills", "spam_score": 0.0, "site_type": "news", "published": "2015-06-19T04:08:00.000+03:00", "replies_count": 0, "uuid": "d40a7ff1fe3f6a5aa024d0e96cd4a03dab4a0141"}, "author": "Michael McAuliff", "url": "http://www.huffingtonpost.com/2015/06/18/senate-fast-track_n_7617596.html?utm_hp_ref=dc&ir=DC", "ord_in_thread": 0, "title": "McConnell Tries 'Trust Me' Strategy To Pass Obama Trade Bills", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McConnell Tries 'Trust Me' Strategy To Pass Obama Trade Bills Posted: reddit \nWASHINGTON -- Senate Majority Leader Mitch McConnell (R-Ky.) moved Thursday evening to secure passage of President Barack Obama's trade agenda, employing a strategy to keep supportive Democrats on board that amounts to \"trust me.\" \nMcConnell's moves came after the House narrowly voted to give Obama the power he needs to fast-track mega-trade deals through Congress -- a victory House Speaker John Boehner (R-Ohio) achieved without also proceeding on Trade Adjustment Assistance, the worker relief program that most Democrats say they need before they'll support trade deals. \nFor McConnell, that meant he had to find a way to keep the backing of 14 Democrats who voted last month for fast-track authority, or Trade Promotion Authority as it is formally known, including many who said at the time that they also must have that trade adjustment program. \nMcConnell's solution, essentially, was to make a promise. Immediately after filing for a vote on TPA -- likely Tuesday -- he filed for a similar vote on TAA, possibly on Wednesday. \nIt means that when Democrats decide whether to give Obama sweeping powers to finish several trade deals that dwarf the infamous NAFTA, they'll have no guarantee that trade assistance will pass and be there to help workers who are expected to lose jobs because of the trade pacts. There's even less guarantee that Boehner will be able to advance the aid measure. \nBut McConnell, who has been meeting with trade supporters on both sides of the aisle and talking to the White House, contended that's the way to move ahead. \n“In the judgement of members of both parties in the House and the Senate, our best way forward now is to consider TPA and TAA separately,\" he said, making his appeal for trust. \n“Here’s what it’s going to take: One, working together toward the shared goal of a win for the American people. Two, trusting each other to get there,\" McConnell said. “I think we can.\" \n\"TAA will come second after TPA, but the votes will be there to pass it -- reluctantly, not happily, but they will be there,\" he insisted. \nTo sweeten the pot for Democrats, the TAA provisions will be tacked onto a trade preferences bill that aims to help African nations, which many Senate Democrats also voted for when the trade package came up in May. \"Assuming everyone has a little faith and votes the same way they just did a few weeks ago, we’ll be able to get all of these bills to the president soon,\" McConnell said. \nOne senior Democratic aide scoffed at the notion of trusting McConnell, who was able to get a handful of reluctant Democrats to vote for fast track by promising a vote on the Export-Import Bank that expires next month and is important to them. The vote they got was to table the matter, the aide noted. \nOutside groups opposing fast track also scoffed at the promises to pass TAA second. One, the Communication Workers of America, said in a press release that \"the plan for the Senate and House to move forward on Trade Adjustment Assistance (TAA) after securing fast track legislation is at odds with common sense and is already imperiled,\" and that Democrats who believe Republican pledges \"have a misplaced faith in the GOP and the functionality of Congress.\" \nUnions have been especially aggressive in fighting the trade deals because of past job losses, and have tried to keep up that pressure by singling out Democratic senators who have said they need TAA to support TPA, including Sens. Maria Cantwell (D-Wash.), Debbie Stabenow (D-Mich.), Ron Wyden (D-Ore.), Patty Murray (D-Wash.), Mark Warner (D-Va.) and Tom Carper (D-Del.). \nWhen the Senate passed fast track last month and it was combined with TAA, it got 62 votes -- just over the 60-vote threshold to break filibusters. If McConnell loses three of the 14 Democrats who supported it over distrust of the process, fast track would fail. \nAsked why he is willing to take that chance, McConnell spokesman Don Stewart replied that when Congress tried it the other way, House Democrats were willing to vote down TAA last week to stop TPA. \"We tried it that way before, that’s what killed it, remember?\" Stewart said. \"I think everyone agrees this is the best path forward.\" \nStewart would not say what assurances McConnell received from the 14 fast-track Democrats. Emails to representatives for Murray, who is a member of the Democratic leadership, and Wyden, who is the Democratic sponsor of the trade package, were not immediately answered. \nMichael McAuliff covers Congress and politics for The Huffington Post. Talk to him on Facebook. More:", "external_links": [], "published": "2015-06-19T04:08:00.000+03:00", "crawled": "2015-06-19T05:55:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}