{"organizations": [], "uuid": "e4e25f0963f070a4a709b086458a2ed89db815a9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/new-york-daily-news/feed", "section_title": "New York Daily News on Huffington Post", "url": "http://www.huffingtonpost.com/warren-j-blumenfeld/trump-joins-narratives-of_b_7604740.html", "country": "US", "title": "Warren J. Blumenfeld: Trump Joins Narratives of Hate over Immigration Battles", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Warren J. Blumenfeld: Trump Joins Narratives of Hate over Immigration Battles", "spam_score": 0.0, "site_type": "news", "published": "2015-06-18T13:12:00.000+03:00", "replies_count": 0, "uuid": "e4e25f0963f070a4a709b086458a2ed89db815a9"}, "author": "Warren J. Blumenfeld", "url": "http://www.huffingtonpost.com/warren-j-blumenfeld/trump-joins-narratives-of_b_7604740.html", "ord_in_thread": 0, "title": "Warren J. Blumenfeld: Trump Joins Narratives of Hate over Immigration Battles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThe gigantic cover banner headline , \"CLOWN RUNS FOR PREZ,\" appeared on the New York Daily News the morning following real estate mogul Donald Trump's announced run for the office of the presidency. While apt in many ways, I would not represent Trump this way since clowns traditionally never speak. And as we know all too well, \"silence\" has never been a descriptor of Donald Trump. Such words I would use for Trump include adjectives like \"narcissistic,\" \"egotistical, \"xenophobic,\" and \"racist.\" \nWhile some others in contention for the White House on the Republican side understand that their chances hinge on attracting a more diverse segment of the electorate in addition to older white people, Trump figuratively spit in the faces of minoritized \"racial\" groups, in particular Latinos and Latinas, during his off-scripted rambling announcement speech: \n\"The US has become a dumping ground for everyone else's problems,\" he said. \"[Mexico] are sending people that have lots of problems, and they are bringing those problems to us. They are bringing drugs, and bringing crime, and they're rapists.\" \nTrump eventually enlarged his dehumanizing representations to include people in all of Latin America. \nDonald Trump, arguably the more prominent of the so-called \"birthers,\" continually accused President Obama of illegitimacy as Commander in Chief by arguing that he was born outside the United States, even well after the President released his official birth certificate. This along with his supposed investigations into Mr. Obama's time spent in Indonesia as a child, and inquiries into his African roots on his father's side coexist as not-so-veiled xenophobic and racist threats. Trump echoes other politicians who also currently demonize immigrants coming from our southern borders. According to Iowa Republican Representative Steve King: \n\"There are kids that were brought into this country by their parents unknowing they were breaking the law...[and] they weren't all brought in by their parents. For every one who's a valedictorian, there's another 100 out there who weigh 130 pounds and they've got calves the size of cantaloupes because they're hauling 75 pounds of marijuana across the desert....\" \nAnd Florida Republican Representative Rich Nugent : \n\"Listen, if you're 14, 15, 16, 17 years old, and you're coming from a country that's gang-infested -- particularly with MS-13 types, that is the most aggressive of all the street gangs -- when you have those types coming across the border, they're not children at that point. These kids have been brought up in a culture of thievery, a culture of murder, of rape. And now we are going to infuse them into the American culture. It's just ludicrous.\" \nAnd, of course, we cannot exclude Phil Gingrey, Georgia Republican Representative, who warns of grave public health threats. In a July 7, 2014, letter Gingrey wrote to the Centers for Disease Control and Prevention: \n\"As a physician for over 30 years, I am well aware of the dangers infectious diseases pose. In fact, infectious diseases remain in the top 10 causes of death in the United States....Reports of illegal migrants carrying deadly diseases such as swine flu, dengue fever, Ebola virus and tuberculosis are particularly concerning.\" \nUnfortunately, Trump, King, Nugent, and Gingrey join a long list in their rhetoric of horror, hysteria, hyperbole, and hypocrisy throughout the immigration battles of the United States. \nNarratives of Hate \nIn 1790, the newly constituted United States Congress passed the Naturalization Act, which excluded all nonwhites from citizenship, including Asians, enslaved Africans, and Native Americans, the later whom they defined in oxymoronic terms as \"domestic foreigners,\" even though they had inhabited this land for an estimated 35,000 years. The Congress did not grant Native Americans rights of citizenship until 1924 with the passage of the Indian Citizenship Act, though Asians continued to be denied naturalized citizenship status. \nWithin the United States in the 19th century, the public directed negative sentiments against a number of ethnic groups, including the Irish. For example, according to a young Theodore Roosevelt in the 1880: \n\"The average Catholic Irishman of the first generation, as represented in the [New York State] Assembly [is a] low, venal, corrupt, and unintelligent brute.\" \nAnd in Harper's Weekly a few years earlier: \n\"Irishmen...have so behaved themselves that nearly seventy-five per cent of our criminals and paupers are Irish; that fully seventy-five per cent of the crimes of violence committed among us are the work of Irishmen; that the system of universal suffrage in large cities has fallen into discredit through the incapacity of the Irish for self-government.\" \nThe U.S. Congress passed its first law specifically restricting or excluding immigrants on the basis of \"race\" and nationality in 1882. In their attempts to eliminate entry of Chinese (and other Asian) workers who often competed for jobs with U.S. citizens, especially in the western United States, Congress passed the Chinese Exclusion Act to restrict their entry into the U.S. for a 10 year period, while denying citizenship to Chinese people already on these shores. The Act also made it illegal for Chinese people to marry white or black U.S.-Americans. The Immigration Act of 1917 further prohibited immigration from Asian countries, in the terms of the law, the \"barred zone,\" including parts of China, India, Siam, Burma, Asiatic Russia, the Polynesian Islands, and parts of Afghanistan. \nA Butte, Montana editorial in 1870 represents the exclusionist sentiments toward Chinese people held by many U.S. citizens: \n\"The Chinaman's life is not our life, his religion is not our religion. His habits, superstitions, and modes of life are disgusting. He is a parasite, floating across the Pacific and thence penetrating into the interior towns and cities, there to settle down for a brief space and absorb the substance of those with whom he comes into competition. His one object is to make all the money and return again to his native land dead or alive....Let him go hence. He belongs not in Butte.\" \nAnd in 1893 , also in Butte, Montana, \"The Chinaman is no more a citizen than a coyote is a citizen, and never can be.\" \nThe so-called \"Gentleman's Agreement\" between the U.S. and the Emperor of Japan of 1907, in an attempt to reduce tensions between the two countries, passed expressly to decrease immigration of Japanese workers into the U.S. \nBetween 1880 and 1920, in the range of 30-40 million immigrants from Eastern and Southern Europe migrated to the United States, more than doubling the population. Fearing a continued influx of immigrants, legislators in the U.S. Congress in 1924 enacted the Johnson-Reed [anti-]Immigration Act (a.k.a. Origins Quota Act, or National Origins Act) setting restrictive quotas of immigrants from Eastern and Southern Europe (groups viewed as representing Europe's lower \"races\"), including Jews (the later referred to as members of the so-called \"Hebrew race\"). The law, however, permitted large allocations of immigrants from Great Britain and Germany. In addition, the law included a clause prohibiting entry of \"aliens ineligible to citizenship,\" which was veiled language referring to Japanese and other Asians dating back to the Naturalization Act of 1790 restricting citizenship to only \"white\" people and affirmed by a 1922 United States Supreme Court ruling (Takao Ozawa v United States) in which Takao Ozawa, a Japanese immigrant, was denied the right to become a naturalized citizen because he \"clearly\" was \"not Caucasian.\" \nThis law, in addition to previous statutes (1882 against the Chinese, 1907 against the Japanese) halted further immigration from Asia, and excluded blacks of African descent from entering the United States. \nIt is important to note that during this time, Jewish ethno-racial assignment was constructed as \"Asian.\" According to Sander Gilman: \"Jews were called Asiatic and Mongoloid, as well as primitive, tribal, Oriental.\" Immigration laws were changed in 1924 in response to the influx of these undesirable \"Asiatic elements.\" \nIn 1939, the United States Congress refused to pass the Wagner-Rogers Bill, which if enacted would have permitted entry to the United States of 20,000 children from Eastern Europe, many of whom were Jewish, over existing quotas. Laura Delano Houghteling, cousin of Franklin Delano Roosevelt and wife of the U.S. Commissioner of Immigration sternly warned : \"20,000 charming children would all too soon, grow into 20,000 ugly adults.\" \n[Not a] Conclusion \nRather than characterizing immigration and migration issues as humanitarian concerns, the anti-immigration activists connect the narratives representing immigrants and migrants to our borders to the language of disease, crime, drugs, alien and lower forms of culture and life, of invading hoards, of barbarians at the gates who if allowed to enter will destroy the glorious civilization we have established among the lesser nations of the Earth. On a more basic and personal level, the rhetoric of invasion of our boarders taps into psychological fears, or more accurately, of terrors of infection: our country, our workplaces, and more basically, our private places in which \"aliens\" forcefully penetrate our personal spaces around our bodies, into our orifices, and down to the smallest cellular level. \nSince the anti-immigration movement represents immigrants and migrants as subhuman creatures, it could take as its battle cry the catchy slogan from the Terminex Pest Exterminator TV commercial: \n\"Not Here! Not Now! Not in my house!\" \nTo view and download my \"Immigration as 'Racial' Policy\" PowerPoint presentation , click here . More:", "external_links": [], "published": "2015-06-18T13:12:00.000+03:00", "crawled": "2015-06-18T21:22:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}