{"organizations": [], "uuid": "c8755042f541642023f7240d2736c3b369dd7da8", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/06/08/barack-obama-alemania.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/06/08/eu-quiere-asegurarse-que-la-fifa-funcione-con-integridad-obama", "country": "", "title": "EU quiere asegurarse que la FIFA funcione con integridad: Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "EU quiere asegurarse que la FIFA funcione con integridad: Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-06-09T00:15:00.000+03:00", "replies_count": 0, "uuid": "c8755042f541642023f7240d2736c3b369dd7da8"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/06/08/eu-quiere-asegurarse-que-la-fifa-funcione-con-integridad-obama", "ord_in_thread": 0, "title": "EU quiere asegurarse que la FIFA funcione con integridad: Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía EU quiere asegurarse que la FIFA funcione con integridad: Obama El presidente de Estados Unidos aseguró que la justicia de su país busca que haya más transparencia y responsabilidad en el futbol mundial Lunes, 08 de junio de 2015 a las 14:16 Barack Obama habló por primera vez sobre la investigación de la justicia de Estados Unidos contra la FIFA (Reuters). Lo más importante Barack Obama dijo que Estados Unidos busca que la FIFA se conduzca con integridad, transparencia y responsabilidad Indicó que sus contrapartes en Europa han expresado respaldo a la investigación por corrupción contra la FIFA Temas relacionados OPINIÓN: Crisis en FIFA, ejemplo contra corrupción \n(Reuters) — El presidente de Estados Unidos, Barack Obama, se refirió este lunes por primera vez al escándalo en el que está sumida la FIFA, el órgano que rige el futbol mundial, diciendo que el deporte es un \"negocio masivo\" que necesita ser dirigido con integridad. \n\"En conversaciones que he tenido aquí en Europa, la gente piensa que es muy importante que la FIFA sea capaz de funcionar con integridad y transparencia y responsabilidad\", dijo Obama a periodistas en una conferencia de prensa después de la cumbre del G7. \nEl mandatario dijo que no comentaría directamente la investigación del FBI sobre sobornos y corrupción en la FIFA. \nPero dijo que el futbol no es solo un juego, sino también un deporte y \"una fuente de increíble orgullo nacional\". \nAgregó que Estados Unidos quiere \"asegurarse que el deporte que está ganando popularidad (en el país) sea dirigido de una manera correcta\". \nLee: La FIFA 'ficha' a un exfiscal de EU para defenderse Encuentra este artículo con: obama, fifa, investigacion, corrupcion, integirdad, transparencia, blatter, estados unidos Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"607282a835104459a83cb0a36663efad\", \"time\": \"2015-06-08T21:16:27.060Z\" } Video ", "external_links": [], "published": "2015-06-09T00:15:00.000+03:00", "crawled": "2015-06-09T00:16:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}