{"organizations": ["Pentagon", "Islamic State", "ISIS", "BDS", "GOP", "Congress", "Defense", "White House", "House", "Spike TV", "National Republican Party", "Supreme Court", "New York Times"], "uuid": "62f6a145b8594296df4edb9937eca7af2d50eecc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/anbariraq05222015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/244496-obama-to-send-hundreds-more-advisers-to-iraq", "country": "", "title": "Obama to send hundreds more advisers to Iraq | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama to send hundreds more advisers to Iraq | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-06-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "62f6a145b8594296df4edb9937eca7af2d50eecc"}, "author": "", "url": "http://thehill.com/policy/defense/244496-obama-to-send-hundreds-more-advisers-to-iraq", "ord_in_thread": 0, "title": "Obama to send hundreds more advisers to Iraq | TheHill", "locations": ["Taqaddum", "Ramadi", "Benghazi", "US", "U.S.", "Syria", "Texas", "Baghdad", "Mosul", "Iraq", "Anbar Province"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kristina Wong", "Caitlyn Jenner", "Bernie Sanders", "Joe Biden", "Trump", "Bush", "Marco", "Clint", "Josh", "Ash Carter", "Joe", "Obama", "Sanders", "Clinton", "Rumsfeld", "Bill", "Sheldon Adelson", "Graham", "Clint Eastwood", "Caitlyn", "Trey Gowdy", "Rubio"], "text": "Obama to send hundreds more advisers to Iraq By Kristina Wong - 06/09/15 09:37 PM EDT The Obama administration is planning to send about 400 additional trainers to Iraq to train Iraqi forces against the Islamic State in Iraq and Syria, according to the New York Times . The decision comes after an embarrassing defeat of Iraqi forces at Ramadi last month to the terrorist group, prompting the administration to reconsider its training and equipping program for Iraqi forces. Defense Secretary Ash Carter said Iraqi forces in Ramadi had lacked the \"will to fight,\" and Sunni tribal fighters there had complained of not receiving any training or equipment from the central government. ADVERTISEMENT After the defeat, Defense Secretary Ash Carter said he had asked a team of top military officials to put together options for enhancing the train and equip program, a key part of the administration's strategy in Iraq. The Pentagon had said earlier Wednesday that providing training directly to Sunni tribal fighters was one of those options. The U.S. has so far left the task of training and equipping Sunni forces up to Baghdad, out of concern it could worsen sectarian tensions or undermine the Shia-dominated central government. The U.S. will also establish a new coalition training and advising site at Taqaddum, an Iraqi base in Anbar Province, as part of the effort to speed up and enhance the training mission. The decision comes after months of debate about the strategy, which was settled by the fall of Ramadi, the New York Times reported. Anbar will become the focus of a long campaign that will eventually seek to regain Mosul, which ISIS seized last June, the paper said. There are currently about 3,080 U.S. troops in Iraq, training Iraqi forces and providing protection to U.S. troops and facilities. The president has so far authorized 3,100 troops so far, and would have to issue a notice to Congress to deploy more. The move could rekindle action by Congress to consider authorizing military force against ISIS, ten months after the U.S.-led airstrike campaign in Iraq started. Past: 1 day Bill would require trade deals to... A House trade vote could come as soon as this week. Republicans fear they will win... Republicans in Congress are worried the Supreme Court will hand them a... Fast talk from the fast-track... Some GOP members say that TPA will \"constrain the president,\" but it's... Obama’s frustration with courts... Obama made some of his toughest and bluntest comments to date. Benghazi chairman pushes back... Trey Gowdy has been accused of using the Benghazi investigation to raise... Bachelor Graham hints at 'rotating... “Well, I've got a sister. She could play that role if necessary,” Graham... Sanders pulls within 8 points of... National Republican Party leaders frame the results as trouble for Clinton. Sheldon Adelson's mistake In just the last year, BDS proponents in the US have marked several major... White House press room evacuated... President Obama and the first family remained in the building during the... White House: 'Prudent' for Texas... Images of the McKinney, Texas, incident “have a detrimental impact,\" Josh... Top 10 undecided House members to... The White House has joined forces with GOP leaders to furiously lobby... Rubio slams Times after paper... A spokesman says it's \"the latest in their continued hits against Marco... Bill Press: Why not Joe for 2016? OPINION | Why isn’t Vice President Joe Biden at the top of the list of... Bernie Sanders's great idea: Free... Nothing would do more to bring opportunity to young men and women... President decries 'endless... Obama accuses critics of a cynical attempt to take coverage from people. Rumsfeld: 'Unrealistic' for Bush... Rumsfeld said the U.S. \"template\" is not always appropriate for other... Dems move to ban plastic guns The push follows major security lapses at U.S. airports. Obama smoking? President caught on... President Obama may have been caught on camera holding a pack of... Clint's Caitlyn quip cut from... Clint Eastwood made a Caitlyn Jenner joke at Spike TV's Guys' Choice... Court rejects challenge to Obama... An appeals court said it does not have the power to review a proposed... Republicans brace for Hurricane... Republicans are worried Trump will steal attention from other presidential... ", "external_links": [], "published": "2015-06-10T03:00:00.000+03:00", "crawled": "2015-06-11T00:18:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}