{"organizations": ["National Institute on Drug Abus", "National Drug Control Policy", "National Institute on Drug Abuse", "National Highway Traffic Safety Administration"], "uuid": "db6725fe45aecb4bbc45761f5a5a6993ef68cad3", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/130606205503-20-change-the-list-t3-entertainment.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/06/24/politics/2016-election-republican-fundraising/index.html", "country": "US", "title": "Study finds impact of marijuana on drivers", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Study finds impact of marijuana on drivers", "spam_score": 0.0, "site_type": "news", "published": "2015-06-24T21:40:00.000+03:00", "replies_count": 0, "uuid": "650a5f859d2c8b8960237ffcef6e7eeba513c654"}, "author": "", "url": "http://edition.cnn.com/2015/06/24/politics/marijuana-study-drivers-impact/index.html", "ord_in_thread": 0, "title": "Study finds impact of marijuana on drivers", "locations": ["District of Columbia", "U.S.", "Washington", "Iowa", "D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stoned drivers test skills 05:14 (CNN) A new study, funded in part by the federal government, suggests alcohol has a more extreme impact on drivers than marijuana. Researchers said alcohol \"significantly increased lane departures/minimum and maximum lateral acceleration; these measures were not sensitive to cannabis.\" Researchers also concluded Cannabis-influenced drivers \"may attempt to drive more cautiously to compensate for impairing effects, whereas alcohol-influenced drivers often underestimate their impairment and take more risk.\" The National Institute on Drug Abuse, the Office on National Drug Control Policy, and federal safety regulator, the National Highway Traffic Safety Administration funded the study. The National Institute on Drug Abus says it used the \"most sophisticated driving simulator of its kind to mirror real-life situations.\" The participants drank alcohol to reach approximately 0.065% peak breath alcohol concentration, inhaled vaporized marijuana or had a placebo. The test group consisted of 19 adults. Thirteen of them were men. Most of the participants consumed cannabis more than two times a month but less than 3 times a week. During the 45 minute driving session, inside the driving simulator in Iowa city, researchers zeroed in on how many times the car left the lane, weaving in the lane and the speed of the car. A 1996 Malibu sedan is mounted in a dome with a motion system. \"Drivers experience acceleration, braking, steering cues, road conditions like gravel and realistic sounds.\" Researchers said \"alcohol, but not marijuana, increased the number of times the car actually left the lane and the speed of the weaving.\" Although marijuana had a less dramatic effect than alcohol on drivers the study found it still impairs \" one measure of driving performance.\" The drug reduced the drivers' peripheral vision giving them tunnel vision. People driving with blood concentrations of 13.1 µg/L THC, the main psychoactive ingredient in marijuana, showed increased weaving within the lane, similar to those with 0.08 breath alcohol, the threshold for impaired driving in many states. Drinking alcohol and smoking marijuana enhanced the effect, so that drivers using both substances weaved within lanes even if their blood THC and alcohol concentrations were below the impairment thresholds for each substance alone. Alcohol, but not marijuana, increased the number of times the car actually left the lane and the speed of weaving. Twenty-three states and the District of Columbia approved medical marijuana; four states and Washington, D.C., legalized recreational cannabis for adults. As states continue to loosen restrictions on marijuana safety regulators and law enforcement are struggling to figure out how to establish a legal limit for drivers, just as there is a .08 limit for alcohol. This new study also presented the challenges in accurately testing drivers and developing a threshold of what's considered too high to drive. \"THC concentrations drop rapidly during the time required to collect a blood specimen in the U.S., generally within two to four hours.\" Oral tests using the drivers' saliva can be done roadside without a long wait but researchers found oral tests may not \"be a precise measure of the level of impairment.\" The concern is that implementing concentration-based cannabis-driving legislation \"will unfairly target individuals not acutely intoxicated, because residual THC can be detected in blood for up to a month of sustained abstinence in chronic frequent smokers.\" The study concedes testing marijuana levels that reflect \"driving impairment remain elusive.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-06-24T21:40:00.000+03:00", "crawled": "2015-06-24T21:57:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}