{"organizations": ["Fox News Latino Cruz"], "uuid": "f8a9b90ad39bca26fdcf5fdbae5ccf2a01c30bf3", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/cav_jeb_061515.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/opinion/2015/06/16/rick-sanchez-jeb-goes-off-script-on-immigration-delivers-unintended-read-my/", "country": "", "title": "Rick Sanchez: Jeb goes off script on immigration, delivers unintended 'read my lips' moment | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Rick Sanchez: Jeb goes off script on immigration, delivers unintended 'read my lips' moment | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-06-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "f8a9b90ad39bca26fdcf5fdbae5ccf2a01c30bf3"}, "author": "", "url": "http://latino.foxnews.com/latino/opinion/2015/06/16/rick-sanchez-jeb-goes-off-script-on-immigration-delivers-unintended-read-my/", "ord_in_thread": 0, "title": "Rick Sanchez: Jeb goes off script on immigration, delivers unintended 'read my lips' moment | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rick Sanchez", "Biden"], "text": "Cruz apologizes for Biden joke while VP mourns loss \nHe wasn’t supposed to say it, but he couldn’t help himself. John Ellis Bush, former Governor of Florida let’er rip. He said exactly what a careful review of the transcript reveals he was supposed to avoid during his announcement for president speech at Miami Dade College. \nIt appeared that Jeb Bush, or just “Jeb” as the signs and placards read to distinguish him from the field and other Bushes before him, was not going to mention comprehensive immigration reform. Not here, not in this speech. This speech was intended to show him for what he is, a devoted father, son and husband. It was also a positioning speech for the upcoming Republican primaries, where validating conservative principals is a must. While immigration as an emotional issue may be “hands off” for most GOP candidates, Jeb understands what economists and business leaders very much understand, and what most of the conservative crowd in the Miami Dade auditorium represent: Hispanics are the engine that will drive the U.S. economy in the 21st century. \n- Rick Sanchez \nBut Jeb is not like the other GOP candidates; in the eyes 17 percent of the population he is the only candidate “guapo” enough to speak truth to the power of the conservative base when it comes to immigration, even if it is a message it doesn’t want to hear. Still, this was not the time, nor the place for that bold if not risky type of messaging. \nThen in an instant, the plan changed. \nJust as Jeb had finished introducing his mother Barbara, the woman from whom he has inherited his 'damn the torpedos and just say what you think' attitude, somebody in the audience started yelling something. The heckler was mostly drowned out by the noise in the auditorium. Most in the audience couldn’t make out what the screaming was about. Was it just somebody professing his or her loyalty to Jeb? Who knew? \nMeanwhile, on television screens on FOX, CNN, MSNBC, which carried the event live, no viewer would have been the wiser if he’d just ignored the heckler. Nobody, not even many reporters paid it much mind. Nobody, that is, but Jeb. He heard it and it kind of bothered him. \nWhat we now know they said was \"Legal status is not enough,” arguing instead for a path to ‘citizenship’ for undocumented immigrants. Jeb could not, would not and did not ignore the opportunity. He went off script, looked right at his tormentors and said, “the next president of the United States will pass meaningful immigration reform, so that that will be solved — not by executive order.” \nJeb Bush is for all intent and purposes the GOP’s Latino candidate, yes, more so than both Senators Marco Rubio and Ted Cruz who are Latino. He is also the candidate who understands that America’s business is business. And few things are more important to the American economy than to maintain a young and vibrant labor force. So while immigration as an emotional issue may be “hands off” for most GOP candidates, Jeb understands what economists and business leaders very much understand, and what most of the conservative crowd in the Miami Dade auditorium represent: Hispanics are the engine that will drive the U.S. economy in the 21st century. \nIt’s a reality captured most recently by this Wall Street Journal headline, “ Hispanics could account for 40 percent of U.S. job growth .” The study, conducted by IHS Global Insight, staggers our perception of immigration as simply a political wedge issue. It finds that the U.S. Hispanic population will account for 40 percent of employment growth over the next five years and more than 75 percent from 2020 to 2034. \nThe economic forecasting firm’s study reveals that the growth of the non-Hispanic working age population is set to slow to near zero, as baby boomers continue to retire. The result is that the Hispanic share of U.S. employment will increase to 23 percent over the next two decades, from 16 percent last year. \nResearchers are also finding that immigrants started new companies or became self-employed at nearly twice the rate of native-born Americans, even though they made up only 12.9 percent of the U.S. population. Latino new business creators climbed to 22.1 percent in 2014 from 20.4 percent in 2013 and just 10 percent in 1996, the study found, while they make up only 17.1 percent of the U.S. population. \nJeb didn’t want to say it, but in that moment he could control not his heart, his head nor the truth. It is a truth that he more than any other GOP presidential candidate seems to understand. And that is why he said it. That is why he made the promise for the entire world to hear. He knows it’s a political minefield that relies not on truth. He knows it can cost him the primaries, ala Rick Perry’s crash in 2011, when he stood up for educating Latino students. Or the other way, it can cost him the presidency ala Mitt Romney, whose harsh views on immigration came off just anti-Hispanic enough to earn him the lowest Hispanic vote on record, a paltry 27 percent. \nBut he had to say it. He had to make the promise to that 17 percent of the population who will now hold him to it — and he did! \nUnintended as it was, this was Jeb’s “read my lips” moment. Now, he needs only to rely on truth, metrics and facts to help him stick to it. \nRick Sanchez is a contributor for Fox News Latino. \nLike us on Facebook Follow us on Twitter & Instagram \n", "external_links": [], "published": "2015-06-16T03:00:00.000+03:00", "crawled": "2015-06-17T03:21:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}