{"organizations": [], "uuid": "7e72470bff8348d8d988aa868f16d410c05b39ba", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/ros-lehtinenileana_053114getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/246448-gop-lawmaker-demands-state-dept-cut-aid-to-palestinians", "country": "US", "title": "GOP lawmaker: Obama must 'immediately' cut aid to the Palestinians", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP lawmaker: Obama must 'immediately' cut aid to the Palestinians", "spam_score": 0.0, "site_type": "news", "published": "2015-06-29T21:04:00.000+03:00", "replies_count": 0, "uuid": "7e72470bff8348d8d988aa868f16d410c05b39ba"}, "author": "rshabad@thehill.com (Rebecca Shabad)", "url": "http://thehill.com/policy/finance/246448-gop-lawmaker-demands-state-dept-cut-aid-to-palestinians", "ord_in_thread": 0, "title": "GOP lawmaker: Obama must 'immediately' cut aid to the Palestinians", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP lawmaker: Obama must 'immediately' cut aid to the Palestinians Getty Images By Rebecca Shabad - 06/29/15 02:04 PM EDT \nThe Obama administration must immediately cut aid to the Palestinian Authority (P.A.), Rep. Ros-Lehtinen (R-Fla.) said Monday. \nRecent legal action by the Palestinians should have triggered a U.S. law that requires the suspension of aid to the P.A., said Ros-Lehtinen, who is the chairwoman of the Middle East and North Africa Subcommittee. ADVERTISEMENT “The administration must immediately enforce the law and cut funding to the PA. By blatantly ignoring the law’s language and purposefully misinterpreting Congress’ intent, the Obama administration is only emboldening Abu Mazen to continue his campaign at the ICC and elsewhere and is undermining peace between Palestinians and the democratic Jewish State of Israel in the process,” she said. Abu Mazen refers to Palestinian President Mahmoud Abbas. The spending bill Congress passed last December contains language that could halt U.S. aid to the Palestinians, Ros-Lehtinen noted. It says no funds for the Economic Support Fund can be made available if the P.A. obtains full membership at the United Nations without a negotiated agreement with Israel. The bill also says funding would be withheld if the Palestinians initiate an ICC investigation or actively support an investigation that involves alleged Israeli war crimes against Palestinians. Ros-Lehtinen’s comments come just days after two other key lawmakers warned that Palestinian actions against Israel at the International Criminal Court (ICC) would lead to a suspension of U.S. assistance, which amounts to roughly $400 million annually. On Thursday, the P.A. submitted evidence to the ICC of alleged Israeli war crimes in an effort to speed up an ICC inquiry into abuses that might have occurred during last summer’s conflict in Gaza. Reps. Nita Lowey (D-N.Y.) and Kay Granger (R-Texas) warned after that move that funding could be suspended. The State Department did not immediately respond to a request for comment.", "external_links": [], "published": "2015-06-29T21:04:00.000+03:00", "crawled": "2015-06-29T23:03:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}