{"organizations": [], "uuid": "b9a2a14dbbe932d8a1ee9a107309e1fa7750282a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f1c10b1700009a01569dbd.jpeg?cache=HCN2dQNfbi", "site_section": "http://www.huffingtonpost.com//feeds/verticals/politics/index.xml", "section_title": "Politics - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-instructs-government-to-prep-for-at-least-10000-syrian-refugees-next-fiscal-year_55f1beaee4b093be51bdfe74", "country": "US", "title": "Obama Instructs Government To Prepare For At Least 10,000 Syrian Refugees Next Fiscal Year", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Instructs Government To Prepare For At Least 10,000 Syrian Refugees Next Fiscal Year", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-10T21:28:00.000+03:00", "replies_count": 0, "uuid": "b9a2a14dbbe932d8a1ee9a107309e1fa7750282a"}, "author": "Elise Foley", "url": "http://www.huffingtonpost.com/entry/obama-instructs-government-to-prep-for-at-least-10000-syrian-refugees-next-fiscal-year_55f1beaee4b093be51bdfe74", "ord_in_thread": 0, "title": "Obama Instructs Government To Prepare For At Least 10,000 Syrian Refugees Next Fiscal Year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Instructs Government To Prepare For At Least 10,000 Syrian Refugees Next Fiscal Year The White House says the most effective response to the crisis is still humanitarian aid. Elise Foley Immigration & Politics Reporter, The Huffington Post Posted: 09/10/2015 02:28 PM EDT Alex Wong via Getty Images \nWASHINGTON -- President Barack Obama told his administration to prepare for a \"significant scaling up\" of Syrian refugee admissions, under which the U.S. will take in at least 10,000 Syrians next fiscal year, White House press secretary Josh Earnest said on Thursday. \nWith refugees from Syria spilling into the surrounding countries and Europe, the U.S. is under pressure to conduct more resettlement, in addition to the approximately $4 billion in aid it gives to assist refugees overseas. About 4 million Syrians have left their homes since the beginning of the civil war there in 2011. Earnest told reporters at a press briefing that the U.S. is on track to have taken in 1,500 Syrian refugees this fiscal year, which ends on Sept. 30. \nObama's proposal of 10,000 admissions comes after initial indications that the administration would allow in more refugees in the next fiscal year. For the past three years, the refugee admission number has been about 70,000, but Secretary of State John Kerry said Wednesday that the administration is \"committed to increasing the number.\" He did not offer reporters details about the exact figure, although a Senate aide said Kerry told lawmakers it would be at least 75,000 refugees total and he was aiming for even more. \nThe latest plan to admit 10,000 refugees, though larger than the number Kerry floated, is unlikely to appease refugee groups and others advocating for the U.S. to resettle more people. The International Rescue Committee called for the U.S. to accept at least 65,000 Syrians by the end of 2016, and some Democratic lawmakers have echoed that figure. \nRefugee resettlement organizations say the government should go beyond 65,000 Syrians and instead admit 100,000 people from Syria and 100,000 from other countries. \nThe administration has not yet announced the total refugee admission numbers for next year, but will need to do so by the end of the month. Earnest said the overall cap will go up next year, but has not been determined. He pointed out that the increases that some members of Congress are calling for would require more resources. \"To scale up to a degree that some members of Congress may have in mind would have some significant fiscal consequences,\" Earnest said. \"The background check process that I described before is work-intensive and requires a lot of trained manpower, and so Congress would need to make a significant financial commitment to ramping up along those lines.\" \nRefugees will undergo the same screening process that's currently in place, he added. The existing process is extensive and typically takes between 18 and 24 months. \nEarnest emphasized that the administration still believes financial assistance is \"by far the most effective way for us to meet this urgent humanitarian need.\" \n\"We know the scale of this problem. It's significant,\" he said. \"And there are millions of people who have been driven from their homes because of this violence. ... It certainly is not feasible for millions of Syrians to come to this country, but what we can do is make sure that we are doing everything we can to provide for their basic needs.\" \n\"Ultimately this situation will not be resolved,\" he added, \"until we can resolve the political crisis inside of Syria right now.\"", "external_links": [], "published": "2015-09-10T21:28:00.000+03:00", "crawled": "2015-09-10T21:50:22.524+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}