{"organizations": [], "uuid": "18e1799cdbb1843dc8a03cfb4f02b0be734d717c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obama092015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/254303-obama-no-contradiction-supporting-police-and-criminal-justice", "country": "US", "title": "Obama: No contradiction supporting police and criminal justice reform", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: No contradiction supporting police and criminal justice reform", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-20T14:13:00.000+03:00", "replies_count": 0, "uuid": "18e1799cdbb1843dc8a03cfb4f02b0be734d717c"}, "author": "kballuck@thehill.com (Kyle Balluck)", "url": "http://thehill.com/blogs/blog-briefing-room/news/254303-obama-no-contradiction-supporting-police-and-criminal-justice", "ord_in_thread": 0, "title": "Obama: No contradiction supporting police and criminal justice reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama late Saturday praised law enforcement officers while calling for criminal justice reform. ADVERTISEMENT “Our law enforcement officers do outstanding work in an incredibly difficult and dangerous job,” he said at a Congressional Black Caucus awards dinner in Washington.\n“They put their lives on the line for our safety,” he added. “We appreciate them and we love them.” \n“I just want to repeat, because somehow this never gets on the TV: There is no contradiction between us caring about our law enforcement officers and also making sure that our laws are applied fairly,” Obama said. \n“We want to protect our police officers. We’ll do a better job doing it if our communities can feel confident that they are being treated fairly. I hope I’m making that clear.” \nObama called the criminal justice system a “profound barrier to opportunity in too many communities.” \n“We need to make sure the laws are applied evenly. This is not a new problem. It’s just that in recent months, in recent years, suddenly folks have videos and body cameras, and social media, and so it’s opened our eyes to these incidents,” Obama said. \n“And many of these incidents are subject to ongoing investigation, so I can’t comment on every specific one. But we can’t avoid these tough conversations altogether,\" he added. \"That’s not going to help our police officers, the vast majority who do the right thing every day, by just pretending that these things aren’t happening. That’s not going to help build trust between them and the communities in which they serve.” \nObama said he heard stories from inmates during a visit to a federal prison earlier this year in Oklahoma about the “crushing burden that incarceration has placed” on their prospects for the future. He said he also heard stories about the burden placed on their families, children being raised without a father and the regret prisoners felt over the children that they left behind. \n“Mass incarceration rips apart families,” he said. “It hollows out neighborhoods. It perpetuates poverty.” \nObama said he’d be working in coming months on reform legislation to address “unjust sentencing laws.” \nThat legislation would also encourage diversion and prevention programs, he said. \n“It’s the right thing to do for America.”", "external_links": [], "published": "2015-09-20T14:13:00.000+03:00", "crawled": "2015-09-21T11:52:39.568+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}