{"organizations": [], "uuid": "c60797951464febed56147884bf26de8e164f992", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/presidential-campaign/250216-the-immigration-debate-people-actually-want-to-hear", "country": "US", "title": "The immigration debate people actually want to hear", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "The immigration debate people actually want to hear", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-05T20:00:00.000+03:00", "replies_count": 0, "uuid": "c60797951464febed56147884bf26de8e164f992"}, "author": "Kica Matos", "url": "http://thehill.com/blogs/congress-blog/presidential-campaign/250216-the-immigration-debate-people-actually-want-to-hear", "ord_in_thread": 0, "title": "The immigration debate people actually want to hear", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 05, 2015, 01:00 pm The immigration debate people actually want to hear By Kica Matos \nAt a recent pastors’ luncheon, Jeb Bush said that the “first, second, third, [and] fourth priority” of the next president should be to find “a way to reweave the web of civility” — presumably the one that Donald Trump recently punched a hole through with his outrageous insults to immigrants, women and war heroes. \nWhile most of us will agree that civility has taken a hit as of late, retreating from Trump’s outright racism back to the racially coded undertones of the usual GOP rhetoric is setting a low bar for the upcoming elections and for next week’s first Republican presidential debate, which will be hosted by Fox News on Thursday, August 6. ADVERTISEMENT Yes, already we’ve had enough of the caricature that is Donald Trump and just about everything he stands for. But for the other Republican presidential hopefuls, distancing themselves from Trump won’t be enough to gain voters’ confidence, especially on the issue of immigration. \nListing off stale arguments about bolstering border security and enforcement didn’t work for them in 2012 and won’t work for them in 2016. To pique the public’s interest and get to the true heart of the issue, Fox News moderators will need to dig a little deeper to bring candidates out of their comfort zones and off their talking points. \nOn the issue of immigration, what the American people crave are real solutions to real problems — the most pressing of which is what to do with the 11 million undocumented people already living in the United States. What realistic and actionable plan does each candidate have to address this issue, and how will this plan be achieved? \nIf their solution truly is the mass deportation of 11 million people living and working in the United States, how, exactly, would that work? Are we willing to spend the estimated hundreds of billions of dollars that it would cost to remove that many people from this country? How would our economy and unemployment rates bounce back after we close the hundreds of thousands of small businesses owned and operated by undocumented immigrants? How many American families would struggle after losing a parent? Where would the millions of U.S.-citizen children go after we deport their parents and leave them orphaned? How would we support these children as they navigate a world alone without their families? \nSeveral GOP candidates have come out in support of providing undocumented immigrants with legal status or even a pathway to citizenship, but they’ve stopped short of describing what that process would look like, who would qualify and what would happen to those who didn’t. \nFor Republican presidential candidates whose plans include continuing to inflate the country’s already-bloated border security and enforcement provisions, tell us how and why. As it stands now, we spend more on immigration enforcement than all other federal law enforcement efforts combined ­- $18 billion a year. That is at a time when illegal immigration flows have plummeted to their lowest levels in at least twenty years. If that doesn’t satisfy Republicans’ never-ending demand for bigger and harsher border security and fewer immigrants, then what will? \nThe truth is that Americans across the board are tired of this senseless rhetoric. No one wants to listen to a debate about who can build a higher fence. No one is interested in hearing the same tired arguments about “rule of law” or the worn-out talking points about enforcement and security. And while we’re at it, no one really wants Donald Trump to speak at all — especially on immigration. What the people want are real solutions. \nWithout a plan for these 11 million people, we are looking at creating a permanent underclass of families in the United States — people who work hard to support their families and contribute to our economy, who create jobs for our citizens and pay taxes to our government, but receive none of the benefits, protections and rights that we afford our citizens. We need to move forward as a nation and we need to collectively and boldly push for real solutions. \nOur next president needs to promise more on immigration than just civility — he or she needs to provide this country with hope for a better tomorrow and a real plan to get there. \nMatos is director of immigrant rights and racial justice for the Center for Community Change Action, a national organization that works to build the power and capacity of low-income people. She is also the spokeswoman for the Fair Immigration Reform Movement (FIRM), a national coalition of grassroots organizations fighting for immigrant rights.", "external_links": [], "published": "2015-08-05T20:00:00.000+03:00", "crawled": "2015-08-05T20:23:07.902+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}