{"organizations": [], "uuid": "274748d3aa12a38974e187600ed96934f3cb67c8", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/huckabee_080615getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/ballot-box/254382-huckabee-rips-obama-as-most-anti-christian-president-over-papal-guest-list", "country": "", "title": "Huckabee rips Obama as 'most anti-Christian' president ever | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Huckabee rips Obama as 'most anti-Christian' president ever | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-22T03:23:00.000+03:00", "replies_count": 0, "uuid": "274748d3aa12a38974e187600ed96934f3cb67c8"}, "author": "", "url": "http://thehill.com/blogs/ballot-box/254382-huckabee-rips-obama-as-most-anti-christian-president-over-papal-guest-list", "ord_in_thread": 0, "title": "Huckabee rips Obama as 'most anti-Christian' president ever | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 21, 2015, 01:27 pm Huckabee rips Obama as 'most anti-Christian' president ever By Mark Hensch Getty Images \nFormer Gov. Mike Huckabee is blasting President Obama as the \"most-anti-Christian\" president ever over his guest list for Pope Francis's state visit later this week. \nHuckabee said Obama is disregarding Catholic doctrine and insulting the pope by inviting gay rights and pro-abortion activists to the White House event on Wednesday. \n“President Obama’s classless decision to transform Pope Francis’ visit to the White House into a politicized cattle call for gay and pro-abortion activists is an insult to millions of Catholics,” he said, according to The Iowa Statesman . ADVERTISEMENT “Why is it that Obama goes to extremes to accommodate Muslim terrorists but shows nothing but disdain for Christians?” the 2016 GOP presidential candidate asked. “This is a new low for an administration that will go down as the most anti-Christian in American history.\"\nFrancis’s arrival in Washington, D.C., on Tuesday is expected to draw tens of thousands of visitors to the nation’s capital amid enthusiasm for the religious leader’s first visit to the U.S. He wil speak before Congress on Thursday, making him the first-ever pontiff to do. \nBut the visit has not been without some political controversy. \nThe Vatican has also expressed concerns over the White House guest list. A senior Vatican official told The Wall Street Journal last week that there are concerns photos of the pope with activists for gay and abortion rights could be seen as an endorsement. \nAnd Republicans are bracing for the pope's address to Congress, where it is widely expected the Catholic leader will address climate change, income inequality and abortion during his speech there. \nThe Vatican has stayed mum on the details of Francis’s address from the House floor taking place that morning. But one Republican, Rep. Paul Gosar (R-Ariz.), is skipping the speech, over the pope's climate stance. \nFrancis is currently spending his final day in Cuba as a part of a three-day swing through the island nation. He met Cuban revolutionary leader Fidel Castro on Monday during his trek through the communist country. Tags: ", "external_links": [], "published": "2015-09-22T03:23:00.000+03:00", "crawled": "2015-09-22T03:24:07.329+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}