{"organizations": [], "uuid": "eb7475d796a5c4c5281f08c90904f2421ec42eaf", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://new.thehill.com/taxonomy/term/28/feed", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/253281-small-businesses-tell-obama-to-reject-atlantic-drilling", "country": "US", "title": "Small businesses tell Obama to reject Atlantic drilling", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Small businesses tell Obama to reject Atlantic drilling", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-10T22:52:00.000+03:00", "replies_count": 0, "uuid": "eb7475d796a5c4c5281f08c90904f2421ec42eaf"}, "author": "dhenry@thehill.com (Devin Henry)", "url": "http://thehill.com/policy/energy-environment/253281-small-businesses-tell-obama-to-reject-atlantic-drilling", "ord_in_thread": 0, "title": "Small businesses tell Obama to reject Atlantic drilling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Small businesses tell Obama to reject Atlantic drilling By Devin Henry - 09/10/15 03:52 PM EDT \nMore than 300 local businesses along the Eastern Seaboard are encouraging President Obama to reject the Interior Department’s plan to open up the portions of the Atlantic Ocean for oil drilling. \nThe businesses, organized by the group Environment America, sent a letter to Obama highlighting their opposition to the proposal, calling it “incompatible with our tourism and fishing industries.” ADVERTISEMENT “When you drill, you spill, and day to day drilling operations result in chronic pollution and the industrialization of the coast for oil facilities.” the letter says. \n“Look no further than the devastation the BP Deepwater Horizon catastrophe brought to the Gulf of Mexico’s fishing, tourism and wildlife to recognize the impact drilling would have here on the Atlantic Coast.” \nThe businesses — based in places from New Hampshire to Florida — said such a spill could put the region's more than $4 billion in economic activity at risk. \n“Our coasts are worth too much to risk. Rather than exposing our beaches, families and businesses to the inherent risks of drilling, we need to move this country in the direction of renewable energy,” they wrote. \nThe Interior Department proposed a five-year energy development plan in January that would open up swaths of the Atlantic Ocean, Gulf of Mexico and Arctic for new oil and gas development. \nGreen groups have slammed the plan and said expanded offshore drilling not only risks potential spills but would exacerbate climate change by leading to more fossil fuel use. Several Senate Democrats have looked to block the plan legislatively. \nIn defending a decision to allow Royal Dutch Shell to drill for oil in the Arctic, Obama and the White House have said they want to make sure American oil and gas reserves are utilized while the U.S. transitions to renewable energy. \nWhen the administration announced the leasing plan in January, Interior Secretary Sally Jewell said it “takes into account the areas that we believe are appropriate for development and the areas that we believe are inappropriate for development.” Tags: Past: 1 day DNC chair closes door on more... “We’re not changing the process. We’re having six debates,” she said. Dems filibuster Iran vote GOP says it will force more votes on Iran next week. Biden parks plane next to Trump's Vice President Biden’s plane parked next to a Trump jet upon landing in... Huckabee says Dred Scott still ‘... The infamous decision was overturned by the 14th Amendment. Trump widens lead atop GOP... Trump picked up 8 points since August, according to a new CNN/ORC... Obama planning to admit 10K Syrian... Obama will drastically increase the number of Syrians allowed to resettle... Senate speeds toward Iran vote Sen. Mitch McConnell warned Democrats not to \"shut down the voice of the... House votes to accuse Obama of... House Republicans want to see the side deals between Iran and the IAEA. Brent Budowsky: Big truths about... OPINION | Let’s look at matters from a larger perspective. GOP scores early win in ObamaCare... A federal district judge ruled that the House has standing to sue the... Bond actor donates $47,000 to... However, Sanders' campaign has asked the PAC to cease and desist. House GOP to postpone vote on Iran... House Republicans will now meet at 4 p.m. to discuss strategy. McConnell: We're voting again on... McConnell set up a procedural vote on a resolution of disapproval for next... GOP rebel: Boehner’s job is on the... “Really there is no line in the sand,\" Rep. Mark Meadows said in an... Glenn Beck: 'Grow up, Donald Trump' \"I'm not dealing with a third grader anymore because the world is on fire... House conservative group to oppose... The House Freedom Caucus opposiiton complicates efforts to complete... WH pans GOP's 'Tortilla Coast... Press secretary Josh Earnest said Republicans' plan to derail the nuclear... Federal contractors tell Obama:... Federal contractors say they are being unfairly targeted with executive... Trump shrugs off Jindal attacks,... \"I only respond to people that register more than 1% in the polls,\" Trump... Trump's Hollywood Walk of Fame... Trump received his star in 2007. Trump fires back at Carson: ‘Who... “He was an OK doctor,” Trump said. “He was heavy into the world of... Trump blasts Rolling Stone over '... Trump said editors added \"a lot of garish stuff\" to his controversial... Poll: Sanders rallies past Clinton... Sanders now leads Clinton, 41 percent to 40 percent. Study: All-male Marine units... Ground combat units with only men were faster, more lethal and less...", "external_links": [], "published": "2015-09-10T22:52:00.000+03:00", "crawled": "2015-09-11T01:31:31.379+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}