{"organizations": [], "uuid": "93531125d123029c756729027897398d305c1a40", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/trumposbourne.png", "site_section": "http://thehill.com/taxonomy/term/18/feed#", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/immigration/250394-kelly-osbourne-echoes-obama-on-immigration", "country": "US", "title": "Kelly Osbourne echoes Obama on immigration", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Kelly Osbourne echoes Obama on immigration", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-06T19:00:00.000+03:00", "replies_count": 0, "uuid": "93531125d123029c756729027897398d305c1a40"}, "author": "jdf@cis.org (Jon Feere, contributor)", "url": "http://thehill.com/blogs/pundits-blog/immigration/250394-kelly-osbourne-echoes-obama-on-immigration", "ord_in_thread": 0, "title": "Kelly Osbourne echoes Obama on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 06, 2015, 12:00 pm Kelly Osbourne echoes Obama on immigration By Jon Feere, contributor Getty Images \nKelly Osbourne's recent comments are ignorant, elitist and racist, but they do represent the thinking of many people pushing for increases in immigration. \nWhile discussing immigration and Donald Trump on \"The View,\" Osbourne attacked Trump's views (while misrepresenting them) and revealed her own racism: \"If you kick every Latino out of this country, then who is going to be cleaning your toilet, Donald Trump?\" ADVERTISEMENT Her co-panelists were momentarily stunned into silence as Osbourne struggled (and failed) to defend her offensive remarks. The video is online, here .\nTime magazine called it a \"gaffe\" and BuzzFeed called it \"an incredibly offensive thing.\" Twitter users blasted Osbourne all day, keeping her name trending on the social media platform. \nBut it's not like Osbourne came up with this quip on her own. The so-called \"pro-immigrant\" crowd has been making similar arguments for decades. In November, while opposing deportation and promoting amnesty for illegal aliens, President Obama explained that illegal aliens \"mow our lawns, make our beds, clean out bedpans.\" A video of Obama's offensive statement is online, here . \nSimilarly, former Los Angeles Mayor Antonio Villaraigosa (D) called for keeping illegal aliens in the country, arguing that \"We clean your toilets. We clean your hotels. We build your houses.\" And by \"we,\" he meant Latinos — the wealthy mayor is not an illegal alien (though at least one city in Southern California is appointing illegal aliens to government positions). \nLast year, a failed congressional candidate from Florida, Alex Sink (D), argued that the nation needs illegal aliens because \"where are you going to get people to work to clean out hotel rooms or do our landscaping?\" \nAnd for years, amnesty advocates have argued that we need amnesty and more immigration because Latino immigrants are \"doing jobs Americans won't do.\" This includes former President G.W. Bush; a former president of the Mexican American Legal Defense and Educational Fund (MALDEF), John Trasviña; writers for The Washington Post ; and many, many others. The Associated Press reports that Hillary Clinton \"says many immigrants are doing jobs Americans won't do.\" \nAll of these folks think they're being pro-immigrant, but the reality is that they're just revealing their own elitism and racist worldview. The sentiment degrades immigrants while coloring Americans as lazy. Outside of the 1-percenters, pretty much everyone has a reason to find this commentary offensive. ( As I've written previously, amnesty is really a gift to the 1 percent. ) \nThe truth is, there is no such thing as a job Americans won't do. Most Americans mow their own lawns and most Americans clean their own toilets. Census Bureau data shows that of all civilian jobs in our economy, only six small occupational categories are majority immigrant (legal and illegal), and it turns out that even in these occupations, native-born Americans still make up 46 percent of the workers. What elites often think of as \"immigrant jobs\" are actually made up mostly of native-born American citizens. For example, of maids and housekeepers, 51 percent are native-born. Of butchers and meat processors, 63 percent are native-born. Of construction laborers, 66 percent are native-born. Of janitors, 73 percent native-born. There is more detail in our \" Are There Really Jobs Americans Won't Do? \" report. \nThere are many ignorant components in Osbourne's comment. For example, nobody is proposing to \"kick every Latino out\" (note that most are either our fellow Americans or legal immigrants). But many Americans do propose returning illegal aliens home (a population made up of a diversity of ethnicities and nationalities). But that raises a question: Does Osboune think that \"every Latino\" is in the country illegally? Logically, if one says, \"We need to deport all illegal aliens,\" and Osbourne thinks this equates to \"kicking every Latino out,\" she must believe that all Latinos are illegal aliens. Such ignorance would be comical if it weren't so degrading. Unfortunately, many in the pro-amnesty crowd routinely make similar arguments. \nOsbourne later argued that she was stopped mid-sentence and couldn't finish her point. She should go ahead and finish her point and tell us whether she thinks the United States should be welcoming more low-skilled labor, or whether the country already has enough people desperate for jobs. She could tell us her thoughts on her home country's immigration problem right now, with foreigners attempting to sneak through the Chunnel . Does the U.K. need more cheap, foreign labor (for toilet cleaning, or otherwise)? \nIf Osbourne comes out in favor of better immigration enforcement, she'll be joining the overwhelming majority of Americans who are not calling for immigration increases. \nFeere is the legal policy analyst at the Center for Immigration Studies. Tags:", "external_links": [], "published": "2015-08-06T19:00:00.000+03:00", "crawled": "2015-08-07T05:15:59.517+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}