{"organizations": [], "uuid": "e889a7b9d191d6b515c934d550022c62f14fc12a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/grahamfox.png", "site_section": "http://thehill.com/taxonomy/term/36/feed#", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/blogs/floor-action/senate/254452-graham-america-needs-to-leave-abortion-club-of-seven", "country": "US", "title": "Graham: America needs to leave abortion 'club of seven'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Graham: America needs to leave abortion 'club of seven'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-22T01:48:00.000+03:00", "replies_count": 0, "uuid": "e889a7b9d191d6b515c934d550022c62f14fc12a"}, "author": "jcarney@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/senate/254452-graham-america-needs-to-leave-abortion-club-of-seven", "ord_in_thread": 0, "title": "Graham: America needs to leave abortion 'club of seven'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 21, 2015, 06:48 pm Graham: America needs to leave abortion 'club of seven' By Jordain Carney Fox News Sen. Lindsey Graham (R-S.C.) urged his colleagues to allow a 20-week abortion ban to move forward, saying it's time for America to \"get out of this club of seven.\" \"We're one of seven nations in the entire world that allow abortion on demand at 20 weeks, the fifth month of the pregnancy. I'd like to get us out of that club,\" the South Carolina Republican, who is running for president, said Monday. ADVERTISEMENT Other countries that don't ban elective abortions after 20 weeks include Canada, China, the Netherlands, North Korea, Singapore and Vietnam. Graham's remarks come as the Senate is expected to take a procedural vote on Tuesday on proceeding to a House-passed bill that would ban most abortions after 20 weeks. The South Carolina senator, who has introduced a similar bill in the Senate that has gained 45 cosponsors, suggesting that he is at the forefront of the current debate, saying that he is \"honored to lead this fight.\" But Tuesday's vote is expected to fail to get the 60 votes needed to overcome the procedural hurdle. If every Republican supports the bill, Senate Majority Leader Mitch McConnell (R-Ky.) would need six Democrats to buck their party and support moving forward with the legislation. Acknowledging that the bill would likely be blocked from being taken up, Graham asked Democrats \"what are you afraid of?\" \"I'm not afraid of my idea,\" he added. \"I'm very disappointed that we can't even have the debate. This, I promise you, as long as I'm here and many others on our side and hopefully some of the side over here [Democrats], this debate will continue until we get the right answer.\" Democrats have, separately, introduced legislation that would roll back certain state-level restrictions on abortions. Graham said he would back allowing Democrats to offer their legislation as an amendment to the abortion ban legislation. The move, however, would be largely symbolic with Democrats likely not having the votes needed. The Senate's fight over the abortion bill comes as Republican leadership is under pressure to allow a vote on defunding Planned Parenthood in the wake of a series of controversial videos. Graham added that those videos has \"woken America up\" to the debate over late-term abortions. \"This discussion about harvesting organs from children late in the birthing process has woken America up,\" he added. \"So I promise you, this is a debate worthy of this body, worthy of this country, one that we're going to have over and over again until we can get a vote, and I'm not going to stop.\"", "external_links": [], "published": "2015-09-22T01:48:00.000+03:00", "crawled": "2015-09-22T08:47:39.006+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}