{"organizations": [], "uuid": "4180b7fe1eb6d9ff05b46a4ea34aaf319eaf02e9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3373036/images/o-BIBLE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/religion/blog.xml", "section_title": "Religion Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/dr-joel-hoffman/what-does-the-bible-really-say-about-abortion_b_8076790.html", "country": "US", "title": "What Does the Bible Really Say About Abortion? | Dr. Joel Hoffman", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 180, "title_full": "What Does the Bible Really Say About Abortion? | Dr. Joel Hoffman", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-02T19:51:00.000+03:00", "replies_count": 364, "uuid": "5b4220899d0d919c267398011f2323cbff887899"}, "author": "Dr. Joel Hoffman", "url": "http://www.huffingtonpost.com/dr-joel-hoffman/what-does-the-bible-really-say-about-abortion_b_8076790.html#post-0", "ord_in_thread": 0, "title": "What Does the Bible Really Say About Abortion? | Dr. Joel Hoffman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With the Pope's recent leniency regarding abortion, it's a good time to ask, What does the Bible say about abortion? And the answer is, almost nothing.\nThis surprising vacuum has opened the door for various revisionist readings.\nThere's one direct mention of a fetus in the Bible, and that's in Exodus 21:22, which demands monetary damages of people who accidentally hit a pregnant woman and cause \"her offspring to leave her.\"\nUnfortunately, the Hebrew wording here, combined with conflicting ancient understandings of this text, make the nuances of this passage hard to understand. Reflecting this difficulty, the New Revised Standard Version (NRSV) translation thinks this is about causing a woman to miscarry, while the New International Version (NIV) thinks it's about causing a woman to give birth prematurely.\nIf the NIV is right, even this passage isn't about abortion. If the NRSV is correct (as seems likely), then the monetary damages here make it clear that a fetus is not a person in the eyes of the Bible, because the Bible forbids monetary damages for killing a person.\nSome people focus on the Hebrew in this passage. The word here for the \"offspring\" that leaves the mother is yeled. Because that word means \"child\" (generally in contrast to \"adult,\" like the English \"youngster\"), some people say that the fetus is already a child. But the logic here is flawed. For instance, according to Genesis 25:23, Rebbecca has \"two nations\" in her womb, but no one concludes that a fetus is therefore a nation.\nIn fact, languages commonly use words in more than one way, and, in particular, words can be separated from the time at which they apply. This is why in English a drawing of George Washington at age two might be captioned \"The Founding Father as a Child\" even though he wasn't yet the founding father. And it's why a woman might buy a house with rooms for \"her children\" even before she's pregnant. Similarly, the \"nations\" in Rebecca's womb are not yet nations, and the \"child\" in Exodus 21:22 is not yet a child. (Similar reasoning is similarly flawed. The often cited \"infant\" in Elizabeth's womb in Luke 1:41 does not mean that fetuses are infants.)\nSo one revisionist biblical reading is that a fetus is a person. It is not.\nOther passages may suggest that elective abortions are frowned upon. Leviticus 19:28 and Deuteronomy 41:12 warn people not to make cuts on their bodies, and 1 Corinthians 6:19-20 declares that people's bodies belong to God. Abortions might then be like other surgery --- permitted only for a good reason, with no biblical insight into what that reason might be. But this falls in the category of guesswork.\nThe Bible doesn't prohibit abortions.\nIn the other direction, some people who want to allow abortions report that Exodus 21:22 in the Bible allows abortions. But this isn't right either. Exodus 21:22 is about causing someone else's miscarriage by accident, not about purposely performing an abortion. And it is not about what a woman does to or for herself.\nJust as the Bible doesn't prohibit abortions, it doesn't allow them, either.\nThis silence on the issue is particularly vexing in light of the unparalleled attention the Bible devotes to human life. The Bible shouts the value of understanding when life begins, but nonetheless doesn't give us any sort of answer.\nOne thing is clear, though. For the biblically minded, this is a serious debate that deserves more than facile quotations of barely relevant biblical passages taken out of context, because even though it doesn't give us an answer regarding abortion, the Bible insists on the supreme importance of the question.\nDr. Hoffman is author of And God Said: How Translations Conceal the Bible's Original Meaning (2010), The Bible's Cutting Room Floor (2014), and the forthcoming The Bible Doesn't Say That: 40 Biblical Mistranslations, Misconceptions, and Other Misunderstandings (2016). He can be reached through his website at www.lashon.net .\nFollow Dr. Joel Hoffman on Twitter: www.twitter.com/JoelMHoffman\nMore: Abortion Exodus 21:22 Joel M. Hoffman Niv 1 Corinthians 6:19 Pope Francis Nrsv Bible Bible Abortion Pope Francis Abortion This Blogger's Books and Other Items from... The Bible's Cutting Room Floor: The Holy Scriptures Missing From Your Bible\nby Joel M. Hoffman And God Said: How Translations Conceal the Bible's Original Meaning\nby Joel M. Hoffman", "external_links": ["http://www.twitter.com/JoelMHoffman", "http://www.amazon.com/exec/obidos/ASIN/1250059488", "http://ecx.images-amazon.com/images/I/41iBLia0nuL._SL160_.jpg", "http://ecx.images-amazon.com/images/I/51JDpnIyJmL._SL160_.jpg", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.amazon.com/exec/obidos/ASIN/0312565585", "http://www.amazon.com/", "http://www.amazon.com/exec/obidos/ASIN/125004796X"], "published": "2015-09-02T19:51:00.000+03:00", "crawled": "2015-09-03T02:31:29.317+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}