{"organizations": [], "uuid": "6f302555d80d143bc25a4389fd7b637c02e0b94e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3460058/images/o-POPE-FRANCIS-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com//feeds/index.xml", "section_title": "The Huffington Post | The Full Feed", "url": "http://www.huffingtonpost.com/2015/09/24/the-morning-email_n_8188324.html", "country": "US", "title": "Thursday's Morning Email: Pope Focuses On Climate Change, Immigration and Inequality", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Thursday's Morning Email: Pope Focuses On Climate Change, Immigration and Inequality", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-24T13:51:00.000+03:00", "replies_count": 0, "uuid": "6f302555d80d143bc25a4389fd7b637c02e0b94e"}, "author": "Lauren Weber", "url": "http://www.huffingtonpost.com/2015/09/24/the-morning-email_n_8188324.html", "ord_in_thread": 0, "title": "Thursday's Morning Email: Pope Focuses On Climate Change, Immigration and Inequality", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thursday's Morning Email: Pope Focuses On Climate Change, Immigration and Inequality Posted: reddit \nTOP STORIES \nTo get The Morning Email, HuffPost's daily roundup of the news, in your inbox, sign up here. And listen to the news in under two minutes here. \nPOPE FRANCIS SIGNALS FOCUS ON CLIMATE CHANGE, IMMIGRATION AND INEQUALITY “Cheered by jubilant crowds across the nation's capital, Pope Francis forged common cause Wednesday with President Barack Obama on climate change, immigration and inequality, as the popular pontiff signaled he would not sidestep issues that have deeply divided Americans.” The pope canonized Junipero Serra as the newest Catholic saint, the first time any pope has done so on American soil. And meet the five-year-old who pushed her way through the crowds and into Pope Francis’s arms . [ AP ] AT LEAST 220 DEAD IN MECCA STAMPEDE “At least 220 pilgrims were killed on Thursday in a crush at Mina, outside the Muslim holy city of Mecca, where some two million people are performing the annual haj pilgrimage, Saudi Arabia's civil defense authority said. The crush, in which at least 450 others were injured, took place on Street 204 of the camp city at Mina, a few kilometers east of Mecca, where pilgrims stay for several days during the climax of the hajj.” Here’s a look at other major hajj-related accidents and tragedies . [ Reuters ] \nOF COURSE THE OPM HACK WAS WORSE THAN ORIGINALLY REPORTED Turns out hackers got away with 5.6 million fingerprints of government workers. [ Reuters ] \nEU AGREES TO NEW REFUGEE AID The European Union has agreed to provide over $1 billion more in refugee aid. And meet the newest villain in the refugee crisis. [ AP ] \nCOLOMBIA, FARC REBELS ANNOUNCE PEACE TALK BREAKTHROUGH “President Juan Manuel Santos of Colombia and the leader of the country’s largest rebel group said Wednesday that they were close to completing a peace deal to end Latin America’s longest-running guerrilla war, announcing that they had reached breakthroughs on some of the most difficult issues dividing the two sides.” [ NYT ] \nCVS TO SELL OVERDOSE REVERSAL DRUG If you or a family member have an opiate addiction, CVS will sell you the overdose reversal drug naloxone without a prescription in 14 states. [ Nick Wing, HuffPost ] \nYOUR DRIVER’S LICENSE ISN’T ENOUGH TO GET YOU ON A PLANE IN FOUR STATES Citizens from Louisiana, Minnesota, New Hampshire and New York will need a passport or immigration papers to fly once provisions of the Real ID Act goes into place. [ Michael McLaughlin ] \nWHAT’S BREWING \nTHERE IS AN ‘ANGRY BIRDS’ MOVIE TRAILER This is why we can’t have nice things. [ Vulture ] \nNETFLIX KNOWS WHEN YOU’VE HIT ‘THE POINT OF NO RETURN’ They know you’re lying to yourself when you say you’ll turn it off after the next episode. [ HuffPost ] \nDOESN’T GET MUCH BETTER THAN VIOLA DAVIS ON HER EMMY WIN “It’s not just the award. It's what it's going to mean to young girls -- young brown girls, especially. When they saw a physical manifestation of a dream, I felt like I had fulfilled a purpose.” [ Variety ] \nWHY BEING UNTIDY IS ACTUALLY GOOD FOR YOU Sorry, Mom -- that clutter isn’t all bad, we promise. [ The Point Magazine ] \nIN MOCK DEBATE, IT’S INMATES VS. HARVARD “On one side of the stage at a maximum-security prison here sat three men incarcerated for violent crimes. On the other were three undergraduates from Harvard College. After an hour of fast-moving debate on Friday, the judges rendered their verdict. The inmates won.” [ WSJ ] \nSAY GOODBYE TO THE BEST DAYS OF REALITY TV How can it compete with “Empire?” [ Vulture ] \nWHY EVERYTHING IS BAD FOR YOU “Health-scare stories, even those that are not overblown, draw their special power from the fact that we go through the days denying our mortality. Each one reminds us anew that there’s no way out. Unable to avoid this tragic and absurd-seeming condition, we lash out against our fates by finding fresh reasons to make a villain out of the one thing that is doing its part to keep us alive: food.” [ NYT ] \nFor more from The Huffington Post, download our app for iOS or Android . \nWHAT'S WORKING \nTHE NEXT TOOL FOR COLLEGES TO COMBAT BINGE-DRINKING “A new online tool developed by the National Institute on Alcohol Abuse and Alcoholism aims to help colleges sort through a myriad of programs to find the right one that can help their campus combat binge drinking.” [ HuffPost ] \nON THE BLOG \nARIANNA HUFFINGTON: DONALD TRUMP’S DECLINE “There comes a moment in the political life of every big-personality, more-sizzle-than-steak candidate when they step across the line of legitimacy, or illegitimacy (depending on your perspective), even for media addicted to the high ratings these candidate-entertainers provide.” [ HuffPost ] \nBEFORE YOU GO \n~ Shonda Rhimes is developing another medical drama . We’re not clear when the incredible showrunner sleeps. \n~ What happens when you order everything you could ever need online for delivery for a week . \n~ Got bumped from a flight? That could snag you a cool $1,300 . \n~ The BBC has picked up J.K. Rowling's latest mystery trilogy for a TV series . \n~ Sad news for love, folks: Amy Poehler and Nick Kroll have split . \n~ Chapter ten in Steven Brill’s investigation into Johnson & Johnson tackles what the CEO knew . \n~ Casserole recipes that somehow overcome the fact they’re called casserole recipes. \n~ When ballerinas get stage fright . \n~ In case you didn’t know, the president of China is cute, handsome and the perfect husband -- according to the Communist party’s official newspaper . \n~ You’ll want to check out this photo series on childbirth , captured in two very different worlds in Sweden and Tanzania. \n~ Because it’s Thursday, this toddler is having a rather tough time walking his massive bulldog friend . \n~ Making sense of all the single and dead parents in the Disney universe. \n~ And in case you have a virtual reality headset lying around, you can now watch Facebook videos in 360 degrees. \nSend tips/quips/quotes/stories/photos/events/scoops to Lauren Weber at lauren.weber@huffingtonpost.com. Follow us on Twitter @LaurenWeberHP . And like what you're reading? Sign up here to get The Morning Email delivered to you. More:", "external_links": [], "published": "2015-09-24T13:51:00.000+03:00", "crawled": "2015-09-24T14:03:57.428+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}