{"organizations": [], "uuid": "4a1265c1bb32f086ffedde6f26b94d2046a747a3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/christie_8_0.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/blogs/ballot-box/presidential-races/250026-christie-working-on-immigration-plan", "country": "US", "title": "Christie working on immigration plan", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Christie working on immigration plan", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-02T17:00:00.000+03:00", "replies_count": 0, "uuid": "4a1265c1bb32f086ffedde6f26b94d2046a747a3"}, "author": "Kristina Wong", "url": "http://thehill.com/blogs/ballot-box/presidential-races/250026-christie-working-on-immigration-plan", "ord_in_thread": 0, "title": "Christie working on immigration plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 02, 2015, 10:00 am Christie working on immigration plan Kenny Wassus / IJReview \nNew Jersey Gov. Chris Christie (R) said Sunday he is still deciding what he would do with 11 million illegal immigrants now in the U.S. if he wins the presidency. ADVERTISEMENT \"I don't know,\" Christie said when asked on CNN’s “State of the Union” if he would allow them legal status, addressing one of the top issues in the 2016 presidential race.\n\"Not yet, but I will,\" he added. \nHe said currently, there are \"not enough law enforcement officers to forcibly deport 11 million people.\" \nHe also said he would increase the number of law enforcement to be able to deport them, but stopped short of saying he would do so as president. \nAs far as preventing more undocumented workers from immigrating to the U.S., he said he would seek a solution using E-Verify, a system used to register and monitor the work status of undocumented workers. \n\"If folks knew they would not get jobs, they would not come,\" he said. \nChristie also said he favored defunding Planned Parenthood, after videos surfaced showing employees discussing harvesting fetus organs. \nHe also said he has changed his stance on gun control from 20 years ago, when he first entered politics, saying he has \"learned a lot,\" and touting his veto of rifle bans. \n\"I'm a law enforcement guy,\" he said. \"Public safety is paramount.\" \nChristie refrained from saying there is a problem with police and African-American citizens, but said, \"There's a problem across the country with our police force and our citizens.\" \nHe called for a more \"constructive\" relationship, and said there needed to be teaching of both the community and the police force on how to interact. \n\"There is still a lot of racism in our country,\" he acknowledged. \n\"We still have a lot of work to do,\" he said. Tags: Past: 1 day Bush at Urban League: Obama was '... The Republican says president was right on noting past injustices. Obama tells liberals: I can't... The White House is mounting a vigorous push to convince liberals to back... A.B. Stoddard: Clinton must be... OPINION | Obvious mistakes aren’t being avoided but amplified, and... Christie to Colorado: Pot party... “As of January 2017, I will enforce the federal laws,” he says. Trump: 'World would unite if I... \"I think that I would have great diplomatic skills,\" he said in Scotland. Trump atop new poll; Kasich making... Despite leading the field, Trump has the worst favorability score among... Planned Parenthood strikes back The group’s top leaders have sharpened their attacks against the... McConnell warns Obama against... Fight over tobacco could jeopardize support for huge trade pact. Rubio: I hope Tom Brady retires “Every week he is not on the field is good news for the Miami Dolphins,\"... Sen. Grassley blocks judges, tells... The Iowa Republican refused to allow the confirmation of three judges for... White House threatens to veto bill... A measure stripping funding \"is certainly something\" that would draw a... Hillary's haircut: $600? Part of a New York salon was reportedly locked down for her visit. CISA: the dirty deal between... CISA is an out and out surveillance bill masquerading as a cybersecurity... Gruesome abortion clinic footage... The video contains hidden-camera footage from inside a Planned Parenthood... Fox debate rules could give Trump... The top-polling candidate will reportedly get center podium at the first... Sanders would clobber Trump in a... Sanders is destined to be a pacesetter; Trump is destined to become a... Trump campaign looking into... Advisor Sam Nunberg will be fired if reports are true, the campaign... Democrats and Republicans take... White lives are not 21 times more likely to be killed by the police. Cruz wants delay in Iran review... Presidential candidate says 60-day clock hasn't really even started yet. Is Bernie Sanders the next George... Can a senator from a small state again come out of nowhere to win the... Sanders vows no third-party run in... “I would not want to be responsible for electing some right-wing... Rand Paul attributes Trump's rise... \"We're going to come back to our senses and look for someone serious,\"...", "external_links": [], "published": "2015-08-02T17:00:00.000+03:00", "crawled": "2015-08-02T17:15:32.654+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}