{"organizations": [], "uuid": "d4bdeccd37d428aca2623ca7a6710d27cf3fb467", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/mcconnellmitch_072815gn.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/blogs/floor-action/senate/250292-mcconnell-takes-aim-at-obama-ahead-of-iran-speech", "country": "US", "title": "McConnell takes aim at Obama ahead of Iran speech", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McConnell takes aim at Obama ahead of Iran speech", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-05T17:06:00.000+03:00", "replies_count": 0, "uuid": "d4bdeccd37d428aca2623ca7a6710d27cf3fb467"}, "author": "jcarney@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/senate/250292-mcconnell-takes-aim-at-obama-ahead-of-iran-speech", "ord_in_thread": 0, "title": "McConnell takes aim at Obama ahead of Iran speech", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 05, 2015, 10:06 am McConnell takes aim at Obama ahead of Iran speech By Jordain Carney Greg Nash Senate Majority Leader Mitch McConnell (R-Ky.) aimed to pressure President Obama on the Iran nuclear deal ahead of his speech later Wednesday. \"It's clear that the deal is making members of both parties uneasy, and with good reason,\" the Republican leader said. \"That's why I've called for a debate worthy of the importance of the agreement when the Senate takes it up in September. I hope the president will echo this tone of seriousness in his remarks later today.\" ADVERTISEMENT The president is expected to say during a speech at American University in Washington that it would be a \"historic mistake\" for Congress to reject an agreement reached last month on Iran's nuclear program. Under the deal, Iran would limit its nuclear program in exchange for sanctions relief. McConnell said Obama should \"avoid tired, obviously untrue talking points about this being some choice between a bad deal and war. ...Now is the time to aim higher. Now is the time to dig deeper. What I'm asking for is President Obama to join us in rising to the moment.\" The White House has launched a full-court press to try to shore up support for the agreement among Democrats. They'll need roughly 34 Democrats in the Senate to back the deal in order to sustain the expected veto from Obama. While three Senate Democrats voiced their support of the deal on Tuesday, many Democrats are still undecided, including Minority Leader Harry Reid (D-Nev.) \"Like many senators, I'm continuing to consider this matter. I'm looking forward to the briefing tonight,\" Reid said, referring to meeting with Energy Secretary Ernest Moniz. \"It's altogether appropriate for senators to consider this deliberately and with the understanding that this is really important.\" The meeting for senators with Moniz comes as lawmakers are expected to leave Washington for a five-week recess. Senators will have less than two weeks to vote on either a resolution of approval or resolution of disapproval on the deal once they return in September. Past: 1 day Bush drops 40 pounds on Paleo diet Bush talked about his weight loss in an interview at an Iowa Dairy Queen. Trump: Harvard students '... Trump fell victim to an elaborate prank by a group of Harvard students. Juan Williams: GOP's anger turns... OPINION | Republicans who feed the resentments of the base imperil GOP... Trump widens lead in new poll The billionaire businessman leads Jeb Bush 26 percent to 12 percent. Rand Paul attributes Trump's rise... \"We're going to come back to our senses and look for someone serious,\"... Trump builds his political machine He is taking aggressive steps in Iowa and New Hampshire. Kasich makes quick rise in polls Ohio Gov. John Kasich entered the GOP race late but has already made... Sanders disagrees with Clinton on... Sanders said he was surprised by Clinton's reluctance to state a position... Senate GOP thwarted in effort to... Two Democrats voted to move forward with the bill, which stalled in a 53-... GOP field gets ready to rumble The top 10 candidates are preparing to face off in the long-awaited Fox... Sanders: 'No question' I can beat... The longshot presidential candidate said he is forcing Hillary to \"respond... Trump sees double-digit surge in... Trump leads the GOP field in a new Wall Street Journal/NBC News poll. Signs of division in the GOP on... Some Republicans are questioning the strategy of using budget... Harvard Lampoon tricks Trump with... A fake endorsement called Trump \"the most formidable and competitive\" GOP... Cruz cooks bacon with a machine gun The presidential candidate shows off the method in a new video. Gawker publishes Trump phone number “Mr. Trump has several numbers so this is not an issue,” a campaign source... Jindal cuts off state Medicaid... The presidential candidate cited the recent controversial videos. Carson: Black Lives Matter... Carson also discussed illegal immigration in an NBC interview. Dem senator backs defunding... Manchin is the first Senate Democrat to back the legislation. Trump: GOP challengers 'viciously... \"They attacked me first and I hit them back,\" he said Sunday. Iran denies link between... A website alleged that Javad Zarif’s son was the best man at Vanessa Kerry... Poll: ObamaCare enrollees less... Cost is the most common problem cited by people who are enrolled.", "external_links": [], "published": "2015-08-05T17:06:00.000+03:00", "crawled": "2015-08-05T18:40:16.514+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}