{"organizations": [], "uuid": "e8c824230a4b7675f8b0da42967044f5f8998d79", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1247485/images/o-OHIO-NATIONAL-GUARD-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/russ-belville/why-i-fight-for-ohio-mari_b_8128906.html", "country": "US", "title": "Why I Fight for Ohio Marijuana Legalization | Russ Belville", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Why I Fight for Ohio Marijuana Legalization | Russ Belville", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-14T19:23:00.000+03:00", "replies_count": 0, "uuid": "e8c824230a4b7675f8b0da42967044f5f8998d79"}, "author": "Russ Belville", "url": "http://www.huffingtonpost.com/russ-belville/why-i-fight-for-ohio-mari_b_8128906.html", "ord_in_thread": 0, "title": "Why I Fight for Ohio Marijuana Legalization | Russ Belville", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'm somewhat of an outlier in the marijuana reform movement these days. Ohio has marijuana legalization on the ballot for 2015, and I'm one of the few high-profile (pardon the pun) legalization advocates pushing hard for its passage. Most of my colleagues are in a hold-their-nose-and-backhandedly-support-it public stance, and some are assiduously attacking the measure and angling for its defeat.\nThat's because they don't understand the nature of this war. This is not about marijuana and it is certainly not about entrepreneurship.\nThis is about freedom.\nIn 1971, the president of the United States declared war on people like me who use marijuana. People don't think of it that way, but when you look at how our liberties have been shredded in the War on Drugs, they should.\nThis war, in a nutshell, is the ability for authorities of the state to abrogate my rights because the drug I choose to use is contraband. The result is a society where my friends who choose to use alcohol, nicotine, and numerous prescription drugs that are far more harmful than my drug are afforded adult respect and accommodation, while my people are treated as criminals.\nIn 2014, I sat on the side of a Utah freeway while armed agents of the state rifled through my personal possessions and detained me for six hours until I could raise $1,200 because they detected marijuana. For twelve months, I've had to diligently pay $100 a month to ensure I don't have a permanent criminal record, while being extra cautious to avoid encounters with law enforcement who'd quickly discover I have a current criminal drug record in Utah. I take this shit personally.\nSo the way the war is won is by taking from the authorities, state by state, the ability to fuck with adults who use marijuana. When marijuana is not contraband, the whole game changes. We shift from being criminals seeking a high to consumers of a legal product seeking equal rights. We get businesses and money and tax revenue and lobbyists and politicians on our side.\nThen we fight for cultivation rights. Then we fight to make the business model more equitable. But we've got to get it legal first, period.\nThe reason so many of these stoners against legalization feel confident in \"wait 'til next year\" is most of them don't get busted. There are 20 million-ish pot smokers, but 675,000-ish marijuana arrests. It's like what, 1 in 30 of us are going to get busted? Then, in Ohio, it's a ticket and driver's license loss, no arrest, so some people don't fear the risk of remaining criminals.\nSometimes that's attributable to those people being white, or older, or both, and being far less likely to be busted if they're careful. Why accept a less-than-perfect legalization, they'd think, when I've already got my hook-up; I smoke pretty much with impunity, and I am disgusted at the idea of know-nothing carpetbagger money guys who don't know their sativa from Shinola swooping in and stealing the industry from my pals who are cop-ducking risk-taking illicit marijuana growers who've kept me high all these years?\nSo, I get it. I'm not ignorant to the shitiness of the business plan, the opportunistic capitalistic ignorant (really, a superhero bud?) asshole behind the measure, and the karmic turd sandwich voting for Issue 3 will be.\nBut to me, this is war. And it's not us against the corporations or us against the rich, it's us against the prohibition that keeps us second-class citizens.\nTo me, it's not just Ohio, it's every goddamn state that is so much further behind Ohio, wishing they had a shot at imperfect legalization. States like Texas where women get raped in parking lots by cops who claim they smell marijuana in the women's vaginas. States like Missouri where a man serving life for pot finally gets released, but so many more men and women in so many more states are rotting behind bars. States that only inch closer to freedom on the wave of other states' successes.\nI never again want to see the prohibitionists win another battle in this war. I understand being pissed off at how Ohio came to be voting on legalization before California. I understand hating what kind of legalization is being offered. But I don't understand voting against legalization because it helps rich people or corporations or thwarts the career dreams of marijuana growers when 7 out of 8 marijuana arrests are of marijuana consumers who paid to be arrested, while growers at least profited for their risk of arrest.\nLegalization changes everything. Think of how powerful marijuana has been even as it has been federally prohibited and illegal in all fifty states. Literally over one trillion dollars spent to eradicate this plant and destroy the lives of the people who utilize it, and we ended up with a society that celebrates it in movies, TV and pop concerts.\nBut we're supposed to fear Ohio gifting commercial marijuana cultivation to ten entities? When it comes with legal pot shops, extraction companies, testing labs, processing facilities that anyone can own? When it means medical marijuana patients can get relief? When any adult can grow four plants and possess a half-pound at home? Really?\nHow is legalizing marijuana in Ohio in 2015 going to be worse than an Ohio where being caught with weed, at best, means cops can detain and harass you, take your weed, search your person and your car, give you a ticket, cost you money, take your driver's license, and mess with your job, housing, and educational prospects because you've gotten a minor misdemeanor for drug possession?\nWin every battle. Do not give the opponent any quarter. Be as ruthless to our enemy as they have been to us. They will all be hoping that Ohio defeats legalization in 2015. They want to keep making easy ticket money, busting down home growers' doors, seizing people's assets over marijuana. They want to keep raking in cash for drug testing and prison and probation and parole. Don't give them a victory.\nFollow Russ Belville on Twitter: www.twitter.com/RadicalRuss\nMore: Ohio Responsibleohio Marijuana Marijuana", "external_links": ["http://www.twitter.com/RadicalRuss"], "published": "2015-09-14T19:23:00.000+03:00", "crawled": "2015-09-14T21:21:00.330+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}