{"organizations": [], "uuid": "eb3e9b5bfd5db45cb0d78f57f6b8bb93c4732458", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/27/feed#", "section_title": "The Hill: Technology Policy", "url": "http://thehill.com/policy/technology/254431-obama-administration-declares-broadband-core-utility-in-report", "country": "US", "title": "Obama administration declares broadband ‘core utility’ in report", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama administration declares broadband ‘core utility’ in report", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-22T00:20:00.000+03:00", "replies_count": 0, "uuid": "eb3e9b5bfd5db45cb0d78f57f6b8bb93c4732458"}, "author": "mtrujillo@thehill.com (Mario Trujillo)", "url": "http://thehill.com/policy/technology/254431-obama-administration-declares-broadband-core-utility-in-report", "ord_in_thread": 0, "title": "Obama administration declares broadband ‘core utility’ in report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama administration declares broadband ‘core utility’ in report By Mario Trujillo - 09/21/15 05:20 PM EDT \nThe Obama administration on Monday declared broadband Internet a “core utility,” while announcing three dozen steps federal agencies are taking to get more people online. \nThe administration’s Broadband Opportunity Council, which was created in March, released a 40-page report outlining challenges and recommendations to increase Internet deployment. ADVERTISEMENT “Broadband has steadily shifted from an optional amenity to a core utility for households, businesses and community institutions,” according to the report . “Today, broadband is taking its place alongside water, sewer and electricity as essential infrastructure for communities.”\nAccording to Pew Research, 84 percent of U.S. adults use the Internet. But the government points to one in four households without an Internet connection. It also points to a lack of choice for Internet — including high-speed broadband — for citizens in rural or poor regions. \nThe Obama administration has spoken up on a number of Internet issues. It was a large backer of the controversial net neutrality rules approved in February, which are being challenged in court. Earlier this year, it also encouraged locally owned broadband projects, that have brought super-fast Internet to some cities. \nThe recommendations and actions in the Monday report focus on federal regulations that are holding up deployment, and ways the government can encourage deployment. It also focuses on ways to get people who are not currently online to switch over. \nA lot of the federal action will focus on opening up grants and loans to broadband projects, or clarifying the permitting process for deployment on federal lands. \nFor example, the Department of Housing and Urban Development will soon require new residential construction projects to include planning for Internet access in each unit. Other grants from Health and Human Services will go toward electronic health records. \nIn the report, the administration vowed to create and advertise a single place online for individuals to search for broadband-related projects. \nThe other portion of the report focuses on outreach to the state and private sector, which is where a lot of the decisions about Internet deployment are made. \n“While sound national policies and programs are important, most decisions on broadband investment are made by Local governments in partnership with the private sector,” according to the report. \nSome examples of outreach include having the private sector come up with a set of benchmarks to measure Internet deployment at the local level. Another would encourage “dig once” policies that allow Internet fiber cables to be laid during other government water or transportation projects. \n“‘Dig Once’ policies help Local and State governments lower their own costs and costs for telecommunication companies by coordinating infrastructure projects and allowing conduit to be laid alongside transportation, water and other projects,” according to the report. Tags:", "external_links": [], "published": "2015-09-22T00:20:00.000+03:00", "crawled": "2015-09-22T05:21:16.636+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}