{"organizations": [], "uuid": "9ed4eec58933ae68172179efb170e9de92287f2f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/blog.xml", "section_title": "WorldPost Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/sam-bahour/how-obama-can-save-the-tw_b_8138822.html", "country": "US", "title": "How Obama Can Save the Two-State Solution Before He Leaves Office | Sam Bahour", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 9, "title_full": "How Obama Can Save the Two-State Solution Before He Leaves Office | Sam Bahour", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-16T21:10:00.000+03:00", "replies_count": 8, "uuid": "86558263e4e7e0decde5d9ba470d4b0b8dcbfdb7"}, "author": "Sam Bahour", "url": "http://www.huffingtonpost.com/sam-bahour/how-obama-can-save-the-tw_b_8138822.html#post-0", "ord_in_thread": 0, "title": "How Obama Can Save the Two-State Solution Before He Leaves Office | Sam Bahour", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama promised that as soon as the Iran nuclear deal is closed he will refocus on the Palestinian-Israeli conflict. Given this shift of focus is now in sight, Obama should grant U.S. recognition of Palestine as an independent state, albeit a militarily occupied one. Such an elementary step is long overdue and may be the sole act that saves the two-state solution.\nPalestine will never be a complete nation state if required to negotiate its statehood with its military occupier Israel. Without the immediate altering of the dynamics of the conflict, extremism is almost guaranteed to begin pouring into the Palestinian community and Israel. Any further deterioration of the situation on the ground could lead a future Republican president to send U.S. boots to protect Israel. That would be a colossal mistake.\nRecognizing Palestine would not be such a groundbreaking move. In 2013, 138 countries recognized Palestine as a non-member state in the United Nations. Only the United States and eight others have not. Over 130 states have already bilaterally recognized Palestine, including the Vatican. The United States has been on the wrong side of history for so long on this issue it has lost strategic standing in the Middle East and across the globe. It will continue to do so unless it makes an abrupt about-face.\nObama started his presidency with a clear focus on reviving the peace process. One of his first acts as president was to appoint former Senate Majority Leader George Mitchell as special envoy for the Middle East. Then Obama traveled to Cairo to deliver a policy speech where he said, \"America will not turn our backs on the legitimate Palestinian aspiration for dignity, opportunity, and a state of their own.\" Next, Obama took on Israel's non-stop illegal settlement building in the West Bank and in that debate he made clear that \"to ensure that Israel is safe and secure\" efforts must be made to \"set the stage for a Palestinian state.\"\nAll of these initial overtures to restart the peace process were noble ones, but they all failed. Mitchell resigned in utter frustration, America turned its back on Palestine and focused on Iran, and illegal Israeli settlement building picked up its pace.\nMore recently, in the fall of 2013, Obama deployed Secretary of State John Kerry to make one more attempt to salvage the failed peace process and gave him nine months to make progress. Kerry launched his mission with a bold assessment, stating, \"I believe the window for a two-state solution is shutting, I think we have some period of time - a year to year-and-a-half to two years, or it's over.\" Well, we are now entering year three and Kerry was spot on. The two-state solution door is closing, if not already shut completely.\nSo in the limited time left in his presidency Obama can save his administration's and his legacy in the Middle East by simply recognizing Palestine, an act in total alignment with the historic U.S. foreign policy principle of two states for two peoples.\nSome may think this would be too risky a move for the Democratic Party, given the elections. I disagree.\nFor starters, and as Obama has repeated publicly, his administration has done more for Israel than any other president. Among other things, he increased financial aid; used the almighty U.S. veto power in the UN Security Council to protect Israel from a growing global frustration with its refusal to end its military occupation of Palestine; and armed Israel to the greatest extent possible. So when segments of the Jewish American establishment cry foul when the United States recognizes Palestine, Obama can make note of which side of the conflict he and the United States have consistently engaged. Other segments of the Jewish American community, possible the silent majority, will support such a move.\nWhen Israeli Prime Minister Netanyahu takes to the airwaves, as he surely will, to decry U.S. recognition of Palestine as tantamount to betrayal of Israel's security, Obama can Quote: Netanyahu himself supporting the emergence of a Palestinian state to safeguard Israel's existence.\nThen when the Republican Party attempts to make the recognition of Palestine a partisan issue to better its hand in the presidential race, Democratic candidates can point to President George W. Bush as the first U.S. president to call Palestine by its name, for it was he who instilled in his administration's policy calls for the state of Palestine to finally emerge in order to realize the two-state solution to the conflict.\nWhy is Obama ideal for this historic task?\nFirst and foremost, as we witnessed in the P5+1 Iran nuclear deal debate, Obama has a gift of oration. A move to recognize Palestine would need a simple but emboldened argument to be undertaken in the public square and no one is better equipped for such a task.\nSecondly, Obama's administration has done serious damage in the Middle East. By focusing on Palestine, Obama would be taking a corrective step in the direction of getting America realigned with the region's peoples, not the dictators the United States has propped up to date.\nThirdly, Obama was wronged by Israel so many times during his presidency, one would have to be naive not to think he is not itching to place Netanyahu in a checkmate position before he leaves office. However, he can't do so haphazardly. Thus, recognizing Palestine would be the ideal game-changing move that would bring peace one step closer.\nEvery act of U.S. support to make the State of Palestine an actuality on the ground, one that will ultimately be free of Israeli occupation, would be a clarion show of support for those in the region and elsewhere who support freedom from oppression, occupation, and extremism. The United States could also leverage this political act by demanding better governance of Palestinians, too, an important ingredient to successful statehood.\nThere is a window of opportunity for Obama to complete his administration on a high note. If the opportunity for the United States to recognize Palestine is missed, no one should be surprised when the younger generation of Palestinians finally close the door on the two-state solution, once and for all. U.S. inaction now, when needed most, will only feed the breeding ground for regional extremism to continue to grow.\nSam Bahour serves as a policy adviser to Al-Shabaka, the Palestinian Policy Network and Chairman of Americans for a Vibrant Palestinian Economy . He blogs at ePalestine.com .\nSOURCE: http://bit.ly/obama-two-state\nFollow Sam Bahour on Twitter: www.twitter.com/SamBahour\nMore: Palestine Israel Barack Obama Two State Solution", "external_links": ["http://a4vpe.org/", "http://al-shabaka.org/", "http://www.epalestine.com/", "http://bit.ly/obama-two-state", "http://www.twitter.com/SamBahour"], "published": "2015-09-16T21:10:00.000+03:00", "crawled": "2015-09-17T01:10:46.595+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}