{"organizations": [], "uuid": "2cf1e3bf6671fe9d86670c225af9b0de1f8ffc36", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3448362/images/o-EASTWEST-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/nathan-gardels/obama-xi-summit-success_b_8172178.html", "country": "US", "title": "What Will Make the Obama-Xi Summit a Success | Nathan Gardels", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "What Will Make the Obama-Xi Summit a Success | Nathan Gardels", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-22T20:59:00.000+03:00", "replies_count": 1, "uuid": "ce6fcb12db8a3e2e3b3a4b1136fe314f213944e1"}, "author": "Nathan Gardels", "url": "http://www.huffingtonpost.com/nathan-gardels/obama-xi-summit-success_b_8172178.html#post-0", "ord_in_thread": 0, "title": "What Will Make the Obama-Xi Summit a Success | Nathan Gardels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A \"successful summit\" between Presidents Obama and Xi would be if the two joined together, based on their agreement last year at the Asia-Pacific Economic Cooperation summit, to lead the rest of the world in reaching a deal at the upcoming United Nations' Paris talks on climate change. For the two largest economies in the world to act together in an international forum on one of the most pressing global issues would demonstrate that despite other differences, this is a working partnership on areas of convergent interest.\nThe same would be true if China reaffirms that it will insist, along with the U.S. and the other world powers, on the full implementation of the Vienna accord on Iran's nuclear agreement. Joining together on non-proliferation also demonstrates that the two major powers can work together on overarching issues of common concern. In private talks, with perhaps a public hint, they might suggest this model can work with regards to North Korea.\nFor the two largest economies in the world to act together in an international forum on one of the most pressing global issues would demonstrate that despite other differences, this is a working partnership on areas of convergent interest. On Xi's part, he needs to explain China's transition to \"the new normal\" of a slower domestic consumption-based growth model from an export-led investment model and, as China's central banker did at the recent G-20 finance ministers meeting in Ankara, note that the stock market \"correction\" is more or less complete.\nChina's growth trajectory is as important for the global economy, if not more so, than the U.S. Federal Reserve's impending interest rate increase . The Chinese should take the same communicative stance as the Fed officials have been doing and clarify where the country is headed.\nStumbling Blocks\nThe stumbling blocks most likely to come up are cyberspace and the new non-governmental organization law being promulgated in China.\nThe American public may have regarded China's island reclamation and its extravagant military display on the 70th anniversary of Japan's defeat in the Second World War as worrisome signs that China is no longer \"biding its time and hiding its strength\" but \" seizing the moment and baring its teeth .\" But in the recent cyberattacks (notably, when the U.S. Office of Personnel Management was hacked , allegedly by Chinese actors) they see China actually taking an aggressive bite. This is even more true of the American business community, which sees a protracted campaign to steal intellectual property from American companies.\nXi Jinping marks the 70th anniversary of Japan's defeat in the Second World War at a military parade in Beijing. Xinhua/Luo Xiaoguang via Getty Images.\nThere is no higher priority in relations between the U.S. and China than to begin serious cyber detente negotiations to establish a code of conduct. At the time I am writing this, the signals are unclear. The Obama administration is reportedly considering sanctions against specific Chinese enterprises it sees as the source of the hacking.\nAt that same time, there are other reports that Obama and Xi may embrace the principles of a \" code of conduct \" outlined by a United Nations panel.\nObviously, China, too, has serious concerns on the security side given the Snowden revelations and the fact that much of China's switching systems and other telecom hardware is from U.S. companies.\nAs Fu Ying, chairperson of the Foreign Affairs Committee of the National People's Congress, wrote recently in The WorldPost :\nAt present, American software equipment, products and services are widely used in China's Internet infrastructure and important information systems. If the U.S. regards China as a country to be on guard against instead of as a partner, many in China who use American software may also ask: are we safe?\nThis issue, unaddressed, is driving a deep wedge between the two countries that will be hard to repair going forward if not acted upon now.\nNGOs as Manufacturers of Chaos\nFinally, the issue of China's new NGO law will surely be raised by members of the U.S. Congress. In Beijing earlier this month, I met the vice-chair of the Legal Affairs Committee of the Standing Committee of the National People's Congress, the committee that is drafting the law. He explained that this law must have three readings before a final proposal is ready for a vote. Two readings have now taken place and the third is in the works . To its credit, the committee has solicited and received testimony and proposed amendments to the law from dozens of foreign NGOS, including American universities and think tanks such as Brookings, and seems to be taking them seriously, understanding that this is not just a domestic law, but one which affects foreigners operating in China, and thus international relations.\nWhen I met President Xi in 2013, he declared that \"the more developed China becomes, the more open it will be. It is impossible for China to shut the door that has already been opened.\"\nHowever, key NGOs are rightly worried that this is another attempt at political control since the legislation as it currently stands calls for NGO registration with the public security bureau, not the civil affairs administration. This is already putting a chill on the activities of some of China's closest friends in the West -- universities engaged in \"people-to-people\" relations or environmental groups who hope, like China's leaders, to promote a cleaner environment.\nWhen I met President Xi in 2013, he declared that 'the more developed China becomes, the more open it will be. It is impossible for China to shut the door that has already been opened.' What, the NGOs worry, will happen if Beijing's air quality is criticized, or if the Federalist Papers are taught in Constitutional Law 101, or macroeconomic case studies criticize the over-indebtedness of localities or stock market manipulation? Will they be accused of \"subverting\" China's laws and the rules of public security, \"stirring up conflict\" and \"manufacturing chaos?\"\nOne need only look at the \" white paper \" of the United Front Work Department of the Communist Party on the 50th anniversary of Tibet's ethnic autonomy policy to see how real the concern is.\nAccording to the paper, \"the reincarnation application [for the next 'living Buddha'] must be approved by the State Council.\" If state control reaches even into the metaphysical ether, NGOs are surely within bounds to wonder what is in store for their activities on the university campuses and environmental research teams on the ground in a China less and less open to the world, despite the declarations of President Xi.\nAn earlier version of this article appeared on ChinaFile .\nClose  China's Military of   Chinese People's Liberation Army cadets take part in a bayonet drills at the PLA's Armoured Forces Engineering Academy Base, on the outskirt of Beijing, July 22, 2014.\nChinese People's Liberation Army cadets take part in a bayonet drills at the PLA's Armoured Forces Engineering Academy Base, July 22, 2014.\nChinese People's Liberation Army cadets hold bayonets at the PLA's Armoured Forces Engineering Academy Base, July 22, 2014.\nChinese People's Liberation Army cadets drive a Main Battle Tank near a lake at the PLA's Armoured Forces Engineering Academy Base, July 22, 2014.\nA cadet of Chinese People's Liberation Army conducts a bayonet drill at the PLA's Armoured Forces Engineering Academy Base, Tuesday, July 22, 2014.\nA Chinese People's Liberation Army cadet sits in a Main Battle Tank during a demonstration at the PLA's Armoured Forces Engineering Academy Base, July 22, 2014.\nChinese People's Liberation Army cadets run past a tank on display before conducting a drill at the PLA's Armoured Forces Engineering Academy Base, July 22, 2014.\nChinese People's Liberation Army cadets conduct bayonet drills on a football field at the PLA's Armoured Forces Engineering Academy on July 22, 2014.\nThis picture taken on June 6, 2014 shows security forces participating in a military drill in Hetian, northwest China's Xinjiang region.\nThis picture taken on June 6, 2014 shows security forces participating in a military drill in Hetian, northwest China's Xinjiang region.\n Share  Tweet  &#10006 Advertisement Share this &#10006 close Current Slide More: WorldPost Asia Pacific WorldPost Americas WorldPost Global Order Xi Jinping Climate Change Cyber Warfare Chinese President Xi Jinping Barack Obama Obama Xi Jinping Apec Apec Summit United Nations", "external_links": ["http://www.wsj.com/articles/the-world-struggles-to-adjust-to-chinas-new-normal-1440552939", "https://www.devex.com/news/in-china-ngos-tread-lightly-over-new-law-86230", "http://www.economist.com/node/17601475", "http://www.wsj.com/articles/feds-lockhart-says-interest-rate-rise-in-2015-still-very-much-on-the-table-1442854789", "http://thediplomat.com/2015/07/the-pacific-implications-of-chinas-proposed-ngo-law/", "http://i.huffpost.com/gadgets/slideshows/432178/slide_432178_5625356_sq50.jpg", "http://news.xinhuanet.com/english/2015-09/06/c_134594248.htm", "http://i.huffpost.com/gadgets/slideshows/432178/slide_432178_5625348_sq50.jpg", "http://i.huffpost.com/gen/3451338/thumbs/o-CHINA-MILITARY-PARADE-570.jpg?10", "http://i.huffpost.com/gadgets/slideshows/432178/slide_432178_5625358_sq50.jpg", "http://www.nytimes.com/2015/05/20/technology/6-chinese-men-indicted-in-theft-of-code-from-us-tech-companies.html", "https://www.washingtonpost.com/world/national-security/chinese-hackers-breach-federal-governments-personnel-office/2015/06/04/889c0e52-0af7-11e5-95fd-d580f1c5d44e_story.html", "http://usa.chinadaily.com.cn/epaper/2015-09/07/content_21810644.htm", "http://www.chinafile.com/conversation/advice-xi-jinping-0", "http://time.com/3577820/apec-climate-change-barack-obama-xi-jinping-greenhouse-gas/", "http://i.huffpost.com/gadgets/slideshows/432178/slide_432178_5625368_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/432178/slide_432178_5625372_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/432178/slide_432178_5625352_sq50.jpg", "http://www.nytimes.com/2015/09/20/world/asia/us-and-china-seek-arms-deal-for-cyberspace.html", "http://www.latimes.com/world/asia/la-fg-china-ngos-20150705-story.html", "http://i.huffpost.com/gadgets/slideshows/432178/slide_432178_5625364_sq50.jpg", "http://english.cntv.cn/special/huawei_zte/home/index.shtml", "http://i.huffpost.com/gadgets/slideshows/432178/slide_432178_5625354_sq50.jpg", "http://www.nytimes.com/2015/09/17/us/politics/obama-hints-at-sanctions-against-china-over-cyberattacks.html?_r=0", "http://www.jstor.org/stable/41950513?seq=1#page_scan_tab_contents", "http://i.huffpost.com/gadgets/slideshows/432178/slide_432178_5625366_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/432178/slide_432178_5625362_sq50.jpg", "http://www.chinadaily.com.cn/world/7thcused/2015-06/25/content_21103613.htm"], "published": "2015-09-22T20:59:00.000+03:00", "crawled": "2015-09-23T11:42:44.301+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}