{"organizations": [], "uuid": "e2943687dda437824e82949ef69b035bced6273a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/irsbuilding_042115gn.jpg", "site_section": "http://thehill.com/taxonomy/term/29764/feed", "section_title": "The Hill: Cybersecurity", "url": "http://thehill.com/policy/cybersecurity/250894-obama-requests-72-percent-boost-to-irs-cybersecurity-funding", "country": "US", "title": "Obama requests 72 percent boost to IRS cybersecurity funding", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama requests 72 percent boost to IRS cybersecurity funding", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-12T02:05:00.000+03:00", "replies_count": 0, "uuid": "e2943687dda437824e82949ef69b035bced6273a"}, "author": "esmilowitz@thehill.com (Katie Bo Williams)", "url": "http://thehill.com/policy/cybersecurity/250894-obama-requests-72-percent-boost-to-irs-cybersecurity-funding", "ord_in_thread": 0, "title": "Obama requests 72 percent boost to IRS cybersecurity funding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama requests 72 percent boost to IRS cybersecurity funding By Katie Bo Williams - 08/11/15 07:05 PM EDT The Obama administration has asked for $242 million to cybersecurity funding for the Internal Revenue Service (IRS) — a 72 percent boost. According to an updated budget document released by the White House, the IRS would take “especially aggressive steps to fight identity theft and Stolen Identity Refund fraud” with the new money. The agency in May announced that hackers had accessed the old tax returns of over 100,000 individuals, using the records to claim about $39 million in fake returns and sparking outrage amongst lawmakers. ADVERTISEMENT “This agency has been repeatedly warned by top government watchdogs that its data security systems are inadequate against the growing threat of international hackers and data thieves,” Senate Finance Committee Chairman Orrin Hatch (R-Utah) said in a statement at the time, calling the breach “simply unacceptable.” The 72 percent increase is rivaled only distantly by a 23 percent requested increase to the Department of Health and Human Services’ information security funding. The IRS has often pointed to budget constraints as a chief reason it struggles to keep up with identity thieves. Its IT budget has grown, albeit incrementally — agency spending on cybersecurity increased from $129 million in 2012 to $141.5 million in 2014 — but its cybersecurity staff was chopped by 11 percent over four years. Systems improvements, information sharing between the public sector and industry and increased enforcement resources would all be part of the new $242 million check. The agency would also make “major investments in victim assistance, including comprehensive taxpayer account recovery services.” The White House has asked for more moderate increases to cybersecurity funding for other agencies. Aside from the $262 million suggested for the Department of Health and Human Services, the document calls for a 15.5 percent boost for the Department of Veterans Affairs — to $180.3 million — and a 7 percent increase for the Department of Homeland Security, to $1.4 billion. The Department of Defense would receive $9.5 billion, an 11 percent increase over 2015, while the Department of Commerce would remain at $187 million. Tags:", "external_links": [], "published": "2015-08-12T02:05:00.000+03:00", "crawled": "2015-08-12T05:40:24.120+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}