{"organizations": [], "uuid": "35187c5674e4eb0de57742c66658a3331dc42fb4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/trumphewitt.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/254454-trump-on-national-security-i-dont-want-to-broadcast-my-intentions", "country": "US", "title": "Trump on national security: 'I don’t want to broadcast my intentions' like Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trump on national security: 'I don’t want to broadcast my intentions' like Obama", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-22T02:12:00.000+03:00", "replies_count": 0, "uuid": "35187c5674e4eb0de57742c66658a3331dc42fb4"}, "author": "Neetzan Zimmerman", "url": "http://thehill.com/blogs/blog-briefing-room/254454-trump-on-national-security-i-dont-want-to-broadcast-my-intentions", "ord_in_thread": 0, "title": "Trump on national security: 'I don’t want to broadcast my intentions' like Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 21, 2015, 07:12 pm Trump on national security: 'I don’t want to broadcast my intentions' like Obama By Neetzan Zimmerman \nDonald Trump made his triumphant return to The Hugh Hewitt Show Monday afternoon following a low-grade feud with the program’s host over foreign policy questions the Republican presidential front-runner labeled “ gotchas .” \nHewitt, a co-moderator of the second Republican debate, mostly avoided rehashing the incident that led Trump to refer to him as a “ third-rate radio announcer ,” but did acknowledge that the two had resolved their “little disagreement” off the air. \nThe conversation Monday quickly turned once more to the contentious topic of foreign affairs. \nAfter promising “no gotchas, no tricks,” Hewitt asked the real-estate mogul what he would do if nuclear Pakistan, which he called “the most dangerous country in the world other than Iran,” became “unstable” during a President Trump's tenture. \n“You have to get India involved. India’s the check to Pakistan,” Trump said, before noting that North Korea was a far more immediate threat than Pakistan, because it was already “a rogue group with nukes.” \n\"I said [during the second GOP debate] we’re talking so much about Iran, and they don’t have nukes at this moment,” Trump continued. \"You have a madman over in North Korea who actually has nukes and he says he’s going to use them.” \nPressed by Hewitt on if he would send American troops in to neutralize Pakistan’s nuclear capability should they go rogue, Trump said he didn’t want to reveal his military plans to a potential rival. \n“People can’t know exactly what your intentions are,” Trump told Hewitt. “You want to have a certain amount of, you want to have a little bit of guess work for the enemy.” \n\"This has nothing to do with lack of knowledge, because I think I know as much about Pakistan as most other people,” Trump insisted. \"But I will tell you, I don’t want to broadcast my intentions.” \n\"I want to be unpredictable with this,” he continued. \"I don’t want to be like Obama, where he’s always saying you know, we’re going to do, in two weeks, we’re going to do this, and then we’re going to do that.” \n\"It makes perfect sense,” Hewitt concurred. \"It’s Nixonian.\" Tags:", "external_links": [], "published": "2015-09-22T02:12:00.000+03:00", "crawled": "2015-09-22T02:52:54.911+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}