{"organizations": [], "uuid": "d632b5bb7eeb4184eea4c43b7d516bc895b8cc1c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3484758/images/o-IMF-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/blog.xml", "section_title": "Business Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/peter-doyle/the-world-needs-a-new-imf_b_8221788.html", "country": "US", "title": "The World Needs a New IMF Head, Obama Should Act Now | Peter Doyle", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The World Needs a New IMF Head, Obama Should Act Now | Peter Doyle", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-30T20:40:00.000+03:00", "replies_count": 0, "uuid": "d632b5bb7eeb4184eea4c43b7d516bc895b8cc1c"}, "author": "Peter Doyle", "url": "http://www.huffingtonpost.com/peter-doyle/the-world-needs-a-new-imf_b_8221788.html", "ord_in_thread": 0, "title": "The World Needs a New IMF Head, Obama Should Act Now | Peter Doyle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As the IMF readies itself for its Annual Meetings in Lima next week, perhaps the key issue in its governance--the end of Mme. Lagarde's term as Managing Director in mid-2016--remains largely off the radar screen. It deserves prominence now.\nThose, like myself, who strongly support the role of the IMF in the world economy, want to see that role being much more effectively played than it has been. If you doubt the urgency of that, note that the IMF has failed to anticipate any of the recent major global crises--the Western financial crisis, the Euro crisis, and now the unfolding China-cum-Emerging Market crisis--a score of zero out of three. A key source of these failures is the process of appointing the IMF Managing Director.\nIn this light, the issue is not about the post having been the exclusive prerogative of Europeans--outrageous though that is for such a key global organization. The issue is that the current selection process for IMF Managing Director fails on the most obvious metric: to choose the best candidate for the job.\nThe longstanding \"informal deal\" between European and US IMF shareholders that only Europeans are appointed excludes the overwhelming portion of humanity, including Americans, from being properly considered. This not only compromises the credibility of the institution, but has led to the appointment of some all-too-evidently unsuitable candidates since M. Camdessus, the last great IMF MD.\nWere such appointment arrangements to be applied by a troubled South Asian or African public institution for their chief executives, they would be given the appropriate epithet by the IMF itself: corrupt. And they have all the associated consequences at the IMF--compromised effectiveness and legitimacy--including during M. Lagarde's term. Her gender and charm cannot mask the manifest shortcomings and consequences of the process which put her there.\nIt is not hard to do much better. Whether or not Mme. Lagarde offers herself for re-appointment, the selection criteria to fill the post from next year should comprise three elements:\n(i) Proven professional mastery of applied international macroeconomics. The IMF is perpetually required to adjudicate macroeconomic issues of a highly technically-contentious nature on which there are typically strong voices on all sides amongst IMF staff. Further, occasionally staff are overwhelmingly on the wrong side of the issues e.g., ahead of the global financial, Euro, and Chinese crises when the core staff view was that all was basically well with the world economy. So the Managing Director must be capable of assessing the technical merits of proposals her- or himself, even in the face of technical consensus on the staff and political consensus on the Board. This is a key \"check and balance\" for the global economy.\n(ii) Even if candidates have proven mastery of applied international macroeconomics, politicians should be excluded. Given the core role of the IMF in adjudicating between the competing economic interests of member States, it should not only actually be neutral between all States but it should be seen to be so. The systematic appointment of politicians since M. Camdessus has raised fundamental questions on this front, compounding long-standing concerns that the IMF unduly and merely acts as agent for its particular major shareholders. Automatic disqualification of politicians would underscore commitment to the technical neutrality of the IMF over the many political interests seeking sway there.\n(iii) Candidates must have proven leadership skills. Once appointed, they have to chart paths through intense technical and political disputes, keep a large, querulous, and diverse bureaucracy functioning, identify priorities for the institution and for the world economy, liaise with other international bodies, and persuade world leaders to back IMF proposals on all these matters. This adds up to an extremely demanding brief, requiring not only proven leadership skills but undistracted focus on the job.\nWhile these three requirements should be permanently embedded in the selection criteria, for the immediate future, a strong case may also be made that the candidate should not be a European now. This has nothing to do with the European monopoly of the post to date. While outstanding IMF lending is overwhelmingly to Europe, European candidacies for MD, even if professionally sound, give rise to very apparent if not very real conflicts of interest. Financial regulators, including at IMF urging, bar commercial creditors from lending to their own board members out of \"connected lending\" conflict-of-interest-concerns. Similarly, the IMF should not be led by someone from the region of the world which is the primary debtor to the IMF.\nHow practically might all this be done? It is straightforward. First, apply the criteria outlined. Second, do so perhaps by means of a \"pre-selection\" panel review and interview process through with all candidates must pass. Thus, following open advertisement of the post, a panel of eminent international applied economists--comprising perhaps Stan Fischer, Carmen Reinhart, Ragu Rajan, Martin Wolf, Hyun Song Shin, Anne Krueger, Joseph Stiglitz, Ricardo Hausmann, and Ngozi Okonjo-Iweala--could produce a shortlist of three, which meet the criteria, from which the IMF Board of Governors could select.\nToo much to ask for? Well, bear in mind that following the eruption of the global financial and Euro Area crises, and more recently, with difficulties in China and emerging markets, the world economy will continue to face severe challenges. A strong IMF will be central to addressing these problems. For that, it must have effective and legitimate leadership. This proposed reset for the selection criteria and process for the selection of its Managing Director will do much to ensure that. Similar arrangements should be instituted alongside for the World Bank. The IMF's Board of Governors, led ultimately by President Obama, should determine in Lima to do this for the IMF and the world economy with immediate effect.\nEmail: p.t.d.y@outlook.com\nFollow Peter Doyle on Twitter: www.twitter.com/retepelyod\nMore: IMF Barack Obama Global Crisis Lagarde Lima", "external_links": ["http://www.twitter.com/retepelyod"], "published": "2015-09-30T20:40:00.000+03:00", "crawled": "2015-09-30T20:40:46.628+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}