{"organizations": [], "uuid": "f0f40f109d3e49d37ff0235b642920320115aa86", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/keystone1.jpg", "site_section": "http://thehill.com/blogs/e2-wire?format=feed&type=rss", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/250701-keystone-builder-planning-for-obamas-rejection", "country": "US", "title": "Keystone builder making plans for Obama rejection", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Keystone builder making plans for Obama rejection", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-10T16:30:00.000+03:00", "replies_count": 0, "uuid": "f0f40f109d3e49d37ff0235b642920320115aa86"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/250701-keystone-builder-planning-for-obamas-rejection", "ord_in_thread": 0, "title": "Keystone builder making plans for Obama rejection", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Keystone builder quietly making plans for Obama rejection Getty Images By Timothy Cama - 08/10/15 09:30 AM EDT \nThe company hoping to build the Keystone XL pipeline is quietly planning for President Obama to deny the permit it needs. \nTransCanada Corp. has been publicly bullish about the Canada-to-Texas oil pipeline’s chances, but internally is expecting a rejection and plotting its next steps, the Canadian Press reported , citing people close to the project ADVERTISEMENT Based on signals sent both privately and publicly from the White House, TransCanada officials are all but certain it won’t get the presidential permit.\n“There’s a broad acceptance that the decision’s been made,” a person close to the project told the Canadian Press, saying that multiple administration employees have indicated that it will be rejected. \n“The rumour is that the decision to deny has been made, and they’re just waiting for the right time and venue,” he said. \nTransCanada would probably wait a while after the decision to announce its next steps. \nOne of the top strategies TransCanada is considering is to sue the United States through the North American Free Trade Agreement (NAFTA), the Canadian Press said. It is likely to use provisions that protect companies from discrimination, unfair or arbitrary treatment and expropriation. \nBut any challenge would be a longshot, since the United States has never lost a case in NAFTA arbitration. \nThe White House has been mum on how Obama will rule on the pipeline’s permit to cross the border. But Sen. John Hoeven (R-N.D.) recently said Obama will reject it in August, citing unnamed sources. Tags: Past: 1 day Trump slams Fox News, praises... “What’s better than Drudge? He’s a fantastic guy. What he’s built is... Protesters shut down Bernie... The protesters claimed affiliation with the Black Lives Matter movement. Most retweeted GOP debate tweet... The liberal lawmaker's tweet was retweeted over 20,000 times. Fury of left falls on Schumer Charles Schumer’s decision to oppose the nuclear deal with Iran has roiled... 2016 contenders criticize Trump... Jeb Bush joins Scott Walker, Lindsey Graham, Mike Huckabee and Carly... Limbaugh rips Fox News for 'war on... \"The last place I ever thought I would see it continued is Fox News,\" the... Trump: Megyn Kelly had blood... The candidate is ratcheting up his feud with the Fox News debate moderator. Can anything bring down Teflon... Strategists in both parties are scratching their heads and wondering how... Conservative event disinvites... RedState Gathering has instead invited Kelly to appear in Trump's place... Trump goes to war with Fox News Trump unleashed attacks toward Fox News anchor Megyn Kelly and pollster... Brent Budowsky: Is Trump a Clinton... OPINION | Is Trump’s run in the GOP primary designed to wreak havoc on the... Trump tries to clarify Megyn Kelly... Trump tweeted Saturday morning that “wherever” meant Kelly’s nose. State rep planned to accuse... Todd Courser reportedly aimed to plant a fake story about being caught... Boehner turns up heat on Hillary He has waged a sustained attack against the Democratic front-runner. Megyn Kelly calls out Trump the... Her questions were tough, based on facts that Donald Trump did not contest. Trump slams Rosie O'Donnell in... Megyn Kelly questioned Trump's comments calling women \"fat pigs, dogs and... Trump campaign loses top adviser But it's not clear whether Trump or advisor Roger Stone severed the... Trump starts online fundraising... “I have no doubt that the liberal media and the GOP establishment will... Trump is right on Crimea His answer, though, sent shockwaves through the bipartisan military... Trump campaign: 'Only a deviant'... The candidate is pushing back against the growing backlash over his... FBI issues alert about military... VIDEO | The alert says Middle Eastern men are approaching families in... Election model predicts Dem will... A Democrat will win the White House, but just barely, Moody’s Analytics... Elizabeth Warren's marriage... The Hill's Judy Kurtz joins Fox 5 for her weekly \"in The Know\" segment.", "external_links": [], "published": "2015-08-10T16:30:00.000+03:00", "crawled": "2015-08-10T16:54:46.537+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}