{"organizations": [], "uuid": "d756496b27e21ff6808849164ebc47266807ffb7", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/254668-senators-urge-obama-to-focus-on-chinas-trade-compliance-in-talks", "country": "US", "title": "Senators urge Obama to focus on China's trade compliance in talks", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senators urge Obama to focus on China's trade compliance in talks", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-23T21:04:00.000+03:00", "replies_count": 0, "uuid": "d756496b27e21ff6808849164ebc47266807ffb7"}, "author": "vneedham@thehill.com (Vicki Needham)", "url": "http://thehill.com/policy/finance/254668-senators-urge-obama-to-focus-on-chinas-trade-compliance-in-talks", "ord_in_thread": 0, "title": "Senators urge Obama to focus on China's trade compliance in talks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senators urge Obama to focus on China's trade compliance in talks By Vicki Needham - 09/23/15 02:04 PM EDT \nA bipartisan pair of senators urged President Obama to put Beijing's state-controlled economy and its failure to meet global trade obligations at the top of the agenda when President Xi Jinping arrives at the White House on Friday. \nSens. Sherrod Brown (D-Ohio) and Richard Burr (R-N.C.) warned that a Bilateral Investment Treaty (BIT) between the United States and China would struggle to earn congressional support \"unless the treaty acknowledges this past record of defiance and unless China adopts and maintains long-lasting, meaningful economic reforms.\" ADVERTISEMENT \"In the absence of any meaningful consequences, China’s government has repeatedly demonstrated that it will adhere to international trade law only when it is in its own interest, not because the WTO [World Trade Organization] accession agreement requires it or because the U.S. government has urged compliance,” the senators wrote in their letter to President Obama ahead of meetings with Xi.\nThe senators also want conditions in the treaty that require China to move toward a market-driven economy and away from persistent state controls, before the U.S. enters into any more agreements with Beijing. \n“China’s unwillingness to grant reciprocal market access and a continued pursuit of export-driven economic growth should not be rewarded with expanded access to the U.S. market,\" they wrote. \nChina recently submitted a second BIT offer of sectors that Beijing wants to leave off-limits to foreign investment. Although the list was cut in half to about 40, the U.S. Chamber of Commerce called the move \"incremental and not substantial progress.” SPONSORED CONTENT By Intuit \nMeaningful tax reform starts with tax simplification. Read More \nOn Tuesday night in Seattle, Xi tried to reassure business leaders that China will stay the course on financial and economic reforms that will further open the market to U.S. investment. \n\"China will not go backward in this process,\" Xi said, according to news reports. \nThe lawmakers said that China’s state ownership of industrial sectors — including steel, glass, paper, aluminum and tires — has hurt U.S. workers. \n“China’s failure to abide by market principles is worsening,” they wrote. \n“We have little confidence that an investment treaty will lead China to a newfound sense of obligation to fulfill its promises.” \nThey argued that ongoing intervention in currency exchange rates “flies in the face of repeated promises by China’s leadership at the Strategic and Economic Dialogue to increase transparency and reduce intervention in currency exchange markets.” \n“Millions of Americans have lost their jobs as a result of currency manipulation, yet China has not faced meaningful consequences and remains undeterred from intervening in exchange rates to boost exports,\" they wrote. \nXi also addressed the currency issue on Tuesday night, saying that the sharp drop in the yuan's value last month was designed to move toward a market-driven exchange rate. \nHe said that \"given the economic and financial situation at home and abroad\" there is no reason to allow the yuan to depreciate further. Tags:", "external_links": [], "published": "2015-09-23T21:04:00.000+03:00", "crawled": "2015-09-24T08:09:23.620+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}