{"organizations": [], "uuid": "b8fe12f5c0d45ed1553ddde6a344bea354ecde11", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_090115getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/blogs/blog-briefing-room/news/253721-obama-us-will-take-our-share-of-syrian-refugees", "country": "US", "title": "Obama: US will take 'our share' of Syrian refugees", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: US will take 'our share' of Syrian refugees", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-15T23:17:00.000+03:00", "replies_count": 0, "uuid": "b8fe12f5c0d45ed1553ddde6a344bea354ecde11"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/253721-obama-us-will-take-our-share-of-syrian-refugees", "ord_in_thread": 0, "title": "Obama: US will take 'our share' of Syrian refugees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Past: 1 day Sanders goes on the attack against... The Vermont socialist links Ciinton to negative remarks by a super-PAC. Colbert presses Justice Breyer to... Breyer said oral arguments make up only about 5 percent of the decision... GOP lawmaker urges McConnell to... Some House Republicans want McConnell to invoke the \"nuclear option.\" LIVE: Trump delivers national... The event takes place the evening before the second GOP debate. Obama hits 'coddled' liberal... Obama said students don't have to be \"protected from different points of... New Planned Parenthood video... The videos have spurred calls to cut off Planned Parenthood funding. Dems block Iran bill for second... Sen. John Cornyn said that additional votes on Iran this week are \"still... Rubio talks football ... and... The GOP presidential candidate said Peyton Manning could be a good... Trump locks up Gary Busey... The eccentric actor starred alongside the candidate in two seasons of \"... Carson gains on Trump in new... Carson saw a 17-point jump in CBS News/New York Times poll. Sanders speaks to Christian... “It is easy to go out and talk to people who agree with you,” says Sanders. Is Trump the beginning of the end... Trump is a notorious flip flopper with no clear beliefs, except in himself. McConnell threatens to bring... The GOP leader is warning Democrats not to block a resolution disapproving... Corker: Senate could override veto... The Tennessee Republican says an extension of a sanctions law would have... Dick Morris: Is Biden inevitable? OPINION | The vice president may have to run in 2016 — ready or not. McConnell sets up tough vote for... He wants to block lifting sanctions until Iran recognizes Israel and... Oversight subpoenas unedited... House lawmakers want to see all the footage in the Center for Medical... Carson wins Maryland GOP's straw... Donald Trump came in second in the polling. Trainwreck: Obama’s foreign policy... This Libya fiasco is not an isolated example of Obama’s foreign policy mis... Carson, Trump ready for battle of... Donald Trump and Ben Carson are poised to take center stage. CBO: Nixing ObamaCare mandate... The updated figures are good news for congressional Republicans.", "external_links": [], "published": "2015-09-15T23:17:00.000+03:00", "crawled": "2015-09-16T04:11:18.348+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}