{"organizations": [], "uuid": "ba22764c58dad20d7815f77f6c7b75451f0c1ab2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/presidentobama_080515getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/251635-obama-writes-to-dems-urging-support-for-iran-deal", "country": "US", "title": "Obama writes to Dems, urging support for Iran deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama writes to Dems, urging support for Iran deal", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-21T15:17:00.000+03:00", "replies_count": 0, "uuid": "ba22764c58dad20d7815f77f6c7b75451f0c1ab2"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/251635-obama-writes-to-dems-urging-support-for-iran-deal", "ord_in_thread": 0, "title": "Obama writes to Dems, urging support for Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama writes to Dems, urging support for Iran deal Getty Images By Jordan Fabian - 08/21/15 08:17 AM EDT \nPresident Obama is seeking to convince undecided Democrats the U.S. will keep economic and military pressure on Iran if the nuclear deal takes effect. \nIn an Aug. 19 letter addressed to Rep. Jerry Nadler (D-N.Y.), but also aimed at other Democrats with concerns about the deal, Obama claimed the U.S. will not hesitate to use military force if Iran rushes toward a nuclear bomb. ADVERTISEMENT “Should Iran seek to dash toward a nuclear weapon, all of the options available to the United States — including the military option — will remain available through the life of the deal and beyond,” Obama wrote in the letter obtained by The New York Times. \nThe president laid out a number of other steps the U.S. will take, including enhancing security cooperation with Israel and Gulf allies and maintaining sanctions related to Iran's support for terrorist groups and human-rights violations. \nObama pledged the State Department will set up a separate office to implement the nuclear deal. \nThe letter comes as Obama is quietly lobbying Democrats to support the Iran deal ahead of a key congressional vote next month by placing phone calls to undecided lawmakers during his vacation in Martha's Vineyard, Mass. \nLawmakers will vote next month on a resolution of disapproval on the agreement, which curbs Tehran's nuclear program in exchange for sanctions relief. \nObama has gained momentum in recent days. The Times on Friday reported that Nadler, who represents a heavily Jewish district, will come out in support of the accord. \nNadler and other Jewish lawmakers have come under pressure from advocacy groups on both sides during the August recess. Opponents argue the deal puts Israel's security at risk and does not permanently shut off Iran's path to a bomb. \nSen. Chuck Schumer (D), another influential New York lawmaker, came out against the agreement earlier this month.", "external_links": [], "published": "2015-08-21T15:17:00.000+03:00", "crawled": "2015-08-21T15:26:47.650+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}