{"organizations": [], "uuid": "312c90a739bb970b000a268ee109488fba1c6d09", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2688996/images/o-GREENHOUSE-EFFECT-GAS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/david-ropeik/the-obama-clean-energy-pl_b_7941242.html", "country": "US", "title": "The Obama Clean Energy Plan Moves Us Past the False Debate Over Climate Change | David Ropeik", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 5, "title_full": "The Obama Clean Energy Plan Moves Us Past the False Debate Over Climate Change | David Ropeik", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-05T20:30:00.000+03:00", "replies_count": 5, "uuid": "aef3491568596f3d903115e1762ca68daf13895a"}, "author": "David Ropeik", "url": "http://www.huffingtonpost.com/david-ropeik/the-obama-clean-energy-pl_b_7941242.html#post-0", "ord_in_thread": 0, "title": "The Obama Clean Energy Plan Moves Us Past the False Debate Over Climate Change | David Ropeik", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There is a lot of opining about the Obama Administration's plan to reduce greenhouse gas emissions from power plants. Most of these comments deal with the details; what does the plan do and how, does it do enough (the reviews are decidedly mixed), and why does it prefer some forms of clean power -- solar and wind -- but not others -- nuclear or CCS (a political sop to lefty environmentalists who helped write the plan).\nBut those narrow perspectives overlook something truly seminal about this important effort to deal with climate change; the fact that such a significant step is being taken in the first place. The EPA intervention to significantly reshape how America makes its electricity sends a loud clear message that the argument about whether anthropogenic climate change is real, is essentially over. May that faux \"debate,\" driven by ideology and fueled and funded by greed, rest in in peace.\nFor years one of the general laments about the threat of climate change has been that people don't feel all that threatened. Survey after survey puts climate change at or near the bottom of the issues people say they care about . Without more widespread and passionate concern, it was feared, there wouldn't be enough political pressure to push democratic governments to do the big things necessary to deal with the problem.\nAll manner of voices from the climate change community, from scientists and academics to economists and environmental activists, worked hard to raise public concern. Pundits and thought leaders lamented the irrationally blasé public. News organizations editorialized. (One, The Guardian , abandoned any pretense of neutrality and openly adopted an advocacy position to raise public concern about the problem.)\nA number of people, myself included, proposed more effective risk and science communication about climate change , and researchers including Elke Webber, Anthony Lieserowitz, Ed Maibach, Dan Kahan and others worked on improving those approaches.\nNow that entire discussion can essentially be put behind us. The EPA/Obama plan to reduce CO2 emissions from energy generation has moved the goal posts. The argument now, in the courts, in the policy arenas, and certainly in the financial world, will be more about how we act to moderate the risk, not whether we should.\nThe plan also shifts the political contest over the issue. As it becomes more apparent that climate change is having serious impacts now, not just threatening future generations, actions like this seem like prudence, a prudence people apparently expect from their leaders. Even though only about half of Americans think the climate is changing and that humans are the cause, an opinion survey by the Washington Post last spring found\nWhen it comes to 2016, a full 58 percent of registered voters say that they favor a candidate who will take action to fight climate change -- and 38 of all voters think that position is very or extremely important.\nAnd the Obama plan specifically targets emissions from coal plants, which will cut not only CO2 emissions but particulate pollution, which sickens and kills tens of thousands of Americans each year. (Notice that President Obama mentions rising asthma rates in his video encouraging support of the plan.) Curbing coal emissions is plenty popular with a public that wants clean breathable air.\n(Chart courtesy The Yale Center of Climate Change Communication)\nSo the Obama/EPA plan is going to make it much harder for Republican presidential candidates to maintain their climate denialism/skepticism, at least once we get past the ideologically extremist primaries and into the general election.\nThe tribal fight over climate change isn't finished. The ideology-driven skeptics and deniers will continue to argue that the whole idea of anthropogenic climate change is a hoax, maintaining their views to demonstrate loyalty to their tribe, which enhances their sense of belonging and safety. (We all do the same thing on a wide range of issues. See www.culturalcognition.net ) They will try to block government action, since it's government intervention and regulation, not the climate science itself, that really bothers them.\nBut that battle doesn't matter as much anymore. The political and policy debate is moving on. Thankfully, President Obama, no longer facing re-election, has not waited for the safety of firm and widespread political support before acting. Call it wise leadership. Call it the self-interest of a President thinking about his legacy. Whatever the motivation, the Obama/EPA plan shifts the heart of the climate change argument from unreasonable denial of overwhelming science to a more reasonable debate about how we ought to respond.\nThis is precisely the kind of wise leadership that more and more heads of state, and heads of big companies, are demonstrating in response not only to climate change but to all the major challenges we face as a rising global population puts ever increasing and ultimately unsustainable demands on the physical biosphere on which we depend. As I've written, it's the foresight and leadership we need, because the major long-term/in-the-future global threats that fall under the umbrella of sustainability just don't ring our alarm bells at the personal level. The risk perception literature suggests that a public mass movement for action on climate change just won't happen, at least not in time.\nSo whatever one thinks of the details, the US plan to reduce CO2 emissions from power plants is encouraging news. And encouraging beyond the issue of climate change alone. It suggests that our leaders can lead, and not just follow public opinion. It offers evidence that our leaders can rise above the emotional and instinctive way we generally respond to risk and apply reason too. Against the immense threats our modern industrial/technological way of life poses to the future of an increasingly crowded planet, this plan offers at least a glimmer of hope that we might just be smart enough to turn the massive ship of our unsustainable path, which right now is clearly headed for the rocks, toward a safer, healthier, more sustainable course.\nFollow David Ropeik on Twitter: www.twitter.com/dropeik\nMore: Climate Change Obama Energy Plan c02 Greenhouse Gas Emissions Sustainability Power Plants Nuclear Power Green Energy This Blogger's Books and Other Items from... How Risky Is It, Really?: Why Our Fears Don't Always Match the Facts\nby David Ropeik", "external_links": ["http://www.twitter.com/dropeik", "http://www.washingtonpost.com/news/the-fix/wp/2015/04/03/on-climate-change-people-who-want-action-have-more-passion-and-more-numbers/", "http://ecx.images-amazon.com/images/I/513J72rl5XL._SL160_.jpg", "http://bigthink.com/risk-reason-and-reality/the-lack-of-public-concern-about-climate-change-how-much-do-we-need-to-care-how-much-people-care", "http://www.amazon.com/exec/obidos/ASIN/0071629696", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.pewresearch.org/fact-tank/2014/09/23/most-americans-believe-in-climate-change-but-give-it-low-priority/", "http://www.amazon.com/", "http://www.climatecentral.org/blogs/the-importance-of-risk-perception-for-effective-climate-change", "http://www.theguardian.com/environment/2015/mar/06/climate-change-guardian-threat-to-earth-alan-rusbridger"], "published": "2015-08-05T20:30:00.000+03:00", "crawled": "2015-08-06T01:31:28.966+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}