{"organizations": [], "uuid": "d29b9f362902e3386fe27d30d228cd8aa71fe305", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3415304/images/o-OBAMA-ALASKA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/audrey-peterman/president-obama-please-in_b_8130874.html", "country": "US", "title": "President Obama: Please Include the Environment in Your Speech to the CBC! | Audrey Peterman", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "President Obama: Please Include the Environment in Your Speech to the CBC! | Audrey Peterman", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-14T15:53:00.000+03:00", "replies_count": 0, "uuid": "d29b9f362902e3386fe27d30d228cd8aa71fe305"}, "author": "Audrey Peterman", "url": "http://www.huffingtonpost.com/audrey-peterman/president-obama-please-in_b_8130874.html", "ord_in_thread": 0, "title": "President Obama: Please Include the Environment in Your Speech to the CBC! | Audrey Peterman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When President Obama speaks at the Congressional Black Caucus (CBC) Phoenix Awards Dinner this Saturday, Sept. 19, he will address thousands of the most influential African Americans in our country. He will no doubt raise issues commonly identified as Black interests: crime and the justice system; voting rights and what's at stake in the upcoming elections. But if he also introduces the subjects of climate change and conservation of our clean air, water and parks, it could send shock waves through the Black community.\nPresident Obama and First Lady Michelle Obama are wildly popular at the 2013 Phoenix Awards Dinner. CBCF photo.\nLest you think that's hyperbole, consider that the Congressional Black Caucus has among the highest pro-environment voting record of any bloc, according to the League of Conservation Voters' Scorecard. This year, the CBC Legislative Conference has several panels focusing on energy, climate and the Great Outdoors. Yet these members of Congress seldom raise the issue of environment with their constituents back home, deferring to what they consider \"more pressing issues\" listed above.\nThe effect is that many African Americans believe they have little to do with the environment and it has little to do with them. My husband Frank and I have been told many times that \"people with more time and money will take care of that.\" It would be laughable if it weren't so dreadfully serious an oversight. African Americans are on the front lines of climate change impacts; suffer higher rates of air and water pollution than other communities; benefit little from the health and recreational assets in our national and local parks and forests; and are only minimally represented in the conservation workforce.\nJust by mentioning the environment in this setting, President Obama would instantly identify it as an issue with which Black Americans must be concerned. The message coming from the height of our nation's leadership could not be ignored. It could instigate a whole new era of interest and involvement at a pivotal time for our climate and our heritage.\nFourth graders having a wonderful time discovering their public lands, thanks to the Obama administration.\nPresident Obama has the credentials to do it. Over the past seven years, he has protected significant new national parks and monuments, including the Pullman National Monument in Illinois; the Col. Charles Young Buffalo Soldiers National Monument in Ohio; the Harriet Tubman Underground Railroad National Monument in Maryland, and the Cesar E. Chavez National Monument in California. These new parks recognize the contributions of non-white Americans and celebrate them appropriately alongside America's most cherished icons in the National Park System.\nThis month he launched \" Every Kid in a Park,\" program that provides passes for every fourth grader, allowing their entire family free access to public lands and water for an entire year.\nHe is pushing Congress to reauthorize and dedicate full funding to the Land and Water Conservation Fund, which for 50 years has used oil and gas fees to create parks and playgrounds in urban and rural communities in every county. He finalized the Clean Water Rule - extending protections to the sources of drinking water for one in three Americans - a move celebrated by mayors and grassroots organizations nationwide.\nMost important, the President has a strong record of helping the country move away from fossil fuels and address climate issues. The Clean Power Plan will boost economic opportunity and the quality of life for Americans across the country. Granting permission last month for Shell Oil to drill in the Arctic Ocean is his single incomprehensible lapse.\nTwenty years ago, when Frank and I first got involved in conservation, several white leaders bemoaned to us that \"African Americans and other minorities and poor people have too many 'survival' issues to be concerned about the environment.\" As much as the world has changed in two decades, many Black and white people still hold this view. The recent Green 2.0 Report from the University of Michigan showed an intractable \"glass ceiling\" that keeps non-white participation at an alarming 12 -15% level in the workforce of conservation organizations, public lands management agencies and the philanthropic organizations that undergird them.\nSimultaneously, huge decisions being made about our \"protected\" parks and public lands show them to be incredibly vulnerable to politics. Republican leaders with pro-environmental voting records under 20 percent are proposing to weaken air and water protections, strip the President of his authority to conserve our history and heritage, and sell off our public lands.\nOur pane l at the CBC Conference, \"Public Lands, Environment & Conservation: Peril & Opportunity for African Americans,\" Sept. 16, noon - 2 p.m., will show how the environment intersects with economic and physical wellbeing, climate, justice and culture. The President can do the same.\nI am optimistic that President Obama will take this opportunity to flag the environment as a vital issue for the African American community and usher in a new age of involvement and leadership\n.#CBCFALC15\nFollow Audrey Peterman on Twitter: www.twitter.com/Audreypete\nMore: Barack Obama Phoenix Awards Dinner 2015 Environment African Americans National Parks Forests Blacks Buffalo Soldiers Harriet Tubman Climate Change Caesar Chavez Congressional Black Caucus Conference 2015 This Blogger's Books and Other Items from... Legacy on the Land\nby Audrey Peterman, Frank Peterman Our True Nature - Finding a Zest for Life in the National Park System\nby Audrey Peterman", "external_links": ["http://diversegreen.org/", "http://www.twitter.com/Audreypete", "http://ecx.images-amazon.com/images/I/61Djsjs9kjL._SL160_.jpg", "http://ecx.images-amazon.com/images/I/51cChkiHTBL._SL160_.jpg", "http://thewestsidegazette.com/cbc-session-reveals-how-national-parks-can-uplift-black-communities/", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.amazon.com/exec/obidos/ASIN/1604146230", "http://www.amazon.com/exec/obidos/ASIN/B00IPPQGFU", "https://www.everykidinapark.gov/", "http://www.amazon.com/"], "published": "2015-09-14T15:53:00.000+03:00", "crawled": "2015-09-14T15:59:47.041+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}