{"organizations": [], "uuid": "ca391dcf9471652f7c140a6c9fb0c6ff67ada06b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamakerry_getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/250428-obama-iran-deal-could-squeak-by-in-congress", "country": "US", "title": "Obama: Iran deal could 'squeak by' in Congress", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Iran deal could 'squeak by' in Congress", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-06T19:47:00.000+03:00", "replies_count": 0, "uuid": "ca391dcf9471652f7c140a6c9fb0c6ff67ada06b"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/defense/250428-obama-iran-deal-could-squeak-by-in-congress", "ord_in_thread": 0, "title": "Obama: Iran deal could 'squeak by' in Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Iran deal could 'squeak by' in Congress Getty Images By Jordan Fabian - 08/06/15 12:47 PM EDT \nPresident Obama on Wednesday expressed confidence that the Iran nuclear deal will receive enough votes to survive in Congress. \n“I’m confident that at least a sufficient portion of Congress will support [the agreement],” Obama told a group of reporters, according to the Huffington Post. ADVERTISEMENT The president, however, acknowledged the vote would be close. \n“Everything in this Congress squeaks by,” he said, according to The New Yorker . \"If I presented a cure for cancer, getting legislation passed to move that forward would be a nail-biter.\" \nBut Obama scoffed at New Yorker reporter Robin Wright when asked for an exact vote count on the deal. \n“Come on, we're having a big geopolitical conversation,” he said. “You work for The New Yorker , you don't work for Roll Call .” \nObama met with a group of 10 journalists from The Washington Post, The New York Times and other outlets after giving a speech at American University in which he made a forceful case for congressional approval of the accord. \nThe president portrayed the vote on the agreement as the most consequential foreign policy decision for lawmakers since the Iraq War. \nObama is getting personally involved in the lobbying campaign on Iran, with both supporters and opponents of the deal aiming to sway lawmakers during their August recess. \nA resolution of disapproval against the Iran deal is expected to pass the House, but it is not clear whether it will clear the Senate. \nIf the resolution does win 60 votes and clear the Senate, the question will be whether opponents can muster two-thirds majorities in each chamber to override an Obama veto. Even though the White House is furiously lobbying Congress to back the deal, spokesman Josh Earnest sought to downplay the significance of the final vote as a referendum on the president's policies. “The fact is we don’t need Congress to approve this deal,\" Earnest said. \"We just need Congress not to screw it up.” \nDuring his speech Wednesday, Obama made a play for liberals to back the agreement, both by invoking the Iraq War and ripping GOP critics. \nHe said Iranian hard-liners who chant “death to America” are “making a common cause with the Republican Caucus,\" which almost unanimously opposes the deal. \nHe also doubled down on his claim that the only other alternative to his deal is war. \n“Let's not mince words. The choice we face is ultimately between diplomacy or some form of war,” Obama said in the speech. “Maybe not tomorrow, maybe not three months from now, but soon.” \nOpponents of the agreement say Obama is setting up a false choice. \nThe president told the journalists that strengthening sanctions or launching limited military strikes against Iran’s nuclear facilities would be ineffective in cutting off Iran’s path to a nuclear weapon and put the U.S. on a path toward war. \n“For those who suggest that my presentation isn't fair, I would simply ask them to explain the weakness in my logic,” he said. “I don't think they'll find any.” \n— This story was updated at 2:06 p.m.", "external_links": [], "published": "2015-08-06T19:47:00.000+03:00", "crawled": "2015-08-07T02:04:53.357+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}