{"organizations": [], "uuid": "027604ed49476b6366e86499118eaac927838f67", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/pat-oglesby/bungling-bundling-axing-m_b_7918092.html", "country": "US", "title": "Bungling Bundling? Taxing Marijuana in Washington State | Pat Oglesby", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "Bungling Bundling? Taxing Marijuana in Washington State | Pat Oglesby", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-04T01:30:00.000+03:00", "replies_count": 3, "uuid": "7651f267f1d0b27315aa4507bf2f1f9c5cc5bd71"}, "author": "Pat Oglesby", "url": "http://www.huffingtonpost.com/pat-oglesby/bungling-bundling-axing-m_b_7918092.html#post-0", "ord_in_thread": 0, "title": "Bungling Bundling? Taxing Marijuana in Washington State | Pat Oglesby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An old saying has it, \"A tax can be fair, or simple, but not both.\" Washington State's brand-new tax law about cannabis bundling proves the point.\nWhat's cannabis bundling? It's a tax dodge. Here's the deal . Washington has a 37-percent tax on retail sales of marijuana (cannabis). If an ounce of cannabis costs $200 before tax, tax adds $74, to make $274 total. So sellers developed a scheme: \"Free pot with purchase of pipe!\" The pot and the pipe are \"bundled\" into one price.\nSo the customer buys a pipe for $35, and gets an eighth of an ounce of pot -- \"for free.\" The pipe is tax-free. (It's not cannabis -- duh.) And the price of the pot is . . . zero. Thirty-seven percent of zero is zero. 37-percent tax avoided! Take that, tax man!\nNot so fast. Maybe that \"bundling\" maneuver never worked , but Washington just passed a new law to stop it. Here's a small part of the law , in glorious legalese:\nIf the selling price is attributable to products that are taxable [that is, to cannabis] and products that are not taxable [like a pipe] under RCW 69.50.535 [which taxes cannabis at 37%], the portion of the price attributable to the nontaxable products [pipe] are [sic] subject to the tax imposed by RCW 69.50.535 [37%] unless the seller can identify by reasonable and verifiable standards the portion that is not subject to tax [for the pipe] from its books and records that are kept in the regular course of business for other purposes including, but not limited to, nontax purposes.\nGot that? Sellers charge one bundled price, say $35, for the pipe-and-pot combo. Then they tell the tax man exactly how much of that $35 was for the pipe. So the rest was supposedly for taxable pot. That is, sellers report, for every bundled selling price, how much is tax-free and how much is taxable.\nHere's where we get to \"simple or fair.\" Splitting the cost like that is totally fair. If the pipe is worth $10, what's left -- $25 -- is taxable. Each and every transaction involves splitting the price into two parts -- the tax-free part and the taxable part. Then each and every transaction can be audited by the government.\nSo what's the real value of the pipe in that $35 sale? What if it's hand made, by the seller's daughter? She could be a true artist, and the pipe could be a masterpiece, worth plenty. The seller actually paid her $30, and says the pot was worth only $5. Who knows the value? Wanna litigate?\nWhew. Every price is a potential legal dispute. So if you want to create jobs, taxing by price will help. Jobs for cost accountants and lawyers, anyway.\nThat's how fairness -- getting the exactly right answer, case by case, pipe by pipe, can be the enemy of simplicity.\nThere are three simpler ways to solve the bundling problem.\n1. Don't let cannabis sellers sell anything but taxable pot -- no pipes, no nothing. But that's a very restrictive model, one that doesn't fit the industry on the ground.\n2. Just take a percentage of the total bundled sale price. Any bundled sale including cannabis gets taxed at the cannabis rate. That's what Washington already does with cannabis cookies -- taxing them at the 37-percent rate, ignoring the value of the flour and sugar. So if the pipe costs $35, and the pot is supposedly \"free,\" you collect 37 percent of $35. To be fair, the pipe really is worth something. You're taxing the pipe like pot. Unfair! But simple. Fair or simple -- you can choose.\nBut look at what will actually happen if you tax bundling that way. Sellers won't bundle pot with pipes -- or with anything. Bundling will be a tax trap, and taxpayers will avoid it. \"Whoa,\" you may say. \"That distorts the market against bundling.\" True, but the usual reason for bundling is to dodge taxes. Sure, there may be a legitimate reason instead. Theoretically, at least. Stopping bundling may be a teeny bit unfair. But simple.\n3. Don't use any percentage of price -- wholesale, retail, whatever -- to tax cannabis. Tax it by weight, or THC content (if you can measure that). That way, you don't care what price anyone pays for it -- or if it's given away. Measure the pot, not the price.\nTaxing by weight or THC avoids a much bigger problem: Cannabis prices will probably collapse . When they do, taxes based on percentage will collapse, too. If the price falls from $200 to $100, a 37-percent tax will fall from $74 to $37. Government revenue will shrink, but more importantly, cheaper pot tends to encourage use by youth and abusers. There are lots of reasons you might want to legalize, but lower prices aren't at the top of the list.\nBack to measurement: Prices can be slippery. They often depend on relationships. Allen Toussaint sings, \"If he's rich treat him nice/Give him the cut price. Then overcharge the poor/Some more.\" And ask my friends the fabled tax wizards at GE and other corporations. They've used \"Transfer pricing\" shenanigans to help shift $2 trillion (that's $2 with 12 zeroes behind it) to low-tax countries. Talk about relationships -- they shifted the money to wholly-owned off-shore subsidiaries. From one hand to the other.\nAnd say Willie Nelson walks into your cannabis store. Or one of the Marleys. Or Jimmy Buffett, if he's still at it. You let 'em have your product for nothing. Zero. You're thankful they're in your store. You take a few pictures, and display your gratitude with a gift of cannabis. The price is zero, but Washington tax law says you pay tax on the \" true value \" of that gift. But the value of cannabis varies tremendously by strain. Your special strain for your special guest may be unique, with no reference price. To measure \"true value,\" the law says add up your costs. You're back into the accounting soup, with allocations of overhead and more tax calculations to achieve \"fairness.\" The same problem turns up if you make a gift to a good customer, or to a valued employee -- or to yourself.\nIf you made it this far, you've got the picture. Fair or simple. Washington chose fair. Sorry, but you can't have both.\nFollow Pat Oglesby on Twitter: www.twitter.com/OglesbyPat\nMore: Marijuana Marijuana Taxes Business Politics", "external_links": ["http://mjnewsnetwork.com/business/washington-cpa-update-on-25-marijuana-excise-tax/", "http://marijuanalegalization.about.com/od/RelatedIssues/fl/Cannabis-Pros-and-Cons-If-By-Whiskey-Style.htm", "http://www.nytimes.com/2013/05/29/business/the-trouble-with-taxing-corporations.html", "http://www.rand.org/pubs/research_reports/RR864.html", "http://lawfilesext.leg.wa.gov/biennium/2015-16/Pdf/Bills/House%20Passed%20Legislature/2136-S2.PL.pdf", "http://www.twitter.com/OglesbyPat", "https://books.google.com/books?id=HR9BD_iX0TUC&pg=PA24&lpg=PA24&dq=tax+fair+simple+%22not+both%22&source=bl&ots=Ff7XwaIM4i&sig=LdapXO5sQexYtwTd12bCFSQHz9A&hl=fr&sa=X&ved=0CCoQ6AEwA2oVChMI5Mv97K6FxwIVhZ2ACh210AY2#v=onepage&q=tax%20fair%20simple%20%22not%20both%22&f=false"], "published": "2015-08-04T01:30:00.000+03:00", "crawled": "2015-08-04T10:19:26.666+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}