{"organizations": [], "uuid": "db2e9882a07da9e39604608c9f1d421956637ba6", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/072815_tf_perry.jpg", "site_section": "http://www.foxnews.com/search-results/urss?q=a%20trillion%20dollars", "section_title": "RSS for climate change march", "url": "http://www.foxnews.com/transcript/2015/07/28/gov-rick-perry-on-immigration-reform-securing-border-is-priority/", "country": "", "title": "Gov. Rick Perry on immigration reform: Securing the border is priority News", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Gov. Rick Perry on immigration reform: Securing the border is priority | Fox News", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "db2e9882a07da9e39604608c9f1d421956637ba6"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/07/28/gov-rick-perry-on-immigration-reform-securing-border-is-priority/", "ord_in_thread": 0, "title": "Gov. Rick Perry on immigration reform: Securing the border is priority News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published July 28, 2015 FoxNews.com Facebook 0 Twitter 0 Email Print \nThis is a rush transcript from \"The Five,\" July 28, 2015. This copy may not be in its final form and may be updated. \nERIC BOLLING, CO-HOST: Hello, everyone. I'm Eric Bolling, along with Kimberly Guilfoyle, Geraldo Rivera, Dana Perino and Greg Gutfeld. It's 5 o'clock in New York City and this is \"The Five.\"\nWell, another day and we have another special guest with us tonight. He was the longest-serving governor of Texas and he hopes to be our next president. Rick Perry is here. Welcome to \"The Five,\" Governor. I'm going to kick it off a little bit. So in 2016, immigration seems to be a hot topic. Now, you've been very, very strong advocate of a secure border. But also there are some issues about in-state tuition to illegals. Can you define your immigration policy here and now?\nRICK PERRY, REPUBLICAN PRESIDENTIAL CANDIDATE: Well, secure the border is the main issue. I mean, you can talk all around it, up and down, back and forth. And it's the federal government's responsibility. This is one of the most interesting things for me is that there are some folks out there that criticize Texas for securing the border. And the fact is we did a very good job of sending our Texas Ranger Recons, our parks and wildlife wardens that we literally had in the river, in their boats and our Texas national guard. And we saw 74 percent reduction of apprehensions.\nAnd I would consider that to be a very, very good job. But the real issue is that's not Texas's responsibility that is the federal government's responsibility to secure the border. So the next president of the United States just has the will, you put the personnel on the ground. Securing the border is not rocket science. It's just a matter of having the will at the White House to instruct it to have it done. You put the personnel on the ground, you have a strategic fencing in the metropolitan areas, and then the aviation assets, and this is really what's missing from my standpoint is the aviation assets from Tijuana to El Paso to Brownsville, 1,600 or even 1,933 miles.\nAnd look down 24/7, analyze what's going on. When you see obviously, activity that's inappropriate or suspicious, you have quick response teams that go, and at that particular point in time the border with Mexico be secured.\nBOLLING: To just follow up with the 11 or up to -- I don't know estimates as high as 30 million.\nPERRY: Yeah.\nBOLLING: 11 to 30 million illegals, what do you do with them?\nPERRY: Yeah.\nBOLLING: That is here.\nPERRY: Listen. There are a lot of smart people out there that will figure that out. That I'll be more than happy to sit down and come up with the ways to deal with them. But until you get the border secure, I think you're wasting your time to have that conversation.\nDANA PERINO, CO-HOST: Could I follow up on one part on the sanctuary cities because as governor, you kind of had to deal with that, I think a little bit.\nPERRY: I kind of.\nPERINO: You did have to deal with it in Austin. But so as president, how might you deal with that differently because that is becoming an issue that is, well, it's not just ripe for this year but.\nPERRY: Yeah.\nPERINO: They're proliferating.\nPERRY: I think sanctuary city's is a federal security issue, and the federal government needs to deal with this. This is not one of those that the tenth amendment comes in and you deal with by this state by state. This truly is one where, you know, a state that has sanctuary cities can deal with them, but at the federal level that needs to be dealt with as well. And I would use the purse strings to punish those cities that allow for sanctuary city activities to occur to the place that is getting federal dollars is you cut it out and say, we're not going to -- you're either going to live with the rules and the regulations and the laws of the country or you're not.\nBOLLING: Greg?\nGREG GUTFELD, CO-HOST: Yeah. Debate's coming up, Governor, they've got this setup where it's almost like the thanksgiving dinner, you got the big table, and then you got the kiddy table. You're right on the cusp of ending up on the kiddy table. Does it matter where you are as long as you have a podium?\nPERRY: Oh I'd -- you know obviously, would like to be in the 10.\nGUTFELD: Yes.\n(LAUGHTER)\nPERRY: Five times two, right?\nGUTFELD: Yeah.\nPERRY: Yeah. So it will be twice as good as The Five.\nGUTFELD: Very clever.\nPERRY: Yeah?\n(LAUGHTER)\nGUTFELD: Very clever.\nPERRY: Yeah. Yeah I did that math.\n(LAUGHTER)\nKIMBERLY GUILFOYLE, CO-HOST: This is going to change it forehand (ph).\nGUTFELD: Exactly.\nGUILFOYLE: You know at this table.\nPERRY: It will, if \"The Five\" comes on strong for me now.\n(LAUGHTER)\nPERRY: I'm at the big table.\nGUTFELD: Yeah.\nPERRY: I'm counting on you guys to -- you know kind of give me the bump I need to get there. I think when you really look at this, the -- hopefully, the American people are going to look at the most qualified individual to run this country. And this is going to be an election. I say, it's a show me, don't tell me election. There are some great quality candidates out there running for the presidency of the United States on the republican side, some men and women who have some pretty impressive resumes.\nBut, when you look at the full scope of things, when you look at your life's experiences where you grew up, having worn the uniform of the country, having been the chief executive of the 12th largest economy in the world for the last 14 years, isn't that what you want? That type of record, that type of experience of running America. I mean, we've had this experience of the last 6 1/2, almost 7 years of a young inexperienced United States senator who has with no resume' and see where we are with that. And I will suggest to you that economically and foreign policy-wise, this country is in some pretty strenuous times right now. And we need that experience of having run something really big and having the results that are unquestionably good.\nGUILFOYLE: Yeah, and you're mentioning you know, your record, very successful as governor of Texas. One of the areas that you were strongly applauded and supported in was your area of second amendment and gun rights. We've seen an administration that has been hostile towards the second amendment to gun owners. And what would your position be as president? Would you continue the same ardent support for the second amendment?\nPERRY: Well obviously, I happen to think that the, you know individuals who have been trained, background checked, should be able to carry their weapons. I'm one of those that do believe that one of the reasons that Texas has the lowest crime rate since 1968. I happen to think is because we passed Concealed Handgun License law in the state of Texas. And we heard all the arguments, Eric. We heard people saying, oh, if you do that, you're going to have shoot outs on the street and it didn't happen. I mean, what we have is a state -- now that's not all of it, part of it is criminal justice reform that we put into place, where we're sending the clear message that people are not going to lose their opportunities to succeed in life because they made a mistake.\nAnd we didn't throw them in jail and throw away the key with offenses that were drug-related and nonviolent in nature. And we've had extraordinary impact by that. It's been in place now for eight years. We shut down three prisons in the last four years and we saved $2 billion. But more importantly, there are a lot of young men and women whose lives are not destroyed. And that sent a message along with the economic policies that we'll put into place that you get to have a good job. African-American graduation rates are number one in America in Texas, as well as Hispanic. I mean, that's the story that we tell people. If you want to live free, you want to keep more of what you work for, you want to have a chance to have a real life that's unlimited in its possibilities these are the policies that work.\nAnd all of those, you live in a place that's safe and secure, you get to keep more of what you work for. I mean isn't that what we want for America? I mean, and that's my message to people is that the best years of America are in front of us. I believe that with all my heart, we just have a few good policies and a leadership change at the top, from the best years America ever had.\nBOLLING: All right, Geraldo?\nGERALDO RIVERA, CO-HOST: You're such a good man. And you have such an excellent record. And yet, in some ways, you are defined by that one plug where you couldn't name the various agencies in the federal government, those that you wanted to abolish. Is that unfair?\nPERRY: I don't think so at all. I mean, but this country is about second chances. Whether it's a young person who's made a mistake in their life and what we've done -- America has always been about second chances. But you know, whether it's fair or not, it is what it is. I hope people will take a look at the record. Take a look at these individuals on that stage. And again, there is some great talent there. But who is it that can really put this country back on track? Who is it that's done it?\nGUILFOYLE: Right.\nPERRY: I mean, I think that's the real challenge for us as Americans. You know, I'm not interested in being entertained. I'm interested in being led.\nGUILFOYLE: Right.\nPERRY: I'm interested in somebody that's got a record of creating jobs, of securing our border, of standing up and laying out cogent concepts about how America needs to be dealing with our allies. And for that matter our adversaries. And we don't have that today.\nBOLLING: Can I follow up on what you're saying right there? Our adversary - - ISIS in the news all the time beheadings, drowning people. Would you, as commander in chief send American troops to Syria, to Iraq, to fight ISIS?\nPERRY: Well here's what I would do. I would have a coalition that I would put together with obviously, the Gulf States, whether it's the Saudis, the Jordanians, the Kuwaitis, the Turks, the Egyptians, the Israelis and United States forces, a coalition together. We know that we're not going to be able to defeat ISIS by a few air strikes. You're going to have to have boots on the ground. I'll suggest to you that the Jordanians and Saudis and the Israelis. I think there is this great opportunity to bring some forces that has historically been, not necessarily all on the same team in the Middle East to defeat ISIS. They know that this is a cancer on the Middle East with the right type of human intelligence, the right type of special ops, with boots on the ground, and it's going to requires some American boots on the ground. But using those assets that we have, and we can defeat ISIS there.\nBOLLING: Bring it around, Dana?\nPERINO: I want -- if I could switch to a speech you gave a couple months ago on African-Americans and race and about the success you want to see for all Americans. So it was a well-received speech by some quarters, didn't get a ton of attention. I was curious if you could expand on it a little bit because you're not the only candidate to go down that road, but it was certainly significant. And I wonder what kind of feedback you've received from those audiences.\nPERRY: Yeah, well the feedbacks have been good. It's been good from both my friends in the African-American community, who know me and who have watched me as I was the governor of Texas for those 14 years. You know Wallace Jefferson was the first African-American on the Texas Supreme Court in the history of our state. And this is the state that's had a historic democrat background back through the years. And no one seemed to be able to find an African-American to go on that Supreme Court, but I did. And not only was he the first African-American to serve on that court. Two years later, I made him the chief justice. This is an individual whose great grandfather, two times removed. Great-great grandfather was sold on the steps of the McLennan County Courthouse in the 1850s, Geraldo.\nI mean this is an extraordinary story and as a piece of property. Yet, here in the early part of the 21st century, this young man is walking up the most powerful courthouse steps in Texas as the chief justice. That is an extraordinary story about what can happen. Now, in that speech I talked about the rank racism and the brutal murder of a young man in Waco, back after the turn of the 20th century. And I mean an incredibly ugly story. And we have to face up to that as a people. And we have to understand that you know Barry Goldwater in 1964 was against the Civil Rights Act. And our party got painted and you know, rightfully as being against civil rights.\nAnd we have to stand up and say, you know, we were wrong, but here's what we've done. And my state's a great example of it when we talk about African-Americans having the highest high school graduation rates in America. Hispanics have the highest high school graduation rates in America. I mean, this is an extraordinary story about how a state has addressed the issue of racial inequality and made it. I will suggest to you one of the most equal states in the nation. And we need to be talking about that and reaching into those communities and asking them to take a look at our policies today. The freedom that we give you to keep more of what you work for. The freedom to live in a place where your children can graduate from high school, it's the most powerful thing we can give them.\nBOLLING: Are we -- we are going to come up against heartbreak in a minute. But Greg, you get one in here?\nGUTFELD: Yeah. I just -- but both of my parents were democrats who then voted for Reagan because Reagan was able to sell conservative.\nPERRY: So were mine.\nGUTFELD: Yeah. But he was able to sell conservatism to people that had never really thought about it before. Is that possible now, to actually reach out and bring new people into the fold without seeming like you're selling out, you know what I mean?\nPERRY: No, I think it's very possible. As a matter of fact, I don't think the Republican Party has a future, unless we're able to sell conservatism as good for everybody.\nGUTFELD: Yeah.\nPERRY: And that's our story. And I think that's the one that we need to do a really good job of sharing with them economically. You know, we got 50 years of democrat policies and it hasn't turned out very well, if you're a minority in the inner cities. Let's look at what's happening in places like the state of Texas where we've been able to free people where they get to keep more of what they work for, regulations that allow for a cost of living that they can afford. You know those are powerful things that there are some places across this country you can point to and say you know what? You get to keep more of what you work for. The cost of living's is going to be down because of regulations. And you know, by the way, your child's going to graduate from high school and they can do anything they want, going to college or be ready for the workforce. I mean, it's a powerful, positive story.\nBOLLING: Governor, stay right there because we have much more with Governor Rick Perry, when The Five returns.\n(COMMERCIAL BREAK)\nPERINO: All right. We're back with Governor Rick Perry, who's making a second bid for the White House after an attempt in 2012. And K.G., we didn't get to you a second time in the first round.\nGUILFOYLE: Yeah.\nPERINO: You go first.\nGUILFOYLE: I just wanted to follow up a little bit on your strong record with jobs, with the economy, with promoting small businesses, sensible regulations where need, not excessive that you know, punish and penalize businesses. Because I remember a few years back, someone that I used to be married to, that is now lieutenant governor of California.\nPERRY: Gavin some of these (ph).\nGUILFOYLE: Yeah, its Gavin Newsom did and he was a very big supporter of yours and what you had done for the economy in Texas. He said that he thought you were somebody that we could learn a lot from in the country about what to do better and he went to Texas to study that.\nPERRY: Yeah. Like Gavin did, he brought a contingent from California and we just kind of laid it out. And it's really -- this isn't rocket science. I mean, it's seriously is about tax policy that leaves more money in the hands of the private sector. It's about a regulatory climate that's fair and predictable. Predictable regulations are so important to legal system that doesn't allow for over suing, we passed the most sweeping tort reform in the nations and then public school policies. I tell people that's there are accountable public school policies that create a skilled workforce. That's it. Those are the four things. If you get that right and then the private sector will -- they will grow.\nYou'll have -- people will risk their capital. They know that they can take a chance and have an opportunity to have a return on their investment. And that's really all it is. If you will put that into place, your state will grow and I'm a big tenth amendment believer. I -- the federal government tries to do this one size fits all. I mean, it's one of the reasons I'm against Common Core is I don't believe that the federal government can come up with curriculum for the 50 diverse states out there. We need to compete against each other. You know, Louis Brandeis said that the states were the laboratories of democracy, and that the states should go out and come up with experiments. \"They should come up with novel ideas. They should compete against each other. From time to time, a state will make a mistake,\" he said. I think about Colorado and.\nBOLLING: Marijuana?\nPERRY: Their experimentation.\nRIVERA: Do you think that's a mistake?\nPERRY: I do. I think they will find -- if they haven't already -- that that is a mistake for them. But I will fight for their right to be wrong.\nRIVERA: OK.\nPERRY: For the rest of my life. I mean, that's the beauty of these 50 states that we have now. And our founding fathers were brilliant in the tenth amendment in saying you know what, the federal government is supposed to do a few things like stand a strong military, like secure our borders. Wouldn't it be awesome if they'd just do those two areas?\n(CROSSTALK)\nBOLLING: Can we stay on that for once -- I'm sorry Geraldo, but -- so as president in the states like Colorado, Washington and the others who have legalized it, yet it's still a criminal activity. Federally, would you lift the criminal nature of marijuana?\nPERRY: I think the states.\nBOLLING: Unless the states do.\nPERRY: I think the states on that issue need to decide that. I'm a big believer.\nRIVERA: So state by state. That's fine with me.\nPERRY: Well, and listen. There are all the social issues. I mean, when you think about it, if you're going to truly respect our constitution, you must look at what our founding fathers meant. And they didn't mean for to us have health care decided in Washington, D.C. and then disperse all these 50 states. They didn't mean for us to have transportation infrastructure, other than the interstate highway system. But sending our tax dollars to Washington, D.C. for them to sit and decide, OK, you're going to build a road over there. And oh, by the way you're going to put a sidewalk over here. Making those decisions in Washington, D.C. with a limited amount of input from the states is just crazy.\nGUILFOYLE: Right.\nRIVERA: You have had the -- many of us regard it as the political persecution, but you are -- you just had some good news from an appeals court dropping one of the criminal charges against you. But you still are facing a serious misdemeanor charge of using -- threatening a veto, if they didn't fire district attorney with whom you disagreed who was caught driving under the influence. You wanted her fired. They didn't fire her. You vetoed this legislation to fund an agency. As a result, you were indicted. You're now facing this criminal charge, very serious criminal charge. How much of a distraction is it? And is it a political persecution?\nPERRY: Yeah. Well, it's not a distraction for me. I'm, you know, I've been out doing what I need to be doing for almost a year now, after that occurred. Anybody that saw the film of this district attorney, you know, blew up .24.\nGUILFOYLE: Yup.\nPERRY: I mean, almost three times.\nRIVERA: That's a party.\nPERRY: And with an open vodka bottle in the car.\nGUILFOYLE: That's a homicide waiting to go happen.\nPERRY: Again, the way that she treated the law enforcement.\nRIVERA: But you veto with the legislation.\nPERRY: Yeah, and.\nRIVERA: Using your official power to get back and.\nPERRY: And you know what? Every governor in every state has the right to veto. I mean, it's in the constitution for any reason. You don't have to have a reason to veto something. There are ways to address that if you don't like it. I can have the veto overridden. The people cannot elect you. I mean, there are a lot of ways to deal with this. But to go after this through the Travis County court system is obviously, -- I mean, when Alan Dershowitz is looking at this and saying, -- and folks on the left look at it and called it sketchy, I mean.\nRIVERA: It is. It is sketchy. So.\nPERINO: Let's get --\nRIVERA: Well, I.\nPERINO: Can we get to Greg for the last question?\nGUILFOYLE: Yeah.\nPERINO: I'm sorry.\nRIVERA: If I don't ask this question, my son will kill me. Shouldn't the Texans have drafted Johnny Manziel, Johnny football from Texas A&M, from where my son graduated and you where graduated?\nPERRY: I could argue the fact that we have been.\n(LAUGHTER)\nPERRY: We could have filled the stadium up.\nRIVERA: Really?\nPERRY: For a couple of years.\nRIVERA: A no brainer.\nPERRY: Hopefully, he will get his act together and we'll live a good and.\nRIVERA: Charlotte (ph) in Cleveland.\nPERRY: Probably lie (ph).\nPERINO: OK, Greg.\nGUTFELD: Do you still see Charlene Tilton around?\n(LAUGHTER)\nGUTFELD: Anyway, Dallas trivia.\nGUILFOYLE: Form Dallas.\nGUTFELD: OK. You're seeing kind of a civil -- you always see civil war on the right in the beginning of this week.\nPERRY: Not this week.\nGUTFELD: Yeah.\n(LAUGHTER)\nGUTFELD: But there's always like you know, people name calling. It's something that you don't see on the left. The left tends to united rather quickly behind whatever they believe in. Is this kind of conflict that you see among the right temporary? Or will it have lasting repercussions?\nPERRY: I think it's basically a temporary phase that we see going through. I mean.\nBOLLING: Is Donald Trump the reason?\nPERRY: When Donald Trump shoots a bullet through John McCain and hits veterans, I'm not going to be quiet. When he says some of the things about immigrants that I consider to be incredibly inflammable, and using that language for political sport, I'm not going to be quiet.\nRIVERA: And the thing about your glasses?\nPERRY: But.\n(LAUGHTER)\nPERRY: Well, yeah. I mean, that's.\nGUTFELD: That was the end of it. That was last straw.\nPERINO: I kind of like the glasses.\nGUILFOYLE: The glasses are fantastic.\nPERINO: I got a last question for you. It will be a quick one. Any -- what's your best debate prep trick for this time around?\nPERINO: You got one?\nPERRY: Practice.\nPERINO: Practice?\nPERRY: Yeah.\nGUTFELD: Have a third day.\nBOLLING: have a third day.\nPERINO: I just go with two. I was going to say you just go with two.\nBOLLING: Department.\nGUILFOYLE: But also.\nRIVERA: If it was the third.\nPERRY: Education, energy and commerce.\nBOLLING: Fantastic.\nGUILFOYLE: Exactly.\nPERRY: Let's get that away early, OK?\n(CROSSTALK)\nPERRY: There they are, that's it, OK?\nGUILFOYLE: But Governor, also -- Dana.\nRIVERA: I don't know what they do either.\nGUILFOYLE: She just said on this show, how -- when you came on you had your comments, you know your announcement speech. How well prepared, how strong you sounded, you're feeling better, physically, healthy, ready to go?\nPERRY: Listen. I learned a lot, you look back in our history as a party, and George W. even has an asterisk by his name from a standpoint of having done it before. I mean, he was there with his dad. So everybody's done this before that we nominated since Dwight David Eisenhower. And so, I mean, it's like anything in life. You learn from those experiences. I mean, this is a humbling experience for me. But the fact is I'm glad I did it.\nGUILFOYLE: Yeah.\nPERRY: And I.\nPERINO: And you're sure you can get up off the mat (ph), right?\nPERRY: And America is about second chances, I believe that with all my heart. And how does somebody -- I mean, when it's all blue sky and the winds behind your back? I mean, that's pretty -- anybody can do that.\n(LAUGHTER)\nPERRY: How do you perform when you've really gotten run over?\nGUILFOYLE: Right.\nPERINO: Exactly.\nPERRY: How are you going to perform? And I will suggest you know people have seen that for the last three years. Not only in.\nGUILFOYLE: Yeah.\nPERRY: Being a governor but preparing for this.\nPERINO: And we're really glad to hear you like \"The Five.\"\nGUILFOYLE: Yeah.\nPERRY: I love \"The Five.\"\n(CROSSTALK)\nPERINO: Welcome. We'll have you back. Governor, thank you for joining us.\nAhead, a third disturbing.\nPERRY: Thank you, ma'am.\nPERINO: Planned Parenthood tape is released. Greg is going to tell us why the media is terrified to cover this story. Stay tuned.\nGUTFELD: I will.\n(COMMERCIAL BREAK)\nGUTFELD: This New York magazine cover is getting lots of press, as it should, for it features dozens of Bill Cosby's rape victims. It's an image that's both brave and brutal. If this doesn't get an award I'll eat 10 copies. Shift to the latest Planned Parenthood video. Another gripping glimpse of hell on Earth told in a breezy fashion. It won't win anything.\n(BEGIN VIDEO CLIP)\n\"BUYER\": That 11.6 was pretty good. There was, like, three or four samples we could have take out of the 11.6. That would be, you know, if we were doing like 50 to 75 per specimen, then that would be like 200 or 300. We'd be comfortable with that. But stuff like this, like we don't want to do just like a flat fee of like 200 and then it's like...\n(LAUGHTER)\nDR. GINDE: No. And I think the per item thing works a little better, just because we can see how much we can get out of it.\n(END VIDEO CLIP)\nGUTFELD: Amazing. So aren't these videos doing the same exact thing as that cover for New York, forcing a population to look squarely at previously hidden victims? Yet the media -- the media scorns this expose, as Planned Parenthood now begs them to suppress the reporting.\nWhy is the Cosby story lauded but these baby videos aren't? Maybe because you can have Cosby's victims on the cover, but there are way too many unborn victims to fit -- even on a fold-out. And it's hard to sell ad space opposite the dead.\nI get it, Roe v. Wade said abortion is a women's right. But how is carving up a kid part of that right? It never was. Planned Parenthood is now saying dismemberment is her choice, too.\nHere's why the media runs from the story and not the Cosby scandal: The guilty in the Cosby case is Cosby; the guilty in the Planned Parenthood story is humanity. When magazine editors look at those gruesome pictures, they see their own souls. You see not one monster but a collaboration of evil that rains shame down on all of us. Not only does the story remind you of the ambivalence of evil, but your role in its execution. And perhaps more important, it's an evil you win no trophy for covering.\nSo Dana, you're in P.R. Planned Parenthood has just hired a high-profile P.R. firm, S.K.D. Knickerbocker. They're trying to -- they're now in crisis mode. You know they're in trouble when they hire these guys.\nPERINO: And you know that what they really are hoping for is a firm that can help them with the Democratic Party. Anita Dunn, who used to work at the White House, founded that firm. It's by all accounts a very successful firm. There's no question that she has the political instincts and all of the contacts, as well as people that work for her, to be able to help advance a position from a liberal point of view.\nGUTFELD: Eric, the group Planned Parenthood circulated a memo to reporters, asking them not to cover these videos, because they were -- violated patient privacy.\nBOLLING: Oh, HIPAA rules?\nGUTFELD: Yes.\nBOLLING: So a couple of thoughts. I watched these videos. And you know I watched the beheading videos of ISIS. These videos of Planned Parenthood were far worse. They literally made me nauseous. Don't watch them.\nI have never seen such callous, cold disdain for human life than these Planned Parenthood people, taking body parts off with tweezers, holding them up, showing each other these parts. And discussing how much they could get for this if look at how -- it's disgusting; it's despicable. They need to go away. They need to be -- listen, I shouldn't say they need to go away. They need to be defunded by the taxpayer immediately.\nKamala Harris -- Kamala Harris, I say things right? -- Kamala Harris, the A.G. in California, investigating the video maker, is atrocious. Forget the video maker. Spend your money, spend your time investigating Planned Parenthood. These videos prove they were out for a profit at the expense of these people.\nRIVERA: Don't you fear -- don't you fear, Eric, that the scandal, the justifiable scandal over the callousness of the people portrayed in this video, might put an end to the harvesting of what would be garbage. They would throw it away. And there may be the cure for cancer in there.\n(CROSSTALK)\nBOLLING: Geraldo, there is no question that they were trying to profit.\nSo you're saying there's no profit motive. Unequivocally, if you watch these videos there's a profit motive.\nRIVERA: My point is that you can't destroy the hopes of humanity for the cure of these horrible diseases because of the revulsion that...\nGUILFOYLE: That doesn't justify criminal...\n(COMMERCIAL BREAK)\nGUTFELD: What if we found that it was -- we found that a fetus, nutritionally, was fantastic? Would you now have it for breakfast?\nPERINO: And we already actually dealt with -- remember last week I talked about Amy Otto's piece in The Federalist in which she talks about the science has advanced stem cells that you can grow in a lab that have the same characteristics.\nGUILFOYLE: There is no sympathy (ph) for it.\nPERINO: So you don't have to do what Planned Parenthood is doing. You can -- actually science has advanced us so that we can actually keep our humanity.\nGUTFELD: That's the problem, though. Even if we have this opportunity, we shouldn't be choosing it. Because we can harvest the unborn, should we?\nGUILFOYLE: And isn't there -- when you think about it, that's a built-in incentive for Planned Parenthood, right? The more abortions, the more fetuses that they have that are discarded, they can go turn over, quote, unquote, for \"biomedical research.\" Why isn't there a serious call to arms to be able to investigate criminal conduct; you are not allowed to sell fetal body parts? That's where the investigation should be.\nAnd as Eric said, these videos are horrendous. Horrendous.\nRIVERA: You were a prosecutor in California. You know it is a two-party consent state. And these videos were illegally taken.\nGUILFOYLE: And I'm telling you they don't have the legal expectation of privacy? Bring the case to the courts and see how it turns out. When you're, like, chin-chin with the wine and talking about body parts? Little baby's eyes and feet and hands?\nRIVERA: If the Republican Party insists on making this the issue, this along with immigration, Republicans will lose.\nGUTFELD: Or win. This makes the Gosnell ordeal look like Candyland.\nGUILFOYLE: And I sat through all of that testimony and the evidence and the pictures. Like, wake up and have a conscience. Because there's a special place in hell for people that don't think this is disgusting.\nGUTFELD: All right. On that note, we've got to move ahead.\nRIVERA: Thinking it's disgusting is different than thinking it's illegal.\nGUTFELD: Well, there you go.\nGUILFOYLE: It's both.\nGUTFELD: Morality doesn't matter.\nJon Stewart and President Obama secretly working together for years? Kimberly has some new information on the comedian's White House visits, next.\n(COMMERCIAL BREAK)\nGUILFOYLE: Isn't that a great song? President Obama begged him not to go.\n(BEGIN VIDEO CLIP)\nBARACK OBAMA, PRESIDENT OF THE UNITED STATES: I can't believe that you're leaving before me! In fact, I'm issuing a new executive order that Jon Stewart cannot leave the show.\n(END VIDEO CLIP)\nGUILFOYLE: Of course he did, right? He loves those executive orders. But in just over a week, the president's favorite satirist, Jon Stewart, will be leaving \"The Daily Show.\" The comedian has helped President Obama push his agenda and beaten up on a few Republicans. But were the attacks coordinated?\nPolitico is reporting that Stewart secretly visited the White House on at least two occasions before the president made significant announcements.\nNow Greg, we were talking about this. Remember the good old days? There was, like, Marilyn Monroe...\nGUTFELD: Yes.\nGUILFOYLE: ... secretly visited the White House.\nGUTFELD: Now it's Jon Stewart.\nGUILFOYLE: Wonder what happened?\nGUTFELD: The Clintons. They had many more exciting visitors.\nGUILFOYLE: Not Lewinsky.\nGUTFELD: They often left disheveled.\nBut I have to say, you know, power is intoxicating. And Jon Stewart, his achievements, let's face it. He took failed progressive policies and made them articulate to a whole audience. And that aided President Obama.\nHowever, his achievements -- and I will say this. People don't like it, but Stewart is incredibly talented. But his achievements were aided and abetted by a media landscape that fit his ideology. It will be easier for successor Trevor Noah to take over, because he's also a liberal. But the likes of Dennis Miller or Nick DiPaolo, people will not be afforded that same luxury if you hold political beliefs that are counter to liberalism.\nBut it shows you the need for the right to have people like this who are persuasive and articulate, more so than we are.\nRIVERA: I was wondering where that was going. If Jon Stewart became a giant on the left and the progressive agenda, he really was in many ways the leader of the left in the country. And you know, all due respect to Trevor, anybody else who follows him, the fellow on HBO, \"The Week That Was,\" John Oliver, I don't see the same stature. I don't see -- the left is notoriously fractured. The right now is doing its best to emulate the presidential field of the left. But the liberals always think they know everything.\nGUTFELD: How fractured? That's so lock step.\nRIVERA: Who's the hero of the left?\nGUTFELD: Jon Stewart. Followed by Bernie Sanders.\nRIVERA: My point exactly.\nGUTFELD: Jon Stewart, Bernie Sanders, and Elizabeth Warren.\nGUILFOYLE: Elizabeth Warren, yes.\nGUTFELD: Che Guevara, Josef Stalin.\nRIVERA: Jon Stewart will be missed. We'll leave it at that.\nGUILFOYLE: All right. E.B.\nBOLLING: So I think it's a brilliant strategy on Obama's part.\nGUILFOYLE: Who are you going to feud with?\nBOLLING: Oh, Jon Stewart? I don't know Trevor Noah.\nGUILFOYLE: He's about to know you.\nBOLLING: Brilliant strategy, though, right? I mean, Jon Stewart has 1.3 million viewers. That's not what he was going after. He has a large younger audience. His younger demo, in the demo 18, I think, to 49. On that cable network, I think that's how they measure it. Was substantially a bigger percentage of his audience than a lot of other places. So he was going after the younger demo.\nAnd you bring -- you invite Jon Stewart to the White House. It makes it that much harder for Jon Stewart to take the shots at the White House, even though sometimes he did. Give him credit. If they were funny. But it becomes a little bit harder if you just had lunch with the president.\nGUILFOYLE: All right.\nPERINO: Exactly agree.\nGUILFOYLE: Wisdom from Dana Perino.\nPERINO: I absolutely agree that it's great P.R. for the White House. When you're at the White House you can invite anybody, and they'll come. Nobody says they're not going to come to the White House.\nSo I actually think -- I think what Obama could have done, and only eventually did sort of like six years in, is invite more conservatives in. You invite people in to try to win them over. I mean, there's a whole bunch of people that would have been willing to go and listen to his pitch. Even if that doesn't turn their opinion completely around, it could soften it a little bit, because you know people. That's why it's called public relations. You have relationships, and you build them. And I think they were smart to do it.\nGUTFELD: I have a dumb question. Does the White House have house keys?\nPERINO: You don't need keys.\nGUTFELD: Thank you. I didn't know that. I thought maybe that Obama had house keys.\nGUILFOYLE: They have a fob.\nGUTFELD: Really?\nGUILFOYLE: No.\nRIVERA: Who's your favorite invitee?\nPERINO: That we invited to the White House?\nRIVERA: Yes.\nPERINO: Well, Charles Krauthammer.\nRIVERA: Oh, what a party.\nGUILFOYLE: That's like an open secret. Everybody knows about it.\nBut don't go away, because there is breaking news in that Deflategate scandal. The commissioner of the NFL has reached a decision on Tom Brady and whether to uphold his suspension. The verdict next.\n(COMMERCIAL BREAK)\nRIVERA: Welcome back to \"The Five.\" Tom Brady suspended for four games for his notorious role in deflating footballs at the AFC championship game against Indianapolis. That suspension, that four-game suspension, will remain for next season. The commissioner of the NFL denying the Patriot quarterback's appeal.\nRoger Goodell saying that Brady sought to hide his participation by tampering with the evidence, to whit he destroyed his cell phone before meeting with investigators. Here was Brady back in January.\n(BEGIN VIDEO CLIP)\nTOM BRADY, QUARTERBACK, NEW ENGLAND PATRIOTS: I feel like I've always played within the rules. I would never do anything to break the rules. I believe in fair play, and I respect the league. And, you know, everything that they're doing to try to create a very competitive playing field for all the NFL teams.\n(END VIDEO CLIP)\nRIVERA: That's Brady in January. Obviously, he's being disingenuous, if the commissioners to be believed.\nBut Brady's agent, Kimberly...\nGUILFOYLE: Yes.\nRIVERA: ... just released a statement: the appeal process was a sham resulting in the commissioner rubber-stamping his own decision. Now that is true. I mean, the commissioner is the one who handed down -- I mean not technically. But it's his agency that handed down the four-game suspension. Now he is confirming his own suspension. It's like the judge and jury the same.\nGUILFOYLE: Right. So it's the lacking a little bit of checks and balances, right?\nRIVERA: Right.\nGUILFOYLE: Nevertheless right now what they're saying is, \"Look, you've now committed this act, consciousness of guilt. You've ordered that your cell phone be destroyed. You did this on or about March 6. We lost 10,000 text messages that were directly relevant to this investigation.\" I mean, that's bad.\nWhat he should have done was like, \"Hey, Gisele was in the hot tub and I was like, 'Woo, baby,' and then I jumped in, but I had my phone in my back pocket.\" This always worked. It fell out of my back pocket when I was using the restroom. That's what he should have said, not like I had it -- you know? An accident.\nBOLLING: Except he destroyed his sim card on top of it. That's a little bit bad.\nGUILFOYLE: Oh, it had to be (ph).\nRIVERA: What's your thought on it, very quickly?\nBOLLING: Tom Brady? I'm not sure. It's just a rule. I think it's the dumbest rule in all of sports. You don't switch the basketball out when you're on offense. You don't switch the puck out in hockey when you're on offense. You don't do it with baseball. It's a dumb rule.\nThat said, you've got to play by the rules. Hillary broke the same type of rules. Hillary's being let out the back door no problem.\nGUILFOYLE: You think?\nBOLLING: And I wish Goodell was going to oversee the Hillary e-mail scandal, e-mailgate, the way he is Deflate-gate.\nRIVERA: In fact, the best quarterback of his era. Gorgeous wife, Gisele Bundchen. I mean, the couple, they are -- are they diminished?\nPERINO: All true.\nGUILFOYLE: I don't know. They got...\nPERINO: The agent goes on to say that the decision is wrong and has no basis, and it diminishes the integrity of the game. So I don't know if you're driver like I was in a taxi and he said everybody does this. All quarterbacks are doing this. So if that's true, then maybe they should change something before the start of the season.\nRIVERA: They are. By the way they are.\nGUILFOYLE: Well, you also want steroids.\nRIVERA: Is this like a spitball? Is this like shaving the pine tar on a bat? I mean, how bad?\nGUTFELD: I think this is awful. He didn't want to hand over his cell phone because his text messages were actually to Hillary, to her server. And the pictures were quite embarrassing; involved a pant suit and a shorty robe.\nAnd what is underneath the hat that he's wearing? It seems like he has another ball under his ski cap. Did you ever notice that? It's like really big.\nRIVERA: \"One More Thing\" is up next.\nGUILFOYLE: This is really interesting.\n(COMMERCIAL BREAK)\nBOLLING: Time for \"One More Thing.\" K.G., kick it off.\nGUILFOYLE: All right. Thank you for that. As I reported yesterday, Carly Fiorina had the opportunity to do a major foreign policy speech at the Reagan National Library. It was very well-received. And here's a little bit of sound from it.\n(BEGIN VIDEO CLIP)\nCARLY FIORINA (R), PRESIDENTIAL CANDIDATE: I see President Obama and Secretary Clinton always speaking in terms of ambivalence and shades of gray, offering false choices and raising doubts about our will to lead. The next president of the United States must re-establish our leadership. She must speak with clarity.\n(END VIDEO CLIP)\nGUILFOYLE: All right. Well, very well-received. Packed house. I got to meet her when she was here at fox. She's an impressive woman.\nBOLLING: Very good, very good.\nOK. Check this out. Hillary Clinton today delivered some comments on global warming and the environment. And then guess what she did? She promptly boarded her Dassault model Falcon 900B, which burns 347 gallons of fuel per hour and, like all Dassault business jets, Hillary's was made in France.\nSpeaking of Hillary very quickly, Rand Paul tweeted today that Hillary Clinton needs to return all of her Planned Parenthood money that she was given as political contributions.\nAnd by the way, Senator Paul will be on \"Hannity\" tonight to discuss a little more of that.\nGregory.\nGUTFELD: It is time for this.\n(BEGIN VIDEO CLIP)\nGUTFELD: Greg's Sports Corner.\n(END VIDEO CLIP)\n(BEGIN VIDEO CLIP)\n(BASEBALL PLAYER AT HOME PLATE, DOING STRETCHES)\n(END VIDEO CLIP)\nGUTFELD: I had time this weekend to play a little ball. So I went and played some baseball with some friends. Here I am up at bat. It was a rough -- I do a lot of stretching. I do a lot of stretching when I'm up at bat. I like to keep limber. Switch the bat around. I can't remember, in fact, whether I got a hit. But I'm quite limber. I do a lot of dancing.\nGUILFOYLE: Oh, my God. Come on.\nGUTFELD: That is me, Kimberly.\nBOLLING: You're just taunting the opponent.\nGUTFELD: I am.\nRIVERA: You have a tiny strike zone.\nGUTFELD: It's not the size of the strike zone, Geraldo.\nBOLLING: It's how you use it. Geraldo, you're up.\nRIVERA: I had a great interview, a half-hour interview with Donald Trump on my radio show today, but I had a special guest in my studio helping me with the interview. My almost 10-year-old Sol was there. She met Trump during \"Celebrity Apprentice.\" And here she is, asking the Trumpster a question.\n(BEGIN VIDEO CLIP)\nSOL RIVERA, DAUGHTER OF GERALDO: I met Mr. Trump at \"Celebrity Apprentice,\" when Daddy lost. I'm very sad, because Mr. Trump was nice to me. He told me not to be sad and to sit in his big red chair. He is also a nice man.\nRIVERA: \"He's also a nice man.\" That's an endorsement for you, buddy.\nDONALD TRUMP (R), PRESIDENTIAL CANDIDATE: How beautiful. By the way, how beautiful. The family is so beautiful.\n(END VIDEO CLIP)\nRIVERA: His is, as well. And there he is. He let her sit in the chair. She was just sobbing inconsolably. And he really -- he showed a soft side.\nBOLLING: She never got over the, \"Geraldo. you're fired\"?\nRIVERA: Working on that.\nGUILFOYLE: She's so sweet. Bless her heart.\nPERINO: Wait. So I said that I had a crush on Charles Krauthammer. It's true. I also follow things he's interested in, which includes panda bears. And he loves them.\nGUILFOYLE: Oh, my gosh.\nPERINO: They're very cute. Here's Zaza (ph) who turned 37, which is about 110 years old in panda years. She had a bambo and vegetable ice (ph) cake.\nGUTFELD: It's a dog.\nPERINO: No, it's a bear.\nGUTFELD: It's a painted dog.\nPERINO: She's in Guinness book of world records. Oldest one in captivity and oldest one living in captivity.\n(CROSSTALK)\nBOLLING: We've got to leave it right there. Set your DVR so you never miss an episode of \"The Five.\" That's it for us. \"Special Report\" next.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content. \nthe-five The Five , hosted by Bob Beckel, Eric Bolling, Kimberly Guilfoyle, Greg Gutfeld, Dana Perino, Juan Williams, and Andrea Tantaros, airs on Weekdays at 5PM ET on Fox News Channel.\nMore on this show", "external_links": [], "published": "2015-07-28T03:00:00.000+03:00", "crawled": "2015-08-12T16:38:20.603+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}