{"organizations": [], "uuid": "7d4a29f083482d6683b1bb62982762f5539a9b58", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3268692/images/o-IMMIGRANT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/small-business/blog.xml", "section_title": "Small Business Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/dick-burke/legal-immigration-key-driver-of-economic-growth-in-us_b_7941034.html", "country": "US", "title": "Legal Immigration Key Driver of Economic Growth in U.S. | Dick Burke", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Legal Immigration Key Driver of Economic Growth in U.S. | Dick Burke", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-05T20:08:00.000+03:00", "replies_count": 0, "uuid": "7d4a29f083482d6683b1bb62982762f5539a9b58"}, "author": "Dick Burke", "url": "http://www.huffingtonpost.com/dick-burke/legal-immigration-key-driver-of-economic-growth-in-us_b_7941034.html", "ord_in_thread": 0, "title": "Legal Immigration Key Driver of Economic Growth in U.S. | Dick Burke", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Once again the topic of immigration is dominating the news and as usual, the noise is drowning out the truth.\nAs the CEO of a company that works on a daily basis with U.S. companies seeking to hire foreign nationals, I can say with certainty three things. First, we should never, ever confuse legal immigration with illegal immigration. Second, legal immigration programs have resulted in thousands of U.S. companies being able to hire key employees who have helped them grow their business. Third, the current system is frustrating, confusing, stressful and inefficient - and for the sake of our economy it needs to be improved.\nNationwide, our company has worked with more than 3,300 U.S. companies on their immigration and visa needs. We've filed nearly 5,000 cases this year alone. Our clients tell us that the foreign individuals they are trying to hire are key to the success of their business, which is why they put forth significant time and investment in the process. They also tell us that a diverse workforce is increasingly a competitive advantage for them.\nEarlier this year, we surveyed our clients and received more than 100 responses from companies representing more than 115,000 employees. Nearly 75 percent said that the H-1B applicant they were seeking to hire was important to the company's ability to meet its business goals, with nearly 25 percent saying the hire was critical.\nYet the process for helping U.S. companies hire people who can help them succeed is a mess. Earlier this year, a total of 233,000 applications were submitted for a total of 85,000 H-1B visas (65,000 plus an additional 20,000 for those holding a U.S. Master's degree). As a result, a lottery is held to determine which applicants receive a visa.\nThat means that nearly 150,000 jobs (that were identified as important) are going unfilled and thus delaying or preventing companies from growing. Even worse is the likelihood that these talented individuals will find work overseas where they will compete with the very companies in the U.S. which sought to hire them.\nIt's no wonder that our survey showed that more than 80 percent of human resource/hiring managers find the H-1B process stressful, with more than 50 percent calling it extremely so. Imagine if you had found the one person with exactly the skill set you needed and invested the time and money to go through the process only to find out that the random lottery didn't pick your number.\nI can't think of any other aspect of running a business where so much at stake is left effectively to a flip of a coin. Those companies who \"lose\" the lottery face unpleasant options: delay the hiring for another year and hope the applicant is still available (and that the lottery doesn't disappoint them again); apply for another type of visa - a long shot; or re-open the position and spend more time (as many as six months) and resources recruiting a new candidate.\nI understand the frustration and the deep concern of those who have seen some large U.S. companies and international staffing firms seemingly use the H-1B program outside of its intent. One idea might be to reform the current process to prioritize companies who are hiring directly. Other filters could be set to prioritize small businesses, certain underserved industries or geographies.\nAnd it's not just companies seeking to hire immigrants that impact the economy, but also immigrants who start companies of their own. Immigrant-owned companies employ 1 in 10 Americans and generate nearly $1 trillion in revenue. Forty percent of all Fortune 500 companies were started by immigrants or children of immigrants. Immigrants now start more than 25 percent of businesses in the U.S., and in Silicon Valley, 44 percent of startups have at least one immigrant founder.\nThe point is, we need to recognize the important role that immigrants play in meeting the needs of employers as well as creating jobs and stimulating our economy and make it easier for them to work here. Doing so will increase the chances that talented individuals who want to work in our country and who are excited to help build U.S. businesses and strengthen the U.S. economy will have the chance to do so, benefiting us all.\nMore: Immigration H 1b H 1b Visas U.S. Economy", "external_links": [], "published": "2015-08-05T20:08:00.000+03:00", "crawled": "2015-08-05T21:07:28.197+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}