{"organizations": [], "uuid": "c25e990c3690bf0be4599325f1283502f4e06a30", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1565211/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/alex-cacioppo/the-principled-hypocrisy-_b_8067836.html", "country": "US", "title": "The Principled Hypocrisy of President Obama | Alex Cacioppo", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The Principled Hypocrisy of President Obama | Alex Cacioppo", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-02T01:27:00.000+03:00", "replies_count": 0, "uuid": "c25e990c3690bf0be4599325f1283502f4e06a30"}, "author": "Alex Cacioppo", "url": "http://www.huffingtonpost.com/alex-cacioppo/the-principled-hypocrisy-_b_8067836.html", "ord_in_thread": 0, "title": "The Principled Hypocrisy of President Obama | Alex Cacioppo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama will travel to Alaska on Monday [Aug. 31] to call for urgent and aggressive action to tackle climate change, capitalizing on a poignant tableau of melting glaciers, crumbling permafrost and rising sea levels to illustrate the immediacy of an issue he hopes to make a central element of his legacy.\nBut during a three-day trip choreographed to lend spectacular visuals and real-world examples to Mr. Obama's message on global warming, he will pay little heed to the oil and gas drilling offshore that he allowed to go forward just this month, a move that activists say is an unsavory blot on an otherwise ambitious climate record. -- New York Times , August 31, 2015\nThroughout his tenure, Barack Obama has talked a good game about issues that he cares about, while simultaneously making policy decisions that have the exact opposite effect. He has always talked the talk, ever since he first announced that he would shut down Guantanamo Bay and stop using drones to summarily execute people who might cause harm to \"the homeland,\" or most recently, when he paid a visit to the Arctic Circle and declared that \"climate change is one of the biggest threats we face.\"\nAmericans are known to have a very short-term memory, but hopefully not so short as to ignore the fact that the Arctic was just green-lighted by his administration to drill -- ahem, explore -- there, regardless of the enormous environmental costs. This hasn't been the first time President Obama's words and actions have so radically diverged. In fact, it seems to have been his M.O. the entire time. Let's just take three major issues: the environment, surveillance (or civil liberties more broadly), and the drone campaign, which had been sharply curtailed but is nonetheless another defining feature of his \"legacy.\" Just ask a Yemeni.\nThere is a terrible , tragic irony to the fact that a former professor of constitutional law enabled indiscriminate wiretaps of millions, or that a Nobel Peace Prize-winner presided over the exponential growth of a global assassination program (i.e. drone strikes) that shredded due process rights and generated more terrorism, or that a vocal proponent of green energy gave the okay to the major energy companies to drill in the warming Arctic.\nAs the ancient adage goes, hypocrisy is the tribute vice pays to virtue.\nWhile in college, I was a member of a democratic socialist group, and the titular head of our crew (we called ourselves the Ice Cream Socialists) earnestly believed that Barack Obama was the most progressive candidate for president this country was ever likely to have, and that he would be an agent of change. Watching one of the debates, a classmate tearfully said she was supporting him because he would put an end to drone strikes, since he believed in the rule of law. Now that Obama is facing the end of his terms in office, it is clear in retrospect that rhetorical adherence to principles like protecting the environment and honoring the Constitution was just style, and that his actual record -- which belied those principled stands he said he believed in -- was the substance. Anyone who can remember \"the audacity of hope\" probably feels deeply betrayed.\nFollow Alex Cacioppo on Twitter: www.twitter.com/lexiconstable\nMore: Barack Obama Barack Obama Climate Change Drones Surveillance", "external_links": ["http://grist.org/climate-energy/obama-goes-on-climate-tour-in-alaska-gets-called-massive-hypocrite/", "http://www.slate.com/blogs/the_slatest/2015/08/31/obama_trip_to_alaska_stark_difference_between_rhetoric_and_action_on_climate.html", "http://www.cnn.com/2015/08/31/opinions/sutter-obama-arctic-two-degrees/index.html", "http://www.nytimes.com/2015/08/31/us/politics/obama-to-urge-aggressive-climate-action-in-visit-to-arctic-alaska.html", "http://www.twitter.com/lexiconstable", "http://www.motherjones.com/environment/2015/09/obama-climate-hypocrite-alaska"], "published": "2015-09-02T01:27:00.000+03:00", "crawled": "2015-09-02T03:24:12.755+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}