{"organizations": [], "uuid": "ae9813adefafff6f689bd96e12d6e674d1e4be61", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/stavridisjames_080815getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/250665-ex-nato-supreme-commander-rips-obama-over-military-cuts", "country": "US", "title": "Ex-NATO supreme commander rips Obama over military cuts", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ex-NATO supreme commander rips Obama over military cuts", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-09T14:00:00.000+03:00", "replies_count": 0, "uuid": "ae9813adefafff6f689bd96e12d6e674d1e4be61"}, "author": "Bradford Richardson", "url": "http://thehill.com/blogs/blog-briefing-room/news/250665-ex-nato-supreme-commander-rips-obama-over-military-cuts", "ord_in_thread": 0, "title": "Ex-NATO supreme commander rips Obama over military cuts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 09, 2015, 07:00 am Ex-NATO supreme commander rips Obama over military cuts By Bradford Richardson Getty Images Former NATO Supreme Commander James Stavridis criticized President Obama, his former boss, for recent cuts to military spending while U.S. troops are still engaged on multiple fronts around the world. “We have already cut defense … about 30 percent over the last 10 years, and we’re still at war,” Stavridis told radio show host John Catsimatidis on “The Cats Roundtable” Sunday on New York’s AM 970. “We’re actively involved on multiple continents in real combat operations. We should not be drastically reducing our troop levels.” ADVERTISEMENT Stavridis, a retired U.S. admiral and the current dean of Tufts University’s Fletcher School of Law and Diplomacy, also disagreed with the president’s recent decision to pull the sole remaining aircraft carrier patrolling the Middle East out of the Arabian Gulf. “We have 11 active nuclear aircraft carriers today in the United States Navy,” Stavridis said. “It is hard for me to understand why we cannot manage a fleet of that size to maintain an aircraft carrier at all times in regions as dangerous as the Arabian Gulf.” Stavridis called for increased NATO involvement in the conflict in Crimea. “We need to push back against that kind of Russian advancement, that Russian aggression, to show them that that’s simply not appropriate behavior in the 21st century,” Stavridis said, adding that Russian forces are not nearly as capable as NATO forces. “They’re not as capable, but within small, tactical spaces, they can still be extremely disruptive. We have to stand firmly against them to deter them.”", "external_links": [], "published": "2015-08-09T14:00:00.000+03:00", "crawled": "2015-08-09T14:36:46.267+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}