{"organizations": [], "uuid": "b42cfcb931cb58cecc7d1c65607ad7fb517830e5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3264466/images/o-OBAMA-IRAN-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/media/blog.xml", "section_title": "Media Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/greta-van-susteren/how-do-we-know-president-obama-is-right_b_7935600.html", "country": "US", "title": "How Do We Know President Obama Is Right That Iran Is 2-3 Months From a Nuclear Bomb? | Greta Van Susteren", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 94, "title_full": "How Do We Know President Obama Is Right That Iran Is 2-3 Months From a Nuclear Bomb? | Greta Van Susteren", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-05T00:05:00.000+03:00", "replies_count": 109, "uuid": "882366034a19a5c14b3348fad642fdf298130d0d"}, "author": "Greta Van Susteren", "url": "http://www.huffingtonpost.com/greta-van-susteren/how-do-we-know-president-obama-is-right_b_7935600.html#post-0", "ord_in_thread": 0, "title": "How Do We Know President Obama Is Right That Iran Is 2-3 Months From a Nuclear Bomb? | Greta Van Susteren", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No sane person wants Iran to have a nuclear weapon. That would be catastrophic to the entire world. In this post, I am stepping back, taking a deep breath, reviewing recent history, and playing devil's advocate. I don't pretend to have the answer but I think I should try to provoke the debate.\nIt is widely accepted that Iran is 2-3 months away from a nuclear bomb. Is that true?\nIran somehow made us believe it is 2-3 months out from a nuclear weapon but the Iranian regime has a motive to lie -- big time. That's obvious. Iran, like Iraq's Saddam Hussein, wants us to believe that it is close since that makes Iran both powerful (scary) and that threat provides great leverage in dealing with the rest of the world.\nPresident Obama says Iran is 2-3 months from a nuclear weapon. President Obama would not lie about what he believes, but how do we know President Obama has the correct information? Could he be wrong? Where does he get the 2-3 month figure?\nMy guess is that President Obama is relying on intelligence sources for his 2-3 month assertion, including relying on our own secretive CIA, just as President Bush and the political community relied on the same sources or same type sources about Saddam and WMD. That turned out wrong.\nPresident Bush and the entire political community was wrong about Saddam and WMD. It is a fact, just about everyone thought in the run up to the 2003 invasion that Saddam had WMD. This mistake has had horrible consequences. (Note to those who still think Saddam had WMD when we went in in 2003 -- In his 2010 memoir \"Decision Points,\" President Bush said he was wrong, but that he relied on the intelligence.)\nIf the intelligence community is wrong now, and Iran is not 2-3 months (but years) away from a nuclear weapon, a deal allowing this rogue nation that sponsors terrorism around the world to get loaded and loaded with cash could also be catastrophic.\nCash will empower -- prop up -- the current Iranian regime. It will revive their economy which is currently on life support and curtail the possibility that the Iranian people will get deeply frustrated and desperate and rise up against the regime. I don't want to hurt the innocent Iranian people but big money in the hands of their rogue regime can supply the regime with an oppressive ability to continue to keep the innocent people in check.\nSo my question as we grapple with the Iranian deal: do we really have the facts? Is it really 2-3 months? Or are we motivated again, and our judgment clouded again, by the fear that the short time of 2-3 months creates? That is what happened with Saddam and the threat of WMD. We got scared!\nEveryone got scared. That everyone included the NYT, the entire political community (Democrats and Republicans), the White House and the American people.\nAt the time, the bipartisan House and Senate Intelligence Committees were shown the same intelligence that President Bush was shown and they agreed with President Bush. They incorrectly concluded that Saddam had WMD.\nAt the time, others in the political community who did not have access to the intelligence did not ask hard questions (like this posting is doing now but failed to do in 2003.) Instead they blindly accepted what turned out to be false.\nMany Americans stood behind the decision to go into Iraq. Our leaders told us Saddam had WMD. We accepted it without demanding facts - real proof. Fear does that. Fear is also contagious.\nSo now these questions...\nHow and when do we know a leader has it right? Why is President Obama relying on this intelligence about Iran? Why does he trust it? Is there a good and solid reason?\nYou and I don't get the specific facts (intel) and, of course, the reason for keeping us in the dark is national security. So we fly blind.\nBut ask yourself, in light of our recent history where our intelligence community has led our leaders astray, is it enough that our leaders say now 'trust me?' Should we not demand more debate, real debate of the facts? Not just scary stuff?\nSome of you may be satisfied that other ally nations are also saying Iran is 2-3 months out from a nuclear bomb but remember, we have heard that before. Remember how back in 2003 other ally nations, including PM Tony Blair, agreed with President Bush and our political community that Saddam had WMD? PM Tony Blair was convinced that Saddam had WMD, too - but he was wrong.\nShould we just roll the dice and hope the deal is a good one? President Obama has said, \"No deal means a greater chance of war in the Middle East.\" How does he know that? And if that isn't using fear to try to sell this deal, I don't know what is.\nFacts should sell this deal - not fear. We are all big girls and big boys and our leaders need to give us more information.\nOne other thing -- if indeed it is true that Iran is 2-3 months away from a nuclear weapon -- can you tell me why our leaders let THAT happen? Why did they wait? How could they bring us to the edge of the cliff?\nOriginally posted on GretaWire .\nMore: Barack Obama Iran Deal Iran Breakout Time Iran Nuclear Program", "external_links": ["http://gretawire.foxnewsinsider.com/2015/08/04/how-do-we-know-president-obama-has-it-right-that-iran-is-2-3-months-from-a-nuclear-bomb-is-he-relying-on-the-same-intelligence-community-that-told-president-bush-that-iraq-had-a-wmd/"], "published": "2015-08-05T00:05:00.000+03:00", "crawled": "2015-08-05T06:10:25.127+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}