{"organizations": [], "uuid": "9439994d5d83d45c362a03254ed74b61426779c7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/mccainjohn_072115fr.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/blogs/floor-action/senate/255451-mccain-obama-to-blame-for-putins-syria-strategy", "country": "US", "title": "McCain: Obama to blame for Putin's Syria strategy", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McCain: Obama to blame for Putin's Syria strategy", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-30T19:51:00.000+03:00", "replies_count": 0, "uuid": "9439994d5d83d45c362a03254ed74b61426779c7"}, "author": "jcarney@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/senate/255451-mccain-obama-to-blame-for-putins-syria-strategy", "ord_in_thread": 0, "title": "McCain: Obama to blame for Putin's Syria strategy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 30, 2015, 12:51 pm McCain: Obama to blame for Putin's Syria strategy By Jordain Carney Sen. John McCain (R-Ariz.) slammed the Obama administration on Wednesday, suggesting they are to blame for Russia's increased military presence in Syria. \"This administration has encouraged our enemies, mistaken an excess of caution for prudence and replaced the risk of action with the perils of inaction. Into the wreckage of this administration's Middle East policy has now stepped Vladimir Putin,\" McCain said. \"He is taking the administration's inaction and caution as weakness, and he is taking full advantage.\" ADVERTISEMENT McCain's remarks come as Russia launched its first airstrikes in Syria in the wake of Putin and President Obama's meeting at the United Nations this week over Russia's military buildup within Syria. McCain, the chairman of the Senate Armed Services Committee, also sounded dismayed over comments earlier this month from White House Press Secretary Josh Earnest, who said it was \"unclear exactly what Russia's intentions are.\" McCain fired back that if \"the White House is confused about Putin's intentions and plans in Syria, then the United States is in even worse trouble than many fear, because it's not hard to discern what Vladimir Putin wants.\" He added that Putins' intentions are \"obvious\" and that the Russian president wants to be a \"kingmaker.\" Wednesday's speech is by no means the first time the hawkish senator has criticized the administration's handling of Syria or its foreign policy more broadly. McCain suggested that a policy needs to be developed for Iraq and Syria, though he said that it doesn't have to include sending in \"thousands of ground troops.\" Despite the administration starting airstrikes against the Islamic State of Iraq and Syria (ISIS) more than a year ago, lawmakers have been unable to reach an agreement on a bill that would authorize and set out legal guidelines for the war against ISIS. But McCain doubled down on his criticism, saying that Obama has \"sounded the retreat across the Middle East\" and that the increasingly complicated military conflict is \"the inevitable consequence of hollow words, red lines crossed ... leading from behind and a total lack of American leadership.\" Tags:", "external_links": [], "published": "2015-09-30T19:51:00.000+03:00", "crawled": "2015-09-30T21:13:51.775+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}