{"organizations": [], "uuid": "4c329ebed00d37238984397906246d5218ce3360", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/scottwalker_060215getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1625/feed", "section_title": "Presidential races", "url": "http://thehill.com/blogs/ballot-box/presidential-races/252600-scott-walker-blames-obama-for-attitude-that-has-led-to", "country": "US", "title": "Walker: Climate under Obama led to recent police killings", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Walker: Climate under Obama led to recent police killings", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-03T01:09:00.000+03:00", "replies_count": 0, "uuid": "4c329ebed00d37238984397906246d5218ce3360"}, "author": "csegal@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/252600-scott-walker-blames-obama-for-attitude-that-has-led-to", "ord_in_thread": 0, "title": "Walker: Climate under Obama led to recent police killings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 02, 2015, 06:09 pm Walker: Climate under Obama led to recent police killings By Ben Kamisar \nGov. Scott Walker connects President Obama to a “rise in anti-police rhetoric” that contributed to two recent killings of police officers in a Wednesday op-ed . ADVERTISEMENT “In the last six years under President Obama, we’ve seen a rise in anti-police rhetoric. Instead of hope and change, we’ve seen racial tensions worsen and a tendency to use law enforcement as a scapegoat,” Walker writes in a post on the conservative website Hot Air. \nThe Wisconsin governor points to that “attitude” as sparking anti-police rhetoric that “has real consequences for the safety of officers who put their lives on the line for us and hampers their ability to serve the communities that need their help.” \nWalker’s response comes days after police officers in Texas and Illinois were assassinated while on the job. The suspect in the Texas killing has been arrested and three suspects remain at large in the Illinois shooting, according to multiple media reports. \nThe GOP presidential candidate addresses grievances surrounding the recent police involved shootings — of mostly black men — by touting his Badger State record of mandating an independent investigation into any suspect that dies in police custody and added that he supports training that limits use of force to “appropriate circumstances.” He adds that he would ensure that all officers know that “we have their back.” \n“After years of division under President Obama, America needs a leader who will seek to unite all Americans,” he says. \n“No law enforcement officer should fear to do their job the way he or she was trained to do it, and no law-abiding citizen should fear for their safety from those sworn to protect us.” \nThe comments come as Walker lags in presidential polls — he’s tumbled from a top contender to sixth place nationally in RealClearPolitics’ average of recent polls, as he has been criticized for lacking the fire of other GOP candidates. \nSen. Ted Cruz (Texas), a Republican presidential rival, levied a similar line of criticism against Obama Monday in New Hampshire, according to The Washington Post. \nThe Obama administration faced similar criticism from conservatives after last winter’s deaths of two New York Police Department officers. \nThe president and then-Attorney General Eric Holder condemned those murders, but also expressed support for protests that stemmed from decisions to not indict officers in the deaths of unarmed black men. Tags:", "external_links": [], "published": "2015-09-03T01:09:00.000+03:00", "crawled": "2015-09-03T06:44:32.963+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}