{"organizations": [], "uuid": "336e5289776003a233728513ac66e882398df8b0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama1_080315getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1752/feed", "section_title": "House", "url": "http://thehill.com/blogs/floor-action/house/253306-house-votes-to-accuse-obama-of-withholding-iran-documents", "country": "US", "title": "House votes to accuse Obama of withholding Iran documents", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House votes to accuse Obama of withholding Iran documents", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-11T00:24:00.000+03:00", "replies_count": 0, "uuid": "336e5289776003a233728513ac66e882398df8b0"}, "author": "cmarcos@thehill.com (Cristina Marcos)", "url": "http://thehill.com/blogs/floor-action/house/253306-house-votes-to-accuse-obama-of-withholding-iran-documents", "ord_in_thread": 0, "title": "House votes to accuse Obama of withholding Iran documents", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 10, 2015, 05:24 pm House votes to accuse Obama of withholding Iran documents Getty Images \nThe House passed a resolution Thursday contending that President Obama hasn’t provided Congress with all of the documents related to the Iran nuclear deal, thereby violating the terms of the congressional review law. \nThe party-line vote of 245-186 came a day after House GOP leaders recalibrated their strategy to reject the deal following a conservative revolt. It also came the same day Senate Democrats blocked progress on a resolution disapproving the deal. \nIn the House, conservatives rallied around a proposal from Rep. Peter Roskam (R-Ill.), co-chairman of the House Republican Israel Caucus, to delay a vote on the Iran deal until the Obama administration provides Congress with the text of side deals between Iran and the International Atomic Energy Agency (IAEA). ADVERTISEMENT Those bilateral agreements lay out details about international inspections at some Iranian nuclear sites. \nThe Obama administration itself does not have the text of the side deals to share with Congress. The IAEA routinely keeps documentation of nuclear agreements with individual countries confidential. \nStill, some Republicans say the lack of information about the inspections agreed to between Iran and the IAEA leaves lawmakers in the dark. \n“No American citizen has read this entire agreement. And yet we’ve got members who say, ‘This is a great deal, and I’m excited to vote for it,’ ” said Rep. Mike Pompeo (R-Kan.), the resolution’s author. \nUnder a law enacted earlier this year, Congress has 60 days to review the deal before the White House can begin lifting sanctions on Iran. The nation agreed to limit its nuclear program and open its facilities up for inspections in exchange for relief from economic sanctions. \nHouse and Senate Republican leaders have stated since July that the 60-day review period ends Sept. 17. But lawmakers demanding to see the arrangements between Iran and the IAEA argue that the review period hasn’t technically started because they don’t have all the documents pertaining to the deal. \nThe House had originally planned to vote on a resolution disapproving the Iran deal. But after getting an earful from the rank and file concerned about the side deals at a conference meeting Wednesday morning, House GOP leaders crafted a new three-part plan. \nAfter passage of the resolution stating President Obama didn’t provide Congress with all the necessary documents, the House will take up two more bills Friday. \nOne will be a resolution approving the deal, which is expected to fail. The other measure would prevent Obama from lifting sanctions against Iran for the rest of his term. \nDemocrats dismissed the GOP’s revamped strategy as an attempt to prolong the congressional review process once it became clear Obama had enough Senate Democrats in support to keep the deal in place. \n“House Republicans have cooked up a series of votes to needlessly drag this process out and appeal to their conservative base,” said Rep. Jim McGovern (D-Mass.). \nEarlier Thursday, Senate Democrats held ranks and blocked a resolution disapproving of the Iran nuclear deal. \n\"This vote is a victory for diplomacy, for American national security, and for the safety and security of the world,\" Obama said in a statement on the Senate vote. \nRepublicans could turn to legal action to pursue their case that the Obama administration didn’t adhere to the terms of the congressional review law. Speaker John Boehner (R-Ohio) indicated Thursday a lawsuit against the Obama administration is “an option that’s very possible.” Tags:", "external_links": [], "published": "2015-09-11T00:24:00.000+03:00", "crawled": "2015-09-11T03:30:32.888+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}