{"organizations": [], "uuid": "4aef4f7d5c334d4e4b6f761a711788ea5f95443c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/santorumrick_042515getty.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/gop-primaries/251204-santorum-obama-has-deliberately-empowered-enemies", "country": "US", "title": "Santorum: Obama has 'deliberately empowered' enemies", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Santorum: Obama has 'deliberately empowered' enemies", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-15T19:55:00.000+03:00", "replies_count": 0, "uuid": "4aef4f7d5c334d4e4b6f761a711788ea5f95443c"}, "author": "esmilowitz@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/ballot-box/gop-primaries/251204-santorum-obama-has-deliberately-empowered-enemies", "ord_in_thread": 0, "title": "Santorum: Obama has 'deliberately empowered' enemies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 15, 2015, 12:55 pm Santorum: Obama has 'deliberately empowered' enemies By Mark Hensch Getty Images Republican presidential candidate Rick Santorum on Saturday said President Obama’s actions are intentionally strengthening America’s foes overseas. “This president has not just turned a blind eye, he has deliberately empowered the enemy by his actions,” he said during the Iowa State Fair in Des Moines. “He has empowered China, he has empowered Russia, he has empowered ISIS and he has empowered Iran,” Santorum said. ADVERTISEMENT “Every step of the way, he has been soft on our enemies and harsh on our allies,” the 2016 GOP presidential candidate added of Obama’s foreign policy decisions. Santorum argued Saturday that the U.S. is particularly failing in its prolonged conflict with the Islamic State in Iraq and Syria (ISIS). “We have not taken this threat seriously,” he said. “We must take back their land and we must destroy their state.” “If I am elected president, we will defeat ISIS,” Santorum added. “I will make sure ISIS is not spending their money on weapons – I’ll make sure they’re spending their money on body bags.” Santorum said his tough talk against ISIS is attracting the extremist organization’s attention, noting that he recently appeared on ISIS’s “enemies list” in the group’s monthly news publication. “There’s nobody else who has been on that list,” Santorum said. “In the years since 9/11, I have spent time and treasure trying to understand our enemy.” Santorum also said he was instrumental in enacting economic sanctions against Iran during his tenure in Congress. “I fought for those sanctions,” he said. “You know who fought against me? Joe Biden, Hillary Clinton, Barack Obama and John Kerry.” Santorum’s remarks come as he competes for Iowans’ attention against one of the most crowded GOP presidential fields in recent memory. The former Pennsylvania lawmaker shocked political pundits during the 2012 White House race by winning Iowa’s first-in-the-nation caucus despite low national polling numbers at the time. Santorum thanked Iowa’s voters Saturday for taking a chance on his campaign three years ago. “You got it right last time,” he said. “The people of Iowa did their job. They listened to the candidates and shuffled through all the rhetoric.” “The other folks didn’t,” Santorum added of the 2012 presidential election. “We didn’t win last time.” Tags:", "external_links": [], "published": "2015-08-15T19:55:00.000+03:00", "crawled": "2015-08-15T23:30:14.462+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}