{"organizations": [], "uuid": "d35f258eaf2f5f984d0c65a117b6f84d67baa953", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e8bc2a14000077002e4e7b.jpeg", "site_section": "http://www.huffingtonpost.com/raw_feed_index.rdf", "section_title": "The Huffington Post | The Full Feed", "url": "http://www.huffingtonpost.com/entry/obama-responds-hony-photo-iran_55e8a7bbe4b0aec9f356abfa", "country": "US", "title": "Obama Posts Moving Comment On Humans Of New York Photo From Iran", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Posts Moving Comment On Humans Of New York Photo From Iran", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-04T00:29:00.000+03:00", "replies_count": 0, "uuid": "d35f258eaf2f5f984d0c65a117b6f84d67baa953"}, "author": "Dhyana Taylor", "url": "http://www.huffingtonpost.com/entry/obama-responds-hony-photo-iran_55e8a7bbe4b0aec9f356abfa", "ord_in_thread": 0, "title": "Obama Posts Moving Comment On Humans Of New York Photo From Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Posts Moving Comment On Humans Of New York Photo From Iran \"And if I ever get to meet him, I hope he'll save me an apricot!\" Dhyana Taylor Politics Intern, The Huffington Post Posted: 09/03/2015 05:29 PM EDT | Edited: 2 minutes ago \nPresident Barack Obama pulled at America's heartstrings on Thursday by leaving a sincere comment on a Humans of New York photo taken in Tabriz, Iran. \nBrandon Stanton , the creator of the well-known photo series, has temporarily rebranded his Facebook page as \"Humans of Iran.\" His photo depicts a father and son on the child's tenth birthday.The father told Stanton a story about his son giving away apricots, which he says was the moment he knew he was raising a \"humanitarian.\" \n“Today’s his tenth birthday. He’s a very emotional young man. He likes to solve other people’s problems. One time... Posted by Humans of New York on Thursday, September 3, 2015 \nThe president posted from the official White House Facebook account, signing the post with his initials to indicate that the comment came personally from him. He pledged to do whatever he can to ensure the child can reach his full potential. \n\"What an inspirational story,\" Obama wrote . \"One of the most fulfilling things that can happen to you as a parent is see the values you've worked to instill in your kids start to manifest themselves in their actions -- and this one really resonated with me.\" \nThe president, who entered the Oval Office promising to reach out to the Iranian people, has been frequently challenged by critics of the recent nuclear deal with Iran for being too soft on the country. \n\"I hope this young man never loses his desire to help others. And I'm going to continue doing whatever I can to make this world a place where he and every young person like him can live up to their full potential,\" the president continued. \"And if I ever meet him, I hope he'll save me an apricot! -bo\" \nIn July, Democratic presidential candidate Hillary Clinton left encouraging comments on a HONY photo depicting a young boy who was worried about his future because of his sexual orientation. \n\"Prediction from a grown-up: Your future is going to be amazing,\" Clinton wrote . \"You will surprise yourself with what you're capable of and the incredible things you go on to do. Find the people who love and believe in you - there will be lots of them. --H.\"", "external_links": [], "published": "2015-09-04T00:29:00.000+03:00", "crawled": "2015-09-04T00:44:21.852+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}