{"organizations": [], "uuid": "37370222aac8a57d46ba6e8a2cb473b8ecc52571", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/capitoldome-063013gn1.jpg", "site_section": "http://thehill.com/taxonomy/term/36/feed", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/blogs/floor-action/scheduling/254248-this-week-pope-visit-abortion-politics", "country": "US", "title": "This week: Pope visit, abortion politics", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "This week: Pope visit, abortion politics", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-21T13:00:00.000+03:00", "replies_count": 0, "uuid": "37370222aac8a57d46ba6e8a2cb473b8ecc52571"}, "author": "jcarney@thehill.com (Jordain Carney and Cristina Marcos)", "url": "http://thehill.com/blogs/floor-action/scheduling/254248-this-week-pope-visit-abortion-politics", "ord_in_thread": 0, "title": "This week: Pope visit, abortion politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 21, 2015, 06:00 am This week: Pope visit, abortion politics By Jordain Carney and Cristina Marcos Greg Nash \nPope Francis's address to Congress—the first ever by a pontiff—will dominate the week. \nTens of thousands are expected to flock to the Capitol as Pope Francis visits Washington, D.C., grinding the Hill to a halt. ADVERTISEMENT Francis is expected to arrive on Capitol Hill around 9:15 a.m. Thursday and will meet privately with House Speaker John Boehner (R-Ohio) before speaking to Congress at 10 a.m. The House chamber is expected to be at full capacity, with a ticket to see the pope speak considered one of the hottest in Washington.\nThe Vatican has kept a tight lid on the contents of Pope Francis's much-anticipated address. But he's expected to discuss a wide range of topics, such as climate change, income inequality, normalizing U.S. relations with Cuba, the Iran deal, and abortion. \nThe speech isn't without controversy. At least one member of Congress is planning to boycott: Rep. Paul Gosar (R-Ariz.), who is Catholic, doesn't want to potentially have to listen to Pope Francis lecture Congress about the effects of climate change. \nBut the event will also check off something of a bucket list item for Boehner, who has tried inviting three popes to speak before Congress over his more than 20 years in office and finally succeeded. \nAfter speaking before Congress, the pope also plans to make a brief appearance on the Speaker's Balcony on the Capitol's West Front around 10:50 a.m. before departing by 11 a.m. \nWhile the pope's visit on the Hill will be brief, the uptick in security is expected to shut down most of the roads around the Capitol. It will also likely take hours to clear out the massive crowds from the complex after the visit. \n\nAbortion \nSenate Republicans are putting abortion on the agenda ahead of the pope's visit. \nSenators will spend the early part of the week debating a House-passed bill that would ban most abortions after 20 weeks, even though similar legislation has been ruled unconstitutional at the state level. \nDemocrats have slammed Republicans for pivoting to the bill—despite a looming deadline to fund the government—suggesting that they are wasting limited floor time on legislation that isn't expected to get the 60 votes needed to overcome an initial procedural hurdle. \n\"I guess they want to do that before the pope gets here,\" Minority Leader Harry Reid (D-Nev.) said last week. \"But it's not going to change the people, how he feels about the fact that Republicans have ignored poor people in America.\" \nA similar bill from Sen. Lindsey Graham (R-S.C.) only has 45 cosponsors, and hasn't attracted a single Democratic supporter. \nIt's also likely to split Senate Republicans running for reelection next year, with blue-state Republican Sens. Kelly Ayotte (N.H.) and Mark Kirk (Ill.) not officially backing the Senate version of the legislation. \n\nSpending bill \nWith only a handful of session days left, congressional Republicans are under a tight deadline to figure out how to fund the government while also navigating a public battle over funding Planned Parenthood before the end of the month. \nSen. John Cornyn (R-Texas) told reporters last week that the Senate could take a vote on defunding the organization in relation to a spending bill, though details on the plan are scarce. \nThe maneuver, however, would likely fail to gain the 60 votes to overcome a procedural hurdle. \nRepublican division with the Senate is already on the rise, with Ayotte demanding that Sen. Ted Cruz (R-Texas) explain how he plans to win the government shutdown fight with the president pledging to veto a bill that doesn't fund the organization. \nMeanwhile, House Republicans have yet to outline their strategy and its unclear if the House will vote on any stopgap funding bill on Thursday or Friday. \nBut Republican leadership gave themselves an insurance policy late last week by adopting \"martial law\" that allows a fast-track process to consider legislation on the floor. \nDeploying the procedure indicates there is at least a possibility a stopgap funding bill - which could include a provision to defund Planned Parenthood at the behest of conservatives – hits the floor this week. \nBut that would put the House legislation on a collision course with the Senate, as well as the White House. \n\nMonday : \nThe Senate will convene at 2 p.m. Majority Leader Mitch McConnell (R-Ky.) said that the while no votes are expected, the Senate will debate the Pain-Capable Unborn Child Protection Act, which bans most abortions after 20 weeks. \nThe House isn't in session. \n\nTuesday : \nThe Senate will take a procedural vote on proceeding to the 20-week abortion legislation. Sixty votes will be needed to overcome the procedural hurdle. \nThe Senate will also likely recess form 12:30 p.m. to 2:15 p.m. for weekly policy lunches. \nThe House isn't in session. \n\nWednesday : \nThe House and the Senate will be out of session for the Jewish holiday Yom Kippur. \n\nThursday : \nIn addition to the pope's speech, the House is expected to vote on non-controversial bills under suspension of the rules later in the day. \nWith lawmakers still trying to carve out a path forward on the spending bill, it's unclear if either chamber will be in session on Friday. \n\nFriday: \nWith both chambers still trying to carve out a path forward on the spending bill, it's unclear what lawmakers will be working on. Chinese President Xi Jinping is expected to visit the Capitol to meet with congressional leadership as part of his trip to Washington.", "external_links": [], "published": "2015-09-21T13:00:00.000+03:00", "crawled": "2015-09-21T16:51:41.527+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}