{"organizations": [], "uuid": "26471fdf7ba51b74fcfad14130a7c320a674c1c1", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/johnfetterman.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/senate-races/255204-marijuana-group-holds-fundraiser-for-pro-pot-senate-hopeful", "country": "US", "title": "Marijuana group holds fundraiser for pro-pot Senate hopeful", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Marijuana group holds fundraiser for pro-pot Senate hopeful", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-29T01:15:00.000+03:00", "replies_count": 0, "uuid": "26471fdf7ba51b74fcfad14130a7c320a674c1c1"}, "author": "csegal@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/ballot-box/senate-races/255204-marijuana-group-holds-fundraiser-for-pro-pot-senate-hopeful", "ord_in_thread": 0, "title": "Marijuana group holds fundraiser for pro-pot Senate hopeful", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 28, 2015, 06:15 pm Marijuana group holds fundraiser for pro-pot Senate hopeful C-SPAN \nJohn Fetterman, a suburban Pittsburgh mayor who's running for a Pennsylvania U.S. Senate seat, will fundraise with a local chapter of a pro-marijuana legalization group. ADVERTISEMENT The fundraiser for the Pittsburgh National Organization for the Reform of Marijuana Laws (NORML) announced a meet-and-greet fundraiser with Fetterman for Wednesday at a seafood restaurant in the city. Tickets will cost $30 and will include three drink tickets, appetizers, a $10 gift card to the restaurant, and “photo opps with John.” \n“John fully supports ending the ruinous war on cannabis as he has seen the long term negative consequences that come with even a simple possession conviction such as the loss of economic opportunities and housing,” the group says in its event announcement. \nFetterman’s campaign website includes a copy of a recent Facebook post where he laments a shooting in his town over drugs. While he noted that the victim will likely survive, he accused current drug laws of leading to violence in communities. \n\"Shortly after telling a room of supporters why i believe we must legalize marijuana and end our nation's war on drugs, someone in my community was shot over... drugs,\" he posted. \n“When people ask why I am running for the Senate, there's the answer: so there's not one more life wasted or damaged in my community or yours, over this horribly misguided, failed policy,” he said . \n“Until these laws change, what about the next time? Will it be in your community? On your street? Your family? Will a small child get caught in the middle of it? Will we lock up perpetrators for 20, 30 or more years?” \nFetterman, once described by the Associated Press as a “6-foot-8, bald, tattooed, Harvard-educated mayor,” is running as the underdog candidate in the Pennsylvania primary race. Former Rep. Joe Sestak (D) was the only major candidate until Katie McGinty, a former top aide to Gov. Tom Wolf (D), jumped in this summer. Wolf just endorsed his former chief of staff on Monday. Tags:", "external_links": [], "published": "2015-09-29T01:15:00.000+03:00", "crawled": "2015-09-29T05:06:56.592+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}