{"organizations": [], "uuid": "9209188bc510f39a923d0a784c2fcf1672d13d57", "thread": {"site_full": "radio.foxnews.com", "main_image": "http://radio.foxnews.com/wp-content/uploads/2015/08/8-5-Obama2.jpg", "site_section": "http://radio.foxnews.com/category/talk/john-gibson-talk-radio/feed", "section_title": "FOX News Radio » John Gibson", "url": "http://radio.foxnews.com/2015/08/06/obama-channels-jon-stewart-grasps-at-new-low/", "country": "IL", "title": "OBAMA CHANNELS JON STEWART, GRASPS AT NEW LOW", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "OBAMA CHANNELS JON STEWART, GRASPS AT NEW LOW", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-06T19:12:00.000+03:00", "replies_count": 0, "uuid": "9209188bc510f39a923d0a784c2fcf1672d13d57"}, "author": "John Gibson", "url": "http://radio.foxnews.com/2015/08/06/obama-channels-jon-stewart-grasps-at-new-low/", "ord_in_thread": 0, "title": "OBAMA CHANNELS JON STEWART, GRASPS AT NEW LOW", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why Not Give Him Stewart's Job? He's Been Rehearsing For It. (AP Photo/Susan Walsh) \n  listen free/live on foxnewsradio app \nPresident Obama, we now know , has been the hand in the sock puppet named Jon Stewart. The secret White House meetings with Obama should tell us a lot about what’s been behind Stewart’s vicious attempted takedowns of anybody opposed to Obama. \nBut Stewart, retiring from his soapbox, is (as good as) gone. \nSo the President has to play Daily Show newsman/comic/agitator/slanderer all by himself. And when it comes to the last category–Slanderer-In-Chief–he’s demonstrated he has deep skills. \nYet nothing that has come before could possibly top yesterday. \nThat’s when the President, in a speech before a Jon Stewart audience at American University, said that opponents of his Iran deal–specifically American Republicans–are the same as the Mullahs in Tehran who chant “Death To America”. \nHe said: \n“Just because Iranian hardliners chant ‘Death to America’ does not mean that that’s what all Iranians believe. In fact…,” and here he was interrupted by applause from the Stewart-addled university audience. “In fact,” he continued after a pause, “it’s those hardliners who are most comfortable with the status quo. It’s those hardliners, chanting death to America, who have been most opposed to the deal. They’re making common cause with the Republican caucus .” (emphasis emphatically added.) \nClassic Stewart “take-down”: “ Hey did you notice those Republicans are the same as our worst enemies? ” \nNever mind the Democrats who have announced they will vote against the Iran deal. Never mind the Republicans who have questioned the inspection regime secretly negotiated between the Iranians and the U.N. Never mind Jewish-Americans (who have voted in support of Obama twice now) who fear the deal is a dagger to the heart and the existence of Israel. \nLump them all as one with the Ayatollah and his goose stepping mullahs who want us dead and want Israel dead. Make them co-conspirators with the sworn enemy. \nNot satisfied with a single insult, a solitary calumny, Obama poured it on: “You are going to hear a lot of arguments against this deal backed by tens of millions of dollars in advertising. If the rhetoric in these ads and the accompanying commentary sounds familiar, it should. Many of the same people who argued for the war in Iraq are now making the case against the Iran nuclear deal .” \nWhat is hard to ignore about the President when he goes out to make these obnoxious speeches is the audience he chooses. He doesn’t speak before adults, serious participants in the debate. He always chooses the Jon Stewart audience, the university crowd that goes to the Daily Show as a news source, and has been marinating in the stewpot of tenured university professor leftist rants. \nJust like Jon Stewart, President Obama specializes in shooting fish in the barrel. They both travel with their own barrel and their own fish. \nCheap tricks for an audience too immature to discern they are being treated like seals flapping their fins and barking for another treat from the slop bucket..", "external_links": [], "published": "2015-08-06T19:12:00.000+03:00", "crawled": "2015-08-07T00:55:06.494+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}