{"organizations": [], "uuid": "a5924e0a592d9d386d9179fe17ee6acc57b858f7", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/kevin-a-sabet-phd/corruption-in-latin-ameri_b_8119440.html", "country": "US", "title": "Corruption in Latin America and Marijuana Legalization: The Case of Ex-President Molina", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Corruption in Latin America and Marijuana Legalization: The Case of Ex-President Molina", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-11T03:56:00.000+03:00", "replies_count": 0, "uuid": "a5924e0a592d9d386d9179fe17ee6acc57b858f7"}, "author": "Kevin A. Sabet, Ph.D.", "url": "http://www.huffingtonpost.com/kevin-a-sabet-phd/corruption-in-latin-ameri_b_8119440.html", "ord_in_thread": 0, "title": "Corruption in Latin America and Marijuana Legalization: The Case of Ex-President Molina", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nCo-authored by Jeff Zinsmeister, Member of the Council on Foreign Relations \nThe rapid fall of the (now ex-) Guatemalan president Otto Fernandez Pérez Molina has already reverberated through the Americas. Its ultimate impact will surely be multifaceted, not just as an example of a possibly rising intolerance for corruption in parts of Latin America, but also of the beneficial synergy possible when an international organization like the United Nations works hand-in-hand with local institutions, instead of as a power imposed from abroad. And in neighboring countries like Mexico, where the people have trained their eyes on an administration increasingly implicated in impunity and organized crime, it represents a chance for change. \nAnd, curiously, Molina's disgrace reminds us of the dangers inherent to large-scale social programs carried out in corrupt environs. Molina, along with Uruguayan ex-president José Alberto Mujica, was one of the most aggressive and vocal proponents of drug legalization in the hemisphere. His proposal to legalize the production of marijuana and heroin poppy, with possible plantations of the latter along Guatemala's border with Mexico, represented a radical approach, supposedly to fight organized crime that has plagued that country for years. \nThe plan certainly was daring. There was, however, a small problem--President Molina was part of the very same organized crime that he theoretically wished to bring down. His racket, called \"The Line\" (\"La Línea\") assisted merchants with evading customs laws in exchange for bribes. Thus, a parallel network of politicians and criminals siphoned off money that would have ordinarily filled the state coffers through tariffs and other customs fees. \nIn such an environment, it is hard to conceive how one would legalize such a lucrative and harmful industry such as the sale of addictive substances without it being fatally compromised by corrupt public servants. If a chief of state like Molina (and his second-in-command, the also-disgraced Roxana Baldetti) managed to penetrate and coopt a service as basic as the customs service, how could one possibly prevent the same from happening with an opium or cannabis industry? \nRegrettably, other examples of collaboration between corrupt governments and traffickers of illegal, as well as legal, goods abound in the Americas. Parts of the Mexican government have existed symbiotically with the drug cartels since the latter's origins in the 20th century, a symbiosis that continues even today with the escape of the notorious Joaquín \"El Chapo\" Guzmán. These same cartels, incidentally, also thrive on legal lines of business. For example, there is evidence that the Zetas generate significant profits from smuggling cigarettes, accounting for up to 50% of their revenues. Similarly, on the other side of the country, the Knights Templar counted as some of their most profitable ventures iron ore mining, extortion, and logging. In other words, the fact that an industry is legal does not necessarily remove it from the clutches of the business underworld. \nAnd in more southern parts, political leaders in Paraguay--another country with very high levels of corruption--are intimately involved in the contraband cigarette business. High-ranking officials, including sitting President Horacio Manuel Cartes Jara, are shareholders of large tobacco companies that produce over 10 times the number of cigarettes that their country consumes. The large majority of that excess production is exported illegally through the porous border with Argentina and Brazil, facilitated by those businesses' political connections. With such a flow of illegal product entering its territory, one in every three cigarettes now sold in Brazil is contraband. \nThe case of Molina should thus encourage a skeptical view of facile comparisons between Uruguay and other American nations. The former, a relatively small country located far from major drug trafficking routes, enjoys low levels of corruption and a multiparty, stable government. (And even so, a majority of its voters oppose legalized marijuana.) To try and reproduce the same strategies in countries with serious corruption problems would very likely represent nothing more than a chance for drug traffickers to further enrich and empower themselves using the resources of the state. \nFollow Kevin A. Sabet, Ph.D. on Twitter: www.twitter.com/kevinsabet More:", "external_links": [], "published": "2015-09-11T03:56:00.000+03:00", "crawled": "2015-09-11T05:01:26.453+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}