{"organizations": [], "uuid": "0a8816e4280367ac405fcbaaa7b0088c070aefac", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55fb02961c00002500082639.jpeg?cache=0Rmx895bao", "site_section": "http://www.huffingtonpost.com/raw_feed_index.rdf", "section_title": "The Huffington Post | The Full Feed", "url": "http://www.huffingtonpost.com/entry/obama-immigrant-detention_55faff0ae4b08820d917bebd", "country": "US", "title": "Obama Administration Accused Of Violating Constitutional Rights Of Immigrant Detainees", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Accused Of Violating Constitutional Rights Of Immigrant Detainees", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-18T01:37:00.000+03:00", "replies_count": 0, "uuid": "0a8816e4280367ac405fcbaaa7b0088c070aefac"}, "author": "Elise Foley", "url": "http://www.huffingtonpost.com/entry/obama-immigrant-detention_55faff0ae4b08820d917bebd", "ord_in_thread": 0, "title": "Obama Administration Accused Of Violating Constitutional Rights Of Immigrant Detainees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Administration Accused Of Violating Constitutional Rights Of Immigrant Detainees A new report says conditions in immigrant detention centers are similar to those in prisons. Elise Foley Immigration & Politics Reporter, The Huffington Post Posted: 09/17/2015 06:37 PM EDT | Edited: 5 minutes ago \nWASHINGTON -- Immigrant detention facilities are violating detainees' civil and constitutional rights and failing to meet basic standards of treatment, according to a scathing report released Thursday by the U.S. Commission on Civil Rights. \nThe bipartisan commission , composed of four presidential appointees and four congressional appointees, urged President Barack Obama, Vice President Joe Biden and House Speaker John Boehner (R-Ohio) to limit immigrant detention as much as possible, particularly for women and children. \n\"All people, no matter whether they are immigrants or asylum-seekers, deserve to be treated as humans,\" Chairman Martin R. Castro, a Democrat who was appointed to the commission by Obama, said in a statement. \n\"Now, more than ever before, we need to treat fairly and humanely those persons, especially women and children, who are seeking sanctuary from violence and instability in their countries,\" he added. \nThe report builds on months of backlash to the Obama administration's use of family detention. Opponents have argued for years that immigrant detention, particularly of non-criminals, is overly punitive. Last year, the administration fueled that criticism by deciding to ramp up family detention, and critics are hoping to eventually end the practice altogether . \nThe USCCR report was approved by a vote of 5-2, with all four Democrats and an Independent voting in favor, and a Republican and an Independent dissenting. (The eighth commissioner recused herself.) Three of the commissioners who voted to approve the findings were appointed by Obama. \nThe report discusses the commissioners' visits to two detention centers in May: the Port Isabel Detention Center, an adult facility, and Karnes County Residential Center, which holds women and children. In those centers, the commission observed conditions similar to those of prisons, in violation of the civil rights of those inside. Because being in the U.S. without status is a civil, not a criminal, offense, the facilities are supposed to be different from punitive ones, but the report claims that the Department of Homeland Security detains \"many undocumented immigrants like their criminal counterparts in violation of a detained immigrant’s Fifth Amendment Rights.\" \nThe panel also alleges that the government is not complying with the Flores settlement , a 1997 agreement that children should be detained in the least restrictive setting possible. A judge ruled in July that the government was violating that settlement. DHS is appealing the ruling, but the commission argues that the department should stop its appeal and follow the order by immediately releasing the families. \nHowever, the report does acknowledge the administration's response to the ruling, in which the government argued that it is already making reforms to family detention, including releasing mothers and children at a quicker rate except under extreme circumstances, and is therefore not violating the Flores settlement. Eric Gay/Associated Press Detained immigrant children line up in the cafeteria at the Karnes County Residential Center, a family detention facility that was created last year. \nThe report states that DHS is violating detainees' civil rights and due process rights, in part by failing to provide them with adequate access to lawyers -- people in immigration proceedings have no guaranteed right to an attorney -- and information. In addition, the commissioners allege that DHS does not do enough to prevent and combat sexual abuse in the facilities, and say the agency should establish better procedures for reporting and make sure detainees who speak languages other than English and Spanish can communicate with officers. \nAlong with releasing family detainees, the commission recommends that the government use alternatives to detention more often when they could be monitored in less restrictive ways, such as bond or supervised release. It also advises Congress to put more money into alternatives to the detention facilities and to end a mandate that DHS maintain at least 34,000 detention beds. \nA spokesperson for DHS was not immediately available for comment. \nThe report was released the same day that members of Obama's party delivered their own rebuke of family detention: a bill from Rep. Raul Grijalva (D-Ariz.) and Sen. Bernie Sanders (I-Vt.), who caucuses with the Democrats, that seeks to end the use of private prison companies. Like the USCCR report, the bill recommends ending family detention and using alternatives more frequently, as well as eliminating the mandate to maintain 34,000 beds. \nUSCCR has shown its support for immigrant-friendly policies in the past, including by commending Obama for his deportation relief programs last year. Commission member Gail Heriot, an Independent, suggested in her dissent to Thursday's report that the commissioners started out with a bias against family detention. \nHeriot's dissent accuses the majority of relying too much on hearsay and news reports. She recounted her own observations of the facilities they visited and gave a far more favorable analysis, calling into question the veracity of the claims made about sexual assaults and other abuses reported. \n\"The Commission thus went into this project intent on uncovering a scandal,\" Heriot said. \"Instead of conducting an actual investigation, it structured its initial fact-finding simply to amplify stale rumor and innuendo. No effort was undertaken to establish whether the allegations -- all of which were already public -- were fact or fancy.\"", "external_links": [], "published": "2015-09-18T01:37:00.000+03:00", "crawled": "2015-09-18T01:48:09.139+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}