{"organizations": [], "uuid": "ecbd64a1d682d526d3a4489b11069ab8031a9413", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/richard-moe/obama-fdr-and-executive-p_b_8186218.html", "country": "US", "title": "Obama, FDR and Executive Powers | Richard Moe", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama, FDR and Executive Powers | Richard Moe", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-24T22:20:00.000+03:00", "replies_count": 0, "uuid": "ecbd64a1d682d526d3a4489b11069ab8031a9413"}, "author": "Richard Moe", "url": "http://www.huffingtonpost.com/richard-moe/obama-fdr-and-executive-p_b_8186218.html", "ord_in_thread": 0, "title": "Obama, FDR and Executive Powers | Richard Moe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Barack Obama and Franklin Delano Roosevelt came to the presidency from very different worlds and with very different temperaments, but they shared one defining trait: When the country was at risk and the Congress failed to act, the very cerebral Obama and the politically intuitive FDR both reached for and employed the executive powers inherent in the office to deal forcefully with the threats.\nMost presidents don't seriously consider using the full range of the executive authorities they have until their second term, when their party has usually lost either real or effective control of the Congress and their frustration with congressional gridlock has caused them to try to achieve their policy goals without legislation.\nFDR, who was probably more responsible than any other president for expanding the executive powers of the office, didn't wait until his second term. With the country facing the most serious economic emergency in its history, he ordered a \"bank holiday\" on his first day in office to prevent a panic-driven run on deposits. He continued to use his executive powers to create new agencies to provide relief and jobs for millions of desperate Americans.\nPresident Obama similarly issued executive orders early on to deal with the nation's greatest economic crisis since the Depression. The other major priority he identified early, however, was climate change, which, he believes, if not addressed will threaten not only life in this country but the future of the planet itself. Congress has refused to work constructively with the president to reduce the amount of carbon released into the atmosphere, the chief culprit of global warming. Consequently Obama has taken strong executive actions to address the issue by promoting energy conservation and the development and use of alternative energy sources as well as boosting fuel efficiency standards.\nMost recently and perhaps most significantly, the president has proposed new administrative regulations phasing out coal-powered generating plants and other measures designed to reduce carbon and methane emissions. With the same purpose in mind he has negotiated an unprecedented emissions agreement with China and he will almost certainly take equally bold initiatives to the Paris Climate Change Conference in December to achieve a historic international agreement on carbon.\nNowhere are a president's inherent powers more available than in his role as commander-in-chief, as Abraham Lincoln understood when he ordered Fort Sumter resupplied, an action which ignited the Civil War, or when he suspended habeas corpus soon afterwards, or when he signed the emancipation proclamation as a \"war measure.\"\nNearly a century later FDR, alarmed that Nazi Germany was on the march in Europe, shifted his attention to preparing for the war he believed was coming eventually to the United States. He was determined to build America's \"first line of defense\" through France and Great Britain. Despite strong isolationist opposition from the public and the Congress and sometimes over the objections of Gen. George Marshall and other top U.S. military advisors, he worked relentlessly, and sometimes secretly, to get to those countries the arms needed to survive.\nThe most important decision FDR made in 1940 was to put aside his plans for retirement and to seek an unprecedented third term; he couldn't find another Democrat who supported his policies and who could win the election, and with war coming he thought he had no choice but to run again. Once nominated and in the midst of a heated and close election, he found a way without seeking approval from Congress to respond to Winston Churchill's urgent pleas to send 50 World War One-era destroyers to Britain; it was another unprecedented action and one for which he thought he possibly could be impeached.\nShortly after his successful reelection, Roosevelt in effect codified his earlier and future actions when he persuaded Congress to enact Lend-Lease which gave the president extraordinary authority to send aid to Britain and other allies during World War II. In these two actions alone -- the destroyer deal and Lend-Lease -- he hugely expanded the powers of the president as commander-in-chief. His successors have used those powers liberally.\nSeventy-five years later President Obama believes the world is facing the possibility if not the likelihood of nuclear war should Iran succeed in developing a nuclear weapon -- a regional war whose consequences could easily spill over to the rest of the world. Despite united Republican opposition and some from his own party, he has used the full powers of his office to enlist other world powers to successfully negotiate an agreement with Iran to ensure that no such weapon could be developed for at least a decade.\nWhen presidents approach the end of their second terms they tend to focus on the most compelling items remaining on their agendas. If the Congress is unwilling to help them achieve their goals, the boldest of them reach for the executive authority inherent in the office that they have either developed themselves or discovered in the experience of their predecessors. That's what Franklin Roosevelt did in confronting the prospect of world war in 1940, and that's what Barack Obama is doing now to confront the most potentially calamitous threats of our own time. Not everyone approves, but in the end that is why we elect presidents - to take on the really big things.\n- - - - - - - - - - - - - - - - - - - - - - - -\nRichard Moe was chief of staff to Vice President Walter Mondale and a member of President Jimmy Carter's senior staff from 1977 to 1981. The paperback edition of his book, Roosevelt's Second Act - The Election of 1940 and the Politics of War, was published earlier this month by Oxford University Press.\nMore: Barack Obama Fdr Climate Change Obama Climate Change FDR Climate Change Politics Climate Change", "external_links": [], "published": "2015-09-24T22:20:00.000+03:00", "crawled": "2015-09-24T22:19:44.673+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}