{"organizations": [], "uuid": "707513b96b06cd473edaa716333725ca2aa81035", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/861318/images/o-US-CARBON-TAX-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/bob-brecha/obama-epa-clean-power-plan_b_7968584.html", "country": "US", "title": "Why the Obama EPA Clean Power Plan Will Help Correct Energy System Market Failures | Bob Brecha", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Why the Obama EPA Clean Power Plan Will Help Correct Energy System Market Failures | Bob Brecha", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-11T20:06:00.000+03:00", "replies_count": 0, "uuid": "707513b96b06cd473edaa716333725ca2aa81035"}, "author": "Bob Brecha", "url": "http://www.huffingtonpost.com/bob-brecha/obama-epa-clean-power-plan_b_7968584.html", "ord_in_thread": 0, "title": "Why the Obama EPA Clean Power Plan Will Help Correct Energy System Market Failures | Bob Brecha", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Although the dust has not yet settled on the announcement of finalized Clean Power Plan rules , and there are sure to be many years of court challenges, in its broad outlines one point is clear: the Environmental Protection Agency (EPA) will be taking a first major step toward correcting serious distortions in the United States energy market. It seems important to make clear how there are real costs to citizens for these market failures, even if those costs tend to be hidden from our everyday experience and from our monthly energy bills.\nCommentators being honest about the Clean Power Plan (CPP) have pointed out that the benefits outweigh the costs by a ratio of four- or five-to-one. Although one can criticize on over-reliance on cost-benefit analyses for making decisions about climate change mitigation (for example, instead one can set a target based on the best scientific estimates, and then figure out how best to reach that goal - cost-effectiveness analysis) the case is clearly made by the EPA that these rules are going to save our society money.\nIn 2010, the National Research Council of the National Academy of Sciences produced a report, \" Hidden Costs of Energy: Unpriced Consequences of Energy Production and Use .\" In this report, details of non-climate and climate-related costs of our current (U.S.) energy system were tallied. Nobody would deny that the energy system has provided societies around the world with current levels of well-being. However, too often the \"negative external\" costs of business-as-usual have been ignored as we plan for a long-term sustainable energy system. It is precisely these costs that are the subject of the NRC report.\nLet's start with a baseline set of numbers. Across the US, the average price for electricity for a household is about 13¢/kWh, which translates into $120/month for the average household using 11,000 kWh/year.\nAccording to the NRC report, the hidden costs, on average, from coal-fired power amounts to 3¢/kWh, or more than $300 per household per year. These are costs we pay because of damages to health and well-being, but are not part of our utility bill. The authors also found that only 10% of the coal-fired plants account for over 40% of the damages; there are (or were, as some of these are now being driven out of business) some really bad actors. If climate change is taken into account, and using the current moderate federal government estimate for the social cost of carbon emissions , an additional 4¢/kWh, or $35 per month would have to be added to the cost of coal-fired electricity.\nOverall, the cost of coal electricity would have to increase by 50% if we were to properly take into account real costs incurred by society. Put another way, by not including these costs in the price of electricity, we are essentially subsidizing the fossil-fuel industry.\nIn a more recent and more broadly-based study quantifying the Social Cost of Atmospheric Release (SCAR) of a variety of pollutants in addition to carbon dioxide, Drew Shindell of the Nicholas School of the Environment at Duke University arrives at negative external costs for coal-fired electricity of 14-34¢/kWh - proper accounting would double or triple the price of electricity from coal according to this study (in the journal Climatic Change DOI 10.1007/s10584-015-1343-0).\nAlthough the strongest effects of the CPP will be on coal-fired electricity generation, the NRC \"Hidden Costs\" report and work by Shindell and others (for example here ) has implications for the rest of the fossil-fuel based energy system. For example, the NRC estimates non-climate costs for personal vehicle transportation of about 25¢/gallon of gasoline, and using a carbon price of $37/ton of CO2 translates into an additional 33¢/gallon. Therefore we should be adding 60¢/gallon to the price of gasoline if we want to cover the true costs. Shindell finds a much higher external cost of $3.80/gallon (!) for gasoline.\nThe main point of this exercise is to emphasize the need for a more careful accounting of true costs of our current energy system before we succumb to the argument that moving toward a renewable, sustainable energy future is too expensive. Comparing the costs of renewables (as do both the NRC and Shindell) shows that it is increasingly difficult to make a rational economic case for continued support of fossil fuels. The Clean Power Plan makes a step in the right direction by gently, and with flexibility, encouraging states to transition away from at least one fossil fuel over time.\nFollow Bob Brecha on Twitter: www.twitter.com/BobBrecha\nMore: Clean Power Plan Sustainable Energy Negative Externality Coal Power Plants", "external_links": ["http://www.epa.gov/cleanpowerplan/", "http://www.epa.gov/climatechange/EPAactivities/economics/scc.html", "http://www.nap.edu/catalog.php?record_id=12794", "http://news.stanford.edu/news/2015/january/emissions-social-costs-011215.html", "http://www.twitter.com/BobBrecha"], "published": "2015-08-11T20:06:00.000+03:00", "crawled": "2015-08-11T20:18:13.617+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}