{"organizations": [], "uuid": "358cca98b74c10170943f79d4cac61d2a278b261", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaaddress081515.png", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/251653-obama-to-pitch-iran-deal-directly-to-jewish-americans", "country": "US", "title": "Obama to pitch Iran deal directly to Jewish Americans", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to pitch Iran deal directly to Jewish Americans", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-21T18:46:00.000+03:00", "replies_count": 0, "uuid": "358cca98b74c10170943f79d4cac61d2a278b261"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/251653-obama-to-pitch-iran-deal-directly-to-jewish-americans", "ord_in_thread": 0, "title": "Obama to pitch Iran deal directly to Jewish Americans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to pitch Iran deal directly to Jewish Americans By Jordan Fabian - 08/21/15 11:46 AM EDT President Obama will make his case for the Iran nuclear deal directly to American Jews with a webcast planned for next Friday. Obama will deliver remarks and take questions during the live online event co-sponsored by the Conference of Presidents of Major American Jewish Organizations and the Jewish Federations of North America. The webcast is part of an aggressive White House effort to win support for the nuclear accord ahead of a key congressional vote next month. Facing near unanimous Republican opposition, groups for and against the deal have focused on lobbying undecided Democratic lawmakers, many of whom represent heavily Jewish districts. Israeli Prime Minister Benjamin Netanyahu earlier this month participated in a similar webcast, calling on American Jews to oppose the deal. He recently spent almost two hours making his case to a group of House Democrats on a trip to Israel. \nSecretary of State John Kerry and Energy Secretary Ernest Moniz, the top two U.S. negotiators, appeared on similar webcasts to urge U.S. Jews to back the deal. Obama met behind closed doors with leaders of major American Jewish groups two weeks ago to address concerns the pact could endanger Israel's security. The White House scored a significant victory on Friday when Rep. Jerry Nadler, a prominent New York Jewish Democrat, came out in support of the deal. Sen. Charles Schumer (D), another influential New York lawmaker and currently the longest-tenured Jewish lawmaker, bucked Obama by coming out against the accord earlier this month.", "external_links": [], "published": "2015-08-21T18:46:00.000+03:00", "crawled": "2015-08-21T19:03:50.377+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}