{"organizations": [], "uuid": "6864141e0456262910dbe23027188471fda36c68", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/rockobamack.png", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/in-the-know/253071-louis-ck-chris-rock-join-obama-community-college-initiative", "country": "", "title": "Louis CK, Chris Rock join Obama community college initiative | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Louis CK, Chris Rock join Obama community college initiative | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-09T20:56:00.000+03:00", "replies_count": 0, "uuid": "6864141e0456262910dbe23027188471fda36c68"}, "author": "", "url": "http://thehill.com/blogs/in-the-know/253071-louis-ck-chris-rock-join-obama-community-college-initiative", "ord_in_thread": 0, "title": "Louis CK, Chris Rock join Obama community college initiative | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 09, 2015, 01:18 pm Louis CK, Chris Rock join Obama community college initiative By Jordan Fabian \nLet's make two years of community college as free and universal as high school is today. Watch this message from President Obama, and join the movement at http://HeadsUpAmerica.us/act . Posted by The White House on Wednesday, September 9, 2015 \nLouis C.K. and Chris Rock are getting serious about one of President Obama’s top causes. The comedians are teaming up with other celebrities on a campaign, titled Heads Up America, promoting Obama’s free community college initiative. \nThe White House released a brief public service announcement on Wednesday featuring Louis C.K., Rock, comic actor and former Obama staffer Kal Penn and actress Amandla Stenberg. ADVERTISEMENT Obama also appears in a separate 90-second video plugging his plan, which would offer free community college tuition to more than 9 million Americans. “A higher education shouldn’t mean taking on a lifetime of debt,” he says. “It’s hard to get ahead when you start so far behind. That’s why I want to make two years of community college education free for responsible students.”The videos are part of a multiday effort by the White House to sell the program, which is stalled in Congress. Obama is traveling to Warren, Mich., with Vice President Biden's wife, Jill Biden, a community college professor, to promote the plan. He will travel to the early-voting state of Iowa next Monday. Republican lawmakers have balked at the cost of the $60 billion proposal, which Obama unveiled in his State of the Union address. Tags: Past: 1 day House GOP to postpone vote on Iran... House Republicans will now meet at 4 p.m. to discuss strategy. Trump calls on CNN to donate... He sent a letter to CNN president Jeff Zucker insisting that he share the... WATCH LIVE: Trump, Cruz rally... The GOP presidential rivals are headlining a rally at the Capitol. Trump on Black Lives Matter: 'I... Trump says activists with group are promoting \"hate.\" Trump storms Capitol for Iran... Trump, Cruz and others will rally in a show of force against the Iran... Climate change: Seven indisputable... President Obama last week visited Alaska to preach about the inevitable... Sanders to roll out criminal... Sanders called the current system \"broken.\" Software pioneer McAfee files... McAfee reportedly would be “founding a new party yet to be announced.” House GOP faces shutdown crisis Heritage Action claims at least 28 Republicans will demand end to Planned... Juan Williams: #BlackLivesMatter... OPINION | The movement is fast becoming its own worst enemy. Biden road-tests 2016 message The vice president insists he has not made up his mind on a run. Feds: Highway funding will last... The update could give lawmakers more room to pass a temporary road funding... Carson: It’s going to be hard to... Ben Carson tells The Hill that he's embracing the role of underdog. Bush on Colbert: 'Jeb!' logo... The GOP candidate said his brother didn't control spending while in office. Murdoch: Biden 'very likely' wins... “Looks like Biden already running,” the media mogul tweeted. Supreme leader: Iran won't again... “We agreed to hold talks with America only on the nuclear issue,\" Khamenei. Mia Love: I billed taxpayers for... The freshman congresswoman had been reimbursed $1,160 for flights between... Rubio: Trump 'should run as a... Rubio is blasting Trump's call for the wealthy and hedge funds to pay more... ", "external_links": [], "published": "2015-09-09T20:56:00.000+03:00", "crawled": "2015-09-09T20:56:42.967+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}