{"organizations": [], "uuid": "419594f1bca94786a9fe62fa0ac329e77c5a3bcb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/mcconnellmitch_080615gn3.jpg", "site_section": "http://thehill.com/taxonomy/term/36/feed#", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/blogs/floor-action/senate/250436-mcconnell-obama-gambling-with-iran-deal", "country": "US", "title": "McConnell: Obama 'gambling' with Iran deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McConnell: Obama 'gambling' with Iran deal", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-06T20:29:00.000+03:00", "replies_count": 0, "uuid": "419594f1bca94786a9fe62fa0ac329e77c5a3bcb"}, "author": "jcarney@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/senate/250436-mcconnell-obama-gambling-with-iran-deal", "ord_in_thread": 0, "title": "McConnell: Obama 'gambling' with Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 06, 2015, 01:29 pm McConnell: Obama 'gambling' with Iran deal By Jordain Carney Senate Majority Leader Mitch McConnell (R-Ky.) slammed President Obama on Thursday, taking a closing swipe on the Iran nuclear deal before heading out of Washington for a five-week recess. \"I mean he is gambling that this is going to completely transform the Middle East,\" the Republican leader told reporters. \"It has the potential to transform the Middle East all right, but it strikes me as not into a safer Middle East but one more racked with discord.\" ADVERTISEMENT McConnell, who has repeatedly voiced his doubts about the deal, moved Wednesday to set up a Senate vote on the deal for when lawmakers return to Washington in September. Lawmakers have until Sept. 17 to pass legislation and until early October to try to override a promised veto from President Obama. Republicans have largely lined up against the Iran nuclear deal ahead of the vote, arguing that rejecting the deal could force Iran to negotiate a better one. McConnell doubled down on that Thursday, dismissing the administration's diplomacy-versus-war narrative as \"an absurd argument.\" \"That's never been the alternative,\" he said. \"It's either this deal or a better deal, or more sanctions, and I think that's been a huge mistake on his part.\" McConnell and other leading Republicans have criticized the Obama administration's rhetoric on the nuclear deal, suggesting officials are trying to back Congress into a corner. Sen. Bob Corker (R-Tenn.), the Foreign Relations Committee chairman, said earlier Thursday that recent comments by President Obama, including his speech on Wednesday in Washington, were aimed at \"trying to shut down\" Congress's debate. McConnell echoed that on Thursday, saying that the president \"ought to treat this like a serious national security debate rather than a political campaign.\"", "external_links": [], "published": "2015-08-06T20:29:00.000+03:00", "crawled": "2015-08-06T22:44:22.814+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}