{"organizations": [], "uuid": "2b4ace1b16adc87887ff53ef81cf0f6b9c7c5258", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/251076-obama-can-still-do-something-for-peace-in-the-middle-east", "country": "US", "title": "Obama can still do something for peace in the Middle East", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama can still do something for peace in the Middle East", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-17T15:00:00.000+03:00", "replies_count": 0, "uuid": "2b4ace1b16adc87887ff53ef81cf0f6b9c7c5258"}, "author": "Mustafa Barghouti", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/251076-obama-can-still-do-something-for-peace-in-the-middle-east", "ord_in_thread": 0, "title": "Obama can still do something for peace in the Middle East", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 17, 2015, 08:00 am Obama can still do something for peace in the Middle East By Mustafa Barghouti \nPresident Barack Obama and Secretary of State John Kerry have in the past year led two of the most astonishing breakthroughs in American foreign policy in my lifetime. Opening relations between the U.S. and Cuba – decades after the two and the Soviet Union almost ended the world as we know it with a nuclear conflagration – and reaching an agreement on Iran’s nuclear program that could pave the way to improved connections between the two countries after 36 years of enmity, are developments to be hailed and hopefully preserved and expanded upon by the American, Cuban, and Iranian people. \nSeveral years ago I met with then-Senator Kerry in Washington, DC to discuss the Israeli-Palestinian issue. I found him to be engaged, well-informed, and determined to take action where he could to advance freedom, human rights, and peace. I also understand that entering office Obama had a better understanding of the Palestinian plight – dispossession followed by occupation – of any incoming American president. ADVERTISEMENT Following the impressive diplomatic successes of the past year, it is my hope that the two will spend part of the last 18 months of the Obama presidency in vigorously pressing Prime Minister Benjamin Netanyahu to end illegal settlement activity, occupation, and the cruel siege devastating Gaza. Netanyahu – an expansionist, opponent of the two-state solution, and demagogue willing to stoke Jewish fears of Palestinian citizens of Israel merely exercising their right to vote – will not sign a peace deal, but he should be pressured to end the worst of Israel’s actions in advance of a different Israeli leader more like President F.W. de Klerk of South Africa. \nObama has made remarkable strides on Cuba and Iran. To help achieve Palestinian freedom would secure his place as one of the great peacemaking presidents of any era. But the task is daunting and the expected increase in military aid to Israel does not help. Israeli policy of war and settlement has caused much harm to the prospects of real peace, already fading, in just the past two years. Recall that in April 2013 Sec. Kerry asserted , \"I believe the window for a two-state solution is shutting.\" He added, \"I think we have some period of time – a year to year-and-a-half to two years, or it's over.\" \nSix years ago, I asked in the Los Angeles Times whether the Obama administration would “have the courage to challenge Netanyahu, or will all the talk of change dissolve in the face of a concerted one-two punch from Netanyahu and the American Israel Public Affairs Committee.” I added that I was increasingly “convinced that if Obama fails to speak out now, it will doom the two-state solution forever” and that by the time “Obama leaves office, it will be too late to salvage anything more than an archipelago of Palestinian Bantustans.” In the years since, I have made clear that if two states fail, we will be looking at entrenched apartheid or a new movement for one state with equal rights for all. \nThere are two principal steps Obama should take in his remaining time in office to help advance self-determination for Palestinians. The underlying principles are to buoy Palestinian nonviolence and to make clear to Israel that it no longer has impunity and American backing to carry out whatever outrage its right-wing leadership deems appropriate. \nFirst, the U.S. should not impede or pressure the Palestinian Authority over the decision to take our human rights concerns to the International Criminal Court. It’s far better to adjudicate disputes than to “settle” them through further bloodshed. Neutral legal arbiters are preferable to Israel’s whitewash investigations that we all know will clear Israel of wrongdoing while slapping a wrist or two for stealing – even as the murderers of women and children in their homes and on the beaches of Gaza are exonerated. \nSecond, the Boycott, Divestment, and Sanctions (BDS) movement for Palestinian freedom and equality should not be undercut with legislation but embraced. Obama in his 2009 speech in Cairo indicated that Palestinians should reject violence and seize on nonviolence to effect change. The State Department recently voiced opposition to BDS, but left the door open to BDS targeting illegal settlements. This is a tentative start, but broader efforts are needed. \nWhen Haim Saban, a major Democratic donor, and Hillary Clinton begin to push more this fall against BDS – as Clinton recently wrote she would – the administration should not join the effort, but recognize that Democrats increasingly support Palestinian rights and BDS according to the latest polls . It’s unacceptable to tell Palestinians that both violence and nonviolence are rejected by the US and that they should put their faith solely in negotiations with a prime minister who has stated his clear opposition to the two-state solution. \nFreedom, human rights, and dignity are values that can't be compromised. All people on the planet are entitled to them, including the Palestinian people, even if that upsets the Israeli establishment. \nIt is my hope that one message can get to Obama: When we struggle for our freedom – whether in marches, civil protests, hunger strikes, or BDS – we are struggling to liberate not only the Palestinians but also the Israelis from a system of Apartheid and oppression. Obama should support this struggle for the future of both people. \nBarghouti, a member of the Palestinian Legislative Council, is a human rights activist and leader of the Palestinian National Initiative.", "external_links": [], "published": "2015-08-17T15:00:00.000+03:00", "crawled": "2015-08-17T17:55:19.575+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}