{"organizations": [], "uuid": "a947ed58a8728e6320847e807bcb3c867022533e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/dr-josef-olmert/the-duelobama-is-leading-_b_7942624.html", "country": "US", "title": "The Duel: Obama Is Leading by Points | Dr. Josef Olmert", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The Duel: Obama Is Leading by Points | Dr. Josef Olmert", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-07T01:23:00.000+03:00", "replies_count": 0, "uuid": "a947ed58a8728e6320847e807bcb3c867022533e"}, "author": "Dr. Josef Olmert", "url": "http://www.huffingtonpost.com/dr-josef-olmert/the-duelobama-is-leading-_b_7942624.html", "ord_in_thread": 0, "title": "The Duel: Obama Is Leading by Points | Dr. Josef Olmert", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "P.M. Netanyahu spoke yesterday, President Obama today. It amounts to a 15-round boxing match, and while we are not yet close to the last round, the cumulative impression is that the president has the advantage, and he may be increasing his lead.\nThe P.M. spoke yesterday from Jerusalem to thousands of Jewish leaders. Something to be expected, but there is something else here, which is at play, and one which was considered impossible just until very recently. It is the fact, that the polls show that the Jewish community in the U.S. is split down the middle over an issue which Netanyahu claims is existential to Israel. Existential or not, many American Jews, including great supporters of Israel, are not convinced. Netanyahu may be paying here the price for the Congress speech from 3 March, something which this blog forewarned about. But in fairness to the P.M., it is really a reflection of much deeper developments among American Jews -- which can be attributed to many factors -- and Israeli policies are just one of them, not necessarily the most important one.\nPresident Obama is well aware of the predicament of the P.M. and he lashes out mercilessly and effectively. In a debate of that kind, when so much is at stake, not least personal considerations and issues of historic legacy, truth is not always what really guides the participants. Netanyahu said three years back, in the UN General Assembly, that Iran was almost there, and yesterday he too referred to a period of ten years, as envisaged by the agreement. The president said that Israel is the only country in the world objecting to this agreement. Has he talked recently to some of his Arab allies, starting with not-the-insignificant Saudis? One does not need to know Arabic to understand the extent of opposition in many Arab countries. One does not need also to be a great Arab expert to realize that the claim that the agreement will bring more stability to the region is a fantasy from la-la land. In fact, things are getting ever closer to the boiling pot in Syria, Iraq, possibly Jordan and Lebanon, and Turkey is up in arms. I, for one, do not see stability descending on the region; rather a free-for-all struggle, in which the Sunni world will do whatever it takes to stop the Shi'ite-Iranian stampede towards mastery in the region. This is a much safer bet than anything that the advocates of the agreement can present in its support.\nSo where is the advantage of the president? Surely, this is a bad agreement, full of secret clauses which are so because they cannot be sold to the public; but beyond that, this is what we already know about the agreement -- which shows that a Camembert cheese has less holes in it than the regime of supervision over the Iranian program.\nThe president is leading by points, on his way to a knockout victory, because of some other points used by him: First, the talk about war as the only alternative to the agreement. Not so, and it is simply the case that there was no war until now without an agreement, so why now? The only scenario of war is possible because Iran may get stronger as a result of the agreement, with more funds to waste and self-confidence, a very bad combination when dealing with a rogue regime like that in Tehran. That said, the warning about war is immensely effective and will prove crucial. The president talks to the American people in this regard, and he tells many more people than not precisely what they want to hear. Second, there is an agreement, so the natural question is, if there is an opposition to the agreement, then what and where is the alternative? Netanyahu uses so many apocalypse now arguments instead of mundane arguments contradicting the many loopholes of the agreement. It is less dramatic to use such language, but maybe in this case, simply more effective. Third, by evading a more technical/specific discussion of the weakness of the agreement, the P.M. is closing the door on the possibility of any fruitful dialogue with the American administration, turning it into a take-it-or-leave-it situation. The objective equation of capabilities is against Israel, and in favor of the Obama administration. Maybe painful, but simple truth.\nThe duel, so we are told, can be confined only to the one issue. Another illusion on the part of some, as the tone makes the music, and the tones used by the two leaders are such that the acrimony will become contagious and spread to other areas of the relationships. The tone, by the way, is followed by other, much less responsible politicians than Obama and Netanyahu, who try to take the debate to places where it should not be. Is Obama leading Israel to another Auschwitz, as candidate Huckabee said? Well, this is nonsense, because this is not what Obama is doing, but also because it is an insult to Israel itself. Netanyahu is the first to argue, and rightly so, that Israel knows how to defend itself. He and his predecessors proved the point so many times before, but now it is incumbent upon him to fight the right battle in the diplomatic/political/PR front. He does not, while President Obama does.\nMore: US Iran Nuclear Deal US Iran Deal Middle East Foreign Policy Israel Nuclear Weapons Barack Obama Benjamin Netanyahu", "external_links": [], "published": "2015-08-07T01:23:00.000+03:00", "crawled": "2015-08-07T01:30:54.864+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}