{"organizations": [], "uuid": "d5d664c1d4200516f4dd905722d277e412b506eb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarackasiachina_043014getty.jpg", "site_section": "http://thehill.com/taxonomy/term/29764/feed", "section_title": "The Hill: Cybersecurity", "url": "http://thehill.com/policy/cybersecurity/252720-lawmakers-press-obama-to-sanction-china", "country": "US", "title": "Lawmakers press Obama to sanction China", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Lawmakers press Obama to sanction China", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-03T23:21:00.000+03:00", "replies_count": 0, "uuid": "d5d664c1d4200516f4dd905722d277e412b506eb"}, "author": "kwilliams@thehill.com (Katie Bo Williams)", "url": "http://thehill.com/policy/cybersecurity/252720-lawmakers-press-obama-to-sanction-china", "ord_in_thread": 0, "title": "Lawmakers press Obama to sanction China", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lawmakers press Obama to sanction China Getty Images By Katie Bo Williams - 09/03/15 04:21 PM EDT \nReps. Joe Wilson (R-S.C.) and J. Randy Forbes (R-Va.) on Thursday called on President Obama to impose economic sanctions on China “to let the world know that state sponsored hacking will have tangible repercussions.” \nIn a letter to the White House, Wilson and Forbes pointed to mounting evidence of Beijing’s active promotion of cyber espionage, specifically its alleged hack on the Office of Personnel Management (OPM). ADVERTISEMENT The congressmen said the White House has pursued an “incoherent deterrent strategy” when it comes to state-backed cyber espionage. \nWhile Obama authorized additional sanctions for certain North Korean officials in response to the attack on Sony Pictures, the representatives said he has taken no such action against the five Chinese military hackers indicted on economic espionage charges in 2014. \nSome observers say it’s unlikely the five members of the People’s Liberation Army charged in 2014 will ever see the inside of a U.S. court room, and that the purpose of the indictments was simply to send a diplomatic warning. \n“A clear and unwavering line needs to be drawn by your Administration in protecting the intellectual property and personal data of U.S. based companies, as well as government data and personnel information,” Wilson and Forbes wrote. \nThe representatives’ call comes in the wake of recent White House leaks that revealed the administration is developing possible economic sanctions to use as a tool to deter China cyber spying. \nThe unnamed White House sources suggested that those sanctions would most likely be targeted at Chinese companies, not Beijing — and that the OPM hack would not be one of the actions subject to sanctions. \nPolicy experts say there is a critical distinction between hacking for commercial gain and hacking for traditional intelligence purposes. Most reports indicate that the sanctions would address only the former. \nThe president has been under increasing pressure to take a more offensive stance on cyber espionage where China is concerned, with rhetoric amongst D.C. lawmakers reaching a fever pitch in the wake of the OPM hack. \n“One of the conclusions we’ve reached is that we need to be a bit more public about our responses, and one reason is deterrence,” a White House official told The New York Times in an oft-quoted interview on administration policy. “We need to disrupt and deter what our adversaries are doing in cyberspace, and that means you need a full range of tools to tailor a response.” \n“We strongly urge your Administration, in consultation with the Treasury Department, to apply punitive economic sanctions to entities and individuals conducting cyberattacks to punish and deter such action,” Wilson and Forbes wrote.", "external_links": [], "published": "2015-09-03T23:21:00.000+03:00", "crawled": "2015-09-03T23:49:04.487+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}