{"organizations": [], "uuid": "610c2feb0da1a76818b05ef5149805837806bc4b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3201060/images/o-LATINO-CHILDREN-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/blog.xml", "section_title": "Latino Voices Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/lizet-ocampo/misleading-rhetoric-from-_b_7945356.html", "country": "US", "title": "Misleading Rhetoric From Republican Candidates and Congressional Leaders Distracts From Real Immigration Solution | Lizet Ocampo", "performance_score": 6, "site": "huffingtonpost.com", "participants_count": 5, "title_full": "Misleading Rhetoric From Republican Candidates and Congressional Leaders Distracts From Real Immigration Solution | Lizet Ocampo", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-06T07:44:00.000+03:00", "replies_count": 5, "uuid": "3bde7c938abd728ae1581104bff0862d861059f6"}, "author": "Lizet Ocampo", "url": "http://www.huffingtonpost.com/lizet-ocampo/misleading-rhetoric-from-_b_7945356.html#post-0", "ord_in_thread": 0, "title": "Misleading Rhetoric From Republican Candidates and Congressional Leaders Distracts From Real Immigration Solution | Lizet Ocampo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration is back in the center of the spotlight both on the campaign trail and in Congress. In fact, until yesterday, the Senate Judiciary Committee was slated to consider a Republican enforcement-only bill today. Instead they adjourned early for August recess with a promise to take the issue up again in September. However, today's much-anticipated first 2016 Republican primary debate will surely focus on immigration.\nLeading up to the debate, we've heard much rhetoric from Republican presidential hopefuls that feeds into negative, untrue stereotypes of undocumented individuals. While Republican leaders have spread mischaracterizations for a while, they have gone into overdrive following Donald Trump's comments : \"When Mexico sends its people...They're bringing drugs. They're bringing crime. They're rapists. And some, I assume, are good people.\" Since then, by ratcheting up their overt anti-immigrant oratory or somewhat subtle tough-on-immigration stances to appeal to a segment of the conservative base, other candidates and leaders have confirmed that Trump is saying what they think. In fact, once considered a potential supporter of comprehensive immigration reform with a pathway to citizenship, Jeb Bush has also doubled down on border security and enforcement -- the focus of his six-point immigration plan released two days ago. When it comes to the 11 million, Bush beats around the bush. He has not endorsing a path to citizenship for the 11 million and instead offers a myopic focus on enforcement.\nFacts matter, or at least they should to anyone who wants to occupy the Oval Office. So let's look at how reality conflicts with what candidates presume is true.\nThe border is more secure than ever before. Resources and boots on the ground are at an all-time high, and border crossings have dropped dramatically to a 40-year low. The bi-partisancomprehensive immigration reform bill that passed the U.S. Senate would have added even more resources and agents to the border, about 80 percent more, and provide a total of 700 miles of fencing, along with increased border enforcement technology. The \"secure the border first\" talking point is a dishonest political posture, not to mention also vague and lacking of realistic implementation metrics.\nImmigrants are less likely to commit crimes than native-born Americans . The Trump-driven mentality is flashy but is not based in facts. Unfortunately, Republican leaders in Congress have ignored the reality and instead opted to pass for what many are calling \"The Donald Trump Act\" in the House. Sadly, this mentality has reached the Senate. The Republican-controlled Senate Judiciary Committee was scheduled to markup Senator David Vitter's bill today that undermines community trust policies . Postponed now until September 10, it will be the first time the committee marks up an immigration bill since the markup of S.744 over two years ago, the bipartisan comprehensive immigration reform bill. Similar to the House bill, the Republican Senate bill presumes to know more than local law enforcement about community safety and reprimands hundreds of states, localities and law enforcement agencies across the country for working with their communities to keep them safe. Ironically, the reason why these policies exist is because of the lack of comprehensive reform - the Republican Congress wants to penalize jurisdictions for trying to address an issue that Congress has failed to address.\nHouse Republicans blocked the solution when they let the comprehensive reform bill die. The bipartisan Senate passed bill would allow individuals with longstanding ties to the community to come forward, register with the government and begin on an earned pathway to citizenship. As such, the pool of people on which the government does not have information on would shrink, allowing the federal government to focus its resources. After lack of Congressional action, last November President Obama announced programs that provide a temporary, narrow solution and a step forward on security -- the expansion of the Deferred Action for Childhood Arrivals, or DACA, focused on DREAMers and the creation of Deferred Action for Parents of Americans and Lawful Permanent Residents, or DAPA, for parents of U.S. citizen or legal permanent resident children. We'd be well underway with a case-by-case review of the programs' applicants and towards important economic gains but a lawsuit is preventing implementation - a lawsuit whose signatories are all Republican leaders strategically placed in the most conservative courts.\nThe public is way ahead of politicians. Time and time again, these Republican leaders both in Congress and in the Presidential campaigns are ignoring the three in four Americans who oppose an enforcement-only approach and the sixty percent who support a pathway to citizenship. They are ignoring that comprehensive immigration reform with a pathway to citizenship would provide significant gains to our economy, increase GDP by 1.2 trillion, increase the income of all Americans by $625 billion and create 145,000 jobs per year, over 10 years. They are ignoring the millions and millions of families who would be torn apart, the mothers, fathers and children -- many U.S. Citizens -- who live in fear every day. They are ignoring what's best for their constituents and the country. They are ignoring and delaying a real solution -- but they are sure listening to Donald Trump. Or, is this increased rhetoric exposing what key Republican leaders have thought all along? Now, faced with trying to win over the most conservative wing of the Republican Party, Donald Trump's GOP has made the immigrant community an adversary and punching bag. That's not the way to win in November and certainly a major step away from comprehensive solutions to bring our immigration system to the 21st Century.\nLizet Ocampo is the Associate Director for Immigration Policy at the Center for American Policy.\nMore: Immigration Immigration Reform Immigrants Republicans House Republicans Immigration Undocumented Immigrants", "external_links": ["http://www.washingtonpost.com/blogs/fact-checker/wp/2015/07/08/donald-trumps-false-comments-connecting-mexican-immigrants-and-crime/", "http://talkingpointsmemo.com/cafe/federal-courts-matter-and-conservatives-know-it", "http://www.washingtonpost.com/politics/republican-contenders-scrambling-to-adjust-to-trumpism/2015/07/22/910d977c-30d6-11e5-a879-213078d03dd3_story.html", "http://americasvoice.org/press_releases/memo-speaker-boehner-house-gop-dont-like-president-obamas-executive-action-immigration-bring-comprehensive-immigration-reform-vote-year-pass-th/", "https://www.americanprogress.org/issues/immigration/news/2015/07/20/117772/federal-local-coordination-on-immigration-enforcement-prioritizing-public-safety/", "https://www.americanprogress.org/issues/immigration/news/2015/06/15/114894/state-by-state-analysis-of-the-economic-impact-of-daca-dapa-and-daca-expansion/", "http://immigrationpolicy.org/special-reports/criminalization-immigration-united-states", "https://www.americanprogress.org/issues/immigration/news/2015/04/09/110589/infographic-inaction-on-immigration-is-too-costly/", "http://www.nbcnews.com/news/latino/gops-donald-trump-revives-decade-old-immigration-plan-n401306", "https://www.whitehouse.gov/blog/2014/11/21/chart-week-our-border-more-secure-it-has-been-decades", "http://americasvoice.org/press_releases/depth-polling-shows-republicans-pandering-19-american-public-immigration/", "http://www.voanews.com/content/republican-candidates-focus-on-immigration-ahead-of-first-debate/2899192.html", "http://www.judiciary.senate.gov/meetings/executive-business-meeting-08-06-15", "http://www.immigrationpolicy.org/special-reports/guide-s744-understanding-2013-senate-immigration-bill", "http://blogs.rollcall.com/218/steve-king-illegal-immigrants-kill-americans-every-day/", "http://www.vox.com/2015/8/4/9095851/bush-border-secure-plan", "http://americasvoice.org/research/2016-republicans-and-immigration-what-they-say-what-they-mean-why-it-matters/", "https://www.americanprogress.org/issues/immigration/news/2015/06/24/115835/2-years-later-immigrants-are-still-waiting-on-immigration-reform/", "https://www.americanprogress.org/issues/immigration/news/2015/04/02/110045/assessing-the-economic-impacts-of-granting-deferred-action-through-daca-and-dapa/"], "published": "2015-08-06T07:44:00.000+03:00", "crawled": "2015-08-06T14:14:48.114+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}