{"organizations": [], "uuid": "16929b06fdf8cfd9a8e14af5a82ec876efa73fdc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama1_090715getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/253822-obama-swipes-at-trump-america-is-great-right-now", "country": "US", "title": "Obama swipes at Trump: 'America is great right now'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama swipes at Trump: 'America is great right now'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-16T19:38:00.000+03:00", "replies_count": 0, "uuid": "16929b06fdf8cfd9a8e14af5a82ec876efa73fdc"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/253822-obama-swipes-at-trump-america-is-great-right-now", "ord_in_thread": 0, "title": "Obama swipes at Trump: 'America is great right now'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama swipes at Trump: 'America is great right now' Getty Images By Jordan Fabian - 09/16/15 12:38 PM EDT President Obama hit out at Republican presidential front-runner Donald Trump’s pledge to “make America great again” and pushed back against his claim the United States is being “killed” by countries like China. “There is nothing particularly patriotic or American about talking down America,” Obama said at a meeting of the Business Roundtable in Washington. Obama said the U.S. could do more to boost its economy, but argued that the nation remains the envy of the world. \"America is great right now,” he said, without mentioning Trump by name. “America is winning right now.” The president’s not-so-veiled swipe at Trump came ahead of the second Republican presidential debate at the Ronald Reagan Presidential Library in Southern California, which will take place Wednesday evening. Trump has rocketed to the top of the polls among Republican voters by arguing the U.S. has been outfoxed by nations like China and Mexico when it comes to trade and immigration. Obama slammed the negative rhetoric emanating from Trump and the Republican field. “In the echo chamber that is presidential politics, everything is dark and everything is terrible,” Obama said. “They don’t seem to offer many solutions for the disasters that they perceive.” Obama said the biggest problem the U.S. faces is gridlock in Congress, which is blocking many of his initiatives he argues will boost the economy. “This whole notion we’re losing, nobody outside the U.S. understands what we are talking about,” Obama said. It was the second time this week Obama took aim at Trump, without mentioning him by name. During a stop in Des Moines, Iowa, on Monday, Obama targeted Trump and other GOP candidates for using “anti-immigrant” rhetoric in calling for crackdowns on illegal immigration. Tags:", "external_links": [], "published": "2015-09-16T19:38:00.000+03:00", "crawled": "2015-09-16T19:58:55.729+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}