{"organizations": [], "uuid": "a22e188c27a50224318fb16af4e8b49ac7ea61cf", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/presidentobama_080515getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/253517-obama-extends-window-for-students-to-apply-for-federal-aid", "country": "US", "title": "Obama eyes earlier student financial aid applications", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama eyes earlier student financial aid applications", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-13T23:46:00.000+03:00", "replies_count": 0, "uuid": "a22e188c27a50224318fb16af4e8b49ac7ea61cf"}, "author": "kballuck@thehill.com (Bradford Richardson)", "url": "http://thehill.com/blogs/blog-briefing-room/news/253517-obama-extends-window-for-students-to-apply-for-federal-aid", "ord_in_thread": 0, "title": "Obama eyes earlier student financial aid applications", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 13, 2015, 04:46 pm Obama eyes earlier student financial aid applications By Bradford Richardson Getty Images \nPresident Obama is changing the federal grant system to allow college students to apply for financial aid earlier, the White House announced on Sunday. ADVERTISEMENT Students applying for aid in 2017 will now be able to submit a Free Application for Federal Student Aid (FAFSA) as early as October 1, 2016. Under the old system, students would have had to wait for January to submit the FAFSA.\nStudents will also be able to electronically retrieve tax information filed for an earlier year, instead of waiting until tax season to complete their applications. \nThe administration estimates there are 2 million current college students who would be eligible for a Pell Grant but have never applied for aid. \nThe White House hopes that the changes will allow more students to qualify for grants. \nThe president will announce the plan at a meeting with high school students in Des Moines, Iowa on Monday. \nThe announcement comes on the heels of the Obama administration’s new College Scorecard , a program that allows students to search for the right university based on a number of return-on-investment metrics, such as average starting income upon graduation. \nObama has made higher education reform one of the staples of his second term in office. \nHe recently traveled with Vice President Biden’s wife, Jill, to tout a plan to subsidize community college . Past: 1 day Poll: Sanders surges to 10-point... The senator is also leading Clinton in New Hampshire, 46 percent to 23... Clinton faces trouble in Florida Team Clinton has telegraphed that they are building a southern firewall. Obama retaliation could spur China... Chinese leaders are concerned about international community's perception. Carson responds to Trump: ‘I have... Donald Trump said Carson has low energy and is unqualified to be president. Poll: Trump tops GOP field in... Trump grabbed 24 percent support from Republican voters in California. GOP: Defund Planned Parenthood... “The issue is not whether there’s been a crime committed or not,” Rep. Ted... Sanders: Dems to blame for losing... “The Republicans did not win last November. The Democrats lost,\" he said. Poll: 43 percent of Republicans... Twenty percent of all adults believe he was born outside the United States. Trump’s reform agenda: Elect ‘... Trump said \"it's hard to believe some of the people that we have in office... House rejects Obama's Iran deal The vote underscored how controversial the accord has been with Democrats. Democrats divided over Biden run Affection for VP runs deep, but some question wisdom of White House bid. Carson links Boston Marathon... \"We have to be extra cautious,\" he said. Prospect of shutdown grows It's deja vu all over again for House GOP leaders. 400,000 immigrants lose Obamacare... It's due to a new procedure that shortens the timeframe to resolve... Lone House Republican votes '... Rep. Thomas Massie argued the deal is a treaty not subject to House... Trump: 'Lightweight' Rand Paul... The two GOP presidential rivals sparred in the first GOP presidential... Trump: I would apologize — if I... \"I think apologizing is a great thing, but you have to be wrong,\" the... General: US making 'remarkable... Gen. John Allen said he wasn't sure if Iraq would survive the rise of ISIS. Biden opens up on loss of his son... “I’d be lying if I said that I knew I was there,” he says. “I’m being... DNC chair closes door on more... “We’re not changing the process. We’re having six debates,” she said. The ‘Donald Trump Show,’ courtesy... Trump is not a conservative. He’s a showman who loves to talk about... Huckabee says Dred Scott still ‘... The infamous decision was overturned by the 14th Amendment. Four things to know about... The security software pioneer has dabbled in Russian roulette and fled...", "external_links": [], "published": "2015-09-13T23:46:00.000+03:00", "crawled": "2015-09-14T01:31:43.994+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}