{"organizations": [], "uuid": "c8f4f09de19d5c248d824903797bf7b157324711", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3394154/images/o-MARIJUANA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/rob-kampia/on-marijuana-policy-congr_1_b_8105842.html", "country": "US", "title": "On Marijuana Policy, Congress Needs to Pick Up Where It Left Off | Rob Kampia", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 8, "title_full": "On Marijuana Policy, Congress Needs to Pick Up Where It Left Off | Rob Kampia", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-09T00:00:00.000+03:00", "replies_count": 7, "uuid": "4eacc7e01baa71bb460095eab77aaa273b691dd9"}, "author": "Rob Kampia", "url": "http://www.huffingtonpost.com/rob-kampia/on-marijuana-policy-congr_1_b_8105842.html#post-0", "ord_in_thread": 0, "title": "On Marijuana Policy, Congress Needs to Pick Up Where It Left Off | Rob Kampia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Now that Congress has returned from its August recess, it's time for members to debate and vote on the annual budget that will fund the federal government from October of this year through September of next year. And various marijuana amendments will be a part of these discussions.\nMuch has been made of the way same-sex marriage moved rapidly from unthinkable to inevitable to achieving the ultimate victory. But there's another issue following a similar trajectory -- marijuana legalization. As with marriage reform, the bulk of the action with marijuana legalization has been at the state level, with most members of Congress hesitant to express support until public opinion moves well past the tipping point. This is starting to change.\nUntil last year, neither chamber of Congress had ever passed any measure in support of reforming federal marijuana laws. That changed in May 2014 when the House, with 219 votes, passed a budget restriction that was intended to block the enforcement of federal marijuana laws for people and businesses acting in compliance with state laws that permit medical marijuana. That measure, sponsored by Congressmen Dana Rohrabacher (R-CA) and Sam Farr (D-CA), became law when it was included in the so-called \"CRomnibus\" in December 2014.\nIn June of this year, the House approved the Rohrabacher-Farr amendment again, this time with 242 votes. And the House wasn't alone this time; the Senate Appropriations Committee voted to include the amendment in its version of the U.S. Justice Department's funding bill by a 21-9 vote.\nBut unlike last year, Congress didn't stop there. The list of marijuana-policy-reform votes taken this year includes:\n- For the first time ever, a chamber of Congress voted on a measure to prevent the U.S. Justice Department from spending money to interfere with all state-level marijuana laws (not just medical marijuana laws). A few minutes after passing the Rohrabacher-Farr amendment, the House narrowly defeated this broader amendment -- sponsored by Congressmen Tom McClintock (R-CA) and Jared Polis (D-CO) -- by a 206-222 vote, which is a remarkable amount of support, given that this was the first time the amendment had been considered.\n- The Senate Appropriations Committee approved an amendment 18-12 to allow U.S. Department of Veterans Affairs physicians to recommend medical marijuana. (The House version barely failed with a 210-213 vote, receiving 15 more votes than it did last year.) This Senate committee also approved an amendment to prevent the U.S. Treasury Department from punishing banks that provide services to state-legal marijuana businesses.\n- The House approved three proposals to slash the DEA's budget by $23 million, with congressional proponents citing a desire to stop wasting money on marijuana enforcement. The House also passed amendments to permit high-CBD oils that are used for therapeutic purposes and to protect state hemp-growing programs.\nThese amendments will all be on the table now that Congress has returned from its recess and is negotiating a budget compromise in order to avoid a partial government shutdown.\nThose are the amendments that passed in one committee or chamber, but arguably the best barometer was the one that did not -- the aforementioned McClintock-Polis amendment. Many people view this amendment as a proxy for ending the federal prohibition of marijuana altogether. After all, prohibiting the U.S. Justice Department from spending money to interfere with Colorado's and other states' legalization and medical marijuana laws is akin to saying that Congress believes that states should have the right to legalize marijuana, which is all we've been asking for at the federal level for decades.\nFor context, the Rohrabacher-Farr medical marijuana amendment was first introduced in 2003 and got only 152 votes. It took seven tries over the span of 11 years before Congress finally enacted the amendment into law. (Amendments to federal spending bills automatically expire each October 1, which is the beginning of the new fiscal year and why we raise the same amendments year after year.)\nIt's safe to say it will take less time and fewer tries to pass the broader McClintock-Polis amendment.\nThe litany of appropriations riders isn't the only sign of hope for reform activists. At least a dozen bills have been introduced to make permanent changes to federal marijuana policy. Perhaps the most significant is the CARERS Act , which now has 16 co-sponsors in the Senate, including long-time drug hardliner Sen. Chuck Schumer (D-NY). In the House, Rep. Rohrabacher is sponsoring the Respect State Marijuana Laws Act , which got a boost on August 6 when the National Conference of State Legislatures passed a resolution calling on Congress to \"allow states to set their own marijuana and hemp policies without federal interference ...\"\nIn order for any Senate bills to move forward, they will have to win the support of Sen. Chuck Grassley (R-IA), who chairs the Senate Judiciary Committee. While we don't expect this committee to pass a muscular bill anytime soon, it's worth noting that Grassley and Sen. Dianne Feinstein (D-CA) have sent a series of letters to Obama administration officials and agency directors urging that certain barriers to medical marijuana research be lifted. In a June hearing , Grassley, Feinstein, and sponsors of the CARERS Act peppered physician witnesses with questions about those obstacles, and even Nora Volkow, the director of the National Institute on Drug Abuse, signaled her support for lifting barriers.\nIn a Congress that's controlled by Republicans, the future of reforming federal marijuana laws has never looked brighter.\nRob Kampia is executive director of the Marijuana Policy Project in Washington, D.C.\nMore: Rob Kampia Marijuana Medical Marijuana Congress Dana Rohrabacher Budget Chuck Grassley Drug Enforcement Administration CARERS Act Marijuana", "external_links": ["https://www.congress.gov/bill/114th-congress/house-bill/1940", "http://www.feinstein.senate.gov/public/index.cfm/press-releases?ID=01eda513-3e09-4d57-9dbc-568eadc56fb7", "http://www.politico.com/agenda/story/2015/07/the-senates-experiment-with-cannabis-000114", "https://www.congress.gov/bill/114th-congress/senate-bill/683"], "published": "2015-09-09T00:00:00.000+03:00", "crawled": "2015-09-09T03:10:48.883+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}