{"organizations": [], "uuid": "803e2d7f8d42821f4d1ed780302cbb74b280367f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/cruzted07212015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/blogs/ballot-box/presidential-races/254728-cruz-wants-details-on-increase-in-syrian-refugees", "country": "US", "title": "Cruz worried Obama could 'import terrorism'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Cruz worried Obama could 'import terrorism'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-24T01:37:00.000+03:00", "replies_count": 0, "uuid": "803e2d7f8d42821f4d1ed780302cbb74b280367f"}, "author": "jcarney@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/254728-cruz-wants-details-on-increase-in-syrian-refugees", "ord_in_thread": 0, "title": "Cruz worried Obama could 'import terrorism'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 23, 2015, 06:37 pm Cruz worried Obama could 'import terrorism' By Jordain Carney Getty Images Sen. Ted Cruz (R-Texas) wants the Obama administration to hand over details of how it vets and allows Syrian refugees into the country, saying he's concerned they could \"import terrorism.\" \n\"With an Administration that seems more intent on responding to the interests of the world than the needs of the American people — Congress has an obligation to be vocal and, if necessary, resist this effort,\" Cruz wrote in a letter Wednesday to Department of Homeland Security (DHS) Secretary Jeh Johnson, Secretary of State John Kerry, Attorney General Loretta Lynch and FBI Director James Comey. ADVERTISEMENT Cruz, citing national security concerns, added that lawmakers need more information \"before we can allow the United States to engage in a process that could wind up spending taxpayer dollars to import terrorism, much less fund that process.\"\nHis letter comes as the White House is pledging to increase the number of Syrian refugees allowed into the United States. \nCruz wants the administration to hand over a \"detailed description\" of how it vets Syrian refugees seeking to enter the United States, including anti-terrorism and criminal databases checked and how the administration ensures Syrian refugees aren't terrorists, as well as what steps it takes to apprehend Syrian refugees wanting to enter the United States if they are suspected of terrorist or criminal activity. \"If an individual who is seeking entry to the United States as a refugee from Syria does not register on any federal, state, or international anti-terrorism or criminal database, is it your respective departments’ positions that such individual has zero involvement in terrorism and should enter the United States?\" Cruz asks in his letter. For Syrian refugees seeking to the enter the United States, Cruz asks that the administration break down nationalities, how many are males over 18, how many are males under 18, what biographical information is collected and how its stored and shared, how many were the subject of enhanced screening and how many were allowed to enter the United States after receiving advanced screening. \nCruz's letter comes as lawmakers are struggling to determine what Congress should do to counter Syria's humanitarian crisis. While some Republican lawmakers have tentatively backed the administration's plan to allow more refugees into the country, they have also — like Cruz — raised concerns about national security. He noted that administration officials briefed congressional staff this week on the plan to increase the number accepted into the United States. He said that he is \"grateful\" that the \"briefing exposed significant vulnerabilities in the way the Administration has chosen to handle these refugees.\" \"There is good reason to believe that [the Islamic State of Iraq and Syria] is trying to use the outflow of refugees from Syria to help send terror operatives into Europe and the United States,\" he added. \"Given these and other circumstances, the refugee flow out of Syria must be treated as a substantial national security risk.\" \nCruz wants the departments to preserve any documents or communications from Oct. 1, 2013, and onward that are related to John Allen, the envoy for the global coalition to combat ISIS, or any personnel involved in the effort; that mention the conflicts in Iraq and Syria; that mention refugees from the Middle East, Africa or Central Asia; or that mention one of the handful of names and acronyms for ISIS. He also asks the administration officials to explain where it is getting the $419 million in humanitarian aid that the White House announced it would donate, what the administration has done to get countries in the region involved, and whether the Department of Health and Human Services’ Office of Refugee Resettlement is involved in settling Syrian refugees in the United States. Tags:", "external_links": [], "published": "2015-09-24T01:37:00.000+03:00", "crawled": "2015-09-24T03:40:46.847+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}