{"organizations": [], "uuid": "f2f356d1de1d927801736556ada799b831966b4e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e4dca017000043015691d2.jpeg", "site_section": "http://www.huffingtonpost.com//feeds/verticals/politics/index.xml", "section_title": "Politics - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/barack-obama-ovarian-cancer_55e4d589e4b0aec9f35450be", "country": "US", "title": "Obama Calls For A Greater Effort To Fight Ovarian Cancer", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Calls For A Greater Effort To Fight Ovarian Cancer", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-01T02:05:00.000+03:00", "replies_count": 0, "uuid": "f2f356d1de1d927801736556ada799b831966b4e"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/barack-obama-ovarian-cancer_55e4d589e4b0aec9f35450be", "ord_in_thread": 0, "title": "Obama Calls For A Greater Effort To Fight Ovarian Cancer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Calls For A Greater Effort To Fight Ovarian Cancer His mother, Ann Dunham, died of ovarian cancer in 1995. Marina Fang Associate Politics Editor, The Huffington Post Posted: 08/31/2015 07:05 PM EDT Isaac Brekken via Getty Images \nWASHINGTON -- President Barack Obama on Monday honored women diagnosed with ovarian cancer and their families and urged more research into prevention, detection and treatment of the disease in a White House proclamation commemorating September as National Ovarian Cancer Awareness Month. \n“This month, we stand with all those who continue to fight this devastating disease and with those who have lost loved ones because of it. Along with the advocates, medical researchers, and health care providers who tirelessly battle this disease every day, we rededicate ourselves to the urgent work of increasing awareness and improving care for those with ovarian cancer -- and we continue forging a future free from cancer in all its forms,” the proclamation reads. \nThe issue is personal for Obama -- his mother, Ann Dunham, died of ovarian cancer in 1995. \nIn the proclamation, he urged women to talk to their doctors about risk factors for ovarian cancer, as it is difficult to detect early. Obama also called for more research into the disease and heralded his administration’s efforts to invest more money into ovarian cancer detection and treatment. \n“During National Ovarian Cancer Awareness Month, our Nation pauses to lift up all those who know the pain of this disease, honor those we have lost, and renew our commitment to fighting ovarian cancer through more effective prevention, detection, and treatment,” he wrote. \nAccording to the Centers for Disease Control and Prevention , ovarian cancer is the eighth most common form of cancer and the fifth leading cause of death among people who die of cancer. Each year, about 20,000 women in the U.S. are diagnosed with it, and the American Cancer Society estimates that this year, about 14,000 will die from the disease.", "external_links": [], "published": "2015-09-01T02:05:00.000+03:00", "crawled": "2015-09-01T02:21:30.828+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}