{"organizations": [], "uuid": "9389853d67a3bbbcef46304dc6cc9c65b6a5d182", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/arts/blog.xml", "section_title": "Arts Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/roxane-assaf/former-obama-white-house-_b_8100838.html", "country": "US", "title": "Former Obama White House Chief Releases Record (the Musical Kind) | Roxane Assaf", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 15, "title_full": "Former Obama White House Chief Releases Record (the Musical Kind) | Roxane Assaf", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-16T21:59:00.000+03:00", "replies_count": 16, "uuid": "6be29093045da499e9233cab1d1ec40912755b64"}, "author": "Roxane Assaf", "url": "http://www.huffingtonpost.com/roxane-assaf/former-obama-white-house-_b_8100838.html#post-0", "ord_in_thread": 0, "title": "Former Obama White House Chief Releases Record (the Musical Kind) | Roxane Assaf", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The fact that composer/vocalist Mike Kelleher just released \" Mélange ,\" an aptly named album of mixed genres, would be more newsworthy than saying he comes off as a genuinely decent person. But in these cynical times, it's actually relevant - especially given his line of work.\nAfter tag-teaming with Barack Obama through their respective campaigns for political office, the former Peace Corps volunteer ended up in the then-senator's Chicago office as Director of Outreach and Economic Development. As president, Obama invited him to the White House as Director of Presidential Correspondence.\n\"We got letters with catastrophic pleas from real people. You feel responsible for them. They're appealing directly to the president,\" Kelleher recalled of his 12-hour days managing 200 staffers, interns, and volunteers at the White House. From the deluged \"information factory,\" they culled 10 letters per day for the president's briefing book. \"If you make a mistake, it could end up above the fold in the newspaper. Especially early in his administration, any mistake could affect his ability to implement policy. I'm very proud that we made that a trouble-free time for him.\"\nKelleher's musical expression is no East Room parlor trick. He's no John Ashcroft (\"Let the Eagle Soar\"). He's no Bill Clinton (tenor sax). And anyone who believes that Washington, DC, is 'Hollywood for the ugly people' hasn't seen his wife and musical collaborator Karin. This recording is the real deal.\nIf there is any artifice to \"Mélange,\" it's in the manipulation of the familiar. The sacrosanct Beatles are not off-limits. Likewise, a good way to stir the ire of any New Orleanian (this writer being one) is to provoke the City of Broken Levees by reinterpreting its music. Kelleher does a down-and-bluesy \"Chantez les Brahms\" for W.C. Handy's \"Chantez-les Bas,\" made famous by Louis Armstrong. To this he brings respectable surprises when his wholesome voice - a fresher Kurt Elling - loses its innocence, and does so with joyful abandon. (He's okay, chers. Hold your hot sauce.)\nThe blending of jazz and classical idioms can make intelligent music of any selection. But these thoughtfully rendered pieces have the quality of art song. The choices are intellectualized, with original melodies given unexpected twists and famous covers turned inside-out. A showcase of complex meter, harmonic creativity, and vocal alacrity is rarely so listenable. When it's over, you miss it.\nThe couple marries sweet flavors to complicated textures as \"Black is the Color\" harkens back to the Old South with the ghost-of-fiddles-past making welcome appearances. Karin Kelleher 's superb violin performances reflect her classical work with DC-area orchestras. She romances each of her husband's arrangements. The multi-tuned \"Something Suite\" demonstrates variety through \"Giga\" invoking Johann Sebastian Bach and \"Something\" treating George Harrison to a dizzying waltz.\nIn Kelleher's's own words: \"Bach, who had an unmatched harmonic depth, is represented in three pieces on the album with arrangements that surround the original Bach solo piece with contemporary rhythm and harmonies extrapolated from the original.\" His approach is at times cerebral. He names his tracks with nerdy wordplay for the love of the learned.\nWhile Mike takes a bow for his own virtuosic vocals, compositions and arrangements, he credits Karin and the album's all-acoustic band for the work's sophisticated musicality and lushly shaped sound. The ensemble includes string quartet, double bass, guitar, oboe, and drummer Joe McCarthy, founder and leader of the Latin Grammy-winning group Afro Bop Alliance. They are in good company with Grammy Award-winning audio engineer Jim Robeson who applies some nearly imperceptible devices to evoke the past, the present, and even the future.\nDreamy expressions in the cartoon-featured track \"Ancka's Dolphin Dance\" show up often and to good effect throughout the album. In Kelleher's rendition of Herbie Hancock's \"Dolphin Dance,\" with the expertly filmic minimalist animation by Collin McRae Leix , the strings are off in a fantasy while he sings his own lyric narrative against a fluid background. A little girl goes from riding in a boat, safe with her father on a glassy sea, to swimming with dolphins, to having life knock her for a loop in adulthood - an unmistakable nod to each of Kelleher's three daughters.\nDecades ago, the trumpeter-turned-singer/guitarist spent a sleepless night in an Ivory Coast shack composing the up-tempo Afro-Latin jazz piece \"Jeannot\" for a popular eccentric from France. Kelleher humbly reminisced that the chain-smoking local listened politely to his performance of the belabored namesake, then requested Johnny Cash instead. To each his own.\nThe vocally challenging and slightly haunted original \"Beautiful Pain\" sets the stage for Kelleher's controlled and poignant sound. Another original \"My Love Isn't\" proves he can get up-close and personal, sustaining intimate notes without the clang of a Broadway belter. Throughout the album he does employ his well-mastered belt to satisfaction but doesn't over-use it.\nA dense triad of expression comes with \"Lune Dreams,\" borrowing \"Moon Dreams\" from Miles Davis and adding lyrics adapted from the Paul Verlaine poem \"Clair de Lune\" that inspired Claude Debussy's suite movement by the same name. The album caresses the listener in a sudsy bath of \"Moonlight.\" But even the cut with the most crooning American Songbook sound takes intervallic turns not often heard in Tin Pan Alley standards. Producer/composer/arranger Kelleher doesn't give himself a break. He not only sings the un-singable, but he also expects to pay homage to the greats while offering accessible music to a contemporary audience.\n\"I want it to stand on its own. I'm proud that it has depth and has classical and jazz antecedents,\" he said, admitting these are two niche genres, however harmonically compatible they may be with each other. \"I hope [listeners] get connected to Miles Davis, Debussy, and to all the other folks in these two great traditions that contribute to all the music that has come since. But I hope it's music that communicates with or without the antecedents.\"\nHe accomplishes all that and more. Then you muse: This guy worked at the White House.\nNow working for the World Bank, Kelleher plans to enjoy the afterglow of their debut concert of Mélange that took place in Baltimore September 3rd at An die Musik on the eve of the album's official release. On October 12, the Kellehers perform at Washington's Blues Alley . Mélange can be found at iTunes and Amazon .\nFollow Roxane Assaf on Twitter: www.twitter.com/Roxahhhn\nMore: Mike Kelleher Karin Kelleher Mélange Melange Classical Music Jazz Fusion Music Album Album Reviews New Releases White House Barack Obama Obama White House John Ashcroft Bill Clinton The Beatles The Beatles Music Blues Louis Armstrong Kurt Elling Art Song Johann Sebastian Bach George Harrison Latin Grammy Latin Grammys Grammy Awards Joe Mccarthy Jim Robeson Collin McRae Leix Miles Davis Claude Debussy Paul Verlaine Contemporary Music Singer Songwriter Violin String Quartet Peace Corps Peace Corps Volunteers Inside DC Baltimore Annapolis Maryland", "external_links": ["http://www.bluesalley.com/", "http://www.twitter.com/Roxahhhn", "http://www.kellehermusic.com/mike", "https://itunes.apple.com/us/album/melange/id1020834397", "http://www.kellehermusic.com/karin", "http://www.amazon.com/exec/obidos/ASIN/B011X6RDYA", "http://www.andiemusiklive.com/EvntDtl1.cfm?&E1CNTR=7663&YR=2015&MN=9&DY=3&T=170009", "http://collinmcraeleix.com/", "http://www.kellehermusic.com/home", "https://www.youtube.com/embed/7ZBkwHex4-Y"], "published": "2015-09-16T21:59:00.000+03:00", "crawled": "2015-09-16T22:31:05.099+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}