{"organizations": [], "uuid": "2b04a7bdccfa15ce797b3fcbc7885cdf41ddc6db", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/bushtrump.png", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/senate-races/250617-jeb-trumps-rhetoric-reminds-me-of-barack-obama", "country": "US", "title": "Jeb: Trump's rhetoric 'reminds me of Barack Obama'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Jeb: Trump's rhetoric 'reminds me of Barack Obama'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-08T00:07:00.000+03:00", "replies_count": 0, "uuid": "2b04a7bdccfa15ce797b3fcbc7885cdf41ddc6db"}, "author": "mmali@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/ballot-box/senate-races/250617-jeb-trumps-rhetoric-reminds-me-of-barack-obama", "ord_in_thread": 0, "title": "Jeb: Trump's rhetoric 'reminds me of Barack Obama'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 07, 2015, 05:07 pm Jeb: Trump's rhetoric 'reminds me of Barack Obama' Getty Images \nFormer Florida Gov. Jeb Bush says Republican rival Donald Trump's controversial rhetoric reminds him of President Obama. \n\"I want to win. I want to win the presidency. A conservative has to win to fix these things. Language that divides us... this reminds me of Barack Obama. Not as a candidate, but Barack Obama as president,\" said Bush in an interview with Fox News's Neil Cavuto. ADVERTISEMENT \"All he does is push people that don't agree with him down to make his side look better, and the divide makes it hard to solve problems. I don't think we're going to win that way,\" he added. \nBush, who is polling second only to Trump in several recent surveys, has managed to avoid a public feud with the real estate tycoon, unlike other GOP contenders. \n\"I got enough on my own plate to sort out. To try to analyze Donald Trump is way above my pay grade,\" Bush said on Fox, before taking a shot at his rival. \n\"He garners attention with his language, he's larger than life, but this debate last night showed he doesn't have a lot of specifics.\" \nDuring Thursday night's first GOP debate, Bush denied a report that he described Trump in an interview with a donor as an \"ass----,\" noting he has described Trump's remarks as divisive. Trump showed his appreciation after Bush denied the report, saying he was a \"true gentleman.\" \n\"Did it get under my skin, did it anger me that he retweeted a tweet saying that I'm soft on immigration because my wife is from Mexico?\" Bush asked during the Fox News interview. \n\"That is outrageous, unfair,\" he said of a tweet that Trump later deleted . \"My wife is an American, by the way, an American by choice. She loves this country. She wants this border to be secure as well.\" \nBush also said that it was \"premature\" to say how Trump's campaign will unfold, with the billionaire businessman refusing to rule out a third-party bid. \n\"I hope he stays as a Republican,\" Bush said.", "external_links": [], "published": "2015-08-08T00:07:00.000+03:00", "crawled": "2015-08-08T09:42:37.190+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}