{"organizations": [], "uuid": "4cbf24c9ccb06401bb14dc1f131c5ba8262562a4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/hillaryclinton_091915getty_1.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/254449-clinton-expected-to-break-with-obama-on-healthcare-cadillac-tax", "country": "US", "title": "Clinton expected to break with Obama on healthcare ‘Cadillac’ tax", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Clinton expected to break with Obama on healthcare ‘Cadillac’ tax", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-22T01:46:00.000+03:00", "replies_count": 0, "uuid": "4cbf24c9ccb06401bb14dc1f131c5ba8262562a4"}, "author": "iswanson@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/254449-clinton-expected-to-break-with-obama-on-healthcare-cadillac-tax", "ord_in_thread": 0, "title": "Clinton expected to break with Obama on healthcare ‘Cadillac’ tax", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Clinton expected to break with Obama on healthcare ‘Cadillac’ tax Getty Images By Sarah Ferris - 09/21/15 06:46 PM EDT \nHillary Clinton will seek to align herself with ObamaCare’s successes and use it to attack the GOP on Tuesday as she begins to map out her long-awaited healthcare agenda. \nThe effort could also lead to a public break with the Obama administration on healthcare for the first time. ADVERTISEMENT After months of delivering nothing but praise for ObamaCare, Clinton is expected to weigh in – and oppose – one of the law's most controversial taxes: the so-called “Cadillac” tax.\nIf she joins her 2016 Democratic rivals in calling for the repeal of the tax on generous healthcare plans, she will distance herself from most ObamaCare supporters but also unlock key endorsements from unions that staunchly oppose it. \nClinton will drop the first details of her healthcare plan during a campaign event in Iowa on Tuesday, part of a two-day, three-state tour. Her speech will come a few weeks after hinting that she has concerns with the tax earlier this summer. \n“Hillary Clinton believes protecting, defending and improving the Affordable Care Act is a top issue for this campaign, so she plans to highlight its benefits and go on offense against Republicans for their never-ending push to repeal,” a campaign official told The Hill on Monday. \nLooking beyond the law’s current scope, she will also target the rising costs of prescription drugs and out-of-pocket healthcare costs – two policy areas that were largely left out of the Affordable Care Act. Rising costs have become a rallying cry of Clinton’s Democratic rival, Sen. Bernie Sanders (I-Vt.), who recently introduced legislation targeting the “skyrocketing” costs of drugs. \nSanders, as well as former Maryland Gov. Martin O’Malley, have both come out in opposition of the Cadillac tax, putting pressure on Clinton to do the same or risk losing big-dollar union support. \n“This tax affects public and private employers of every size and industry and every part of the country,” said James Klein, president of the American Benefits Council, which represents large companies like Coca-Cola and Apple Inc. The tax has also been universally opposed by the country’s largest unions, who often have generous benefit packages. \nClinton hinted earlier this summer that she was weighing a repeal of the excise tax “as currently structured,” which would charge companies if their benefits exceeds $10,200 for an individual or $27,500 for a family. \nThe controversial tax, which has been repeatedly delayed, is still three years away from implementation. It is increasingly drawing opposition from union groups and Democrats in areas like New England and the West Coast, where health insurance costs are higher. \n“I worry that it may create an incentive to substantially lower the value of the benefits package and shift more and more costs to consumers,” Clinton wrote in response to questions from the American Teacher’s Federation this summer. \nAdvocates for repealing the Cadillac tax say they are optimistic that Clinton will take their side, particularly with a growing number of congressional Democrats are also calling for the rule to be scrapped. \n“If she says anything about the tax at all, it can only be negative,” said one D.C. lobbyist who has advocated for repeal. “If she even raises the tax, it will be good for momentum.” \nFour years ago, hardly any Democrats publicly supported repealing the Cadillac tax for fear it would spur on efforts to repeal the entire law. Now, the lobbyist believes the law is more cemented, and Democrats can afford to vocally oppose the most onerous pieces of the law. \n“I think the thing that’s different now than it was four years ago is that the future of the [Affordable Care Act] is not in question. This isn’t about repealing the ACA,” she said. \nStill, the Obama administration has fiercely opposed the repeal effort, arguing that there is no other way to fill the $87 million budget hole. \nWhile ObamaCare was politically toxic issue for many Democrats in 2010 and 2012, party strategists believe it could become an asset in 2016. By the time of the election, the nation will have gone through three enrollment periods, which the law’s proponents hope will drive down the uninsured rate even further. \nAnd though public opinion for the law remains nearly equally divided, a majority of Americans say they would prefer lawmakers to tackle drug costs instead of dragging out fights over ObamaCare. \nIn a national Kaiser Health Tracking poll last month , three-quarters of Americans said Congress and the White House should prioritize making prescription drugs affordable. \nA major pillar of Clinton’s healthcare platform will be lowering drug costs. She has previously pledged to “drive a hard bargain” with pharmaceutical companies – a group that is already deeply unpopular with the public. \nIn the questionnaire with AFT, Clinton pledged to “crack down on the drug companies that charge too much and the insurance companies that offer too little.” She also said she would prioritize “rising out-of-pocket healthcare costs for consumers across the board.” \nShe doubled down on that stance Monday during a preview of her healthcare speech, tweeting that she would lay out a plan to tackle “price gouging” by drug companies. Within hours, healthcare stocks of two biotech giants plunged. \nHer position is already being met with praise by one vocal critic of pharmaceutical companies in Congress, Rep. Elijah Cummings (D-Md.). \n“The federal government's got to do something,” Cummings, the top Democrat on the House Oversight Committee said in an interview. He said there was “no doubt” that the next president would need to tackle the problem, as it affects nearly every American. \n“If you at what's happening with prescription drugs, it's criminal. I have still not seen an adequate reason for this jacking up of the prices, and I think the American people are tired of it,” he said. \nDuring her first healthcare speech Monday morning, she spent nearly 25 minutes underscoring the law’s successes and pledging to fight off GOP attacks. \n“It’s not just a political issue, it’s a moral issue,” she said during the untelevised event, according to the Baton Rouge Advocate. Clinton added that she was “so proud” to be part of the Obama administration during the law’s passage, and pledged not to let Republicans “rip away the progress we've made.” \nLater on Monday, Clinton headed to Arkansas, where a Democratic governor implemented a controversial piece of ObamaCare that allowed states to receive extra federal dollars if they agree to expand Medicaid. Since then, Arkansas has seen one of the sharpest declines in its uninsured population. \nInstead of fighting back on healthcare, Republican campaign officials are trying to shift the healthcare debate back to the Democratic front-runner’s email controversy. \n“Between Clinton’s support of Obamacare and her claims about her handling of classified information on her secret email server going up in smoke, Hillary Clinton continues to prove why she cannot be trusted in the White House,” Republican National Committee spokeswoman Ali Pardo said in a statement.", "external_links": [], "published": "2015-09-22T01:46:00.000+03:00", "crawled": "2015-09-22T16:06:10.096+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}