{"organizations": [], "uuid": "25dbd1b52e3cf0f8620cdf470d30fae3f1558549", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3263746/images/o-PRESIDENT-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/blog.xml", "section_title": "WorldPost Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/jose-ramoshorta/obama-the-courage-to-say-we-were-wrong_b_7934284.html", "country": "US", "title": "Obama: The Courage to Say 'We Were Wrong' | José Ramos-Horta", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 53, "title_full": "Obama: The Courage to Say 'We Were Wrong' | José Ramos-Horta", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-04T20:56:00.000+03:00", "replies_count": 110, "uuid": "f6111bc9168065d6d9474e2c225a546502ba2ce8"}, "author": "José Ramos-Horta", "url": "http://www.huffingtonpost.com/jose-ramoshorta/obama-the-courage-to-say-we-were-wrong_b_7934284.html#post-0", "ord_in_thread": 0, "title": "Obama: The Courage to Say 'We Were Wrong' | José Ramos-Horta", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This article is cross-posted on thecommunity.com .\nSome months ago 11 other Nobel Peace Prize laureates and I co-signed an open letter to President Obama on the use of torture by the U.S. Two days ago I received a response from the President. (See both letters here .)\nMost of Obama's letter contained information we already know. One of his first acts in office was to sign an Executive Order ending the CIA's illegal detention and interrogation program. He is working to close Guantanamo, an unenviable task that raises as many questions as it solves but still must be done.\nThese points are to be expected. But there was something else about this letter that stayed with me after I had put it down. The letter is an honest, candid communication. It is formal but frank, missing the political double-speak we have grown accustomed to from world leaders.\n\"We do not claim to be perfect,\" he said. \"... In our response to the attacks of September 11, 2001, although our Nation did many things right, some of our actions were contrary to our values. The report of the Senate Select Committee on Intelligence on the CIA's former detention and interrogation program reinforced my view that these harsh methods were not only inconsistent with our values as a Nation but did not serve our broader national security interests.\"\nIn 40 years of dealing with presidents, prime ministers and other leaders, I could count on one hand the times I have heard a president or a prime minister or other high official speak candidly about the mistakes their country has made. It may be that I can count them on two fingers. In 2008 Australia's Prime Minister Kevin Rudd issued an apology to the country's Aboriginal people for the Lost Generation of children, and the suffering inflicted by the government's policies. A sincere and eloquent statement, it is the only time I can think of that a Western leader has apologized for the abominable treatment of indigenous peoples. I was also deeply impressed when I read then German President Richard von Weizsäcker speaking on German collective responsibility for the Holocaust in May, 1985.\nBoth statements stand out as great examples of wisdom and courage. But it is particularly difficult, and rare, for leaders to apologize when the mistakes were made for a good cause, such as preserving freedom.\nThe United States did not suddenly tumble from its horse as the world's leader in human rights by opening Guantanamo or waterboarding prisoners. U.S. involvement in coups, turning a blind eye to the resulting civilian massacres and other gross human rights violations during the Cold War are well documented. As we are seeing in recent years with terrorism, the United States has not always been well equipped to fight a new kind of enemy, in this case a Viet Cong unit entrenched in a Vietnamese village, or a Communist ideology taking hold at the grassroots of strategic countries.\nBut even the American sins of the Cold War did not reduce its stature as a bastion for human rights. While the U.S. already had its hands in Viet Nam, many of us on the other side of the world were touched forever when the Kennedys came out in support of the rights of Africans to rule themselves. As young men and women, many of today's Nobel Peace Prize winners watched awestruck from countries under brutal dictatorships, apartheid or foreign occupation as American students were allowed to pour into American streets to protest the war, and as 250,000 American civil rights supporters gathered at the Lincoln Memorial to hear Martin Luther King speak of a dream of civil rights. We did not have illusions that the U.S. had entirely clean hands. But we were empowered and inspired by the U.S. ideals, which spoke of the inherent rights of man.\nAfter 9/11, the use of torture by the USA, the dismantling of the Geneva Convention and the arrogant disregard for international law displayed at Guantanamo were blows to human rights around the world. The revolting images of Abu Ghraib, with American soldiers standing smiling over piles of naked bodies, dragging prisoners by a leash, a prisoner standing hooded and wired with electrodes, were the first view of how far the U.S. had fallen. Hearing the feeble justifications from the American President and Vice President, including the invention of a new euphemism, \"enhanced interrogation\", was the second view. They created a shift in the world's perception of the U.S. It seemed the world had lost a force for good.\nIn reality it had not. The Americans who still believed in American ideals and inherent human rights swept Obama into office. It was not a coincidence that his first act was to sign an order ending the use of torture.\nIn his letter responding to the Nobel laureates Obama says that, \"The true test of a society committed to the promotion of universal values and fundamental freedoms is not that it never makes mistakes, but that it takes responsibility for those mistakes and corrects them.\" The release of the Senate Select Committee on Intelligence report on the use of torture, while met with relatively mild response from the American media, was an important step on the road back for the U.S.\nThe human rights issues facing President Obama today, including the use of drones, do not have simple answers. Terrorists such as those who flew planes filled with civilians into the World Trade Center or those who post videos of beheading innocent aid workers and journalists on the Internet have among their goals the eradication of some of our most basic human rights and freedoms. Left unchecked, their actions will only grow. They are not offering themselves up for arrest.\nThe U.S. is not fighting this enemy on battlefields or at sea as in the last World Wars. They are nestled among civilian populations, not only in Pakistan or Yemen but in Europe and even the U.S. They are on the Internet, within the reach of our own children.\nWe do not have all the answers yet on how to effectively fight this enemy. But a leader with the rare courage and honesty to say \"we didn't get it right, and we are correcting that\" has taken his country down some extremely important steps on the road.\nFollow José Ramos-Horta on Twitter: www.twitter.com/JoseRamosHorta\nMore: Barack Obama Barack Obama Nobel Peace Prize Nobel Laureates José Ramos Horta Desmond Tutu Torture Geneva Convention Guantanamo Bay", "external_links": ["http://thecommunity.com/no-to-torture/", "http://www.twitter.com/JoseRamosHorta", "http://www.youtube.com/watch?v=b3TZOGpG6cM"], "published": "2015-08-04T20:56:00.000+03:00", "crawled": "2015-08-05T05:00:51.212+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}