{"organizations": [], "uuid": "0d474b936dd382b3f0929681a4bacb4003bf31d1", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obama-reid_081515getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/floor-action/senate/254030-senate-dems-stonewall-iran-resolution-handing-victory-to-obama", "country": "", "title": "Senate Dems stonewall Iran resolution, handing victory to Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Senate Dems stonewall Iran resolution, handing victory to Obama | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-18T00:50:00.000+03:00", "replies_count": 0, "uuid": "0d474b936dd382b3f0929681a4bacb4003bf31d1"}, "author": "", "url": "http://thehill.com/blogs/floor-action/senate/254030-senate-dems-stonewall-iran-resolution-handing-victory-to-obama", "ord_in_thread": 0, "title": "Senate Dems stonewall Iran resolution, handing victory to Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 17, 2015, 12:19 pm Senate Dems stonewall Iran resolution, handing victory to Obama By Jordain Carney Getty Images \nSenate Democrats blocked a resolution disapproving the Iran nuclear deal for a third time Thursday, sealing a major foreign policy victory for President Obama. Senators voted 56-42 against ending debate on the resolution of disapproval, falling short of the 60 votes needed on the procedural motion. ADVERTISEMENT Democratic Sens. Ben Cardin (Md.), Joe Manchin (W.Va.), Bob Menendez (N.J.) and Charles Schumer (N.Y.) for a third time bucked Obama and voted \"no\" on the deal.\nGOP Sens. Rand Paul (Ky.) and Marco Rubio (Fla.) missed the vote, while Sens. Ted Cruz (Texas) and Lindsey Graham (S.C.) voted to end debate. All four took part in Wednesday night's Republican presidential debate in California. \nThe vote came just hours ahead of the deadline for lawmakers to pass a resolution on the deal. With neither chamber of Congress expected to take another vote on Iran, the administration is poised to protect the agreement after months of intense lobbying aimed at solidifying Democratic support.Opponents of the deal appeared to acknowledge defeat ahead of Thursday's vote. \"This agreement is moving forward, we all know that,\" Cardin, the ranking member of the Foreign Relations Committee, said, adding that lawmakers should now focus on next steps to strengthen the agreement. Sen. Bob Corker (R-Tenn.), who spearheaded legislation that allows for Congress to debate and vote on the agreement, added that Republicans understand that \"42 senators are causing a filibuster to take place and that we're not every going to be able to get to that vote on conscience.” Republicans argue that Democrats are blocking the resolution in an effort to protect Obama from having to use a veto, something he's only had to use four times while in office. Thursday's vote comes after Democrats previously blocked the resolution of disapproval from moving forward twice. Republicans had hoped that by staging repeat votes they could pressure at least two more Democrats to buck Obama and vote against the deal. But Minority Leader Harry Reid (D-Nev.) suggested that Republicans were wasting precious floor time with only a handful of working days left ahead of an end-of-the-month deadline to avoid a government shutdown. \"Senator McConnell has decided to waste an entire week on something that has already been decided, twice,\" he said. \"Despite the fact that the government will be shut down in a matter of days, the world's greatest deliberative body is doing a show vote.\" Reid previously offered to let the Senate move to a final vote on the Iran nuclear deal if Republicans would agree to setting a 60-vote threshold for final passage. While McConnell rejected the deal, it's gained at least one Republican supporter: Sen. Jeff Flake (R-Ariz.), who said he wants to take a final vote \"and not just have endless cloture votes.\" \"Take it,\" he said, referring to Reid's offer. \"Let's get to a final vote. We've seen the end of this movie already.\" But McConnell appeared to be sticking to his strategy — even after his attempt to force a tough vote on Democrats failed. \"Democrats have chosen to deny the Senate a final vote on the president's deal with Iran. They made their choice,\" he said. \"Democrats ensured that this would be not just Obama's deal with Iran, but the Democratic Party's deal with Iran, too.\" ", "external_links": [], "published": "2015-09-18T00:50:00.000+03:00", "crawled": "2015-09-18T00:50:30.460+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}