{"organizations": [], "uuid": "8be12231b20bc23294d6d4adb4aa999a06f4cec7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabiden_091414getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1625/feed", "section_title": "Presidential races", "url": "http://thehill.com/blogs/ballot-box/presidential-races/250051-white-house-wont-say-if-obama-would-back-biden-in-16", "country": "US", "title": "White House won’t say if Obama would back Biden in ‘16", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "White House won’t say if Obama would back Biden in ‘16", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-03T15:42:00.000+03:00", "replies_count": 0, "uuid": "8be12231b20bc23294d6d4adb4aa999a06f4cec7"}, "author": "iswanson@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/250051-white-house-wont-say-if-obama-would-back-biden-in-16", "ord_in_thread": 0, "title": "White House won’t say if Obama would back Biden in ‘16", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 03, 2015, 08:42 am White House won’t say if Obama would back Biden in ‘16 Getty Images \nA top aide to President Obama on Monday praised Joe Biden's tenure as vice president but refused to say whether the president would back him should he launch a 2016 White House bid. \n“It certainly seemed to have generated some news in the last 24 hours, didn't it?” White House press secretary Josh Earnest quipped on MSNBC's “Morning Joe” about reports Biden is mulling a bid. ADVERTISEMENT “What the president has long said is that choosing Joe Biden to be his running mate was the smartest decision he'd ever made in politics,” Earnest continued. \n“And I think, even given the high expectations the president had for Vice President Biden, Vice President Biden over the last six and a half years has exceeded them,” Earnest added. \nA report Saturday from New York Times columnist Maureen Dowd said that Biden was taking meetings to discuss potentially challenging Hillary Clinton, the Democratic presidential frontrunner. \nHer column indicated that Biden's eldest son Beau, 46, had urged his father to run for president before he died following a battle with brain cancer at the end of May. \nAnother report from the Times said that Biden's advisers were gauging the appetite for him to challenge Clinton, who dominates other Democrats in polls but has faced lingering questions over a variety of issues, including her use of a private email server as secretary of State. \nEarnest on Monday described Joe Biden as a “champion for the middle class,” highlighting his decades of foreign policy experience and personal relationships on behalf of the Obama administration. \n“If he chooses to run, he'll have a strong case to make, but we've got some other Democratic candidates in the race that also have quite a strong case to make,” Earnest said. Tags: RNC chief to GOP field: ‘Stop the... “It doesn’t get us closer to beating Hillary Clinton,” Priebus said. Rand Paul attributes Trump's rise... \"We're going to come back to our senses and look for someone serious,\"... Trump sees double-digit surge in... Trump leads the GOP field in a new Wall Street Journal/NBC News poll. Sanders disagrees with Clinton on... Sanders said he was surprised by Clinton's reluctance to state a position... Trump: GOP challengers 'viciously... \"They attacked me first and I hit them back,\" he said Sunday. Carson: Black Lives Matter... Carson also discussed illegal immigration in an NBC interview. Report: Trump fires adviser over... Trump's campaign called Sam Nunberg a low-level, part-time consultant. Kasich makes quick rise in polls Ohio Gov. John Kasich entered the GOP race late but has already made... Sanders: 'No question' I can beat... The longshot presidential candidate said he is forcing Hillary to \"respond... Heritage Action CEO: Conservatives... “Most Republican voters hate their party,” Michael Needham said. Republicans slam brakes on voting... House Dems want the bill brought directly to the floor for a vote. Obama turns to climate change His administration will finalize sweeping new regulations on power plants... Fox News leaves many questions... Many await word from Fox on how they will conduct Thursday's debates. Texas attorney general reportedly... Prosecutors will present a felony charge accusing Ken Paxton of securities... White House will retaliate against... The administration had previously indicated it would not even publicly... Five fights waiting for Congress... Lawmakers kicked the can on a number of political fights until September. Obama doubles down on climate rule The Obama administration on Sunday unveiled a tougher climate change rule... Trump: Biden has 'good chance'... “I think that the email scandal is going to be a devastating blow,” Trump... Paul: Defund Planned Parenthood,... \"I think most Americans don't want their tax dollars going to this,\" he... Sanders endorsed by environmental... Friends of the Earth Action announced it is backing the Vermont senator... State Department probe: Agency... The investigation reportedly found Huma Abedin was overpaid by roughly $10... The Hill's 2015 50 Most Beautiful... The Hill's 2015 50 Most Beautiful list is out today! Watch the video and...", "external_links": [], "published": "2015-08-03T15:42:00.000+03:00", "crawled": "2015-08-04T09:03:12.191+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}