{"organizations": [], "uuid": "d3b58281a507c96fc1efeccc56e75b31b14aad7d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaaddress0822.png", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/blogs/blog-briefing-room/news/252387-obama-targeting-police-completely-unacceptable", "country": "US", "title": "Obama tells Texas widow that targeting cops is 'unacceptable'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama tells Texas widow that targeting cops is 'unacceptable'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-01T14:22:00.000+03:00", "replies_count": 0, "uuid": "d3b58281a507c96fc1efeccc56e75b31b14aad7d"}, "author": "kballuck@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/blog-briefing-room/news/252387-obama-targeting-police-completely-unacceptable", "ord_in_thread": 0, "title": "Obama tells Texas widow that targeting cops is 'unacceptable'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 01, 2015, 07:22 am Obama tells Texas widow that targeting cops is 'unacceptable' By Jesse Byrnes \nPresident Obama called the widow of a slain sheriff's deputy in Texas on Monday to offer his condolences on behalf of the country, according to a statement provided by the White House. \nThe White House said Obama promised he would “continue to highlight the uncommon bravery that police officers show in our communities every single day\" when he spoke with Kathleen Goforth. \n\"They put their lives on the line for our safety,\" Obama added. \"Targeting police officers is completely unacceptable — an affront to civilized society.\" \nDarren Goforth was gunned down by his patrol car at a gas station Friday night. The 30-year-old suspect has been charged with capital murder. \nThe prosecutor in the case has said the suspect, who is black, allegedly shot the white police officer 15 times. Police had said over the weekend the shooting appeared unprovoked. \nThe case roiled debate over the weekend about safety for police officers. \n\"As I said in my State of the Union Address, we've got to be able to put ourselves in the shoes of the wife who won't rest until the police officer she married walks through the door at the end of his shift,\" Obama told the deputy’s widow, calling for \"the safety of police officers wherever they serve.\" Ex-Clinton aide expected to plead... Lawyers for the IT staffer cite the \"current political environment.\" DNC chief faces perilous fall Angst over the presidential debates and a tough choice on Iran await... Cheney: 'I was right about Iraq' Cheney said the world is a \"much better place\" without Saddam Hussein. Planned Parenthood gets $1M in... The new funding is enraging Republicans who have already sought to defund... Colbert roasts Jeb for fundraising... \"No one from Jeb’s campaign asked me if this was OK with me to raise money... Clerk’s gay marriage protest... The Kentucky case has pushed gay marriage toward the center of the... GOP chairman John Kline to retire The Minnesota Republican has announced he will not seek reelection. Ex-adviser: Trump will sign... Trump got what he wanted from the RNC, former adviser Roger Stone said. Judge poised to order search for... The order could come by the end of next week. The difference between Republicans... In Iowa, a former congressman sums up the core — and stark — difference. Budowsky: Megyn Kelly’s Murrow... OPINION | The problem with the Fox News debate was not Fox, it was Trump. The Hill's Whip List: Obama has... Sen. Barbara Mikulski (D-Md.) became the 34th senator to publicly back the... Trump hits Carson: Doctors don’t... Trump said it would be \"very tough\" for someone with a medical background... Robert Redford 'glad' Trump is... “On the other side it’s so bland, it’s so boring, it’s so empty,” the... Bush gambles on Trump attacks to... Bush donors cheer his attacks but are also concerned about the risks. Trump: Nuclear deal forces US to... \"We have to fight with Iran against Israel\" in the event of war, Trump... Biden: I’m not a populist like... The vice president's comments came during a trip that fueled speculation... States: Obama water rule should be... The EPA wants to selectively enforce the water rule in states that aren’t... Feds to treat pope's visit like a... The federal government is urging employees to work from home while the... Postal workers' dispute boils over... The postal workers say keeping post offices open longer would not only... Pentagon eyes more potential sites... The Defense Department is keeping the \"handful\" of locations under wraps.", "external_links": [], "published": "2015-09-01T14:22:00.000+03:00", "crawled": "2015-09-03T19:16:02.314+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}