{"organizations": [], "uuid": "fc3e6388853e319eee2a28466c3aac75c8cbec4c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/trump-obama-golf_090215getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1625/feed", "section_title": "Presidential races", "url": "http://thehill.com/blogs/blog-briefing-room/news/252650-trump-obama-plays-more-golf-than-people-on-the-pga-tour", "country": "US", "title": "Trump: Obama plays more golf ‘than people on the PGA Tour’", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trump: Obama plays more golf ‘than people on the PGA Tour’", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-03T18:14:00.000+03:00", "replies_count": 0, "uuid": "fc3e6388853e319eee2a28466c3aac75c8cbec4c"}, "author": "kballuck@thehill.com (Bradford Richardson)", "url": "http://thehill.com/blogs/blog-briefing-room/news/252650-trump-obama-plays-more-golf-than-people-on-the-pga-tour", "ord_in_thread": 0, "title": "Trump: Obama plays more golf ‘than people on the PGA Tour’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Past: 1 day Trump hits 30 percent in new poll In a distant second place is Ben Carson with 18 percent support. Snowden: Clinton's email server 'a... Snowden also dismissed comments by Donald Trump, who called him a \"traitor... Planned Parenthood gets $1M in... The new funding is enraging Republicans who have already sought to defund... Trump hits radio host Hugh Hewitt... The conservative host asked Trump about foreign policy. GOP candidates blast 'absurd'... \"Today, judicial lawlessness crossed into judicial tyranny,\" Sen. Ted Cruz... Clinton: Officials should 'uphold... The presidential candidate weighed in on the Kentucky gay marriage dispute. Ex-Clinton aide expected to plead... Lawyers for the IT staffer cite the \"current political environment.\" House GOP leader distances herself... \"I don’t work for John Boehner. He works for me,\" Rep. Lynn Jenkins said. DNC chief faces perilous fall Angst over the presidential debates and a tough choice on Iran await... Trump signs GOP loyalty pledge Trump said he will not change his mind about the pledge. Fiorina handles foreign policy... “I don’t think they’re ‘gotcha’ questions at all,” Fiorina told Hugh... Trump: Nuclear deal forces US to... \"We have to fight with Iran against Israel\" in the event of war, Trump... Let's get real and end birthright... The current policy of birthright citizenship is a huge magnet for more... Postal workers' dispute boils over... The postal workers say keeping post offices open longer would not only... Captain Crunch passes Deez Nuts in... Captain Crunch leads PPP's survey of \"joke candidates.\" Trump hits Carson: Doctors don’t... Trump said it would be \"very tough\" for someone with a medical background... Sanders: Let's stand up to Wall... He said illegal immigrants are being used as a \"punching bag\" in the race. Perry on Trump's claim he's... Donald Trump asserted that Rick Perry is “getting out of the race.” The Hill's Whip List: Obama has... Sen. Barbara Mikulski (D-Md.) became the 34th senator to publicly back the... ESPN removes Curt Schilling for... The baseball analyst retweeted a photo comparing radical Muslims to Nazis. Ky. marriage clerk taken into... Kim Davis was held in contempt of court for refusing to issue same-sex...", "external_links": [], "published": "2015-09-03T18:14:00.000+03:00", "crawled": "2015-09-04T05:10:44.558+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}