{"organizations": [], "uuid": "05bca36c4b50f7b73669b7800361ad81f35838ee", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarackasiachina_043014getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/floor-action/senate/250834-senators-pressure-obama-on-china", "country": "", "title": "Senators pressure Obama on human rights in China | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Senators pressure Obama on human rights in China | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-11T20:40:00.000+03:00", "replies_count": 0, "uuid": "05bca36c4b50f7b73669b7800361ad81f35838ee"}, "author": "", "url": "http://thehill.com/blogs/floor-action/senate/250834-senators-pressure-obama-on-china", "ord_in_thread": 0, "title": "Senators pressure Obama on human rights in China | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 11, 2015, 12:52 pm Senators pressure Obama on human rights in China By Jordain Carney Getty Images \nA bipartisan group of senators is putting pressure on President Obama on human rights ahead of Chinese President Xi Jinping's visit to the United States in September. \nTen senators, in a letter sent Tuesday, said that the president should have a \"full and frank discussion of our concerns regarding human rights and civil society in China.\" ADVERTISEMENT \"Under President Xi, there has been an extraordinary assault on rule of law and civil society in China,\" the senators wrote. \"Therefore, we ask that you call publicly and privately for China’s immediate release of these detained lawyers and activists, or at the very least, that China grant them due process.\"\nSigning Tuesday's letter were Sen. Ben Cardin (D-Md.), the ranking member of the Foreign Relations Committee; Sen. John McCain (R-Ariz.), the chairman of the Armed Services Committee; Sens. Kelly Ayotte (R-N.H.), Tammy Baldwin (D-Wis.), Sherrod Brown (D-Ohio), Susan Collins (R-Maine), John Cornyn (R-Texas), Tom Cotton (R-Ark.), Patrick Leahy (D-Vt.) and Bob Menendez (D-N.J.). \nThey acknowledge that next month's talks would likely cover a range of issues, including actions by China in the East and South China seas that U.S. officials argue is escalating regional tensions. But, the senators want Obama to make sure human rights is a \"key and public component of the agenda for your discussions.\" \nAs part of that, they want Obama to ask that the Chinese government immediately release Liu Xiaobo, a Nobel Peace Prize recipient, and to end the house arrest of his wife, Liu Xia. They also want the president to bring up Pu Zhiqiang and Xu Zhiyong, two human rights lawyers currently detained in China, and ask Xi to review the prison sentence of professor Ilham Tohti and seven of his students. \nThe senators suggested they were particularly concerned over a draft law in China that they argue would give the Ministry of Public Security oversight of foreign nongovernmental organizations (NGOs), which the senators suggest could lead U.S. NGOs \"to pull out of China altogether.\" \nThey also warned Obama against furthering U.S.-Chinese cooperation on domestic security when Xi's government \"appears set to put in place a draconian anti-terrorism law.\" \n\"Although we of course understand the imperative for all nations, including China, to take necessary steps to counter violent extremism, an added degree of scrutiny and oversight should be sought before U.S. law enforcement and judiciary organizations partner with Chinese agencies, offices and departments,\" they added. \"Particularly at a time when China’s internal security apparatus is expanding and remains largely unaccountable.\" \nThe administration's policy toward China has drawn skepticism from Republicans, and some Democrats, on a range of issues including trade and human rights. Cotton, as well as Sen. Marco Rubio (R-Fla.), introduced a joint resolution of disapproval of the U.S.-China Nuclear Cooperation Agreement that the administration handed over to lawmakers in April. \nIf successful, the move would effectively block the 30-year extension of the agreement Obama is hoping for. ", "external_links": [], "published": "2015-08-11T20:40:00.000+03:00", "crawled": "2015-08-11T20:40:31.323+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}