{"organizations": [], "uuid": "e880de1ef1fda1aff2698adb47cc9215f589f971", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55be1b331400002e002e1a81.jpeg", "site_section": "http://www.huffingtonpost.com//feeds/verticals/green/index.xml", "section_title": "Green - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-to-announce-the-biggest-most-important-step-so-far-on-climate_55be038fe4b06363d5a27956", "country": "US", "title": "Obama To Announce The 'Biggest, Most Important Step' So Far On Climate", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama To Announce The 'Biggest, Most Important Step' So Far On Climate", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-02T16:29:00.000+03:00", "replies_count": 0, "uuid": "e880de1ef1fda1aff2698adb47cc9215f589f971"}, "author": "Kate Sheppard", "url": "http://www.huffingtonpost.com/entry/obama-to-announce-the-biggest-most-important-step-so-far-on-climate_55be038fe4b06363d5a27956", "ord_in_thread": 0, "title": "Obama To Announce The 'Biggest, Most Important Step' So Far On Climate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama To Announce The 'Biggest, Most Important Step' So Far On Climate Final rule includes tougher emissions cuts and more renewables. Kate Sheppard Senior reporter/Environment and energy editor, The Huffington Post Posted: 08/02/2015 09:29 AM EDT | Edited: 18 minutes ago \nBREAKING: On Monday, President Obama will release the final version of America's Clean Power Plan—the biggest, most important step we've ever taken to combat climate change. If you agree that we can't condemn our kids and grandkids to a planet that's beyond fixing, share this video with your friends and family. It's time to #ActOnClimate. Posted by The White House on Saturday, August 1, 2015 \nWASHINGTON -- The Obama administration will release final standards for power plants on Monday that are, in several key ways, tougher than the draft version of the plan. \nBoth The Washington Post and The New York Times reported Saturday night that the final version of what the administration calls the \"Clean Power Plan\" will call for a 32 percent reduction of planet-warming greenhouse gas emissions from power plants, compared to 2005 levels. The draft version of the plan that the Environmental Protection Agency released last year required a nationwide average of 30 percent reductions. \nA senior administration official confirmed the details of the plan to The Huffington Post on Sunday morning. \nThe plan also increases the percent of power that states will be expected to draw from renewable sources like wind and solar to 28 percent, up from 22 percent in the draft plan. Both papers attributed the leaked details to unnamed sources within the administration. \nPresident Barack Obama is expected to unveil the standards himself on Monday. The White House posted a video on Facebook on Saturday night promoting the forthcoming standards. \n\"Climate change is not a problem for another generation, not anymore,\" Obama says in the video. \"That's why on Monday my administration will release the final version of America's clean power plan, the biggest, most important step we've ever taken to combat climate change.\" \nPower plants are the source of about 40 percent of all U.S. emissions. The plan, drafted under the Clean Air Act, sets a nationwide reduction target for cutting power plant emissions, but also gives each state an individual target, based on current emissions levels and the energy mix in that state. The states will be required to draft their own plans for meeting those standards. \nPreviously leaked details of the final plan noted that it would give states two additional years -- until 2022 -- to begin making cuts. And the Post reported late Saturday that the final rule will also include a \"reliability safety valve,\" which would allow states even more time if they find that making the cuts could create disruptions in the electricity supply. \nThe final rule is also expected to provide more incentives to states that begin making emission cuts earlier. And it is crafted to push states toward renewables faster, rather than switching to natural gas-powered plants, an issue some states identified in the draft version of the rules. \nEnvironmental groups cheered the anticipated release of the final rule. \"These historic standards, which are the single biggest step our government has ever taken, will finally put a stop to our nation’s largest polluters’ ability to spew an unlimited amount of carbon pollution into our air,\" said Gene Karpinski, president of the League of Conservation Voters, in a statement ahead of the release. \nBut nearly everybody involved in the rule expects it to be challenged in court. Industry groups already tried to challenge the draft rule, but the lawsuit was thrown out earlier this year when the Court of Appeals for the District of Columbia Circuit ruled that suit was premature because the standards had not yet been finalized. \nSenate Majority Leader Mitch McConnell (R-Ky.) has personally appealed to state governors to refuse to produce compliance plans, and already Indiana , Wisconsin and several other states have indicated they will not comply. But EPA Administrator Gina McCarthy has said that she believes most states will choose to develop their own plans, rather than have one issued from the federal government. \nThe announcement of the final rules will kick off a renewed push on climate for Obama, the administration official said, which will include an address at the National Clean Energy Summit in Nevada, a trip to the Alaskan Arctic, and a discussion of climate change with Pope Francis during his upcoming trip to the U.S.", "external_links": [], "published": "2015-08-02T16:29:00.000+03:00", "crawled": "2015-08-02T17:06:46.321+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}