{"organizations": [], "uuid": "64181aa25bfcf1ee4627ee790e9168b35e51341f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/denver/blog.xml", "section_title": "Denver Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/jason-salzman/cu-tops-csu-in-resisting_b_8208722.html", "country": "US", "title": "CU Tops CSU in Resisting Right-Wing Extremism on Abortion | Jason Salzman", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "CU Tops CSU in Resisting Right-Wing Extremism on Abortion | Jason Salzman", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-28T20:19:00.000+03:00", "replies_count": 0, "uuid": "64181aa25bfcf1ee4627ee790e9168b35e51341f"}, "author": "Jason Salzman", "url": "http://www.huffingtonpost.com/jason-salzman/cu-tops-csu-in-resisting_b_8208722.html", "ord_in_thread": 0, "title": "CU Tops CSU in Resisting Right-Wing Extremism on Abortion | Jason Salzman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reporters should take note of the different responses, one by Colorado State University and the other by two University of Colorado campuses, to Rep. Doug Lamborn's pressure to halt the acquisition of fetal tissue from two companies--as well as to the GOP Congressman's demand that all NIH-funded research using fetal tissue be stopped.\nSome fetal tissue is obtained, with full consent, from women who have abortions. Under federal law, women are not paid for this, and suppliers charge handling fees only.\nBack in July, under pressure from Lamborn, Colorado State University President Tony Frank embarrassed his institution by suspending the purchase of fetal-tissue from two suppliers until vague \" congressional investigations are concluded .\" Never mind that such investigations rarely have anything to do with guilt or innocence--and everything to do with politics .\nIn Aug., Lamborn turned his attention to the University of Colorado at Denver , demanding information on whether it also uses two fetal-tissue suppliers, StemExpress and Advanced Bioscience Resources, both of which are under attack by the anti-choice Center for Medical Progress for obtaining tissue from Planned Parenthood.\nIn response, the University of Colorado Medical School and the University of Colorado at Denver stated that they did not obtain fetal tissue from those the two companies.\nAnd if they did, they wouldn't stop unless rules or regulations had been violated. As Richard Traystman, the University of Colorado Medical School's Director of Research, told me, for an RH Reality Check Post :\n\"At this moment we're not [using those companies], but we will if we need to. We do have other sources, as I've said, but those are the two major companies that many investigators order from.\"\nBoth CSU and the CU campuses told Lamborn they would not halt NIH funded fetal research. As Traystman put it :\n\"It's not acceptable to stop research using cells from fetal tissues. In my letter, I gave examples of where these sorts of fetal cells are used in research on certain diseases. They are very often used in research on diseases of the central nervous system, the brain, the spinal cord, a variety of diseases that involve brain abnormalities and diseases, like Parkinson's disease, for example. They are also used in research on the heart and cardiac tissue and to create vaccines. I could go on.\"\nFollow Jason Salzman on Twitter: www.twitter.com/BigMediaBlog\nMore: Doug Lamborn RH Reality Check Center for Media Research Planned Parenthood University of Colorado Medical School University of Colorado University of Colorado at Denver Richart Traystman Tony Frank", "external_links": ["http://rhrealitycheck.org/article/2015/08/06/university-caves-anti-choice-pressure-suspends-fetal-tissue-acquisition-vendors/", "http://www.twitter.com/BigMediaBlog", "http://rhrealitycheck.org/article/2015/09/23/university-resists-pressure-gop-congressman-halt-research-fetal-tissue/"], "published": "2015-09-28T20:19:00.000+03:00", "crawled": "2015-09-28T23:52:49.128+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}