{"organizations": [], "uuid": "6fa517833b8d94a345689a6f54101bee0983a1b2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_072815getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/250373-obama-takes-on-iran-critics-on-twitter", "country": "US", "title": "Obama takes on Iran critics on Twitter", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama takes on Iran critics on Twitter", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-06T00:47:00.000+03:00", "replies_count": 0, "uuid": "6fa517833b8d94a345689a6f54101bee0983a1b2"}, "author": "Mark Hensch", "url": "http://thehill.com/blogs/blog-briefing-room/250373-obama-takes-on-iran-critics-on-twitter", "ord_in_thread": 0, "title": "Obama takes on Iran critics on Twitter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 05, 2015, 05:47 pm Obama takes on Iran critics on Twitter By Mark Hensch Getty Images \nPresident Obama hit back at Republican opponents of his Iran nuclear deal on Twitter Wednesday. \nThe president denied suggestions there are secret terms to the deal that haven't been shared with Congress and said rejecting the agreement would bolster Iran's nuclear program. \n“Important detail – there are no secret deals,” Obama wrote about the agreement, responding to a tweet from House Majority Whip Steve Scalise (R-La.). ADVERTISEMENT “My staff can brief you on any question about any part of the deal,” he added.\n“Mr. President, Americans deserve to know the details about the secret side deals,” Scalise had tweeted earlier Wednesday morning with the hashtag #IranDeal. Important detail – there are no secret deals. My staff can brief you on any question about any part of the deal. https://t.co/UO0B5xCOPh — President Obama (@POTUS) August 5, 2015 \nObama also addressed Senate Majority Leader Mitch McConnell (R-Ky.) and his remarks criticizing the deal. \n“The choice is ultimately between diplomacy and war,” Obama wrote . “Iran’s nuclear program accelerates if Congress kills this deal.\" \n“Let’s hope @POTUS avoids obviously untrue talking points about the #IranDeal being a choice between a bad deal and war,” McConnell tweeted on Wednesday morning. “It isn’t.” \nObama also responded to a tweet from Angela K. Miller, a self-described \"peace advocate.\" \nMiller asked Obama on Twitter if a “better” deal were possible. \n“It’s the strongest nuclear deal ever negotiated,” Obama tweeted . \n“There’s no such thing as a ‘better deal,’” he added. “Walking away risks war.” \nObama’s push on social media for the Iran deal follows a speech he delivered at American University Wednesday morning. \nHe told lawmakers in the speech that the agreement is the best method for preventing an Iranian nuclear weapons stockpile. \n“Walk away from this agreement, and you will get a better deal – for Iran,” Obama said. \n“America’s credibility is the anchor of the international system,” the president added. \nObama is ramping up efforts to win over lawmakers as they begin a five-week August recess. Congress is currently within a 60-day window to review the pact, with Republicans planning to vote on a resolution of disapproval in September. \nThe president needs to shore up Democratic support to sustain his threatened veto of any measure blocking the nuclear deal. \nThe historic agreement would ease economic sanctions on Iran in exchange for greater restrictions over its nuclear energy programs. Tags:", "external_links": [], "published": "2015-08-06T00:47:00.000+03:00", "crawled": "2015-08-06T01:58:50.357+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}