{"organizations": [], "uuid": "b42ef824b52709d71792a5aff605b0264400a430", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/1138/feed", "section_title": "Foreign Policy", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/249837-j-street-shills-for-obama-on-iran-deal-what-else-is-new", "country": "US", "title": "J Street shills for Obama on Iran deal: What else is new?", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "J Street shills for Obama on Iran deal: What else is new?", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-31T21:00:00.000+03:00", "replies_count": 0, "uuid": "b42ef824b52709d71792a5aff605b0264400a430"}, "author": "jpicard@thehill.com (Abraham H. Miller)", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/249837-j-street-shills-for-obama-on-iran-deal-what-else-is-new", "ord_in_thread": 0, "title": "J Street shills for Obama on Iran deal: What else is new?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 31, 2015, 02:00 pm J Street shills for Obama on Iran deal: What else is new? By Abraham H. Miller \nJeremy Ben-Ami would like people to believe that the Obama administration's agreement with Iran is nothing short of the hyperbole with which the president is selling it to the nation. Ben-Ami's J Street organization has been pushing that line to both the American and Jewish public in high profile advertisements that sound remarkably like administration talking points. \nOf course, even the most casual observer of the Middle East conflict and the role of the American Jewish community in it would know that J Street has been Obama's puppet on nearly every issue facing the Jewish state. Ben-Ami has gone as far as to proclaim that J Street was created to serve at the pleasure of President Obama when he said J Street’s mission was to do “whatever we can in Congress to be the President’s blocking back.” ADVERTISEMENT If J Street did not exist, Obama would have to invent it. In fact, it is widely perceived that George Soros did just that for the president, creating an anti-Israel, allegedly pro-Israel advocacy organization that would split pro-Israel support in the Jewish community. After all, if the British could build an empire out of divide and conqueror, why could not Soros?\nTo understand Ben-Ami’s latest foray into the Iran deal, it is necessary to provide some context. For years, Ben-Ami denied that Soros was generously supporting the organization. And even when this deception could not continue, Ben-Ami created the red herring that he meant Soros neither founded the organization nor was its major supporter. \nJ Street would like to convey the image that it represents the Jewish community, but as Paul Miller so graphically noted in The Hill , getting around a J Street summit is a bit difficult with all the tumbleweed blowing through the convention center. Miller's pictorial image gives an accurate rendering of just how popular J Street is in the Jewish community. \nAnd while the Jewish tent is big, J Street's repeated anti-Israel behavior has evolved to the point where the normally placid and overly tolerant Jewish community is beginning to hear a growing crescendo of voices calling for J Street's expulsion . \nJ Street's is without shame in its mendacious attempt to garner support for Obama's Iran deal, a deal which will give a nuclear break-out capacity to a regime that regularly holds death-to-Israel rallies while sending military equipment to Israel's frontline enemies. \nThe latest salvo in J Street's promotion of Obama's betrayal of the Jewish State is a poll by the organization that alleges that the majority of American Jews support the deal. The irrelevance of the poll should be lost on no one as it is not a majority of American Jews that is the immediate target of the Iranians. It is Israelis; they have spoken with one voice against their own demise. \nBut to trust the man who repeatedly denied his relationship with Soros with a poll is to ask too much. After all, while Ben-Ami is quick to tell us how many respondents were in his poll, he does not answer the more important question of how they were drawn. You neither have to be able to explain Bernoulli's theorem nor have studied stratified sampling procedures with its progenitor, Professor Leslie Kish, to know that the accuracy of a poll rests on the sampling mechanism, especially for a group like Jews that is a small part of a larger population. \nBefore I get too academic, the 60 percent support for the Iran deal J Street is touting is based on this question: \nAs you may know, the U.S. and other countries have announced a deal to lift economic sanctions against Iran in exchange for Iran agreeing not to produce nuclear weapons . International inspectors would monitor Iran's facilities, and if Iran is caught breaking the agreement economic sanctions would be imposed again. Do you support or oppose this agreement? \nBenjamin Netanyahu would say yes to a question phrased as claiming Iran will not produce the bomb. But we know now that the agreement does nothing more than slow Iran’s path to the bomb – and that is if Tehran actually abides by the deal. \nIf one wants to indulge in the war of polls, a more recent poll sponsored by the Israel Project shows American Jews are more likely to oppose Obama's Iran deal than support it. In fact, the more informed members of the Jewish community are about the deal, the less likely they are to support it. \nIf the poll is insufficient to gather support for Obama, J Street is providing its supporters with an opportunity for a phone conversation with the president himself to discuss the agreement and why they should support it. One wonders if there will be an opportunity to question the president on the two secret side agreements with Iran that are being shielded even from Congress. \nJ Street has a long and perfidious record when it comes to Israel. If there is a position that works against the continued existence of the Jewish state, count on J Street to support it. That in itself should lead to a rejection of anything J Street has to say. They should have been kicked out of the Jewish communal tent long ago. The continued presence of J Street in the Jewish communal structure is an offense against common decency and as much a threat to Israel's future as Obama's Middle East policies. \nMiller is an emeritus professor of political science, University of Cincinnati, and a senior fellow with the Salomon Center for American Jewish Thought. @salomoncenter", "external_links": [], "published": "2015-07-31T21:00:00.000+03:00", "crawled": "2015-08-01T03:16:10.355+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}