{"organizations": [], "uuid": "b412b4df63db46a0efc3f335431338b8ab3a44ab", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f623a1140000d8012e5860.jpeg?cache=v1k8NGG1ue", "site_section": "http://www.huffingtonpost.com//feeds/index.xml", "section_title": "The Huffington Post | The Full Feed", "url": "http://www.huffingtonpost.com/entry/obama-college-financial-aid-fafsa_55f6222ee4b063ecbfa4b2d4", "country": "US", "title": "President Obama To Announce Reforms To Make College Financial Aid More Accessible", "performance_score": 4, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "President Obama To Announce Reforms To Make College Financial Aid More Accessible", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-14T04:33:00.000+03:00", "replies_count": 0, "uuid": "b412b4df63db46a0efc3f335431338b8ab3a44ab"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/obama-college-financial-aid-fafsa_55f6222ee4b063ecbfa4b2d4", "ord_in_thread": 0, "title": "President Obama To Announce Reforms To Make College Financial Aid More Accessible", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama To Announce Reforms To Make College Financial Aid More Accessible Students will be able to more easily apply. By Peter Cooney Posted: 09/13/2015 09:33 PM EDT \nWASHINGTON, Sept 13 (Reuters) - President Barack Obama will announce steps to bolster access to financial aid for students as part of efforts to make college more affordable, the White House said on Sunday. \nAmong the measures Obama will announce in Des Moines, Iowa, on Monday will be allowing aspiring college students and their families to apply earlier under the Free Application for Federal Student Aid, or FAFSA. The FAFSA application helps determine eligibility for federally supported student loans as well as Pell Grants, a federal need-based student aid program. \nUnder the initiative to be announced by Obama, students will be able to file FAFSA applications in October, the start of the college application process, rather than having to wait until January. ASSOCIATED PRESS \nStudents also will be able to electronically retrieve tax information filed for a previous year rather than waiting until tax season to finish their applications. \n\"Learning about aid eligibility options much earlier in the college application and decision process will allow students and families to determine the true cost of attending college - taking available financial aid into account - and make more informed decisions,\" the White House said in a statement. \nSpiraling student debt has become a growing national concern, with student loans now totaling some $1.2 trillion, making them the second largest form of household debt after mortgages. \nThe White House said that despite a simplified FAFSA process, an estimated 2 million college students never sought a Pell Grant despite being eligible, while an unknown number never went to college because they did not know aid was available. \n\"Over the next several years, the simpler FAFSA filing process could encourage hundreds of thousands of additional students to apply for and claim the aid they are eligible for - and enroll in college,\" the White House statement said. (Reporting by Peter Cooney; Editing by Paul Simao)", "external_links": [], "published": "2015-09-14T04:33:00.000+03:00", "crawled": "2015-09-14T04:42:13.744+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}