{"organizations": [], "uuid": "490ce70d3665e29031212b28f83545af69ec3deb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/judy_6.png", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/video/in-the-news/252446-obama-to-run-wild-on-reality-tv-show", "country": "US", "title": "Obama to run 'Wild' on reality TV show", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to run 'Wild' on reality TV show", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-01T23:23:00.000+03:00", "replies_count": 0, "uuid": "490ce70d3665e29031212b28f83545af69ec3deb"}, "author": "The Hill staff", "url": "http://thehill.com/video/in-the-news/252446-obama-to-run-wild-on-reality-tv-show", "ord_in_thread": 0, "title": "Obama to run 'Wild' on reality TV show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to run 'Wild' on reality TV show By The Hill staff - 09/01/15 04:23 PM EDT \nThe Hill's columnist Judy Kurtz joins Fox 5 for her weekly \"In The Know\" series. \nPast: 1 day Sanders: Dems ‘dead wrong’ on... \"I have let the leadership of the Democrats know,\" Sanders said. Obama: Climate change threatens US... “This is all real,” the president said. “This is happening to our fellow... Carson catches Trump in Iowa A new survey finds Trump and Carson taking 23 percent support each. Trump tops GOP rankings Bush takes second and Kasich third in The Hill's latest rankings. Obama: 'There's not a smidgen of... The president said he is personally hurt by the accusation. Columbia president suggests Obama... The White House says Obama hasn't finalized his post-presidency plans. Ohioans fuming over Mount McKinley... \"This political stunt is insulting to all Ohioans,\" one lawmaker said. Obama will attempt to survive the... Obama will film a TV episode with the noted adventurer. Jindal: Clinton one email away... \"It just seems to be one scandal after another,” he said. Greens: Obama climate legacy at... One green group warns Obama could have his \"Mission Accomplished\" moment. 'Ready for Kanye' paperwork filed... A GOP operative launched the committee after the rapper revealed... Anger builds at EPA over... Residents are pleading with the agency to clean up the site before a... Fiorina, Christie battle for spot... Fiorina would have to knock Chris Christie out of the 10th spot for CNN's... Republicans plot counterattack to... Republicans intend to hammer Senate Dems if they don't allow an up-or-down... Trump rips Clinton aide Abedin and... Trump called Weiner \"one of the great sleazebags of our time.\" Sanders: ‘I can get beyond the... “I do not accept the fact that I have been weak on this issue,\" he said. Black Lives Matter rejects show of... \"We demand action, not words, from those who purport to stand with us,\"... Warren turned down on invite to... Sen. Elizabeth Warren's granddaughter is in school and couldn't come, she... 150 new Clinton emails contain... The State Department says none of the information was classified when it...", "external_links": [], "published": "2015-09-01T23:23:00.000+03:00", "crawled": "2015-09-02T02:30:26.500+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}