{"organizations": [], "uuid": "4ca91eb2cb47aebcb5b740287e9faaae866ddecd", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/253725-obama-chooses-cardiologist-as-next-fda-commissioner", "country": "US", "title": "Obama chooses cardiologist as next FDA commissioner", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama chooses cardiologist as next FDA commissioner", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-15T23:37:00.000+03:00", "replies_count": 0, "uuid": "4ca91eb2cb47aebcb5b740287e9faaae866ddecd"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/253725-obama-chooses-cardiologist-as-next-fda-commissioner", "ord_in_thread": 0, "title": "Obama chooses cardiologist as next FDA commissioner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama chooses cardiologist as next FDA commissioner By Sarah Ferris - 09/15/15 04:37 PM EDT President Obama on Tuesday nominated cardiologist Robert Califf to lead the Food and Drug Administration (FDA), which has been without an official head since the beginning of April. ADVERTISEMENT Califf, a renowned researcher who spent most of his career at Duke University, joined the FDA in February to become the deputy commissioner for medical products and tobacco. He was brought on shortly after the departure of its former comissioner , Dr. Margaret Hamburg, and had been frequently been floated as her potential successor. The FDA’s chief scientist, Dr. Stephen Ostroff, has served as interim director since then. If confirmed by the Senate, Califf will take on a complex role overseeing policies from tobacco and drug policy to food safety. His portfolio will also include an accelerating rate of drug approvals while under pressure from one of the country’s most powerful lobbying sectors. With six years at the helm, Hamburg had been one of the longest-serving FDA commissioners in recent memory. She had been at the center of some controversies, such as the decision to relax age requirements for \"Plan B\" emergency contraception. \nCaliff is now the second federal health official awaiting confirmation. Earlier this summer, Obama named Andy Slavitt to become the next head of the Centers for Medicare and Medicaid Services.", "external_links": [], "published": "2015-09-15T23:37:00.000+03:00", "crawled": "2015-09-16T00:54:16.407+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}