{"organizations": [], "uuid": "b9e8e112adbe7e812cd00562468fc4fedf1f08d2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaearmusic08142015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/48/feed#", "section_title": "The Hill: In The Know", "url": "http://thehill.com/blogs/in-the-know/251142-obama-releases-summer-playlist", "country": "US", "title": "Obama releases summer playlist", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama releases summer playlist", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-14T19:11:00.000+03:00", "replies_count": 0, "uuid": "b9e8e112adbe7e812cd00562468fc4fedf1f08d2"}, "author": "tlejeune@thehill.com (Judy Kurtz)", "url": "http://thehill.com/blogs/in-the-know/251142-obama-releases-summer-playlist", "ord_in_thread": 0, "title": "Obama releases summer playlist", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 14, 2015, 12:11 pm Obama releases summer playlist Getty Images \nPresident Obama released hit eclectic summer playlist on Friday. His 2015 grooves include tracks from Justin Timberlake, Coldplay, Beyoncé, Bob Dylan and Bob Marley, among others. ADVERTISEMENT The commander in chief unveiled his “by popular request” Spotify list of songs he says he’ll be jamming to while vacationing on Martha’s Vineyard through next week. Due to popular request, here are my vacation playlists: http://t.co/uer5sIl4Vk http://t.co/zHEekHvQBr What's your favorite summer song? — President Obama (@POTUS) August 14, 2015 \nAmong the mostly non-controversial roster of songs: “Tombstone Blues” by Bob Dylan, “Paradise” by Coldplay, “Superpower” by Beyoncé and Frank Ocean, “So Much Trouble in the World” by Bob Marley & The Wailers, Mos Def’s “UMI Says,” Brandi Carlile’s “Wherever is Your Heart,” “Green Light” by John Legend and Andre 3000, Florence + The Machine's \"Shake it Out\" and “Pusher Love Girl” by Justin Timberlake. \nThe 54-year-old president’s pair of playlists also contains a hodge-podge of songs from the 1960s and '70s: The Rolling Stones’s “Gimme Shelter,” “Hot Fun in the Summertime” by Sly & the Family Stone, “Ain’t too Proud to Beg” by The Temptations, Van Morrison’s “Moondance” and Aretha Franklin’s “Rock Steady.” Past: 1 day Dems near Clinton panic mode “I’m not sure they completely understand the credibility they are losing,... Turmoil mounts surrounding Clinton... Team Clinton blasts criticism as \"misinformation\" and \"nonsense.\" Carson: Planned Parenthood in... Carson said the organization's founder \"was not particularly enamored with... Seven GOP candidates who could... Of the crowded 2016 GOP primary field, who will be the first to head for... Carson on Clinton email server: '... GOP presidential candidate Ben Carson said on Wednesday that Democrat... Report: Al Gore insiders chatting... Gore started to trend on Twitter after reports of the talks emerged. Cruz wants immigration details on... Cruz and Sessions are probing the \"nexus between terrorism and our... Black lawmakers back disruptions... “They really are speaking to the issues,\" Rep. Sheila Jackson Lee (D-Texas... Outsiders take over GOP Conservatives are thrilled with the developments. Airline to weigh passengers before... Passengers will have to step on the scale before they step on their... Clinton mocked for emoji tweet Clinton asks how student loans make followers feel in \"3 emojis or less.\" Celebs line up for, against Donald... Rosie O’Donnell is not a fan. Obama shares his summer reading... The president's most notable selection is Between The World and Me by Ta-... Trump defends Planned Parenthood Republican presidential front-runner Donald Trump defended Planned... Oath Keepers descend on Ferguson An official called the presence of the heavily armed men \"both unnecessary... Navy shuffles up aircraft carrier... The \"three-carrier swap\" leaves the Asia-Pacific region without a forward-... Mexico won't pay for Trump's... \"It's 100 percent they're going to pay,\" Trump claimed in an interview. Trump: China 'just destroying us'... \"China has gotten rich off us,” Trump said in Michigan. Ex-adviser: Trump a 'great... “Trump has the size and boldness to be the leader we need,” Roger Stone... Fiorina: Trump, Obama both hit... Fiorina argued that both men employ inflammatory rhetoric against their... 'Regular guy' style costs Walker... Walker has seen his standing in Iowa slip away to Donald Trump.", "external_links": [], "published": "2015-08-14T19:11:00.000+03:00", "crawled": "2015-08-15T04:24:33.897+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}