{"organizations": [], "uuid": "f4584c53a39ba79f10a5053b7e861fe06524d571", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/pills_drugs_102711getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/255046-obama-puts-spotlight-on-prescription-drug-abuse", "country": "", "title": "Obama puts spotlight on prescription drug abuse | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama puts spotlight on prescription drug abuse | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-26T14:21:00.000+03:00", "replies_count": 0, "uuid": "f4584c53a39ba79f10a5053b7e861fe06524d571"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/255046-obama-puts-spotlight-on-prescription-drug-abuse", "ord_in_thread": 0, "title": "Obama puts spotlight on prescription drug abuse | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 26, 2015, 06:00 am Obama puts spotlight on prescription drug abuse By Bradford Richardson \nPresident Obama is asking Americans to dispose safely of their unwanted prescription drugs in an effort to draw attention to a growing substance-abuse problem in the country. \n“More Americans die every year from drug overdoses than they do in car crashes,” Obama said in his weekly address on Saturday. “And most of those deaths aren’t due to drugs like cocaine or heroin – but rather prescription drugs.” \nThe president said prescription drug abuse often serves as a gateway to heroin use. ADVERTISEMENT “Many prescription pain medications belong to the same class of drug as heroin,” Obama said. “In fact, four in five heroin users started out by misusing prescription drugs.\"\nHe also pointed to statistics that show heroin use is on the rise in America, climbing 33 percent from 2013 to 2014. \nThe president said addressing America’s drug problem would reduce the cost of a burgeoning prison system. \n“Rather than keep spending billions of taxpayer dollars on needlessly long prison sentences for nonviolent drug offenders, we could save money and get better outcomes by getting treatment to those who need it,” Obama said. \n“And we could use some of the savings to make sure the brave men and women of law enforcement have the resources they need to go after drug kingpins and violent gangs, disrupt the flow of drugs into our country, and address the real threats to our communities.” \nThe president also proposed increasing federal funds to address substance abuse, building on his 2011 Prescription Drug Abuse Prevention Plan. \nObama also vowed to keep attention on the issue. \n\"This is something I’ll be talking about more in the weeks to come, in communities across the country,\" he said. \"Because it’s a challenge we can solve if we work together.\" Tags: ", "external_links": [], "published": "2015-09-26T14:21:00.000+03:00", "crawled": "2015-09-26T14:21:34.363+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}