{"organizations": [], "uuid": "db79d1bc072b90e77c6756cd924e45a0c8b3e9ff", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamakingsalman.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/252765-obama-aims-to-ease-saudi-arabias-concerns-about-deal-with-rival-iran", "country": "US", "title": "Obama aims to ease Saudi Arabia's concerns about deal with rival Iran", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama aims to ease Saudi Arabia's concerns about deal with rival Iran", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-04T17:07:00.000+03:00", "replies_count": 0, "uuid": "db79d1bc072b90e77c6756cd924e45a0c8b3e9ff"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/defense/252765-obama-aims-to-ease-saudi-arabias-concerns-about-deal-with-rival-iran", "ord_in_thread": 0, "title": "Obama aims to ease Saudi Arabia's concerns about deal with rival Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama aims to ease Saudi Arabia's concerns about deal with rival Iran Getty Images By Jordan Fabian - 09/04/15 10:07 AM EDT \nPresident Obama on Friday met with King Salman of Saudi Arabia and sought to ease his concerns about the nuclear deal with Iran. The king's first White House visit comes at a pivotal time. The international agreement is almost certain to take effect now that Obama has marshaled enough votes to ensure Congress can't kill the deal when lawmakers vote on it this month. ADVERTISEMENT Officially, Saudi Arabia supports the deal. But its leaders are concerned that lifting sanctions on Iran could allow it to expand its regional influence and further destabilize the Middle East. The Obama administration is reportedly finalizing a new $1 billion arms deal with Saudi Arabia, according to The New York Times , a move designed to address the Saudis' security fears. No announcements were made about weapons deals. But two leaders said they would discuss the implementation of the Iran deal, conflicts in the Middle East and security cooperation. \"This is obviously a challenging time in world affairs, [particularly] in the Middle East,\" Obama said. \"So we expect this to be a substantive conversation across a wide range of issues.\"The Saudis and Iran have long been rivals, and they are pitted against each other in a number of regional conflicts. They include the Syrian civil war, where Iran is boosting President Bashar Assad, and the war in Yemen, where a group of Gulf Arab states are fighting against Iran-backed Houthi rebels.The conflict in Syria has been thrust back into headlines. Growing violence there has caused tens of thousands to flee to Europe, triggering a migrant crisis on the continent. Obama said he would discuss the crisis in Syria with Salman, including a plan to \"finally end the horrific conflict there.\"The Saudi government is also looking for increased assistance in its efforts to combat the Islamic State in Iraq and Syria (ISIS).Its principal concern is that Iran will funnel money it receives from sanctions relief to boost the military forces of Assad and the Houthis. Administration officials say Iran could receive $56 billion once the sanctions are lifted, though that step is conditional on it taking steps to curb its nuclear program.\"We'll discuss the importance of effectively implementing the deal to ensure that Iran does not have a nuclear weapon while counteracting its destabilizing activities in the region,\" Obama said. But the White House is convinced that Iran will use almost all of the money to prop up its sagging economy, which has been crippled by years of international sanctions. It’s not clear if those assurances will be enough to smooth over the U.S. and Saudi's differences on the Iran deal. There were open tensions in May, when Salman skipped a Gulf state summit at Camp David designed to enhance security cooperation with the United States. The White House and the Saudis both denied that Salman's absence was designed to send a message on Iran. Those divisions were not on display Friday. \"I'm happy to come to a friendly country to meet a friend,\" Salman said through a translator. \"We want to work together for world peace, our region must achieve stability, which is essential for the prosperity of its people.\"", "external_links": [], "published": "2015-09-04T17:07:00.000+03:00", "crawled": "2015-09-05T08:14:22.882+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}