{"organizations": [], "uuid": "955b1cc11bff926ab3d4e57927ae56b78f8b978e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/michael-dear/dousing-the-flames-of-immigration_b_8148744.html", "country": "US", "title": "Dousing the Flames of Immigration Rhetoric with Facts | Michael Dear", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Dousing the Flames of Immigration Rhetoric with Facts | Michael Dear", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-22T01:45:00.000+03:00", "replies_count": 0, "uuid": "955b1cc11bff926ab3d4e57927ae56b78f8b978e"}, "author": "Michael Dear", "url": "http://www.huffingtonpost.com/michael-dear/dousing-the-flames-of-immigration_b_8148744.html", "ord_in_thread": 0, "title": "Dousing the Flames of Immigration Rhetoric with Facts | Michael Dear", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The European Union confronts a massive crisis as migrants and refugees flood across its borders. Anti-immigrant sentiment has led Hungary to begin building a fence along its border with Serbia in order to keep migrants out. In response, Mr. Jean-Claude Juncker , president of the European Commission, reminded us that walls won't work: \"We can build walls; we can build fences. But imagine for a second if it were you, your child in your arms, the world you knew torn apart around you. There is no price you would not pay; there is no wall you would not climb.\"\nSuch realism (and empathy) from a major European politician contrasts strongly with current rhetoric in the US. Fueled by the inflammatory remarks of a number of presidential candidates, the immigration 'debate' in this country is plumbing new depths of intolerance and insult. It is time to counter such rhetoric with facts.\nWhen he took office in 2008, President Obama continued the policies of his predecessor by emphasizing enforcement as the core element in Department of Homeland Security (DHS) efforts to curtail unauthorized migration. His approach had two thrusts : first, a strategy of \"prevention through deterrence\" which assumed that a concentration of resources (e.g. wall-building, increased policing, and expansion of surveillance technology) would deter unauthorized crossers; and second, \"enforcement with consequences\" would discourage border transgressions by imposing tougher penalties for offenders.\nBy 2012, the Obama administration was spending nearly $18 billion annually on these \"enforcement first\" strategies, effectively making it the nation's number one immigration policy. By being tough on undocumented immigration, Obama anticipated that his later efforts at reform would be more likely to succeed.\nThe US Border Patrol (USBP) collects information on many enforcement indicators, but none explicitly measures the volume of undocumented border crossings, nor the extent to which the border is in fact 'secure.' Of course, accurate information on either is hard to come by. But in the absence of reliable indicators, it is impossible to demonstrate conclusively the specific contribution that DHS enforcement strategies have made. However, the following facts are known .\nBy January 2013, the DHS had installed a total of 651 miles of fencing along the border: 352 miles to stop pedestrians, and 299 miles to block vehicles. This total was only two miles short of the distance identified by the USBP as \"appropriate\" for barrier construction (some land is simply too steep to build on, and fencing across water boundaries is impractical). During the most frenzied period of construction (2006-2009), the extent of fencing grew from roughly 150 to 600 miles. After that, the rate of construction quickly leveled off, and few extra miles have since been added.\nIn order to complete these enormous fortifications quickly, Congressional appropriations (which included money for surveillance technology) increased from $25 million in 1996 to $298 million in 2006, peaking at $1.5 billion in 2007. Since then, expenditures on these so-called \"tactical infrastructure appropriations\" steadily dropped, to $324 million in 2013.\nThe number of border patrol agents along the line more than doubled after 2000, to over 20,000 personnel, with growth concentrated in the sectors of major undocumented crossing activity (Tucson and El Paso).\nImmigration enforcement actions resulted in almost 421,000 migrant apprehensions in 2013, the lowest level since the early 1970s . Almost two-thirds of these apprehensions were made by the USBP, and the remainder by Immigration and Customs Enforcement (ICE) officials acting in the US interior. It's worth reminding presidential aspirants of two facts: many of those apprehended were not Mexicans, but \"OTMs\" (Other Than Mexicans, from far-distant countries such as Brazil and China), as well as child refugees escaping persecution in Central America; and that \"Catch and Release\" policies are long gone - nowadays our practice is \"Catch and Detain, then Prosecute and Deport.\"\nIn the five years up to 2014, there were 2 million deportations from the US, the highest level ever recorded. A historic high of 438,000 people were removed in 2013 alone. Two-thirds of all deportations were from the border region, the rest from the US interior. When immigration reform initiatives stalled in the House of Representatives, Obama stepped in to slow deportation rates, using his executive authority.\nIn both the Obama and G. W. Bush administrations, \"Secure Communities\" became the signature program designed to deport serious criminals from the US. However, in practice, a large majority of those deported had no criminal record, but only convictions related to immigration-related offenses. In response to nationwide push-back from communities opposed to involving local police in federal law enforcement, the DHS conceded that Secure Communities had failed to meet its avowed objectives, and terminated the program in 2015 .\nAnd what has been the overall impact of the DHS enforcement strategies? During the 1980s and 1990s, increased border security measures did not stem the rates of undocumented migration. However, between 2005 and 2011 (using the best measures available), the number of apprehensions fell sharply, and outflows of Mexicans from the US began to exceed inflows. As a consequence, the unauthorized migrant population living in the US fell from 12.4 million in 2007 to 11.1 million in 2011.\nHow much did DHS enforcement actions contribute to these changes? In all likelihood, they had some effect, but many other factors influenced the downward trends , including reduced job opportunities in the US due to economic recession; rising deaths and injuries incurred by border-crossers; increased exposure to personal violence, such as kidnapping for ransom; and the spiraling costs of assisted border passages. In addition, improvements in the Mexican economy reduced the numbers of people intending to cross over to the US.\nVery few people doubt that securing borders is a legitimate national goal. A majority of citizens regards comprehensive immigration reform as vital to our socio-economic well-being and national security. The facts about migration from and via Mexico are well known. Yet too many presidential hopefuls seem more intent on securing their electoral base, employing an inflammatory rhetoric vilifying Mexicans, urging billions of dollars for yet more walls, and vying to trump one another's \"tougher-than-thou\" posture on immigration. It's time for fashioning realistic solutions based on factual evidence (and compassion).\nMICHAEL DEAR is professor in the College of Environmental Design at the University of California, Berkeley. A paperback edition of his book, Why Walls Won't Work: Repairing the US-Mexico Divide (including a new chapter on what should be done about the border walls ) is available from Oxford University Press.\nMore: Mexican Border Immigration Immigration Reform Border Wall Dhs Border Security Migration Crisis Undocumented Immigrants Latino Politics This Blogger's Books and Other Items from... Why Walls Won't Work: Repairing the US-Mexico Divide\nby Michael Dear", "external_links": ["http://www.dhs.gov/sites/default/files/publications/ois_enforcement_ar_2013.pdf", "http://blog.oup.com/2015/08/take-down-the-wall/", "http://www.dhs.gov/sites/default/files/publications/14_1120_memo_secure_communities.pdf", "http://www.nytimes.com/2015/09/10/world/europe/europe-migrant-crisis-jean-claude-juncker.html?hp&action=click&pgtype=Homepage", "https://www.fas.org/sgp/crs/homesec/R42138.pdf", "http://www.amazon.com/", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.migrationpolicy.org/research/immigration-enforcement-united-states-rise-formidable-machinery", "http://ecx.images-amazon.com/images/I/51IzqeN5BrL._SL160_.jpg", "http://www.nytimes.com/2015/09/02/business/economy/trumps-shaky-stance-on-illegal-immigration.html?ref=topics&_r=0", "http://www.amazon.com/exec/obidos/ASIN/0199897980"], "published": "2015-09-22T01:45:00.000+03:00", "crawled": "2015-09-22T03:45:53.085+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}