{"organizations": [], "uuid": "15ab1f231659f0a09aed62eaef7490b669970204", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/ballot-box/250867-sanders-v-klein-on-immigration-the-old-left-against-the-adolescent-left", "country": "US", "title": "Sanders v. Klein on immigration: The old Left against the adolescent Left", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Sanders v. Klein on immigration: The old Left against the adolescent Left", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-12T17:00:00.000+03:00", "replies_count": 0, "uuid": "15ab1f231659f0a09aed62eaef7490b669970204"}, "author": "Ian Smith", "url": "http://thehill.com/blogs/ballot-box/250867-sanders-v-klein-on-immigration-the-old-left-against-the-adolescent-left", "ord_in_thread": 0, "title": "Sanders v. Klein on immigration: The old Left against the adolescent Left", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 12, 2015, 10:00 am Sanders v. Klein on immigration: The old Left against the adolescent Left By Ian Smith \nThe recent fiery to-and-fro between old-style social democrat Sen. Bernie Sanders (I-Vt.), and Vox-founder Ezra Klein was a perfect illustration of just how long it’s been since the Left was right on immigration. Klein, an immigration-novice who once stated we need open-borders or else the quality of Chinese restaurants would decline, attempted to rebut Sanders’ once-uncontroversial notion that excessive immigration depresses wages, by touting the increasingly popular, yet evidence-free, idea that an open-borders policy can actually solve global inequality. Although Klein’s response was less thoughtful assessment, more emotional spasm, it’s become standard argumentation for contemporary facts-be-damned Democrats. \nRefuting Sanders’ argument that “open-borders” debases American sovereignty and hurts working people, Klein stated that the question was really a more ‘philosophical’ one. By making the “global poor richer”, he said, what immigration policy should really be based on is a ‘weighting’ between national sovereignty and global inequities. This overly moralistic but increasingly common position is a major subject of a new book on immigration: How Many Is Too Many? by Philip Cafaro. A philosophy professor himself, as well as a progressive against open-borders, Cafaro pillories his fellow leftists when they apply “overly abstract” and “highly general ethical principles” to a “particular policy issue in a specific time and place.” This usually shows, he writes, they have “little apparent understanding of the effects [such] proposals might have on the people living in that society.” This is indeed a fair sketch of the left today. ADVERTISEMENT This wasn’t always the case, however. Progressives who understood the ironclad rule of economics that increasing labor supply decreases wages have included such notable names as Barbara Jordan, Cesar Chavez, Coretta Scott King, Ralph Nader, Gene McCarthy, Arthur Schlesinger, Glenn Greenwald (more on him below) and Michael Lind. By sidestepping such cause-and-effect basics, open-borders liberals like Klein are fast-becoming the creationists of labor economics. \nKlein’s puddle-deep inequality solution should immediately strike serious analysts as problematic. For starters, his math is way off. Considering we take in 1 to 1.5 million (legal) immigrants per year and the globally impoverished amounts to around 1 to 1.5 billion , it’s difficult to see how mass immigration into the U.S. could make any difference whatsoever—this also assumes most of the global poor even have the means to travel here. \nSecond, using immigration as a cheap form of foreign aid could actually make things worse globally. Mass immigration enables Third World governments to continue their chronically corruptive policies as it lets their oppressed subjects simply move elsewhere instead of rallying for much-needed domestic reforms. Despite large portions of Central America’s population now living in the US, progress toward economic justice in the region has for decades at best been flat. Expanding immigration has not and will not solve the sending-country’s problems and the migrant-waves we see today will likely only cease once the host-nation (that is, us) grows so socially stratified as a result that it begins to resemble the very sending-country itself. \nKlein should read Cafaro’s book. Like most open-borders pushers, he appears to be treating national boundaries as morally arbitrary, a topic Cafaro takes on forcefully and skilfully. Rebuking writer Martha Nussbaum , who’s take on sovereign borders is similar to Klein’s, Cafaro writes that although “[a]rbitrary or artificial boundaries may be out of favour with the jet-setting global intelligentsia…[b]orders remain morally relevant, because we have different and stronger responsibilities to our fellow citizens than we have to the rest of humanity.” “Limiting immigration” he writes further, “recognizes our responsibilities to poor people within our borders and to our descendants to create a more egalitarian and sustainable society.” Amen. \nKlein should more deeply consider what elites like himself owe the less privileged in his own society. People within the “one percent” (like himself), aren’t just in the West; they’re now all over the world, including the Third World. Who should be first in line to help the poor and oppressed in their countries? Us or them? \nPutting people in foreign countries before your fellow citizens is actually an old phenomenon. Psychologists call it ‘ xenophilia .’ Charles Dickens called it “ Telescopic Philanthropy ”, in his portrayal of Bleak House ’s Mrs. Jellyby who disregarded her duties as a mother to obsess over the ordeals of an obscure tribe in faraway Africa. Viewing immigration as a form of foreign aid is modern day Telescopic Philanthropy. \nMost revealing about the Vox interview was Klein’s refusal to confront Sanders’ points directly. Instead, Vox editorialists simply sidestepped the issue and labelled Sanders’ views as “ ugly .” Want to control who comes here? Believe in national sovereignty? You’re ugly . \nSuch an intellectually emasculated response regarding a crucial area of policy shows the generational chasm between kids like Klein and seasoned activists like Sanders. Glenn Greenwald likewise has taken a similar ‘borders-are-mean’ approach. When he retracted his once-thoughtful position against mass immigration, his reversal was simply to call restrictionists “evil.” \nIt could only be that Democrats, like Klein and Greenwald, are at least in part, addicted to a sense of moral superiority. How else to explain treating basic unemployment facts like kryptonite? Hard analysis on immigration is simply gone from the Contemporary Left. In its place has become an approach to argumentation that’s based on pathetic anecdote, moral preening, and incoherent (and insulting) civil rights analogising . These are not adult responses to a serious issue. \nOpting to discuss a serious area of public policy as if it’s a good-versus-evil morality play actually puts restrictionists on the back-foot. How to argue with someone who puts their position in moral terms? Policy based on morality and compassion can have no cost-benefit analysis. Future costs are not taken into account, because there simply is no cost analysis . \nThe Contemporary Left, unlike the old-style Left represented by people like Sanders and Nader , simply have no consideration for their working-class fellow citizens. Now, it’s simply about ‘ugliness.’ But do actual working people care about ‘ugliness’? Unlike opinion journalists such as Klein, feel-good moralizing won’t pay their bills. \nSmith is an investigative associate with the Immigration Reform Law Institute.", "external_links": [], "published": "2015-08-12T17:00:00.000+03:00", "crawled": "2015-08-12T17:26:25.386+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}