{"organizations": [], "uuid": "23209410a9d43eecca23935be54c54dae744612f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/trumpclinton2.png", "site_section": "http://thehill.com/rss/syndicator/19110#", "section_title": "TheHill - Most Popular", "url": "http://thehill.com/blogs/ballot-box/presidential-races/254338-trump-clinton-created-birther-attacks-on-obama", "country": "US", "title": "Trump: Clinton created birther attacks on Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trump: Clinton created birther attacks on Obama", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-21T15:08:00.000+03:00", "replies_count": 0, "uuid": "23209410a9d43eecca23935be54c54dae744612f"}, "author": "Mark Hensch", "url": "http://thehill.com/blogs/ballot-box/presidential-races/254338-trump-clinton-created-birther-attacks-on-obama", "ord_in_thread": 0, "title": "Trump: Clinton created birther attacks on Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump on Muslims: 'A lot of people... \"Ben was saying there are difficulties,” Trump said. Airports blame airlines for... The aviation industry is split as a deadline for extending FAA looms. Carson ignites firestorm with... Cruz, Paul among Republicans who criticize Carson comments. Clinton expected to break with... Hillary Clinton will seek to align herself with ObamaCare’s successes. AFL-CIO boss: Walker is 'still a... Walker had taken on unions in Wisconsin and vowed to do so again as... House votes to freeze federal... GOP leaders hope the legislation will help avert a government shutdown. Carson softens Muslim remarks Carson said as long as someone follows the Constitution, he's fine with... Big pharma attacks Clinton’s plan... The proposals are getting a cold reception from across the healthcare... 'South Park' takes on Trump The cartoon is lampooning Trump in an episode Wednesday titled \"Where My... Court rules against ObamaCare... The federal appeals court said the rule was a \"substantial burden\" on... Sanders to press Pope Francis to... Sanders will rally Tuesday with Capitol workers who are calling for a $15... Sanders dons 'black-eyed peas... Host Larry Wilmore joked that all Sanders needs is a hat like Donald Trump. Petraeus apologizes to Congress... The former CIA chief testified in front of Congress for the first time in... McConnell fast-tracks bill to... The measure passed the House last week. Huckabee rips Obama as 'most anti-... Huckabee said Obama is insulting the pope by inviting gay rights and pro-... Obama administration declares... The administration released a report outlining recommendations for...", "external_links": [], "published": "2015-09-21T15:08:00.000+03:00", "crawled": "2015-09-22T21:13:10.228+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}