{"organizations": [], "uuid": "1c3b30b95cd2177319f5e39e3da3c3004ec71681", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/blogs/floor-action/house/255336-house-votes-to-exclude-abortion-providers-from-medicaid", "country": "US", "title": "House votes to exclude abortion providers from Medicaid", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House votes to exclude abortion providers from Medicaid", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-29T23:33:00.000+03:00", "replies_count": 0, "uuid": "1c3b30b95cd2177319f5e39e3da3c3004ec71681"}, "author": "cmarcos@thehill.com (Cristina Marcos)", "url": "http://thehill.com/blogs/floor-action/house/255336-house-votes-to-exclude-abortion-providers-from-medicaid", "ord_in_thread": 0, "title": "House votes to exclude abortion providers from Medicaid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 29, 2015, 04:33 pm House votes to exclude abortion providers from Medicaid By Cristina Marcos \nThe House passed legislation on Tuesday to give states flexibility to withhold Medicaid funding from health providers that offer abortions. \nPassage of the bill on a 236-193 vote is timed as conservatives demand to defund Planned Parenthood amid tension surrounding its use of fetal tissue donations. \nWithin a day, the House is expected to clear a government spending bill lasting through Dec. 11 that’s free of policy riders as soon as the Senate passes it. The federal government will shut down Oct. 1 absent congressional action. ADVERTISEMENT Current law already prohibits the use of federal funds to pay for abortions, with exceptions for rape, incest or if the mother’s life is in danger.\nBut the legislation passed on Tuesday would expand states’ ability to terminate Medicaid contracts with individuals or health entities that perform abortions. However, the flexibility would not apply to health providers that only offer abortions to cases of rape, incest or protecting the mother’s life, as outlined by statute known as the Hyde Amendment. \n“There are no mandates in this bill. The final decision is up to the states,” said Rep. Marsha Blackburn (R-Tenn.). \nEarlier this month, the House passed a measure to freeze federal Planned Parenthood funding for one year while Congress conducts an investigation. \nSenate Democrats blocked a spending bill that included a provision eliminating Planned Parenthood last week, which in turn led to considering a version free of policy riders. \nDemocrats noted that the House had not yet voted on the spending bill, yet was debating another abortion-related measure. \n“Let’s call this bill what it is. It’s an attempt to eliminate health care services for women across the board using the Planned Parenthood witch hunt as an excuse,” said Rep. Diana DeGette (D-Colo.). Tags: 1 day Republican gets into shouting... Rep. Jim Jordan sparred with Planned Parenthood President and CEO Cecile... Post-White House, first lady wants... \"I want to go to Target. I want to drive,\" she said. GOP: Planned Parenthood wasted... Rep. Jason Chaffetz said the organization racked up “exorbitant travel... Boehner, McConnell, Obama to take... The talks could give Boehner a last chance at a big deal with President... Report: Trump prays with religious... African-American pastors were particuarly impressed, an attendee says. Yes, illegal aliens have... The Supreme Court settled the issue well over a century ago. Clinton opposes ObamaCare Cadillac... The controversial tax would be implemented by the next president. House invokes 'martial law' to... The maneuver allows GOP leaders to bring up a spending bill faster to... Fiorina under attack from left on... Watchdog cites video showing Fiorina referring to court decision as the \"... Paul slams spending bill The Kentucky Republican said Congress is a \"withering shadow.\" Clinton may not have turned over... The previously undisclosed emails are likely to incite new anger from... Lewinsky launches anti-bullying... She's teaming up with celebs including Michael J. Fox and Olivia Wilde for... GOP unloads on Planned Parenthood... Richards faced a barrage of attacks from nearly two-dozen lawmakers over... Dem accuses GOP of 'misogyny' at... Rep. Gerry Connolly blasted the \"disrespect\" shown to the group's... Media thumps Trump, but polls show... Despite an eight-point drop in one poll, Trump is the clear GOP front-... Top Brookings economist forced out... Sen. Elizabeth Warren questioned research funded by the business community. ObamaCare repeal bill advances in... \"We’re going to repeal the five worst parts of the law,\" Rep. Paul Ryan... McConnell, Boehner open budget... The two GOP leaders spoke to Obama last week. Signs of discontent in Republican... Conservatives had hoped Rep. Trey Gowdy would enter the majority leader... Spacey: Underwood 'would kill'... Both men, Spacey says, are fictional characters. House GOP holds post-Boehner '... The two-hour members-only gathering took place in a room in the Capitol’s...", "external_links": [], "published": "2015-09-29T23:33:00.000+03:00", "crawled": "2015-09-30T03:51:14.375+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}