{"organizations": [], "uuid": "071bc7e28782bbe8b0c2e20954adfb27060c8ff3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/senatedems_091615gn.jpg", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/policy/healthcare/254497-dems-block-20-week-abortion-ban", "country": "US", "title": "Democrats block 20-week abortion ban", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Democrats block 20-week abortion ban", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-22T18:29:00.000+03:00", "replies_count": 0, "uuid": "071bc7e28782bbe8b0c2e20954adfb27060c8ff3"}, "author": "Peter Sullivan", "url": "http://thehill.com/policy/healthcare/254497-dems-block-20-week-abortion-ban", "ord_in_thread": 0, "title": "Democrats block 20-week abortion ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Democrats block 20-week abortion ban By Peter Sullivan - 09/22/15 11:29 AM EDT \nSenate Democrats on Tuesday blocked a Republican bill that would ban most abortions after 20 weeks of pregnancy. \nThe measure failed to advance in a 54-42 vote, falling short of the 60-vote threshold needed. ADVERTISEMENT Democratic Sens. Robert Casey, Jr. (Pa.), Joe Donnelly (Ind.) and Joe Manchin (W.Va.), who all oppose abortion rights, joined Republicans in voting to advance the bill. Republican Sens. Susan Collins (Maine) and Mark Kirk (Ill.), who support abortion rights, voted against it.\nThe vote comes amid a roiling debate over Planned Parenthood funding that could lead to a government shutdown on Oct. 1. \nRepublican leaders are hoping the vote on the 20-week abortion ban, which comes the same day that Pope Francis arrives in Washington, will help give members a chance to register their anti-abortion views without running the risk of a government shutdown. \nThe measure would ban abortions after 20 weeks of pregnancy except in cases of rape, incest, or when the life of the mother is at risk. The ban after 20 weeks is based on the idea that a fetus can feel pain at that point in its development, something that remains a matter of fierce debate. \nRepublicans also pointed out that only seven countries in the world allow abortions after 20 weeks. \n“It’s legislation that would allow America to join the ranks of most civilized nations when it comes to protecting the most innocent and vulnerable of life,” Senate Majority Leader Mitch McConnell (R-Ky.) said on the Senate floor. \nOpposing the bill, Planned Parenthood argued that abortions after 20 weeks are extremely rare, but are sometimes necessary for medical reasons, like if the baby has a lethal disease that would cause them to die shortly after birth. \n“Passing this law would put women in unimaginable situations — needing to end a pregnancy for serious medical reasons, but unable to do so,” said Planned Parenthood Executive Vice President Dawn Laguens. \nSenate Democratic Leader Harry Reid (Nev.), meanwhile, accused McConnell of “pandering to the extremists in his party” while the clock ticks toward a shutdown. \n“Instead of coming to grips with the reality of the situation, and working with Democrats to avoid a government shutdown, the Republicans seem more interested in political theater,” Reid said. \nThe 20-week bill has already passed the House. \nSpeaker John Boehner (R-Ohio) assailed Senate Democrats for blocking the bill, calling their stance “indefensible.” \n“Science and medical research has shown that by 20 weeks in the womb — five months of pregnancy — unborn babies are capable of feeling pain. It is morally wrong to inflict pain on an innocent human being, but that’s exactly what Senate Democrats and President Obama are supporting by opposing this humane bill,” Boehner said in a statement. \nIf the ban were ever signed into law, it would almost certainly face a court challenge. Federal courts have in the past struck down some state 20-week laws as violating Supreme Court precedent protecting abortions up to the point of viability, generally considered to be around 24 weeks. Some state bans remain in place. \nAs for the way forward to avert a shutdown, Senate Majority Whip John Cornyn (R-Texas) has indicated that the Senate will later vote on a spending bill that defunds Planned Parenthood. \nThat measure would certainly be blocked by Senate Democrats, after which the Senate would move to vote on a “clean” continuing resolution that does not defund the organization. \nNo plans are finalized, however, and it remains unclear if House Republicans will accept a “clean” funding bill. \n— This story was updated at 1:10 p.m.", "external_links": [], "published": "2015-09-22T18:29:00.000+03:00", "crawled": "2015-09-22T22:44:33.635+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}