{"organizations": [], "uuid": "b39250fdf880efa8562f3169e5388a443b3119b1", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaboehner_092515getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/254964-obama-boehner-a-good-man-a-patriot", "country": "US", "title": "Obama: Boehner a 'good man,' a 'patriot'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Boehner a 'good man,' a 'patriot'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T20:39:00.000+03:00", "replies_count": 0, "uuid": "b39250fdf880efa8562f3169e5388a443b3119b1"}, "author": "Katie Bo Williams", "url": "http://thehill.com/homenews/administration/254964-obama-boehner-a-good-man-a-patriot", "ord_in_thread": 0, "title": "Obama: Boehner a 'good man,' a 'patriot'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Boehner a 'good man,' a 'patriot' By Katie Bo Williams - 09/25/15 01:39 PM EDT President Obama on Friday said despite his differences with John Boehner, the retiring Speaker was a \"good man\" and a \"patriot.\" \"He cares deeply about the House,\" the president said. \"He cares about his constituents and he cares about America.\" The Ohio Republican was \"someone who understands … you have to work with people you disagree with, sometimes strongly, in order to do the people’s business,\" Obama added. The president called on Boehner's successor to work to prevent government shutdowns. “My hope is there’s a recognition on the part of the next speaker — something I think [Boehner] understood, although at times it was challenging to bring his caucus along — that we can have significant differences but that doesn’t mean you shut down the government,” Obama told reporters Friday. “In our democracy, you don’t get what you want 100 percent of the time,” he added. The president noted, though, that he would not \"prejudge\" Boehner's successor. Obama said Boehner’s announcement caught him by surprise as he was coming out of a meeting with Chinese President Xi Jinping this morning. House members were also caught by surprise . The House leader told GOP lawmakers in a closed-door conference that he will resign from both his Speakership and his House seat, effective Oct. 30. “He didn’t give anyone a heads-up. This was a surprise to all of us,” Rep. Darrell Issa (R-Calif.), former chairman of the House Oversight and Government Reform Committee, told reporters after the meeting. Rep. Nancy Pelosi (D-Calif.) said the resignation was a “stark indication of the disarray of the House Republicans.” Boehner’s Speakership has been under pressure for months, as debate over Planned Parenthood and government spending drove a rift between the Ohio Republican and conservatives. The latest spending fight is indicative of an historically contentious relationship between Boehner and the more right-leaning wing of the GOP, which has bucked his leadership and repeatedly threatened to unseat him. Rep. Mark Meadows (R-N.C.), a co-founder of the Freedom Caucus, introduced a measure before the August recess that could have led to Boehner’s ouster. He and other conservatives have since floated the possibility that they would force a vote on the measure. Rep. Thomas Massie (R-Ky.) called the resignation “inevitable,” accusing Boehner of abusing his power as Speaker. There seems to be no consensus on a likely successor. Lawmakers coming out of the Friday morning meeting didn’t offer any possible candidates’ names, although Majority Leader Kevin McCarthy (R-Calif.) is seen as a strong possibility. Obama indicated he didn’t see the Republican conference moving in a fundamentally new direction under new leadership. “I suspect that there’s going to be a lot of debate within the Republican caucus about who they want to lead them and in what direction,” President Obama said. “It’s not as if there’s been a multitude of areas where the House Republican caucus has sought cooperation previously. I don’t necessarily think there’s going to be a big shift.” Tags:", "external_links": [], "published": "2015-09-25T20:39:00.000+03:00", "crawled": "2015-09-25T20:44:49.195+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}