{"organizations": [], "uuid": "1501e1b1be8e35598299df0cc9795ec08f61abc4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3249096/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/mary-anne-hitt/americans-from-coast-to-c_b_7927730.html", "country": "US", "title": "Americans From Coast to Coast Cheer Major Climate Action Announced Today by President Obama, EPA | Mary Anne Hitt", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 3, "title_full": "Americans From Coast to Coast Cheer Major Climate Action Announced Today by President Obama, EPA | Mary Anne Hitt", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-03T23:09:00.000+03:00", "replies_count": 2, "uuid": "e837996c7a7697520284c787d253907cddceaeac"}, "author": "Mary Anne Hitt", "url": "http://www.huffingtonpost.com/mary-anne-hitt/americans-from-coast-to-c_b_7927730.html#post-0", "ord_in_thread": 0, "title": "Americans From Coast to Coast Cheer Major Climate Action Announced Today by President Obama, EPA | Mary Anne Hitt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Today President Obama and the Environmental Protection Agency (EPA) took a major step in the fight against climate disruption by releasing the Clean Power Plan . Until today, there were no limits on the amount of carbon pollution that power plants could dump into our air, wreaking havoc on our health and our climate.\nMore often than not, the power plants spewing this dangerous carbon pollution have a disproportionately negative effect on low-income communities and communities of color already suffering from toxic pollution's worst effects, including heart attacks, asthma, and premature death.\nCleaning up carbon pollution will help protect public health : Coal pollution in the United States results in more than $100 billion annually in health costs and more 12,000 emergency room visits per year. Polluters are putting their profits ahead of people and the environment, and it's time for that to end.\nAlso important, by establishing carbon pollution protections, President Obama and the EPA are beginning the essential work of cleaning up and modernizing the way we power our country. This creates jobs and boosts the economy. Several studies out recently show the positive economic impact possible with the Clean Power Plan.\nAmericans strongly support this climate action, with polls from this year showing that nearly 70 percent of Americans across party lines support the Clean Power Plan .\nRegular Americans aren't just cheering this announcement -- they were key to making it happen. In July, we announced the 200th U.S. coal plant retirement , and clean, renewable energy is at record levels. Grassroots advocacy made that happen, and as a result, the U.S. is leading the industrialized world in reducing carbon emissions, and we are are on track to meet -- and even exceed -- the carbon reduction targets in the Clean Power Plan.\nOne of those hard working advocates is Verena Owen, the volunteer leader of the Beyond Campaign and a long time champion for clean air. Here's what she had to say about today's announcement:\n\"I am excited by how much the Clean Power Plan will benefit communities and families in the form of lower electricity bills, better health, increased clean energy, and more jobs,\" said Verena. \"The American people overwhelmingly support these efforts. And to know how much work grassroots activists have put into getting this national climate action to happen - it's thrilling to see yet again how much of a force the people can be when we work together.\"\nThis is the U.S. taking the lead on climate action , and with the international climate meetings happening this fall in Paris, it is a powerful example for other countries to follow, and it's already bringing other nations to the table with strong plans of their own.\nWe applaud the EPA and the Obama administration for taking this strong step for people and the planet - and I thank the thousands upon thousands of activists nationwide who have marched, rallied, protested, written letters, made calls, and so much more demanding serious climate action from our leaders.\nFollow Mary Anne Hitt on Twitter: www.twitter.com/maryannehitt\nMore: Energy Environment Coal Green Energy Sierra Club EPA Clean Power Plan", "external_links": ["http://thinkprogress.org/climate/2015/07/24/3684179/epa-power-plan-savings-report/", "http://www.bizjournals.com/atlanta/blog/capitol_vision/2015/07/study-carbon-reductions-lower-bills-both-possible.html", "http://www.reviewjournal.com/business/energy/new-epa-mandated-plan-praised-potential-create-jobs-cut-utility-bills", "https://www.whitehouse.gov/the-press-office/2015/08/03/fact-sheet-president-obama-announce-historic-carbon-pollution-standards", "http://www.sierraclub.org/compass/2015/07/beyond-coal-milestone-coal-plant-200-announced-retire", "http://www.twitter.com/maryannehitt", "http://environment.yale.edu/climate-communication/files/Global-Warming-CCAM-March-2015.pdf", "http://content.sierraclub.org/press-releases/2015/08/sierra-club-statement-clean-power-plan", "http://yosemite.epa.gov/opa/admpress.nsf/0/0C8016E140B49CBE85257E96003BC4CF"], "published": "2015-08-03T23:09:00.000+03:00", "crawled": "2015-08-03T23:59:49.024+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}