{"organizations": [], "uuid": "72072398d0a3e56f22b228452a66d1668c9fe37f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3213066/images/o-NETANYAHU-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/james-zogby/obama-won-so-did-netanyah_b_8091984.html", "country": "US", "title": "Obama Won, So Did Netanyahu | James Zogby", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Won, So Did Netanyahu | James Zogby", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-05T17:10:00.000+03:00", "replies_count": 0, "uuid": "72072398d0a3e56f22b228452a66d1668c9fe37f"}, "author": "James Zogby", "url": "http://www.huffingtonpost.com/james-zogby/obama-won-so-did-netanyah_b_8091984.html", "ord_in_thread": 0, "title": "Obama Won, So Did Netanyahu | James Zogby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For the past several weeks, considerable attention was paid to the number of Democratic senators announcing their support for the Iran deal. The number needed to insure that the deal would go through was 34.\nAs the total came closer to the magic 34, media in the US and Israel were rife with analysis and commentary about what all this meant for Israel. Since the Israeli Prime Minister had invested so much personal capital in his effort to block the deal, and his US lobbying arm, AIPAC, had, likewise, made its defeat their number one priority, one could hardly blame liberal Jews for wanting to celebrate AIPAC's defeat or for some Israeli's to lament what they called \"Netanyahu's strategic blunder\".\nBoth views, however, are naïve and shortsighted. On several levels, Netanyahu won. Let me explain.\nIn the first place, since the mid-1990's Netanyahu and AIPAC have sought to divert US focus from the Israeli-Palestinian \"peace process\" to Iran. They succeeded. Two decades later, with Israel having moved to the far right and the Palestinians in near total disarray, there is no longer any serious discussion of Israeli-Palestinian peace.\nI would like to see President Obama pivot from his Iran deal \"victory\" to an international effort to end the occupation and secure Palestinian rights--but I'm not holding my breath. Having pushed senators to buck AIPAC on the deal, I suppose that the White House will hesitate before challenging Israel one more time.\nNext, by throwing what amounted to a political and diplomatic tantrum, the Israeli side succeeded in making itself the center of attention for the Administration and Congress. In the last few months, there were more meetings held, more hours spent, and more effort expended on reassuring Israel and its supporters of America's \"unbreakable, unshakable\" commitment, than in any period in our history. Not a week went by without reports of the President, Vice-President, or Secretary of State holding hours of meetings with supporters of Israel attempting to explain the deal and reaffirm their commitment.\nI've often described Netanyahu's bad behavior to that of a spoiled child who knows that when he misbehaves not only will there be no punishment, instead the over-indulgent parent will offer more love. The net effect has been the recognition that bad behavior not only makes you the center of attention, it also has the potential of reaping rewards.\nAnd speaking of rewards, the Administration is now offering Israel an enhanced security package totally $1.8 billion (Note: the Arabs will pay for their compensatory package, Israel will not). This new aid will be in addition to increases in US arms assistance and other add-ons, like Iron Dome, that Congress annually appropriates for Israel.\nSenators and members of Congress will also now be inclined to make clear their support for Israel. Many Democrats who announced their intention to support the president made sure that their statements declared undying support for Israel. The myth that \"AIPAC will beat you if you don't toe the line\" continues to hold strong, and so it can be expected that many members, despite their resentment of AIPAC and Netanyahu's pressure, will spend excessive time and energy between now and next November playing \"make up\" by proving their support for Israel.\nOne area where those who lament Netanyahu's miscalculations may have a point is their concern that he has made support for Israel a partisan issue dividing Democrats and Republicans. But this is only partially true. For the reasons outlined above, little will change in the short term. Israel will continue to get massive amounts of US assistance, with bipartisan support. There will be little or no real pressure from leaders in either party on Israel to end its occupation and denial of freedom for the Palestinian people. And while Republican presidential candidates will denounce President Obama for \"turning his back on Israel\", one shouldn't expect full-throated defense of the president from any of the Democratic contenders.\nNevertheless, a partisan split has developed on matters involving Israel. It predates Netanyahu, although his continued insults of the president and his noticeably Republican bias have greatly exacerbated this division. While not yet a Washington issue, polling shows that rank and file Democrats and progressives are fed up with the Israeli leader and his policies, and they want a more independent American policy toward the Israeli-Palestinian conflict. The emergence and rapid growth of liberal pro-Israel Jewish groups like J Street and Americans for Peace Now, or non-Zionist Jewish groups like Jewish Voice for Peace, or the expansion of the Boycott, Divestment, Sanctions movement on college campuses are all evidence of this shift. Also noteworthy was the immediate response of the progressive group Move On to support the president and oppose Chuck Schumer after the New York Senator announced his opposition to the Iran deal.\nAnd so put away the handkerchiefs or the celebratory banners, the net impact of Netanyahu's challenge will be a short-term gain for Israel. They and their supporters were the center of attention and the focus of lawmakers. In that regard, little has changed. But change is coming and dissent is fermenting. It just won't happen as quickly as is needed to put US policy on a corrected course toward the Israeli-Palestinian conflict.\nFollow @AAIUSA for more.\nFollow James Zogby on Twitter: www.twitter.com/AAIUSA\nMore: Barack Obama Barack Obama Barack Obama Benjamin Netanyahu Iran Deal Aipac Chuck Schumer Iran Israel", "external_links": ["https://twitter.com/AAIUSA", "http://www.twitter.com/AAIUSA"], "published": "2015-09-05T17:10:00.000+03:00", "crawled": "2015-09-05T16:32:45.252+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}