{"organizations": [], "uuid": "b7da50ccb6b9f525b735a7db2d67b199dc6eca3a", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/36/feed#", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/blogs/floor-action/senate/252999-senate-confirms-obama-court-nominee", "country": "US", "title": "Senate confirms Obama court nominee", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate confirms Obama court nominee", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-09T01:31:00.000+03:00", "replies_count": 0, "uuid": "b7da50ccb6b9f525b735a7db2d67b199dc6eca3a"}, "author": "jcarney@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/senate/252999-senate-confirms-obama-court-nominee", "ord_in_thread": 0, "title": "Senate confirms Obama court nominee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 08, 2015, 06:31 pm Senate confirms Obama court nominee By Jordain Carney \nThe Senate on Tuesday confirmed Roseann Ketchmark to be a U.S. district judge, marking the Senate’s sixth roll call vote on a judicial nomination this year. \nSenators voted 96-0 on Ketchmark's nomination, approving her to be a district judge for the Western District of Missouri. ADVERTISEMENT The vote comes after she was first nominated in November 2014. The Senate adjourned last year without confirming her, and her nomination was resubmitted in January with the start of the 114th Congress. \nDemocrats have criticized Republicans’ handling of judicial nominations, suggesting that it lags behind the number of judges confirmed by Democrats at this point in 2007 under then-President George W. Bush. \n“We're treating the third branch almost with contempt, with partisan contempt,” Sen. Patrick Leahy (D-Vt.), the ranking member of the Judiciary Committee, said Tuesday, adding that unless things change “we are heading toward a judicial vacancy crisis.” \nRepublican senators have blocked multiple attempts by Democrats to get unanimous consent to pass judicial nominations, including one by Sen. Charles Schumer (D-N.Y.) shortly before the August recess. \nSen. Chuck Grassley (R-Iowa), who blocked Schumer's request, said at the time that the Senate has confirmed more judges during Obama's time in office than it had during a similar point in Bush's tenure. \n“Had we not confirmed those 11 judicial nominees during the lame duck last year, we’d be roughly at the same place we were for judicial confirmations this year, compared to 2007,” he added. “So put that in your pipe and smoke it, the senator from New York.”", "external_links": [], "published": "2015-09-09T01:31:00.000+03:00", "crawled": "2015-09-09T22:45:38.397+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}