{"organizations": [], "uuid": "7c8bf716f7f4cb8c23a9d54908fb571513b73afe", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/trump_081215getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/251478-mexico-denounces-trump-immigration-plan-as-racist", "country": "US", "title": "Mexico denounces Trump immigration plan as racist", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Mexico denounces Trump immigration plan as racist", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-19T21:17:00.000+03:00", "replies_count": 0, "uuid": "7c8bf716f7f4cb8c23a9d54908fb571513b73afe"}, "author": "mmali@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/251478-mexico-denounces-trump-immigration-plan-as-racist", "ord_in_thread": 0, "title": "Mexico denounces Trump immigration plan as racist", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 19, 2015, 02:17 pm Mexico denounces Trump immigration plan as racist By Mark Hensch Getty Images \nMexico’s government is denouncing GOP presidential front-runner Donald Trump's immigration plan as racist, and says it will do harm to both countries. \n“We continue to stand by our position that these comments reflect prejudice, racism or plain ignorance,” Mexico’s foreign ministry said in a statement, according to The Guardian . \n“Anyone who understands the depth of the U.S.-Mexico relationship realizes that those proposals are not only prejudiced and absurd, but would be detrimental to the well-being of both societies.\" ADVERTISEMENT Mexican Foreign Minister José Antonio Meade Kuribreña is a vocal critic of Trump’s policies concerning his nation.\nAccording to The Guardian , a spokesman for Mexican President Enrique Peña Nieto refused to comment on the outspoken billionaire’s immigration platform when approached on Tuesday evening. \nTrump released a policy outline detailing his “three core principles” for immigration reform last weekend. \nIt emphasized securing America’s borders, increasing enforcement of immigration laws and putting the needs of current U.S. citizens first. \n“We are the only country in the world whose immigration system puts the needs of other nations ahead of our own,” Trump said in a statement on his website. \n“Real immigration reform puts the needs of the working people first – not wealthy globetrotting donors,” he added. “That must change.\" \nThe property tycoon has also vowed to build a wall on America’s border with Mexico, and force the southern neighbor to foot the bill. \n“For many years, Mexico’s leaders have been taking advantage of the United States by using illegal immigration to export the crime and poverty in their own country (as well as in other Latin American countries),”) Trump said in his policy outline. \n“The impact in terms of crime has been tragic,” he said. “Meanwhile, Mexico continues to make billions on not only our bad trade deals but also relies heavily on the billions of dollars in remittances sent from illegal immigrants in the United States to Mexico ($22 billion in 2013 alone). \n“In short, the Mexican government has taken the United States to the cleaners,” he added. “They are responsible for this problem, and they must help pay to clean it up.” \nTrump has also proposed ending birthright citizenship for children born in the U.S. and suggested he would deport all illegal immigrants. \nTrump's immigration plan is escalating his feud with Mexico, which began when he accused the country of sending drugs and crime to the U.S. \n“They’re sending people who have a lot of problems,” Trump said from New York City’s Trump Tower during his June 16 campaign launch. \n“They’re bringing drugs. They’re bringing crime. They’re rapists,” he added. “And some, I assume, are good people.” Tags:", "external_links": [], "published": "2015-08-19T21:17:00.000+03:00", "crawled": "2015-08-20T01:09:21.517+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}