{"organizations": [], "uuid": "924812fb9f3dfac6aec37f40f131bbe80d41a550", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/5604a53c1c00002e00bfb920.jpeg", "site_section": "http://www.huffingtonpost.com//feeds/verticals/politics/index.xml", "section_title": "Politics - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/federal-immigration-los-angeles-county-jails_560453bbe4b08820d91c2b5f", "country": "US", "title": "Federal Immigration Agents Will Be Allowed Back Into Los Angeles County Jails", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Federal Immigration Agents Will Be Allowed Back Into Los Angeles County Jails", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T06:22:00.000+03:00", "replies_count": 0, "uuid": "924812fb9f3dfac6aec37f40f131bbe80d41a550"}, "author": "Matt Ferner", "url": "http://www.huffingtonpost.com/entry/federal-immigration-los-angeles-county-jails_560453bbe4b08820d91c2b5f", "ord_in_thread": 0, "title": "Federal Immigration Agents Will Be Allowed Back Into Los Angeles County Jails", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Federal Immigration Agents Will Be Allowed Back Into Los Angeles County Jails \"The LA County jail system has been a disgrace to working families of Los Angeles for many, many years.\" Matt Ferner National Reporter, The Huffington Post Roque Planas National Reporter, The Huffington Post Posted: 09/24/2015 11:22 PM EDT Bloomberg via Getty Images \nFederal immigration agents, kicked out of Los Angeles County jails several months ago, will be allowed to return to identify undocumented inmates for potential deportation, Sheriff Jim McDonnell said this week. \nMcDonnell said in a letter to county supervisors that the new policy will allow U.S. Immigration and Customs Enforcement agents access to inmates who have committed serious crimes and who are not protected under a 2013 state law that restricts collaboration between local cops and federal immigration officials. \nThe new policy mandates that sheriff's deputies assigned to jails will give ICE up to seven days of notification before an inmate deemed potentially deportable is to be released, so that immigration officials can begin the deportation process. Those inmates will be notified of an ICE detainer and their right to legal council. \nCounty supervisors just months ago ended a similar program that allowed ICE agents to work inside jails and train deputies to spot inmates eligible for deportation. The new plan appears to limit the federal agents’ access. \nAt least two of the five county supervisors backed the sheriff’s move. Tony Bell, assistant chief deputy for Supervisor Michael D. Antonovich, told The Huffington Post in an email that Antonovich's office is in \"support\" of the effort. \nSupervisor Hilda Solis, who led the effort to boot ICE from county jails, said she generally supported the new policy, but cautioned that it may actually expand ICE access to jails. \n\"My top priority continues to be prohibiting ICE agents from having a permanent home in our jails with unfettered access to inmates in our care,\" Solis said. \"In the past, this led to abuses like racial profiling that are simply not acceptable.\" \nMcDonnell said in his letter that the new policy considers the \"complex and passionate positions of groups on both sides of the immigration debate.\" \nPablo Alvarado, director of the National Day Laborer Organizing Network, told the Los Angeles Times that the new policy appeared to be a politically motivated response to the July killing of a Kathryn Steinle, a San Francisco woman allegedly shot by Juan Francisco Lopez-Sanchez , an undocumented immigrant who had been previously deported . The killing quickly became campaign fodder for Republican presidential candidate Donald Trump , who said it proved the U.S. hasn't done enough to secure its borders. \n\"It appears the 'Trump Effect' is now having an impact on Los Angeles County policy,\" Alvarado said. \nArturo Carmona, executive director of Presente.org, a national Latino advocacy group, said his group would continue to monitor the sheriff and the new policy. \n\"The LA County jail system has been a disgrace to working families of Los Angeles for many, many years,\" Carmona said. \"And so any movement in the direction towards providing more scrutiny and more oversight and making sure the system is more humane is a step forward. But it’s yet to be seen.\"", "external_links": [], "published": "2015-09-25T06:22:00.000+03:00", "crawled": "2015-09-25T07:03:28.449+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}