{"organizations": [], "uuid": "cc54e8a3ce32a8766baf7f923187014ac01a2142", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "", "site_section": "http://www.huffingtonpost.com//feeds/verticals/politics/index.xml", "section_title": "Politics - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/09/01/huffpost-hill_n_8073428.html", "country": "US", "title": "HUFFPOST HILL - 'Ayatollah So!' Obama Has Iran Deal In The Bag", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "HUFFPOST HILL - 'Ayatollah So!' Obama Has Iran Deal In The Bag", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-02T00:31:00.000+03:00", "replies_count": 0, "uuid": "cc54e8a3ce32a8766baf7f923187014ac01a2142"}, "author": "Arthur Delaney", "url": "http://www.huffingtonpost.com/2015/09/01/huffpost-hill_n_8073428.html", "ord_in_thread": 0, "title": "HUFFPOST HILL - 'Ayatollah So!' Obama Has Iran Deal In The Bag", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HUFFPOST HILL - 'Ayatollah So!' Obama Has Iran Deal In The Bag Posted: reddit \nMitch McConnell admitted he hasn't got the votes to defund Planned Parenthood, so Republicans will have to settle for defunding ACORN again. President Obama needs just one more Democrat to save his Iran deal, and everyone's wondering if Joe Manchin will support the deal or nail it to a tree and shoot it. And Rick Perry is down to a single paid campaign staffer in Iowa, and that person may or may not be made entirely out of butter. This is HUFFPOST HILL for Tuesday, September 1st, 2015 \nCASEY, COONS SIGN UP FOR IRAN DEAL - Obama is now one vote shy of the support he needs. Paul Kane: \"Sens. Chris Coons (D-Del.) and Bob Casey (D-Pa.) have decided to support the Iran nuclear deal, putting President Obama on the brink of a major diplomatic breakthrough that will allow him to fully implement the controversial deal over the objections of the Republican-led Congress. Coons's decision, disclosed in an exclusive interview with The Washington Post, delivered a powerful blow to opponents of the plan because the Delaware Democrat had previously voiced some of the deepest skepticism about the controversial deal. It came as Casey announced support for the deal and left Obama needing just one more vote in the Senate to claim victory.\" Once again, Coons goes against the grain. [ HuffPost ] \nUndecided Joe Manchin is holding a town hall on the Iran deal Thursday. \nMCCONNELL NOT INTERESTED IN JUST SHUTTING THAT WHOLE THING DOWN - The government, that is. Laura Barron-Lopez: \"Republican efforts to defund family health care provider Planned Parenthood will fall flat in Congress as long a Democrat is in the White House, Senate Majority Leader Mitch McConnell (R-Ky.) said Monday. Before Congress left for summer recess last month, McConnell pushed through a procedural vote that would have stripped federal funds from the provider. ' We just don’t have the votes to get the outcome we like ,' he said during an interview with Kentucky TV station WYMT. 'The president has the pen. If he doesn’t sign it, it doesn’t happen. We voted on that already in the Senate and we will vote on it again.' Giving Kentuckians a lesson on constitutional procedure, McConnell stressed the limits of the legislative branch. 'I would remind all of your viewers: The way you make a law in this country, the Congress has to pass it and the president has to sign it,' he said. ' The president has made it very clear he’s not going to sign any bill that includes defunding of Planned Parenthood , so that’s another issue that awaits a new president hopefully with a different point of view about Planned Parenthood.'\" Seems reasonable. [ HuffPost ] \nJEB BUSH HAS HAD IT WITH DONALD TRUMP - ¿Cómo se dice \"sick burn?\" Ed O'Keefe: \"After a town hall meeting at a Presbyterian school here, Bush explained his decision to go on the offensive, using explanations he's voiced before in English. But in Spanish, in response to questions from Spanish-speaking reporters, his tone and choice of words was sharper. 'He attacks me every day. He attacks me every day with barbarities,' Bush said in Spanish in response to a question. 'They’re not true. What we did today was to put out in his words to show that he’s not conservative. He supports people like Nancy Pelosi. He’s given money to Hillary Clinton. He was a Democrat longer than Republican .'\" [ WaPo ] \nTRUMP'S RACISM MORE POLITE IN PERSON, RICH HISPANICS REPORT - Donald Trump, who is leading the GOP presidential campaign because he says terrible things about brown people, remembered some of them are rich and met with the Hispanic Chamber of Commerce Tuesday. He was very nice, they said. Elise Foley: \"'What I found was the private Donald is very different from the public Donald,' Javier Palomarez, president and CEO of the Hispanic Chamber of Commerce, told HuffPost. 'He was very gracious, he was very hospitable. Amazingly, he listened a lot more than he talked. He asked a lot of questions.'\" [ HuffPost ] \nSome people fussed over this Obama Columbia thing , but it doesn't seem like an actual thing. \nSCOTT WALKER KEEPS WALKING INTO GLASS DOORS - Stepping on rakes, slipping on banana peels. Scott Bauer: \"Wisconsin Gov. Scott Walker denies he's a career politician -- even though he has been in elected office since he was 25 years old and first ran for office when he was 22. The 47-year-old Republican presidential contender said in an interview with CNBC, released Tuesday, that he is 'just a normal guy' and rejects the career politician label despite being in politics for most of his adult life.\" [ AP ] \nReminder that Ben Carson is the only vegetarian option . \nMAYBE YOU CAN'T TRACK MEXICANS LIKE AMAZON PACKAGES AFTER ALL - Fact check: Human beings are sentient beings, not inanimate objects, no matter what Chris Christie says. Igor Bobic: \"According to a shipping industry expert, however, tracking immigrants like packages would make little sense. Even if it could somehow be implemented on a large scale, it would raise thorny questions about ethics and privacy. “I actually think it’s not very practical at all,\" said Dan Gilmore, editor of Supply Chain Digest, a website focused on supply-chain management and logistics.\" [ HuffPost ] \nTHE RACE IS ON TO BE THE LAST BIGOT STANDING The Supreme Court reminded everyone that it means the first word in its name literally when it ordered some mean lady in Kentucky to stop ignoring it and start letting gay people get married, and now she's got to answer for it. \"A county clerk in Kentucky who has invoked 'God's authority' and is defying the U.S. Supreme Court by refusing to license same-sex marriages has been summoned along with her entire staff to explain to a federal judge why she should not face stiff fines or jail time.\" [ AP ] \nOH GOOD -- ANOTHER WAY AROUND CAMPAIGN SPENDING RULES! - The campaign videos Donald Trump's social media person puts on Instagram don't count as campaign videos because our laws are very stupid. Paul Blumenthal: \"In his latest online video ad, Donald Trump uses an out-of-context quote from Jeb Bush to simultaneously attack his rival GOP presidential candidate and stoke racial anxieties about undocumented immigration. Like all of Trump's other ads posted to Instagram, the video does not include any disclaimer stating that it was paid for by the Trump campaign .\" [ HuffPost ] \nA White House staffer has been indicted over a shooting. \nIT'S TRUE. NO ONE LIKES NEW YORKERS. Bernie Sander is from Vermont, except he's really from Brooklyn, as you can tell by that crazy accent. Does that make him unelectable? Robert Voris: \"Mr. Sanders, who hails from East Flatbush, is at least the fourth Brooklyn native to formally seek the nation’s highest office. But the historical track record of Brooklynites seeking the White House is poor , marked by campaign stumbles, quixotic candidacies and limited voter appeal.\" [ NYT ] \nDELANEY DOWNER - If you're a working-age person without a job, a disability or a kid, then soon you're not going to have access to food stamps, either. In another sign of eroding sympathy for the jobless amid a tepid economic recovery, states are restricting benefits for the unencumbered unemployed . Indiana is next. Earlier this year, the Hoosier State notified roughly 50,000 of the state's 836,000 food stamp recipients that they would be getting the boot come October unless they met work requirements set by the 1996 federal welfare reform law. That Gingrichian measure requires childless adults without disabilities to work 20 hours a week in order to qualify for more than three months of food stamp benefits. [ HuffPost ] \nDoes somebody keep forwarding you this newsletter? Get your own copy. It's free! Sign up here. Send tips/stories/photos/events/fundraisers/job movement/juicy miscellanea to huffposthill@huffingtonpost.com. Follow us on Twitter - @HuffPostHill \nCLINTON EMAILS JUST SHOW THE USUAL MILD CORRUPTION - Amanda Terkel reports that Turkish biz honcho Umit Boyner's meeting with Hillary Clinton \"didn't come about by luck. Rather, it was the product of old-fashioned revolving-door lobbying, the type that makes clear why big firms pay high prices to put former public officials on their payroll. On May 5, 2010, former House Majority Leader Dick Gephardt (D-Mo.), wrote to Clinton's chief of staff, Cheryl Mills, about a possible meeting for Boyner with the secretary of state . After leaving government service, Gephardt had founded his own lobbying shop and also did consulting work for bigger firms. In 2007, The New York Times reported that he was a top lobbyist for Turkey. 'I have been asked by the Turkish Embassy, who I represent, to request a meeting with Secretary Clinton for Mrs. Umit Boyner, a prominent Turkish business woman,' wrote Gephardt in his email to Mills.\" [ HuffPost ] \nJames O'Keefe continues to commit fraud in his quest to discredit conservative journalism. \nTHANKS FOR YOUR INPUT. ALSO, YOU'RE FIRED. Bloomberg News laid off like 80 people in its New York and Washington newsrooms, including one editor who had the temerity to offer management some advice. Michael Calderone: \"Dawn Kopecki, a senior energy writer who wrote a June memo to Bloomberg executives describing a \"culture of fear\" in Washington and suggested the bureau staff could be reduced by 20 percent, is among those laid off, according to a source.\" [ HuffPost ] \nSOMEONE ON TWITTER HAS ALREADY CALLED THIS FASCIST, PROBABLY - One of Obummer's Cabinet members donned jackboots and suggested maybe -- just maybe! -- America's schools shouldn't shove garbage food down our children's throats every day. Lydia Wheeler: \"Agriculture Secretary Tom Vilsack is calling on Congress to not only reauthorize but also strengthen first lady Michelle Obama’s prized healthy school breakfast and lunch standards.\" [ The Hill ] \nBECAUSE YOU'VE READ THIS FAR - Bill Gates is coming to touch your computer . \nIOWA IS THE WORST - Trip Gabriel: \"Is Iowa for sale? That is the perception sending shudders through the state’s Republicans, after the leader of Rick Perry’s Iowa campaign quit when Mr. Perry suspended pay to staff members, then quickly went to work for Donald J. Trump, who he had earlier said lacked a 'moral center.' \" Iowa: where nobody has a moral center. [ NYT ] \nCOMFORT FOOD", "external_links": [], "published": "2015-09-02T00:31:00.000+03:00", "crawled": "2015-09-02T00:46:34.797+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}