{"organizations": [], "uuid": "0c07848f8e010001d6eca30531193ae52025a2e4", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/judicial/251477-time-for-a-pep-talk-on-immigration", "country": "US", "title": "Time for a ‘PEP’ talk on immigration", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Time for a ‘PEP’ talk on immigration", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-20T20:00:00.000+03:00", "replies_count": 0, "uuid": "0c07848f8e010001d6eca30531193ae52025a2e4"}, "author": "Jonathan Thompson and Sheriff A.J. Louderback", "url": "http://thehill.com/blogs/congress-blog/judicial/251477-time-for-a-pep-talk-on-immigration", "ord_in_thread": 0, "title": "Time for a ‘PEP’ talk on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 20, 2015, 01:00 pm Time for a ‘PEP’ talk on immigration By Jonathan Thompson and Sheriff A.J. Louderback \nWhile a series of recent tragic murders and assaults allegedly committed by illegal immigrants in so-called “sanctuary cities” has rightly focused the nation’s attention on communities that refuse to enforce federal immigration laws, a new Immigration and Customs Enforcement (ICE) policy poses at least an equal threat to public safety: ICE has effectively tied the hands of local law enforcement agencies and is forcing the release of illegal immigrants who are known to have committed crimes in our communities. \nUnder ICE’s new “Priority Enforcement Program” -- or “PEP” -- Washington now “prioritizes” the criminal activities of illegal immigrants being held in custody and pursues only those who have been charged with the most serious felonies and those whose cases have already resulted in a conviction. \nThose illegal immigrants whose crimes are not regarded by Washington as serious enough, together with those who have been charged with serious crimes but not yet convicted, must now be released once they make bail or have served their local sentences, since there is no legal authority to hold them. \nThe new PEP initiative took effect in January 2015 as a substitute for the Department of Homeland Security’s Secure Communities program, which allowed ICE to place a 48-hour detainer on any illegal immigrant who had been placed under arrest and was being held in local custody, even while awaiting trial. ADVERTISEMENT Numerous courts had held that 48-hour detainers under Secure Communities program did not establish sufficient grounds to hold an illegal immigrant unless ICE first obtained a formal warrant for the individual or had already obtained a formal Order of Deportation. \nFor years, ICE has been so negligent in providing the required legal documentation that sheriffs and other local law enforcement officials have routinely been placed in an impossible position: after having devoted all the resources necessary to investigate and apprehend these individuals, sheriffs were forced to release them back on to the streets or risk personal liability for violating the civil rights of the illegal immigrant under the Fourth Amendment. \nEven in those cases where the warrant or Order of Deportation had been acquired, ICE frequently never even bothered to pick up the individual, leaving the costs of his or her detention to be paid by local taxpayers. \nThe system was so broken that the Secure Communities program was derisively known by law enforcement officials as “Catch-and-Release.” \nThe new “PEP” initiative, however, is now being called “Catch-and-Release 2.0.” \nNot only does PEP make the 48-hour holds of illegal immigrants nearly impossible, it excludes thousands of criminal aliens whose crimes are -- in the opinion of Washington bureaucrats, anyway -- not serious enough to warrant their deportation. \nEven when a detention is sought, since a 48-hour hold is no longer authorized, ICE is only permitted to “request” that an illegal immigrant be held -- a process that violates any number of civil rights and, in the absence of any legal authority, forces sheriffs to release known dangerous criminals back into the community. \nConfronted with this dilemma, some sheriffs have been willing to face the risk of legal liability, but many have not -- and none should be faced with such a Hobson’s choice. (Notably, in those instances where sheriffs have been sued for honoring an ICE detainer request, neither the Department of Homeland Security nor ICE has stepped forward to defend them.) \nIn the interest of public safety, President Obama and the Department of Homeland Security need to go back to the drawing boards. If probable cause exists to arrest an illegal immigrant for a violation of law, the federal government has a responsibility to intervene, and to do so effectively. \nAs he has done many times before, the president should issue an executive order directing the Department of Homeland Security to share information more effectively with state and local law enforcement and to broaden the eligibility categories for deportation. \nAt the same time, Congress owes it to local taxpayers to increase the reimbursement for state and local agencies that house criminal aliens on behalf of the federal government: there is no reason these costs should be borne by local taxpayers. \nThompson is executive director of the National Sheriffs’ Association. Louderback is sheriff of Jackson County, Texas.", "external_links": [], "published": "2015-08-20T20:00:00.000+03:00", "crawled": "2015-08-21T03:34:35.987+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}