{"organizations": [], "uuid": "5672f3e5530cf60766415f26c2453860c3c1daa0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/pat-oglesby/marijuana-under-president_b_8207864.html", "country": "US", "title": "Marijuana Under President Sanders | Pat Oglesby", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Marijuana Under President Sanders | Pat Oglesby", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-29T21:10:00.000+03:00", "replies_count": 0, "uuid": "5672f3e5530cf60766415f26c2453860c3c1daa0"}, "author": "Pat Oglesby", "url": "http://www.huffingtonpost.com/pat-oglesby/marijuana-under-president_b_8207864.html", "ord_in_thread": 0, "title": "Marijuana Under President Sanders | Pat Oglesby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bernie Sanders, a self-described socialist , is soaring in the Presidential polls. With marijuana laws in flux, Sanders reportedly \"will consider\" outright legalization. It's natural to ask: What, exactly, might socialist marijuana laws look like?\nSocialism can mean government ownership of all businesses. Now Senator Sanders wouldn't go nearly that far . But there's a baby step of government ownership: State stores. State stores distribute alcohol responsibly today in many states . In Senator Sanders's Vermont , privately-owned retail locations \"sell spirits for the State .\"\nUnleashing the power of the free market to innovate and to please in most consumer businesses -- that's hard to argue with. But when it comes to intoxicants, \"the private profit motive . . . makes inevitable the stimulation of sales.\" That warning, about liquor, comes from the classic 1933 Rockefeller report, Toward Liquor Control. John D. Rockefeller, Jr., was the opposite of a socialist, but he put it this way: \"Only as the profit motive is eliminated is there any hope of controlling the liquor traffic in the interest of a decent society.\"\nEven if marijuana is safer than alcohol , it's not harmless for everyone. There's a lot to say for a cautious roll-out of legalization. If you worry about advertising and marketing and youth use, state stores are safer than private-profit-driven stores. Marijuana millionaires, ultra-successful in peddling product, are going to make parents nervous. The Right accuses the Left of over-regulating, but only a few ideologues would treat marijuana like milk.\nSkeptics say state stores are \"impossible\" because marijuana is illegal under federal law. Here's something to think about: Bernie Sanders becomes president. On January 20, 2017, marijuana is still illegal, and enforcement of federal marijuana laws is up to the Sanders Administration. His Justice Department might not go after marijuana sellers at all. But if it did, it might, like the Obama Justice Department, use prosecutorial discretion. It could target problem cases - like aggressive marijuana advertisers, appealing to young people. Or like companies selling cannabis containing pesticides and mold. Or like Big Marijuana that emulates Big Tobacco. Responsible state stores might emerge unscathed.\nSure, state stores involve trade-offs . State stores are less responsive to consumers than private sellers. If state stores don't give consumers what they want, the black market will step up. And state sales of intoxicants give government a vested interest in selling more .\nBut state stores have an advantage over taxed stores in price flexibility. Tax rates are hard to change in the current political environment. The legal market will start out fighting a price war with the incumbent black market. And an eventual price collapse could prove unfortunate for public health. But a state store can change prices as nimbly as a corner gasoline station.\nState stores offer another level of flexibility. What if a state changes its mind? A state that chose state sales can readily shift to private sales, as Washington state's voters did recently with liquor. But private sellers, once up and running, will not be easily pushed aside if the public wants a do-over.\nThen there's the money. A state that legalizes marijuana creates wealth . State stores would make money from marijuana sales available for public use.\nWhoever becomes President, there may be no safe path for states. Any state legalization plan could run the risk of violating federal law -- by issuing marijuana business licenses or collecting taxes, for instance. Even if a state chooses private stores over state sales, prosecutions of state licensing officials and tax collectors might be possible, in theory. But the federal government is more likely to issue Cease and Desist orders, with the federal government saying \"Stop!\" and the state saying \"OK.\" And with no state officials getting handcuffed.\nNo one knows what the future holds, but state marijuana businesses are springing up. The Louisiana Legislature has turned all marijuana growing over to state land-grant universities -- flagship LSU and HBCU Southern University. And the City of North Bonneville, Washington, is already selling recreational marijuana at retail. Bernie Sanders may not become President, but if he does, count on him not to start off by shutting those early government experiments down.\nFollow Pat Oglesby on Twitter: www.twitter.com/OglesbyPat\nMore: Marijuana Taxes Business Marijuana Regulation Socialism", "external_links": ["https://www.washingtonpost.com/opinions/bernie-sanderss-socialist-charade/2015/06/03/5a905c44-0952-11e5-95fd-d580f1c5d44e_story.html", "http://www.nabca.org/States/States.aspx", "http://marijuanalegalization.about.com/od/RelatedIssues/fl/Cannabis-Pros-and-Cons-If-By-Whiskey-Style.htm", "http://www.governing.com/topics/mgmt/gov-states-marijuana-sellers.html", "http://newrevenue.org/2015/06/23/tax-marijuana-like-milk/", "http://newrevenue.org/2015/07/11/grow-cannabis-in-land-grant-universities/", "https://www.mpp.org/marijuana-is-safer-than-alcohol-its-time-to-treat-it-that-way/", "http://www.rand.org/pubs/research_reports/RR864.html", "http://www.foxnews.com/politics/2015/03/18/washington-state-pot-store-brings-revenue-to-local-town/", "http://www.kboi2.com/news/local/Idaho-Postcards-Liquor-Store-327695621.html", "http://newrevenue.org/2015/08/23/sharing-the-wealth-from-legalization/", "http://www.twitter.com/OglesbyPat", "http://liquorcontrol.vermont.gov/about_us", "http://abcnews.go.com/US/washington-state-governor-vetoes-medical-marijuana-dispensary-bill/story?id=13499869", "http://marijuanapolitics.com/rick-santorum-thinks-bernie-sanders-surge-is-because-hes-gonna-legalize-drugs/", "http://static1.squarespace.com/static/5006fc73e4b09ef2252e9bea/t/54b06571e4b090b197ef11a4/1420846449661/Counter+Tools_Retail+Marijuana+Update.pdf", "http://www.npr.org/sections/itsallpolitics/2015/08/27/434872755/exactly-what-kind-of-socialist-is-bernie-sanders", "http://www.oxforddictionaries.com/fr/definition/anglais_americain/socialism"], "published": "2015-09-29T21:10:00.000+03:00", "crawled": "2015-09-29T23:30:13.289+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}