{"organizations": [], "uuid": "98bb1c819d7c71808ecd767bd031bb360f928919", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/56040e791c00004800082fb7.jpeg?cache=WDW6jCZSlj", "site_section": "http://www.huffingtonpost.com/raw_feed_index.rdf", "section_title": "The Huffington Post | The Full Feed", "url": "http://www.huffingtonpost.com/entry/bill-nye-made-a-video-about-abortion_5603fe67e4b0fde8b0d165a8", "country": "US", "title": "Bill Nye Debunks Anti-Abortion Logic With Science", "performance_score": 6, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Bill Nye Debunks Anti-Abortion Logic With Science", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-24T18:02:00.000+03:00", "replies_count": 0, "uuid": "98bb1c819d7c71808ecd767bd031bb360f928919"}, "author": "Nina Bahadur", "url": "http://www.huffingtonpost.com/entry/bill-nye-made-a-video-about-abortion_5603fe67e4b0fde8b0d165a8", "ord_in_thread": 0, "title": "Bill Nye Debunks Anti-Abortion Logic With Science", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bill Nye Debunks Anti-Abortion Logic With Science Bill! Bill! Bill! Bill! Nina Bahadur Deputy Editor, HuffPost Women Posted: 09/24/2015 11:02 AM EDT \n\"When it comes to women’s rights with respect to their reproduction, I think you should leave it to women.\" \nThat's what Bill Nye has to say in his latest educational video, \"Can We Stop Telling Women What to Do With Their Bodies?\" In the video, which you can watch above, Nye explains how the idea of \"life at conception\" simply doesn't make sense -- because many more eggs are fertilized than become humans, due to factors like failure to attach to a woman's uterine wall. \n\"If you’re going to say when an egg is fertilized it therefore has the same rights as an individual, then whom are you going to sue?\" he says . \"Whom are you going to imprison? Every woman who’s had a fertilized egg pass through her? Every guy who’s sperm has fertilized an egg and then it didn’t become a human? Have all these people failed you?\" Canva \nNye goes on to explain that popular understandings of conception are deeply flawed, and don't line up with scientific facts. He encourages viewers to think about the data that's available. \n\"At some point we have to respect the facts,\" he says. \"Closing abortion clinics... and not giving women access to birth control has not been an effective way to lead to healthier societies... I think we all know that.\" \nNye ends the video with a plea for anti-abortion activists to educate themselves, and stop telling women what to do. \n\"Just really be objective about this,\" he urges them. We have other problems to solve everybody... Let’s work together.\" Tumblr", "external_links": [], "published": "2015-09-24T18:02:00.000+03:00", "crawled": "2015-09-24T18:20:39.126+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}