{"organizations": [], "uuid": "44a0e022852f168295bcaef783e5d27c842a1ea9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/560091e71c00002500082b64.jpeg?cache=NKCarH7ug4", "site_section": "http://www.huffingtonpost.com//feeds/index.xml", "section_title": "The Huffington Post | The Full Feed", "url": "http://www.huffingtonpost.com/entry/jake-brewer-define-american-immigration_56003ee8e4b0fde8b0cf1a54", "country": "US", "title": "Jake Brewer's Immigration Legacy May Last For Years", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Jake Brewer's Immigration Legacy May Last For Years", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-22T02:36:00.000+03:00", "replies_count": 0, "uuid": "44a0e022852f168295bcaef783e5d27c842a1ea9"}, "author": "Elise Foley", "url": "http://www.huffingtonpost.com/entry/jake-brewer-define-american-immigration_56003ee8e4b0fde8b0cf1a54", "ord_in_thread": 0, "title": "Jake Brewer's Immigration Legacy May Last For Years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Jake Brewer's Immigration Legacy May Last For Years The White House aide, who died after a weekend cycling accident, brought kindness to a debate that often lacks it. Elise Foley Immigration & Politics Reporter, The Huffington Post Posted: 09/21/2015 07:36 PM EDT \nWASHINGTON -- In April 2011, journalist Jose Antonio Vargas gathered three of his best friends in his New York apartment to brainstorm the name for a new group they planned to launch once he \"came out\" as an undocumented immigrant. \nThey wanted something that made people think of immigrants and immigration beyond the politics -- something that was important to Jake Brewer, one of the co-founders, who led the discussion that day. They settled on including \"American,\" and were contemplating the word \"define.\" Brewer tried it out. \n\"My name is Jake Brewer and I define American,\" Brewer said, in a moment captured for the 2013 film \"Documented.\" \nVargas has always been the face of the organization they called Define American. But behind the scenes, there was always Brewer, a 34-year-old who died on Saturday in Maryland while participating in a bicycle ride to raise money for cancer research. He left behind his wife, Fox News commentator Mary Katharine Ham, along with a daughter, another child on the way, and many other family and friends. He was a senior policy adviser in the Office of the Chief Technology Officer at the White House, where President Barack Obama issued a statement Sunday calling him \"one of the best.\" \nBrewer also left a heavy mark on the immigration debate, encouraging his friends and colleagues to look at the big picture, and to strive to reach unlikely allies by sharing stories of immigrants' humanity. He was one of those allies himself: a white man raised in Tennessee who, because he loved someone who was undocumented, wanted to help others as well. \n\"I think part of his legacy is he was an all-American guy who made sure that we expanded what we think of all-American,\" said Vargas. Courtesy of Jose Antonio Vargas \nBrewer once wrote that Vargas \"was the gay, Filipino brother I never had, and I was the white, American-heartland brother he never had.\" Vargas didn't tell Brewer he was undocumented until early 2011 . Brewer, who formerly worked for Sunlight Foundation and Change.org, was surprised, but dove into the immigration issue immediately, Vargas said. \n\"It was an issue that he didn't know much about and because a person he considered to be his brother was dealing with it, all of a sudden, it was his issue,\" said Vargas, a Pulitzer Prize-winning journalist who has worked as a Huffington Post editor. \nBrewer went beyond asking how he could help Vargas to ask how he could help everyone in that situation, said fellow Define American co-founder Jehmu Greene, a political commentator and Fox News contributor. \n\"Jake was a 'How can I help?' person,\" Greene said. \"And not even just the question, but he usually came with the answer.\" \nBrewer explained his commitment to the cause in a 2011 piece for The Huffington Post, urging others to think about what makes someone American and what should be done about the people who consider themselves American, but because of their immigration status, cannot be. \n\"I hope you'll join this conversation he's started and ask yourself, your friends and your family the hard questions our country requires,\" Brewer wrote. \"I hope we can start telling the truth about immigration in this country and start getting past political pandering. There's little doubt from almost anyone that our immigration system is broken, and the only way to solve a problem is to first tell the truth about it.\" A photo posted by Mary Katharine Ham (@mkhammertime) on Sep 20, 2015 at 7:25am PDT \nFriends said Brewer wanted to be sure Define American was something different than other immigration advocacy groups. Part of that was an emphasis on using stories to show how the issue affected communities, even if people didn't realize it. \n\"What was unique about Jake in this space is that he understood that it wasn't enough to preach to the converted,\" said Alicia Menendez, another Define American co-founder who now hosts a show on Fusion. \"He had a sense that there were really complicated and deep-seated reasons that people were against immigration reform and those weren't always the same reasons, and that we needed to be really specific about who our audience was and how we would reach people who had not traditionally been on the side of reform.\" \nThe Rev. Ryan Eller, the executive director of Define American, said Brewer always encouraged him and others to look at the big picture. \n\"It's never been just about comprehensive immigration reform, it's been about fundamentally who we view as American and how we treat one another,\" Eller said. \"How we welcome people into our community. And there again was the bigger picture that Jake kind of drew us to.\" \nBrewer told Eller in their last conversation he was proud of everyone and they were \"crushing it,\" then urged them to be bold. He ended the conversation, as he often did, by saying, \"I love you, brother,\" Eller said. \nBrewer's ability to be optimistic rather than cynical, particularly within such a contentious debate as immigration, was because he came \" from a place of kindness that is very rare in this world,\" Greene said. \n\"I think it's that place of kindness where we've seen the immigration conversation shift so dramatically and bring on unlikely allies who are also coming from that same place of kindness,\" Greene said. \"That, I think, was his mission, to tap into that. And he certainly succeeded.\"", "external_links": [], "published": "2015-09-22T02:36:00.000+03:00", "crawled": "2015-09-22T02:46:46.728+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}