{"organizations": [], "uuid": "d4faa5e758eacfe5c4d4d7cdc33a130d4c611049", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/coonschris_041912gn.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/floor-action/senate/252427-coons-to-back-iran-deal", "country": "", "title": "Obama on cusp of Iran victory | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama on cusp of Iran victory | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-01T22:19:00.000+03:00", "replies_count": 0, "uuid": "d4faa5e758eacfe5c4d4d7cdc33a130d4c611049"}, "author": "", "url": "http://thehill.com/blogs/floor-action/senate/252427-coons-to-back-iran-deal", "ord_in_thread": 0, "title": "Obama on cusp of Iran victory | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 01, 2015, 02:10 pm Obama on cusp of Iran victory By Jordain Carney President Obama is one vote away from ensuring his Iran nuclear deal survives Congress. Sen. Chris Coons (D-Del.) will support the agreement, becoming the 33rd senator to back the deal — one shy of ensuring that an expected presidential veto of a Republican-led resolution of disapproval would be upheld. \"I will support this agreement because it puts us on a known path of limiting Iran’s nuclear program for the next fifteen years with the full support of the international community. The alternative, to me, is a scenario of uncertainty and isolation,\" he said at the University of Delaware on Tuesday. ADVERTISEMENT \"Finally, I will support this agreement despite its flaws because it is the better strategy for the United States to lead a coalesced global community in containing the spread of nuclear weapons.\" Coons added that he will also vote to uphold a potential veto from President Obama. Despite saying he will vote the deal, Coons listed a handful of areas where said he had \"very serious concerns\" about the agreement, including what Iran will do with its influx of cash, Iran's ability to develop centrifuges, the so-called \"side\" deals between Iran and the International Atomic Energy Agency (IAEA) and the ability to snap back sanctions if Iran cheats. \"Frankly, this is not the agreement I hoped for,\" he added. \"I am troubled that the parties to this agreement – particularly Iran – have differing interpretations of key terms, and I remain deeply concerned about our ability to hold Iran to the terms of this agreement as we understand them. ... So let’s be clear — no one should mistake Iran for a friend of the United States.\" But he said that despite his concerns, it's unlikely that if Congress rejected the Iran deal, the administration would be able to force Iran back to the table to negotiate a better agreement. Senate Republicans, as well as Democratic Sens. Charles Schumer (N.Y.) and Robert Menendez (N.J.), have cited the push for a better deal as key to their opposition. \"If Congress rejects this agreement, removing the U.S. from the P5+1 process, the path forward is even less clear than it is with the deal,\" he added. \"Rejecting this deal brings with it a host of new, increasingly difficult questions.\" Coons said that he spoken with Obama, Vice President Joe Biden and other administration within the past 10 days, and gotten them to agree to a handful of measures including increasing military support for Israel, fully funding the IAEA, briefing Congress on how it plans to combat Iran's support for terrorism and explaining how it will hold Iran accountable for attacks that Iran-supported terrorist groups carry out against Israel and other allies. “I want to close my remarks today by addressing the supporters of Israel and my many friends in the Jewish community who have spoken with me directly about this deal – some in support, but many others in opposition,\" he said. \"As a strong supporter of Israel, I know the risks Israelis and Israel face every day in a region surrounded by enemies.\" He added that he will support legislation to tackle other \"shortcomings\" in the Iran deal, and that he supports keeping all options on the table — including military force to combat Iran if it tries to obtain a nuclear weapon. Coons was considered a crucial swing vote on the Iran deal, and had remained largely tight-lipped ahead of his announcement. \"If he came out for it or against it, it would have a big effect on other members,\" Ben Loehrke, a policy analyst for the pro-deal Ploughshares Fund, told The Hill earlier this month. \"He has a ken eye for the technicals of the agreement.\" Coons' support is the latest sign of the growing momentum around the deal since lawmakers left Washington for the August recess, giving opponents an increasingly tougher climb to defeat Obama's deal. Sen. Bob Casey (D-Pa.) also announced his support of the agreement earlier Tuesday. Opponents will now need all eleven undecided Democrats to buck Obama and vote against the deal. It's likely an impossible task. Sen. Joe Manchin (D-W.Va.), still undecided, is considered likely to vote in favor of the agreement, according to The Hill's whip list . Suggesting that it's unclear whether Obama would be able to get to the 41 votes needed to block the Iran deal from initially passing the Senate, Coons said that he had spoken to the remaining undecided lawmakers but \"it would be difficult for me to predict how many will come out in opposition or support.\" ", "external_links": [], "published": "2015-09-01T22:19:00.000+03:00", "crawled": "2015-09-01T22:19:52.126+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}