{"organizations": [], "uuid": "5fb126ae6d430a4b8562a344c48829bca9aae71f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack08102015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/254997-obama-to-congress-lift-budget-caps-now", "country": "US", "title": "Obama to Congress: Lift budget caps now", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to Congress: Lift budget caps now", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T23:02:00.000+03:00", "replies_count": 0, "uuid": "5fb126ae6d430a4b8562a344c48829bca9aae71f"}, "author": "dweaver@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/254997-obama-to-congress-lift-budget-caps-now", "ord_in_thread": 0, "title": "Obama to Congress: Lift budget caps now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to Congress: Lift budget caps now Getty Images By Kristina Wong - 09/25/15 04:02 PM EDT \nPresident Obama on Friday urged Congress to find a compromise to lift the budget caps on defense and non-defense spending, known as sequestration. \n\"Now is not the time for games that lock in sequester,\" he said at Fort Myer in Arlington, Va., during a retirement ceremony for Chairman of the Joint Chiefs of Staff Gen. Martin Dempsey. ADVERTISEMENT \"That's not good for our military readiness, it's not good for our troops, it's not good for our families, and it's not good for our country,\" he said.\nObama's comments come as Congress is struggling to pass a spending bill for 2016, with lawmakers facing a Thursday deadline to avoid a government shutdown. \nIn the event of a shutdown, the Pentagon released guidance on Friday that said troops would continue to report to duty but would not get paid until Congress appropriates funding. \nSome civilian employees would be furloughed, while others would report to work but would not get paid either until funding is provided. \nCongress is attempting to pass a short-term emergency spending measure to keep the government running through mid-December by extending 2015 funding levels. \nThe measure faces a challenge in the House, where a bloc of conservatives is vowing to oppose any measure that funds Planned Parenthood. \nSpeaker John Boehner (R-Ohio) announced Friday he would resign from his position in October, which could make it easier to challenge conservatives in his party. \nNonetheless, Defense officials are becoming more concerned about the possibility of a shutdown, as well as a yearlong emergency spending measure that would prevent the Pentagon from starting any new projects unless Congress makes exceptions. \nRepublicans and Democrats disagree over whether the budget caps should be lifted only for defense or for other government programs as well. \nRepublicans want to use a war fund not subject to the caps to boost military spending, but Democrats have rejected the tactic, saying the caps should be lifted across the board. \nIf no compromise is reached by mid-December and an emergency measure is extended through the year, the Pentagon would have $25 billion less than requested for 2016 and $10 billion more than under sequester levels.", "external_links": [], "published": "2015-09-25T23:02:00.000+03:00", "crawled": "2015-09-26T02:43:29.892+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}