{"organizations": [], "uuid": "4473040b76b027adaab308219bf187a87f922c24", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3467458/images/o-CHURCH-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/blog.xml", "section_title": "Women Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/kate-michelman/church-abortion-pope_b_8192390.html", "country": "US", "title": "Church Must Heed Pope Francis's Words on Abortion | Kate Michelman", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Church Must Heed Pope Francis's Words on Abortion | Kate Michelman", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T23:05:00.000+03:00", "replies_count": 0, "uuid": "4473040b76b027adaab308219bf187a87f922c24"}, "author": "Kate Michelman", "url": "http://www.huffingtonpost.com/kate-michelman/church-abortion-pope_b_8192390.html", "ord_in_thread": 0, "title": "Church Must Heed Pope Francis's Words on Abortion | Kate Michelman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Like many leaders in the reproductive rights and women's rights movement, we were baptized and raised as Catholics. Like many Catholics, we left the Catholic Church because we could no longer continue to be part of a church whose doctrine denigrated the moral integrity of women. Catholic Church doctrine is not the only morally-informed perspective on reproductive rights and abortion.\nWe believe the current assault on reproductive rights, which strives to reserve the access to contraception and safe abortion for the rich, is fundamentally immoral. We not only believe, but know, that women make morally-informed reproductive decisions, including whether or not to terminate a pregnancy, every day.\nAnd so we are watching this week with decidedly mixed emotions: nostalgia, anger, concern and hope.\nWe admire and respect Pope Francis. He brings us back to the memory of John XXIII, who was elected Pope when we came of age. Like John, Pope Francis is shifting the Church from dogma to pastoral care rooted in compassion, mercy and inclusion. He has criticized the Church for \"putting dogma before love, and for prioritizing moral doctrines over serving the poor and marginalized.\"\nHaving become acutely aware of increasing income inequality in recent years, Americans are ready for this message. Not only do 85% of American Catholics approve of Pope Francis, but seven out of 10 Americans as a whole.\nIn 2013, Pope Francis criticized the Church for being \"obsessed\" with abortion, gay marriage and contraception. \"The dogmatic and moral teachings of the church are not all equivalent,\" he said. \"The church's pastoral ministry cannot be obsessed with the transmission of a disjointed multitude of doctrines to be imposed insistently.\"\nIn early September, Pope Francis released a statement addressing abortion. Specifically, the pope authorized priests to grant \"forgiveness\" to a woman for having had an abortion, if she seeks such absolution. We know that women can and do make their own moral decisions about whether they can bear and raise a child and do not need forgiveness. However, a wider analysis of Pope's position reveals that his language is far less stigmatizing than the policies and practices of the U.S. Church, and in fact his emphasis on a pastoral, rather than political, approach to abortion is indeed radical.\nWhile we recognize that church dogma about abortion and contraception is not likely to change in the near future, Pope Francis's decision to shift the conversation is illuminating the disparities between his emphasis on compassion, inclusivity and mercy and the practices and policies espoused by the United States Conference of Catholic Bishops, the public policy arm of the U.S. Catholic Church.\nThis chasm is particularly severe in Pennsylvania, where health policy regulating women's access to reproductive healthcare, including but not limited to contraception and abortion, has been shaped by the political influence of the Pennsylvania Catholic Conference.\nRestrictions on abortion has earned our state high marks from anti-choice organizations, and recognition as a model \"pro-life\" state. Yet, Pennsylvania consistently ranks low across all factors measuring women's health and economic security. This is not a moral model to be held up as a good example.\nThis correlation reflects the reality across the country; research shows a correlation between the number of abortion restrictions and low marks for women's health. Philadelphia's maternal mortality rate is the highest in the United States, and the United States has the highest maternal and infant mortality rates of any industrialized nation. This needless suffering is stratified by race and class.\nNo matter what your personal beliefs about abortion, the fact is there is no economic justice without reproductive freedom. Women need to be able to choose if and when to have children to fully participate in the economy, a fact that is more obvious than ever given the widening gap between the haves and the have-nots, and the lack of sufficient workplace protections for working mothers.\nIt remains to be seen if the U.S. Church will heed the words of Pope Francis, and choose to focus on ministering to the poor, and leave the healthcare to doctors and experts. We would certainly all be better off if they did.\nPennsylvania's current crisis is the result of an incoherent perspective: a society that deprives women of reproductive freedom because it fundamentally mistrusts women also deprives mothers, and families, of health and dignity.\nKate Michelman is President Emeritus NARAL Pro-choice American and co-chair of WomenVote PA, an initiative of the Women's Law Project.\nCarol E. Tracy is Executive Director of Women's Law Project .\nMore: The Pope Reproductive Justice Women's Health Religion and Politics", "external_links": ["http://womenvotepa.org/wvpa-leaders/", "http://www.womenslawproject.org/"], "published": "2015-09-25T23:05:00.000+03:00", "crawled": "2015-09-25T22:11:02.062+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}