{"organizations": [], "uuid": "53b6be6d99843f0db221ac7b6ae737e03dc7b64a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/shermanwendy_052715getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/250306-obama-iran-deal-negotiator-says-she-didnt-see-final-side-deals", "country": "US", "title": "Obama negotiator says she didn't see final Iran 'side deals'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama negotiator says she didn't see final Iran 'side deals'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-05T18:20:00.000+03:00", "replies_count": 0, "uuid": "53b6be6d99843f0db221ac7b6ae737e03dc7b64a"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/250306-obama-iran-deal-negotiator-says-she-didnt-see-final-side-deals", "ord_in_thread": 0, "title": "Obama negotiator says she didn't see final Iran 'side deals'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama negotiator says she didn't see final Iran 'side deals' Getty Images By Kristina Wong - 08/05/15 11:20 AM EDT The only Obama administration official to view confidential \"side deals\" between Iran and the International Atomic Energy Agency (IAEA) admitted Wednesday she and her team have only seen rough drafts. \"I didn't see the final documents. I saw the provisional documents, as did my experts,\" said Wendy Sherman, a lead U.S. negotiator for the deal, at a Senate Banking Committee hearing. ADVERTISEMENT Sherman, undersecretary of State for political affairs, said she was only allowed to see the confidential deals \"in the middle of the negotiation\" when the IAEA \"wanted to go over with some of our experts the technical details.\" She maintained the deals — which focus on with Iran's prior work on a bomb and access to Iran's Parchin military site — are still confidential and can't be submitted to Congress. Sherman said the U.S. did not protest to the confidentiality of the agreements, despite the Iran Nuclear Agreement Review Act demanding all related agreements, because the administration wanted the IAEA to respect the confidentiality of its agreements with the U.S. \"We want to protect U.S. confidentiality. This is a safeguards protocol. The IAEA protects our confidential understandings and our confidential arrangements between the United States and the IAEA,\" she said. However, later in the hearing, she walked back her comments about not seeing the final agreements. \"I was shown documents that I believe to be the final documents, but whether, in fact, there are any further discussions...\" she added, without finishing that sentence. Later, she said responded, \"I have\" when asked whether she saw the final versions of the deals. She also said \"all of the P5+1\" also saw the drafts, referring to all six nations involved in the talks with Iran. She also argued they could not be submitted to Congress because the administration does not have the deals, and that the administration interpreted the Iran Nuclear Agreement Review Act to apply to all documents the U.S. had in its possession, not all related documents detailed in the legislation. \"Indeed our understanding of the Corker-Cardin legislation that passed by the House and the Senate, is that we must give you every document that we have, and we have given you every document that we have,\" Sherman said. Sen. Tom Cotton (R-Ark.) responded, \"Now, the legislation says all agreements. It doesn't matter whether the United States government has it in its possession or not.\" \"Well, it's very difficult -- it's very difficult to give you something that we do not have,\" she replied. Sherman emphasized she would brief Senators later Wednesday afternoon in a classified session on everything she knows about the deals. A similar briefing for House lawmakers last week did not assuage concerns for Rep. Ed Royce (R-Calif.), chairman of the House Foreign Affairs Committee, who sent a letter to Secretary of State John Kerry on Monday calling on the administration to submit the deals. She also noted that IAEA Director General Yukiya Amano was meeting with the Senate Foreign Relations Committee later in the afternoon. Although she said the U.S. did not ask or pressure Amano to conduct the briefing, she suggested it was a gesture beyond what the IAEA is obligated to do. \"[It's] extremely unusual,\" she said. Tags:", "external_links": [], "published": "2015-08-05T18:20:00.000+03:00", "crawled": "2015-08-06T10:57:16.109+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}