{"organizations": [], "uuid": "d535dad6e84f7965dc6c0011d5f8e651ac2881f8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3267122/images/o-MARCO-RUBIO-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/miami/blog.xml", "section_title": "Miami Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/regina-clemente/rubio-is-no-champion-for-immigration-reform_b_7938830.html", "country": "US", "title": "Rubio Is No Champion for Immigration Reform or Latino Voters", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Rubio Is No Champion for Immigration Reform or Latino Voters", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-05T17:07:00.000+03:00", "replies_count": 0, "uuid": "d535dad6e84f7965dc6c0011d5f8e651ac2881f8"}, "author": "Regina Clemente", "url": "http://www.huffingtonpost.com/regina-clemente/rubio-is-no-champion-for-immigration-reform_b_7938830.html", "ord_in_thread": 0, "title": "Rubio Is No Champion for Immigration Reform or Latino Voters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nSo far, there is only one Latino candidate on the top half of the long list of contenders for the 2016 presidential race: Marco Rubio. \nMany have not taken him seriously as a presidential contender. In the long tradition of career politicians, Rubio's career reads somewhat textbook. But what makes him stand out is the mere fact that he is Latino. \nAnd as the Latino population rises in the US , with immigration from Mexico and Central America as well as a huge exodus from Puerto Rico , many new Latino voters are making their homes in traditional swing states. In the same fashion as African American and young voters were sought out to shift the tides in those states for the 2008 and 2012 Obama victories, the Republican party is hoping that a candidate like Rubio will win over Latino voters . His Cuban heritage, his bilingual ability, the story of his grandfather's immigration and deportation orders will undoubtedly strike a chord with Latino voters who may see him as a native son; someone to be proud of and support in his quest for the American dream. \nHowever, Rubio's dream is most Latino-Americans' nightmare. Per polls, for Latino voters, immigration is a big issue . Immigration reform is the key to upward mobility, better housing, better economics, quality education, and various other life factors that can't be addressed without a tangible way to become a legal American citizen. At one point in time Rubio, who's own family's story begins with illegal immigration and avoided deportation, championed the idea of a \"pathway to citizenship\". His party, on the other hand, did not. As a result, he abandoned his heritage, he abandoned the cause, and came out against his own legislation. What's even worse, he began to speak publicly against immigrants and activist groups such as the Dreamers ; the very groups he once fought for. Why? Because his political aspirations meant more to him than actually doing something with the power he had in office to forge the same path that had been allotted him by his grandfather becoming a citizen. \nRubio's stumping in Iowa and across the nation almost entirely in Spanish is, quite frankly, a slap in the face to the intelligence of Latino Americans. The GOP's hope is that he will beguile voters with the \"we're so alike\" rhetoric and shared stories of heritage that they will not notice that his platform is set against their best interests. Rubio's hope is that his story and promises of working with white people to gain their trust so real immigration work can begin will buy him his seat on the 2016 ticket and ultimately begin his road to the presidency or vice-presidency. Will he ever revisit immigration in a meaningful way? It's doubtful. The GOP is staunchly against real immigration reform. And Rubio is now in lock step with the party line. \nAs the GOP debates kick-off this week, so will the full audition process. Rubio will make his case as to why he has the inside track with Latinos, why he understands their plight...and he will masterfully shift to why, even as a Latino, immigration must still be illegal and borders must be more secure. He will do his best to appease everyone. \nAs the new Brave New Films Action Fund short, The Real Rubio shows, he will say and do almost anything to gain support and votes. Watch the film and see for yourself. Share it with your family, your coworkers, and friends and activists in the Latino community. Don't let Marco Rubio make a mockery of this nation and of the Hispanic vote. \nAll that glitters is not gold. And all that speak Spanish are not interested in being a true Latino champion. More:", "external_links": [], "published": "2015-08-05T17:07:00.000+03:00", "crawled": "2015-08-05T18:06:15.694+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}