{"organizations": [], "uuid": "6049ed943aca95535c6c6f10f7ea528625e7949f", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/08/14/WE01232465/3665045/walkingwithyoujpg-3665045_lg.jpg", "site_section": "http://rss.ireport.com/feeds/latest.rss", "section_title": "CNN iReport - Latest", "url": "http://ireport.cnn.com/docs/DOC-1263687?ref=feeds%2Flatest", "country": "US", "title": "United States Citizenship and Immigration Service Denying Temporary Visas to Skilled Workers, Managers, Executives and Business Owners at Record Levels, and Immigration Lawyers Want to Know Why", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "United States Citizenship and Immigration Service Denying Temporary Visas to Skilled Workers, Managers, Executives and Business Owners at Record Levels, and Immigration Lawyers Want to Know Why", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-14T18:44:00.000+03:00", "replies_count": 0, "uuid": "6049ed943aca95535c6c6f10f7ea528625e7949f"}, "author": "dlvseo", "url": "http://ireport.cnn.com/docs/DOC-1263687?ref=feeds%2Flatest", "ord_in_thread": 0, "title": "United States Citizenship and Immigration Service Denying Temporary Visas to Skilled Workers, Managers, Executives and Business Owners at Record Levels, and Immigration Lawyers Want to Know Why", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNN PRODUCER NOTE United States Citizenship and Immigration Service Denying Temporary Visas to Skilled Workers, Managers, Executives and Business Owners at Record Levels, and Immigration Lawyers Want to Know Why As a pipeline that supplies U.S.-based businesses with much needed talent and expertise, the L-1 visa has a critical role to play in the functioning of the American economy. Every year tens of thousands of highly-skilled workers, managers and executives enter the U.S. under the auspices of the L-1, which allows foreign businesses operating here—or national companies with an overseas presence—to fill open posts by reassigning qualified individuals already in their employ. The L visa comes in two forms: the L-1B, for employees with “specialized knowledge” (i.e., an advanced understanding of a company’s products, services, processes or procedures that would make them difficult to replace), and the L-1A, for executives and managers who’ve already proven their mettle in a company’s overseas operations. The L-1A is also for foreign business owners who want to spend time in the United States overseeing the opening of new branches or offices. Both the L-1B (the more commonly awarded) and the L-1A are initially approved for one year and can be renewed (with USCIS approval) for longer periods after that. These are temporary visas, however, and do not lead directly to permanent residency. The L-1 visa application process is supposed to be relatively straightforward. The standards of the United States Citizenship and Immigration Service (USCIS) are strict and its requirements are many, but as long as great care is taken and all information asked for is provided, L-1 applicants should be in good shape—theoretically. In recent years, however, L-1 approval rates for new applications and renewals have been inexplicably dropping at an accelerating rate. No announcement of tightening standards has been made, but by all indications it appears standards have indeed been tightened, and no one is quite sure what precipitated the modification. According to the National Foundation for American Policy, rejections of L-1B visa applications and/or applications for renewal jumped from just 6 percent in 2006 to 35 percent in 2014, and the testimony of experts in the field suggests that percentage is continuing to rise. Requests for Evidence (RFEs), which are sent by USCIS adjudicators to L-1 hopefuls whose initial applications were judged inadequate, were received by just 2 percent of filers in 2004. But ten years later that number had soared to 45 percent, and the RFEs appear to be getting more demanding as time progresses. L-1A Applicants in the Crosshairs Up until recently, the L-1A visa process has been running more smoothly. But that situation appears to be changing. While authoritative statistics are not yet available, anecdotal evidence suggests those seeking permission to transfer into the U.S. to assume managerial or executive positions, or to come over to open new offices or branches of the parent company, are now being turned down far more frequently than in the past. Simone Bertollini, an experienced immigration attorney from New Jersey (http://www.simonebertollini1.com/) who has handled hundreds of cases, has noticed the USCIS’s change in policy and is baffled by it. Recently he’s seen two prestigious clients—Italian owners of a construction company and a marble company respectively—get turned down for L-1A “new office” visas, despite jumping through hoops to provide tons of information about their business plans, financial accounts, personal and professional histories, educational backgrounds—anything and everything that might be relevant, in triplicate where necessary and carefully vetted to eliminate evidence gaps, grammatical errors and confusing language. But in each case, applications that should have been slam dunks for approval—and would have been 10 years ago—were rebuffed for no discernible reason. The owner of the Italian construction company was chastised by the USCIS for not providing specific job descriptions listed on the proposed U.S. corporate chart, but “the USCIS didn’t even ask for that,” according to the incredulous Bertollini, who says his client provided 165 pages of verifying data in support of his response to the USCIS’s RFE. His other spurned client, the owner of the Italian marble company, had seemingly proved his sincerity by spending more than a quarter-of-a-million dollars of his own money on equipment, inventory and purchases in the United States in the months before filing his application. But in the eyes of the USCIS, that was not enough to prove his honorable intentions—no dice on the visa, they said, thwarting his attempts to deepen his investment in the U.S. economy. Published L-1A standards say new office candidates must only establish it is “more likely than not” they will open a new branch within one year of their arrival on U.S. soil. But based on the USCIS’s recent decisions, Bertollini believes they’ve unilaterally elevated this simple standard to something far higher than “beyond a reasonable doubt,” despite the absence of any published mandate signaling their intention to do so. Why Here, Why Now? Some Possible Answers No one is sure why this drastic change in immigration policy has taken place. The USCIS isn’t talking and few media outlets seem willing to ask pointed questions. But experts on immigration law and commentators on the politics of immigration are speaking up, offering educated guesses about the hidden agendas and palace intrigue that might be pushing the USCIS toward a more reactionary stance. Suspicions of fraud and abuse: Critics of the L-1 system see it as a disguised form of outsourcing. They claim companies seeking permission to transfer supposedly “essential” labor from abroad are really just importing cheaper workers to replace—or reduce their need for—more highly-paid American workers. These critics believe the “specialized knowledge” stipulation of the L-1B visa has been especially abused and that little evidence exists to suggest employees trained overseas are the only ones capable of filling new posts in the United States. Some theorize this drumbeat of fraud accusations—and the political pressures it is helping to create—may be influencing the behavior of USCIS, leading it to crack down on perceived abuses. If so, this is an unfortunate turn of events, since a 2006 investigation carried out by the Department of Homeland Security’s Office of the Inspector General (OIG) found scant evidence to suggest high-tech, highly-skilled American workers are being frequently displaced by L-1 imports. Concern over job loss and economic decline following recession: In 2008, unemployment rates in the U.S. soared as the financial system imploded. The country—and the world—teetered on the brink of disaster, and no one was sure if or when the U.S. economy would pull itself out of its death spiral. Coincidentally (or maybe not) it was just about that time the USCIS suddenly began to demonstrate a newfound truculence in its dealings with L-1 visa applicants, leading some to speculate that economic recession may have triggered protectionist impulses inside the immigration establishment. The old canard about immigrants taking American jobs was being bandied about quite frequently in those days, during political campaigns as well as in the media, and this may have had a subliminal effect on the deliberations of USCIS adjudicators. Sources:", "external_links": [], "published": "2015-08-14T18:44:00.000+03:00", "crawled": "2015-08-14T18:58:38.596+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}