{"organizations": [], "uuid": "b06a60e5210a582059a7b1d55cac9cdf7d4e3205", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/afghanistan12152014getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/defense/252976-house-chairman-warns-against-hasty-afghanistan-withdrawal", "country": "US", "title": "GOP chairman warns Obama against 'hasty' Afghan withdrawal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP chairman warns Obama against 'hasty' Afghan withdrawal", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-08T23:56:00.000+03:00", "replies_count": 0, "uuid": "b06a60e5210a582059a7b1d55cac9cdf7d4e3205"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/252976-house-chairman-warns-against-hasty-afghanistan-withdrawal", "ord_in_thread": 0, "title": "GOP chairman warns Obama against 'hasty' Afghan withdrawal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP chairman warns Obama against 'hasty' Afghan withdrawal Getty Images By Kristina Wong - 09/08/15 04:56 PM EDT \nHouse Armed Services Committee Chairman Rep. Mac Thornberry (R-Texas) is urging the Obama administration to halt the draw down of U.S. troops in Afghanistan amid worries it could again become a terrorist safe haven. \n\"I'm concerned about the decisions that the president is to make in the next few weeks or months\" about the planned pace of the drawdown, said Thornberry, who just returned from a trip to Afghanistan. \nThe Obama administration is scheduled to begin drawing down the roughly 9,800 U.S. troops there to just an embassy presence of around 1,000 by the end of next year, when President Obama leaves office. ADVERTISEMENT Thornberry said that move would leave Afghanistan vulnerable to the Taliban, al Qaeda remnants, a growing Islamic State in Iraq and Syria (ISIS) presence, and other terrorist groups who could plot attacks against the U.S.\n\"What I'm looking at is what's in U.S. national security interests, and I keep coming back to the point that terrorism is always going to be attracted to Afghanistan. We've seen homeland plots in the past come from there, and for us not to have a presence, for us not to be able to gather intelligence, it would just be a huge blunder,\" he said. \nThe chairman also said the ISIS presence in Afghanistan \"has grown faster there than most people in Washington appreciate.\" \nArmy Gen. John Campbell, the head of coalition forces there, is due to deliver his recommendations on the pace of the drawdown to the administration in the coming weeks. Thornberry said he met with him \"at length,\" as well as with Afghan President Abdul Ghani. \nWhile Thornberry said he did not favor a \"permanent\" U.S. troop presence in Afghanistan, he said the administration should at least stop drawing down forces and closing bases. \n\"Don't close any bases of the remaining bases. So we're just down to a handful of facilities, and I think, don't make it any worse,\" he warned. \n\"Right now, everybody's planning to basically follow the Iraq model, which is, bring the remaining troops into the embassy in Kabul, and close everything else,\" Thornberry said. \n\"A great deal of damage comes to our national security interests when we beat a hasty withdrawal,\" he added. \"Good heavens, if we've learned anything from what's happened in Iraq, surely we've learned that.\" \nThe administration decided to withdraw all U.S. troops from Iraq in 2011, after both countries failed to sign an agreement that would have given U.S. troops immunity from Iraqi law. \nCritics point to that decision as a major factor in allowing al Qaeda militants in Iraq, who later became the ISIS, to gain a foothold in the country last year. \nThe administration plan would see the closure of the handful of remaining U.S. military bases in Afghanistan, and a U.S. troop presence only in the embassy in Kabul. \n\"If that happens, we cannot collect the intelligence we need to collect, we will have more limited ability to conduct counterterrorism operations. It will be a big loss to us,\" Thornberry said. \nThe U.S. first deployed troops in Afghanistan in 2001, after al Qaeda head Osama bin Laden planned and oversaw the September 11, 2001 World Trade Center attacks there. Bin Laden was given safe haven by the Taliban, which then controlled the government. \nThe U.S.-led coalition troop presence grew to 120,000 at the height of the war in 2009. Obama, however, pledged to end both wars in Iraq and Afghanistan and announced in 2014 a plan to gradually withdraw all but an embassy presence by the end of 2016. \nThe drawdown has already been slowed once last year. The administration was slated to drawdown U.S. troops from 9,800 to 5,400 by the end of this year, but that plan was scrapped amid a continuing threat from the Taliban and a difficult fighting season. \nLast month, the Taliban launched several high-profile suicide attacks in Kabul. One attack killed three U.S. contractors. Also last month, an insurgent dressed in Afghan uniforms killed two U.S. airmen in Helmand Province, where thousands of Marines had once deployed to push out the Taliban. \n\"Afghanistan will always be attractive to terrorist organizations because of its location, because of its ungoverned spaces, because of its history, because they go to make money off the narcotics trade,\" Thornberry said. \n\"Seems to me it'd be foolish to walk away from the considerable investment of blood and money that we have made there.\" Tags:", "external_links": [], "published": "2015-09-08T23:56:00.000+03:00", "crawled": "2015-09-09T06:27:13.191+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}