{"organizations": [], "uuid": "dbd412bf70dd8a45b429408492e459330f6f2363", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/schwarzenegger040315_getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1625/feed", "section_title": "Presidential races", "url": "http://thehill.com/blogs/ballot-box/presidential-races/250456-schwarzenegger-pressed-gop-debaters-on-immigration", "country": "US", "title": "Schwarzenegger presses GOP debaters on immigration", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Schwarzenegger presses GOP debaters on immigration", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-06T22:13:00.000+03:00", "replies_count": 0, "uuid": "dbd412bf70dd8a45b429408492e459330f6f2363"}, "author": "bgoad@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/250456-schwarzenegger-pressed-gop-debaters-on-immigration", "ord_in_thread": 0, "title": "Schwarzenegger presses GOP debaters on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 06, 2015, 03:13 pm Schwarzenegger presses GOP debaters on immigration By Mark Hensch Getty Former California Gov. Arnold Schwarzenegger (R) is urging the GOP’s 2016 field to address immigration during Thursday night’s televised Republican presidential debate. Schwarzenegger said he wants answers from his party’s White House hopefuls about their ideas for reforming immigration in an online video posted earlier that afternoon. “As you know, I’m an immigrant, and this country was built by immigrants,” he said in a clip published on his Facebook account . “And of course, this is the greatest country in the world. “But, you also have to admit there is an illegal immigration problem, and we have to solve that,” Schwarzenegger said. “I want to ask the candidates — what would you do?” Schwarzenegger continued. \"I don’t want to hear policy talks, or anything like that,” the actor added. “I want to know, how do you bring both of the parties together, Democrats and Republicans, and solve this problem once and for all?\" Schwarzenegger then posted a Facebook picture celebrating his own nationalization as proof of why the immigration debate matters. “This is the day I became a citizen, one of the proudest days of my life,” he wrote in the picture’s caption. The action star’s remarks come as the GOP conducts its first presidential debate on Thursday night in Cleveland. Fox News is hosting the 2016 event and splitting the crowded Republican field into two separate events. The top 10 Republican candidates, based on an average of national polling results, are clashing in a main-stage debate Thursday night. The remaining seven contenders, meanwhile, square off in an earlier forum before the prime-time edition.", "external_links": [], "published": "2015-08-06T22:13:00.000+03:00", "crawled": "2015-08-07T00:43:07.623+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}