{"organizations": [], "uuid": "21a8efa8593880cea7b1c2aea3cc1e7470d842c2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3394558/images/o-IRAN-NUCLEAR-DEAL-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/quora/president-obama-lays-out_b_8119116.html", "country": "US", "title": "President Obama Lays Out How the Iran Nuclear Deal Will Never Allow Iran to Build a Nuclear Weapon | Quora", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "President Obama Lays Out How the Iran Nuclear Deal Will Never Allow Iran to Build a Nuclear Weapon | Quora", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-11T00:43:00.000+03:00", "replies_count": 0, "uuid": "21a8efa8593880cea7b1c2aea3cc1e7470d842c2"}, "author": "Quora", "url": "http://www.huffingtonpost.com/quora/president-obama-lays-out_b_8119116.html", "ord_in_thread": 0, "title": "President Obama Lays Out How the Iran Nuclear Deal Will Never Allow Iran to Build a Nuclear Weapon | Quora", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What is it about the Iran nuclear deal that keeps them from getting nuclear weapons? originally appeared on Quora : The best answer to any question .\nAnswer by Barack Obama , 44th President of the United States, on Quora :\nThe Iran deal is a historic diplomatic achievement and all 159 pages are worth digging into, which you can do here . But, let me lay out how this deal will work:\nUnder this agreement, Iran is never allowed to build a nuclear weapon — period.\nEvery single pathway Iran could use is effectively blocked by this deal. Here's how: It takes either enriched uranium or plutonium to build a nuclear weapon. The only site where Iran can create weapons-grade plutonium is at its Arak reactor. Under this deal, the core of the Arak reactor will be pulled out, filled with concrete, and replaced with one that will not produce weapons-grade plutonium. Furthermore, the spent fuel from that reactor will be shipped out of the country and Iran will not build any new heavy-water reactors for at least 15 years.\nThis deal also shuts off Iran's uranium pathway by removing two-thirds of its centrifuges and getting rid of 98% of its stockpile of enriched uranium, which — right now — is currently enough for up to 10 nuclear bombs.\nAnd should Iran try to build a bomb in secret, this deal effectively cuts off that covert pathway too because of a robust and unprecedented inspections regime. There will be 24/7 monitoring of Iran's key nuclear facilities and, for decades, international inspectors from the IAEA will have access to Iran's entire nuclear supply chain — from uranium mines and mills to centrifuge productions facilities. For Iran to cheat, it would need a secret source for every single aspect of that supply chain. No nation in history has been able to pull that off, especially when faced with such rigorous and constant inspection. And the IAEA will have the permanent ability to inspect any suspicious sites.\nWatch my Secretary of Energy Ernest Moniz, a nuclear physicist himself and a negotiator who helped secure this agreement, walk through the science behind the deal.\nThis is not just the conclusion of those who negotiated the deal, but also of experts who have taken the time to review its details. In fact, 29 of America's leading scientists — including Nobel Laureates — call it an \"innovative agreement, with much more stringent constraints than any previously negotiated non-proliferation framework.\"\nThis deal is based on science and unprecedented verification. It offers the best opportunity we have to prevent a nuclear-armed Iran. There is no better deal — and those who claim there is one are selling a fantasy.\nThis deal took a long time to negotiate — nearly two years — because we refused to accept any deal that didn't meet every one of our bottom lines, and that's what we got.\nThis question originally appeared on Quora. Ask a question, get a great answer. Learn from experts and access insider knowledge. You can follow Quora on Twitter , Facebook , and Google+ . More questions: Iran Nuclear Deal (July 2015) : Can Iran's leaders be trusted? Iran : Why are so many American politicians angling for a war with Iran? Nuclear Weapons : Would a rejection of the Iran nuclear deal by Congress be a vote for war? Follow Quora on Twitter: www.twitter.com/Quora\nMore: Iran Deal Barack Obama President Obama Iran Iran Nuclear Deal", "external_links": ["https://twitter.com/Quora", "http://www.quora.com/Iran-Nuclear-Deal-July-2015/Can-Irans-leaders-be-trusted?ref=huffpo&rel_pos=1", "https://www.quora.com/Iran-Nuclear-Deal-July-2015", "http://www.whitehouse.gov/Iran-Deal", "https://www.facebook.com/quora", "https://plus.google.com/111127313006403749982/posts", "http://www.twitter.com/Quora", "https://www.quora.com/Barack-Obama", "https://www.quora.com/Why-are-so-many-American-politicians-angling-for-a-war-with-Iran?ref=huffpo&rel_pos=2", "https://www.quora.com/Would-a-rejection-of-the-Iran-nuclear-deal-by-Congress-be-a-vote-for-war?ref=huffpo&rel_pos=3", "https://www.quora.com/Nuclear-Weapons", "https://www.quora.com/What-is-it-about-the-Iran-nuclear-deal-that-keeps-them-from-getting-nuclear-weapons/answer/Barack-Obama", "https://www.quora.com/What-is-it-about-the-Iran-nuclear-deal-that-keeps-them-from-getting-nuclear-weapons", "https://medium.com/the-iran-deal", "https://www.quora.com/Iran"], "published": "2015-09-11T00:43:00.000+03:00", "crawled": "2015-09-10T23:52:10.192+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}