{"organizations": [], "uuid": "5bcceb01ff76feff6feb78207bd42c41bb1445c6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/mary-anne-hitt/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/mary-anne-hitt/70-mayors-to-president-ob_b_8196638.html", "country": "US", "title": "70 Mayors to President Obama: We Support Strong Clean Air Protections Against Smog Pollution! | Mary Anne Hitt", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "70 Mayors to President Obama: We Support Strong Clean Air Protections Against Smog Pollution! | Mary Anne Hitt", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T20:06:00.000+03:00", "replies_count": 0, "uuid": "5bcceb01ff76feff6feb78207bd42c41bb1445c6"}, "author": "Mary Anne Hitt", "url": "http://www.huffingtonpost.com/mary-anne-hitt/70-mayors-to-president-ob_b_8196638.html", "ord_in_thread": 0, "title": "70 Mayors to President Obama: We Support Strong Clean Air Protections Against Smog Pollution! | Mary Anne Hitt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If it's possible to love something else as much as the Pope's statements on climate this week, it's this: On Tuesday, 70 mayors from across the U.S. sent a letter to President Obama signaling their support for a strong clean air protections against smog pollution.\nLed by the mayors of Salt Lake City, Utah, and Grand Rapids, Michigan, the letter states:\nAs local elected officials representing big cities and small towns, we want to express our strong support for the Environmental Protection Agency's work to update the ozone (or smog) standard. The current, George W. Bush-era standard of 75 parts for billion (ppb) has been widely acknowledged by the medical community as insufficient to protect public health. As mayors, we are on the front lines of protecting the safety and well-being of our constituents and this long-overdue update will reap tremendous benefits for our communities. To best guard our families and constituents from this dangerous pollutant, we urge EPA to stay true to the science and in setting the standard follow the guidance of expert medical organizations like the American Lung Association, the American Heart Association, the American Thoracic Society, and the American Academy of Pediatrics.\nThe letter was also signed by the mayors of Chicago, New York City, Pittsburgh, St. Louis, Los Angeles, Baltimore, Philadelphia, Charlotte, and Seattle, as well as mayors from cities in a wide range of states, including Oklahoma, Arkansas, Indiana, and New Mexico -- you can see the full list of mayors and the letter here (PDF).\nI am heartened to see elected officials taking such a strong stance for public health and clean air on behalf of their communities - especially in the face of big polluters like the National Association of Manufacturers, who are proactively trying to keep our current standard from being strengthened. The White House is under court order to release an updated smog standard by October 1 and the Sierra Club, along with our health and environmental allies, are calling for a strong, 60 ppb standard. Medical scientists say 60 ppb is the only standard (PDF) that can truly protect our families from the dangerous illnesses exacerbated by smog pollution.\nAccording to pulmonologists, inhaling smog pollution is like getting a sunburn on your lungs and often results in immediate breathing trouble. Long term exposure to smog pollution is linked to chronic asthma and other respiratory and lung diseases, reproductive and developmental harm, and even premature death. Children are at the greatest health risk from smog pollution because they are more likely to be active outdoors and their lungs are still developing.\nSmog pollution also disproportionately affects low-income communities and communities of color . African American children, for example, are three times more likely to be admitted to the hospital for asthma than other children, and Latino children are 60 percent more likely. Throughout the country, communities of color are significantly overrepresented in many areas with unsafe air.\nReducing smog pollution could prevent millions of asthma attacks among children over the next ten years. That's why the EPA's move to crack down on smog is so vital -- and why it's so important to push the White House and EPA to move forward with the strongest possible standard.\nYou can help - take action today to tell EPA to enact a strong smog standard !\nFollow Mary Anne Hitt on Twitter: www.twitter.com/maryannehitt\nMore: Energy Environment Smog Air Pollution Sierra Club Environmental Health Asthma", "external_links": ["http://grcity.us/Pages/Mayor-Heartwell-signals-support-for-stronger-clean-air-protections.aspx", "https://slcgreen.files.wordpress.com/2015/09/mayors-smog-letter-final-copy-9-21-2015.pdf", "http://content.sierraclub.org/press-releases/2015/09/environmental-public-health-and-civil-rights-groups-unveil-new-environmental", "http://mediamatters.org/research/2015/08/31/what-media-should-know-about-the-fossil-fuel-in/205280", "http://www.twitter.com/maryannehitt", "http://sc.org/smog", "http://www.lung.org/get-involved/advocate/advocacy-documents/national-health-and-medical.pdf", "http://slcgreenblog.com/2015/09/21/mayor-becker-signals-support-for-stronger-clean-air-protections/"], "published": "2015-09-25T20:06:00.000+03:00", "crawled": "2015-09-25T20:11:10.930+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}