{"organizations": [], "uuid": "e0475b54cc24e5c5d6d8692fc02244ca89c9412a", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/civil-rights/249952-what-will-it-take-for-the-obama-administration-to-budge-on", "country": "US", "title": "What will it take for the Obama administration to budge on incarcerating mothers and children?", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "What will it take for the Obama administration to budge on incarcerating mothers and children?", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-03T13:00:00.000+03:00", "replies_count": 0, "uuid": "e0475b54cc24e5c5d6d8692fc02244ca89c9412a"}, "author": "Kim Hunter", "url": "http://thehill.com/blogs/congress-blog/civil-rights/249952-what-will-it-take-for-the-obama-administration-to-budge-on", "ord_in_thread": 0, "title": "What will it take for the Obama administration to budge on incarcerating mothers and children?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 03, 2015, 06:00 am What will it take for the Obama administration to budge on incarcerating mothers and children? By Kim Hunter \nEvery mother, child, attorney, and advocate who manages to leave the Obama administration's jail-like facilities in Texas and Pennsylvania does so with a series of sickening anecdotes. Every friend, family member, or colleague who learns of the detention centers for the first time is shocked to learn that this is actually happening on American soil. Yet, the same president who has pledged to do all he can to expand legal opportunities for immigrants through executive action is simultaneously leading the charge to make refugee internment a permanent feature of our already expansive private prison system designed to incarcerate non-citizens. \nAt this point, the government is no longer just ramping up on imprisoning refugee families; it's disregarding a judge’s order to stop. The number of \"family units\" in custody has increased nearly ten-fold during the last year. Those \"family units\" at the South Texas \"Family Residential Center\" in Dilley, Texas, (operated for profit by the Corrections Corporation of America) are all mothers with their children. Nearly all fathers, brothers, and grandparents seeking asylum are released shortly after crossing the border. Tragically, due to reprehensible policies, mothers with their children stand a good chance of being indefinitely imprisoned at two Kafka-esque \"facilities\" in South Texas. ADVERTISEMENT Every step forward that attorneys and advocates make in securing basic legal rights for these families is quickly countered with a new \"policy\" from the government. First, mothers were being held with no bonds, or astronomically high bonds of between twenty and thirty thousand dollars. After a court held that the government had to make \"individualized\" bond decisions and could not use deterring future refugees as a basis for prolonged custody, ICE responded by making cookie cutter decisions of $15,000 bonds for refugees with few supporting documents from a sponsor, ten to twelve thousand for those with at least two identification/supporting documents, and $7,500 for those with three or more documents. \nMeanwhile, a court decision finding that children could not be held in secure, prison-like facilities (known as Flores ) had been brought up again as attorneys sought to ensure it was being enforced. Trying to “win” the argument, the government redefined who qualifies as a child, so that it did NOT include a child who entered the U.S. with a parent, in an effort to deprive so-called \"accompanied children\" of the most basic protections. As negotiations ground on, the government announced several \"voluntary\" reforms of the internment camps. The administration claimed it would [really, really, we mean it this time] give meaningful individualized reviews to mothers with their children. Attorneys and advocates did see some improvements in terms of release, which, combined with bond decisions from the third set of immigration judges to hear these cases, resulted in some lower bonds and faster releases. \nThe administration’s treatment of these vulnerable women got worse in another way though, by \"offering\" these mothers release without bond in closed-door meetings their attorneys were excluded from. The only condition? Sign a document (in English, which the mothers weren't given a copy of) agreeing to an ankle shackle and with it, discomfort, anxiety over its function, and an indefinite period of GPS monitoring. Many women signed for the \"grillette\" because they were desperate to be released, didn't understand what they were signing, or didn't think they had a choice. To add insult to injury, several mothers who actually \"willingly\" signed for the grillette on July 13 were still at Dilley two weeks later. One mother I represented was given a zero bond decision by an immigration judge on Monday, but before morning court sessions concluded, ICE had attached an ankle shackle to her and whisked her away on a bus to San Antonio. \nOn July 24, Judge Dolly Gee ruled that the Flores settlement applied to ALL children in U.S. government custody. She noted she was astonished that the government fabricated such a massive infrastructure “without more evidence to show that it would be compliant with an Agreement that has been in effect for nearly 20 years or effective at achieving what Defendants hoped it would accomplish.” The government has until August 3rd to respond regarding why her full order cannot be implemented within 90 days. This week, the pace of releases from Dilley picked up. At the same time many \"family units\" were being released, the administration scoffed at Judge Gee’s ruling by imprisoning over 90 new mothers with their children in Dilley from Friday until Tuesday. \nSadly, it appears that no matter how many times the courts say \"no,\" the Obama administration is committed to creating a permanent infrastructure that enriches private companies and re-traumatizes refugees. Perhaps one day a future administration will finally apologize for these unconscionable actions, just as President Reagan eventually apologized on behalf of the U.S. government for the shameful internment of Japanese-Americans during World War II. \nHunter is an immigration attorney and volunteer with the CARA Family Detention Pro Bono Project.", "external_links": [], "published": "2015-08-03T13:00:00.000+03:00", "crawled": "2015-08-03T15:44:21.695+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}