{"organizations": [], "uuid": "df8dd0f6cdfa45c32eccb193cbf8cd025a747301", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/rubio_2.jpg", "site_section": "http://thehill.com/taxonomy/term/1625/feed", "section_title": "Presidential races", "url": "http://thehill.com/blogs/ballot-box/presidential-races/250553-rubio-on-defense-over-abortion-stance", "country": "US", "title": "Rubio on defense over abortion stance", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Rubio on defense over abortion stance", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-07T17:28:00.000+03:00", "replies_count": 0, "uuid": "df8dd0f6cdfa45c32eccb193cbf8cd025a747301"}, "author": "bgoad@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/250553-rubio-on-defense-over-abortion-stance", "ord_in_thread": 0, "title": "Rubio on defense over abortion stance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 07, 2015, 10:28 am Rubio on defense over abortion stance By Jordain Carney Sen. Marco Rubio (R-Fla.) went on defense Friday morning over his previous support for an abortion bill that included exceptions for rape and incest. \"I've never said that I will only support a bill that has an exception in it, but I will support bills that have exceptions in it because they prevent abortions,\" Rubio said during an interview with CNN's \"New Day.\" \"I'm here to save as many of those unborn children's lives as possible.\" Rubio's remarks follow his questioning by Megyn Kelly during the Republican debate Thursday night. Kelly suggested that Rubio favors \"a rape and incest exception to abortion laws.\" ADVERTISEMENT The Florida Republican co-sponsored a bill in 2013 that would have blocked abortions after 20 weeks; it had exceptions for rape, incest and the mother's life. CNN's Chris Cuomo told Rubio on Friday morning that \"it seems you had your own record wrong,\" and asked if he wanted to walk back his comments during Thursday's debate. But Rubio brushed aside suggestions that he had flip-flopped on the issue. \"Everybody supported that bill. Every single pro-life senator, every single pro-life group ... supported that bill you're just talking about because it prevents abortions,\" he said. Rubio added that he does not specifically support rape or incest exceptions, saying that \"[while] I think both of those instances are horrifying ... I personally believe you do not correct one tragedy with a second tragedy.\" Cuomo suggested that Rubio's stance on abortion doesn't line up with American voters, saying that \"cultural mores in the country, certainly the opinions of women, are not in step with what you’re saying right now. Are you comfortable with that?\" Rubio, however, rejected that his stance on abortion put him at odds with female voters. \"The value of life is timeless,\" he responded, going back-and-forth with Cuomo about if human life began at conception. \"Science has decided that it's human life. ... What else can it be? It can't turn into an animal. It can't turn into a donkey.\"", "external_links": [], "published": "2015-08-07T17:28:00.000+03:00", "crawled": "2015-08-07T23:25:01.243+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}