{"organizations": [], "uuid": "419b7c5b0e6201d54faf4e2b76eab18221c7a5cf", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150715085208-01-planned-parenthood-file-large-169.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&q=video&cf=all&output=rss", "section_title": "video - Google News", "url": "http://edition.cnn.com/2015/08/04/politics/planned-parenthood-fifth-video-houston/", "country": "IL", "title": "Anti-abortion group releases fifth Planned Parenthood video - CNN", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Anti-abortion group releases fifth Planned Parenthood video - CNN", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-04T22:10:00.000+03:00", "replies_count": 0, "uuid": "419b7c5b0e6201d54faf4e2b76eab18221c7a5cf"}, "author": "", "url": "http://edition.cnn.com/2015/08/04/politics/planned-parenthood-fifth-video-houston/", "ord_in_thread": 0, "title": "Anti-abortion group releases fifth Planned Parenthood video - CNN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What's next in Planned Parenthood fight? 05:57 PLAY VIDEO \"It's something that we can look at exploring: How we can make that happen so we have the highest chance,\" she's heard saying in the video. \"It will probably also require a little bit of input from the doctors. Doctors are the ones asking, directly doing that.\" Third Planned Parenthood video released as Senate Republicans seek to end funding Some abortion doctors are researchers themselves and perform abortions in a way that allows them to get the most intact organs for their own research, Farrell said. \"If we alter our process and we are able to obtain intact fetal cadavers, then we can make it part of the budget,\" she said. \"I mean that's -- it's all just a matter of line items.\" Also in the latest clip, Abby Johnson, the former clinic director of Planned Parenthood Gulf Coast, said her Planned Parenthood branch made about $120,000 a month selling aborted fetus tissue and organs. Johnson also made the claim to the Texas Senate last week. Planned Parenthood has denied that it sells organs and tissue from aborted fetuses and said all figures discussed in previous videos are connected to the costs of shipping and handling. In a statement Tuesday afternoon, Dawn Laguens, Planned Parenthood's executive vice president, said the video was edited out of context. Second Planned Parenthood video surfaces showing alleged selling of fetal tissue \"The latest tape has at least 20 substantial and unexplained edits. Previous tapes released by this extremist group were heavily edited in order to distort what the people on the tapes actually said,\" she said. \"These videos are intended to shock and deceive the public. For example, one video was edited to make it look like a doctor said she would \"sell\" fetal tissue for a profit -- when in fact, she said the exact opposite, 10 separate times, and nearly all instances were edited out of the tape.\" The Center for Medical Progress has released four heavily edited videos over the last month as well as several clips that the California group says are unedited. At least two courts have issued restraining orders against The Center for Medical Progress, ordering them not to release the videos out of concern that they were illegally recorded and that the lives of the individuals featured in the videos could be harmed. Laguens on Tuesday slammed efforts to defund the women's health organization as \"political games\" that are \"intended to score political points.\" \"What we're seeing here are attacks on people's ability to get health care. We're seeing attacks that are intended, in their end analysis, to get rid of safe, legal abortion in this country and destroy Planned Parenthood, who stands up for the reproductive health rights and freedom of women and all people in this country,\" she told Alisyn Camerota on CNN's \"New Day.\" JUST WATCHED", "external_links": [], "published": "2015-08-04T22:10:00.000+03:00", "crawled": "2015-08-05T02:35:14.557+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}