{"organizations": [], "uuid": "ab1cae0773a4f699dd3361bafda2f638708aa204", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/cotton.png", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/254653-sen-cotton-slams-obama-for-latest-gitmo-transfer", "country": "US", "title": "Sen. Cotton slams Obama for latest Gitmo transfer", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Sen. Cotton slams Obama for latest Gitmo transfer", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-23T19:37:00.000+03:00", "replies_count": 0, "uuid": "ab1cae0773a4f699dd3361bafda2f638708aa204"}, "author": "rkheel@thehill.com (Rebecca Kheel)", "url": "http://thehill.com/policy/defense/254653-sen-cotton-slams-obama-for-latest-gitmo-transfer", "ord_in_thread": 0, "title": "Sen. Cotton slams Obama for latest Gitmo transfer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sen. Cotton slams Obama for latest Gitmo transfer By Rebecca Kheel - 09/23/15 12:37 PM EDT \nSen. Tom Cotton (R-Ark.) wants assurances that Saudi Arabia will monitor a recently transferred Guantanamo Bay detainee. \n“Congress should be provided with the memorandum of understanding regarding this transfer so we can fully understand the commitments made by Saudi Arabia to monitor this individual,” Cotton said in a written statement Wednesday. \nOn Tuesday, the Pentagon announced Abdul Shalabi has been transferred back to his home country, bringing the number of detainees at the military facility to 114. \nShalabi, 39, has been at Guantánamo since 2002, according to military files published by The New York Times. He is alleged to have been a member of al Qaeda and a bodyguard of Osama bin Laden, according to the files. \nThe Obama administration has been working to close the Guantánamo Bay detention facility to fulfill a promise the president made during his first presidential campaign. \nIn his statement, Cotton criticized President Obama for, he said, putting politics ahead of national security. \n“The release of this dangerous detainee, Abdul al Shalabi, to the Kingdom of Saudi Arabia is another example of President Obama playing politics with national security and putting campaign promises ahead of U.S. national security interests,” Cotton said. “It’s concerning that (Defense) Secretary (Ash) Carter would authorize this transfer, particularly given Saudi Arabia’s recidivism track record.” Tags: Past: 1 day Senate rejects effort to strip... The vote thwarted the opening move by Republicans to avoid a shutdown on... Here we go again: Cruz vs.... Sen. Ted Cruz is gearing up for another showdown with Republican leaders... Trump goes into attack mode Trump hit Fox News, CNN, Marco Rubio and Rand Paul in morning interviews. China's Silicon Valley power play The Seattle tech summit could demonstrate the sway Beijing has over... Lanny Davis: Making news: The... OPINION | The media should be ashamed. White House denies blocking 13-... C.J. Pearson says he received a message that the White House was blocking... Feds approve NFL drone flights The approval is for aerial videography and television filming. Pope's visit brings tears for... Boehner, a lifelong Catholic, at times appeared to be overcome with... Trump hits Rubio: 'He's a kid' \"He's got the worst voting record in the United States Senate,\" the GOP... Pentagon moves into uncharted... The military is making plans to operate under a yearlong emergency funding... FLOTUS to appear on 'Doc... Michelle Obama is about to get animated. Kanye West: Ben Carson is '... \"I think all the people running right now have something that each of the... Senate may avoid weekend work Cruz said his efforts don't necessarily mean disrupting the schedule. The pope, the president and... There could not be better timing for a fearless champion of peace to visit... Rubio: Trump is 'touchy and... “He’s not that well-informed on the issues,” Rubio said of the front-... Trump leads tight race in Florida... Five candidates draw double-digit support in the Sunshine State. CBO: Defunding Planned Parenthood... The CBO found the government would spend $130 million more over 10 years. Condoleezza Rice: I've had my fill... “I’ve spent a lot of my time in the world of politics,” said the former... Emails to hound Clinton for months For Team Clinton, it’s become the equivalent of a courtroom quagmire. Carson: Black people treated '... Republicans have “done a far better job than Democrats in getting over... Rove: Shutdown over Planned... \"Republicans ... will be unwitting allies of the abortion movement,\" he...", "external_links": [], "published": "2015-09-23T19:37:00.000+03:00", "crawled": "2015-09-24T22:47:39.329+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}