{"organizations": [], "uuid": "91bdc3f7702f1d869ac9cf7c70e1b8121834c5d9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3451640/images/o-ROGER-GOODELL-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/sports/blog.xml", "section_title": "Sports Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/derek-rosenfeld/nfl-traumatic-brain-injury-marijuana_b_8177246.html", "country": "US", "title": "Could Marijuana Help Prevent the Rare Brain Disease Afflicting Football Players? | Derek Rosenfeld", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 8, "title_full": "Could Marijuana Help Prevent the Rare Brain Disease Afflicting Football Players? | Derek Rosenfeld", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-22T19:52:00.000+03:00", "replies_count": 10, "uuid": "2926d4201476d4433d349aafd9a400a44956ef2b"}, "author": "Derek Rosenfeld", "url": "http://www.huffingtonpost.com/derek-rosenfeld/nfl-traumatic-brain-injury-marijuana_b_8177246.html#post-0", "ord_in_thread": 0, "title": "Could Marijuana Help Prevent the Rare Brain Disease Afflicting Football Players? | Derek Rosenfeld", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The NFL is back and I'm very excited about the upcoming season. But there is something that I have become more aware of recently that I can't help but think about while watching the game -- the issue of concussions, their effects on the brain, and how medical marijuana can help play a role in treating the problem.\nThere is a growing body of evidence that shows football players at any level, especially ones who repeatedly use their head to hit another player, can eventually develop a brain disease called chronic traumatic encephalopathy (CTE). The leading researchers studying the brains of deceased football players just released new figures showing they have found evidence of CTE in 87 out of 91 brains of former NFL players. The disease can lead to conditions such as memory loss, depression and dementia. The powerful special produced by PBS' Frontline, \" League of Denial: The NFL's Concussion Crisis ,\" first opened my eyes to the gravity of the issue.\nMy loves for football and drug policy reform collided when I found out about the great work being done by a former Super Bowl champion, Marvin Washington , who is leading the fight calling on the NFL to incorporate medical marijuana in their strategy for treating and preventing concussions. According to a patent held by the federal government, a non-psychoactive chemical in the marijuana plant called cannabidiol (CBD) can act as an antioxidant and neuroprotectant for the brain. It's truly incredible - marijuana can help protect the brain ! How can the NFL not want to pursue the benefits of marijuana?\nWashington and other Super Bowl champs have called on the NFL to rethink their entire approach to marijuana . Medical marijuana can be useful in treating brain injuries and chronic pain, and nearly half of the league's teams are in states where medical marijuana is legal but the players can't use it. They've got it completely backwards! The NFL prohibits marijuana despite the fact that it can help treat so many problems that come along with playing the game. And despite the rules against it, Real Sports with Bryant Gumbel found that 50-60 percent of players are using marijuana -- for both medical and recreational purposes. The league doesn't benefit by suspending its players for marijuana, and the players are missing out on something that could be very helpful to their health and conditioning.\nWhile the big hits can often get some of the biggest reactions during a game, they come at a cost. Perhaps because the helmet can give a false sense of invincibility, players often lead with their head. I am sure I'm not the only person to wonder if removing helmets from the game would help reduce the number of concussions. But if the league won't consider that and if head injuries continue to plague the league, then they need to consider all possible treatments -- including medical marijuana.\nCommissioner Roger Goodell was once asked if there would ever be a time where players could use medical marijuana in states where it's legal.\nAs reported by CBS :\nInstead of saying no, Goodell offered the following, \"I don't know what's going to develop as far as the next opportunity for medicine to evolve and to help either deal with pain or help deal with injuries, but we will continue to support the evolution of medicine,\" the commissioner said, via ESPN.com .\nThe science is in, Commissioner Goodell. The NFL needs to put science ahead of politics and reform its marijuana policy accordingly. It's painfully obvious.\nDerek Rosenfeld is the manager of social media and media relations at the Drug Policy Alliance .\nThis piece first appeared on the Drug Policy Alliance blog .\nMore: NFL Traumatic Brain Injury Football Concussions Marijuana Medical Marijuana Brain Science Brain Injury Research Chronic Traumatic Encephalopathy", "external_links": ["http://www.hbo.com/real-sports-with-bryant-gumbel/episodes/0/202-episode/video/202-pot-in-the-nfl.html?autoplay=true", "http://www.drugpolicy.org/about-us/staff-and-board/staff/derek-rosenfeld-manager-social-media-and-media-relations", "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PALL&p=1&u=%2Fnetahtml%2FPTO%2Fsrchnum.htm&r=1&f=G&l=50&s1=6630507.PN.&OS=PN/6630507&RS=PN/6630507", "http://www.pbs.org/wgbh/pages/frontline/league-of-denial/", "http://mweb.cbssports.com/nfl/eye-on-football/24402661/roger-goodell-doesnt-rule-out-medical-marijuana-use-by-players", "http://www.drugpolicy.org/blog/does-marijuana-protect-or-damage-brain", "https://www.kannalife.com/advisory-board/marvin-washington/", "http://www.pbs.org/wgbh/pages/frontline/sports/concussion-watch/new-87-deceased-nfl-players-test-positive-for-brain-disease/", "http://espn.go.com/new-york/nfl/story/_/id/10260730/roger-goodell-noncommittal-future-cold-weather-super-bowls", "http://www.drugpolicy.org/blog/could-marijuana-help-prevent-rare-brain-disease-afflicting-football-players"], "published": "2015-09-22T19:52:00.000+03:00", "crawled": "2015-09-24T03:31:45.442+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}