{"organizations": [], "uuid": "88b23fd4874895d197187211aa0d1b66977842c4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_090115getty.jpg", "site_section": "http://thehill.com/blogs/e2-wire?format=feed&type=rss", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/252391-obama-calls-for-global-climate-deal-this-year", "country": "US", "title": "Obama calls for global climate deal this year", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama calls for global climate deal this year", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-01T15:39:00.000+03:00", "replies_count": 0, "uuid": "88b23fd4874895d197187211aa0d1b66977842c4"}, "author": "dhenry@thehill.com (Devin Henry)", "url": "http://thehill.com/policy/energy-environment/252391-obama-calls-for-global-climate-deal-this-year", "ord_in_thread": 0, "title": "Obama calls for global climate deal this year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama calls for global climate deal this year Getty Images By Devin Henry - 09/01/15 08:39 AM EDT \nPresident Obama issued a new call late Monday for the world’s nations to agree on a climate change treaty later this year. \nIn a speech heavy with dire descriptions of climate change and sober analysis about the scope of the problem, Obama told an Alaska audience that this “has to be the year” world leaders agree to address the issue. ADVERTISEMENT “This year, in Paris, has to be the year that the world finally reached an agreement to protect the one planet that we’ve got, while we still can,” Obama said at a meeting of Arctic Circle nations in Anchorage. \nObama has long been a booster of the United Nations's Paris climate talks, a December summit where officials will look to agree on a way to cut greenhouse gas emissions. \nThe summit is one of the last opportunities for Obama to secure a broad global climate agreement before the end of his term. \nThe United States has committed to reducing emissions 26 to 28 percent from 2005 levels before 2025. Last year, China, the world’s top polluter, agreed to reduce its emissions as well. \nBut less than 60 countries, representing only about three-fifths of the world's emissions, have submitted emissions goals. Climate officials around the world have said early progress on the treaty is creeping along, and they’ve warned the talks could still fail, like they did at a climate conference in Copenhagen in 2009. \nOn Monday, Obama said that’s not an option. \n“On this issue, of all issues, there is such a thing as being too late. That moment is almost upon us,” he said. \n“It will not be easy. There are hard questions to answer. I am not trying to suggest that there are not going to be difficult transitions that we all have to make. But if we unite our highest aspirations, if we make our best efforts to protect this planet for future generations, we can solve this problem.” \nObama arrived in Anchorage on Monday to kick off a three-day tour of Alaska, a trip the White House has said is focused on climate change and its impacts on the Arctic region. \nOn Tuesday, the White House announced a series of steps to adjust to climate change there, including proposing a new icebreaker for the Coast Guard. \nThe United States has three icebreakers in its fleet, but only two are fully functional. Russia, by comparison, has 40 icebreakers, and Alaska Gov. Bill Walker (I) told reporters on Air Force One on Monday that the U.S. needs to get another one soon. \nThe White House said Tuesday that it will propose getting a new heavy icebreaker between 2020 and 2022 and begin planning construction for other new icebreakers as well. \nThe administration also announced a new mapping and charting effort to help deal with increased traffic in the seas off Alaska’s northern coast. It will also look to expand its observation of marine ecosystems in the Arctic region. \n“Over the course of the coming days, I intend to speak more about the particular challenges facing Alaska and the United States as an Arctic power, and I intend to announce new measures to address them,” Obama said during his Monday night speech. \nRead more from The Hill:", "external_links": [], "published": "2015-09-01T15:39:00.000+03:00", "crawled": "2015-09-02T10:45:11.350+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}