{"organizations": [], "uuid": "878b3afc90b94956fa9c2281fa1b81693bf16d2d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d799f614000077002e3ad7.jpeg?cache=2vHTOiW2Dk", "site_section": "http://www.huffingtonpost.com//feeds/verticals/politics/index.xml", "section_title": "Politics - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/immigration-activists-renew-focus-on-local-battles-after-national-disappointments_55d79539e4b04ae49703532e", "country": "US", "title": "Immigration Activists Renew Focus On Local Battles After National Disappointments", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Immigration Activists Renew Focus On Local Battles After National Disappointments", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-22T01:24:00.000+03:00", "replies_count": 0, "uuid": "878b3afc90b94956fa9c2281fa1b81693bf16d2d"}, "author": "Elise Foley", "url": "http://www.huffingtonpost.com/entry/immigration-activists-renew-focus-on-local-battles-after-national-disappointments_55d79539e4b04ae49703532e", "ord_in_thread": 0, "title": "Immigration Activists Renew Focus On Local Battles After National Disappointments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration Activists Renew Focus On Local Battles After National Disappointments \"We're ready to fight.\" Elise Foley Immigration & Politics Reporter, The Huffington Post Posted: 08/21/2015 06:24 PM EDT ASSOCIATED PRESS \nWASHINGTON -- The immigration reform movement has had a disheartening year. \nActivists succeeded in persuading President Barack Obama to expand deportation relief to millions of undocumented immigrants, but a judge stalled the policy. Deportations have slowed, but not stopped. And after activists helped convince more than 300 jurisdictions in recent years to limit cooperation between police and Immigration and Customs Enforcement, an outcry against those so-called \"sanctuary cities\" threatens to halt that progress. \nIn response, advocates with United We Dream and Immigrant Legal Resource Center are circulating a toolkit to groups around the country that support immigrant rights with advice for how to fight collaboration between ICE and local police, which they say is putting their communities at risk. \nTheir plan came after a phone call in June, when activists lamented that they were still losing community members to deportation. \n\"We knew that we were stuck, so we're like, we have to go out there and organize,\" Carolina Canizales, an organizer with the youth-led advocacy group United We Dream. \"We have to go back to local organizing.\" \nThe toolkit is part of a renewed focus on organizing at the city, county and state level, which has never stopped but drew less attention while immigrant rights groups pressed for immigration reform in Congress and deportation relief from the president. Local policies matter greatly for undocumented immigrants who fear a minor arrest might lead to deportation, or that their police are de facto immigration enforcement. \nActivists helped take down the Secure Communities program, under which ICE received fingerprints from local police arrests and asked them to hold suspected deportable immigrants. A number of jurisdictions decided to stop respecting ICE hold requests in recent years based on concerns that working with ICE could damage relationships with the immigrant community. Others quit because of a ruling that holding someone solely for immigration purposes was unconstitutional without a warrant. \nHomeland Security Secretary Jeh Johnson announced last November that the Secure Communities program would be phased out, and replaced with the Priorities Enforcement Program, often referred to as PEP. Immigration officials said the PEP program would rely more on asking local police to notify ICE before releasing undocumented immigrants. \nFederal authorities are now meeting with local law enforcement leaders and officials to convince them to cooperate with PEP. Johnson said in July that of 49 priority jurisdictions, leaders from 33 had agreed to participate in PEP, 11 had not decided and five had said no. \nThe pressure goes beyond DHS and ICE. So-called sanctuary cities became a flashpoint after the fatal shooting of 32-year-old Kathryn Steinle in San Francisco last month, allegedly at the hands of an undocumented immigrant who had been deported five times. The House of Representatives voted last month to block federal law enforcement grants from so-called sanctuary cities. \nImmigration advocates feel the event, which they consider a tragedy, has led to more demonizing of undocumented immigrants. They say participating in PEP would exacerbate the problem. \n\"The knee-jerk reaction is more immigration enforcement, more deportations, more detentions,\" said Angie Junck, an attorney with Immigrant Legal Resource Center. \nShe said that PEP has too many similarities to Secure Communities -- advocates have begun calling it PEP-Comm in a nod to its predecessor. ICE still gets fingerprints under the program to detect undocumented immigrants, and can still request that they be held, she noted. But if police pick up people of color disproportionately, this could unfairly put some immigrants at risk of deportation, Junck said. \n\"PEP is basically just a pipeline from this unjust criminal justice system into an immigration system that denies people the most basic due process protections,\" she said. \"To have that link when there's already issues of due process in one system and to funnel them into another -- it's going to have a disparate impact on communities of color, and in particular we're talking about immigrants.\" \nThe toolkit advises that immigration advocates talk to local officials about how police collaboration with ICE creates fear in their communities, and that they spread the word about their concerns with PEP. It also offers support for local efforts from United We Dream and Immigrant Legal Resource Center. \n\"We're ready to fight, we've been ready to fight,\" Canizales said. \"We're no longer going to be defined by a court decision. We're no longer going to be defined by a policy.\"", "external_links": [], "published": "2015-08-22T01:24:00.000+03:00", "crawled": "2015-08-22T01:55:50.670+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}