{"organizations": [], "uuid": "98ae919cd25256586fa3869e5faa6d4ad96cc2b4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/tim-profeta/the-climate-post-obama-ta_b_8085348.html", "country": "US", "title": "The Climate Post: Obama Talks Climate, Oil Drilling | Tim Profeta", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "The Climate Post: Obama Talks Climate, Oil Drilling | Tim Profeta", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-04T00:25:00.000+03:00", "replies_count": 1, "uuid": "589f377f020334190fd7e836f44a7e13a9fab83d"}, "author": "Tim Profeta", "url": "http://www.huffingtonpost.com/tim-profeta/the-climate-post-obama-ta_b_8085348.html#post-0", "ord_in_thread": 0, "title": "The Climate Post: Obama Talks Climate, Oil Drilling | Tim Profeta", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Barack Obama arrived in Alaska this week, sharing blunt language about climate change after laying out initiatives aimed at tackling that issue in the Arctic.\n\"On this issue -- of all issues -- there is such a thing as being too late,\" said Obama . \"And that moment is almost upon us ... This year in Paris has to be the year that the world finally acts to protect the one planet that we have while we still can.\"\nOn the three-day Alaska trip , Obama is experiencing firsthand the impacts of rapidly melting Arctic ice, which is warming waters that affect local fishing economies and raising sea levels, threatening the state's coastal villages. To help address some of these local issues, Obama announced new initiatives . One is fish and wildlife cooperation management to help rebuild Chinook salmon stocks. Another is an exchange program that brings urban and rural youth together to understand the challenges of a changing Arctic and the potential for local solutions against the impacts of climate change.\nDespite this focus on climate, Obama is receiving criticism for granting Royal Dutch Shell permits to drill for oil off Alaska's coast. In an op-ed, Greenpeace Executive Director Annie Leonard writes \"we commend the president for his leadership, and yet this trip comes on the heels of his administration's decision to allow Royal Dutch Shell to drill for oil in the Arctic Ocean, a move that seriously undermines his climate legacy.\"\nObama addressed these criticisms last weekend.\n\"I know there are Americans who are concerned about oil companies drilling in environmentally sensitive waters,\" said Obama . \"Some are also concerned with my administration's decision to approve Shell's application to drill a well off the Alaskan coast, using leases they purchased before I took office. That's precisely why my administration has worked to make sure that our oil explorations conducted under these leases is done at the highest standards possible, with requirements specifically tailored to the risks of drilling off Alaska.\"\nThe Chukchi and Beaufort seas could hold as much as 26 billion barrels of recoverable oil, according to the U.S. Geological Survey. The fact remains, said Shell President Marvin Odum that oil will continue to be needed as the United States transitions to renewable energy sources.\nSea Level Rise Accelerating as Ice Sheets Melt\nThe impacts of sea level rise could be greater than worst-case scenarios . The reason? The dominant climate models don't fully account for the accelerated loss of ice sheets and glaciers, a phenomenon highlighted by scientists from the National Aeronautics and Space Administration (NASA) last week.\nRecent data on the speed and scope of melting ice sheets in Greenland and parts of Antarctica suggest that global average sea level rise may approach or exceed 1 meter, or 3.3 feet, by 2100 .\n\"The ice sheets are contributing to sea level rise sooner and greater than anticipated ,\" said Eric Rignot, glaciologist at the University of California-Irvine and NASA's Jet Propulsion Laboratory. \"Right now, the contribution is about one third. We know that in future warming (melting ice sheets) will dominate sea level rise. With future warming we may have multiples of 6 meters, or 18 feet, and higher. It may be a half meter per century or several meters per century, we don't know. We've never seen an ice sheet collapse before.\"\nRignot drew attention to the dynamic behavior of the Jakobshavn glacier in Greenland, which recently lost a chunk of ice roughly 12 square kilometers in surface area and which could raise sea level by half a meter if it were to melt entirely.\nNASA is beginning a three-year effort, Oceans Melting Greenland, to understand the role of ocean currents and ocean temperatures in melting Greenland's ice from below -- and therefore to better predict the speed at which that melting will raise sea level.\nAlso of concern: Antarctica, which has a great deal of total ice to lose. The West Antarctica ice sheet may be undergoing a marine instability as warm water reaches the base of its glaciers from below.\n\"Given what we know now about how the ocean expands as it warms and how ice sheets and glaciers are adding water to the seas, it's pretty certain we are locked into at least 3 feet of sea level rise, and probably more,\" said Steve Nerem of the University of Colorado, Boulder. \"But we don't know whether it will happen within a century or somewhat longer.\"\nData collected by NASA satellites , which change position in relation to one another as Earth's water and ice realign and change gravity's pull, reveal that the ocean's mass is increasing, translating to a global sea level rise of about 0.07 inches per year, but that rise is not uniform.\nA visualization released by NASA illustrates the variation in sea level rise around the world. Although the sea level has fallen slightly along the U.S. west coast due to a cycle known as the Pacific Decadal Oscillation (PDO), NASA warns that sea level rise could increase on that coast because the PDO recently shifted into a warm phase.\nDelegates Divided Ahead of Paris Climate Conference\nThis week, delegates met in Bonn, Germany, to take steps to create a workable draft for a deal slated to be negotiated at the Conference of the Parties November 30 to December 11 in Paris that would commit all nations to reducing greenhouse gas emissions. The hope is that the agreement will show just how much pollution will be cut and exactly how much money rich nations will offer poorer countries to deal with their own growing energy and climate adaptation needs. Opinions on how to get to this agreement, which would take effect in 2020, differ.\nOne particularly sticky point : how to divide responsibility for carbon cuts between rich and poor nations. In an interview with Politico , Robert Orr, a longtime climate advisor to U.N. Secretary-General Ban Ki-Moon, identified the outstanding issues.\n\"The overall question of ambition, just how ambitious an agreement this will be,\" said Orr . \"Everyone agrees we need to get ourselves on a pathway to 2 degrees Celsius temperature rise or less. This level of ambition will require changes in everyone's economies, everyone's fuel mixes, everyone's infrastructure investments. So, agreeing on a level of ambition in as much specificity as possible is critical to a successful deal. The issue of financing: All of this has to be paid for.\"\nThe Climate Post offers a rundown of the week in climate and energy news. It is produced each Thursday by Duke University's Nicholas Institute for Environmental Policy Solutions .\nFollow Tim Profeta on Twitter: www.twitter.com/NichInstitute\nMore: Energy Climate Change Environment Arctic Gas & Oil Arctic Drilling Barack Obama Rising Sea Level Alaska", "external_links": ["http://www.vox.com/2015/9/2/9248593/shell-arctic-drilling-obama", "http://www.wired.com/2015/09/obama-alaska-climate-change/", "http://www.ktva.com/president-obama-to-announce-arctic-initiatives-551/", "http://nicholasinstitute.duke.edu/", "http://www.bloomberg.com/politics/articles/2015-09-01/obama-says-climate-changing-faster-than-efforts-to-address-it", "http://www.youtube.com/watch?v=GTBWjDUkTzI", "http://www.space.com/30379-nasa-sea-level-rise-model-video.html", "http://www.washingtonpost.com/news/energy-environment/wp/2015/08/19/one-of-the-worlds-fastest-melting-glaciers-may-have-just-lost-its-biggest-chunk-of-ice-ever/", "http://www.livescience.com/51990-sea-level-rise-unknowns.html", "http://www.sciencerecorder.com/news/2015/08/27/global-sea-level-rise-poses-looming-threat-nasa-says/", "http://mashable.com/2015/08/27/global-sea-level-rise-mapped/", "http://www.nasa.gov/press-release/nasa-science-zeros-in-on-ocean-rise-how-much-how-soon", "http://www.npr.org/sections/itsallpolitics/2015/08/31/436476489/obama-focuses-on-native-issues-climate-change-as-he-starts-alaska-visit", "http://www.nasa.gov/feature/goddard/warming-seas-and-melting-ice-sheets", "http://www.usatoday.com/story/news/politics/2015/08/31/obama-s-almost-too-late-stop-climate-change/71496264/", "http://www.reuters.com/article/2015/08/31/us-climatechange-summit-talks-idUSKCN0R01HT20150831", "http://www.business-standard.com/article/economy-policy/un-climate-talks-in-bonn-from-aug-31-sept-4-115083000836_1.html", "http://www.dailypress.com/news/science/dp-nws-sea-level-nasa-20150827-story.html", "http://thehill.com/policy/energy-environment/252242-greens-obama-climate-legacy-at-risk-over-arctic-drilling", "http://news.yahoo.com/cash-crunch-paris-conference-un-climate-chief-091503244.html", "https://www.ncdc.noaa.gov/teleconnections/pdo/", "http://www.politico.com/agenda/story/2015/08/the-debrief-whats-happening-in-bonn-right-now-000216", "http://www.latimes.com/science/la-me-0827-oceans-rising-20150827-story.html", "http://news.discovery.com/earth/global-warming/greenland-melting-prompts-nasa-fears-of-coastal-flooding-150826.htm", "http://www.theguardian.com/us-news/2015/sep/02/barack-obama-climate-change-strategy-arctic-alaska", "http://www.washingtonpost.com/news/energy-environment/wp/2015/08/20/scientists-are-still-trying-to-figure-out-how-fast-we-could-lose-west-antarctica/", "http://www.alaskajournal.com/Alaska-Journal-of-Commerce/September-Issue-1-2015/Shell-on-Arctic-drilling-Oil-will-be-required-for-a-long-time/", "http://climatepost.org/", "http://www.usatoday.com/story/opinion/2015/09/01/obama-arctic-shell-greenpeace-editorials-debates/71534848/", "http://www.nydailynews.com/news/politics/obama-heads-alaska-tout-climate-change-initiatives-article-1.2342966", "http://www.twitter.com/NichInstitute", "https://www.whitehouse.gov/the-press-office/2015/08/31/fact-sheet-president-obama-announce-new-steps-enhance-administration"], "published": "2015-09-04T00:25:00.000+03:00", "crawled": "2015-09-07T07:39:15.189+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}