{"organizations": [], "uuid": "dbc22f4700bd57347b84a2930e029504c179416c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3286304/images/o-ABORTION-STILL-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/healthy-living/blog.xml", "section_title": "Healthy Living Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/thecut/the-big-secret-of-abortion_b_7967878.html", "country": "US", "title": "The Big Secret of Abortion: Women Already Know How It Works | The Cut", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The Big Secret of Abortion: Women Already Know How It Works | The Cut", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-11T22:37:00.000+03:00", "replies_count": 0, "uuid": "dbc22f4700bd57347b84a2930e029504c179416c"}, "author": "The Cut", "url": "http://www.huffingtonpost.com/thecut/the-big-secret-of-abortion_b_7967878.html", "ord_in_thread": 0, "title": "The Big Secret of Abortion: Women Already Know How It Works | The Cut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This post originally appeared on The Cut\nBy Rebecca Traister\nVideo still from an anti-abortion group's hidden-camera footage of the research director for Planned Parenthood Gulf Coast in Houston, Texas.\n\"I gave birth to two premature kids,\" said California's Barbara Boxer on the Senate floor last week, during the debate over cutting federal funds to Planned Parenthood . Boxer sounded impatient, irritated. \"I just don't like lectures by men about what it's like.\"\nHer comment came in response to the furious fight that has erupted over the undercover videos , made by an anti-abortion outfit calling itself the Center for Medical Progress, purporting to show that Planned Parenthood is profiting illegally from the sale of aborted fetal tissue to medical-research companies. So far, the heavily edited videos have offered no clear evidence of wrongdoing but have shown Planned Parenthood doctors and administrators in frank conversations about specific protocols and ethical concerns involved in the donation of fetal tissue, for which consent is obtained from the women undergoing procedures. (Fetal tissue is crucial to research into ALS, Parkinson's, sickle-cell anemia, and Alzheimer's; Senate Majority Leader Mitch McConnell was among the Republicans who voted to make its donation legal in 1993.) But the real message of the campaign is far more visceral.\nThe undercover activists, posing as tissue \"buyers,\" ask to examine trays of aborted fetuses of later gestational age, lifting severed arms and intestines to make sure the hidden camera catches them. The filmmakers engage Planned Parenthood employees in clinical exchanges about little lungs and thymus glands, about crushed organs and tiny bones. The aim is to shock viewers with the physicians' callous attitudes toward disembodied fetal parts and to expose the blood-and-guts nature of their work. The campaign, masterminded by 26-year-old anti-abortion crusader and \"proud millennial\" David Daleiden, is meant to let us in on the fact that abortion is disgusting.\nWhen asked, in an interview with the National Review, what one question he would ask Planned Parenthood president Cecile Richards, Daleiden replied, \"I would ask her if she knows abortion the way Planned Parenthood providers know abortion.\" Proud millennial David Daleiden wants to make sure that 57-year-old Cecile Richards, who has given birth to three children and publicly discussed her own abortion, really understands what abortion is.\nDaleiden is enacting a very old strategy, akin to standing outside a clinic with a sign informing women that their unborn babies have fingerprints at nine weeks' gestation. This approach has taken on new life in recent years, as improving ultrasound technology has offered an ever-sharper view of fetal development, leading those in both the anti-abortion and the reproductive-rights movements to argue that a public, moral, and rhetorical reckoning with the carnal implications of abortion is necessary.\nThe videos are likely to have an impact: not on public opinion about abortion, which rarely changes meaningfully, but perhaps\non Planned Parenthood's funding, and almost certainly on laws made by state legislatures in the parts of America where abortion has already become so inaccessible -- thanks to elaborate facility requirements, waiting periods, parental-consent-and-notification laws, earlier gestational cutoffs, and a dwindling number of providers -- that it might as well be illegal.\nBut as a broader strategy, the notion that educating women in the grotesqueries of termination will be a game-changer is absurd. As Richards could tell Daleiden if he asked her his question, women already know what abortion is. We know more about blood, innards, fetuses, and the babies they may become -- in short, about life in reproductive bodies -- than anti-abortion activists seem to understand.\nThe average age of menarche in the United States is 12; the average age of menopause, 51. During the intervening decades, most women bleed regularly, and if you think we emit that chlorinated blue water in the maxi-pad ads, you are incorrect. I was in high school the first time a friend joked about a \"period chunk.\" I was also in high school when I first heard that an acquaintance had had a grapefruit-size dermoid cyst removed from an ovary; as is not uncommon with those cysts, it contained teeth, hair, and skin.\nThe act of controlling or preventing pregnancy for a heterosexually active woman is filled with corporeal maneuvering. It can entail the daily, timed consumption of pills; implantation of a subdermal device; the obsessive monitoring of temperature and vaginal secretions; fiddling in unseen recesses with caps and diaphragms. Even the in-vogue set-it-and-forget-it IUD is not always as easy as it seems. Getting mine involved a snapped wire, retrieval, reinsertion, and the manual dilation of my cervix, which was the most exquisitely terrible pain of my life -- and I am the veteran of three uterine surgeries, two of which resulted in babies and one in the removal of 20 fibroid tumors from my uterine wall.\nWomen do not need real talk about bodies; our adult days brim with the effluvia, the discomforts, the weirdness and emotional intensity and magnitude of our medical choices. Then there is pregnancy itself, wanted or not, and its attendant risks. Women pass early pregnancies into toilet bowls and sadly collect the remains of later ones in Tupperware containers to bring to their doctors. Most of us know of someone who has suffered the excruciating pain of stillbirth. One friend, bleeding 13 weeks into a deeply desired pregnancy, was told by her doctor not to worry unless she passed a clot bigger than her fist.\nWomen who have been pregnant past quickening have felt the nauseating turn of a baby inside them; some have had the horror of feeling that baby stop moving, or, as Texas gubernatorial candidate Wendy Davis wrote of her experience, can feel the spasms of fetal seizure. She had a late abortion. So did California representative Jackie Speier, as she told the House in 2011 , responding to a colleague who'd read aloud a gory description of a second-trimester termination. \"I was thinking to myself, Not one of you has endured this procedure ,\" she said of her decision to speak publicly about it.\nWomen know about blood. We know about discharge. We know about babies, and many of us also love them, their little feet and hands and eyelashes. And, yes, we know that those bitty features develop while the fetus is inside us. We also know the physical, economic, and emotional costs of raising those children outside our wombs.\nSixty-one percent of women who seek abortions already have at least one child. More than a third already have at least two children. Women know what pregnancy is and what abortion does. Perhaps it's this common calculation that keeps so many women (and men) grateful to an organization dedicated to the maintenance of women's bodies. An NBC News-Wall Street Journal poll , released after the fetal-parts videos, showed Planned Parenthood with a net favorability rating of 45 percent, higher than Donald Trump, the Democratic and Republican parties, Hillary Clinton, Barack Obama, the Supreme Court, and the National Rifle Association.\nFrances Kissling, a reproductive-rights activist who worked in one of New York's first abortion clinics in the 1970s and led Catholics for a Free Choice for 25 years, has long urged the pro-choice movement to make room in its rhetoric for the moral acknowledgment of the fetus. But she has never doubted that many women already recognize it. \"When they come to the clinic,\" she said, \"they ask you, 'Is it going to hurt the fetus?' They know that what is inside of them is going to die and come out. They know it. And they have abortions.\"\nThey have always had abortions. Katha Pollitt, the author of Pro: Reclaiming Abortion Rights , pointed out that in the 19th century, the number of children per woman dropped from around seven in 1800 to four in 1900, despite the fact that there was no modern birth control. \"So how do you think that happened? It happened with abortion. Anthropologists will tell you there have been abortions for thousands of years in a very wide variety of societies.\"\nPlanned Parenthood didn't invent abortions, and David Daleiden isn't going to explain them in terms so grisly as to reverse thousands of years' of women's needs, desires, and lived experiences.\n\"Abortions are yucky,\" said Kissling. \"But after that response, there is a shrugging of the shoulders.\" After all, a lot of life is yucky.\n*This article appears in the August 10, 2015 issue of New York Magazine.\nAlso from The Cut:\nOne Model's Secret to Success: Accept Your Body\nTexas Judge: Marry Your Girlfriend or Go to Jail\nTarget Steps Into Gender-Neutral Future\nHow Diary of a Teenage Girl Refuses Easy Answers\nLeave Mariah Alone, Dammit\nALSO ON HUFFPOST:\nClose  10 Myths About Abortion That Need To Be Busted of   REALITY: Over 99.75 percent of abortions do not cause major medical problems. Less than one-quarter of 1 percent of abortions performed in the United States lead to major health complications, according to a 2014 study from the University of California, San Francisco, that tracked 55,000 women for six weeks after their abortions. The researchers note that this makes an abortion statistically about as risky as a colonoscopy. If that fact seems surprising, consider how American pop culture misrepresents the risks of abortion: Nine percent of film and television characters who have abortions die as a direct result of the procedure, according to another 2014 study from UCSF.\nREALITY: About one in five abortions are medical abortions. The Centers for Disease Control and Prevention found that 19 percent of abortions in 2011 were medical abortions and that 28.5 percent of those took place in the first nine weeks of pregnancy. The Guttmacher Institute also found that medical abortions increased substantially from 2008 to 2011, meaning more women have ended their pregnancies with this alternative to surgery.\nREALITY: Most women will not regret their decision, and are no more likely to experience mental health problems than women who carry an unplanned pregnancy to term. While many women experience mixed emotions after an abortion, 95 percent of women who have abortions ultimately feel they have made the right decision, according to an August 2013 study from UCSF. \"Experiencing negative emotions postabortion is different from believing that abortion was not the right decision,\" the researchers explained. Furthermore, while unplanned pregnancies often cause emotional stress, there is no evidence to suggest that women who choose to terminate their pregnancies will be more likely to suffer from mental health issues, according to a 2008 report from the American Psychological Association that investigated all relevant medical studies published since 1989. The APA found that past studies claiming abortion causes depression and other mental health problems consistently failed to account for other risk factors, particularly a woman's medical history. The APA accounted for these factors and found that, among women who have an unplanned pregnancy, those who have abortions are no more likely to experience mental health problems than those who carry the pregnancy to term.\nREALITY: Fetuses cannot feel pain until at least the 24th week of pregnancy. Experts ranging from Britain’s Royal College of Obstetricians and Gynaecologists to the American Congress of Obstetricians and Gynecologists agree with that timeline. In fact, research from UCSF found that fetuses can't perceive pain before 29 or 30 weeks of development. Then why have so many states banned abortions after 20 weeks of pregnancy? Perhaps misrepresentation of research is partly to blame: Many of the researchers most frequently cited by pro-life politicians told The New York Times that their research does not prove anything about fetal pain.\nREALITY: Most Americans support a woman's right to choose. According to a Gallup poll from 2014, 78 percent of Americans think abortion should be legal in some or all circumstances. (Fifty percent said \"some circumstances,\" while 28 percent said all.) What's more, in 2012, Gallup found that 61 percent of Americans think abortions that take place during the first trimester of pregnancy should be legal. (Nine out of 10 abortions in the U.S. do take place during that time period, according to Guttmacher.)\nREALITY: The abortion rate in the United States is the lowest it's been since 1973. The abortion rate has been on the decline for years, and hit its lowest level in 2011, according to the latest data available from the Guttmacher Institute. The study's author partially credited the decline to better contraceptive use and more long-term contraceptive options, such as the IUD.\nREALITY: Women face a growing number of barriers to accessing abortions. More than 57 percent of American women live in states that are hostile or extremely hostile to abortion rights, according to the Guttmacher Institute. That represents a marked increase from 2000, when 31 percent of American women lived in such states. In 2011, 89 percent of counties in America had no abortion clinics. This is no accident: Across the U.S., lawmakers have enacted 231 new abortion restrictions over the past four years, according to a Guttmacher analysis from January 2015. As a result, many women have to travel great distances to reach an abortion clinic, where they may face 24-hour wait periods. These barriers particularly affect women living in rural areas and low-income women, who often can't afford to take time off work and pay for gas and a hotel room. Other laws force women to go through potentially distressing procedures, such as viewing their own ultrasound photos, in order to move forward with an abortion.\nREALITY: Women rarely cite pressure from family or partners as leading to their decision to abort. A 2005 study from the Guttmacher Institute found that less than 1 percent of women surveyed cited such pressure among their main reasons for having an abortion. A 2013 study from UCSF reached a similar conclusion, and found that while women rarely cited partner coercion as a reason they sought an abortion, many did cite the desire to escape a bad relationship or domestic violence.\nREALITY: Most women who have abortions are already mothers. Sixty-one percent of women who had abortions in 2008 were mothers, and 34 percent had two or more children, according to the Guttmacher Institute. That number only increased after the 2009 financial downturn. The National Abortion Federation told Slate that between 2008 and 2011, 72 percent of women seeking abortions were already mothers. A study from Guttmacher found that mothers typically have abortions to protect the children they already have; they simply cannot afford to raise another child.\nREALITY: Requiring abortion clinics to meet these standards does little to improve patient safety and forces many to shut down. Currently, 22 states require abortion clinics to meet a set of restrictive and often arbitrary standards, dictating that they be close to hospitals and that their hallways and closets meet certain measurements. Clinics often need to undergo expensive renovations in order to comply, and leading doctors' groups say the laws do little to improve patient safety. What's more, 11 states now require that doctors at abortion clinics obtain admitting privileges at a nearby hospital, but many hospitals flat-out refuse to grant these privileges. As a result, hospitals essentially have the power to shut down nearby clinics.\n Share  Tweet  &#10006 Advertisement Share this &#10006 close Current Slide Follow The Cut on Twitter: www.twitter.com/TheCut\nMore: Abortion Women's Empowerment Women in Politics Women and Abortion Abortion Stigma Secret of Abortion Abortion Myth Planned Parenthood Planned Parenthood Sting Video", "external_links": ["http://nymag.com/thecut/2015/08/how-diary-of-a-teenage-girl-refuses-easy-answers.html?mid=huffpost_women-pubexchange", "http://i.huffpost.com/gadgets/slideshows/398780/slide_398780_4913794_sq50.jpg", "http://www.twitter.com/TheCut", "http://i.huffpost.com/gadgets/slideshows/398780/slide_398780_4913796_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/398780/slide_398780_4913790_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/398780/slide_398780_4913784_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/398780/slide_398780_4913780_sq50.jpg", "http://nymag.com/thecut/2015/08/marry-your-girlfriend-or-go-to-jail.html?mid=huffpost_women-pubexchange", "http://www.amazon.com/exec/obidos/ASIN/0312620543", "http://i.huffpost.com/gadgets/slideshows/398780/slide_398780_4913782_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/398780/slide_398780_4913788_sq50.jpg", "http://www.nbcnews.com/meet-the-press/how-public-views-planned-parenthood-nra-n403451", "http://nymag.com/thecut/2015/07/new-video-blasts-planned-parenthood.html", "http://nymag.com/thecut/2015/08/gop-loses-preps-for-war-over-planned-parenthood.html", "http://i.huffpost.com/gadgets/slideshows/398780/slide_398780_4913792_sq50.jpg", "http://nymag.com/thecut/2015/07/one-models-secret-to-success-accept-your-body.html?mid=huffpost_women-pubexchange", "http://i.huffpost.com/gadgets/slideshows/398780/slide_398780_4913786_sq50.jpg", "http://nymag.com/daily/intelligencer/2011/02/congresswoman_talks_about_her.html", "http://nymag.com/author/Rebecca%20Traister/", "http://www.amazon.com/exec/obidos/ASIN/039917057X", "http://nymag.com/thecut/2015/07/luckiest-woman-alive-was-touched-by-a-rihanna.html?mid=huffpost_women-pubexchange", "http://www.nationalreview.com/article/421808/planned-parenthood-body-parts-daleiden", "http://i.huffpost.com/gadgets/slideshows/398780/slide_398780_4913798_sq50.jpg", "http://nymag.com/thecut/2015/08/leave-mariah-alone-dammit.html?mid=huffpost_women-pubexchange", "http://nymag.com/thecut/2015/08/the-big-secret-of-abortion.html?mid=huffpost_women-pubexchange"], "published": "2015-08-11T22:37:00.000+03:00", "crawled": "2015-08-11T22:04:33.625+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}