{"organizations": [], "uuid": "0b4c3f36394204ca1aebe9cac6b81e0d5ca62de4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/arnold-steinberg/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/arnold-steinberg/the-un-speech-president-o_b_8216286.html", "country": "US", "title": "The U.N. Speech President Obama Did Not Give | Arnold Steinberg", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The U.N. Speech President Obama Did Not Give | Arnold Steinberg", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-29T23:36:00.000+03:00", "replies_count": 0, "uuid": "0b4c3f36394204ca1aebe9cac6b81e0d5ca62de4"}, "author": "Arnold Steinberg", "url": "http://www.huffingtonpost.com/arnold-steinberg/the-un-speech-president-o_b_8216286.html", "ord_in_thread": 0, "title": "The U.N. Speech President Obama Did Not Give | Arnold Steinberg", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yesterday President Barack Obama bored the United Nations General Assembly with a speech he could have skipped. He claimed the U.N. imposes costs on aggressors to help prevent a third world war and that an imperfect U.N. \"has underwritten unparalleled advances in human liberty.\" How we wish all this were true. He spoke, as if a spectator, in a detached way about \"the collapse of strongmen and fragile states breeding conflict\" creating an \"epic\" refugee problem, and that \"brutal networks of terror have stepped into the vacuum.\" He implicitly criticized Vladimir Putin for supporting Syria's Bashar al-Assad \"who drops barrel bombs to massacre innocent children.\"\nObama launched an attack on Donald Trump, without naming him, as he criticized movements that oppose trade agreements and call \"for the building of walls to keep out immigrants.\" And not to leave Ben Carson out, he warned of attacks against those who \"worship God different Obama declared, \"The United States is not immune from this.\"\nObama's defines mythology as reality. He told his audience that \"our debates\" in the United States are defined by \"an Islam that is incompatible with peace.\" And he then created a straw man argument that his opponents want the U.S. to pursue 'bellicose words and shows of military force\" over diplomacy. Then he boasted: \"I lead the strongest military that the world has ever known.\" He blamed the outcome in Iraq on the refusal of the U.S. to work with other nations.\nObama praised the U.N. sanctions for paving the way for the Iran deal, supported by Russia and China. He then criticized Russia for its annexation of Crimea and \"further aggression in eastern Ukraine,\" and China for threatening freedom of navigation in the South China Sea. H e faulted the US for not improving the lives of the Cuban people and boasted of reestablishing relations with Cuba.\nFor good measure, he also bragged about the disastrous U.S. intervention in Libya.\nFinally, Obama noted that ISIS \"emerged out of the chaos of Iraq and Syria\" and said that while Muslims should reject \"intolerance,\" that we need \"a rejection by non-Muslims of the ignorance that equates Islam with terror.\" That was an applause line. He then proceeded to criticize abuse of women and girls and end with a ringing defense of democracy.\nWe remember his apology tour, confessing America's sins, that defined his retreat abroad. Now, fifteen months before the end of his administration, it's time for a different kind of apology.\nHere's the U.N. Speech Obama Should Have Given\nMr. Secretary General and fellow delegates: It's time for honesty.\nYou claim to care about humanity, but U.N. peacekeepers have been involved in numerous large-scale abuses of children, making them into sex slaves. No wonder, since some of the peacekeepers are from your countries that condone men raping boys.\nThe United Nations has some worthwhile programs, such as feeding the hungry. But we could use private agencies and avoid the politics of the U.N. bureaucracy. You do a poor job of helping worldwide refugees resettle, because you instead prioritize the corrupt thugs who oversee the third generation of seemingly permanent \"Palestinian refugees\" who are refused resettlement by prosperous Arab countries which today will not accept Muslim refugees from Syria. I call upon the U.N. to ask prosperous Gulf nations to accept their Muslim brothers and sisters who would have an easier transition there than in the West.\nWhen it comes to promoting human liberty, this organization is a farce. Many of you in this room represent despotic regimes that are run by gangsters who steal from their own people who they imprison and kill. For decades, the U.N. Human Rights Council has included nations which routinely violate...human rights.\nYou are a bunch of hypocrites.\nIndeed, the U.N. was founded on a lie. A permanent member of the powerful Security Council was the Soviet Union, a violent regime that murdered tens of millions of its own citizens until it disintegrated, largely in response to President Ronald Reagan's confrontation. Had I been president in the 1980s, what Reagan called the \"evil empire\" would still be here.\nReagan had core values. I do not. He studied Friedrich Hayek, the intellectual giant who explained collectivism, that is, the subordination of the individual to government: the corporate state and fascism, socialism and communism. I am a socialist hostile to a vibrant free economy. I have more in common with most of you than with my countrymen.\nReagan believed in American exceptionalism, I do not. Michael Oren, Israel's former Ambassador to the United States, could not understand why I wanted to lead a country I do not especially admire or like. He was puzzled that I apologized for a nation that has unselfishly done so much for the world. Today, I am apologizing for me.\nActually, I have a lot to apologize for. But you're going to hear from Mr. Putin, so let me be brief. First, I cannot blame Putin for Syria. Just as I did not support the protestors in Iran, I would not support freedom fighters in Syria. And with hubris I stupidly drew a red line that Assad crossed with his use of chemical weapons, and then my bumbling Secretary of State John Kerry said we would do a \"pin-prick\" strike, so naturally Congress would not support military intervention to accomplish nothing, except save my pride.\nSo, I left a void that Putin is filling, and now he and mass-murderer Assad, along with the Islamo-fascists who run Iran, are the leaders in the fight against ISIS which itself arose from a void I created in Iraq, when I ignored my top military advisers and withdrew all forces. Then I ignored my intelligence briefings about ISIS and minimized its threat. Since I've abrogated U.S. leadership of the Free World, perhaps Donald Trump is right: let Assad's military and ISIS kill each other off.\nBen Carson, the renowned neurosurgeon who once stood up to me at a prayer breakfast, recently said, \"I would not advocate that we put a Muslim in charge of our nation.\" No other candidate would so advocate, yet they condemn Mr. Carson. Our constitution has no religious test for office but we also support freedom of speech, even for a Republican like Mr. Carson. More Americans voted against Mr. Romney because he is a Mormon than against me because I am half-black. All of you should know our founders embodied Judeo-Christian beliefs in our Declaration of Independence and the U.S. Constitution. I have pretended otherwise. Contrary to my repeated assertions, Muslims had no significant role in our founding or in our nation's history.\nMany Muslims are wonderful and patriotic citizens who have assimilated in the American tradition, and they are welcome in America and equal under the law. This is unlike many of your countries, where certain ethnic minorities and Christians and Jews are persecuted second-class citizens, or not citizens at all. But you need to understand that Mr. Carson speaks for many Americans, because the Islamists believe in a theocracy, and Sharia law is at odds with a pluralistic America. Vladimir Putin has it right when he says, \"If minorities prefer Sharia Law, then we advise them to go to those places where that's the state law... We will not grant them special privileges, or try to change our laws to fit their desires, no matter how loud they yell 'discrimination.'\"\nThe U.S. had good intentions in Iraq, but that nation - like many of the countries represented by you here - was not democratic and not yet ready for democracy. Saddam Hussein was even more of a monster than the ruthless men who rule over various U.N. member-nations. Thanks to the surge that I opposed, I inherited an Iraq moving toward stability, but I abandoned that nation. I apologize for the human misery I caused there and in Syria. The entire region is in disarray, in large part due to my policies and Hillary Clinton.\nLet me explain that I did not seek the constitutionally required U.S. Senate ratification of the agreement with Iran because I claimed it was not a treaty. You'll be happy to know I came first to the U.N. to do an end-up around the U.S. Congress. Take heart, I put you guys above the legislative branch of the U.S. government. The American people opposed this phony deal by more than 2-to-1. It will destabilize the Mideast, lead to a new Hezbollah war against Israel, and accelerate a conventional and nuclear arms race. Israel cannot risk annihilation, and when they act to survive, you no doubt will condemn them.\nI apologize to all of you for this deal - this travesty, and also for supporting extremists like the Muslim Brotherhood in Egypt and abandoning moderate Arabs. My mixed signals have emboldened the bad guys and confused the good guys. How ironic that Egyptian President Abdel el-Sisi challenges Muslims to condemn Islamist terrorists and I'm so politically correct that I cannot define the enemy. What an embarrassment I am.\nAnd I am deeply sorry for our stupid policy in overthrowing Moammar Gadhafi in Libya and ending up worse. And our government and Secretary of State Hillary Clinton acted disgracefully in abandoning Ambassador Chris Stevens to his death. You as diplomats can especially appreciate that awful fate.\nA couple of quick points. Cuba has been a cancer in the Western hemisphere. At a time when the reign of the Castro brothers is coming to an end, I decided to let the people of Cuba know that we stand not with them, but with their oppressors. This is, of course, the same message that I telegraphed to the people of Iran. Perhaps my successor will reverse my substantial cutbacks of U.S. air, navy and overall military power, and our slashed budget for military research and development. Because without America power, the world will be left to the predators, and some of you ingrates whom we have helped before, you may fall by the wayside.\nMost of all, I apologize to the American people for following in a bipartisan tradition of providing extraordinary funding for this organization, which has done nothing - condemnation, sanctions, whatever -- to stop the Russians in Crimea or Ukraine, or the Chinese in the South China Sea, just as it didn't stop the Soviets in Hungary in 1956 or Czechoslovakia in 1968, or so many dozens of other aggressions. The bulk of U.N. resolutions over the last half-century is obsessive condemnation of Israel, while U.N. money and facilities were used by PLO and Hamas terrorists. As long as the Palestinian schools teach Jew-hatred and genocide, UN funding and US funding should be ended.\nMore: United Nations", "external_links": [], "published": "2015-09-29T23:36:00.000+03:00", "crawled": "2015-09-29T23:31:56.834+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}