{"organizations": [], "uuid": "a8a102ee41206a8e9a12c044d857c54ac2604354", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_putinvladimir_090513getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/255121-mccain-slams-obama-putin-meeting-plans", "country": "US", "title": "McCain slams Obama-Putin meeting plans", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McCain slams Obama-Putin meeting plans", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-28T16:55:00.000+03:00", "replies_count": 0, "uuid": "a8a102ee41206a8e9a12c044d857c54ac2604354"}, "author": "rkheel@thehill.com (Rebecca Kheel)", "url": "http://thehill.com/policy/defense/255121-mccain-slams-obama-putin-meeting-plans", "ord_in_thread": 0, "title": "McCain slams Obama-Putin meeting plans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McCain slams Obama-Putin meeting plans Getty Images By Rebecca Kheel - 09/28/15 09:55 AM EDT \nSen. John McCain (R-Ariz.) is criticizing President Obama for meeting with Vladimir Putin, saying it gives the Russian leader exactly what he wants. \n“President Obama's decision to meet with Vladimir Putin is as misguided as it is unnecessary,” McCain said in a written statement Monday. “It plays right into Putin's hands by breaking his international isolation, undermining U.S. policy and legitimizing Putin's destabilizing behavior — from dismembering Ukraine to propping up Bashar Assad in Syria.” ADVERTISEMENT Obama and Putin plan to meet Monday in New York City at the United Nations General Assembly.\nThe Obama administration has said Putin requested Monday’s meeting, while the Kremlin has said it was the White House’s idea. \nIt will be their first meeting in more than a year. The United States cut off communication with Russia after Russia’s military intervention in Ukraine. \nTensions between the United States and Russia have continued to mount as Putin sends military equipment and advisors to Syria. Russia has said the military aid is meant to help in the fight against the Islamic States in Iraq and Syria (ISIS). \nIn his statement, McCain said lowering the conflict with Russia over military operations in Syria does not require a meeting between the two heads of state. \n“Any number of our military commanders could do that,” he said. \nIt’s also clear, McCain said, that Putin’s true intentions are to prop up Syrian President Bashar Assad. He criticized the White House for expessing \"confusion\" about Putin's intentions. \n“If that is actually true, then the United States is in even worse trouble than many fear because it is not at all hard to discern what Putin wants,\" he said. \n“In fact, from Russia's military build-up in Syria, to its recently announced military and intelligence coalition with Syria, Iran and Iraq, Putin's ambitions are blindingly obvious: He wants to prop up Assad, play kingmaker in any transition, undermine U.S. policy and operations, and ultimately expand Russian power in the Middle East to a degree unseen for the past four decades. None of this requires President Obama to meet with Putin. That will only make matters worse.” \nWith the meeting in place, McCain said Obama should make it clear the United States continues to oppose Russia’s actions in Ukraine; the United States will not fight along Russia and Assad; and Russian aid to Assad will only lengthen the conflict in Syria. \n“Ultimately, the proper response to Russia's actions in Ukraine, the Middle East and elsewhere is not a tete-a-tete with Putin,” McCain said. “It is a foreign policy that recognizes that peace requires U.S. strength and leadership, and a strategy to further our interests and values. That may be beyond the ability of President Obama, but it cannot happen soon enough.” Tags:", "external_links": [], "published": "2015-09-28T16:55:00.000+03:00", "crawled": "2015-09-29T22:34:36.199+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}