{"organizations": [], "uuid": "0a295e063e140fd41bb7bdb46fa20bd31d5291cf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3282010/images/o-US-MEXICO-FENCE-JUAREZ-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/christian-ramirez/obama-administration-must_2_b_7979870.html", "country": "US", "title": "Obama Administration Must Take Action Against Rampant Racial Profiling, Rights Violations Near U.S. Borders | Christian Ramirez", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Must Take Action Against Rampant Racial Profiling, Rights Violations Near U.S. Borders | Christian Ramirez", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-13T18:52:00.000+03:00", "replies_count": 0, "uuid": "0a295e063e140fd41bb7bdb46fa20bd31d5291cf"}, "author": "Christian Ramirez", "url": "http://www.huffingtonpost.com/christian-ramirez/obama-administration-must_2_b_7979870.html", "ord_in_thread": 0, "title": "Obama Administration Must Take Action Against Rampant Racial Profiling, Rights Violations Near U.S. Borders | Christian Ramirez", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As immigration issues grab headlines across the nation, congressional leaders on both sides of the aisle resort to knee jerk reactions calling for wasteful, military-style tactics along the southern border, reflecting the deep misunderstanding that Capitol Hill has of border communities.\nThese efforts fail to address glaring systemic problems within the nation's largest law enforcement agency, Customs and Border Protection (CBP), and fail to offer solutions that will move us forward together.\nUnchecked abuse and corruption within CBP must be part of any discussion regarding the US southern border and the time has come to talk about reforming the agency. The Obama administration has the means to move us forward and should do so immediately.\nEarlier this summer, the administration released a report calling for significant reforms to CBP to prevent widespread corruption and expand much-needed oversight. CBP has come under increased scrutiny as a nationwide debate continues around law enforcement's relationship to communities, especially communities of color.\nFor years, CBP has failed to hold its officers accountable when they use excessive force and kill unarmed civilians . The agency fails to document and report racial inequities in who its officers stop and search , and fails to detect and deter counterproductive racial profiling that undermines values of fairness and equality. These excesses infringe daily on the rights and dignity of border communities and their residents , who go about their daily lives up to 100 miles away from the physical border yet experience CBP permanent checkpoints and patrols in their neighborhoods. For example, a recent report based on more than 50 complaints in New Mexico and Texas discovered abuses such as racial profiling, unjustified searches and detentions, physical and verbal abuse, intimidation, and interfering with emergency medical treatment. Ninety percent of people reporting these abuses were U.S citizens and 81 percent were Latino.\nThese incidents are not isolated. An investigation by Politico Magazine found that \"between 2005 and 2012, nearly one CBP officer was arrested for misconduct every single day;\" that CBP rapidly recruited agents without proper vetting or supervision, making systemic misconduct highly likely; and that, by 2014, the number one criminal priority of the FBI's McAllen, Texas office was investigating Border Patrol agents.\nA review of over 800 complaints provided by CBP's Office of Internal Affairs reveals that CBP failed to hold officers accountable in 97 percent of the cases in which Internal Affairs completed an investigation. Almost 80 percent of the total complaints are based on physical abuse or excessive force. The rest are based on abuses including misconduct, mistreatment, racial profiling, improper searches, inappropriate touching during strip searches, or sexual abuse. In May, the former Chief of Internal Affairs, James Tomsheck, came forth as a whistleblower , saying that he witnessed a \"spike\" of more than 35 sexual misconduct cases between 2012 and 2014 and an agency culture that ignored and swept away corruption. A lawsuit brought by mothers and children seeking asylum last summer alleged that CBP officers applied coercion to dissuade them from getting an attorney and asserting their legal rights, in violation of domestic and international law.\nThe Obama administration's recommendations to increase internal review and revise use of force guidelines are steps in the right direction. However, reforms to CBP must reflect the systemic nature of misconduct, civil rights abuses and excessive force by officers, and the structural need for accountability, due process, and human rights. The administration should implement these deeper reforms through a number of changes .\nThe White House should direct the Department of Homeland Security (DHS) to prohibit the use of racial profiling. CBP should document racial and other inequities in who officers stop, question, and search and publicly share that data. It should also train its officers on Fourth Amendment protections against illegal searches and seizures, on prohibitions against racial profiling, and on implicit bias.\nCBP should scale back military-type tactics and equip its officers who interact with the public with body-worn cameras paired with privacy protections. CBP should also reduce its zone of operations from 100 to 25 miles from the actual border, and determine in which areas an even shorter distance is reasonable.\nDHS should establish an independent Border Oversight Task Force that includes border communities and has subpoena power over government officials so it can investigate and hold accountable abusive officers. It should also mandate greater oversight in order to end inhumane detention conditions; physical, sexual, or verbal abuse; and inadequate access to medical care. These are just the first steps of many that should be taken.\nThe Obama administration has stated its willingness to reverse the worst and most inhumane excesses of immigration enforcement and established the President's Task Force on 21st Century Policing to improve the relationship between police and communities. However, the situation at the border and the experiences of the tens of millions of residents who call the region home show a dire need for action. In its last year and a half in office, the Obama Administration should move aggressively toward accountability, due process and human rights.\nFollow Christian Ramirez on Twitter: www.twitter.com/ramirezusmex\nMore: Immigration Immigration Reform Border Patrol Police Brutality Obama Administration Department of Homeland Security Racial Profiling", "external_links": ["http://americanimmigrationcouncil.org/sites/default/files/M.S.P.C.%20v.%20Johnson.pdf", "http://soboco.org/border-patrol-brutality-since-2010/", "http://www.americanimmigrationcouncil.org/sites/default/files/No%20Action%20Taken_Final.pdf", "https://www.aclu-nm.org/wp-content/uploads/2015/05/ACLU-NM-GuiltyUntilProvenInnocentFinal5-15-2015-21.pdf", "http://soboco.org/wp-content/uploads/2014/05/Kerlikowske-CBP-reforms-sign-on-FINAL-w-signatures.pdf", "http://www.cbsnews.com/news/u-s-border-patrol-has-a-sex-abuse-problem-says-whistleblower/", "http://opportunityagenda.org/files/field_file/2015.6.16-supporting-border-communities.pdf", "http://soboco.org/promise-of-reforms-by-cbp-commissioner-ring-hollow/", "http://www.dhs.gov/sites/default/files/publications/DHS-HSAC-CBP-IAP-Interim-Report.pdf", "http://www.politico.com/magazine/story/2014/10/border-patrol-the-green-monster-112220.html#.VcvLNSxViko", "http://www.cops.usdoj.gov/pdf/taskforce/TaskForce_FinalReport.pdf", "http://www.twitter.com/ramirezusmex"], "published": "2015-08-13T18:52:00.000+03:00", "crawled": "2015-08-13T19:06:45.901+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}