{"organizations": [], "uuid": "9d35ebd9609940c745da3ab62af88c8c2b75fddd", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://www.foxnews.com/search-results/urss?q=Trillion%20dollars", "section_title": "RSS for climate change march", "url": "http://latino.foxnews.com/latino/news/2015/08/03/obama-says-climate-change-danger-to-future-generations-national-security/", "country": "US", "title": "Obama says climate change a danger to future generations, national security", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama says climate change a danger to future generations, national security", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-03T07:00:00.000+03:00", "replies_count": 0, "uuid": "9d35ebd9609940c745da3ab62af88c8c2b75fddd"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/08/03/obama-says-climate-change-danger-to-future-generations-national-security/", "ord_in_thread": 0, "title": "Obama says climate change a danger to future generations, national security", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama says climate change a danger to future generations, national security Published August 03, 2015 EFE \nU.S. President Barack Obama said Monday that there is no greater threat to future generations than climate change, which also threatens America's national security, as he presented his plan to reduce   at the country's electric power plants. \nThe president also noted in his speech that, according to the Pentagon, the effects of climate change are already putting U.S. national security at risk. \nThe Clean Energy Plan presented Monday by Obama calls for the United States to reduce   at power plants by 32 percent by the year 2030. \nIn his speech, the president recalled that electric power plants produce some 40 percent of the total carbon pollution in the country, and said that his plan is \"the single most important step America has ever taken in the fight against global climate change.\" \nObama also said that the federal government will give states \"the time and flexibility they need\" to comply with the new regulations established by the Environmental Protection Agency, or EPA. \n\"We only get one home. We only get one planet. There's no Plan B,\" Obama said, while admitting that no country can do enough by itself to halt global warming. \nFor that reason, this Clean Energy Plan complements the general goal of the United Nations to which the U.S. has committed itself with a view to the world conference on climate change to be held in Paris next December. \nThat goal, formalized last March, calls on the United States to reduce by 2025 its greenhouse gas emissions - all of them, not just those from electric power plants - by between 26 and 28 percent compared with 2005. \nObama also said Monday that, as Pope Francis made clear in his encyclical on climate change, the fight against this global problem is \"a moral obligation.\" \nThe fight against climate change has become a priority of the Obama presidency, while some Republican politicos remain skeptical about its effects and even about the existence of global warming. \nSeveral of those Republicans, including some presidential hopefuls, along with the coal industry and part of the business community, say that the new EPA regulations for power plants will destroy thousands of jobs and will make energy costs much more expensive. EFE", "external_links": [], "published": "2015-08-03T07:00:00.000+03:00", "crawled": "2015-08-04T18:02:58.267+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}