{"organizations": [], "uuid": "7f5f66136c6d3f52933b0a6d59e174807ba7a358", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaun_092715getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/255244-obama-iranian-foreign-minister-shake-hands-at-un", "country": "US", "title": "Obama, Iranian foreign minister shake hands at UN", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama, Iranian foreign minister shake hands at UN", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-29T15:37:00.000+03:00", "replies_count": 0, "uuid": "7f5f66136c6d3f52933b0a6d59e174807ba7a358"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/international/255244-obama-iranian-foreign-minister-shake-hands-at-un", "ord_in_thread": 0, "title": "Obama, Iranian foreign minister shake hands at UN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama, Iranian foreign minister shake hands at UN Getty Images By Jordan Fabian - 09/29/15 08:37 AM EDT \nPresident Obama shook hands with Iranian Foreign Minister Mohammad Javad Zarif on Monday at the United Nations General Assembly, according to an administration official. ADVERTISEMENT The handshake was the highest-level encounter between U.S. and Iranian officials in three decades. It capped off the landmark nuclear deal reached in July that some administration officials hope will reduce tensions with Tehran.\nAn administration official described the handshake as \"brief\" and said it occurred during a luncheon for world leaders at the United Nations headquarters in New York. The official said it was a chance encounter and not pre-planned. \nSpeculation was rampant before the summit that Obama would meet with Iranian President Hassan Rouhani, but U.S. officials said no meeting was planned and Rouhani cut his trip short to return to Tehran Monday. Will cut NY trip short & leave for Tehran tomorrow after #UNGA speech to receive bodies from the tragic #MinaStampede pic.twitter.com/2DGDel3Fpw — Hassan Rouhani (@HassanRouhani) September 28, 2015 \nThe U.S. and Iran have not had formal diplomatic relations since its 1979 Islamic revolution. But contact between the two sides has increased in recent years in pursuit of a nuclear deal. \nObama spoke on the phone with Rouhani after his election in 2013, and Zarif was Tehran's chief nuclear negotiator, spending months in talks with Secretary of State John Kerry and other top diplomats. \nIn his speech, Obama praised the nuclear deal as an example of how diplomacy, and not war, can be used to accomplish foreign policy goals, but he also chastised Iran for fueling instability in the Middle East through funding terrorist groups and fighting proxy wars in places such as Yemen and Syria. \n\"Chanting 'Death to America' does not create jobs or make Iran more secure,\" Obama said. \"If Iran chose a different path, that would be good for the security of the region, good for the Iranian people and good for the world.\" \nRouhani hailed the nuclear agreement as the beginning of a \"new era\" for peace in the region, but he also blamed the U.S. intervention in the Middle East for the rise of terrorist violence. \n\"If we did not have the U.S. military invasion of Afghanistan and Iraq and the United States's unwarranted support for the inhumane actions of the Zionist regime against the oppressed nation of Palestine, today the terrorists would not have an excuse for the justification of the crime,\" he said. Tags:", "external_links": [], "published": "2015-09-29T15:37:00.000+03:00", "crawled": "2015-09-29T23:28:05.768+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}