{"organizations": [], "uuid": "01d23d3d04c51c405b3c616bd341e7c9cc5cd85b", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/09/03/WE01236072/3678060/Movieon9215at237PMmov-3678060_lg.jpg", "site_section": "http://rss.ireport.com/feeds/latest.rss", "section_title": "CNN iReport - Latest", "url": "http://ireport.cnn.com/docs/DOC-1268303?ref=feeds%2Flatest", "country": "US", "title": "Mr. President Barack Hussein Obama round up the usual suspects! Book em Dano Hawaii Five 0", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Mr. President Barack Hussein Obama round up the usual suspects! Book em Dano Hawaii Five 0", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-03T21:43:00.000+03:00", "replies_count": 0, "uuid": "01d23d3d04c51c405b3c616bd341e7c9cc5cd85b"}, "author": "Sabahqueen12", "url": "http://ireport.cnn.com/docs/DOC-1268303?ref=feeds%2Flatest", "ord_in_thread": 0, "title": "Mr. President Barack Hussein Obama round up the usual suspects! Book em Dano Hawaii Five 0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mr. President Barack Hussein Obama round up the usual suspects! Book em Dano Hawaii Five 0 By Sabahqueen12 | Posted 25 minutes ago | Honolulu, Hawaii \nI, Scarlett McMastes address our holiness Pope Francis, I, Scarlett McMasters baptized into the Catholic faith, my Catholic Christian name is Elizabeth, I am the niece of former Canon of the Church of England, Samuel Vanculin, son of my grandmother's aunty Susie Mossman of Honolulu. Presidential Candidate Jeb Bush, God Bless you! Thank you for you deepest consideration campaign for presidency of the USA. Obviously, excellent leadership Obama and his administration are not. Mr. Obama and his gang are Chicago style hoodlum politicians. Scarlett McMasters in a letter to Germany's Chancellor Angela Merkel calling for the incarceration of Mr. President Barack Hussein Obama by the government of France enabling Interpol to assist nations and world leaders to secure peace to the nations of the world. Scarlett McMasters of Hawaii, USA born citizen, uncovered Mr. President Barack Hussein Obama's wicked plan to genocide, massacre, kings of the world and their royal heirs included in Obama's land Middle Eastern royal houses and all royal households included European monarchs. Dear Prime Minister of Germany, Chanceller, Mrs. Angela Merkel, My heartfelt thanks to your great job governing Germany, It is in the best interests of the world I write to you admonishing you to stand in my behalf and separate from Mr. President Barack Hussein Obama because of his crimes against world citizens and against humanity. What are his crimes? He is responsible for destroying USA strength world wide 1) Dismantling and undermining the integrity of the U.S. Constitution 2) Financial ruin of the USA 3) Disabling USA security world wide 4) League with Iran demonstrates his alliance with wicked powers that intend to destroy the West which Germany, U.K. France, India etc. represent. 5) Immigration policies enable the enemy combatants of the USA suspect to bring the nuclear device intent upon hurting innocent US citizens. I seek your assistance and all world powers on the side of the West that Mr. President Obama be condemned at the International Court of the Hague, Netherlands magistrates his peers, world leaders, presidents, kings, and princes and that he be incarcerated by Interpol. I humbly seek your assistance as a collaborator with France to enable Interpol to arrest Mr. President Barack Hussein Obama imminently with discretion. My sincere wish is that West be righted security provided to the nations of the West be established and strong once more. I am a humble USA citizen but, I do care deeply for all world citizens. In sum, I never did understand how Mr. President Barack Obama convinced the West to disassociate from Mr. Netanyahu and the nation of Israel propelling them in murky death defying security issues. Let us stand strong again as world community and defend Israel and Mr. Netanyahu as we should in the first place. Sincerely,", "external_links": [], "published": "2015-09-03T21:43:00.000+03:00", "crawled": "2015-09-03T22:10:04.095+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}