{"organizations": [], "uuid": "1be91d9362ab01f3daf438b48934e5a1557a007b", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/education/255359-obama-administration-deserves-an-f-for-its-new-college", "country": "US", "title": "Obama administration deserves an ‘F’ for its new college scorecard system", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama administration deserves an ‘F’ for its new college scorecard system", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-30T14:30:00.000+03:00", "replies_count": 0, "uuid": "1be91d9362ab01f3daf438b48934e5a1557a007b"}, "author": "Michael McGrady and Justin Haskins", "url": "http://thehill.com/blogs/congress-blog/education/255359-obama-administration-deserves-an-f-for-its-new-college", "ord_in_thread": 0, "title": "Obama administration deserves an ‘F’ for its new college scorecard system", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 30, 2015, 07:30 am Obama administration deserves an ‘F’ for its new college scorecard system By Michael McGrady and Justin Haskins \nA highly publicized part of President Barack Obama’s new education plan is the College Scorecard , which was recently revamped to include new features to help students pick a quality college. The Department of Education launched the College Scorecard two years ago as an Internet-based platform focused on giving prospective undergraduates perspective on the costs and offerings of more than 7,000 schools around the United States, but the initial version included only very basic information. The updated site provides multiple features, such as information on average salaries after graduation. \nObama packaged the release of the College Scorecard with a speech in Des Moines, Iowa earlier this month, during Secretary of Education Arne Duncan’s sixth annual “Back-to-School” tour. ADVERTISEMENT In Obama’s speech, he accused the GOP-led Congress of threatening to cut funding. In light of a possible government shutdown (again), Obama wants Senate and House Republicans to ratify a budget by September 30. If they don’t, Obama has signaled he will lay the blame for forcing cuts in federal funding to higher education institutions at Republicans’ doorstep. \nDespite Obama’s characterization, the expansion of all educational programs under the Obama administration has created numerous problems in the education marketplace. The College Scorecard is just one of those problems, and far from the worst. \nThe College Scorecard is a great platform in theory, but the federal government is just mimicking already successful ranking and statistic systems currently in place, and it’s doing so on taxpayers’ dime. Anyone who has spent time looking into college lately has to be wondering why the Obama administration would waste so much time and money to create an ugly-cousin college evaluation system. \nPerhaps the most famous current college evaluation tool is U.S. News and World Report’s rankings of best colleges and institutions. The Princeton Review’s college search also gives prospective college data similar to the information the College Scorecard produces. \nThe Department of Education program is a wasted effort. It’s a program we know little about, except what the public information officers in the executive branch tell us, and they aren’t exactly the most trustworthy bunch. \nWe know the College Scorecard stores and utilizes data from 7,000 institutions around the country, but how does this improve higher education when there is already a huge amount of good data available? \nAdditionally, many higher education leaders have bashed the data as misleading and inconsistent , and they note the system doesn’t distinguish between the best or worst colleges. There is no stated way to see the success of institutions. It’s not clear a 17-year-old student would even know what to look for when using the database. \nOne of the presumably useful features of the College Scorecard is it estimates the median salary graduates receive after college. For example, the average salary the federal government says students graduating from the University of Colorado-Colorado Springs receive is $41,000 10 years after starting their first day of college. That is above the national average, but it pales in comparison with the nearby University of Colorado-Denver, whose graduates average a salary of $70,000 10 years after their first day of college . \nAsk anyone in the region, and they’ll tell you there is little difference, if any at all, between the reputations of CU-Denver and CU-Colorado Springs. The data paints a completely inaccurate picture because the cost of living is significantly higher in Denver than in most other parts of Colorado, so naturally salaries are higher. A student who attends CU-Colorado Springs and moves to Denver is probably just as likely to earn $70,000 as someone who graduates from CU-Denver. \nThis problem exists in virtually every market the scorecard covers, making universities across the country that are renowned for educational quality look worse than they actually are. CU-Colorado Springs is a “Best in the West” college, according to U.S. News and World Report , ranking 10th among Regional Universities of the West. Its engineering and business programs are also among the nation’s best, according to an official http://communique.uccs.edu/?p=19629 press release , which cited U.S. News as its source. \nWhen you provide data without a comprehensive ranking that takes into account simple and important variables, such as cost of living, you put quality schools, many of which are very affordable, at a great disadvantage compared to urban private schools. \nThis project is reminiscent of the many other education programs the Obama administration has created: it’s useless, redundant, and likely harmful. \nMcGrady is studying political science and criminal justice at the University of Colorado–Colorado Springs and has previously worked for the U.S. Department of Defense. Haskins ( Jhaskins@heartland.org ) is editor of The Heartland Institute, a conservative and libertarian think tank.", "external_links": [], "published": "2015-09-30T14:30:00.000+03:00", "crawled": "2015-09-30T15:58:02.402+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}