{"organizations": [], "uuid": "a10dcbeba80da6abb15d3d394569455ae5c73f8c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/scalefit_1200_noupscale/55fdcb9620000026002429c5.jpeg?cache=mylZxWeoTK", "site_section": "http://www.huffingtonpost.com//feeds/verticals/politics/index.xml", "section_title": "Politics - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/mike-huckabee-eric-fanning_55fdcaece4b00310edf75455", "country": "US", "title": "Huckabee: Obama Nominated Openly Gay Army Head To 'Appease Homosexuals'", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Huckabee: Obama Nominated Openly Gay Army Head To 'Appease Homosexuals'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-20T00:46:00.000+03:00", "replies_count": 0, "uuid": "a10dcbeba80da6abb15d3d394569455ae5c73f8c"}, "author": "Sam Levine", "url": "http://www.huffingtonpost.com/entry/mike-huckabee-eric-fanning_55fdcaece4b00310edf75455", "ord_in_thread": 0, "title": "Huckabee: Obama Nominated Openly Gay Army Head To 'Appease Homosexuals'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Huckabee: Obama Nominated Openly Gay Army Head To 'Appease Homosexuals' Nominee Eric Fanning is obviously qualified for the role. Sam Levine Associate Politics Editor, The Huffington Post Posted: 09/19/2015 05:46 PM EDT | Edited: 23 minutes ago \nFormer Arkansas Gov. Mike Huckabee (R) on Saturday said the nomination of the openly gay Eric Fanning as the secretary of the U.S. Army was an attempt by the president to \"appease\" gay Americans and accused him of using the military for social experiments. \n\"It's clear President Obama is more interested in appeasing America's homosexuals than honoring America's heroes. Veterans suicide is out-of-control and military readiness is dangerously low,\" Huckabee, who is running for president, said in a statement. \"Yet Obama is so obsessed with pandering to liberal interest groups he's nominated an openly gay civilian to run the Army. Homosexuality is not a job qualification. The U.S. military is designed to keep American safe and complete combat missions, not conduct social experiments.\" \nHuckabee has also used the \"social experiment\" line to refer to the idea of trans people serving openly in the military. \nFanning, who currently serves as acting undersecretary of the Army and chief management officer, has deep experience in the military. Before his current position, he served in several high level roles, including special assistant to Defense Secretary Ash Carter and undersecretary of the Air Force. \nWhile Huckabee may be deeply concerned about Fanning's appointment, the Army doesn't really seem to be. Defense Secretary Ash Carter called him “one of our country’s most knowledgeable, dedicated, and experienced public servants.” \nPhil Carter, a veteran of the war in Iraq and senior fellow at the Center for a New American Security, also said Fanning's appointment wouldn't be controversial in the Army. \n“My sense is that the Army is over this and has been over it for some time,” he told The Washington Post . “The Army cares whether you can shoot straight, not whether you are straight.” \nMeanwhile, LGBT advocacy groups hailed the positive impact that Fanning's nomination would have on servicemembers. Fanning would be the first openly gay secretary of one of the military branches if confirmed by the Senate. \n\"Considering the tremendous struggles that LGBT Americans have faced within the Department of Defense, Fanning’s nomination is deeply significant,\" Chad Griffin, president of the Human Rights Campaign, told The Huffington Post. \"This is a sign of hope and a demonstration of continued progress towards fairness and equality in our nation’s armed forces.\" \nAlso on HuffPost: Celebrities Who Have Come Out As LGBT of", "external_links": [], "published": "2015-09-20T00:46:00.000+03:00", "crawled": "2015-09-20T01:19:18.259+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}