{"organizations": [], "uuid": "fc362fdf70a090b8397a65acc863ca94224b1cbe", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3379074/images/o-IRAN-DEAL-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/quora/president-obama-on-the-ir_b_8120196.html", "country": "US", "title": "President Obama on the Iran Nuclear Deal: \"There Is Not a Single Part of This Deal That Depends on Trust.\" | Quora", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 20, "title_full": "President Obama on the Iran Nuclear Deal: \"There Is Not a Single Part of This Deal That Depends on Trust.\" | Quora", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-11T20:33:00.000+03:00", "replies_count": 21, "uuid": "025751828c99b68196fa26767dfe3bb53ef2efaa"}, "author": "Quora", "url": "http://www.huffingtonpost.com/quora/president-obama-on-the-ir_b_8120196.html#post-0", "ord_in_thread": 0, "title": "President Obama on the Iran Nuclear Deal: \"There Is Not a Single Part of This Deal That Depends on Trust.\" | Quora", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Can Iran's leaders be trusted? originally appeared on Quora : The best answer to any question .\nAnswer by Barack Obama , 44th President of the United States, on Quora :\nWhat U.S. policymakers have been clear about for decades — both Democrats and Republicans alike — is that there are few greater threats to our global security than a nuclear-armed Iran. That is why the U.S. and our international partners spent nearly two years working out the best possible diplomatic solution to eliminate that threat. However, throughout our negotiations with Iran, we've remained clear-eyed about the Iranian regime. Whether it's supporting terrorist groups like Hezbollah, continued threats directed at Israel, human rights abuses, or the unjust detention of American citizens, I understand exactly the kind of dangerous and repressive regime we're dealing with in Iran.\nSo let me be clear: This agreement is not based on trust. It's based exclusively on unprecedented verification. Never before has a nuclear non-proliferation agreement included such a robust and far-reaching monitoring and transparency regime. Under this agreement, Iran is prohibited from ever pursuing a nuclear weapon — and we will be in the strongest position ever to make sure that Iran follows through.\nUnder this deal, international inspectors from the International Atomic Energy Agency (IAEA) will be continuously monitoring every part of Iran's entire nuclear program. That means if Iran tries to secretly divert any fissile material to try and build a weapon, the IAEA and the world will know. And, if Iran should try to stand up a covert nuclear program, IAEA inspectors can have access and inspect any site they deem suspicious. If there is a suspicious site in Iran, international inspectors can and will have eyes on it.\nUnder this deal, Iran will also have to significantly reduce the fissile material and technology it needs to build a weapon. Iran must reduce its stockpile of enriched uranium by 98%. It must reduce the number of centrifuges in operation from roughly 20,000 to under 6,000. Iran will also have to reconfigure its Arak reactor so it will not produce weapons-grade plutonium.\nSo there is not a single part of this deal that depends on trust. You can read about the verification plan in the deal for yourself here . When you do, you will see how the deal's unprecedented measures are set up to ensure -- and verify -- that Iran cannot obtain a nuclear weapon.\nThis question originally appeared on Quora. Ask a question, get a great answer. Learn from experts and access insider knowledge. You can follow Quora on Twitter , Facebook , and Google . More questions: Iran Nuclear Deal : What is it about the Iran nuclear deal that keeps them from getting nuclear weapons? Iran : Why are so many American politicians angling for a war with Iran? Iran Nuclear Deal : Would a rejection of the Iran nuclear deal by Congress be a vote for war? Follow Quora on Twitter: www.twitter.com/Quora\nMore: Iran Nuclear Deal Iran Iran Deal Barack Obama Obama Iran Obama Iran Deal", "external_links": ["https://twitter.com/Quora", "https://www.quora.com/Would-a-rejection-of-the-Iran-nuclear-deal-by-Congress-be-a-vote-for-war?ref=huffpo&rel_pos=2", "https://www.quora.com/Iran-Nuclear-Deal-July-2015", "https://www.quora.com/What-is-it-about-the-Iran-nuclear-deal-that-keeps-them-from-getting-nuclear-weapons?ref=huffpo&rel_pos=1", "https://www.facebook.com/quora", "https://www.quora.com/Iran", "https://plus.google.com/111127313006403749982/posts", "http://www.twitter.com/Quora", "https://www.quora.com/Barack-Obama", "https://www.quora.com/Can-Irans-leaders-be-trusted", "https://www.quora.com/Why-are-so-many-American-politicians-angling-for-a-war-with-Iran?ref=huffpo&rel_pos=3", "https://www.quora.com/Can-Irans-leaders-be-trusted/answer/Barack-Obama", "https://medium.com/the-iran-deal/joint-comprehensive-plan-of-action-5cdd9b320fd"], "published": "2015-09-11T20:33:00.000+03:00", "crawled": "2015-09-11T21:04:24.928+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}