{"organizations": [], "uuid": "d0d1d0972c49360e8f785543be3427028b621404", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/secretservice_092214gn_0.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/255318-obama-praises-secret-service-after-visits-from-pope-world-leaders", "country": "US", "title": "Obama praises Secret Service after visits from pope, world leaders", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama praises Secret Service after visits from pope, world leaders", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-29T22:21:00.000+03:00", "replies_count": 0, "uuid": "d0d1d0972c49360e8f785543be3427028b621404"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/255318-obama-praises-secret-service-after-visits-from-pope-world-leaders", "ord_in_thread": 0, "title": "Obama praises Secret Service after visits from pope, world leaders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama praises Secret Service after visits from pope, world leaders Greg Nash By Jordan Fabian - 09/29/15 03:21 PM EDT \nPresident Obama heaped praise on the Secret Service on Tuesday for “flawlessly” managing security during a busy week that included presidential meetings with dozens of foreign leaders. \nObama made a rare statement to reporters on the South Lawn, thanking the agency for its work, upon his return from the United Nations in New York. \n“The Secret Service had to manage the pope’s visit, President Xi’s visit, and a hundred something world leaders in an unprecedented fashion during the course of the last several days. And they did so flawlessly,” Obama said. ADVERTISEMENT The president said he wanted to give positive attention to the embattled agency, whose reputation was marred by multiple security lapses in the past year.\n“As you know I don’t often come here to the pen after I get off but I wanted to make a special commendation of our Secret Service,” he said. “When something goes wrong, when there’s a fence jumper, everybody reports on it.” \nThe Secret Service faced a daunting task in protecting the president, foreign leaders and the public during the past week. The agency, along with the FBI and local law enforcement, provided security for Pope Francis during his six-day tour, which spanned three cities. \nOne day after the pontiff departed Washington, Chinese President Xi Jinping made a high-profile state visit to the White House. Obama spent the last three days in New York for the U.N. General Assembly, which was attended by many high-profile dignitaries from around the globe. Tags:", "external_links": [], "published": "2015-09-29T22:21:00.000+03:00", "crawled": "2015-09-29T22:39:23.952+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}