{"organizations": [], "uuid": "33f68cc8b2d0aacb246e82ffbc3d7e871e3abf70", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3314186/images/o-DOMINICAN-REPUBLIC-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/blog.xml", "section_title": "WorldPost Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/erika-guevara-rosas/draconian-abortion-laws-k_b_8002588.html", "country": "US", "title": "Draconian Abortion Laws Kill Women and Girls | Erika Guevara Rosas", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Draconian Abortion Laws Kill Women and Girls | Erika Guevara Rosas", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-18T14:05:00.000+03:00", "replies_count": 0, "uuid": "33f68cc8b2d0aacb246e82ffbc3d7e871e3abf70"}, "author": "Erika Guevara Rosas", "url": "http://www.huffingtonpost.com/erika-guevara-rosas/draconian-abortion-laws-k_b_8002588.html", "ord_in_thread": 0, "title": "Draconian Abortion Laws Kill Women and Girls | Erika Guevara Rosas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The story is so horrific it defies any logic.\nIn July 2012, 16-year-old Rosaura Almonte, known by the media as Esperancita was admitted to hospital in Santo Domingo, the Dominican Republic's capital. Once there, she was diagnosed with leukemia and told she required urgent life-saving medical treatment.\nBut there was a problem. Esperancita was seven weeks pregnant at the time and the chemotherapy she needed would affect the fetus she was carrying.\nBecause abortion was penalized by law in the Dominican Republic, doctors took 20 days to decide what to do before giving Esperancita the treatment she desperately needed and had a right to.\nBut 20 days proved to be too long and, on 17 August 2012, the young girl died from hypovolemic shock, becoming another victim of cruel laws that impede sound and prompt medical judgment. Such laws prioritize personal ideology over human rights.\nThe tragic case sparked fierce debate in the Dominican Republic. In November 2014 the country's president, Danilo Medina, approved new legislation that allows abortion in cases of rape, incest, a fetus with a fatal impairment or when a woman or girl's life is in danger.\nNo one knows whether Esperancita would have survived had she received treatment as soon as the cancer was discovered, or if her life might have been prolonged. What is certain, however, is that there was no reason for her to be forced to endure 20 days of pain, uncertainty and fear, while politicians, doctors and commentators debated, in essence, about whether she should live or die. What is clear is that a discriminatory law tied the hands of medical professionals and that the law denied Esperancita the right to have accessed life-saving or prolonging medical treatment, in accordance with her wishes.\nDespite the new law that better protects women and girls' human rights having been passed, it's not even certain that there won't be more cases like Esperancita's. The fate of Dominican women and girls continues to hang in the balance after religious groups challenged President Medina's reform in the Courts. The country's Constitutional Court is expected to settle decision the matter. It is imperative that the upcoming decision upholds human rights and the dignity of women and girls in the Dominican Republic.\nDespite the trend towards reforming laws in line with their human rights obligations to protect women and girls' human rights, some countries, including Paraguay, El Salvador and Ireland , maintain draconian and discriminatory laws that still ban abortion in virtually all circumstances. Such laws treat women and girls as mere child-bearing vessels instead of human beings entitled to basic rights, and can have fatal consequences.\nIn Paraguay, children who are pregnant as a result of being raped are being forced to carry their pregnancies to term, despite the severe risks to their physical and mental health and life. The UN experts on torture have urged Paraguay to amend their laws to allow access to safe and legal abortion services in cases of rape, because of the pain and suffering inflicted on women and girls when they are denied their human rights to access such services.\n\"Mainumby,\" a Paraguayan girl who was 10 years old when she became pregnant after being raped, allegedly by her stepfather, suffered the consequences of this human rights scandal. Mainumby's case shocked the world as Paraguay's authorities repeatedly ignored pleas to allow the girl access to an abortion rather than continue with a high risk pregnancy the result of repeated sexual violence.\nAnalysis by the World Health Organization shows that the risk of maternal death is four times higher among adolescents younger than 16 than among women in their twenties. Other physical and mental health problems are also significantly higher among young girls who have early and unwanted pregnancies.\nIn El Salvador, many women who were unwilling or simply tragically unable to carry a pregnancy to term are currently languishing behind bars, accused of having had an abortion.\nBut the Americas is not alone. There are other countries around the world who play medical Russian roulette with women and girls' lives and health, causing them to suffer physically and mentally, or even die, completely unnecessarily.\nAmnesty International has recently published a report looking at Ireland's draconian anti-abortion laws, one of the harshest in Europe.\nIreland only allows women and girls access to abortion if their life is at risk. In all other cases, even if the pregnancy was a result of rape or incest or in cases of fatal fetal impairment, abortion is a crime punishable by up to 14 years in prison.\nIn 2012 Savita Halappanavar, an Indian dentist living in Ireland, died from a septic shock days after she was denied an abortion after she started to miscarry her pregnancy. Sadly, a practice that women interviewed by Amnesty International had also experienced since her death. Her tragic death sparked national and international outcry and charged discussions about Ireland's abortion laws. This heated debate is still under way, following changes to formally allow abortions when the mother's life is at risk.\nIn practice, burdensome requirements make it hard to get an abortion even if their life is at risk. And this law does not go far enough, women should at a minimum have access to an abortion when their life or health is at risk and if the pregnancy is the result of rape or incest, or in cases of severe and fatal fetal impairment.\nThe list of names of the women and girls around the world who fall victim to draconian abortion laws would be too long to print.\nBut, there is a glimmer of hope. Like the Dominican Republic, other countries are slowly starting to question this injustice and taking steps to decriminalize abortion in favor of women and girls' human rights to health, to be free from cruel and inhuman treatment and other torture, as well as their right to life.\nEarlier this year, Chilean President Michelle Bachelet championed a draft bill into Congress that would end the total ban on abortion and guarantee access to safe abortion in cases where the life of the pregnant woman or girl is at risk, where the fetus is not viable or where the pregnancy is the result of rape. Congress is debating this bill now.\nIt is now time for other governments with cruel and discriminatory laws to follow suit. This may not be an easy discussion but the world cannot afford to look the other way. Women and girls are dying and suffering as the debate goes on.\nFollow Erika Guevara Rosas on Twitter: www.twitter.com/ErikaGuevaraR\nMore: Human Rights Women Abortion", "external_links": ["http://www.twitter.com/ErikaGuevaraR"], "published": "2015-08-18T14:05:00.000+03:00", "crawled": "2015-08-18T18:24:04.635+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}