{"organizations": [], "uuid": "a1e0f836b7769abda611fd1880c58c1c97d4a560", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/comedy/blog.xml", "section_title": "Comedy Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/stacia-friedman/trumps-immigration-jackpo_b_7999738.html", "country": "US", "title": "Trump's Immigration Jackpot | Stacia Friedman", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Trump's Immigration Jackpot | Stacia Friedman", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-19T00:18:00.000+03:00", "replies_count": 0, "uuid": "a1e0f836b7769abda611fd1880c58c1c97d4a560"}, "author": "Stacia Friedman", "url": "http://www.huffingtonpost.com/stacia-friedman/trumps-immigration-jackpo_b_7999738.html", "ord_in_thread": 0, "title": "Trump's Immigration Jackpot | Stacia Friedman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After weeks of speculation, Donald Trump finally revealed the details of his proposed border wall . \"There won't be any barbed wire or concrete,\" said Trump. \"I'll use 2,000 miles of slot machines.\"\n\"How will that stop immigrants from crossing the border?\" asked This Reporter.\n\"You kidding? People will put their last nickel in a slot machine and the Mexican Government will pay for it,\" Trump announced at the Iowa State Fair.\n\"Okay, but how will that prevent new immigrants from coming into the country or encourage illegal immigrants who are already here to leave?\"\n\"That's the beauty of it,\" said Trump, taking a bite out of a deep fried hog-on-a-stick. \"There will be no INS raids or police. They will come of their own free will by the millions. I'll fly them in for free and give them coupons for an all-you-can-eat buffet. Have you ever seen a 2,000-foot-long taco?\"\n\"But once all these immigrants are amassed at the border, how do you get them to leave?\" asked This Reporter.\n\"I am going to make a deal with the Mexican government they can't refuse,\" said Trump. \"For every illegal immigrant they take back, I will give them a Donald Trump hat.\"\n\"A hat? Why would the Mexican government want a million Trump hats?\" asked This Reporter.\n\"Because the people of Mexico love me. I am HUGE there,\" said Trump, stepping up to a deep fried macaroni and cheese vendor. \"Mmmm. Very tasty.\"\n\"How will you decide which immigrants are worthy of citizenship?\" This Reporter asked.\n\"Aha! Glad you asked. That will be the focus of my new reality show Immigrant Apprentice! Each week, viewers will vote to decide who stays and who goes back to the pueblo,\" said Trump, moving along to deep fried banana cream pie. \"They'll get to decide who is a rapist or murderer and who has the makings of a good American citizen.\"\n\"How can you possibly win the Republican presidential nomination if you alienate the entire Hispanic population?\" asked This Reporter.\n\"Who said anything about Republicans?\" smirked Trump.\nMore: Donald Trump Immigration", "external_links": [], "published": "2015-08-19T00:18:00.000+03:00", "crawled": "2015-08-19T00:27:57.145+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}