{"organizations": [], "uuid": "a993b8cbada9507764c75c62bb460fa550a7b03b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/putin_obama092615getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/national-security/255038-putin-to-test-obama-at-un", "country": "US", "title": "Putin to test Obama at UN", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Putin to test Obama at UN", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-27T21:30:00.000+03:00", "replies_count": 0, "uuid": "a993b8cbada9507764c75c62bb460fa550a7b03b"}, "author": "mmali@thehill.com (Julian Hattem)", "url": "http://thehill.com/policy/national-security/255038-putin-to-test-obama-at-un", "ord_in_thread": 0, "title": "Putin to test Obama at UN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Putin to test Obama at UN Getty By Julian Hattem - 09/27/15 02:30 PM EDT \nPresident Obama won’t be able to escape the long shadow of Vladimir Putin when he heads to the United Nations General Assembly this week. \nRussia is in the middle of two of the biggest crises on the planet — in Syria and Ukraine — and those vexing challenges will be front and center when Obama meets with Putin Monday on the sidelines of the annual diplomatic gathering in New York. \n“When we look at conflict, the president will certainly be focused on the situation in Syria and Iraq, and he’ll be focused on the situation in Ukraine,” White House deputy national security advisor Ben Rhodes told reporters this week. ADVERTISEMENT “Our focus is going to be on the fact that there has to be a cost for a nation like Russia that is violating the sovereignty and territorial integrity of Ukraine.”\n“At the same time, in Syria, even as we have an aggressive military effort underway against ISIL, the only lasting resolution to that challenge is for there to be a political settlement, as well,” he added, using an alternate acronym for the Islamic State in Iraq and Syria (ISIS). \nThe U.S.-Russia dynamic won't be the only issue when world leaders sit down together in the coming days. \nThe release of 17 new goals for international development have the prospect of reinvigorating the globe’s efforts to combat extreme poverty, illness and inequality for the next 15 years. \nBut top military officials have called Russia the U.S.’s most dangerous foe , and the pressure will be on for Obama to successfully navigate the power struggle when the two sit down for talks. \nPutin will make his first address at the U.N. meeting in a decade on Monday, and will also head into a bilateral meeting with Obama. \nThat meeting will be the first time the two leaders have met in person since a brief reunion marking the D-Day anniversary in France last June. \nThe two nations have been locked in an increasingly bitter standoff in recent years, after Russia entered something of a diplomatic exile following its military intervention in Ukraine. \nIn 2013, the White House canceled a summit planned for Moscow, in a rare snub against the Kremlin, and it has more recently kicked Russia out of the Group of 8 nations. \nNow, Russia is in an awkward position. \nDespite being internationally ostracized over Ukraine, Moscow has made a concerted push to come out of the cold and back into the global fold. \n“Putin’s speech is an attempt to change attention and to try to win his way back into the good graces of the Western community,” said William Pomeranz, the deputy director of the Woodrow Wilson Center’s Kennan Institute for Advanced Russian Studies. \n“He wants to do so by focusing on the problem of Syria and how potentially the United States, Europe and Syria should be on the she same page vis-à-vis ISIS.” \nIn the last two weeks, Russian and U.S. military leaders have begun discussing ways to collaborate on rooting out ISIS, which has taken advantage of the political vacuum in Syria to grow its ranks. \nThere is a key difference between the two nations, however. \nRussia supports Syrian leader Bashar al-Assad, and claims that the best way to get rid of Islamic extremism is to maintain his tenuous grip on power. \nThe U.S., meanwhile, has insisted for years that Assad must go. \n“The Russian public narrative has been very focused on the argument that the way to counter ISIL is to work with the Assad regime,” said Celeste Wallander, the National Security Council’s senior director for Russia. “We think they got this backwards.” \n“This is an opportunity for the presidents to talk directly about this very key issue face-to-face and one-on-one,” she added. \nThe White House has gone to pains to indicate that Russia asked for the meeting — not the U.S. — in an apparent bid to ensure Obama has the upper hand. \nAt the same time, the U.S. needs to keep up the pressure for Russia to abide by a 2014 agreement to halt violence in Ukraine. That accord will reach critical milestones in coming weeks. \nPutin is going on a charm offensive ahead of the trip. \nIn an interview with CBS’s “60 Minutes” set to air this Sunday, the Russian leader said that he admired Americans’ “creativity” for “tackling problems.” \nIt’s “their openness — openness and open-mindedness,” Putin said, “because it allows them to unleash the inner potential of their people. \n\"And thanks to that, America has attained such amazing results in developing their country.\" \nWhile the bridges between the U.S. and Russia might not have been burned completely, however, it’s clear they have been seriously scorched. \nIt’s unlikely that the two nations walk away from Monday’s meeting with anything more than a rough outline for how to work together. \n“The fact that they’re talking is good. The fact that they’re realized they need to keep each other informed is good,” said Martin Edwards, the director of Seton Hall University’s center for U.N. and global governance studies. “But I think we need to really keep our expectations modest about this. \n“I’d love for there to be a blockbuster deal,” he continued. “We can’t look for that coming out of Russia.” Tags:", "external_links": [], "published": "2015-09-27T21:30:00.000+03:00", "crawled": "2015-09-28T03:10:53.420+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}