{"organizations": [], "uuid": "84cabbcb9fd32eff1edcfa400acc88fe3d7adc73", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/entertainment/blog.xml", "section_title": "Entertainment Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/chris-weigant/friday-talking-points_b_8023546.html", "country": "US", "title": "Friday Talking Points -- Trump's Immigration Roundup | Chris Weigant", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "Friday Talking Points -- Trump's Immigration Roundup | Chris Weigant", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-22T05:01:00.000+03:00", "replies_count": 1, "uuid": "8f85153482b34f3599a1fc151cdc0340c51d152b"}, "author": "Chris Weigant", "url": "http://www.huffingtonpost.com/chris-weigant/friday-talking-points_b_8023546.html#post-0", "ord_in_thread": 0, "title": "Friday Talking Points -- Trump's Immigration Roundup | Chris Weigant", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Another week has gone by, and Donald Trump remains the Republican frontrunner in the presidential nomination race. We've noticed that all the inside-the-Beltway pundits who so confidently predicted Trump's imminent and inevitable downfall are now slowly starting to revisit their predictions. This is making them extremely nervous, of course. Some are still finding solace in the \"Trump's going to say something any day now that will sink him like a stone\" way of thinking, but their numbers are getting smaller as time goes by and Trump defies political gravity once again.\nLast weekend, Trump released his very first policy paper. It was, naturally, on immigration (Trump's signature issue). Reduced to tweet-length, this policy could be summed up as: \"Build a big wall. Repeal birthright citizenship and 14th amendment. Round them all up and send them home.\" Of course, it was immediately popular with all of Trump's supporters.\nThe rest of the Republican presidential field, once again, was caught scrambling to respond. All of the other Republicans running for the highest office in the land routinely quake in their boots whenever Trump opens his mouth, because nobody's yet come up with any great ideas as to how to respond. Take Trump on directly? That hasn't worked out so well for the three notable candidates who have tried it (Rand Paul, Rick Perry, and Lindsey Graham), who are all polling below five percent. Agree with Trump no matter what comes out of his mouth (in the hopes of picking up all his supporters if he stumbles)? That's working pretty well for Ted Cruz, which is why Scott Walker is now giving it a try. Ignore him completely? That's what Jeb! Bush would really like to do, but again this hasn't worked out so well for him (as he watched his own poll numbers sink into single digits).\nSo far, most of the candidates have at least tentatively supported parts of Trump's immigration plan. More and more of them are just throwing up their hands and saying \"OK, let's build a giant wall, what the heck.\" This week, at least half of the Republican field has expressed support for overturning birthright citizenship, which would require an amendment to the United States Constitution (since it's expressly part of the Constitution, in the Fourteenth Amendment). This is now the default Republican position, in fact. I guess conservatives only revere certain parts of the Constitution, even though they all carry a copy around with them in their pocket, as a talisman.\nJeb! Bush once again proved he is just as clumsy at being a politician as his brother, in response to Trump. Jeb! was trying to distance himself from Trump's position on birthright citizenship, but then he royally stepped in it by using the phrase \"anchor babies.\" When called on the offensiveness of the term, Bush doubled down and tried to defend it, while he tried to channel some sort of weak-tea version of Trump taking on political correctness. \"Anchor babies,\" Bush said, is a term Democrats use, to beat up on Republicans. He didn't explain how Democrats can only do so after Republicans use the term , of course. But watching him flounder around answering all the questions must be painful for all those folks who have already tossed over $100 million into Bush's campaign chest. This is really the guy who is going to vanquish Trump? Hey, good luck with that, Establishment Republicans!\nOutside the presidential race, the rabid Republicans on the airwaves are pushing the issue even harder than Trump (hard as that is to even imagine). One radio host is essentially calling not just for repealing the Fourteenth Amendment, but also that pesky Thirteenth Amendment as well -- you know, the one that outlaws slavery. Seriously . His position is to give all undocumented immigrants a 60-day warning, and then round them up and stick them in concentration camps. They would then \"become property of the state,\" after which the state would \"start to extort or exploit or indenture\" their labor. When a caller pointed out that it \"sounds an awful lot like slavery,\" the host responded: \"Well, what's wrong with slavery?\"\nYes, this is the state of the Republican Party today, brought to you by none other than Donald Trump. Mitt Romney winning 27 percent of the Latino vote may turn out to be a high point for the party, which could put the White House out of Republicans' reach for the foreseeable future, at least until they purge this sort of nativist nonsense from their ranks. Which doesn't seem likely any time soon, of course. Things are probably going to get a lot worse before they get any better.\nIn other amusing news from the Republican campaign trail, Bobby Jindal has apparently been reduced to showing Planned Parenthood videos to crowds on his lawn (no, really), and Marco Rubio hit a kid in the face with a football (which was, of course, caught on camera for everyone's amusement).\nWe're going to skip over the Democratic campaign trail news for the moment, because we are going to address it all in the awards sections.\nPresident Obama is spending his summer whipping (and counting) congressional votes for his Iran nuclear deal. When Congress returns from their excessive six-week summer vacation, they'll be voting whether to disapprove the deal or not. If they put such a disapproval on Obama's desk, he'll need to defeat a veto override in at least one house of Congress for the deal to go through. Most Washington wonks think he'll be able to clear this bar, but there is even one interesting possibility few have yet noticed: Obama may not even have to veto anything , because Republicans may not be able to pass it in the Senate. There are currently 54 Republicans in the Senate, plus two Democrats who have said they'll vote their disapproval of the deal. But 60 votes will be needed, meaning Republicans still need four more Democrats. As of right now, there are 13 Democratic senators who have not indicated either their support for the deal or their disapproval. If 10 of them ultimately vote to support Obama, then the disapproval bill will die in the Senate, and no veto will even be necessary. It's a fairly long shot at the moment, but the possibility does exist. As we get closer to the vote, we'll be paying a lot more attention to the whip counts, pro and con.\nAnd finally, in amusing marijuana news, Novak Djokovic -- ranked number one in the world of tennis -- had to complain to the umpire in not just one but two recent matches in Montreal. His problem? The clouds of pot smoke drifting over the court. From the story :\n\"Somebody's getting high,\" he says to a smiling umpire. \"No, honestly... The whole stadium smells.\"\nDjokovic later makes a toking gesture as if he were holding a joint.\nWho knew Canadian tennis fans were such stoners? C'mon, guys -- bring a brownie to the match instead, eh?\nWe've got two Honorable Mention awards to hand out before we get to the main event. Both of these go to Democratic presidential candidates, for different reasons.\nFirst up, we have Martin O'Malley, who deserves credit for his plan to expand Social Security, rather than cut it or raise the retirement age. His plan might be called a timid version of the \"scrap the cap\" idea, since he would impose Social Security payroll taxes on incomes above $250,000 for the first time -- which would go a long way towards ending the regressive nature of this tax (which I detailed, with charts , a few years ago). O'Malley is to be applauded for being so specific in his plan, and for beginning to address the problem of the income cap on the payroll tax. However, his plan leaves a \"doughnut hole\" between roughly $120,000 of income and $250,000. So someone making $10 million a year would pay roughly the same tax rate as a nurse or a firefighter, but someone making $250,000 a year would pay less than half that rate. There's no real mathematical reason for this regressive doughnut hole, but there is a political one -- the portion of Americans making between $100,000 and $250,000 a year is one of the biggest groups who donate money to politicians. That's really the only reason for leaving such a hole in what by all rights should be -- at the very least -- a flat tax rate on all income. Still, O'Malley's plan goes further than other candidates have committed to, so he does deserve some applause.\nI wrote about this earlier in the week , but Hillary Clinton deserves at least an Honorable Mention for how she answered the Black Lives Matter protesters (the video of their meeting was publicly released this week). Clinton pretty much agrees with the group in principle and goes out of her way to validate their positions, but she also challenges them to come up with some solid policy proposals that Democratic politicians can get behind. Clinton did an excellent job being both respectful and pragmatic, at least in our opinion.\nWhich brings us to the winner of the Most Impressive Democrat Of The Week . We're not entirely sure this is within the boundaries of our own rules (since they don't exactly claim party membership), but rules are made to be bent at times. But the Black Lives Matter folks have finally come up with a very solid and reasonable policy platform (call it an \"agenda\" or a \"list of demands\" or whatever else, if you'd like).\nThe policy agenda is called Campaign Zero and includes such things as requiring body cameras on all police, better police training, and much stronger community oversight of all police. The list is an excellent one, and the policies should be embraced by all Democratic candidates for president as well as all progressive voters.\nThe Black Lives Matter movement has been controversial on the campaign trail, notably for disrupting Democratic presidential candidates by taking over speeches. They've always had a brilliant tactic, in the world of political theater. After all, they're protesting police violence against black people, so what are Democrats supposed to do -- call in the cops to physically remove Black Lives Matter from their speeches? That would reinforce the point the activists are making, and it would make the candidate look bad. It's a \"Catch-22\" sort of tactic, because neither siccing the cops on them nor allowing them to completely hijack a campaign event is a very good outcome.\nBut what they've been missing, even with such a brilliant tactic, is any sort of overall strategy . Sure, you can grab the microphone and address the crowd, but if all you do after being given the microphone is to insult your audience and the candidate, then you're not going to gain much support. Many people (I am one of them, for the record) have called on Black Lives Matter to come up with an agenda so that their natural allies -- Democratic politicians and the Democratic base -- can support the movement in a concrete way, instead of just being annoyed by their tactics.\nThis is precisely the point Hillary Clinton was making in the video, and we are glad to see Black Lives Matter respond in such a constructive and forward-looking fashion. This is part of what killed Occupy Wall Street -- not being able to agree on much of any plan for change -- and we firmly believe that the Black Lives Movement will find that their movement will in no way be limited by having a clear agenda, but in fact that it will grow as more and more people agree with and openly support the items listed by Campaign Zero.\nSo, whether they identify as Democrats or not, the leaders of the Black Lives Matter movement who put together Campaign Zero are more than worthy of this week's Most Impressive Democrat Of The Week award.\n[ Contact the Campaign Zero website to show your support. ]\nHillary Clinton had a rough week. Perhaps we're guilty of piling on, but we're going to add a Most Disappointing Democrat Of The Week to her problems.\nMuch like Donald Trump, the Hillary Clinton email server scandal is not going away any time soon. We've still got months of drip, drip, drip, as each new group of emails is released to the media and each development with the server itself plays out. The F.B.I. now has Hillary's server as well as the backup her lawyer had been holding onto for her. As many have pointed out, \"F.B.I. investigation\" is not something any political candidate wants to see in the headlines, while running for office.\nClinton, so far, hasn't done a very good job of addressing the issue, either. She held a very brief presser, got into a spat with a Fox News reporter, tried a silly joke to brush the whole thing off, and then left after about five minutes. The Washington Post has a rundown of five mistakes Clinton made during this appearance, but they missed one big one. You might call it \"orange is the new orange.\"\nNow, we realize (before we even explain that) that politicians shouldn't really be criticized on how they look in the first place, and in the second place, female politicians especially shouldn't be subject to snark about what they're wearing. Hillary Clinton has faced this time and time again. Still, whose idea was it to have Hillary Clinton appear in front of the press to answer questions about an F.B.I. investigation wearing the same shade of orange as prison jumpsuits? That is just breathtaking sartorial stupidity.\nHillary Clinton needs to take a few days off from campaigning. She needs to go on a retreat with her husband, in fact. During this time, Bill should coach Hillary relentlessly on how to successfully brush a political issue aside. There's a reason why Barack Obama joked at the 2012 Democratic National Convention that he should appoint Bill Clinton \"Secretary of Explainin' Stuff.\" He is a master at it, in fact -- the best America has seen since Ronald Reagan. And Hillary -- obviously -- needs a little coaching from Bill on how to handle these things.\nStart by laying out your viewpoint of the situation, in as simple terms as you can manage. Explain the motivations of those making claims of scandal. Then end with a rhetorical flourish in an attempt to lay the issue to rest. Hillary tried to do so, with her \"wipe it down with a cloth\" joke, but it fell awfully flat. She needs a lot of practice with Bill, and her campaign should devote a few days to it. Lock them both in a cabin in the woods, and let Bill school Hillary on how to deal with scandal and crisis. At this point, it couldn't hurt.\nThere are many Democrats -- even some Bernie Sanders supporters -- who feel deep down that Clinton will likely be the Democratic nominee and has a clear path to the White House next year. They just wish she was campaigning for it better , that's all. Team Clinton has got to learn to shift gears smoother and how to respond quicker. Clinton proved she's got a long way to go this week, which is why she's getting the Most Disappointing Democrat Of The Week award.\n[ Hillary Clinton is a private citizen, and we have a longstanding policy of not linking to campaign websites, so you'll have to search her contact page on your own to let her know what you think, sorry. ]\nVolume 358 (8/21/15)\nThe talking points this week were influenced, once again, by Donald Trumps magical mystery campaign, which sooner or later we're just going to stop apologizing for. Hey, he is the Republican frontrunner!\nWe've got a few others mixed in, and two hilarious ones at the end, because we thought everybody could use a laugh after the past week of presidential politics.\n I support Campaign Zero\nThis one's easy, for both Democratic candidates and voters.\n\"I strongly support the positive and constructive agenda Black Lives Matter has laid out, which they're calling Campaign Zero. Their list has many excellent policy ideas which should be enacted at both the state and federal level. All police should have body cameras, because seeing is believing when it comes to what actually happens in confrontations. Police should be required to get much better training for conflict resolution, so the most violent response at their disposal isn't always their first choice. There are many such ideas contained in the Campaign Zero platform, and I call on all Democrats to not only endorse this agenda but also to immediately begin working as hard as possible on enacting these changes across the United States.\"\n Anchor babies!\nTo her credit, Hillary Clinton led in pushing back against Bush's slip of the tongue.\n\"I'm sorry, but Jeb Bush was supposed to be some sort of moderate guy on both immigration and Latino issues. He's married to a Mexican-American, after all, and speaks fluent Spanish. Previously, he has called for Republicans to avoid being intentionally offensive and to speak of immigrants in non-inflammatory terms. He used to be a voice of reason in a crowd of extremists. I guess now that his poll numbers are sinking like a rock, he's decided that offending Latinos is the way to go. If Jeb's not sure whether the term 'anchor babies' is offensive or not, I would suggest he ask a few members of his own family what they think about it.\"\n Selective constitutional worship\nThis, from politicians who swear up and down their fealty to the Constitution?\n\"In the entire history of the United States, we have only ever amended the Constitution to restrict rights a single time -- and Prohibition eventually had to be repealed by another amendment. Now Donald Trump and most of the rest of the Republicans running for president have come out in favor of overturning the Fourteenth Amendment because they don't like one phrase in it. This amendment was passed because racists were insisting that people born in the United States -- ex-slaves -- were not citizens and therefore could never vote. Republicans today want to make it impossible for undocumented immigrants ever to be eligible for citizenship for the exact same reason -- they never want these people to ever have a vote. And now they're attacking the Constitution itself to ensure that only those children born on American soil whom they deem acceptable can be citizens. To do so, we'd have to pass only the second amendment to the Constitution to ever deny rights rather than expand them. This is just a bad idea all around.\"\n Round them up? Really?\nPro-big government rears its ugly head in Republicanland, once again.\n\"So I see that Donald Trump is in favor of the biggest expansion of federal power ever, because his 'round them up and ship them home' plan to deal with undocumented immigrants would change American society forever. We'd have to create an enormous federal police force who would then go around knocking on every door in American and demand to see 'your papers, please.' Those without proof of citizenship would be forcibly rounded up and shipped out. Experts estimate this effort -- should any Congress be stupid enough to enact it -- would take hundreds of billions of dollars and have to last at least two decades. So Trump is in favor of spending an enormous amount of money to pay for jack-booted federal agents to round everyone up and ship them off, by knocking on every door in the country. Sounds like an explosion of 'big government' and creating an enormous federal army to be used for domestic purposes to me. Funny, I always thought Republicans were against those things, on ideological grounds.\"\n Rapists' baby support\nAt times, we are accused of creating talking points that are nothing short of hyperbole. Last week, we ran one that might have fit into that category ( scroll down to talking point number five). We're going to repeat this talking point this week, with the addition of Mike Huckabee's name, since he has now openly admitted exactly the attitude the talking point was referring to.\n\"An 11-year-old girl just gave birth in Paraguay. She was 10 when she was raped by her stepfather, but the government denied her mother's request she be allowed an abortion. These are the real-world consequences of the position taken by many Republican presidential candidates, including Mike Huckabee. They want to outlaw abortion even in the case of rape and incest. That leads directly to 11-year-olds having to bear their stepfather's child after being raped. Mike Huckabee openly admitted that he wants to see that sort of thing here. He actually said: 'Let nobody be misled, a 10-year-old girl being raped is horrible, but does it solve a problem by taking the life of an innocent child?' Yes, 11-year-old mothers forced to deal with their rapist's baby for the rest of their lives is exactly what we can expect if Huckabee ever got his way on outlawing all abortion. No rape victim should ever be forced to bear her rapist's baby. No 10-year-old should have to carry a baby to term against her will. Yet that is exactly what happens when abortion is outlawed.\"\n Deez Nuts for president!\nWe normally wrap these up with one amusing final talking point. This week, we're going to do two instead, just because.\n\"Have you seen the recent polling? A fake candidate named 'Deez Nuts' is polling at a surprisingly high level among voters. For some unfathomable reason a few state-level polls included 'Deez Nuts' in a few of the questions they asked poll respondents about, and he's now getting nine percent in North Carolina, eight percent in Minnesota, and seven percent in Iowa! As the candidate explains: 'I am a 15-year-old who filled out a form, had the campaign catch on fire, and am now putting up the best third-party numbers since Ross Perot.' Right now his poll numbers are better than most of the Republican field, in fact. In a year when Donald Trump is the frontrunner, somehow it seems entirely appropriate that 'Deez Nuts' should be approaching second place in the race, don't you think?\"\n Limberbutt McCubbins for president!\nAnd finally, one from the Democratic side.\n\"Deez Nuts isn't the only amusing candidate out there. A self-proclaimed 'Demo-cat' feline candidate has also thrown his furry hat into the ring . That's right, Limberbutt McCubbins is running for president, on a platform that includes legalizing both catnip and gay cat marriages. His campaign website and Facebook page boast some catchy campaign slogans, including 'Meow is the time' and 'Together we cat.' His owner states the main reason Limberbutt entered the race: 'Me and my friends have begun to realize how easy it is to run for office, and have learned about the way the F.E.C. and campaign finance work. Not that we don't want anyone to run, but I personally don't think that if I'm applying to run for the most important position in the U.S.A., that I should be able to do it in 20 minutes. Or less.' I don't know about that, but I do know that if it came down to Limberbutt McCubbins in the general election, I'd certainly vote for Limberbutt over a lot of the hairballs running on the other side.\"\nChris Weigant blogs at:\nFollow Chris on Twitter: @ChrisWeigant\nBecome a fan of Chris on Huffington Post\nFull archives of FTP columns: FridayTalkingPoints.com\nAll-time award winners leaderboard, by rank\nFollow Chris Weigant on Twitter: www.twitter.com/ChrisWeigant\nMore: Barack Obama 14th Amendment Birthright Citizenship Anchor Babies Black Lives Matter Bill Clinton Abortion This Blogger's Books and Other Items from... How Democrats Can Take Back Congress\nby \"Tom Paine\"", "external_links": ["http://www.chrisweigant.com/ftpts/ftpawards/", "https://www.washingtonpost.com/blogs/plum-line/wp/2015/08/20/morning-plum-is-the-battle-over-the-iran-deal-in-congress-already-over/", "http://twitter.com/ChrisWeigant", "http://www.twitter.com/ChrisWeigant", "http://www.joincampaignzero.org/#vision", "http://www.chrisweigant.com/blog/wordpress/wp-content/uploads/2007/10/6.jpg", "http://www.chrisweigant.com/blog/wordpress/wp-content/uploads/2007/10/midotwsm.jpg", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.joincampaignzero.org/", "http://ecx.images-amazon.com/images/I/512AWP3CPKL._SL160_.jpg", "http://www.limberbutt2016.com/", "http://www.chrisweigant.com/cw/wp-content/themes/crispy2/pix/cwlogo.jpg", "http://www.chrisweigant.com/blog/wordpress/wp-content/uploads/2007/10/1.jpg", "http://www.chrisweigant.com/blog/wordpress/wp-content/uploads/2007/10/mddotwsm.jpg", "http://www.chrisweigant.com/blog/wordpress/wp-content/uploads/2007/10/2.jpg", "http://www.chrisweigant.com/blog/wordpress/wp-content/uploads/2007/10/4.jpg", "http://www.chrisweigant.com/blog/wordpress/wp-content/uploads/2007/10/5.jpg", "http://www.washingtonpost.com/news/the-fix/wp/2015/08/19/5-things-hillary-clinton-did-wrong-in-her-nevada-e-mail-press-conference/", "http://www.chrisweigant.com/2015/08/14/ftp357/", "http://www.washingtonpost.com/news/post-politics/wp/2015/08/20/jeb-bush-anchor-babies-isnt-offensive/", "http://www.amazon.com/exec/obidos/ASIN/0977775909", "http://www.amazon.com/", "http://www.chrisweigant.com/2015/08/18/hillary-strikes-right-tone-with-black-lives-matter/", "http://www.chrisweigant.com/blog/wordpress/wp-content/uploads/2007/10/ftp.jpg", "http://www.salon.com/2015/08/18/try_not_to_cringe_as_you_watch_marco_rubio_hit_a_kid_in_the_face_with_a_football/", "https://www.washingtonpost.com/news/worldviews/wp/2015/08/14/denied-an-abortion-11-year-old-rape-victim-in-paraguay-gives-birth/", "https://www.facebook.com/Limberbutt4President2016?fref=ts", "http://www.chrisweigant.com/2012/12/10/if-were-going-to-tax-the-rich-then-lets-tax-the-rich/", "http://www.chrisweigant.com/2015/08/21/ftp358/", "http://www.chrisweigant.com/blog/wordpress/wp-content/uploads/2007/10/7.jpg", "http://www.chrisweigant.com/blog/wordpress/wp-content/uploads/2007/10/3.jpg"], "published": "2015-08-22T05:01:00.000+03:00", "crawled": "2015-08-22T13:16:17.578+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}