{"organizations": [], "uuid": "82acacef30bf2701d093e4c9d69e5f8bdc28c98b", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/healthcare/254739-its-time-for-compromise-on-abortion", "country": "US", "title": "It's time for compromise on abortion", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "It's time for compromise on abortion", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-24T20:30:00.000+03:00", "replies_count": 0, "uuid": "82acacef30bf2701d093e4c9d69e5f8bdc28c98b"}, "author": "Keith Rosenkranz", "url": "http://thehill.com/blogs/congress-blog/healthcare/254739-its-time-for-compromise-on-abortion", "ord_in_thread": 0, "title": "It's time for compromise on abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 24, 2015, 01:30 pm It's time for compromise on abortion By Keith Rosenkranz \nFor several decades, the most divisive issue among American citizens has been abortion. No debate draws more passion or anger. Through the years, citizens, organizations, and lobbyists have spent hundreds of millions of dollars in an effort to elect/influence politicians who support their \"right to life\" or \"woman's choice\" points of view. This is especially true during presidential elections when both sides weigh the potential for Supreme Court judge appointments that will preserve/overturn Roe v. Wade. Abortion is legal in America today, though many conservative state legislatures push the boundaries in an effort to limit the controversial procedure. An example that captured national attention occurred in June 2013 when Texas state senator Wendy Davis filibustered for 11 straight hours in an attempt to prevent the GOP-controlled legislature from passing a strict anti-abortion bill. The bill was eventually passed, which resulted in the closure of several facilities that had previously performed abortions. ADVERTISEMENT When it comes to abortion, no organization draws more scrutiny than Planned Parenthood. The non-profit group has approximately 700 facilities spread across the country and performs over 300,000 abortions a year. Planned Parenthood has an operating budget in excess of $1 billion and they have received government funding since 1970 when Pres. Richard Nixon signed into law the Family Planning Services and Population Research Act. By law, the $528 million Planned Parenthood currently receives in federal funding cannot be used for abortions. However, many conservatives question whether the organization abides by this law. Over the past few months, several undercover videos have been released by an anti-abortion group called the Center for Medical Progress, raising ethical questions about Planned Parenthood's use of organs and other tissue from aborted fetuses. The videos have ignited a firestorm of debate and pushed Congress to vote for defunding the Planned Parenthood organization. The topic has been at the forefront of the presidential debates and the potential of a government shutdown by Republicans in Congress looms. In contrast to Planned Parenthood are 9,000 community health care centers spread across the country. In the past year, 21 million women - many whom are poor and without health insurance - received Pap smears, mammograms, and other preventative cancer screenings from these facilities, which do not perform abortions. For those who object to federal tax dollars being used to fund Planned Parenthood, there are alternatives. One option would be to transfer the $528 million in government funding to the community health care centers. Doing so would appease those who question whether their tax dollars are being used to fund abortions, and it would preserve and improve the care poor women receive at these facilities. Another option would be fund the the construction of 500 new health care facilities (10 per state) in the coming year. Doing so would provide thousands of jobs to construction workers, doctors and nurses. It could also provide dollars for job training so women who use these facilities can work at them. What would become of Planned Parenthood? For women seeking an abortion, nothing would change. Planned Parenthood has repeatedly stated that no federal funds are used for abortions, so diverting tax dollars from the organization to build new health care centers or to improve existing community centers would not affect the controversial practice. By compromising on the practice of abortion, the hundreds of millions of dollars that have been spent by special interest groups over the years in an effort to influence politicians could instead be used to provide care for women in need. Contributing these private dollars to Planned Parenthood or to the community health care facilities being built or upgraded will eventually eliminate the need for federal funding. And as the Affordable Care Act increases health coverage for poor women who currently can't afford it, even fewer tax dollars would be needed. Abortion is an extremely sensitive topic that sparks a tremendous amount of emotion throughout our culture. For decades, hundreds of millions of dollars have been spent by those fighting to preserve life and those fighting to defend a woman's right to chose. It's time to make peace, put those dollars towards the care women need and deserve, and save taxpayer dollars for other priorities. \nRosenkranz is a former U.S. Air Force F-16 fighter pilot, combat veteran, and author of the book \"Vipers In The Storm.\" He can be reached at RoseyF16@gmail.com", "external_links": [], "published": "2015-09-24T20:30:00.000+03:00", "crawled": "2015-09-24T21:27:26.784+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}