{"organizations": [], "uuid": "e039cd200e9122d4b490afa13586360608cbe169", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/peter-d-rosenstein/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/peter-d-rosenstein/president-obama-amputees_b_7965208.html", "country": "US", "title": "President Obama: Amputees Need Your Help to get Appropriate Healthcare | Peter D. Rosenstein", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "President Obama: Amputees Need Your Help to get Appropriate Healthcare | Peter D. Rosenstein", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-10T16:54:00.000+03:00", "replies_count": 0, "uuid": "e039cd200e9122d4b490afa13586360608cbe169"}, "author": "Peter D. Rosenstein", "url": "http://www.huffingtonpost.com/peter-d-rosenstein/president-obama-amputees_b_7965208.html", "ord_in_thread": 0, "title": "President Obama: Amputees Need Your Help to get Appropriate Healthcare | Peter D. Rosenstein", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In 1978, I came to Washington to direct the White House Conference on Handicapped Individuals/Implementation Unit whose mission was to work with Congress and the federal government to implement the recommendations of the Conference. Since that time, the United States has made great progress in working towards fairness and access allowing persons with differing abilities to live full and productive lives. Clearly we still have a way to go but progress is being made. This past July 26th the nation celebrated the 25th Anniversary of George H.W. Bush signing the Americans with Disabilities Act (ADA). That legislation was a major milestone for the nation helping to ensure that people with differing abilities could fully participate in society.\nThe Affordable Care Act (ACA) was another step toward ensuring this because previously we often saw people with disabilities not able to afford appropriate healthcare. Yet even with the ACA there are many issues that demand further attention. Recently, people in need of a prosthesis in New York State were limited by the Healthcare Exchange to one prosthetic limb per lifetime. Imagine your child growing up and being told when they outgrew a prosthetic limb that they could not receive a replacement.\nNow the Centers for Medicare and Medicaid (C MS) is about to set back the clock 25 years for those needing a lower limb prosthesis. Through its contractors they have proposed a Local Coverage Determination (LCD), which in all likelihood will mean many patients needing such a prosthesis will not be eligible for any type that has been developed in the last twenty five years.\nResearch and development in the past twenty five years, much of which has been funded by the government through the Veterans Administration, the Department of Defense , the NIH and other agencies, along with robust innovation in the prosthetic field itself, has enabled individuals who have lost limbs to regain remarkable levels of function and independence. The current standard of care in prosthetics is routinely depicted in the media as individuals with once disabling conditions returning to active, healthy lives; re-engaging in employment; pursuing recreational and athletic interests; and even returning to active duty military assignments. Due to the current standard of care, limb loss is simply not the disability it once was for all Americans including Medicare beneficiaries.\nSo President Obama, one must question why CMS , through its DME MAC contractors, has issued this proposed Local Coverage Determination (LCD) for Lower Limb Prosthetics that if implemented would send Medicare beneficiaries, and eventually all amputees in this country, back to 1970's technology and result in poorer functional outcomes. The proposed LCD (DL33787) is a comprehensive re-write of Medicare's entire lower limb prosthetic benefit based on virtually no evidence to support it. It would dramatically reduce beneficiary access to the current standard of prosthetic care.\nAs the former Executive Director of the American Academy of Orthotists and Prosthetists (AAOP), I know the Academy's members, nationally certified and licensed in many states, are questioning why CMS is taking this action at this time, preventing them from providing the best possible care to their patients. One has to consider this is simply a way for CMS to save money by not allowing those in need of a prosthesis to access the most appropriate limb. Mr. President, we simply cannot allow our nation to balance its books on the backs of those with limb loss when an appropriate prosthesis would allow them to return to full function and ability.\nThe O&P Alliance , the organization representing those who provide the nation's orthotic and prosthetic care, recently sent a letter to Andrew Slavitt, Acting CMS administrator, telling him the proposed LCD \"eliminates coverage of multiple prosthetic knees, feet and ankles that have undergone years of development, coding assignment, and widespread use by Medicare beneficiaries, causing them to live with prosthetic technology that is outdated and not consistent with the current standard of care. It further eliminates twenty years of precedent by barring consideration of a beneficiary's potential to function and instead relying on 'their documented performance using their immediately previous prosthesis (either preparatory or definitive) when making a determination of the amputee's functional level. This new standard will drive beneficiaries into less functional prostheses and older prosthetic limb technology, some of which is not even available on the market.\" The O&P Alliance has also started a \"We the People\" Petition on the White House website to galvanize support to rescind this proposed policy. It can be accessed at www.SaveProsthetics.org .\nMr. President, on behalf of those in the nation who need this type of prosthetic care to live full and productive lives and support themselves and their families, I ask you to look at these issues which are creating barriers to care, delaying, and in some cases, denying prosthetic care to Americans with limb loss.\nMore: Limb Loss Nih Cms American Academy of Orthotists and Prosthetists Barack Obama Aca American's With Disability Act Department of Defense Department of Veterans Affairs", "external_links": ["http://www.saveprosthetics.org/", "http://www.medicarenhic.com/viewdoc.aspx?id=3109"], "published": "2015-08-10T16:54:00.000+03:00", "crawled": "2015-08-10T17:24:33.255+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}