{"organizations": [], "uuid": "7661ab29671e005151210fba05263e45e51a3516", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaaddress0808.png", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/250637-obama-presses-to-strengthen-voting-rights", "country": "", "title": "Obama presses to strengthen voting rights | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama presses to strengthen voting rights | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-08T14:15:00.000+03:00", "replies_count": 0, "uuid": "7661ab29671e005151210fba05263e45e51a3516"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/250637-obama-presses-to-strengthen-voting-rights", "ord_in_thread": 0, "title": "Obama presses to strengthen voting rights | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 08, 2015, 06:00 am Obama presses to strengthen voting rights By Bradford Richardson President Obama called for action to ensure equality at the ballot box Saturday as he marked the week of the Voting Rights Act’s (VRA) 50th anniversary. “Fifty years after the Voting Rights Act, there are still too many barriers to vote, and too many people trying to erect new ones,” the president said in his weekly address. “We’ve seen laws that roll back early voting, force people to jump through hoops to cast a ballot, or lead to legitimate voters being improperly purged from the rolls.” Obama called on Congress to pass new legislation reaffirming and strengthening the VRA. “The promise that all of us are created equal is written into our founding documents — but it’s up to us to make that promise real,” he said. “Together, let’s do what Americans have always done: let’s keep marching forward, keep perfecting our union, and keep building a better country for our kids.” Obama’s call echoes a chorus of Democrats advocating for more robust election laws, including Sen. Bernie Sanders (I-Vt.), who called for policymakers to further protect the right to vote at a civil rights rally on the National Mall on Thursday. “Anybody who is suppressing the vote, anybody who is intentionally trying to keep people from voting because the candidate knows that those people would vote against him or her, that person is a political coward,” said Sanders, who is running for the Democratic presidential nomination. The debate over voting rights was reignited when the Supreme Court struck down part of the VRA in its landmark 2013 decision Shelby v. Holder , allowing southern states to reform their election laws without federal approval. The 5th Circuit Court of Appeals struck down part of a Texas Voter ID law Thursday, citing the VRA in a unanimous decision. Tags: ", "external_links": [], "published": "2015-08-08T14:15:00.000+03:00", "crawled": "2015-08-08T14:15:24.419+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}