{"organizations": [], "uuid": "85a2c7cc165d745eb5f988fdea97cadb1841a028", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/syrianrefugees09102015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/254856-mayors-to-obama-well-take-more-refugees", "country": "US", "title": "Mayors to Obama: We'll take more refugees", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Mayors to Obama: We'll take more refugees", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-24T23:41:00.000+03:00", "replies_count": 0, "uuid": "85a2c7cc165d745eb5f988fdea97cadb1841a028"}, "author": "dweaver@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/news/254856-mayors-to-obama-well-take-more-refugees", "ord_in_thread": 0, "title": "Mayors to Obama: We'll take more refugees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lanny Davis: Making news: The... OPINION | The media should be ashamed. China's Silicon Valley power play The Seattle tech summit could demonstrate the sway Beijing has over... Here we go again: Cruz vs.... Sen. Ted Cruz is gearing up for another showdown with Republican leaders... Condoleezza Rice: I've had my fill... “I’ve spent a lot of my time in the world of politics,” said the former... FLOTUS to appear on 'Doc... Michelle Obama is about to get animated. White House denies blocking 13-... C.J. Pearson says he received a message that the White House was blocking... Overnight Healthcare: Senate's new... Senate GOP leaders began preparations Thursday to vote on a spending bill... Feds approve NFL drone flights The approval is for aerial videography and television filming. White House calls Putin 'desperate... A meeting between Obama and the Russian President has been set for next... Poll: Sanders leads Clinton by 16... Bernie Sanders has 46 percent support, and Hillary Clinton has 30 percent. The pope, the president and... There could not be better timing for a fearless champion of peace to visit... GOP rep has no regrets about... Rep. Paul Gosar boycotted the address over the pope's focus on climate... Pope's visit brings tears for... Boehner, a lifelong Catholic, at times appeared to be overcome with... A political Pope Francis piques a... Francis marked a historic visit by imploring Congress to come together to... Trump hits Rubio: 'He's a kid' \"He's got the worst voting record in the United States Senate,\" the GOP... Pope Francis pushes Congress to... Francis lived up to his reputation as a provocative figure. Kanye West: Ben Carson is '... \"I think all the people running right now have something that each of the... Pentagon moves into uncharted... The military is making plans to operate under a yearlong emergency funding...", "external_links": [], "published": "2015-09-24T23:41:00.000+03:00", "crawled": "2015-09-25T03:07:47.168+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}