{"organizations": [], "uuid": "7486a939a8a18eaedd347f43838d0480086323c6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3214540/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/hunter-cutting/a-bridge-too-far-for-obama_b_7945254.html", "country": "US", "title": "A Bridge Too Far for Obama | Hunter Cutting", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "A Bridge Too Far for Obama | Hunter Cutting", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-06T22:46:00.000+03:00", "replies_count": 1, "uuid": "04ccc88abfe3eb0b362e203e0761be809dabd62f"}, "author": "Hunter Cutting", "url": "http://www.huffingtonpost.com/hunter-cutting/a-bridge-too-far-for-obama_b_7945254.html#post-0", "ord_in_thread": 0, "title": "A Bridge Too Far for Obama | Hunter Cutting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama's announcement of final rules for his historic plan to reduce carbon pollution from power plants illuminated both the strength of his commitment to addressing climate change and the limit of his reach. Ultimately this means the fight to avoid catastrophic climate change will depend heavily upon who gets picked to be the next president of the United States. Given the state of electoral math these days, that in turn mostly likely depends upon who gets picked to be the next Democratic nominee. And the politics in that crowd are surprising.\nAt its heart, addressing climate change is about accelerating the transition to clean energy and ending all fossil fuel emissions. The president's Clean Power Plan does offer incentives for the production of renewable energy, and the emissions cap will force utilities to slowly switch to clean energy and save consumers money. For a country that has been accelerating in the wrong direction for a long time, this is a critically important turn around.\nBut this is also a president who has also dedicated himself to an \"all of the above energy\" policy that supports both clean energy and fossil fuel development. His power plant plan leaves the door open for utilities to invest in the burning of natural gas (by contending that natural gas is a bit less dirty than coal), locking in long-term capital costs that would be better invested in wind and solar. While the renewable energy incentives will help to counter that outcome, the utility industry has proved itself to be tightly bound to the politics of the fossil fuel industry. And there is no reason to expect that situation to change. The contradiction in Obama's approach to climate change was starkly illustrated by a giant drilling rig recently authorized by the president steaming its way up to the Arctic just as the White House was announcing the rules for the Clean Power Plan.\nWhile Obama's energy policy may have been born of political necessity, he will have at least one big opportunity before his term is up to ensure that his legacy on climate change is not a mixed one. Global warming has only been fueled by the drilling, fracking, mining and burning that Obama has fast-tracked during his administration. However, Obama has yet to take action on one key, symbolic, climate change issue: the Keystone pipeline. That massive pipeline would essentially allow Canada to ship particularly dirty tar sands oil across America's backyard to reach refineries on the Gulf Coast and then export markets abroad. The president may make the determination that it is not in our national interest to let Canada use our public and private lands as an industrial shipping corridor. But he could also make a very public determination that facilitating the burning of carbon-heavy tar sands oil isn't in the best interest of the planet and is inconsistent with the global effort to curb climate change.\nSuch a determination would be a gift to the nation and the world, but it would also be gift to the next president of the United States, and particularly to the next Democratic nominee for President. The job that Obama leaves undone when he heads out the door of the White House will have to be completed by the next president, and that means breaking with the politics of the fossil fuel industry. Obama could help blaze that path by rejecting the pipeline and setting a precedent that burning particularly dirty fossil fuels is a step backwards, not forwards.\nThe stalling and delay over climate change during the past 20 years has left some of the more pessimistic scientists and economists believing that we can no longer keep warming from exceeding the 2 degree threshold above which climate change impacts begin to become truly catastrophic. Fossil fuel emissions must go to zero and soon. The longer we delay, the steeper reductions will have to be. Thankfully, the economists on the optimistic side have had a pretty good track record to date. The jaw-dropping plummet in the price of wind and solar energy, driven by the huge investments made to date (thanks Germany!), is a testament to what happens when politics are kept out of economic decision making and economies of scale are realized. However, even the optimists are clear: the next decade will make or break the effort to avoid catastrophic climate change. If the switch to clean energy by 2025 has not significantly accelerated beyond what Obama has proposed, the only way to avoid catastrophic warming at that point may be drastic steps that would crash dive the global economy. Good luck with that.\nThe torrid politics of climate change over the last 20 years has made at least one thing clear: the rest of the world will only go as far as the United States goes (except for Europe, of course, but unfortunately nobody follows Europe). China and India in particular won't make up for what the United States fails to do, which is pretty reasonable given that their per capita carbon pollution emissions are only a fraction of what Americans produce.\nIn this context, the upcoming U.S. presidential election may be looked back upon as a turning point in history, the moment when politics changed and a U.S. president finally said no to the fossil fuel industry. Or the election could be seen as the fateful moment when U.S. politics got locked into yet another 8-year run of the \"all of the above\" energy policy.\nIt's hard to be hopeful about the Republican nominees when it comes to climate policy, but it's easy to be optimistic that the electoral math no longer works for Republicans.\nOn the Democratic side the picture is more fuzzy. While there is a lot of rhetoric coming from the Democrats about addressing climate change and embracing clean energy, all that just amounts to happy talk. It doesn't matter how much we promote renewable energy if the fossil fuel industry has a strangle hold on the utility sector as well as other key sectors and players.\nThe key question to ask any Democratic contender is whether he or she will formally renounce the \"all of the above\" energy policy of the past and turn his or her back on the fossil fuel industry. At least one major Democratic front-runner has yet to make this call. In the end we are likely to get a fair idea about what global warming will look like for decades to come as soon as we know the energy policy of the next Democratic nominee for president of the United States.\nFollow Hunter Cutting on Twitter: www.twitter.com/TalkingTheWalk\nMore: Barack Obama Barack Obama Climate Change Energy Elections 2016 Presidential Election 2016 Democratic Primary Hillary Clinton Bernie Sanders Martin O'Malley", "external_links": ["http://www.twitter.com/TalkingTheWalk"], "published": "2015-08-06T22:46:00.000+03:00", "crawled": "2015-08-07T08:54:28.747+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}