{"organizations": [], "uuid": "e20bbb4d9d58546caeee79524f6646677c1a5c48", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/james-marshall-crotty/how-the-left-can-put-the-_b_8005920.html", "country": "US", "title": "How the Left Can Put the Planned Parenthood Debacle Behind It and Restore Integrity to the Abortion Debate | James Marshall Crotty", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "How the Left Can Put the Planned Parenthood Debacle Behind It and Restore Integrity to the Abortion Debate | James Marshall Crotty", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-19T05:32:00.000+03:00", "replies_count": 0, "uuid": "e20bbb4d9d58546caeee79524f6646677c1a5c48"}, "author": "James Marshall Crotty", "url": "http://www.huffingtonpost.com/james-marshall-crotty/how-the-left-can-put-the-_b_8005920.html", "ord_in_thread": 0, "title": "How the Left Can Put the Planned Parenthood Debacle Behind It and Restore Integrity to the Abortion Debate | James Marshall Crotty", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I grew up in a strict Catholic home, where there was zero tolerance for of an alternative take on abortion. Partially in reaction, I've been pro-choice ever since.\nHowever, as I told Jesuit photographer Don Doll - a revered chronicler of Native American people - recently at the Bemidji, Minnesota redoubt of Adventure Studio , I've softened my abortion stance over the past few years. This shift began when science unequivocally proved that we can sustain human life outside the womb from early in a pregnancy.\nMost of the time, the far right is vociferously against scientific consensus (e.g., global warming, evolution, the deleterious health effects of indiscriminately burning fossil fuels). However, on this point, science is squarely in the pro-life corner.\nEmbryology teaches us that, at conception, a fetus, genetically speaking, is structurally a human being. Moreover, a beating heart is typically detected by day twenty-four, while brain waves are detected after six weeks. A human \"develops\" over time in and out of the bomb - our brains aren't fully formed until at least our 20th year - but is \"constructed\" early in the birth cycle.\nMoreover, I've come to realize that if one is against the death penalty (except in the most transparently obvious cases of unassailable genetic proof), then one must be equally reticent about abortion, if one one is to be consistently pro-life. By the same logic, one should also be supremely reluctant to go to war (except in the most transparently obvious and \"just\" circumstances, such as when our nation is empirically threatened - not merely perceived to be threatened - by a well-armed and capable adversary). And, regarding the domestic issue du jour, one must equally reluctant to see deadly force used in citizen-police encounters, as #BlackLivesMatter has correctly, if at times boorishly, noted.\nIn other words, all lives matter, whether in the womb or out, on death row or not. As a social progressive, I am now consistent across these four issues. I am, thus, naturally upset when otherwise well-meaning liberal friends cherry-pick on the sanctity of life (abortion is okay, but the death penalty is abominable; abortion and the death penalty are okay, but war is verboten; war is sometimes okay, and abortion is always okay, but the death penalty and death by cop are always wrong because \"innocent life\" might be taken).\nTheir confusion is not because they have brilliantly threaded some Kantian categorical imperative, but, rather, because they do not possess a consistent moral imperative at all. Indeed, their relativism is enslaved to a preordained political viewpoint (e.g., it's okay to kill radical Islamic terrorists with drones, but not okay to kill those same jihadists by lethal injection, even if there is often tremendous loss of innocent life with the former, and none with the latter).\nOne sees the same detachment from reality in other aspects of liberal thinking. It's as if all manner of barbarity can be justified as long as its true nature can be disguised. Many compassionate liberals - despite their tacit endorsement of P.E.T.A. - still love to chow down on cow, chicken or pig, but only if they can be reassured that these animals were treated humanely (forgetting that almost all animals end up in brutal slaughterhouses, even if they were fed an organic vegan diet, and allowed to roam free, as free as the wind blows). Drone warfare is the perfect liberal form of warfare precisely because its detached nature obviates the need to personally confront the ghastly horrors on the ground that drones engender.\nEven with such rampant liberal hypocrisy, I still have historically backed the standard liberal position on abortion because in weighing horrific - if at rare times necessary - evils, I invariably come down on the side of sovereignty by adult persons over their own bodies as the last bulwark against an overintrusive state. This is a true Libertarian position, though such logic is lost on both liberals (who invoke state power over the individual - e.g., gun control - when it serves their political interests) and cherry-picking Libertarians (e.g., Rand Paul).\nWhat recently pushed me towards a more moderate position on abortion, however, was how the left has been deliberately deceitful on this issue of Planned Parenthood representatives agreeing to sell body parts from partial live birth or fully live birth abortions. Massachussetts Senator Elizabeth Warren's duplicitous and heated rant on the Senate floor moved me from being adamantly pro-choice, to being pro-choice only when all other non-lethal options have been exhausted.\nWarren and others on the knee-jerk far left - who deliberately and cynically conflate cross-party concerns about the selling of fetal body parts with a woman's right to choose - are missing the key issue in the Planned Parenthood scandal. Yes, because of liberal media bias, it took a pro-life advocacy organization - the Center for Medical Progress (CMP) - to catch Planned Parenthood representatives casually and dispassionately discussing the \"extraction\" and sale of fetal body parts. I would have preferred a whistleblower with less of a partisan agenda.\nHowever, it is hypocritical for lefties to decry such undercover methods when it is a standard left-wing tactic to use these very same methods - rightfully I might add - to expose bigoted comments by conservative lawmakers, intrusive government surveillance, or various other forms of conservative malfeasance. Moreover, it is disingenuous to say that the Planned Parenthood footage was \"edited,\" when the unedited footage still shows the same outrageous comments from Planned Parenthood representatives.\nThe bigger, more immoral crux of the Planned Parenthood scandal is the left's repeated attempts to rhetorically sugarcoat the true nature of abortion. As the undercover Planned Parenthood videos showed, in discussing an aborted human being, the left prefers to use desiccated terms like \"tissue blocks\" in discussing fully alive infants that were brutally killed, with their heads smashed, and organs stripped out for \"research.\"\nMoreover, when cornered on this point, many leftist women - who would gladly string up a game hunter for killing a protected lion; and publicly castrate him if there was an unborn cub inside (I've had women tell me precisely this) - will utter lines like this one from Ellin Stein on my Facebook page : \"I love the way it's always men who feel they have to point out that abortion is a sad and serious experience not to be chosen lightly, like otherwise women's flibbertigibbet brains would never realize this. I know of no woman remotely in touch with her body who hasn't felt a deep instinctual knowledge of this (and then gone ahead and had one regardless).\"\nThat comment is absurd. Many women openly decry the horrors of abortion, yet I must be invalidated because I agree with their assessment? Moreover, are we to now knee-jerk invalidate women's opinions on the lifelong health hazards of playing NFL Football because they don't play the game?\nYes, intelligent men still go on and play professional football, even knowing the lifelong damage that comes from concussions. And we increasingly broadcast the dangers implicit in that decision. But are we now supposed to keep silent about the physical, emotional and spiritual damage done by abortion because women continue to deploy it as a form of birth control? How then are such pro-abortion censors any different from the NFL, which denied or obfuscated the true risks of playing professional football for decades?\nIn both the cases of pro football concussions and abortion, racial minorities are likely to be the victims. That's the ugly secret behind keeping the true, dehumanizing nature of abortion hidden from public view. It's also interesting that the far left often decries the right as racist, when, in fact, it is pro-life conservatives who are literally trying to save poor minority children from being aborted.\nFor there to be genuine common cause in the abortion debate, the left needs to publicly concede that abortion is indeed a gruesome procedure and its use as an on-demand, no-questions-asked form of birth control carries the risk of long-term physical and psychological harm. The left needs to own that, not cloak abortion's stark horror behind the deliberately deceptive notion of \"women's health.\"\nIt's the same deceitful rhetoric that the left uses to disguise the evils of unbridled illegal immigration (which include murder, rape, robbery, human trafficking, drug addiction, and potential terrorism). The left refuses to even use the term \"illegal immigrants\" or, God forbid, \"illegal aliens,\" which is the correct legal term for someone who has deliberately entered the U.S. without permission or overstayed their visa. Instead, the left calls illegal aliens \"immigrants,\" as if illegal aliens were of the same noble status as all those people who waited patiently in line for decades in order to legally enter this country.\nThe left are up to the same rhetorical obfuscation on abortion. And this student of rhetoric sees right through their deception. If the left is to have any credibility after the Planned Parenthood debacle, they need to say that they too are pro-life, if still pro-choice. That is, abortion should not be available willy-nilly as just another form of utilitarian birth control, but only as a last-ditch procedure when all other options have been exhausted, and only then when the life of the mother is at risk, or in cases of rape or incest. Just as important, leftist leaders need to come out vociferously against the selling of aborted fetal tissue.\nIf leftist leaders made this pivot, then I think moderate, common sense Democrats and Republicans will embrace the notion of a woman's right to choose abortion once all other options have been fully explored. And, just as important, they will, in turn, maintain Planned Parenthood's critical non-abortion funding for much-needed services such as family planning, contraception, and sexual counseling, which study after study shows are the best long-term solutions to reducing abortion.\n- CROTTY\nFollow James Marshall Crotty on Twitter: www.twitter.com/Crotty\nMore: Planned Parenthood Planned Parenthood Funding Elizabeth Warren Abortion Pro Choice Pro Life #BlackLivesMatter Black Voices NFL Republicans Don Doll Birth Control Adventure Studio James Crotty James Marshall Crotty Crotty HuffPo Family Planning Center for Medical Progress This Blogger's Books and Other Items from... The Mad Monks' Guide to New York City (The mad Monk's guides)\nby Michael Lane How to Talk American: A Guide to Our Native Tongues\nby James Marshall Crotty", "external_links": ["http://www.adventurestudio.com/", "https://www.facebook.com/JamesMarshallCrotty", "http://www.twitter.com/Crotty", "http://www.amazon.com/exec/obidos/ASIN/0395780322", "http://www.amazon.com/exec/obidos/ASIN/0028627555", "http://ecx.images-amazon.com/images/I/510WYXBCM3L._SL160_.jpg", "http://www.indiebound.org/?aff=HuffingtonPost", "http://time.com/3983266/elizabeth-warren-planned-parenthood-speech/", "http://www.amazon.com/", "http://ecx.images-amazon.com/images/I/511Z3n2hg2L._SL160_.jpg", "http://lens.blogs.nytimes.com/2012/10/19/a-photographer-and-prayer/?_r=0"], "published": "2015-08-19T05:32:00.000+03:00", "crawled": "2015-08-19T05:29:43.266+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}