{"organizations": [], "uuid": "be26a1671f665c5eec3c41feecfcaa187c708cad", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_090215getty.jpg", "site_section": "http://thehill.com/blogs/e2-wire?format=feed&type=rss", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/252511-obama-to-announce-new-climate-effort-for-alaska", "country": "US", "title": "Obama to announce new climate effort for Alaska", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to announce new climate effort for Alaska", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-02T16:13:00.000+03:00", "replies_count": 0, "uuid": "be26a1671f665c5eec3c41feecfcaa187c708cad"}, "author": "dhenry@thehill.com (Devin Henry)", "url": "http://thehill.com/policy/energy-environment/252511-obama-to-announce-new-climate-effort-for-alaska", "ord_in_thread": 0, "title": "Obama to announce new climate effort for Alaska", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to announce new climate effort for Alaska Getty Images By Devin Henry - 09/02/15 09:13 AM EDT \nPresident Obama will announce a series of programs to help Alaskan communities affected by climate change during his trip to the Arctic Circle on Wednesday. \nObama will travel to the Alaskan town of Kotzebue on the third day of his trip the state. While there, he will detail a handful of administrative actions to help rural communities cope with climate change, the White House said. ADVERTISEMENT Obama will announce that he’s directing a federal and local board called the Denali Commission to oversee climate change mitigation efforts in the state.\nThe 17-year-old commission currently focuses on utility and infrastructure improvements for rural Alaskan communities. \nNow, the White House said, it will also work with the Alaskan government to “facilitate coordination of federal engagement in efforts to protect communities and conduct voluntary relocation or other managed retreat efforts.” \nThe Department of Agriculture will announce a $17.6 million suite of grants to improve rural water infrastructure in Alaska. The agency will also spend $240,000 to expand its presence on Native American land in the region. \nOther efforts include a Department of Housing and Urban Development (HUD) plan to help communities relocate due to climate change, a new report on tribal energy systems in Alaska and federal support for an app that allows people to share photos of areas hit by climate change in the region. \nThe government will spend $2 million on HUD's voluntary relocation efforts. \n“Climate change is real, it is being driven by human activity, and it is happening right now — and nowhere is that more apparent than in Alaska,” the White House said in a statement. \n“President Obama is committed to leading the fight against climate change by curbing the carbon pollution that is driving global warming, building resilience in American communities to the climate impacts we can no longer avoid and driving progress on the international stage.\" \nObama has spent two days in Alaska on a trip to highlight the affects of climate change there. On Tuesday he toured the Kenai Fjords National Park and hiked to a glacier. \n“This is one of the most studied glaciers because it’s so easily accessible,” he told reporters in front of the park’s Exit Glacier. \n“But what it indicates, because of the changing patterns of winters with less snow, longer, hotter summers, is how rapidly the glacier is receding. And it sends a message about the urgency that we're going to need to have when it comes to dealing with this.” Tags:", "external_links": [], "published": "2015-09-02T16:13:00.000+03:00", "crawled": "2015-09-03T04:20:58.718+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}