{"organizations": [], "uuid": "ca41fa6e213d9ff85d90ac03e2b7eec1032f0e58", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/scotus_032612gn.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/252656-texas-abortion-clinics-make-plea-to-supreme-court-to-overturn-law", "country": "US", "title": "Abortion clinics make plea to Supreme Court to strike Texas law", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Abortion clinics make plea to Supreme Court to strike Texas law", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-03T18:39:00.000+03:00", "replies_count": 0, "uuid": "ca41fa6e213d9ff85d90ac03e2b7eec1032f0e58"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/252656-texas-abortion-clinics-make-plea-to-supreme-court-to-overturn-law", "ord_in_thread": 0, "title": "Abortion clinics make plea to Supreme Court to strike Texas law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Abortion clinics make plea to Supreme Court to strike Texas law By Sarah Ferris - 09/03/15 11:39 AM EDT Abortion rights groups are urging the Supreme Court to step in and overturn a restrictive Texas law, which they call the most extreme in the country. “We’re counting on the Supreme Court to hear our call for justice,” Amy Hagstrom Miller, the president of a Texas-based clinic called Whole Woman’s Health, told reporters on Thursday. ADVERTISEMENT “Women and families are confused as to what their rights are,” she added, pointing to the direct consequences her clinic and others have felt from the law. The legislation passed in 2013 to much fanfare after then-state Sen. Wendy Davis staged a 13-hour filibuster against it. The high-court effort comes after two years of appeals in Texas — a battle that has been fought by national groups like Center for Reproductive Rights and Planned Parenthood. \n“It’s time for the Supreme Court to step in,” Nancy Northup, president of the Center for Reproductive Rights, told reporters on Thursday. She stressed that the stakes for the decision are high and warned that if the law is allowed to stand, copycat laws “will proliferate.” The case against Texas’s law comes amid scores of lawsuits across the country, including another case from the Center for Reproductive Rights involves admitting privileges in Mississippi. The Supreme Court punted on that case during its last session, and it will now await the justices this fall. \nThe state of Texas has 30 days to respond. The Supreme Court will likely make the decision whether to take up the case before November. \nIf it does take up the case, a decision on abortion would catapult the issue into the 2016 presidential election, where the fallout from undercover Planned Parenthood videos is still making waves. Past: 1 day Snowden: Clinton's email server 'a... Snowden also dismissed comments by Donald Trump, who called him a \"traitor... Trump hits 30 percent in new poll In a distant second place is Ben Carson with 18 percent support. Planned Parenthood gets $1M in... The new funding is enraging Republicans who have already sought to defund... Ex-Clinton aide expected to plead... Lawyers for the IT staffer cite the \"current political environment.\" House GOP leader distances herself... \"I don’t work for John Boehner. He works for me,\" Rep. Lynn Jenkins said. DNC chief faces perilous fall Angst over the presidential debates and a tough choice on Iran await... Trump signs GOP loyalty pledge Trump said he will not change his mind about the pledge. Ky. marriage clerk taken into... Kim Davis was held in contempt of court for refusing to issue same-sex... Let's get real and end birthright... The current policy of birthright citizenship is a huge magnet for more... Trump: Nuclear deal forces US to... \"We have to fight with Iran against Israel\" in the event of war, Trump... Perry on Trump's claim he's... Donald Trump asserted that Rick Perry is “getting out of the race.” Postal workers' dispute boils over... The postal workers say keeping post offices open longer would not only... Ex-adviser: Trump will sign... Trump got what he wanted from the RNC, former adviser Roger Stone said. Trump hits Carson: Doctors don’t... Trump said it would be \"very tough\" for someone with a medical background... Judge poised to order search for... The order could come by the end of next week. PGA cancels Grand Slam of Golf... The PGA was unable to find another venue for the event in time. Robert Redford 'glad' Trump is... “On the other side it’s so bland, it’s so boring, it’s so empty,” the... Captain Crunch passes Deez Nuts in... Captain Crunch leads PPP's survey of \"joke candidates.\" Anti-Muslim bigotry has no place... Hate crimes against American Muslims are five times more common than...", "external_links": [], "published": "2015-09-03T18:39:00.000+03:00", "crawled": "2015-09-04T00:19:43.473+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}