{"organizations": [], "uuid": "c5eac8907f4af69573eb5dd52fa197a0fb9f6b4b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/852849/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/crime/blog.xml", "section_title": "Crime Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/tom-mullen/cop-killings-are-way-down_b_8072366.html", "country": "US", "title": "Cop Killings Are Way Down During Obama Presidency | Tom Mullen", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Cop Killings Are Way Down During Obama Presidency | Tom Mullen", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-02T04:46:00.000+03:00", "replies_count": 0, "uuid": "c5eac8907f4af69573eb5dd52fa197a0fb9f6b4b"}, "author": "Tom Mullen", "url": "http://www.huffingtonpost.com/tom-mullen/cop-killings-are-way-down_b_8072366.html", "ord_in_thread": 0, "title": "Cop Killings Are Way Down During Obama Presidency | Tom Mullen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Milwaukee County Sheriff David Clarke told Fox News yesterday, \"President Obama has breathed life into this ugly movement,\" meaning Black Lives Matter and the \"war on cops\" Clarke says the president is at least partly responsible for.\nThis is part of a larger narrative in right-wing media that cop killings are increasing due to Obama's tacit support for anti-cop activist groups and failure to condemn those who attack or kill police officers.\nThere's only one problem with the narrative: Cop killings are way down during Obama's presidency and on pace this year for the lowest annual total this century.\nI'm basing this on the records provided on the Officer Down Memorial Page , which keeps a record of the cops killed in the line of duty, along with the causes of death. The site keeps track of all officer deaths, including those by heart attack, motorcycle accident and other non-homicidal causes, along with intentional homicides like gunfire and stabbing.\nUsing all of the categories which can be assumed intentional homicide (gunfire, vehicular assault and all other assaults, including stabbing), there have been far less intentional homicides of cops during Obama's presidency than during Bush's.\nFor the first six years of Bush's presidency (2001-2006), the total number of cops intentionally murdered was 426. This doesn't count 911-related deaths, which would obviously skew Bush's number higher. During the first six years of Obama's presidency, the total number of cops intentionally murdered was 382. That's a 10 percent drop.\nIn the seventh year of Bush's presidency, there were 77 cop killings, by our definition. So far this year, Obama's seventh in office, there have been 35. Statistically speaking, we're on pace for a total of 52 in 2015, which would be the lowest total in this century.\nObviously, the goal in any year, no matter who is president, is zero. It's uncomfortable to even say \"statistically speaking\" when you're talking about people being brutally murdered.\nBut what the president says or doesn't say probably has no impact on the number of cops murdered in any given year. If it does, far less cops are being killed during Obama's presidency than during Bush's. If we're going to keep the downtrend going, we need to look at the real causes of this problem and not get distracted by those who politicize it.\nFollow Tom Mullen on Twitter: www.twitter.com/ThomasMullen\nMore: War on Cops Cop Killings Sheriff David Clarke Homicide Officer Down Cop Deaths Shootings This Blogger's Books and Other Items from... A Return to Common Sense\nby Thomas Mullen A Return to Common Sense: Reawakening Liberty in the Inhabitants of America\nby Thomas Mullen", "external_links": ["http://ecx.images-amazon.com/images/I/51oZ35PHCaL._SL160_.jpg", "http://ecx.images-amazon.com/images/I/51dAh8gpAfL._SL160_.jpg", "http://www.amazon.com/exec/obidos/ASIN/1493508792", "https://www.odmp.org/search/year", "http://insider.foxnews.com/2015/08/31/sheriff-david-clarke-president-obama-has-breathed-life-ugly-black-lives-matter-movement", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.amazon.com/exec/obidos/ASIN/B00FYJZEXK", "http://www.amazon.com/", "http://www.twitter.com/ThomasMullen"], "published": "2015-09-02T04:46:00.000+03:00", "crawled": "2015-09-02T06:36:41.239+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}