{"organizations": [], "uuid": "030cef33adfddd8e1cbcbf4f3603bb20082ade62", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/08/31/WE01235447/3676180/Movieon83115at821AMmov-3676180_lg.jpg", "site_section": "http://rss.ireport.com/feeds/latest.rss", "section_title": "CNN iReport - Latest", "url": "http://ireport.cnn.com/docs/DOC-1267716?ref=feeds%2Flatest", "country": "US", "title": "World leaders address inquiry deliver testimony against Mr. Obama and his administration at the International Court at the Hague, Netherlands", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "World leaders address inquiry deliver testimony against Mr. Obama and his administration at the International Court at the Hague, Netherlands", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-01T00:47:00.000+03:00", "replies_count": 0, "uuid": "030cef33adfddd8e1cbcbf4f3603bb20082ade62"}, "author": "Sabahqueen12", "url": "http://ireport.cnn.com/docs/DOC-1267716?ref=feeds%2Flatest", "ord_in_thread": 0, "title": "World leaders address inquiry deliver testimony against Mr. Obama and his administration at the International Court at the Hague, Netherlands", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By rosehips World leaders address inquiry deliver testimony against Mr. Obama and his administration at the International Court at the Hague, Netherlands By Sabahqueen12 | Posted 11 minutes ago | Kahala, Hawaii Dear Prime Minister of Germany, Chanceller, Mrs. Angela Merkel, My heartfelt thanks to your great job governing Germany, It is in the best interests of the world I write to you admonishing you to stand in my behalf and separate from Mr. President Barack Hussein Obama because of his crimes against world citizens and against humanity. What are his crimes? He is responsible for destroying USA strength world wide 1) Destruction of the U.S. Constitution 2) Financial ruin of the USA 3) Disabling USA security world wide 4) League with Iran demonstrates his alliance with wicked powers that intend to destroy the West which Germany, U.K. France, India etc. represent. I seek your assistance and all world powers on the side of the West that Mr. President Obama be condemned at the International Court of the Hague, Netherlands magistrates his peers, world leaders, presidents, kings, and princes and that he be incarcerated by Interpol. I humbly seek your assistance as a collaborator with France to enable Interpol to arrest Mr. President Barack Hussein Obama imminently with discretion. My sincere wish is that West be righted security to the nations of the West be established and strong once more. I am a humble USA citizen but, I do care deeply for all world citizens. In sum, I never did understand how Mr. President Barack Obama convinced the West to disassociate from Mr. Netanyahu and the nation of Israel propelling them in murky death defying security issues. Let us stand strong again as world community and defend Israel and Mr. Netanyahu as we should in the first place. Sincerely,", "external_links": [], "published": "2015-09-01T00:47:00.000+03:00", "crawled": "2015-09-01T01:08:53.040+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}