{"organizations": [], "uuid": "79faf7ba863f0007abef5ab8e26ca71be15649a8", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarack_coachk_duke09082015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/252928-obama-i-can-relate-to-duke", "country": "US", "title": "Obama: 'I can relate' to Duke", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: 'I can relate' to Duke", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-08T19:42:00.000+03:00", "replies_count": 0, "uuid": "79faf7ba863f0007abef5ab8e26ca71be15649a8"}, "author": "tlejeune@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/252928-obama-i-can-relate-to-duke", "ord_in_thread": 0, "title": "Obama: 'I can relate' to Duke", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 08, 2015, 12:42 pm Obama: 'I can relate' to Duke By Jordan Fabian \nPresident Obama celebrated the Duke basketball team’s national championship at the White House on Tuesday, saying he has a lot in common with the Blue Devils. “I can relate to this program: does well in the classroom, won twice in the past four years, knows what it’s like for people to oppose you no matter what you try to do,” he said during a ceremony in the East Room. ADVERTISEMENT The president’s comment elicited plenty of laughs from the crowd, especially when he brought up one of the most polarizing players in school history. “When I flip on ESPN and I see a documentary about how people still hate Christian Laettner, a guy who played for Duke 23 years ago, I realize, well, maybe I don’t have it so bad,” he joked. “Or maybe I think this is going to be a long 23 years.”Duke pulled off a comeback victory against Wisconsin to win the 2015 NCAA championship. The team was led by an outstanding freshman class that included Jahlil Okafor, Tyus Jones and Grayson Allen. “If people didn’t like this year’s Blue Devil team, they were just bein’ haters,” Obama said. The final result surprised many, including the president, who picked the University of Kentucky to beat Villanova in the championship game. Obama had Duke losing in the Final Four in his bracket. It was a momentous season for the program, with coach Mike Krzyzewski claiming his 1,000th career win. But Obama joked that the squad’s White House ties had something to do with it too, noting his old body man and close friend Reggie Love played for Duke in the early 2000s and a former White House intern served as this year’s head manager. “A little White House magic rubbed off on this team, just saying,” Obama said.It was Duke’s second trip to the White House to celebrate a national title during Obama’s presidency. The last visit was in 2010, Obama’s second year in office. Krzyzewski gifted Obama with a Duke jersey, a ball and an invite to a basketball fantasy camp for players age 35 and over after he leaves office. “I’ll dominate,” Obama said. Tags:", "external_links": [], "published": "2015-09-08T19:42:00.000+03:00", "crawled": "2015-09-09T00:32:48.772+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}