{"organizations": [], "uuid": "14893c0b0dc4f633721fa1aa915c6459be1027fa", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2322708/images/o-IMMIGRATION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/roy-speckhardt/is-it-easier-for-religiou_b_7933328.html", "country": "US", "title": "Is It Easier for Religious Workers to Immigrate to America? | Roy Speckhardt", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "Is It Easier for Religious Workers to Immigrate to America? | Roy Speckhardt", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-04T18:41:00.000+03:00", "replies_count": 1, "uuid": "476c6c5071992b7cd3f632a44dea4f369c6e257c"}, "author": "Roy Speckhardt", "url": "http://www.huffingtonpost.com/roy-speckhardt/is-it-easier-for-religiou_b_7933328.html#post-0", "ord_in_thread": 0, "title": "Is It Easier for Religious Workers to Immigrate to America? | Roy Speckhardt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Did you know some people have the option of becoming American citizens through Special Immigrant Religious Worker petitions? According to Gregory Eck of JDSupra Business Advisor , these petitions \"allow persons in religious vocations and occupations to obtain permanent residence for the purpose of performing full-time religious work.\" Eck goes on to state that these petitions require two previous years continuous work \"in a religious occupation.\"\nWith this provision set to expire at the end of September, lawmakers are now considering extending it, or even making it permanent .\nI have to wonder why the law would carve out this loophole for religious people engaged in religious work, but not for secularists who are working for charities that benefit the common good at least as much as the religious endeavors. And after a decision last month by U.S. policymakers , this religious benefit was expanded to allow religious workers to apply for permanent residency even if they were in the U.S. illegally. It's a move supported by religious conservatives despite traditional religious bias against immigrants .\nAs a humanist, I generally want to see religious privilege eliminated because the government should treat all Americans equally, regardless of particular beliefs and philosophies. Sometimes that means finding a way to take away special rights for the religious, as we are aiming for with our efforts to remove religious vaccination exemptions that can endanger many Americans. And sometimes that means finding a way to expand the privilege so it isn't favoring any one religious or secular perspective.\nThis immigration visa issue seems to be one of the latter situations -- just like the recent American Humanist Association legal victory in Oregon that secured the right for humanists and atheist inmates to organize groups and receive access to information formerly reserved for approved religions. So, while I agree with Luis Granados' take that something must be done about this prejudicial policy, instead of eliminating it I'd like to see the legislators expand this immigration program to allow charitable workers immigration opportunities without regard to their religiosity.\nAmerica and immigration go hand and hand. For generations, this country benefitted not only from the labor performed by immigrants who came to the U.S. looking for a better life, but also from the varied ways of thinking that keep us among the most creative and scientifically advanced of all nations. We're enriched by the various ethnic, religious, cultural and political diversities that come to us via immigration.\nWhile the prejudices vary from group to group, every wave of immigrants that has arrived in the U.S. faced difficulties. With long-term citizens skeptical of newcomers and worried about potential impacts on their jobs and finances, immigrant pools often face uphill battles to secure their places in our society. That's why it's so important that our government works to help immigrants transition into becoming citizens as quickly as possible, and programs such as a special visa for those who work in charitable organizations could go a long way towards helping naturalize the most compassionate immigrants. But it must be available to all groups, not just certain religious organizations.\nMuch of what religious workers do is important work, including working for charities that assist those in need. So instead of seeking to abolish this religious fast-track to getting a visa or citizenship, let's expand it for all workers willing to engage in two years of continuous charitable work. Adding such compassionate people to our numbers can only be good for America.\nFollow Roy Speckhardt on Twitter: www.twitter.com/royspeckhardt\nMore: Immigration Humanism Atheism Religion and Politics Separation of Church and State", "external_links": ["http://registerguard.com/rg/news/local/33340347-75/federal-prisons-agree-to-recognize-humanism-to-settle-lawsuit-by-oregon-inmate.html.csp", "http://thehumanist.com/voices/rules_are_for_schmucks/rules-are-for-schmucks-the-amazing-special-privilege-for-religious-immigrants", "http://mashable.com/2014/07/09/the-evangelical-movement-against-immigration/", "http://www.capitalnewyork.com/article/albany/2015/07/8572964/bill-would-end-religious-exemption-vaccines", "http://www.twitter.com/royspeckhardt", "http://www.uscis.gov/working-united-states/permanent-workers/employment-based-immigration-fourth-preference-eb-4/religious-workers/special-immigrant-religious-workers", "https://www.govtrack.us/congress/bills/114/s1339", "http://www.uscis.gov/sites/default/files/USCIS/Laws/Memoranda/2015/2015-0705_Lawful_Status_PM_Effective.pdf", "http://www.jdsupra.com/legalnews/religious-workers-redeemed-sort-of-by-97561/"], "published": "2015-08-04T18:41:00.000+03:00", "crawled": "2015-08-04T20:06:22.195+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}