{"organizations": [], "uuid": "283eddc22f866066ee59bd4b0ba61692552cf5d8", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/boltonjohn_032914getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/255307-john-bolton-obama-is-in-a-dream-world", "country": "US", "title": "John Bolton: Obama is 'in a dream world'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "John Bolton: Obama is 'in a dream world'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-29T21:48:00.000+03:00", "replies_count": 0, "uuid": "283eddc22f866066ee59bd4b0ba61692552cf5d8"}, "author": "mmali@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/255307-john-bolton-obama-is-in-a-dream-world", "ord_in_thread": 0, "title": "John Bolton: Obama is 'in a dream world'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 29, 2015, 02:48 pm John Bolton: Obama is 'in a dream world' By Mark Hensch Getty Images \nJohn Bolton, a former U.S. ambassador to the United Nations, is blasting President Obama, saying he's missing the threat from Russian President Vladimir Putin. \n“Our president is in a dream world,” Bolton told hosts John Sapochetti and Adriana Cohen on the Boston Herald’s “Herald Drive” on Tuesday. \n“Putin has demonstrated he has a strategy and he knows what he thinks Russia’s national interests are,” Bolton said. “I think he’s pursuing a well-thought-out strategy. ADVERTISEMENT “I think everybody now sees that, at least for the next 16 months, if you have an agenda to advance against the United States in the Middle East or around the world, this is the time to do it,” he added.\nBolton’s criticism came after Obama and Putin sat down for their first formal meeting in two years on the sidelines of the U.N. General Assembly on Monday. \nThe two leaders traded barbs during their respective addresses to the body earlier in the day before the reportedly tense encounter where they discussed Syria and Ukraine. \nBolton has been a tough critic of the Obama administration's foreign policy and flirted with a 2016 Republican presidential bid before ruling it out this summer. \nHe argued on Tuesday that the Obama administration is overvaluing the U.N.’s power in global affairs. \n“He gets misty-eyed when he gets to the U.N.,” Bolton said of Obama. “The U.N. has had nothing to do with stability or prosperity around the world, or freedom. \n“Stability — whatever limited amount we’ve had in the last 75 years — has been due to the strength of the United States,” he continued. “[It is] economically, politically, militarily and the strength of our alliances. \n“The president seems to miss that,” Bolton added. \nBolton also said that Obama’s greatest failure against Putin is in the Middle East. \n“Russia’s position now is stronger now in the Middle East than it has been for 50 years,” he said. \n“Putin is taking advantage of the vacuum our retreat is creating,” Bolton continued. “We’re just watching Putin make all that ground up.” \n“The American anti-ISIS coalition has done essentially nothing,” Bolton added of America’s efforts against the Islamic State in Iraq and Syria. \nThe former diplomat also said he would like to see the GOP's 2016 field focus more on international affairs. \n“I think it’s important that all of them talk more about national security,” said Bolton. \n“We’ve got to get beyond where they are now,” he added. “A little more thought and a little less theatrics in this debate would go a long way.”", "external_links": [], "published": "2015-09-29T21:48:00.000+03:00", "crawled": "2015-09-30T03:53:04.857+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}