{"organizations": [], "uuid": "25f983ab7eac0a4719bad18adb0b70301ab99533", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2300450/images/o-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/john-seager/republican-attacks-on-abo_b_8197764.html", "country": "US", "title": "Republican Attacks on Abortion Are Really Just Attacks on Women's Empowerment | John Seager", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Republican Attacks on Abortion Are Really Just Attacks on Women's Empowerment | John Seager", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T23:10:00.000+03:00", "replies_count": 0, "uuid": "25f983ab7eac0a4719bad18adb0b70301ab99533"}, "author": "John Seager", "url": "http://www.huffingtonpost.com/john-seager/republican-attacks-on-abo_b_8197764.html", "ord_in_thread": 0, "title": "Republican Attacks on Abortion Are Really Just Attacks on Women's Empowerment | John Seager", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Behind all the bluster, Republicans have a hidden agenda when it comes to abortion. If they really wanted to reduce the number of abortions here in the US and around the world, they'd clamor for more funding for family planning. Instead, they're doing everything possible to torpedo vital programs across the board.\nThat's because the GOP covets the support of cranky OWGs (Old White Guys) more than it cares about the health needs of women. (Full disclosure: I'll turn 65 in a few weeks, and I am white. While proudly progressive, I can get cranky, especially when reading the news.)\nNone other than Senator and White House aspirant Lindsey Graham told The Washington Post in 2012 that the GOP is \"not generating enough angry white guys to stay in business for the long term.\" Apparently, he and his fellow candidates have no \"Plan B.\"\nAnd I'll go out on a limb and say that the GOP and its base of OWGs are absolutely terrified of a future that is younger, more diverse, and enables women to achieve their full potential. Heck, Republicans can't even deal with the present. That is why abortion and contraception--which provide women with the ability to determine the trajectory of their lives--are the greatest threats to the OWG and, in turn, GOP power structure.\nThe ongoing Planned Parenthood debacle is just the latest example of how Republicans are using abortion as an excuse to stop the rise of the modern, independent woman. Although abortion only comprises a small fraction of the organization's services, the GOP has used the procedure as a pretext to launch a despicable smear campaign based on deceptively edited videos and other fraudulent tactics aimed at shuttering Planned Parenthood clinics across the country. They're doing this with the full knowledge that millions of women depend on the organization for vital and often lifesaving reproductive health services.\nSo, who is the GOP actually targeting--Planned Parenthood, abortion, or women?\nAnd if Republicans really do care about reducing the number of abortions why aren't they expanding access to contraceptives and comprehensive sex education? Why are they, instead, taking every opportunity to restrict the ability of women everywhere to choose the best contraceptive method for themselves?\nI'll tell you why: Because giving women the power to decide their own reproductive destinies levels the playing field. It empowers women to do something that men have been doing since the beginning of time: engage in sexual activity without fear of pregnancy. Not surprisingly, a woman who is able to choose when and if to have a baby is much more likely to obtain an education, launch a career, and gain financial independence than a woman who is forced to give birth.\nBut that doesn't matter to the GOP and its hardcore constituency because, in their opinion, women who have sex (whether by choice or by force) are automatically consenting to motherhood. It's an incredibly anti-woman mindset that shames women for having intercourse and then punishes those who decide to end a pregnancy.\nNot long ago, GOP presidential candidate Bobby Jindal actually likened women who have abortions to criminals :\n\"[I]f we're giving criminals their basic rights and they have to be informed of those rights, it seems to me only common sense we would have to do the same thing for women before they make the choice about whether to get an abortion.\"\nOther GOP candidates took it a step further: Mike Huckabee defended Paraguay's decision to deny an abortion to a 10-year-old girl raped and impregnated by her stepfather. Basically, an individual who is in the running to become one of the most powerful leaders in the world wants a sexually-molested child to risk her life in order to give birth to her rapist's baby. Let that sink in for a minute.\nBut it's the hypocrisy of some Republican lawmakers that really hits home for me. Like when Representative Scott DesJarlais supported his ex-wife's decisio n to have two abortions and then pressured his mistress to have one, even though he consistently votes in favor of abortion bans.\nThe most frustrating aspect of this all, however, is that the GOP's attempts to do away with abortion are completely illogical on its part. Shutting down abortion clinics, and Planned Parenthood in particular, does nothing except prevent women from accessing birth control--thereby increasing the demand for abortion--and turn a safe, legal procedure into an unsafe one.\nDesperate people take desperate measures. And even outright bans on abortion don't stop women from terminating unplanned pregnancies ( just look at what's happening in El Salvador, where pregnant women are ingesting rat poison). When abortion is illegal the only thing that changes is that women must risk their lives to opt out of childbirth.\nThe GOP knows this, and yet it continues to go on an anti-abortion warpath that puts women's lives and well-being at risk. It's time for Republicans to come down from their paternalistic preachy perch. They're betting that victory can be gained by trampling on the rights of women. But, some of us--in fact, millions of us, men and women alike--will never stop fighting for progress.\nMore: Population Connection Population Connection Action Fund John Seager Republicans GOP Abortion Planned Parenthood Family Planning Population Women's Rights", "external_links": ["http://thinkprogress.org/health/2011/07/07/262314/jindal-signs-anti-choice-bill-compares-women-who-receive-abortions-to-criminals/", "http://www.washingtonpost.com/news/morning-mix/wp/2015/05/16/congressman-who-advised-ex-wife-to-seek-abortion-votes-for-late-term-abortion-ban/", "http://www.who.int/reproductivehealth/publications/general/lancet_3.pdf", "https://www.amnesty.org/en/latest/news/2014/09/twelve-facts-about-abortion-ban-el-salvador/", "http://thinkprogress.org/election/2015/08/16/3692100/huckabee-paraguay-rape-abortion/", "http://www.washingtonpost.com/politics/2012/08/29/b9023a52-f1ec-11e1-892d-bc92fee603a7_story.html"], "published": "2015-09-25T23:10:00.000+03:00", "crawled": "2015-09-25T23:22:27.977+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}