{"organizations": [], "uuid": "083fc256f5540b917c51284075de1b1fda3e8867", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1461613/images/o-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/religion/blog.xml", "section_title": "Religion Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/christian-piatt/no-one-is-pro-abortion-an_b_7957558.html", "country": "US", "title": "No One Is Pro-Abortion (and Few Are Fully Pro-Life) | Christian Piatt", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 4, "title_full": "No One Is Pro-Abortion (and Few Are Fully Pro-Life) | Christian Piatt", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-08T00:01:00.000+03:00", "replies_count": 3, "uuid": "bfa4bb94db624663573fa79965f7b9c4a7f7e3d6"}, "author": "Christian Piatt", "url": "http://www.huffingtonpost.com/christian-piatt/no-one-is-pro-abortion-an_b_7957558.html#post-0", "ord_in_thread": 0, "title": "No One Is Pro-Abortion (and Few Are Fully Pro-Life) | Christian Piatt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'm not the only one who is frustrated with, and even a little bit exhausted by, the \"Pro life\" versus \"Pro Choice\" debate. I've spent a good deal of time trying to wade through all of the issues, and why I feel how I do about it. And I've arrived at three reasons I find the whole dialogue - if you can call it that - terribly wanting.\n1. The Debate is Inherently (and Ironically) Dehumanizing . Like many debates about important social issues, passions get easily enflamed and rhetoric grows harsh as people establish their lines of defense and entrench themselves in their respective camps. More often than not, the argument seems to be reduced to politics, talking points and shouting down the other side. But in fact, at the hearts of it all is not an issue; we're talking about people's lives. And while we're protesting, debating and fighting about who is right and wrong, we expend time, energy and resources that could be directed both to the very people in need, as well as the much more deeply embedded and complex systemic problems in our society that lead to the needs in the first place.\nDon't get me wrong; there is a time and a place for reasoned, respectful debate. But unless you've tuned into a reality I've missed, there is little reason or respect in the shouting matches that result. If we truly care about the lives we're fighting so hard for (born or unborn), it seems that we should first be willing to honor and hold precious the lives of those who disagree with us, however passionately.\n2. \"Pro Life\" and \"Pro Choice\" Doesn't Represent Most People . Like many two-sided fights, it ends up feeling like there are only two choices, and we have to pick one or the other to affiliate ourselves with. But most Americans actually don't identify with either label . So many of us end up feeling like we're on the outside looking in on a debate that doesn't include us in the conversation, if there even is an actual back-and-forth conversation. Most of us identify with something from both sides, or aren't even sure how we feel or what we believe. But with so much vitriol surrounding the subject, it feels like there are few, if any, safe spaces in which to actually talk about it without being attacked or judged.\n3. The Pro-Life Position Feels Disingenuous to Many People . It's generally assumed that the Pro-Life position is owned and driven primarily by Christians. And while this may be true, the standard pro-life agenda does not represent the belief of all Christians. In fact, there are some faith leaders within Christianity who vocally and openly criticize what they see as the problems with the arguments made on behalf of a pro-life position based on one's faith. One example is author and activist Shane Claiborne, who identifies as pro-life, but without the anger, clinic bombings and shouting. In his own, even-keeled way, he suggests that one can't call themselves pro life without also being equally activist about matters like ending the death penalty, reducing the proliferation of guns in our culture, environmental stewardship, and so on.\nThen there's Sister Joan Chittister, O.S.B., who encapsulates her problem with the pro-life position in the following Quote: :\nI do not believe that just because you're opposed to abortion, that that makes you pro-life. In fact, I think in many cases, your morality is deeply lacking if all you want is a child born but not a child fed, not a child educated, not a child housed. And why would I think that you don't? Because you don't want any tax money to go there. That's not pro-life. That's pro-birth. We need a much broader conversation on what the morality of pro-life is.\nTo work diligently for what one believes is right should be admired. But when we do so in a way that appears to be hypocritical, myopic, self-serving or tone deaf to the needs or experiences of others is to suggest to the rest of the world that winning is, in fact, the most important thing. And as such, don't be surprised when the lion's share of other people stop paying attention.\nBecause while you're fighting so hard to win, so many others end up losing.\nChristian Piatt is the author of postChristian and Blood Doctrine , his first novel. He is the founder and cohost of the Homebrewed CultureCast podcast and blogs on the Patheos Progressive Christian Channel .\nFollow Christian Piatt on Twitter: www.twitter.com/christianpiatt\nMore: Abortion Civil Rights Pro Life Pro Choice Shane Claiborne Sister Joan Chittister Christian Piatt This Blogger's Books and Other Items from... Banned Questions About Jesus\nby Christian Piatt Pregmancy: A Dad, A Little Dude, and a Due Date\nby Christian Piatt", "external_links": ["http://www.amazon.com/exec/obidos/ASIN/0827202695", "http://www.amazon.com/exec/obidos/ASIN/1455573116", "http://homebrewedchristianity.com/category/culturecast/", "http://ecx.images-amazon.com/images/I/51Th8t2ht%2BL._SL160_.jpg", "http://ecx.images-amazon.com/images/I/51eHns3gtXL._SL160_.jpg", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.patheos.com/blogs/christianpiatt", "http://www.amazon.com/exec/obidos/ASIN/082723032X", "http://www.amazon.com/", "http://www.twitter.com/christianpiatt", "http://www.dailykos.com/story/2015/07/30/1407166/-Catholic-Nun-Explains-Pro-Life-In-A-Way-That-May-Stun-The-Masses", "http://www.amazon.com/exec/obidos/ASIN/1938633555", "http://www.medicaldaily.com/pulse/abortion-poll-most-americans-do-not-identify-pro-choice-or-pro-life-labels-328546"], "published": "2015-08-08T00:01:00.000+03:00", "crawled": "2015-08-08T13:33:12.821+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}