{"organizations": [], "uuid": "0fc6779783b08dbaa88a4b3b5ade73a73c3d3342", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/1138/feed", "section_title": "Foreign Policy", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/254884-obama-should-hold-xi-accountable-on-cyber-security", "country": "US", "title": "Obama should hold Xi accountable on cyber security", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama should hold Xi accountable on cyber security", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T16:30:00.000+03:00", "replies_count": 0, "uuid": "0fc6779783b08dbaa88a4b3b5ade73a73c3d3342"}, "author": "jpicard@thehill.com (former Rep. Silvestre Reyes (D-Texas))", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/254884-obama-should-hold-xi-accountable-on-cyber-security", "ord_in_thread": 0, "title": "Obama should hold Xi accountable on cyber security", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 25, 2015, 09:30 am Obama should hold Xi accountable on cyber security By former Rep. Silvestre Reyes (D-Texas) \nThe nation’s capital is frantically preparing for two major diplomatic visits this week – His Holiness Pope Francis arrives in Washington on Wednesday, and China’s president Xi Jinping will visit the White House Friday for a formal meeting with President Obama. While many of the more than 76 million Catholics will be closely watching the pope’s remarks, military officials, business leaders and intelligence analysts are sure to be rapt observers to the outcomes of the meetings with the Chinese leadership. National Security Advisor Susan Rice said Monday that “cyberespionage for economic gain by China is putting enormous strain on U.S.-China relations and needs to stop.” So often, the focus of cybersecurity and intelligence experts is on military and government security, and rightfully so. Our military is now fighting on a 21st century battlefield, and must be equipped properly to defend against both physical and virtual attacks that threaten their safety and our security. However, national security encompasses a far broader spectrum, and our policies, and in turn diplomatic efforts, must take that into account. ADVERTISEMENT Economics play a major role in ensuring that the American way of life remains safe and prosperous, and our intellectual property-heavy industry demand international protections. More than a quarter of all U.S. jobs are tied to IP-intensive industries, and stolen intellectual property and trade secrets present a direct threat to our national security. In the tech space, software has become an integral part of civilian, military and commercial life. Yet tech companies are being hammered in the Chinese market every day, victims of raids, shakedowns, and legal strong-arming that is putting U.S. competitiveness at risk. Western tech companies were summoned last month to learn that Chinese regulators are reviving cybersecurity banking regulations, which have been widely criticized for codifying open access to U.S. encryption IP and for restricting essential civil society internet freedoms. As a former chair of the House Intelligence Committee, this kind of backdoor-effort to undercut American firms and, in turn, their civilian and government employees is deeply concerning. This blatant theft and its repercussions extends throughout issues of national security concern. A 2011 report from the Office of the National Counterintelligence Executive identified agricultural technology as a target of greatest interest to Chinese spies, and the Federal Bureau of Investigation has begun to aggressively crack down on the left of food and agricultural trade secrets. Feeding our nation and our global allies lies at the core of our national security capabilities. In recent months, genetically modified seeds produced by U.S. agribusinesses have become targets of trade secret theft, and Chinese agents have been caught attempting to smuggle them out of the country and back to laboratories in China for examination and duplication. In China, anti-competitive actions have been more explicit. The Shanghai subsidiary of the Aurora, Illinois based food processor OSI Group was raided last summer under allegations of food safety violations, raising significant concerns of trade secret theft from a company with a more than 20 year track record of safety in a country where food supply safety has been a major deficit for domestic producers. Its employees still remain in jail without charges being brought against them. For that case, more than trade secrets were victims of Chinese actions. The U.S.-China bilateral relationship is vast and complex. The world’s two largest economies in its fastest growing region are linked, inextricably, by trade and military ties among many others. The agenda will for this week’s meetings will naturally be packed, and rightfully so. Yet intellectual property theft and the threat it poses to our national security must feature as a major part of this dialogue. Every day that it is allowed to run rampant in the Chinese market is a day that the United States grows weaker economically and militarily. American businesses and employees, farmers and ranchers and everyday civilians who depend on the federal government to look out for the security of their country, are depending on President Obama to make this meeting an effective one. Reyes served in the House from 1997 to 2013.", "external_links": [], "published": "2015-09-25T16:30:00.000+03:00", "crawled": "2015-09-26T02:40:47.531+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}