{"organizations": [], "uuid": "412283345dfb8fe6ac47ebcfdfc2d65106aff70e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e4ebc717000043015691e0.jpeg", "site_section": "http://www.huffingtonpost.com//feeds/verticals/politics/index.xml", "section_title": "Politics - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/barack-obama-columbia_55e4eb6ee4b0b7a9633a0ebf", "country": "US", "title": "Obama Has Not Finalized Post-Presidential Plans, Despite Columbia Rumor", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Has Not Finalized Post-Presidential Plans, Despite Columbia Rumor", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-01T03:10:00.000+03:00", "replies_count": 0, "uuid": "412283345dfb8fe6ac47ebcfdfc2d65106aff70e"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/barack-obama-columbia_55e4eb6ee4b0b7a9633a0ebf", "ord_in_thread": 0, "title": "Obama Has Not Finalized Post-Presidential Plans, Despite Columbia Rumor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Obama Has Not Finalized Post-Presidential Plans, Despite Columbia Rumor Columbia's student newspaper quoted Columbia President Lee Bollinger as telling a school convocation: \"We look forward to welcoming back our most famous alumnus, Barack Obama, in 2017.\" Posted: 08/31/2015 08:10 PM EDT \nWASHINGTON, Aug 31 (Reuters) - President Barack Obama has made no final decisions about what he will do after leaving office, the White House said on Monday, following comments by Columbia University's president that he looked forward to welcoming Obama back to campus in 2017. \n\"The President has long talked about his respect for Columbia University and his desire to continue working with them,\" the White House statement said in response to a Reuters query. \"However, at this point no decisions have been finalized about his post-Presidency plans.\" \nObama graduated from the New York school in 1983. Columbia was also among the contenders for Obama's presidential library, which will be built in his hometown of Chicago. ASSOCIATED PRESS \nThe Columbia Daily Spectator student newspaper quoted Columbia President Lee Bollinger as telling a school convocation: \"We look forward to welcoming back our most famous alumnus, Barack Obama, in 2017.\" \nThe comments stirred speculation on social media about Obama's career plans after he leaves the White House in January 2017. \nBut the university, in a statement issued later on Monday, said Bollinger's comment \"only reiterated the May 12 statement by the Barack Obama Foundation that it 'intends to maintain a presence at Columbia University for the purpose of exploring and developing opportunities for a long term association' and reflected no further developments concerning President Obama's plans.\" (Reporting by Peter Cooney; Editing by Lisa Lambert)", "external_links": [], "published": "2015-09-01T03:10:00.000+03:00", "crawled": "2015-09-01T03:30:28.856+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}