{"organizations": [], "uuid": "e60cdc6affdd1c4a40cfcb015cc053656c168e52", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_xi09252015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/29764/feed", "section_title": "The Hill: Cybersecurity", "url": "http://thehill.com/policy/cybersecurity/254921-obama-raises-trade-human-rights-in-xis-welcome", "country": "US", "title": "Obama raises trade, human rights in Xi's welcome", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama raises trade, human rights in Xi's welcome", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T17:36:00.000+03:00", "replies_count": 0, "uuid": "e60cdc6affdd1c4a40cfcb015cc053656c168e52"}, "author": "cbennett@thehill.com (Cory Bennett)", "url": "http://thehill.com/policy/cybersecurity/254921-obama-raises-trade-human-rights-in-xis-welcome", "ord_in_thread": 0, "title": "Obama raises trade, human rights in Xi's welcome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama raises trade, human rights in Xi's welcome Getty Images By Cory Bennett - 09/25/15 10:36 AM EDT \nAmid the pomp of Chinese President Xi Jinping’s state visit welcome, President Obama took a brief moment Friday morning to acknowledge the ongoing trade discrepancies and human rights disagreements between the two countries. “Even as our nations cooperate, I believe — and I know you agree — that we must address our differences candidly,” Obama said from the South Lawn of the White House shortly after Xi’s arrival. “The United States will always speak out on behalf of fundamental truths.” ADVERTISEMENT “We believe that nations are more successful, and the world makes more progress, when companies compete on a level playing field, when disputes are resolved peacefully and when the universal human rights of all people are upheld,” Obama said. Hacking allegations, discriminatory regulations and human rights concerns have shadowed Xi’s first state visit to Washington. Congressional Republicans and GOP White House hopefuls have pressed Obama to use the meetings with Xi to take a more stringent approach with the Asian power on these topics. Several candidates even called on the administration to downgrade, or even cancel, the event. But Obama stuck by his decision to welcome Xi with all the trappings of a full state visit, including military marches, music and a 21-gun salute. Xi avoided directly addressing trade concerns or human rights in his remarks. The Asian leader simply said, through a translator, that both countries must “encourage our two societies to meet each other halfway and cement the social foundation of China-U.S. relations.” Both leaders were otherwise cordial and friendly during brief opening remarks before a series of formal meetings and a state dinner Friday night. Obama joked that first lady Michelle Obama’s trip across China last year had overshadowed his own state visit, during which China and the U.S. sealed a major climate change agreement to reduce carbon emission. “I’m told that news about Michelle’s trip got some got some 1 billion views online,” Obama said, turning to his counterpart. “President Xi, I believe we’re both accustomed to being outshone by our dynamic spouses.” For his part, Xi recounted a return visit in 2012 to a family that had hosted him in Muscatine, Iowa, nearly 30 years ago on an agricultural research trip. \n“From these old friends, and from many other American friends, I can feel, firsthand, the genuine friendship between the Chinese and American people,” he said. “We do share each other’s feelings. And this gives me every confidence about the future relations.”", "external_links": [], "published": "2015-09-25T17:36:00.000+03:00", "crawled": "2015-09-25T20:38:34.286+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}