{"organizations": [], "uuid": "8455b908abdb4c7a526de432d5b0c2c4f45c6279", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150807154418-chuck-schumer-barack-obama-large-169.jpg", "site_section": "http://www.rssmicro.com/rss.web?q=Obama", "section_title": "Obama", "url": "http://edition.cnn.com/2015/08/10/opinions/louis-schumer-iran-deal/index.html", "country": "US", "title": "Schumer's careful break with Obama on Iran deal", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Schumer's careful break with Obama on Iran deal", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-10T16:02:00.000+03:00", "replies_count": 0, "uuid": "8455b908abdb4c7a526de432d5b0c2c4f45c6279"}, "author": "", "url": "http://edition.cnn.com/2015/08/10/opinions/louis-schumer-iran-deal/index.html", "ord_in_thread": 0, "title": "Schumer's careful break with Obama on Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Schumer's careful break with Obama on Iran deal By Errol Louis , CNN Political Commentator Updated 1333 GMT (2033 HKT) August 10, 2015 JUST WATCHED Obama: U.S. credibility on the line with nuclear deal 03:24 Story highlights Errol Louis: Sen. Chuck Schumer disagreed with Iran deal but didn't burn bridges to White House He says Schumer was wise not to stir up opposition among other Democratic senators Errol Louis is the host of \"Inside City Hall,\" a nightly political show on NY1, a New York all-news channel. The opinions expressed in this commentary are solely those of the author. (CNN) Even if you don't agree with Sen. Chuck Schumer's decision to oppose President Barack Obama's proposed nuclear non-proliferation deal with Iran, you have to admire his skill at carefully walking through a political minefield without surrendering his power, his principles or his political future. On a pending vote that puts at stake everything Schumer cares about -- American national security, the safety of Israel and the power and prestige of the Democratic Party -- the senior senator from New York decided not to play it safe. Errol Louis \"When it comes to the non-nuclear aspects of the deal, I think there is a strong case that we are better off without an agreement than with one,\" Schumer said in an official statement that grudgingly praised the nuclear containment provision of the proposed deal while expressing concern that lifting sanctions on Iran will give the regime billions of dollars to foment global terrorism. \"Restrictions should have been put in place limiting how Iran could use its new resources,\" Schumer said. By partly praising and partly condemning the deal, Schumer showed himself to be thoughtful -- no one doubts whether this well-known policy wonk personally read through every page of the thick diplomatic document -- and muted in his criticism of the White House's main goal of slowing and containing Iran's nuclear program. The careful criticism extends to Schumer's timing. Curbing his famous skill at maximizing press coverage (\"the most dangerous place is between him and a camera,\" ex-Sen. Bob Dole once quipped , Schumer's quiet release of his opposition signaled he will not be rounding up votes to block the deal. In fact, Schumer took the unusual step of canceling a scheduled public appearance the day after his statement's release. JUST WATCHED", "external_links": [], "published": "2015-08-10T16:02:00.000+03:00", "crawled": "2015-08-10T16:13:09.262+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}