{"organizations": [], "uuid": "7cd4004c2b5fe8a771fd277da164f55d7c0eeac7", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150721170033-planned-parenthood-sting-video-foreman-live-lead-00011911-large-169.jpg", "site_section": "http://news.google.com/news?pz=1&cf=all&ned=us&hl=en&q=video&cf=all&output=rss", "section_title": "video - Google News", "url": "http://edition.cnn.com/2015/08/19/politics/planned-parenthood-seventh-video/", "country": "IL", "title": "Anti-abortion group releases seventh Planned Parenthood video - CNN", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Anti-abortion group releases seventh Planned Parenthood video - CNN", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-19T23:21:00.000+03:00", "replies_count": 0, "uuid": "7cd4004c2b5fe8a771fd277da164f55d7c0eeac7"}, "author": "", "url": "http://edition.cnn.com/2015/08/19/politics/planned-parenthood-seventh-video/", "ord_in_thread": 0, "title": "Anti-abortion group releases seventh Planned Parenthood video - CNN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What's next in Planned Parenthood fight? 05:57 (CNN) The group that is accusing Planned Parenthood of breaking federal laws in its abortion procedures released their seventh video Wednesday. The Center for Medical Progress, a California-based anti-abortion group, published a heavily edited video featuring undercover footage, on-camera interviews and a CNN appearance from CMP leader Daniel Daleiden accusing Planned Parenthood of altering its abortion procedure to acquire intact fetuses. \"Today's video contains heartrending admissions about the absolute barbarism of Planned Parenthood's abortion practice and baby parts sales in which fetuses are sometimes delivered intact and alive,\" Daleiden said in a statement. \"Planned Parenthood is a criminal organization from the top down and should be immediately stripped of taxpayer funding and prosecuted for their atrocities against humanity.\" The group has released other videos of its undercover recordings that it claims are unedited. Planned Parenthood on Wednesday repeated its previous statements denying all of Center for Medical Progress' accusations. \"The group behind these videos has close ties with organizations and individuals who have been linked to the firebombing of abortion clinics and threats to the physical safety of doctors who provide abortion,\" said Eric Ferrero, Vice President of Communication, Planned Parenthood Federation of America. \"The real agenda of these baseless attacks has become totally clear: to ban abortion and limit women's access to reproductive health care at Planned Parenthood. The vast majority of the public rejects this extreme political agenda and rejects the fraudulent campaign behind it.\" The Center for Medical Progress has alleged Planned Parenthood is selling organs and tissue from aborted fetuses, which is against federal law. The videos have lead multiple Republican presidential candidates to call for Planned Parenthood's defunding and have lead to multiple congressional and state level investigations into both Planned Parenthood and the Center for Medical Progress . Anti-abortion group releases fifth Planned Parenthood video The latest video features Dr. Deborah Nucatola, Planned Parenthood's senior director of medical services, discussing abortion procedures. \"I knew which were the cases that were probably more likely to yield what we needed and I made my decisions according to that,\" she said. \"So it's worth having a huddle at the beginning of the day and that's what I do.\" Also in the video, Melissa Farrell, director of research for Planned Parenthood Gulf Coast, discusses the relationship between altering abortion procedures to get the most intact organs possible and costs. Third Planned Parenthood video released as Senate Republicans seek to end funding \"If we alter our process and we are able to obtain intact fetal cadavers then we can make it part of the budget,\" she said. \"It's all just a matter of line items.\" New York University bioethicist Art Caplan previously told CNN altering the abortion procedure in a way to preserve body parts is against medical ethics. \"In abortion the primary goal is to give the safest abortion possible,\" he said. \"Your sole concern has to be the mother and her health. Holly O'Donnell, a former procurement technician for StemExpress, a biomedical research company, said she saw evidence of Planned Parenthood aborting intact fetuses and StemExpress sending it to the research lab. \"This is the most gestated fetus and closest thing to a baby I've ever seen,\" she said. \"I'm sitting here looking at this fetus and it's heart is beating and I don't know what to do.\" O'Donnell is featured prominently in CMP's \"Human Capital\" video series, and has described herself as \"pro-life\" in the clips. The video also features a phone call with Ben Van Handel, executive director of a California-based Novogenix Laboratories, a biomedical company that provides fetal tissue to researchers. \"There are times when after the procedure is done that the heart is still beating,\" Van Handel said. CNN has reached out to Novogenix for comment. California allows abortions up until viability, which is determined on a case by case basis. Some doctors believe that viability happens between 22 and 24 weeks with others arguing that a fetus is able to feel pain as early as 20 weeks . CNN contacted StemExpress Wednesday for a response to the latest video. StemExpress previously denounced O'Donnell and CMP's accusations. \"CMP's continued efforts to malign StemExpress — a life sciences company that predominantly supplies adult cells, blood and tissue to the nation's leading researchers — will only serve to slow the pace of life-saving medical research aimed at curing disease and extending quality of life for millions of Americans,\" the organization said in a statement. The company severed ties with Planned Parenthood last week in response to the ongoing investigations. \"We value our various partnerships, but due to the increased questions that have arisen over the past few weeks, we feel it prudent to terminate activities with Planned Parenthood,\" Stem Express said in a statement. \"While we value our business relationship with Planned Parenthood, that work represents a small percentage of our overall business activity and we must focus our limited resources on resolving these inquiries.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-08-19T23:21:00.000+03:00", "crawled": "2015-08-20T05:38:39.126+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}