{"organizations": [], "uuid": "9a75e7740a3638025be4e1d0fc02a321dbde525b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamacheney.png", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/252551-cheney-obama-rejects-american-exceptionalism", "country": "", "title": "Cheney: Obama rejects American exceptionalism | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Cheney: Obama rejects American exceptionalism | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-03T01:10:00.000+03:00", "replies_count": 0, "uuid": "9a75e7740a3638025be4e1d0fc02a321dbde525b"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/252551-cheney-obama-rejects-american-exceptionalism", "ord_in_thread": 0, "title": "Cheney: Obama rejects American exceptionalism | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 02, 2015, 02:04 pm Cheney: Obama rejects American exceptionalism By Mark Hensch Getty Images Former Vice President Dick Cheney says President Obama doesn't believe the United States is exceptional, and that separates the president from all of his predecessors. “Barack Obama doesn’t believe in an exceptional America,” Cheney told host Steve Malzberg in a Newsmax TV interview airing on Wednesday night. “If you go back 70 years … you’ll find presidents of both parties, from FDR and Harry Truman and Jack Kennedy to [Richard] Nixon and [Ronald] Reagan and the Bushes and forward … shared a basic fundamental proposition,” Cheney said. ADVERTISEMENT “[That is] that the U.S. did have a role to play in the world as an exceptional nation,” he added. “Barack Obama clearly doesn’t believe that.” Cheney said Obama’s work on a nuclear deal with Iran is proof he does not value American interests as much as former presidents. “[Obama has] an ideology or worldview that doesn’t fit reality,” he said. “The only winner out of that agreement are the Iranians, in terms of having a path ultimately to develop nuclear weapons,” Cheney argued. “They get everything in this deal, and the Israelis and Saudis and the Jordanians, the Egyptians, the Emirates, all of our friends and allies in that part of the world, are appalled with what happened,” he added. “But they also feel threatened by a nuclear-armed Iran.” Cheney also criticized Obama for slashing the nation’s defense budget amid the rise of several national security menaces abroad. “It’s a dangerous time,” he said. “We’ve seen rising threats from around the world — ISIS in the Middle East, [Russian President] Vladimir Putin on the march in Europe, the Chinese in the South China Sea. “And as these threats grow, our capacity to deal with them is being diminished because they cut some of defense budget.\" Cheney’s remarks follow Wednesday’s news that Obama's nuclear deal with Iran has secured enough support in the Senate to all but ensure its survival. Sen. Barbara Mikulski’s (D-Md.) backing ensures Obama has enough votes on his side to prevent Republicans from overriding his veto power. Congress will vote Sept. 17 on a resolution to approve or disapprove the controversial pact’s details. Tags: ", "external_links": [], "published": "2015-09-03T01:10:00.000+03:00", "crawled": "2015-09-03T01:11:02.780+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}