{"organizations": [], "uuid": "1bcd22c9900da476bedf4fe1ad2c0c355b29f566", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3427358/images/o-OBAMA-XI-CHINA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/blog.xml", "section_title": "Business Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/gilbert-b-kaplan/what-president-obama-shou_3_b_8146390.html", "country": "US", "title": "What President Obama Should Say to President Xi on Trade | Gilbert B. Kaplan", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "What President Obama Should Say to President Xi on Trade | Gilbert B. Kaplan", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-16T22:26:00.000+03:00", "replies_count": 0, "uuid": "1bcd22c9900da476bedf4fe1ad2c0c355b29f566"}, "author": "Gilbert B. Kaplan", "url": "http://www.huffingtonpost.com/gilbert-b-kaplan/what-president-obama-shou_3_b_8146390.html", "ord_in_thread": 0, "title": "What President Obama Should Say to President Xi on Trade | Gilbert B. Kaplan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What are President Obama's goals in the international trade area when President Xi visits the United States next week? I worry that there is not one among them that will change the U.S. trade picture in the next year, five years or 10 years. And unfortunately, when we look at the trade relationship with China, there is much that needs to be changed. For the most part over the last six years, things have gotten worse, not better. Our manufacturing trade deficit with China has expanded from $227 billion to about $350 billion, key industries in the U.S., such as electronics and steel are under continuing threat, and currency manipulation has continued unabated.\nThe question then is, what should we do now to turn this picture around, or is it already too late?\nIf someone were asking me, these are the goals on trade I would set for the Xi summit. First, reach an agreement on currency manipulation practices by the Chinese. Or at least begin the negotiation of one. For years, the Chinese have kept their currency undervalued, which makes their goods artificially cheap in the U.S. market and our goods artificially expensive in theirs, expanding the trade deficit and harming the U.S. jobs base, particularly in manufacturing. Despite years of complaints, the Chinese recently devalued their currency again to try to prime the pump in their economy. We should request, I would even say require, an agreement with them to prevent currency manipulation. We should make it clear that there will be consequences in terms of our trade relationship if they will not negotiate this agreement.\nSecondly, China continues its practices of vast subsidization in the form of grants, cheap loans, tax benefits, free land, low cost energy, and low cost input products. These subsidies are given to a host of industries where China competes with the U.S., such as steel, solar, pipe, electronics, and energy. The President should make clear that these subsidies are not in compliance with China's commitments under international agreements and that they must be curtailed. He should be prepared to take action if these subsidy measures are not curtailed.\nAnother big problem in the technology space is the closed Chinese internet market. China has shut out Google, Facebook and Twitter for years, and other major U.S. and non-Chinese internet companies have very limited access in China. While our companies are shut out, China nurtures its own clones who take full advantage of China's largest in the world internet market. The prime example is the China-based search engine Baidu, which has little presence outside China but has done well in the closed Chinese internet market thanks to the government's help. Internet companies are the kind of highly creative spaces that bring out the best in American ingenuity and dynamism. We are losing enormous economic potential there, and the President needs to press President Xi to fully open the internet to U.S. companies.\nOn September 10, Dell announced it was going to greatly expand manufacturing operations in China and would create one million jobs there, investing $125 billion. For people in the U.S. concerned about our manufacturing base this was a bad message. Why can't Dell put those plants and jobs here? I think this points to two other trade problems with China. One is the forced technology transfer and import substitution policies of China. What China is saying to our high-tech companies is that if you want to access the large Chinese market you have to locate in China. This is a blatant market access barrier President Obama should address.\nSecondly, it demonstrates the tremendous fear of retaliation faced by U.S. companies who do some business in China. The message continually goes out from Chinese government officials, sometimes quietly and sometimes less quietly, that foreign companies will be penalized if they don't adhere to the Chinese program of technology transfer and localization, or if, heaven forbid, they were to raise a trade complaint against China at the WTO or with their own governments. The WTO and U.S. law have provisions for bringing legal actions to stop unfair trade, but companies who are already in China or need to access that market are afraid to pursue this course because of retaliation.\nRetaliation can consist of an inability to get standard business permits or electricity hook-ups or construction work done. It can also consist of the theft of intellectual property or even arrest of key executives. If the Chinese government thinks you should be disfavored, you are in trouble. That's not the way the world trading system is supposed to work.\nOverall, President Obama has to rethink our policy on China trade issues, taking a much more assertive tack and defending U.S. companies more vigorously. In my view, he should start a \"Team B,\" independent of his existing China advisers, to look hard at all the options. Such a Team B would start with a clean slate, ask where are we on this issue, where do we need to go, and how do we get there. That's what President Reagan did when faced with the lack of progress with what was then the Soviet Union. It turned out to be a very valuable strategy, because instead of burrowing down the same dry wells, some new approaches were taken that made a world of difference.\nAlong with the formation of a Team B on China, President Obama should initiate the above steps with President Xi. We don't want the manufacturing trade deficit with China to reach half a trillion dollars any time soon, but that's where it's headed now.\nMore: Barack Obama Chinese President Xi Jinping Trade Currency Manipulation Obama Xi Summit", "external_links": [], "published": "2015-09-16T22:26:00.000+03:00", "crawled": "2015-09-16T22:07:38.745+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}