{"organizations": [], "uuid": "0318c8fda5b94e1241a3f014d63fcb98ca9cd6b0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarackgolf_080914getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/blogs/blog-briefing-room/news/251457-obama-talks-trash-on-the-golf-course-according-to-nbas-steph", "country": "US", "title": "Obama talks trash on the golf course, according to NBA's Steph Curry", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama talks trash on the golf course, according to NBA's Steph Curry", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-19T19:51:00.000+03:00", "replies_count": 0, "uuid": "0318c8fda5b94e1241a3f014d63fcb98ca9cd6b0"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/251457-obama-talks-trash-on-the-golf-course-according-to-nbas-steph", "ord_in_thread": 0, "title": "Obama talks trash on the golf course, according to NBA's Steph Curry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 19, 2015, 12:51 pm Obama talks trash on the golf course, according to NBA's Steph Curry By Jordan Fabian \nPresident Obama apparently showed his competitive streak during a golf match against Steph Curry, the National Basketball Association’s most valuable player. ADVERTISEMENT Obama and NBA sharpshooter Ray Allen squared off against a team of Curry and his father, Dell, last Friday on Martha’s Vineyard.\nEven though the president is on vacation, the match at Farm Neck Golf Club in Oak Bluffs, Mass. was far from relaxing, Curry said. \n“The president was talking trash,” the Golden State Warriors star said Tuesday during an appearance on “Jimmy Kimmel Live.” “He tries to get in your head and take your mind off your swing.” \nCurry said Obama would not allow him to take “gimmes” on short putts, which is customary for a competitive match. But Curry said the president constantly put pressure on him not to miss. \n“He’d be crickets, just silent, looking at you like, ‘All right, you’re going to mark your putt? All right, you’re going to make that?’ Put the pressure on you, that type of deal,” he told Kimmel. “Talk about you’re shaking and all that kind of stuff.” \nObama didn’t just needle his opponents. The commander in chief also made fun of Allen for needing “a bus for all the people he brought to the course” to meet him, according to Curry. \nThe 27-year-old guard also joked it was hard to relax during the round because there were \"25 Secret Service agents on every hole.” \nGolf has been one of Obama's top pastimes during his 16-day family vacation. He has played seven rounds so far with partners including former President Bill Clinton and comedian Larry David. \nEarlier this year, Curry led the Warriors to their first NBA championship since 1975. But he couldn’t duplicate his success on the golf course. \n“On the 18th hole, I triple-bogeyed the last hole and lost the match for us. But hopefully there’s a rematch,” he said. \n“It’s probably for the best, though, because you don’t want to get audited or something like that,” Kimmel joked. “You don’t want to mess with the president. You could end up in a great deal of trouble.”", "external_links": [], "published": "2015-08-19T19:51:00.000+03:00", "crawled": "2015-08-20T00:54:34.719+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}