{"organizations": [], "uuid": "4ff7aaa9c7449bf34cf90bcd3e61c61a723b06b4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3389690/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/max-stier/its-not-too-late-for-obam_b_8117404.html", "country": "US", "title": "It's Not Too Late for Obama to Improve Government Efficiency | Max Stier", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "It's Not Too Late for Obama to Improve Government Efficiency | Max Stier", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-11T03:17:00.000+03:00", "replies_count": 0, "uuid": "4ff7aaa9c7449bf34cf90bcd3e61c61a723b06b4"}, "author": "Max Stier", "url": "http://www.huffingtonpost.com/max-stier/its-not-too-late-for-obam_b_8117404.html", "ord_in_thread": 0, "title": "It's Not Too Late for Obama to Improve Government Efficiency | Max Stier", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This was originally published in The Washington Post .\nPresident Obama has reached the point when a president's thoughts turn to how he will spend his time after he leaves office, and he has reportedly suggested that one item on his agenda will be making the federal government more effective.\nThis is an ironic twist for someone who promised some 6½ years ago to restore faith in our government and make it \" cool again .\" After all this time as the nation's chief executive, he plans to make the government better after leaving office?\nImagine if the president had brought greater urgency and follow-through to addressing the government's significant management and operational challenges early in his administration, when he was best positioned to implement reforms critical to effective government.\nPerhaps he could have avoided the botched rollout of HealthCare.gov , the online portal for his signature domestic policy achievement. Perhaps he could have kept better tabs on the Department of Veterans Affairs , which became mired in a scandal over falsified wait times for patient care and other lapses.\nOr perhaps he could have been more attuned to the deterioration of discipline at the Secret Service that led to an embarrassing sex scandal, or more aggressive about recruiting cybertalent and installing safeguards that might have prevented the theft of sensitive information on 21.5 million people from the Office of Personnel Management . All of these missteps have reinforced the perception that government cannot do anything right.\nBut it is not too late for the president to improve government efficiency and lay the groundwork for a successful transition to the next administration. Waiting until he leaves office would waste an important opportunity.\nFor starters, the president should acknowledge and embrace the fact that he is the leader of a 2 million-person civilian workforce , not just the boss of the few hundred people who work at the White House. He should hold frequent Cabinet meetings and use them to reinforce the importance of strong management by his top leaders. If a positive performance environment is being created and first-rate customer service is being delivered by an agency, he should reward it; if not, he must hold his leadership team accountable.\nSecond, good management depends on good people, and the president should make it clear to agency leaders that it is their responsibility to be involved in recruiting highly qualified individuals to government. Almost a third of the federal workforce will be eligible to retire within the next two years, providing an opening to restock the government with young, new talent. The government should make use of student internships and other recruiting tools to build a strong pipeline for high-achieving, tech-savvy workers.\nAt the moment, the government is falling behind. Those under age 30 make up just 6.6 percent of the federal workforce, and this percentage is falling. This compares unfavorably with the entire U.S. workforce, of which 23.5 percent are under 30.\nThird, the president should emulate the best-managed private-sector entities by encouraging a \"culture of recognition\" throughout government. Today, the federal workforce is risk averse, and for good reason. If an idea fails or something goes wrong, an individual's career can be ruined. If something is done right, no one notices. It is difficult to imagine how a private-sector corporation could thrive or even survive with such a culture.\nFourth, the president should aggressively pursue a major modernization of the rules of government employment, many of which date to 1949. Pay should be determined by the market. Hiring and firing processes need to be streamlined, and there should be fewer layers of political appointees. Making progress on these issues will require leadership from the White House and intense prodding of Congress.\nFinally, it is time to begin preparing for the transition of power. The work that needs to be done cannot be completed in the next 17 months. The president should make sure the January 2017 handoff is smooth, so the next administration is positioned to continue this critical work without the usual interruption created by election cycles.\nIt is incumbent on the president to make up for lost time by investing -- while he still has the power to deliver results -- more of his energy and clout in improving how government works. In the process, he can help restore faith in the government's ability to meet the needs of the American people.\nPresident Obama is to be commended for identifying government effectiveness as an issue of importance. But if he wants to make a difference, the time is now.\nMax Stier is president and chief executive of the Partnership for Public Service .\nMore:", "external_links": ["https://www.washingtonpost.com/opinions/its-not-too-late-to-improve-government-efficiency/2015/09/02/6827e9b2-50a6-11e5-8c19-0b6825aa4a3a_story.html", "http://www.nytimes.com/2015/07/10/us/office-of-personnel-management-hackers-got-data-of-millions.html", "https://www.healthcare.gov/", "http://www.gao.gov/products/GAO-14-215", "http://www.politico.com/blogs/ben-smith/2008/09/obama-plans-to-make-government-cool-again-011772", "http://www.nytimes.com/2015/08/17/us/politics/with-high-profile-help-obama-plots-life-after-presidency.html", "http://www.va.gov/", "http://www.washingtonpost.com/politics/secret-service-agents-investigated-for-late-night-car-accident-at-white-house/2015/03/11/9c853906-c7ff-11e4-a199-6cb5e63819d2_story.html", "http://ourpublicservice.org/publications/viewcontentdetails.php?id=556", "https://www.opm.gov/", "http://www.fedscope.opm.gov/ibmcognos/cgi-bin/cognosisapi.dll?b_action=powerPlayService&m_encoding=UTF-8&BZ=1AAABlrfySZF42n2QTW_DMAyG~0xMt8MqxxANDhxCQlWktXSF_8Ro2lXjo6Jc_u_XwKFbD3stx9brx5IVr8iXRZnv00zH17EfTKafgOgcKCKOSuuVoOA19MPA5zoKiHzJRUKRZZ49t5vKvVrvZLmOgVZ1342mG2137JuDGUAkEGBXtQZ8vdhV9Xd1MtePtL00~a215AKEtvRlnvzF7xQQvtjcVEP9ZSshF27R04Vaqny7TVWZ2SI3afzvkpe8x0dExhGRc2SMIRPICJkLxuTJdPXNwkAH_8qmAYze_roaz333YDOgEMi3nuFAn_C_xBn8brBJ1nP4L~Eppm4_Zsr5hFk~ZEtmkw%3D%3D", "http://ourpublicservice.org/"], "published": "2015-09-11T03:17:00.000+03:00", "crawled": "2015-09-11T05:17:07.600+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}