{"organizations": [], "uuid": "80e59972b2b194bb446564ab64828e23457ecc02", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarackgolf_082314getty_0.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/250742-obama-golfs-with-world-bank-chief", "country": "US", "title": "Obama golfs with World Bank chief", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama golfs with World Bank chief", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-10T20:57:00.000+03:00", "replies_count": 0, "uuid": "80e59972b2b194bb446564ab64828e23457ecc02"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/250742-obama-golfs-with-world-bank-chief", "ord_in_thread": 0, "title": "Obama golfs with World Bank chief", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama golfs with World Bank chief Getty Images By Jordan Fabian - 08/10/15 01:57 PM EDT \nAfter taking a day off from the golf course, President Obama took advantage of a warm, sunny Monday and retuned to the links. \nObama is playing golf at the Vineyard Golf Club with World Bank President Jim Yong Kim, former Clinton administration official and private equity investor Glenn Hutchins and Cyrus Walker, a cousin of White House senior adviser Valerie Jarrett. ADVERTISEMENT All are frequent golf partners of the president.\nObama mixed things up on his first day of vacation Saturday, inviting comedian Larry David to play in his foursome. \nThe president is on a two-week vacation in Martha’s Vineyard, Mass., where the first family has traveled almost every summer since he took office. \nThe White House has said Obama will spend most of his time golfing and spending time with his family, although he may take some time to phone members of Congress to discuss the nuclear deal with Iran. 1 day Protesters shut down Bernie... The protesters claimed affiliation with the Black Lives Matter movement. Trump slams Fox News, praises... “What’s better than Drudge? He’s a fantastic guy. What he’s built is... Ex-NATO supreme commander rips... \"We should not be drastically reducing our troop levels,” James Stavridis... Trump: I've been viciously... “When I’m attacked, I fight back,” Trump said. Online poll: Trump retains top... The poll immediately drew criticism for its methodology. Climate fight shifts to courts States, energy companies and business groups are preparing to sue the... RedState Gathering organizer reads... Erick Erickson made a video showing some of the complaints he got Saturday. Limbaugh rips Fox News for 'war on... \"The last place I ever thought I would see it continued is Fox News,\" the... Brent Budowsky: Is Trump a Clinton... OPINION | Is Trump’s run in the GOP primary designed to wreak havoc on the... Fury of left falls on Schumer Charles Schumer’s decision to oppose the nuclear deal with Iran has roiled... Megyn Kelly calls out Trump the... Her questions were tough, based on facts that Donald Trump did not contest. Inside McConnell’s plan to avert a... The Senate Majority leader is quietly laying the groundwork for crucial... Sanders campaign touts record... Demonstrators blocked him from speaking at an event earlier in the day. Trump: Listening to Fiorina causes... “She has zero chance!” he tweeted. Debt drama looms for Congress The nation is again coming close to hitting the \"ceiling\" for overall debt. Booker: Sanders has 'long record... Booker said Sanders's record is one of deep respect for civil rights. Paul: Trump is an insider... \"What is he famous for? He’s famous for buying politicians,\" Rand Paul... State rep planned to accuse... Todd Courser reportedly aimed to plant a fake story about being caught... Trump: 'I cherish women' “I said nothing wrong what whatsoever,” he said of comments about Megyn... 2016 contenders criticize Trump... Jeb Bush joins Scott Walker, Lindsey Graham, Mike Huckabee and Carly... Roger Stone: I chose to leave... “I resigned largely because I thought I was having no impact,” Stone said... GOP's sleeper candidate seeks to... The Ohio governor sticks with his initial strategy after praise for his...", "external_links": [], "published": "2015-08-10T20:57:00.000+03:00", "crawled": "2015-08-10T21:18:12.001+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}