{"organizations": [], "uuid": "4365bb4e20cc8a69d887f23466e0b3afcb2d12d1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/phil-sharp/obama-and-xi-take-climate_b_8196650.html", "country": "US", "title": "Obama and Xi Take Climate Action to the Next Level | Phil Sharp", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 4, "title_full": "Obama and Xi Take Climate Action to the Next Level | Phil Sharp", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T23:28:00.000+03:00", "replies_count": 5, "uuid": "f356a882ce07f56f05b60eca5403d71fcec6f3a4"}, "author": "Phil Sharp", "url": "http://www.huffingtonpost.com/phil-sharp/obama-and-xi-take-climate_b_8196650.html#post-0", "ord_in_thread": 0, "title": "Obama and Xi Take Climate Action to the Next Level | Phil Sharp", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama and President Xi once again surprised the world with the announcement of major steps to implement their surprise agreement of last fall. Together they are changing the global landscape on climate change.\nChina announced it will adopt in 2017 a nationwide cap trade program--a policy device that puts a price on carbon. Such a policy was first adopted by President Bush and the Democratic Congress in 1990 to cut sulfur emissions but was more recently rejected by Congress as a means for cutting greenhouse gas emissions. China will give an added boost to renewable energy over coal in the dispatch of its electricity. And among other items, it will adopt fuel economy standards for heavy-duty trucks--in tandem with American policy.\nThere will be important debates about the actions of both countries--about their sufficiency, about the likelihood of full implementation, about the cost-effectiveness of policy choices.\nBut no one should dismiss China's moves as mere show. The country has powerful domestic incentives to cut coal emissions, which are literally choking their people. No one should miss the significant change underway in global negotiations, change in energy markets, and change in American politics.\nThe American-Chinese agreements represent a new dynamic in international negotiations--real leadership from the world's two biggest economies and biggest emitters.\nThis bilateral negotiation operates far more effectively than the painfully slow multilateral UN negotiations, yet it also adds important stimulus to those UN efforts and the coming conference in Paris. Already, more nations--both developed and emerging--are stepping forward to cut emissions growth. Until recently, real leadership came from the Europeans, the states of the US Northeast, and from California. Now we have strong national leadership from the United States and China.\nAs policies are implemented here, in China, and elsewhere, market signals are strengthened for inventors, entrepreneurs, investors, and others to capitalize on the drive to cut greenhouse gas emissions--all of which is critical for real progress.\nAt home and abroad, President Obama and President Xi have driven more nails in the coffin for that tiresome excuse: \"We\" shouldn't act because \"they\" won't act.\nMore: Phil Sharp Resources for the Future China Climate Climate Change Barack Obama Xi", "external_links": [], "published": "2015-09-25T23:28:00.000+03:00", "crawled": "2015-09-26T10:25:53.105+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}