{"organizations": [], "uuid": "312b59d565b3bd2d965da24cd396eca71ee6bc79", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3314038/images/o-DONALD-TRUMP-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/college/blog.xml", "section_title": "College Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/david-bier/trumps-immigration-paper-is-economic-nonsense-5-graphs_b_8006030.html", "country": "US", "title": "Why Trump's Immigration 'Paper' Is Economic Nonsense in 5 Graphs | David Bier", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 14, "title_full": "Why Trump's Immigration 'Paper' Is Economic Nonsense in 5 Graphs | David Bier", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-19T00:50:00.000+03:00", "replies_count": 15, "uuid": "dc8cc6110cab7309d791a6e10b42a0d604dc5903"}, "author": "David Bier", "url": "http://www.huffingtonpost.com/david-bier/trumps-immigration-paper-is-economic-nonsense-5-graphs_b_8006030.html#post-0", "ord_in_thread": 0, "title": "Why Trump's Immigration 'Paper' Is Economic Nonsense in 5 Graphs | David Bier", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump dropped his long-awaited immigration position paper this week. To no one's surprise, it is a long list of restrictionist clichés about immigrants taking jobs, abusing welfare, and lowering wages for Americans. Here are the five biggest inaccuracies:\nInaccuracy #1: America is experiencing \"record immigration levels.\"\nThis claim is not remotely true. As I showed in a recent Niskanen report , today's immigration rate--new permanent residents as a percentage of the U.S. population--is half the historical average and a quarter of its record highs in the early 20th century. While the immigrant population already here is growing as a share of the population, this is not due to unprecedented immigration, but to Americans' unprecedented low birthrates.\nInaccuracy #2: \"The influx of foreign workers holds down salaries.\"\nTrump's claim here is that increasing the supply of workers increases competition for jobs, which results in lower wages. Trump wants to focus on new foreign workers, but to evaluate whether there is more or less competition for jobs today, we need to look at all new workers, immigrant and native. As I show in a recent Niskanen report , incomes rose at a much higher rate when the rate of new workers entering the labor force each year was much higher. The 33 years since 1981 saw much lower levels of labor-force growth and much lower levels of income growth than the 33 before it due to the baby boom and women working for the first time. It just isn't true that when the labor force grows wages fall.\nInaccuracy #3: \"We need to control the admission of new low-earning workers in order to help wages grow [and] get teenagers back to work.\"\nTrump's argument is again that new immigrants without a high school degree have increased competition for low-skilled jobs, stagnating incomes and displacing high school-age workers. This time Trump just forgets to add the word \"foreign\" before \"workers\" entirely. Again, as I show in another Niskanen report , the number of new noncollege-educated workers entering the labor force has been falling, and the number of high school dropouts--immigrant and native--has actually declined. In absolute terms, there are fewer workers without a high school degree today than 30 years ago.\nInaccuracy #4: H-1Bs increase unemployment.\nTrump spends several paragraphs arguing for this theory. But as I show in another Niskanen paper , higher H-1B employment is associated with lower unemployment in the top field for H-1Bs: computer and tech jobs. This means tech companies expand employment for all workers when they hire H-1Bs; companies do not replace Americans with H-1B workers. If they did that, overall unemployment would increase as new H-1Bs entered.\nInaccuracy #5: H-1Bs force American STEM [science, technology, engineering, and math] graduates out of STEM fields.\nTrump claims \"we graduate two times more Americans with STEM degrees than find STEM jobs.\" But his source indicates that the real number is two times more graduates --immigrant and native--not simply Americans. In reality, 40 percent of STEM doctoral grads are foreign-born, many of whom are required to leave. More importantly, when you include fields like academia, finance, and health care, 61 percent of STEM undergraduates in the United States are directly using their degrees, and 80 percent are working in professional fields that require bachelor's degrees. Overall, STEM grads have much lower levels of unemployment than the general public and are more likely to be using their degrees.\nCross-posted from NiskanenCenter.org\nMore: Donald Trump Immigration Economics Immigration Reform H1B Visa Careers Unemployment", "external_links": ["https://niskanencenter.org/blog/news/h-1bs-dont-replace-u-s-workers-employment-rises-in-top-h-1b-fields-as-h-1bs-enter/", "https://niskanencenter.org/blog/news/immigrants-wages-americans-face-less-competition-since-1980/", "https://niskanencenter.org/blog/news/u-s-immigration-is-down-support-is-up/", "http://www.nsf.gov/statistics/seind14/index.cfm/chapter-3/c3s6.htm", "https://niskanencenter.org/blog/why-trumps-immigration-paper-is-economic-nonsense-in-graphs/"], "published": "2015-08-19T00:50:00.000+03:00", "crawled": "2015-08-19T06:50:15.886+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}