{"organizations": [], "uuid": "5064c3412da05c77b1273cd95c2e43001ba54494", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3483114/images/o-PLANNED-PARENTHOOD-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/impact/blog.xml", "section_title": "Impact Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/christine-charbonneau/abortion-and-maternal-hea_b_8209666.html", "country": "US", "title": "Abortion and Maternal Health: The Global Health Crisis No One Is Talking About | Christine Charbonneau", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 64, "title_full": "Abortion and Maternal Health: The Global Health Crisis No One Is Talking About | Christine Charbonneau", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-30T16:34:00.000+03:00", "replies_count": 73, "uuid": "28f7fef1e8d7558844ad0f89abcf09edb45ee630"}, "author": "Christine Charbonneau", "url": "http://www.huffingtonpost.com/christine-charbonneau/abortion-and-maternal-hea_b_8209666.html#post-0", "ord_in_thread": 0, "title": "Abortion and Maternal Health: The Global Health Crisis No One Is Talking About | Christine Charbonneau", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Unsafe abortion is a maternal health crisis in countries where abortion is illegal or difficult to access, leading to 47,000 preventable deaths each year, according to the World Health Organization . Tuesday, we stood united on the Global Day of Action for Access to Safe and Legal Abortion because legal abortion is critical to improving maternal health and reducing maternal mortality around the world.\nWomen who lack access to legal abortion are often forced to continue with unwanted pregnancies. Recently in Ireland , a survivor of sexual assault and attempted suicide who was denied the right to a legal abortion was hospitalized in psychiatric care until her baby could be delivered by cesarean section at 26 weeks' gestation. Last year in Senegal , an 11-year-old rape survivor gave birth to twins and is now unable to continue her education. Her mother, according to reports , asked the Senegalese women lawyers' association for financial support so the girl could continue her education, but also stressed that the girl would need to switch schools to avoid being bullied.\nWithout access to legal abortion, women seeking to terminate a pregnancy face dire options, particularly women with limited resources.\nEach year there are 85 million unintended pregnancies globally, with 3.4 million in the United States alone, according to the Guttmacher Institute. In most countries, women with financial resources can obtain a safe procedure; however, where abortion is illegal, women without resources risk unsafe methods, such as seeking care from an unqualified provider; self-medicating; drinking toxic fluids; and self-injury. Such abortion procedures lead to 13 percent of global maternal deaths annually, or eight maternal deaths every hour . Millions of women who survive these unsafe procedures suffer serious--if not permanent--injuries.\nIn addition to the immediate health impacts, unsafe abortion makes a negative impact on society. The Guttmacher Institute reports that unsafe abortion reduces women's productivity, increasing economic burdens for poor families; causes maternal deaths that leave 220,000 children motherless annually; and creates long-term health problems.\nRecent changes in abortion laws in several countries have irrefutably demonstrated that access to legal abortion improves health outcomes. Since legalizing abortion in 2002, Nepal has nearly halved its maternal mortality ratio . In South Africa, the annual number of abortion-related deaths fell by 91 percent after abortion laws were liberalized in 1997. And a 2005 decriminalization of abortion in Ethiopia has \"had a huge impact on saving lives of girls and mothers,\" according to Addis Tamire Woldemariam, general director for the Ministry of Health.\nIn recent months in El Salvador, two local organizations, La Colectiva Feminista para el Desarrollo Local and La Agrupación Ciudadana para la Despenalización del Aborto Terapéutico Ético y Eugenésico have called for the Salvadorian media and government to cease its public defamation , hate speeches by public officials, as well as by non-State actors, such as religious and community leaders, or fundamentalist groups and the media, whose intentions are to impede their work to advance sexual and reproductive rights as human rights. Abortion is criminalized in all cases in El Salvador including when the woman's life or health is at risk, or in cases of rape or incest.\nThe World Health Organization (WHO) states that \"ending the silent pandemic of unsafe abortion is an urgent public-health and human-rights imperative \" and calls safe, legal abortion a \"fundamental right of women, irrespective of where they live.\"\nWe know that some of the lowest abortion rates in the world are in countries where safe abortion is legal and available, along with quality family planning services that enable women to prevent unintended pregnancies. Providing contraception to the 225 million women who want to avoid pregnancy in the developing world would decrease the need for abortion services; however, even when quality contraceptive services are widely available, there will always be a need for abortion. Through our Global Programs , Planned Parenthood of the Great Northwest and the Hawaiian Islands is working to increase access to contraception, provide sexual and reproductive health education and advocate for sexual and reproductive health and rights.\nThe numbers and stories are horrifying indeed, and at the same time make a strong argument for legalized abortion. Surveys suggest people can agree on abortions in cases of rape, but why should we stop there? We as a society, from Seattle to Dubai, must eliminate restrictions on a woman's ability to decide when and if she has children, because no woman should die from an unsafe abortion.\nFollow Christine Charbonneau on Twitter: www.twitter.com/PPGNHIChris\nMore: Anti Abortion Laws Civil Rights Women Women's Reproductive Rights Women's Empowerment Women's Health Global Motherhood", "external_links": ["http://www.guttmacher.org/pubs/fb_IAW.pdf", "http://www.irinnews.org/report/100463/ethiopia-s-game-changing-abortion-law", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2709326/", "http://www.plannedparenthood.org/planned-parenthood-great-northwest-hawaiian-islands/international-programs/", "http://www.who.int/reproductivehealth/publications/general/lancet_4.pdf", "http://www.who.int/reproductivehealth/topics/unsafe_abortion/magnitude/en/", "http://www.twitter.com/PPGNHIChris", "http://www.guttmacher.org/pubs/FB-Unintended-Pregnancy-US.html", "http://www.theguardian.com/global-development/2014/may/19/senegal-rape-11-year-old-girl-denied-abortion-gives-birth-twins", "http://www.thelancet.com/journals/lancet/article/PIIS0140-6736(09)61799-2/fulltext", "http://rhrealitycheck.org/tag/las-17/", "http://www.guttmacher.org/pubs/fb_IAW.html", "http://www.reuters.com/article/2014/09/25/us-foundation-womensrights-el-salvador-a-idUSKCN0HK1M020140925", "https://www.guttmacher.org/pubs/journals/j.1728-4465.2014.00393.x.pdf", "http://www.ipas.org/~/media/Files/Ipas", "http://www.irishtimes.com/news/social-affairs/rape-victim-didn-t-have-a-choice-1.1905130"], "published": "2015-09-30T16:34:00.000+03:00", "crawled": "2015-09-30T17:28:38.156+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}