{"organizations": [], "uuid": "7745fe846d6958e75f24e31f68b5ca4d430565ec", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3274428/images/o-GERMANY-REFUGEES-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/sigmar-gabriel-de/perspectives-have-shifted_b_7951694.html", "country": "US", "title": "Immigration Is Not a Threat, But an Opportunity | Sigmar Gabriel", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Immigration Is Not a Threat, But an Opportunity | Sigmar Gabriel", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-07T01:11:00.000+03:00", "replies_count": 0, "uuid": "7745fe846d6958e75f24e31f68b5ca4d430565ec"}, "author": "Sigmar Gabriel", "url": "http://www.huffingtonpost.com/sigmar-gabriel-de/perspectives-have-shifted_b_7951694.html", "ord_in_thread": 0, "title": "Immigration Is Not a Threat, But an Opportunity | Sigmar Gabriel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If your view on life in Germany is mostly informed by reader-comments in online media and posts on social networks, you might be led to a terrible conclusion: You might come to believe that Germany is a cold-hearted country that openly hates foreigners.\nAnd you'd be right: There is an overwhelming amount of posts by bullies, bigots, and foolish misanthropes. They rush to Facebook, Twitter and other social networks, unleashing their unbelievably obnoxious comments, and they manage to generate hundreds of likes and views. But, fortunately, in real-world Germany, where flesh-and-blood humans meet, reality is very different.\nGermany is experiencing a wave of refugee aid.\nGermany is currently undergoing a wave of refugee aid. In almost every city, individuals are engaged in volunteer humanitarian assistance. German citizens provide language classes and organize sports clubs for refugees, and they help negotiate with authorities. And they lend a kind shoulder to these refugees -- who have lost everything -- as they divulge their painful stories.\nWe Germans should be proud of this great community engagement. And we cannot thank our virtuous volunteers and relief workers enough. However, we should not fool ourselves: If current politics do not follow suit, the mood may shift rapidly. It is the responsibility of all Democrats to avoid such a devastating conclusion.\nSurely, we must fight the root causes of this mass exodus and refugeeism. But we must also be realistic: It will take a very long time until countries like Syria, Libya, or Somalia achieve tolerable living conditions.\nAnd that is why, every year, for the foreseeable future, hundreds of thousands of men, women, and children will flee to Europe in hopes of finding a better and safer life for themselves and for their families.\nIf Europe doesn't want to lose its most important characteristic, then it must change.\nDo not be fooled: This is probably the greatest domestic challenge of the coming years, especially for Europe, which is currently failing to respond. It is an absolute shame that many countries in the European Union only want to receive a very small number of refugees, or none at all.\nEurope is, above all, a community of values. These values must now be diligently protected. One solution is a fair distribution of the refugees among all countries in the EU, while taking into consideration each individual state's economic strength. This seems quite reasonable. Unfortunately, we are nowhere near from such a scenario.\nIf Europe doesn't want to lose its most important characteristic -- its morality -- then it must change. And we Germans will do everything we can to persuade our European neighbors of the importance of values and ethics.\nEven for Germany, this is a great challenge.\nIn all cases, Germany, as the strongest country in the European Union, must receive a large number of refugees and provide them with new homes. In the year 2015, the number of incoming refugees will probably exceed 500,000. I believe that we are the strongest country in the EU, and we have the capability to cope with this need. But let's not deceive ourselves: Even for us, the challenge is significant.\nAmong all the requirements to successful integration, our principle concern will be to work on language proficiency. This must take place from day one -- regardless of how uncertain the asylum status of each refugee may be. Literacy course are absolutely necessary. Then, of course, further education must be made available, as well as the necessary qualifications for entry into the German labor force. Ultimately, we must provide the groundwork that will lead these refugees to independence.\nGerman social-democrats have finally been able to offer anyone who seeks asylum the right to immediately apply for work, without waiting until they are granted asylum. Similarly, young refugees are allowed to start, and complete, their education even if their asylum is ultimately rejected.\nIt would be better still, if we allowed these refugees a minimum of two-years of work. Only a handful of industries offer training to refugees who might be denied asylum for a second year. And, of course: We must provide housing!\nConditions for everyone, not just for refugees.\nIt will be very important to not merely offer these conditions for refugees, but also for those who have been born in Germany or those who have lived here for a long time -- regardless of migrant status, blood, or race. Because how would it look if refugees seem to be granted \"everything\" while others receive \"nothing\"? -- such disparity would result in whirlwind support for the conservative right.\nTherefore, we must provide affordable housing for everyone, especially in urban areas. We must offer education and skills courses for both refugees and our unemployed Germans. And most importantly: we must grant minimum wage to everyone, to ensure that refugees, who often suffer from severe poverty, are not exploited.\nAll of this costs money, of course. But we are a strong and wealthy country. But who better to take on this challenge than the Germans? Many countries, some poorer than ours, receive more refugees than we do. Examples include Jordan and Lebanon. A fair taxation is already a condition; the necessary money is at hand.\nIt is scandalous that we enable large corporations such as Amazon and Google to find tax-cut havens in Europe. Germany loses 150 Million Euros every year to such policies, according to the EU.\nIt would be much better if the social-democrats of France, Sweden, Austria and Germany collaborated on an initiative to battle these policies. And it would be much more promising if conservatives were to follow suit.\nImmigration is not a threat, but an opportunity.\nThe first step is to provide decent accommodation for refugees. The federal government needs only to take one share of their accommodations, which amounts to about 2 million Euro, one million of which the SPD-Minister-President could already push through. It is a positive sign that Bavarian governor Horst Seehofer may be the first conservative politician who now supports such a demand.\nIt's not just about the money. We must prevent this as a State voted issue -- i.e. either decent care of refugees, or redevelopment of schools, promotion of sports-leagues, or new day-care facilities. Choosing between such issues would generate a far less welcoming attitude of acceptance towards refugees than a few hate-comments on Facebook.\nThough the challenges are great, the economic situation in Germany is better than ever. And much better than in other countries, which, measured against our population, take on four times as many refugees. And even among the parties who have long been opposed to the issue, perspectives have shifted: Immigration is not a threat, but an opportunity.\nTherefore, may we tackle these challenges with confidence, not fear.\nThis post originally appeared on HuffPost Germany and was translated into English .\nFollow Sigmar Gabriel on Twitter: www.twitter.com/sigmargabriel\nMore: Translated Germany Refugees Germany Migrants Europe Migrants Europe Migrant Crisis Sigmar Gabriel WorldPost Europe", "external_links": ["http://www.twitter.com/sigmargabriel", "http://www.huffingtonpost.de/sigmar-gabriel-de/deutschland-fluechtlinge-rassismus_b_7938312.html?utm_hp_ref=germany"], "published": "2015-08-07T01:11:00.000+03:00", "crawled": "2015-08-07T01:25:23.613+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}