{"organizations": [], "uuid": "94db05f99b93563d0580b4843e02423443928449", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1763902/images/o-COLORADO-MOUNTAIN-ROAD-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/denver/blog.xml", "section_title": "Denver Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/russ-belville/kevin-sabet-is-misleading_b_8192098.html", "country": "US", "title": "Kevin Sabet Is Misleading You Again About Marijuana Legalization", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Kevin Sabet Is Misleading You Again About Marijuana Legalization", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T02:13:00.000+03:00", "replies_count": 0, "uuid": "94db05f99b93563d0580b4843e02423443928449"}, "author": "Russ Belville", "url": "http://www.huffingtonpost.com/russ-belville/kevin-sabet-is-misleading_b_8192098.html", "ord_in_thread": 0, "title": "Kevin Sabet Is Misleading You Again About Marijuana Legalization", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit Seth K. Hughes via Getty Images \nIn his latest Huffington Post piece, \" Rand Paul Gets It Wrong, Sonia Sotomayor Gets It Right on Pot ,\" Kevin Sabet, the professional anti-pot propagandist with a Ph.D. in public policy, not medicine or science, trots out more half-truths, distortions, and outright lies to confuse the national discussion on marijuana legalization. With apologies to the late John Denver, let us examine this... Colorado Rocky Mountain Lie... \nKevin is trumpeting the proclamations of the Rocky Mountain High Intensity Drug Trafficking Area (RMHIDTA) Report, \" The Legalization of Marijuana in Colorado, The Impact, Volume 3 ,\" which he claims proves that legalization of marijuana \"has already had an alarming impact on Coloradans' public safety and health.\" \nThe RMHIDTA \"is an important component of the President's National Drug Control Strategy\" and uses federal taxpayer dollars to \"help eliminate or reduce drug trafficking and its harmful consequences.\" In other words, it is an arm of the Drug Czar's office, which is statutorily required to oppose all legalization efforts, and it is a bureaucracy that requires finding failure in legalization to maintain its budget. \nFor an example of the thorough scientific analysis RMHIDTA performs on marijuana data, look no further than page 30 . In its review of a crash risk study from the National Highway Traffic Safety Administration (NHTSA), RMHIDTA writes \"Researchers found that marijuana users are 25 times more likely to be in an accident than those that did not use the drug. By comparison, drunk drivers are four times more likely to crash than sober drivers.\" \nRMHIDTA didn't compose that sentence. That was cut-and-pasted verbatim from an article in the International Business Times , entitled \" Drug Use On US Roads Rises As Drunken Driving Drops \". That article links to a study from NHTSA entitled \" Drug and Alcohol Crash Risk Study \". The problem for RMHIDTA and, by extension, Kevin Sabet, is that the study referred to stated there was a 1.25 odds-risk ratio for THC-positive drivers versus sober drivers. \nThat's a 25 percent greater risk, not 25 times greater risk. That's far safer than the roughly 400 percent greater risk posed by drunk drivers the study noted. \nBut wait, it gets worse for Kevin. The study then goes on to conclude, \"When demographic factors (age and gender) and alcohol use were controlled, the study did not find an increase in population-based crash risk associated with THC use.\" In other words, young male drivers are the nation's worst drivers, statistically speaking, especially if they are drinkers, and they also happen to be the demographic with the greatest marijuana use rates. I've seen it raining fire in the sky... \nKevin then trots out other scare stats from RMHIDTA that bear a similar disdain for honest evaluation of the facts. Like a \"32 percent increase in marijuana-related traffic deaths in just one year,\" neglecting to mention that \"marijuana-related\" means \"we discovered active THC or inactive THC-COOH (THC metabolites) in the bodies of drivers who died in car wrecks.\" \nYou're probably more likely to find married gays or married lesbians dying in car wrecks these days, too, now that gay marriage is legal. It doesn't mean legalizing gay marriage has led to more traffic deaths. The problem with the \"marijuana-related\" deaths is that THC-COOH can be detected for up to 30 days and even THC can be detected for up to 5 days after total abstinence from marijuana. Now that marijuana is legal in Colorado, what are the chances any random person might have used some in the past month? \nAnd by the way, overall traffic deaths in Colorado are down . Either everyone else is driving a hell of a lot safer to compensate for the stoned drivers, or marijuana legalization hasn't really had any effect on traffic safety. After all, legalization didn't invent cars and driving; stoners didn't all walk to Woodstock and Haight-Ashbury. \nKevin uses the same RMHIDTA sleight-of-hand to proclaim \"A 38 percent increase in the number of marijuana-related hospitalizations,\" which, like the car wrecks, just tells us that sometimes people who smoke pot go to the hospital. If you smoked a joint Saturday night, then got into a fender-bender Monday morning and went to the hospital, and they found that marijuana metabolite in your urine, you're a \"marijuana-related hospitalization.\" \nExcept with this data set, in addition to detection of THC or metabolites we also get to add in people who tell the attending physician they use marijuana. Now that marijuana is legal in Colorado, do you suppose people are a bit more forthcoming with their doctor about using it? Remember this point when he eventually trots out the talking point about kids and accidental marijuana ingestion admissions; do you suppose a parent is more likely to report their kid getting into their now-legal marijuana stash, rather than lie about whatever it is that is making the kid sick or just wait it out at home? \nThen there's Kevin and RMHIDTA tossing out the non sequitur \"Colorado youth usage (ages 12 to 17) ranks 56 percent higher than the national average.\" Here's an example of something that is true but totally misleading without context. Yes, after legalization, in 2012-2013 , Colorado's teen monthly use rate was 11.16 percent, compared to the national rate of 7.15 percent, a difference of 56 percent. And before legalization, the average Colorado rate for 2008-2010 was 13.25 percent, the national rate was 8.61 percent, a difference of 54 percent. Colorado has always had greater teen usage rates than the nation as a whole. \nReforming marijuana laws doesn't lead to greater marijuana use ; places with greater marijuana use demand reforms of marijuana laws. They say that he got crazy once and he tried to touch the sun... \nBut that's typical of Kevin's propaganda, because he's clearly losing the battle for the hearts and minds of Americans when it comes to marijuana legalization. Even two-thirds of Republicans in the early primary states think it is a matter to be left up to the states. It's gotten Kevin so shaken up that his organization desperately latched on to a new 2014 statistic showing \"HEAVY MARIJUANA USE SOARING AMONG YOUNG PEOPLE\", when, in fact, they transposed the data that showed heavy marijuana use actually decreased almost 15 percent. \nKevin used to warn that \"taxes gained on legal drugs would be quickly offset by the social costs resulting from this increased use: witness how today society receives about $1 in alcohol and tobacco tax revenue for every $10 lost on the social costs of those two legal drugs.\" \nBut now that Washington and Colorado have added $200 million in pot revenues to the state treasuries, you don't hear that talking point anymore, since he'd have to come up with $2 billion in devastation to back it up, or even $200 million to break even, and that's without considering the savings in police, probation, parole, prison, and rehab no longer wasted on marijuana consumers. \nKevin used to warn that legalization wouldn't affect the Mexican drug cartels, arguing that \"the drug trade is so profitable that even undercutting the legal (taxed) market price would leave cartels with a handsome profit.\" \nBut now that farmers in Mexico are giving up on marijuana planting because there is no profit in it, you don't hear that talking point anymore, either. His heart still knows some fear of a simple thing he cannot comprehend... \nKevin Sabet is trying desperately to maintain the criminal prohibition of marijuana. He will offer that \"arresting and imprisoning people solely for having or using small amounts of marijuana... is not the solution for such cases, and often aggravates addictions.\" But his Kinder, Gentler Drug War solution is to continue arresting and imprisoning people who grow marijuana, sell marijuana, or possess a medium or large amount of marijuana. For those caught with the small amount , he proposes mandatory interventions with rehab doctors who will enforce involuntary abstinence from marijuana by requiring urine tests that carry criminal punishments for failure. \nKevin's latest talking point is fearmongering about the legal marijuana industry becoming \"Big Tobacco 2.0\". While Kevin is notoriously opaque about how Project SAM is funded (I found, through Open Records Requests, that he is personally paid $3,000 plus expenses to lecture), the beneficiaries of his propaganda couldn't be more transparently obvious. Big Rehab: Over half of their referrals to rehabs that receive taxpayer money for marijuana alone are forced there by the criminal justice system. Plus, marijuana is so non-addictive that those \"addicts\" can easily stop, boosting the success rates of Big Rehab. It's no surprise that a majority of Project SAM's board work in Big Rehab. Big Pharma: Research indicates that \"medical cannabis laws are associated with significantly lower state-level opioid overdose mortality rates,\" because \"medical cannabis patients have been engaging in substitution by using cannabis as an alternative to alcohol, prescription and illicit drugs.\" Even at the over-the-counter level, how many people will forgo the pain reliever or sleeping pill for a relaxing puff off a legal marijuana joint? Law Enforcement: Cops get federal money to pull marijuana plants and bust marijuana consumers , as well as assets forfeited when cops make their drug dogs false alert to marijuana. Drug courts enjoy misleadingly-high success rates by threatening marijuana consumers with jail for dirty urine screens. Private prisons benefit from the occupancy rates and slave labor of well-behaved marijuana consumers. Friends around the campfire and everybody's high... \nAs for Justice Sotomayor, Kevin is referring to a snarky comment she made that said more about her desire to see students become passionate about other social justice issues she finds more important. Just like the RMHIDTA quoting an article that misquoted the data on traffic risk, Kevin quoted an article that misquoted Justice Sotomayor on marijuana. \nKevin relayed Sotomayor's quote as, \"I don't care what kind of thing you become passionate about, just not legalizing marijuana.\" \nAmherst's GazetteNet transcribed Sotomayor's quote as, \"I don't care what kind of thing you become passionate about, except legalizing marijuana.\" \nBut the video, archived by Marijuana Majority's Tom Angell , shows Sotomayor clearly said , \"I don't really care what kinds of things you become passionate about. Maybe legalizing marijuana, but, you know, even that has people who are passionate and have accomplished something, OK?\" \nRemark starts at 2:00 \nMy agenda is pretty simple and selfish. I'm a middle-aged, self-employed, childless adult who owns no car and travels on Portland, Oregon's marvelous public transit, the Pacific Northwest Amtrak line, and airlines all across the country. Since we've legalized marijuana here, today seems no different than the day I got here twelve years ago, except I don't fear police anymore and I don't have to wait in a parking lot for some weed dealer. I can see no logical reason why any government in America should punish me to coerce me to stop using cannabis. I see no logical reason why any government in America should force me to purchase my cannabis from criminal underground markets. \nUnfortunately for Kevin Sabet, more and more Americans are agreeing with me. \nFollow Russ Belville on Twitter: www.twitter.com/RadicalRuss More:", "external_links": [], "published": "2015-09-25T02:13:00.000+03:00", "crawled": "2015-09-25T04:51:54.053+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}