{"organizations": [], "uuid": "02f75c267c337a1b7e6ac1f9ea85c0daabf5eddb", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2754548/images/o-CANNABIS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/media/blog.xml", "section_title": "Media Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/theodore-caputi/catherine-hiller-is-not-y_b_8119274.html", "country": "US", "title": "Catherine Hiller Is Not Your Average Marijuana Legalizer -- She's More Dangerous | Theodore Caputi", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Catherine Hiller Is Not Your Average Marijuana Legalizer -- She's More Dangerous | Theodore Caputi", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-14T22:55:00.000+03:00", "replies_count": 0, "uuid": "02f75c267c337a1b7e6ac1f9ea85c0daabf5eddb"}, "author": "Theodore Caputi", "url": "http://www.huffingtonpost.com/theodore-caputi/catherine-hiller-is-not-y_b_8119274.html", "ord_in_thread": 0, "title": "Catherine Hiller Is Not Your Average Marijuana Legalizer -- She's More Dangerous | Theodore Caputi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The title of a New York Times profile on well-known author Catherine Hiller, \"Smoking Marijuana for 50 Years, and Turning Out Just Fine,\" says it all: Hiller uses her life successes to validate a sustained heavy-use lifestyle. I couldn't help but wonder if an article with the title, \"Smoking Tobacco for 50 Years, and Turning Out Just Fine,\" would pass through the Times' editorial review.\nAfter all, the majority of tobacco smokers never develop lung cancer. Some live far longer than the average life span. But it is generally accepted that anecdotes of certain smokers with positive health outcomes should not be publicized in deference to the mountains of evidence showing that smoking tobacco generally leads to a decreased quality of life. The same should be true for marijuana.\nCatherine Hiller's book, Just Say Yes: A Marijuana Memoir , chronicles her experience \"smoking the herb\" for the past 50 years (since she was 18 years old) and her subsequent life accomplishments. Indeed, she has achieved more in her life than most -- she holds a Ph.D. in English from an Ivy League university, is a best-selling author, has produced a well-received documentary, and has raised three successful kids. But her message is unlike what you'll hear from drug liberalization advocates: It's far more dangerous.\nWhat differentiates Catherine Hiller from most marijuana legalization or decriminalization advocates is that her stories and interviews seem to actually encourage heavy marijuana use, even by young people. The majority of organizations touting a pro-marijuana agenda have a policy statement like that of the Students for Sensible Drug Policy: that the organization \"neither condones nor condemns drug use.\" Hiller's message seems to be distinctly different -- that long, sustained marijuana use from an early age is certainly okay and possibly even desirable.\nIn her 4/20 Huffington Post interview , Hiller speaks about children smoking pot with the same level of enthusiasm that Michelle Obama uses to boost her Let's Move campaign . If you didn't know any better, you'd think Hiller was encouraging pre-teens to pick up yoga.\n\"I've had people write to me on my website that have been getting stoned since they were 11 and 12,\" Hiller says flippantly. \"They brag about how much money they make and what wonderful marriages and parents they are, [and they've all been getting stoned] every day.\" (Full interview available here).\nBut anecdotes like this should not undermine the very serious health risks associated with heavy use, especially use initiated at a young age.\nEmpirical research shows that marijuana use by young people is quite dangerous. For example, a rigorous longitudinal study (Meier et al., 2012) found that early, heavy, and sustained cannabis use leads to an average decrease of 8 IQ points. For reference, an 8-point drop in IQ can bring somebody down from the 50th percentile to the 30th percentile. Another study led by Dr. Amelia Arria at the University of Maryland (Arria et al., 2013b) found that heavy users of marijuana are twice as likely to experience discontinuous enrollment in college (e.g., dropping out or taking leaves of absence) than infrequent- and non-users, even after controlling for high school GPA and personality factors. The effects of youth marijuana outlast the college years: a 2013 study (Arria et al., 2013a) of 620 participants found that college students who used marijuana were significantly more likely to be unemployed or employed part-time after graduation than their non-using counterparts. These results hold even when controlling for high school GPA.\nAccording to the data, smoking marijuana as a young person leads to a lower IQ and is correlated with school discontinuation and post-graduate unemployment and underemployment. In short, empirical research does not align well with Hiller's anecdote.\nEmpirical research also refutes Hiller's sentiment regarding marijuana use and happy relationships. In fact, research supports that illicit drug users are less happy in their marriages than non-users. A 2008 study (Homish, Leonard, & Cornelius, 2008) of heterosexual marriages published in the journal Addictive Behaviors investigated the marriage satisfaction trajectory of three groups: congruent users (husband and wife both use), congruent non-users (neither husband nor wife use), and discordant users (either the husband or the wife use, but not both). The study found that congruent non-users were happier with their marriages than either discordant users or even congruent users and that marriage satisfaction declined significantly more for congruent users than congruent non-users.\nIf the consequence of Hiller's rise to stardom were disabusing Americans of the Reefer Madness-inspired notion that all marijuana smokers are invariably depraved psychopaths or that they're all mindless losers, then that would not be a problem. It is true that most marijuana smokers and even some heavy marijuana smokers never develop a substance use dependence disorder, and many go on to live successful and productive lives. Hiller herself is hardly a unique example. President Barack Obama, billionaire Bill Gates, and talk show host Oprah Winfrey were all , at one point, marijuana smokers, and obviously, they went on to achieve great success.\nThe problem with Hiller's message is that it fails to reflect the statistical realities of marijuana use. While there will always be people who overcome the odds to achieve outstanding levels of success, it is not realistic to advocate that persistent marijuana smoking is a healthy lifestyle - or, as Hiller's interviews and feature articles seem to imply, that marijuana use is somehow responsible for many significant achievers.\nSeveral peer-reviewed studies (e.g. Hall, 2009; Anthony, 2006) find that one in eleven people (9 percent) who initiate marijuana use develop a substance use disorder serious enough to be called addiction (those who start using in adolescence have an addiction rate of one in six). Countless more suffer other negative health consequences that are less serious. Of course there are people who escape the dangers of marijuana, just as some cigarette smokers live to be 105 and never have a lung problem. But drugs affect different people in different ways, and it's impossible for Hiller to know whether an impressionable reader will be as lucky as she has been. Hiller's lifestyle could be described as a game of Russian roulette with an 11-chamber revolver (a six-chamber revolver if you're an adolescent). Hiller's round didn't end messily, and so she's pressuring you to pull the trigger. That's hardly a responsible message and definitely not sound public health policy.\nResearch shows that persistent marijuana smoking from an early age leads to lesser cognitive ability, lower quality health, and poorer relationships. Thousands upon thousands of Americans today live with marijuana addiction, and Hiller's endorsement of heavy marijuana use undermines their struggle and their dedication to seeking recovery.\nIt's my guess that Hiller does not realize how dangerous her words could be. After all, marijuana has not stifled her life, and she has not struggled with addiction in the way millions of Americans have. But don't let her personal experience overshadow the mountains of evidence against marijuana use, and take her interviews, features, and memoir with more than a grain of salt.\nReferences\nAnthony, J. C. (2006). The epidemiology of cannabis dependence. Cannabis dependence: its nature, consequences and treatment, Cambridge University Press, Cambridge, UK, 58-105.\nArria, A. M., Garnier-Dykstra, L. M., Cook, E. T., Caldeira, K. M., Vincent, K. B., Baron, R. A., & O'Grady, K. E. (2013a). Drug use patterns in young adulthood and post-college employment. Drug and alcohol dependence, 127(1), 23-30.\nArria, A. M., Caldeira, K. M., Bugbee, B. A., Vincent, B. K. B., & O'Grady, K. E. (2013b). The academic opportunity costs of substance use during college.College Park, MD: Center on Young Adult Health and Development.\nHall, W. (2009). The adverse health effects of cannabis use: What are they, and what are their implications for policy?. International Journal of drug policy, 20(6), 458-466.\nHomish, G. G., Leonard, K. E., & Cornelius, J. R. (2008). Illicit drug use and marital satisfaction. Addictive behaviors, 33(2), 279-291.\nMeier, M. H., Caspi, A., Ambler, A., Harrington, H., Houts, R., Keefe, R. S., ... & Moffitt, T. E. (2012). Persistent cannabis users show neuropsychological decline from childhood to midlife. Proceedings of the National Academy of Sciences, 109(40), E2657-E2664.\nFollow Theodore Caputi on Twitter: www.twitter.com/TheodoreCaputi\nMore: Marijuana Catherine Hiller Drugs War on Drugs War on Marijuana Drug Policy", "external_links": ["http://www.nytimes.com/2015/04/13/nyregion/after-50-years-of-smoking-marijuana-her-life-turned-out-nicely.html?_r=0", "http://www.letsmove.gov/", "http://www.twitter.com/TheodoreCaputi", "http://www.amazon.com/exec/obidos/ASIN/B00SP504R6", "http://ssdp.org/about/"], "published": "2015-09-14T22:55:00.000+03:00", "crawled": "2015-09-14T22:22:15.228+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}