{"organizations": [], "uuid": "56ab4d78967e9a01de58a81c7da1a77ac8c23c0e", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/252567-obama-the-miracle-worker", "country": "US", "title": "Obama the miracle worker", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama the miracle worker", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-03T16:30:00.000+03:00", "replies_count": 0, "uuid": "56ab4d78967e9a01de58a81c7da1a77ac8c23c0e"}, "author": "Paul Miller", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/252567-obama-the-miracle-worker", "ord_in_thread": 0, "title": "Obama the miracle worker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 03, 2015, 09:30 am Obama the miracle worker By Paul Miller \nBecause of their strong convictions, people of faith are predisposed to disagree – even with one another. Getting firm believers to agree on anything can be considered a miracle in itself. \nBut President Obama appears to have pulled it off, miraculously bringing together people of faith to denounce the catastrophic deal reached between the P5+1 and Iran over the Islamic Republic’s nuclear ambitions. ADVERTISEMENT Perhaps by Divine intervention or maybe it was “bashert,” the Yiddish word for destiny or fate, Obama began losing the Iran deal battle for the hearts and minds of religious Americans within hours after he announced the agreement.\nThe administration would have been wise to delay the announcement a mere 12 to 24 hours. With meetings set months in advance, 85 percent of Congress was already scheduled to meet with members of Christians United for Israel (CUFI) a few hours after the president addressed the country. The announcement coincided with their annual summit, and that historic Tuesday just happened to be lobbying day for CUFI—the largest pro-Israel organization in America – and their 5,000 conference attendees. \nBut CUFI’s impact is not limited to those initial constituent meetings granted to CUFI members who understand the danger this deal presents to Israel, the region and the United States. \n“CUFI members have sent more than 375,000 emails to members of Congress since the deal was announced,” explained CUFI Communications Director Ari Morgenstern. “Our members have also made thousands of phone calls to the offices of their elected officials, and have attended scores of town hall meetings across the country.” \nMorgenstern added, “Since the deal was announced, CUFI new membership has increased over 125,000. We are fast approaching 2.4 million members, and they are voicing their concerns over this terrible deal.” \nIn a sure sign of desperation, Obama has enlisted the help of Rev. Al Sharpton to rally African-American churches to his side. \nNotwithstanding Obama’s stature in the community, African-Americans are among the most passionate church-going populations in the country. Despite the image portrayed in the press, Sharpton is not held in high esteem amongst church going blacks. \n“It seems clear that Al Sharpton’s rhetoric is not having a significant effect. If anything, we are seeing some pushback among CUFI’s black pastors,” noted CUFI Diversity Outreach coordinator, Pastor Dumisani Washington. “It has been fairly silent within the black church community, mainly because the deal has been cast as a referendum on President Obama, and most black pastors are uncomfortable overtly opposing the president. However, this silence speaks volumes as it suggests black clergy are not in favor of the deal.” \nIf there is one undeniable miracle, it is the unity of American Jewry against the Iran deal. \nThe average American tends to assume that if a policy is bad for Israel, Jews will reject it. Well, “bad” is subjective; and in a community that offers three opinions for every two members, American Jews can’t even agree when Passover begins, let alone an existential threat to the Jewish State. \nJews, second only to African-Americans, overwhelmingly support Democrats. Among liberal or Reform Jews, I have argued for decades that they blindly vote for the name next to “D” on the ballot. But as a community, according to numerous polls , Jews are now opposing the Iran deal by significant numbers. \nThe president’s sycophants in the press desperately attempt to paint a different picture . Whenever they are looking to portray Israel and the Netanyahu government in a negative light, they come up with a token member of the Jewish community or liberal advocacy group to do their bidding. Case in point: the 340 American rabbis that recently signed a letter supporting the Iran deal. \nThat’s right, 340 rabbis support the deal. Which means that over 5,000 rabbis in the United States refused to put their name on a document supporting Iran getting the bomb. \nA look at the names of the signatories reveals a veritable who’s who of the progressive advocacy group J Street. The self-described “president’s blocking back” in Congress tends to enlist rabbis and activists whose religion is liberalism, not Judaism. \nWith 95 percent of American rabbis not signing the letter, the document isn’t worth the paper it’s written on. \nThe real story is that Jewish organizations such as the Anti-Defamation League (ADL) and Jewish Federation chapters from Boston and Philadelphia to Los Angeles and Chicago have rejected this deal. Even the American Jewish Committee, which is not exactly a bastion of right-wing advocacy, came out against the agreement, and the reliably pro-Obama and Democrat Party stalwarts of the Union of Reform Judaism refuse to back the president’s play. \nIn a world where religion is often a casus belli , the fact that Americans of different faiths have come together with the hope of preventing one is the silver lining in this dark mushroom cloud known as the Iran deal. \nMiller is president and executive director of the news and public policy group Salomon Center for American Jewish Thought. Follow him on twitter @pauliespoint.", "external_links": [], "published": "2015-09-03T16:30:00.000+03:00", "crawled": "2015-09-03T20:25:50.577+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}