{"organizations": [], "uuid": "98a40c60e74dfd88000aabe57e19686a82f7eaa9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/earnestjosh07172015getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/blogs/ballot-box/presidential-races/253261-earnest-clinton-doesnt-owe-obama-an-apology", "country": "US", "title": "Earnest: Clinton doesn't owe Obama an apology", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Earnest: Clinton doesn't owe Obama an apology", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-10T21:30:00.000+03:00", "replies_count": 0, "uuid": "98a40c60e74dfd88000aabe57e19686a82f7eaa9"}, "author": "Amie Parnes and Jordan Fabian", "url": "http://thehill.com/blogs/ballot-box/presidential-races/253261-earnest-clinton-doesnt-owe-obama-an-apology", "ord_in_thread": 0, "title": "Earnest: Clinton doesn't owe Obama an apology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Past: 1 day DNC chair closes door on more... “We’re not changing the process. We’re having six debates,” she said. Biden parks plane next to Trump's Vice President Biden’s plane parked next to a Trump jet upon landing in... Brent Budowsky: Big truths about... OPINION | Let’s look at matters from a larger perspective. Trump widens lead atop GOP... Trump picked up 8 points since August, according to a new CNN/ORC... GOP rebel: Boehner’s job is on the... “Really there is no line in the sand,\" Rep. Mark Meadows said in an... Senate speeds toward Iran vote Sen. Mitch McConnell warned Democrats not to \"shut down the voice of the... House GOP changes course on Iran... The House will now hold three separate votes on the nuclear agreement. GOP scores early win in ObamaCare... A federal district judge ruled that the House has standing to sue the... Federal contractors tell Obama:... Federal contractors say they are being unfairly targeted with executive... House GOP to postpone vote on Iran... House Republicans will now meet at 4 p.m. to discuss strategy. Pelosi praises Bernie Sanders “It’s a younger demographic, and I think that it’s really good for the... Carson calls for ceasefire with... “The media frequently wants to goad people into wars,\" Carson said. Poll: Sanders rallies past Clinton... Sanders now leads Clinton, 41 percent to 40 percent. Two vulnerable senators lack... In the race for control of the Senate, two major contests have yet to... Cruz doubles down on push to delay... But McConnell has rejected his strategy. Trump blasts Rolling Stone over '... Trump said editors added \"a lot of garish stuff\" to his controversial... Report: Analysts claim US military... More than 50 intelligence analysts feel their reports are being... WH pans GOP's 'Tortilla Coast... Press secretary Josh Earnest said Republicans' plan to derail the nuclear... Trump fires back at Carson: ‘Who... “He was an OK doctor,” Trump said. “He was heavy into the world of... 10M customers exposed in Blue... The hack falls within the top 20 worst healthcare breaches ever reported. R.E.M. blasts Trump for using... \"Personally, I think the Orange Clown will do anything for attention,\" one...", "external_links": [], "published": "2015-09-10T21:30:00.000+03:00", "crawled": "2015-09-10T22:14:16.329+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}