{"organizations": [], "uuid": "14a97aba75c66e374ddea3a9e0f409f1f9767cee", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/bush1.png", "site_section": "http://thehill.com/taxonomy/term/1837/feed#", "section_title": "The Hill: Campaign Video", "url": "http://thehill.com/blogs/ballot-box/presidential-races/250505-jeb-defends-act-of-love-immigration-comment", "country": "US", "title": "Jeb Bush stands by 'act of love' remark on illegal immigration", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Jeb Bush stands by 'act of love' remark on illegal immigration", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-07T04:40:00.000+03:00", "replies_count": 0, "uuid": "14a97aba75c66e374ddea3a9e0f409f1f9767cee"}, "author": "rshabad@thehill.com (Rebecca Shabad)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/250505-jeb-defends-act-of-love-immigration-comment", "ord_in_thread": 0, "title": "Jeb Bush stands by 'act of love' remark on illegal immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 06, 2015, 09:40 pm Jeb Bush stands by 'act of love' remark on illegal immigration By Rebecca Shabad GOP presidential candidate Jeb Bush on Thursday night defended his stance on illegal immigration, and reiterated he supports a path to “earned legal status” for those who are in the United States illegally. “There should be a path to earned legal status for those that are here — not amnesty — earned legal status, which means you pay a fine and do many things over an extended period of time,” he said. Bush was asked if could stand by a statement he made in early 2014 in which he called illegal immigration “an act of love” and whether he still supports earned legal status. ADVERTISEMENT “I do,” the former Florida governor said. “I believe that the great majority of people coming here illegally have no other option. They want to provide for their family, but we need to control our border. It’s our responsibility to pick and choose who comes in.” Bush briefly laid out his immigration strategy, which he said would entail implementing E-Verify, dealing with people who come into the U.S. with illegal visas and those who overstay. He also called for the elimination of sanctuary cities, which have come under fire after an illegal immigrant from Mexico allegedly shot and killed a young woman in San Francisco last month. “It is ridiculous and tragic that people are dying because of the fact that local governments are not following the federal law,” said Bush, who then took a jab at President Obama’s immigration policies. \n“Rather than talking about this as a wedge issue, which Barack Obama has done for six long years, the next president, and I hope to be that president, can fix this once and for all.”", "external_links": [], "published": "2015-08-07T04:40:00.000+03:00", "crawled": "2015-08-07T12:07:35.338+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}