{"organizations": [], "uuid": "a3c6b3c16f3cafcabee011a19f9d6e170290ffdf", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaun_092715getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/255100-at-un-obama-calls-for-action-on-refugee-crisis", "country": "", "title": "At UN, Obama calls for action on refugee crisis | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "At UN, Obama calls for action on refugee crisis | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-27T23:59:00.000+03:00", "replies_count": 0, "uuid": "a3c6b3c16f3cafcabee011a19f9d6e170290ffdf"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/255100-at-un-obama-calls-for-action-on-refugee-crisis", "ord_in_thread": 0, "title": "At UN, Obama calls for action on refugee crisis | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 27, 2015, 04:07 pm At UN, Obama calls for action on refugee crisis By Bradford Richardson Getty Images \nPresident Obama is urging world leaders to open their borders to refugees flooding out of war-torn Syria. ADVERTISEMENT Obama addressed the United Nations on Sunday and called for increased action on the migrant crisis.\n“These are humanitarian crises and refugees that we cannot ignore, and we have to deliver the urgent aid that is needed right now,” Obama said. “Those countries that can must do more to accommodate refugees, recognizing that those children are just like ours.\" \nThe White House has announced it will grant asylum to 10,000 refugees this fiscal year. \nDemocrats have called for a number a number several times that amount. \nObama also drew a connection between the current Syrian refugee crisis and an impending one that he believes will be caused by climate change. \n“All of our countries will be affected by a changing climate, but the world’s poorest people will bear the heaviest burden from rising seas and more intense droughts, shortage of water and food,” Obama said. “We will be seeing climate change refugees.” \nHe reiterated Pope Francis’s call for action following the pontiff’s joint address to Congress on Thursday. \n“As his holiness Pope Francis has rightly implored the world, this is a moral calling,” Obama said. \nOne of the themes of the president’s speech was a need to respond to emergencies in the short term, matched by a long-term commitment to global development that will forestall major crises in the future. \n“It means breaking cycles of dependence by helping people become more self-sufficient – not just giving people fish, but teaching them how to fish,” Obama said. “That’s the purpose of development.” \nThe president additionally called for nations around the world to embrace women’s and LGBT rights, and reiterated America’s commitment to developing nations. \nWorld leaders gathered at the United Nations on Sunday to adopt the 2030 Agenda for Sustained Development, which sets out goals to be met over the next 15 years in areas such as poverty reduction, educational attainment and green energy development. ", "external_links": [], "published": "2015-09-27T23:59:00.000+03:00", "crawled": "2015-09-27T23:59:31.198+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}