{"organizations": [], "uuid": "f4cc7a8bac588d9af278cd4071f1173f179a3b05", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/36/feed#", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/blogs/floor-action/senate/254136-mcconnell-tees-up-20-week-abortion-vote", "country": "US", "title": "McConnell tees up 20-week abortion vote", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McConnell tees up 20-week abortion vote", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-18T01:42:00.000+03:00", "replies_count": 0, "uuid": "f4cc7a8bac588d9af278cd4071f1173f179a3b05"}, "author": "jcarney@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/senate/254136-mcconnell-tees-up-20-week-abortion-vote", "ord_in_thread": 0, "title": "McConnell tees up 20-week abortion vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 17, 2015, 06:42 pm McConnell tees up 20-week abortion vote By Jordain Carney \nSenate Majority Leader Mitch McConnell (R-Ky.) on Thursday officially teed up an initial vote for next week on legislation to restrict abortions after 20 weeks. \nThe Republican leader filed cloture on a motion to proceed to the House-passed legislation. Under Senate rules, the Senate will take a procedural vote on the proposal on Tuesday. ADVERTISEMENT McConnell said earlier Thursday that the Senate will debate the proposal Monday, and while attendance isn't mandatory, \"I would hope all members would be here to join in that discussion.\" The legislation isn't expected to get the 60 votes needed to overcome Tuesday's procedural hurdle, and will likely split Republicans running for reelection next year. A similar proposal from Sen. Lindsey Graham (R-S.C.), who is running for president, has 45 cosponsors — all Republicans. Sens. Kelly Ayotte (R-N.H.) and Mark Kirk (R-Ill.), who are up for reelection in blue states, haven't officially backed the legislation. Neither has Sen. Susan Collins (R-Maine), considered one of the Senate's most moderate Republicans. Even if McConnell managed to convince every Republican to support the proposal, he would face an uphill climb to persuade six Democrats to buck their party's line. Democrats have slammed Republicans for moving to the legislation instead of pivoting to a bill to fund the government ahead of an end-of-the-month deadline. Sen. Patty Murray (D-Wash.) on Thursday called the decision \"transparent pandering\" on the part of Republicans. \"Just days away from the looming fiscal deadline, Republicans are backed as far into their partisan corner as they can get and are focused on their favorite political past-time: attacking women’s health,\" she added. Sen. John Cornyn (R-Texas), however, defended holding the vote, tying to it a separate political fight over Planned Parenthood. \n“This chamber is long overdue at taking a hard look at the practices depicted by Planned Parenthood in these videos and examining our own conscience and our nation's policies that affect the unborn,\" he said Thursday. “Right now, there are four congressional investigations underway … and those investigations, I can tell you, are meticulous.” Republican leadership is under pressure to use a government spending bill to defund the organization. Cornyn said separately Thursday, \"I think we'll have votes associated with the CR on defunding.\" Conservative Republicans, including Sen. Ted Cruz (R-Texas), have doubled down on defunding the organization even if it shuts down the government. But it's unlikely that a bill that blocked federal funding for Planned Parenthood could get the 60 votes needed to move forward in the Senate.", "external_links": [], "published": "2015-09-18T01:42:00.000+03:00", "crawled": "2015-09-18T07:35:31.108+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}