{"organizations": [], "uuid": "6f4bbed906b36c58071a6b56a7e98d1e9326048d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/scalefit_1200_noupscale/55ff1f902000002500242a0f.jpeg", "site_section": "http://www.huffingtonpost.com//feeds/index.xml", "section_title": "The Huffington Post | The Full Feed", "url": "http://www.huffingtonpost.com/entry/donald-trump-birther-backlash_55ff1e2fe4b08820d9191338", "country": "US", "title": "Donald Trump Still Thinks Obama Is A Muslim, Prompts Swift Backlash", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Donald Trump Still Thinks Obama Is A Muslim, Prompts Swift Backlash", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-21T00:19:00.000+03:00", "replies_count": 0, "uuid": "6f4bbed906b36c58071a6b56a7e98d1e9326048d"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/donald-trump-birther-backlash_55ff1e2fe4b08820d9191338", "ord_in_thread": 0, "title": "Donald Trump Still Thinks Obama Is A Muslim, Prompts Swift Backlash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump Still Thinks Obama Is A Muslim, Prompts Swift Backlash Just move on. Marina Fang Associate Politics Editor, The Huffington Post Posted: 09/20/2015 05:19 PM EDT \nReality television star and real estate mogul Donald Trump refuses to accept that President Barack Obama was born in the United States and is a Christian. \nTrump on Sunday deflected questions about it from both ABC News and NBC News, calling it \"a long, complex subject.\" \n\"I just don't discuss it,\" he told NBC’s Chuck Todd. \"Really, it hasn't been brought up in a long time.\" \nBut Trump continues to bring up the issue. In fact, the “birther movement” largely began when, in 2011, he demanded that Obama release his birth certificate. ASSOCIATED PRESS \nOn Thursday , Trump proved that he has yet to move past the issue when he did not correct a man who asked him a question at a New Hampshire town hall about how to \"get rid of\" Muslims. \n\"We have a problem in this country. It's called Muslims. We know our current president is one,\" the man told Trump. \n\"You know he's not even an American. We have training camps growing where they want to kill us. That's my question. When can we get rid of them?\" he asked. \nTrump responded that “we're going to be looking at a lot of things.” \nHis campaign later claimed Trump was referring to concerns for Christians’ religious liberties, and that the man was specifically asking about getting rid of terrorist training camps. \nPoliticians and pundits from both sides of the aisle are blasting Trump for not moving on from the issue, including his GOP presidential rival Sen. Marco Rubio (R-Fla.) and Democratic presidential front-runner Hillary Clinton. \nFor more, watch the NowThisNews video above.", "external_links": [], "published": "2015-09-21T00:19:00.000+03:00", "crawled": "2015-09-21T00:39:32.984+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}