{"organizations": [], "uuid": "846049c306bb3e1782e3d5a755666b8208b3c681", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/palinsarah_012415getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/252794-palin-obama-missed-some-stuff-on-touristy-alaska-trip", "country": "", "title": "Palin: Obama missed some stuff on touristy Alaska trip | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Palin: Obama missed some stuff on touristy Alaska trip | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-04T21:25:00.000+03:00", "replies_count": 0, "uuid": "846049c306bb3e1782e3d5a755666b8208b3c681"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/252794-palin-obama-missed-some-stuff-on-touristy-alaska-trip", "ord_in_thread": 0, "title": "Palin: Obama missed some stuff on touristy Alaska trip | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hillary Clinton refuses to... \"I’m sorry this has been confusing to people,\" she said. Clinton: Officials should 'uphold... The presidential candidate weighed in on the Kentucky gay marriage dispute. Trump blasts Hugh Hewitt as 'a... Trump has accused Hewitt of asking him \"gotcha\" questions. Dem: Dismantle Benghazi committee The panel sets “a dangerous precedent that will haunt Congress for decades... Trump hits radio host Hugh Hewitt... The conservative host asked Trump about foreign policy. Third-party bid lingers as threat The emergence of an alternative to the eventual nominees could upend the... The Hill's Whip List: Obama has... Supporters are looking for 41 votes to filibuster a measure of disapproval. Dem Sen. Cardin opposes Iran deal The Maryland Democrat is the third Senate Democrat to come out against the... Critics launch campaign attacking... The restaurant is accused of using the \"GMO-free\" claim to make its food... 'Fireworks' likely as 2016 rivals... The 2016 elections are about to create a major headache for GOP leaders in... Dem staffers walk out of Planned... Anti-abortion-rights activists screened the controversial videos at the... Snowden: Clinton's email server 'a... Snowden also dismissed comments by Donald Trump, who called him a \"traitor... Economy adds 173K jobs in August;... The jobless rate is at its lowest level since April 2008. Clerks in Kentucky county begin... Deputy clerks issued the licenses a day after county clerk Kim Davis was... GOP candidates blast 'absurd'... \"Today, judicial lawlessness crossed into judicial tyranny,\" Sen. Ted Cruz... Trump's favorability soars with... Trump's net favorables are up 16 percentage points in the last two weeks;... Poll: Clinton's favorability... The former secretary of State has not had such low numbers since 1992,... House GOP leader distances herself... \"I don’t work for John Boehner. He works for me,\" Rep. Lynn Jenkins said. Trump on Ky. clerk: 'I hate to see... Trump added that he believes the public official must obey federal law. Fiorina handles foreign policy... “I don’t think they’re ‘gotcha’ questions at all,” Fiorina told Hugh... DNC chief faces perilous fall Angst over the presidential debates and a tough choice on Iran await... Erin Brockovich takes on EPA The famed environmental activist is backing the Navajo Nation's battle... Sanders: Let's stand up to Wall... He said illegal immigrants are being used as a \"punching bag\" in the race. Mia Love to pay back taxpayers for... Love billed taxpayers over $1,000 for flights the weekend of the... Planned Parenthood gets $1M in... The new funding is enraging Republicans who have already sought to defund... ", "external_links": [], "published": "2015-09-04T21:25:00.000+03:00", "crawled": "2015-09-04T21:25:54.923+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}