{"organizations": [], "uuid": "afdf567223a8288630ef081604a2dadf3108ad2f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamakerry_getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/250723-obama-sanctions-were-only-way-to-bring-iran-to-table", "country": "US", "title": "Obama: Sanctions were only way to bring Iran to table", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Sanctions were only way to bring Iran to table", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-10T19:01:00.000+03:00", "replies_count": 0, "uuid": "afdf567223a8288630ef081604a2dadf3108ad2f"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/international/250723-obama-sanctions-were-only-way-to-bring-iran-to-table", "ord_in_thread": 0, "title": "Obama: Sanctions were only way to bring Iran to table", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Sanctions were only way to bring Iran to table By Jordan Fabian - 08/10/15 12:01 PM EDT \nPresident Obama believes enacting crippling economic sanctions was the only way to bring Iran to the negotiating table over its nuclear program. \nDuring an interview with Mic News , Obama was asked by a 22-year-old Iranian woman whether there was another way to secure the nuclear deal without “without hurting Iranian people so much.” ADVERTISEMENT The president responded that when he first took office, he reached out to Iran’s Supreme Leader Ayatollah Ali Khamenei to negotiate a nuclear agreement. Obama received no response, and when U.S. officials discovered a covert uranium-enrichment facility at Fordo, it slapped sanctions on Iran. \n“Unfortunately we didn’t have a better way of doing this,” he said. “In that circumstance, what we had to do was to more severely enforce sanctions so that Iran had greater incentive to come to the table and negotiate.” \nThe interview is part of Obama’s effort to build support for the controversial accord at home and abroad ahead of a vote in Congress next month. \nOpponents of the deal are mounting a campaign to turn public opinion against the deal during the August recess, when lawmakers will hear from constituents in their home districts. The White House is making an aggressive effort to counter their arguments. \nMic is geared toward a young audience, and the president took questions from young people in the United States, Iran and Israel. \nThe interview, published Monday, allowed Obama to get his message out while he vacations in Martha’s Vineyard, Mass. \nObama repeated that there is a chance the deal could allow Iran to shed its label as an international pariah, but only if it stops funneling money to terrorist groups and threatening U.S. allies in the Persian Gulf and Israel. \n“I can guarantee you that the moment the Iranian regime stopped engaging in that kind of rhetoric and that kind of behavior that Iran would just by virtue of its size, talent, resources, immediately rise in its influence and its power in the eyes of the world,” he said. \n“That’s what I hope can happen. It will require a shift in the politics and the leadership of Iran — a different mindset in terms of how they are approaching the rest of the world and how they’re approaching countries like the United States,” he added. “And perhaps, it’ll be this new generation that’s able to make that happen.” Obama sought to draw a distinction between Democrats who might oppose the deal and Republicans, whom he accused of making “common cause” with hardliners in Iran. “Most of the Democratic senators have taken the time to actually read the bill and listen to the arguments,” he said. “A sizable proportion of the Republicans were opposed before the ink was even dry on the deal before it was even posted, and that gives you sense of the degree to which this is driven by partisan politics or ideology as opposed to analysis.” Obama credited strong opposition to the deal within Israel for Democratic skepticism of the agreement. “There are going to be some Democrats who end up opposing this deal, partly because as I said yesterday in the speech, the affinity that we all feel towards the state of Israel is profound, it’s deep,” he said. “And you know when Israel is opposed to something a lot of Democrats, as well as Republicans, pay attention.”", "external_links": [], "published": "2015-08-10T19:01:00.000+03:00", "crawled": "2015-08-11T05:56:12.677+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}