{"organizations": [], "uuid": "2c5d0277b5e05ef03ea474c8fc59c581d0098717", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama1_080315getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/international/250678-obama-iranian-sanctions-relief-not-a", "country": "US", "title": "Obama: Iranian sanctions relief ‘not a game-changer’", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Iranian sanctions relief ‘not a game-changer’", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-09T18:11:00.000+03:00", "replies_count": 0, "uuid": "2c5d0277b5e05ef03ea474c8fc59c581d0098717"}, "author": "Bradford Richardson", "url": "http://thehill.com/policy/international/250678-obama-iranian-sanctions-relief-not-a", "ord_in_thread": 0, "title": "Obama: Iranian sanctions relief ‘not a game-changer’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Iranian sanctions relief ‘not a game-changer’ Getty Images By Bradford Richardson - 08/09/15 11:11 AM EDT \nPresident Obama in an interview broadcast Sunday acknowledged that Iran would benefit economically from the nuclear weapons agreement that his administration negotiated with Tehran, but contended that it would not be a “game-changer.” ADVERTISEMENT “The nefarious activities that Iran engages in, whether it’s providing arms to Hezbollah or stirring up destabilizing activities among some of their Gulf neighbors is something that they’ve been able to do consistently at a very low cost,” the president said on CNN’s “Fareed Zakaria GPS.” “I have no doubt that as Iran’s economy improved or they got some financial inflows that relieve some fiscal pressure on their military, they may be able to fund some additional activities, but it’s not a game-changer.”\nObama held that the threat of Iran acquiring a nuclear weapon far outstrips that of Tehran becoming economically enriched. \n“The flip side of it is if Iran is able to get a nuclear weapon, if its breakout time remains as short as it is right now and they are installing advanced centrifuges and so on, then they will be emboldened to engage in more of the activities that have been discussed,” the president added. \nObama added that Iran’s ability to engage in destabilizing efforts in the region has very little to do with the country’s bottom line. \n“The reason that Iran has been effective has less to do with the amount of money they have spent, it has more to do with the fact that, although Gulf countries for example spend eight times more at least combined on defense than Iran’s entire defense budget, they haven’t deployed it in ways that have been as strategically effective,” the president said. \nWhen pressed as to what he would do if the deal failed, and if the president had considered the possibility of using military force against Iran, Obama said that he does not, as a rule, “anticipate failure.” \n“I have a general policy on big issues like this not to anticipate failure, and I’m not going to anticipate failure now because I think we have the better argument,” he said. \nObama also committed his support to Israel in the event of an Iranian attack on the Jewish state. \n“If Israel were attacked by Iran, not just me, but any U.S. administration would do everything that we needed to do to make sure that Israel was protected,” the president said. \nIsraeli Prime Minister Benjamin Netanyahu has been critical of the nuclear accord struck between Iran and six world powers. \nFinally, the president responded to criticism that the Iranian nuclear weapons agreement compromises too heavily on Tehran’s ability to enrich uranium. \n“You have a consensus inside of Iran that they should have a right to enrich,” he said. “The non-proliferation treaty is very clear about guarding against the weaponization of nuclear power, but it does not speak to prohibitions on peaceful nuclear power.” \nObama contended that there was a lack of international unity on whether Iran should be able to enrich uranium for peaceful purposes. \n“We did not have the support of that position among our global allies who have been so critical in maintaining sanctions and applying the pressure that was necessary to get Iran to the table,” the president said. \nObama also described the notion that world powers like China and Russia would continue to enforce economic sanctions on the Islamic Republic as a “fantasy” and “demonstrably false.” \n--This report was updated at 12:13 p.m. Tags:", "external_links": [], "published": "2015-08-09T18:11:00.000+03:00", "crawled": "2015-08-09T19:26:50.288+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}