{"organizations": [], "uuid": "2d06f3d3498d10c4360e7d6bda28dee6bbbf13f9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3442636/images/o-TED-CRUZ-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/paul-abrams/the-ted-cruz-problem-is-t_b_8167272.html", "country": "US", "title": "The Ted Cruz Problem Is the Reason Trump Ducks -- and Must Duck -- the Obama Birther Question | Paul Abrams", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The Ted Cruz Problem Is the Reason Trump Ducks -- and Must Duck -- the Obama Birther Question | Paul Abrams", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-21T02:45:00.000+03:00", "replies_count": 0, "uuid": "2d06f3d3498d10c4360e7d6bda28dee6bbbf13f9"}, "author": "Paul Abrams", "url": "http://www.huffingtonpost.com/paul-abrams/the-ted-cruz-problem-is-t_b_8167272.html", "ord_in_thread": 0, "title": "The Ted Cruz Problem Is the Reason Trump Ducks -- and Must Duck -- the Obama Birther Question | Paul Abrams", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Every Republican candidate should be asked if they think that Ted Cruz (R/TP-TX) is eligible to serve as President. There is no dispute that Cruz was born in Canada. Indeed, he took his congressional oath of office while still being a Canadian citizen. One has to wonder if that was a violation of his oath.\nRepublican candidates should not only be asked about Cruz's eligibility, but pressed for an answer. And, not only pressed for an answer on Cruz, but asked why none of them stepped forward during the birtherism campaigns. During those days, they were writing into state laws requirements for producing birth certificates, and an Israeli-born dentist claimed she had proof of Obama's foreign birth.\nWhy did they not step forward and state that Obama's place of birth did not matter because his mother was an American citizen? For Cruz to be eligible, that is what they have to believe. Let them say it...now.\nEspecially Donald Trump. Why? Because Trump's message for years was President Obama's eligibility for the White House was based upon his place of birth. Never once, at least of which I am aware, was Trump or any of the other nut jobs asked why it mattered.\nAfter all, no one doubted who his U.S.-born mother was, and, if having at least one parent who is a U.S. citizen, satisfies the \"naturally born\" criterion, then even the most idiotic of idiots -- e.g., Steven King (R-IA) who surmised that Obama's birth information was faxed to Hawaii (before faxes existed of course, but never mind) -- would have had to concede that the entire charade of de-legitimizing Obama's presidency had no foundation, no-way, no-how.\nMoreover, on the right there was an entire cottage industry devoting itself to undermining Obama's entire persona. When birtherism seemed to be going nowhere, one group decided to question not Obama's place of birth, but who his true father was, claiming that Obama had a nose-job (I kid you not) to avoid looking like his \"real\" father who was a communist.\nThen, it was all conflated. Obama became a Kenyan communist, named after someone who was not his biological father to plot a successful presidential run decades later, using the middle name of Hussein, so as to undermine the entire fabric of society. Before dismissing this as too absurd for anyone to say or believe, recognize that more than 50% of Republicans still believe Obama was born outside the U.S.\nTrump cannot answer the Obama place-of-birth question because he would either have to lie outright, or state that Ted Cruz is ineligible to run for president.\nTrump likes Cruz. He does not want to have to say that. But, he must, or admit that his entire Obama birth certificate campaign was a complete scam.\nOr, as the Donald would put it, \"entertainment\". Entertainment at the expense of fooling millions of republicans who would likely recoil at the recognition they had been deliberately led astray.\nEntertainment at the expense of undermining the honor and dignity of the presidency.\nFollow Paul Abrams on Twitter: www.twitter.com/pabrams2001\nMore: Ted Cruz Donald Trump Birtherism Kenya Mother Canada Natural Born US Citizen", "external_links": ["http://www.twitter.com/pabrams2001"], "published": "2015-09-21T02:45:00.000+03:00", "crawled": "2015-09-21T03:28:43.080+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}