{"organizations": [], "uuid": "585e115e2a312987322879d99e1b1611c3c334c9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/immigration_borderpatrol_072214getty.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed#", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/immigration/254828-is-immigration-about-sympathy-or-justice", "country": "US", "title": "Is immigration about sympathy or justice?", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Is immigration about sympathy or justice?", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-24T22:00:00.000+03:00", "replies_count": 0, "uuid": "585e115e2a312987322879d99e1b1611c3c334c9"}, "author": "shermichaels@gmail.com (Shermichael Singleton, contributor)", "url": "http://thehill.com/blogs/pundits-blog/immigration/254828-is-immigration-about-sympathy-or-justice", "ord_in_thread": 0, "title": "Is immigration about sympathy or justice?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 24, 2015, 03:00 pm Is immigration about sympathy or justice? By Shermichael Singleton, contributor Getty Images \nWhen I think of immigration, my view is often divided. Freedom, success and happiness are leading factors why immigrants typically come to the United States. The environment that fosters these complex units is so great that immigrants are willing to break the law to come here. ADVERTISEMENT I have no immediate experience of what illegal immigrants feel or an idea of the environment from which they escape. However, by conceiving what I would feel in a similar situation, I partially sympathize. This kind of sympathy is neither pity nor sorrow but comes from understanding, which allows me to imagine their torments.\nSurely I am not alone in my partial sympathy or understanding. We can all relate to the misery of those who suffer by imagining their pain: for example, the starving children that we see on television or the senseless murder of an innocent civilian. Despite being foreign to us personally, in both instances, we can all relate. \nHowever, despite my level of empathy towards their conditions, I am troubled knowing that our country is less secure because of a lack of border security. It is also disturbingly clear that those who come illegally have a complete disregard for our immigration laws. \nWhen you live in a country, you yield to the laws and customs of that nation. Our obeying, for the most part, is what allows us to have and live in a lawful society. When you live under the rule of law, the very essence of what that construct means should be protected. Diminishing it by not defending or enforcing it degrades its very existence. \nFor example, if a man takes bread from another man, is that not considered theft? Though we may sympathize because of his misfortunes, an infraction against the law has occurred. Do we hold this man accountable for his theft, or do we just ignore it and dismiss him? Imagine if this occurred on a much grander scale, would we then just ignore these acts because of sympathy? Having law and order is an important part of our society and so is having immigrants of good moral character. \nHowever, it is not my attempt to plead the case for the removal of existing illegal immigrants. It is both illogical and implausible to expect to remove the 11.3 million immigrants here illegally. \nI have considered the idea of a wall — which sounds great in theory — but the barrier would cost $6 billion to build and over $1 billion per year to maintain, according to the National Journal . This would force legislators to either cut existing programs to account for this new expense or consider increasing taxes that would arguably burden our recovering economy. \nThe biggest problem facing our southern border today has been the lack of security. We should increase the number of border patrol units and provide them with the necessary tools (technology, weapons and vehicles) as well as make sure that the proper infrastructure is being utilized to protect the 2,000-mile border. \nAs it relates to existing illegal immigrants, the most effective approach would be to set a penalty based on income and family size. They would also be required to pass a rigorous background check. Upon satisfying the background check and paying off all fines, existing illegal immigrants would then be given the opportunity to apply for naturalization — getting behind those already in the process. \nFunds collected by the fines paid by the 11.3 million illegal immigrants would go toward the cost and operational fees to maintain this process. Those funds would also be utilized to increase the budget for U.S. Customs and Border Protection to cover their aforementioned needs. \nA New York Times story from 2013 suggests that illegal immigrants contribute $15 billion annually to Social Security through payroll taxes. If that figure is accurate, the fees received from the fines paid should be in the billions, thus covering all or most of the expenses. The result would be a marginal burden, if any, on the taxpayer. \nAs a matter of security, a nation cannot be fully secure without properly monitoring and protecting its borders. It is essential that those who seek to come to the United States do it legally. We can be sympathetic while upholding the law. \nSingleton is Republican political consultant. He's worked on the presidential campaigns of Newt Gingrich and Mitt Romney. Follow him on Twitter @Shermichael_ . Tags:", "external_links": [], "published": "2015-09-24T22:00:00.000+03:00", "crawled": "2015-09-25T02:03:49.064+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}