{"organizations": [], "uuid": "5a41fe1d764b0f53d013c8b9522da9a72a3c7347", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/syrianrefugees07092015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/blogs/blog-briefing-room/news/253244-white-house-planning-to-admit-10k-syrian-refugees", "country": "US", "title": "Obama planning to admit 10K Syrian refugees", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama planning to admit 10K Syrian refugees", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-10T20:33:00.000+03:00", "replies_count": 0, "uuid": "5a41fe1d764b0f53d013c8b9522da9a72a3c7347"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/253244-white-house-planning-to-admit-10k-syrian-refugees", "ord_in_thread": 0, "title": "Obama planning to admit 10K Syrian refugees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 10, 2015, 01:33 pm Obama planning to admit 10K Syrian refugees By Jordan Fabian Getty Images \nPresident Obama has directed his administration to take in at least 10,000 Syrian refugees, a dramatic increase over the number it accepted in 2015. White House press secretary Josh Earnest told reporters Thursday the U.S. will “accept at least 10,000 refugees in the next fiscal year,” beginning Oct. 1. ADVERTISEMENT It’s most significant step the U.S. has taken yet to resettle the thousands of people who are fleeing war-torn Syria. The exodus has overwhelmed neighboring European nations, with the migrants often marching up to their borders in search of asylum.The crisis has drawn international headlines and emerged as a focal point of the 2016 presidential campaign.\nThe administration has faced mounting criticism from lawmakers and human-rights groups over the crisis, with many arguing the U.S. has not done enough to help.Secretary of State John Kerry privately informed members of Congress on Wednesday that the U.S. plans to raise its worldwide cap on refugees, which stands at 70,000, in order to resettle more Syrians. “We are looking to increase the number beyond 70,000,” Earnest said Thursday. The United States plans to resettle 1,800 refugees from Syria by Oct. 1, far less than countries such as Germany, Austria and the United Kingdom have agreed to accept. Germany expects to take in 800,000 displaced Syrians by the end of the year. An estimated 4 million Syrians have fled the multi-faction conflict involving government forces, rebels and the Islamic State in Iraq and Syria (ISIS) over the past four years.The United Nations High Commissioner on Refugees has recommended that 18,000 Syrians resettle in the U.S. — 10 times as many as the country plans to take in this year. But administration officials have said a strenuous screening process to prevent criminals and terrorists from entering the country has made it difficult to take in more refugees. That process can take anywhere between 18 and 24 months, a senior State Department official said Wednesday. Obama’s move failed to satisfy some human-rights groups, which have called on the U.S. to take in anywhere from 65,000 to 100,000 Syrians by the end of next year. “This is not leadership, it is barely a token contribution given the size and scale of the global emergency,” said Eleanor Acer, an official with Human Rights First. Earnest said the White House would urge other nations that do not typically welcome refugees to take in displaced Syrians. But he added there are no plans to change the rigorous background check process for refugees. \"To scale up to a degree that some members of Congress may have in mind, would have some significant fiscal consequences,\" Earnest said.Sen. Lindsey Graham (R-S.C.), a presidential candidate who oversees State Department funding in the Senate, has proposed an emergency spending bill to help address the crisis. But other Republicans running for the White House have rejected taking in more of the refugees.The issue is sure to be a flashpoint in the Republican presidential debate next week, which could raise pressure on GOP lawmakers on Capitol Hill to take a tougher line against a more generous refugee policy. Syria is a hotbed of activity for Islamic militants, with many of them fighting in the country's long-running civil war. Instead of taking in more refugees, GOP candidates say Obama should step up the fight against ISIS. “No, we shouldn’t be taking on any more Syrian refugees right now,” Wisconsin Gov. Scott Walker said Wednesday, one day after refusing to comment on the crisis. GOP frontrunner Donald Trump appeared backtrack on his claim the U.S. should take in more Syrians, saying the country has more pressing issues to address. \"We have our own problems, we have very big problems between our own borders and our infrastructure and everything else,\" Trump told CNN Wednesday. On the Democratic side, presidential candidate Martin O’Malley, has called on the U.S. to take in as many as 65,000 refugees from Syria by the end of next year. Hillary Clinton has called for a global conference to tackle the crisis. This story was last updated at 4:10 p.m. Mark Hensch contributed.", "external_links": [], "published": "2015-09-10T20:33:00.000+03:00", "crawled": "2015-09-11T01:39:47.412+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}