{"organizations": [], "uuid": "d20355d187badb7bc442673c72d4dc848715d8ba", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/judith-a-salerno/headshot.jpg", "site_section": "http://www.huffingtonpost.com//feeds/verticals/impact/index.xml", "section_title": "Impact - The Huffington Post", "url": "http://www.huffingtonpost.com/judith-a-salerno/what-president-obama-miss_b_7952334.html", "country": "US", "title": "What President Obama Missed in Kenya - Conservation and Women's Health", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "What President Obama Missed in Kenya - Conservation and Women's Health", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-07T01:42:00.000+03:00", "replies_count": 0, "uuid": "d20355d187badb7bc442673c72d4dc848715d8ba"}, "author": "Judith A. Salerno", "url": "http://www.huffingtonpost.com/judith-a-salerno/what-president-obama-miss_b_7952334.html", "ord_in_thread": 0, "title": "What President Obama Missed in Kenya - Conservation and Women's Health", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nLast month, when President Obama visited Kenya to participate in the Global Entrepreneurship Summit, he regrettably did not have the opportunity to visit the important region of southern Kenya that is home to the Maasai people and East Africa's most iconic wilderness and the wildlife, to see firsthand how economic growth is fueled by partnerships and the entrepreneurial determination of the Maasai people. In the 20th century, the Maasai, a tribe of traditional semi-nomadic cattle-herders, lost much of their land to the British and the Kenyan government. In recent years, the Maasai have been impacted by climate change and severe droughts. Rather than abandon their traditions and culture, 15 years ago the Maasai people of Kuku Group Ranch in southern Kenya near Mount Kilimanjaro, had a vision for how they could preserve and honor their heritage through ecotourism. They created a pioneering partnership between the eco-lodge of Campi ya Kanzi and the Maasai Wilderness Conservation Trust (MWCT) that has become a model for how conservation and community can come together to serve the wildlife, the wilderness and the Maasai people. \nEnter Edward Norton. \nMost of us know Edward as an exceptionally talented, Oscar-nominated actor and filmmaker. Over the past few years, I have had the opportunity to learn about another of Edward's passions - conservation. He comes by this passion honestly - his father is an internationally renowned conservation activist - and has been committed to conservation causes for many years. \nSince his first visit to the Campi ya Kanzi and MWCT in 2000, Edward has supported and served as U.S. Board President of the MWCT. His involvement spans about the same amount of time we at Susan G. Komen have worked with breast cancer programs in Kenya. Our mutual investment in the health of women in the region has had unanticipated but beneficial results. I asked Edward to join me in a conversation to share his thoughts on our unique partnership. \nJUDY: Thank you for helping tell the story of how health and conservation work together. \nEDWARD: MWCT works holistically with the Maasai on conservation, health, and education. The health of the community is of vital importance because we believe that successful, sustainable conservation programs work best when they come from a \"people's needs first\" perspective. Meaning that people must first be healthy and thriving in order for them to be great stewards of their ecosystem. \nAt MWCT, our partnership with Susan G. Komen is the embodiment of successful, sustainable, holistic programs. \nJUDY: As a women's breast cancer organization, we couldn't agree more on the wisdom of investing in health to strengthen communities. In Kenya, women are diagnosed with breast cancer at much earlier ages than African-American women -- about 10 years younger. They're often diagnosed at advanced stages of the disease. Access to information and health care is a significant problem. And we understand that women are often at the heart of the community. We've been funding breast cancer programs in Kenya since 2001, and gave our first grants to the Maasai Wilderness Conservation Trust four years ago, helping to underwrite the salary of a health director and a breast cancer education program. What specifically has been achieved with this support? \nEDWARD: Support from Komen provided MWCT with a Health Director that serves the most rural and under-served Maasai communities in the region. The results of this investment in women's health are truly transformative. In the process of educating women about their health to end breast cancer, the health of the entire community and its ecosystem has improved dramatically. You can see this in one incredible example where the women that attended the health outreach programs banded together to do more, to increase their empowerment and economic independence. They formed a group where, in partnership with MWCT and A New Course, the group started a seed bank that provides them with additional income while restoring the grasslands in this important ecosystem. The women are increasing their health, the health of their families, and the ecosystem. This all started with Susan G Komen's investment. We are grateful to be a partner with Susan G. Komen. \nJUDY: So it comes full circle - \nEDWARD: It has truly made a difference for these women and this community. And on a programmatic level, it's also allowed us at the Maasai Wilderness Conservation Trust to leverage the reach of a very small staff offering very rudimentary health services. Funding for the health director gave us the ability to connect with national health services, procure medications and identify equipment that we need, for example. Out of this very simple type of support, we've seen a lot of short- and long-term change, all for the better. \nJUDY: That long-term change, the long-term sustainability of programs like these, is key. Komen works in 30 countries worldwide, in partnerships like these, always with an eye toward sharing what we know and helping to build programs that can be sustained locally for a very long time. \nEDWARD - And it's a model for other innovations that MWCT is working on, like a carbon credit brokerage and solar conservancies. We work best when we can bring together the macro resources and expertise of global organizations like Komen, with local people who are working to improve their lives. \nJUDY - Edward, it's very rewarding to be working with organizations like the Maasai Wilderness Conservation Trust and with advocates like you who are making a difference. Thank you for your dedication. \nEDWARD - And thank you, Judy and Komen, for helping to jumpstart real progress in the lives of the Maasai women. \nFor more information on the Maasai Wilderness Conservation Trust and Komen's international programs, visit maasaiwilderness.org or komen.org \nFollow Judith A. Salerno on Twitter: www.twitter.com/Judy_KomenCEO More:", "external_links": [], "published": "2015-08-07T01:42:00.000+03:00", "crawled": "2015-08-07T02:01:32.122+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}