{"organizations": [], "uuid": "8119b7713a0683474f86f52d01e19ae481b768ee", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55bfe1b81d00003000143b3f.jpeg?cache=FyXNjS51zs", "site_section": "http://www.huffingtonpost.com//feeds/index.xml", "section_title": "The Huffington Post | The Full Feed", "url": "http://www.huffingtonpost.com/entry/obama-human-trafficking_55bfe134e4b06363d5a33137", "country": "US", "title": "Obama Political Staff Overruled Human Rights Experts On Slavery Report", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Political Staff Overruled Human Rights Experts On Slavery Report", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-04T01:39:00.000+03:00", "replies_count": 0, "uuid": "8119b7713a0683474f86f52d01e19ae481b768ee"}, "author": "Zach Carter", "url": "http://www.huffingtonpost.com/entry/obama-human-trafficking_55bfe134e4b06363d5a33137", "ord_in_thread": 0, "title": "Obama Political Staff Overruled Human Rights Experts On Slavery Report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Political Staff Overruled Human Rights Experts On Slavery Report The president may have just compromised his global human rights agenda. Zach Carter Senior Political Economy Reporter, The Huffington Post Posted: 08/03/2015 06:39 PM EDT Credit: Anadolu Agency via Getty Images \nWASHINGTON -- Top diplomats at the State Department repeatedly overruled human rights experts in the crafting of a recent report on human trafficking, Reuters reported Monday night , elevating concerns that the Obama administration compromised a key diplomatic tool to advance other political goals. \nLawmakers from President Barack Obama's own party had previously pilloried the administration's official Trafficking In Persons report, which is used to shame governments that support or tolerate modern-day slavery. Experts say the report has successfully been used in the past to improve worker protections abroad. But in July, the administration upgraded several nations -- including Malaysia, Cuba and Saudi Arabia -- that independent human rights experts said had done little to improve their human trafficking status. \nLawmakers and human rights activists said that several of these favorable rulings appear to be connected to unrelated political projects. An upgrade for Malaysia, for instance, effectively makes the country eligible for participation in the Trans-Pacific Partnership, a controversial trade pact the Obama administration is negotiating with 11 other Pacific Rim countries. \n\"Malaysia's record on curbing human trafficking is just not sufficient to justify an upgrade,\" Sarah Margon, the Washington director at Human Rights Watch, told The Huffington Post in July. \"And I think it's damaging to the integrity of the report.\" \nThe Obama administration recently reopened diplomatic ties with Cuba, while Saudi Arabia has been upset with the recent diplomatic agreement designed to prevent Iran from developing nuclear weapons. \nSens. Robert Menendez (D-N.J.) and Rob Portman (R-Ohio) criticized Malaysia's upgrade, as did Reps. Sander Levin (D-Mich.), Rosa DeLauro (D-Conn.), Lloyd Doggett (D-Texas) and others. Labor advocates said the upgrade undermines Obama's repeated vow that the TPP deal would include robust, enforceable labor standards. Malaysia had been previously labeled a \"Tier 3\" country -- the worst possible category on the list. The country is home to a robust sex slavery industry, and its electronics sector includes widespread forced labor. In April, the bodies of more than 130 human trafficking victims were found in mass graves near the country's northern border with Thailand. \nOn Monday, Reuters reported that political staff at the State Department had successfully pressed for higher human trafficking rankings for Malaysia, Cuba and other countries, over the objections of human rights staffers. While diplomats and political appointees are always involved in the TIP report process, this year, human rights experts found themselves facing unusually stiff opposition from higher-ups. According to Reuters , analysts at the State Department's Office to Monitor and Combat Trafficking in Persons objected to 17 country ratings assigned by top staffers, but only prevailed on three of those cases -- the lowest such percentage since the U.S. government began issuing the report in 2001. \nIn a statement provided to HuffPost, the State Department denied that the report had been politicized. \n‎\"As is always the case, final decisions are reached only after rigorous analysis and discussion between the TIP office, relevant regional bureaus and senior State Department leaders,\" State Department spokesman John Kirby told HuffPost. \"The Secretary of State approves final country narratives and tier rankings.\" \nHuman rights advocates say that allowing political considerations to skew the human trafficking report could render the report less effective in the future. \nDiplomats also successfully kept human rights officials from downgrading China in this year's report. However, human rights experts did prevent higher-ups from boosting the ranking of Thailand, a nation notorious for slavery in its seafood industry .", "external_links": [], "published": "2015-08-04T01:39:00.000+03:00", "crawled": "2015-08-04T01:46:09.209+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}