{"organizations": [], "uuid": "ba3143b8a43fb47eb3dbb824a90d6c60d1d218f5", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/energy-environment/254866-greenpeace-urges-indian-prime-minister-modi-to-press", "country": "US", "title": "Greenpeace urges Indian Prime Minister Modi to press Obama on climate change", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Greenpeace urges Indian Prime Minister Modi to press Obama on climate change", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-25T06:50:00.000+03:00", "replies_count": 0, "uuid": "ba3143b8a43fb47eb3dbb824a90d6c60d1d218f5"}, "author": "Vinuta Gopal and Annie Leonard", "url": "http://thehill.com/blogs/congress-blog/energy-environment/254866-greenpeace-urges-indian-prime-minister-modi-to-press", "ord_in_thread": 0, "title": "Greenpeace urges Indian Prime Minister Modi to press Obama on climate change", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 24, 2015, 11:50 pm Greenpeace urges Indian Prime Minister Modi to press Obama on climate change By Vinuta Gopal and Annie Leonard \nDear Prime Minister Modi, \nIt is with great optimism and hope that we are following news about the meeting you will have with U.S. President Barack Obama, at this critical time in our planet’s future. 2015 is the year for making decisive commitments towards tackling climate change together. As the elected leader of the world’s largest democracy, and a country with much to lose from runaway climate change, the hopes of 1.2 billion Indian citizens rest on you. Along with them, and the millions of people worldwide who will inevitably be affected by decisions made this year, we hope you will successfully push the United States, and the developed world, towards an ambitious and equitable global agreement to rein in climate change. ADVERTISEMENT We congratulate you on setting new and ambitious renewable energy targets, and urge a focus on decentralized renewable energy as the fastest, most cost-effective way to tackle India’s energy poverty challenge. At the same time, we believe that continued growth in coal power is not in the interests of common Indians as it imposes a significantly higher cost on people's health, livelihood of communities and the environment, and will prove far more expensive than renewable energy. We hope you will secure much-needed support from global partners, civil society and investors – including the United States administration - to realize these renewable energy goals. \nUnder Obama’s stewardship, the U.S. has recently made several steps in the right direction, announcing a Clean Power Plan (to restrict emissions from coal power plants) and new fuel efficiency standards for the transport sector. However, as we hope you will be able to impress upon him, these steps by themselves are woefully inadequate when compared to the scale of the problem facing us, and the responsibility that the United States bears for the problem of climate change. Other actions taken by the Obama administration serve to exacerbate the climate change problem, undermining the steps the US has taken. As Greenpeace US said in August 2015, “If the Obama administration is serious about leaving behind both a positive climate legacy and a habitable planet for our children, it will stop the drilling and mining of publicly owned fossil fuels...” \nIn this spirit of working towards a common future, may we ask that you urge Obama to reconsider his administration’s actions that significantly undermine the fight against climate change. If Obama is serious about the United States leading the fight against climate change, he must address the following issues: The US continues to fight a WTO case against India’s domestic content requirements for the solar sector, undermining India’s shift to renewable energy and the fight against climate change. The US is opening up vast offshore and deep sea areas for oil extraction, including ecologically critical areas such as the Arctic. Exploiting the Arctic’s oil reserves will cause climate change to spiral out of control. The US continues to subsidise fossil fuels, most notably through its program to lease out large coal deposits on government land. During the Obama administration alone, 2.2 billion tons of federally-owned coal has been leased out. \nToday, we are all engaged in a historic struggle to maintain our planet’s life support systems for future generations, and we remain committed to supporting all efforts in this direction. When it comes to tackling climate change and meeting the UN’s Sustainable Development Goals, a healthy dialogue with civil society can significantly strengthen governments’ efforts to hold developed countries to their climate obligations, and uphold the rights of developing nations such as India. \nIn the same spirit of constructive cooperation, may we also ask you to take note of the campaign of intimidation that the Indian Ministry of Home Affairs is currently engaged in against Greenpeace India and other legitimate NGOs? The actions of some officials in the MHA, and the resultant shrinking of the space for constructive dialogue have served to tarnish India’s international standing as a country that respects free speech and democracy. At a time when we need to focus instead on the imperatives of the environmental issues facing us all, these actions serve merely as a distraction, and raise serious questions about your government’s commitment to democracy and to addressing environmental issues. \nCollaboration between the government and civil society is essential to secure a bright future for India and the planet. Greenpeace looks forward to working with the Indian government on our common objective of ensuring clean, affordable renewable energy for all. \nGopal is interim executive director of Greenpeace India and Leonard is executive director of Greenpeace US.", "external_links": [], "published": "2015-09-25T06:50:00.000+03:00", "crawled": "2015-09-25T07:42:20.913+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}