{"organizations": [], "uuid": "15ff8e935eed1359cb1ffb7d4894b5a0034ec36c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/plannedparent.png", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/business-a-lobbying/249918-abortion-provider-group-sues-to-stop-release-of-undercover-footage", "country": "US", "title": "Abortion providers sue to stop release of more undercover videos", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Abortion providers sue to stop release of more undercover videos", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-31T19:32:00.000+03:00", "replies_count": 0, "uuid": "15ff8e935eed1359cb1ffb7d4894b5a0034ec36c"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/business-a-lobbying/249918-abortion-provider-group-sues-to-stop-release-of-undercover-footage", "ord_in_thread": 0, "title": "Abortion providers sue to stop release of more undercover videos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Abortion providers sue to stop release of more undercover videos YouTube By Sarah Ferris - 07/31/15 12:32 PM EDT The National Abortion Federation is asking a California court to block the release of secretly recorded footage that anti-abortion activists could use in their campaign against Planned Parenthood. The organization — which represents abortion providers nationwide, including those at Planned Parenthood clinics — filed suit Friday for a temporary restraining order against the Center for Medical Progress, which it said deceptively attended meetings where highly sensitive topics were discussed. The move comes one day after a Planned Parenthood partner — a medical research company called Stem Express — won a temporary restraining order from a California court that prevents the Center from releasing any footage featuring its officials. Vicki Saporta, the association’s president, said she wanted to prevent more members from being included in the videos, which she said have already led to death threats online. “Each video has been edited in such a way as to misrepresent and demonize abortion providers, and as a result, there have been death threats made online against those in the videos,” Saporta said. “We can expect similar threats against providers whose names and identities are revealed in future videos and releases from CMP,” said Saporta. “That is why it is so important for us to get a temporary restraining order.” \nMembers of the Center for Medical Progress had attended meetings in which abortion providers discuss “the latest research and advances in their field,” she said. David Daleiden, the founder of the Center for Medical Progress, has dismissed claims that his organization illegally entered clinics to obtain the footage. “The Center for Medical Progress follows all applicable laws in the course of our investigative journalism work,” he told CNN on Friday. “We're of course ready to contest any infringement or attempt to suppress or silence our free speech rights and our rights under the First Amendment to publish.”", "external_links": [], "published": "2015-07-31T19:32:00.000+03:00", "crawled": "2015-08-01T02:07:37.892+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}