{"organizations": [], "uuid": "09e9b86be6854efe74756bf6d267847e19872d32", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/marcy-winograd/schumers-dear-john-to-obama_b_7956050.html", "country": "US", "title": "Schumer's Dear John to Obama on Iran Deal; Confessions of a Conflicted Lover | Marcy Winograd", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Schumer's Dear John to Obama on Iran Deal; Confessions of a Conflicted Lover | Marcy Winograd", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-11T23:09:00.000+03:00", "replies_count": 0, "uuid": "09e9b86be6854efe74756bf6d267847e19872d32"}, "author": "Marcy Winograd", "url": "http://www.huffingtonpost.com/marcy-winograd/schumers-dear-john-to-obama_b_7956050.html", "ord_in_thread": 0, "title": "Schumer's Dear John to Obama on Iran Deal; Confessions of a Conflicted Lover | Marcy Winograd", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New York Senator Chuck Schumer's statement opposing the Iran deal reads like a wishy-washy-wish-I-didn't-have-to-write-this Dear John letter to President Obama. Yes, breaking up is hard to do, especially when your other lover is the American Israel Public Affairs Committee (AIPAC) and they've got you by the gonads -- spending upwards of 40 million dollars to convince your 400,000 Jewish constituents to jam your phone lines and demonstrate in front of your office until you issue a rambling 1600-word statement that ends sheepishly with, \"I believe the vote to disapprove is the right one.\"\nI believe?\nBeing an English teacher, I find the use of the preface \"I believe\" revealing in its lack of conviction.\nIt's just something I believe, while you may believe something else. What I'm saying is not necessarily the case; it's just something I believe.\nIn his statement, Schumer uses \"I believe\" twice, \"To me\" twice, \"I think\" once, and \"in my view\" once.\nI'm afraid Senator Schumer would fail Persuasive Writing 101 because using words like \"I believe\" or \"I think\" or \"To me\" are the English teacher's no-no's, warning signs to the reader that the writer is unsure, second-guessing himself. On the other hand, if the writer is not trying to persuade anyone but is instead trying only to appease both lovers, to keep one dangling while the other publicly celebrates but quietly questions -- Will he vote to override the Presidential veto or just vote to oppose the deal? -- then \"I believe\" is a useful stalling technique which gives the writer more time to make up his mind as to which lover he will marry.\nBefore delivering the final Dear John blow, Schumer -- slated to become the Senate Majority Leader if the Democrats retake the Senate -- spends a hefty paragraph professing his love and admiration for President Obama and Secretary of State Kerry.\nThe President, Secretary Kerry and their team have spent painstaking months and years pushing Iran to come to an agreement. Iran would not have come to the table without the President's persistent efforts to convince the Europeans, the Russians, and the Chinese to join in the sanctions.\nHe credits the President with speeding the development of the terrifying MOP (not broom), the Massive Ordinance Penetrator (What guy with a small penis came up with this name?), a 30,000 pound bunker buster bomb that can reportedly penetrate 200 feet of earth and 60 feet of concrete (Iran's Fordow nuclear facility) before detonating. Such an explosion could potentially poison over a million people living in Qum, Iran's 8th largest city, near where the underground uranium enrichment facility is located.\nSchumer's praise of the mother of all non-nuclear bombs, calling the MOP \"the best nuclear deterrent,\" explains why President Obama has likened the vote on the Joint Comprehensive Plan of Action to the Iraq War Resolution and why he has framed the vote as a choice between war and peace. To Schumer the MOP is a \"deterrent\" but to the rest of us, to those listening to Obama's urgency, the MOP is more than a deterrent; it's a weapon the Israelis will want the U.S. to unleash if Congress fails to support the Iran Nuclear Deal. According to The Guardian , even former President George Bush, the man who launched the disastrous invasion and occupation of Iraq, refused to go along with Israel's request to wage war on Iran.\nImagine the possible fall-out of a strike on Fordow. Toxic chemicals and radiation spewed for miles, thousands of Iranians dead or dying, Holy War declared throughout the Middle East, U.S. military bases blown up in Iraq, Saudi Arabia, and Kuwait, oil fields sabotaged, stock markets crashed, global fear of a Third World War unleashed.\nThe thought of such a scenario should be enough to convince any reasonable mind that diplomacy is the path to security, but Schumer buckled under the pressure of 10,000 naysayer phone calls and angry protests outside his office.\nIn Schumer's opposition statement, he says he objects to the deal because the U.S. cannot demand inspections unilaterally but must wait for a majority of the P5+1 nations (US., China, Russia, France, England, and Germany) to demand inspections, as well. Isn't joint cooperation the basis, however, of an international agreement? Schumer issues the same objection in regard to the snap-back provisions, arguing the U.S. should be able to unilaterally re-impose sanctions for nuclear violations. He conveniently fails to mention the agreement allows all signatories to unilaterally impose non-nuclear related sanctions. Schumer objects to the 24-day delay in inspections of Iran's nuclear sites, but never once mentions that Israel, widely assumed to be a nuclear armed nation, prohibits UN inspections of its nuclear facilities and, unlike Iran, refuses to become a signatory to the Nuclear Non-Proliferation Treaty that commits the signatory to split the atom only for peaceful purposes.\nAnyone who doubts Schumer is a conflicted lover need only to read his statement, \"... it seems to me (another \"I believe\" bit of second-guessing), when it comes to the nuclear aspects of the agreement within ten years, we might be slightly better off with it. However, when it comes to the nuclear aspects after ten years and the non-nuclear aspects, we would be better off without it.\"\nHello?\nI thought this was supposed to be an agreement that dealt strictly with Iran's nuclear capability, eliminating two-thirds of Iran's current centrifuges and 98 percent of its enriched-uranium stockpile. No one ever said the deal was about anything else.\nApparently it is.\nWhile Schumer said he would vote to disapprove of the Joint Comprehensive Agreement, he did not say he would vote to override a Presidential veto.\nLike any calculating lover, he wants to keep his options open.\nMarcy Winograd is a high school English teacher in the Los Angeles Unified School District. In 2010, she mobilized 41 percent of the Democratic Party primary vote when she ran as a congressional peace candidate challenging Blue Dog incumbent Jane Harman.\nFollow Marcy Winograd on Twitter: www.twitter.com/Marcywinograd\nMore: Iran Nuclear Deal Aipac Iran Sanctions Senator Chuck Schumer US Iran Relations Iran Nuclear Weapons This Blogger's Books and Other Items from... New Girl on Salt Flat Road\nby Marcy Winograd, Jackie Hirtz Lola Zola and the Lemonade Crush\nby Marcy Winograd, Jackie Hirtz", "external_links": ["http://www.newsweek.com/chuck-schumer-obama-iran-nuclear-deal-israel-356158", "http://www.theguardian.com/world/2008/sep/25/iran.israelandthepalestinians1", "http://ecx.images-amazon.com/images/I/51xxyocYIZL._SL160_.jpg", "https://medium.com/@SenSchumer/my-position-on-the-iran-deal-e976b2f13478", "http://ecx.images-amazon.com/images/I/41348NmPpaL._SL160_.jpg", "http://www.washingtonpost.com/news/post-politics/wp/2015/08/05/text-obama-gives-a-speech-about-the-iran-nuclear-deal/", "http://www.amazon.com/exec/obidos/ASIN/1469958376", "http://www.amazon.com/exec/obidos/ASIN/162517828X", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.amazon.com/", "http://www.twitter.com/Marcywinograd"], "published": "2015-08-11T23:09:00.000+03:00", "crawled": "2015-08-11T22:19:51.533+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}