{"organizations": [], "uuid": "aaac44e987f17bcd4f473b9d5df09f644faa4455", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/blog.xml", "section_title": "WorldPost Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/christina-fialho/president-obama-release-j_b_8001666.html", "country": "US", "title": "President Obama: Release Jewish Homeschooling Family Imprisoned in the United States | Christina Fialho", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 7, "title_full": "President Obama: Release Jewish Homeschooling Family Imprisoned in the United States | Christina Fialho", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-19T02:45:00.000+03:00", "replies_count": 6, "uuid": "d34b3054b55b3d16b689dcfbce80076d60bf1bb3"}, "author": "Christina Fialho", "url": "http://www.huffingtonpost.com/christina-fialho/president-obama-release-j_b_8001666.html#post-0", "ord_in_thread": 0, "title": "President Obama: Release Jewish Homeschooling Family Imprisoned in the United States | Christina Fialho", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Albrecht family's story reads like a Kafka novel, but begins with an e-mail from former Bay Watch actress Alexandra Paul.\nOn a tip from Paul, U.S. Immigration & Customs Enforcement (ICE) raided the home of the Albrecht family, who was living undocumented in Los Angeles since 2011. On the morning of September 4, 2014, ICE arrested Petra Albrecht and her daughter Nicole, and refused to leave Petra's 11-year-old son, Jayson, in the custody of his grandmother. Instead, Children and Family Services removed Jayson from his home later that day and placed him with a foster family. Government records indicate that ICE received an e-mail from Paul the day after she was served with a temporary restraining order for allegedly attempting to attack the Albrecht family with her car. After the Albrecht's immigration arrest, the pending court hearing against Paul on September 16, 2014, was dismissed.\nPetra, a single mother, explains that ICE's intrusion on the morning of September 4th triggered flashbacks to a similar incident in her home country of Germany just four years ago. The Jewish family fled to the United States in 2011 from Oberhavel County, Germany, after the Jugendamt --a branch of the German government--allegedly raided their home and threatened to separate the family. The Jugendamt has been criticized for its human rights violations , and opponents believe the agency amounts to a \" government child-trafficking network .\"\nAnti-Semitism, Homeschooling, and Asylum\nPetra had chosen to home school her youngest child Jayson because he was experiencing anti-Semitic bullying in his public school. At least one-fourth of the German population is openly anti-Semitic , and neo-Nazi activity has been on a rise in recent years. In fact, according to the BBC, neo-Nazis have murdered more people in post-war Germany than any other single group.\nYet, Petra was not free in Germany to home school her children because Germany has banned homeschooling since World War I. German families who choose to homeschool their children face legal action, including imprisonment, the loss of custody of their children and fines. The United States, where homeschooling has been legal in all 50 states for more than a generation, does not recognize homeschooling as a valid claim for asylum. Earlier this year, Republicans in Congress advanced a bill to grant asylum to families who want to homeschool their children, but the bill failed to gain bi-partisan support because its authors refused to recognize the importance of protecting all asylum seekers. While the bill may have helped families like the Albrechts, it would have come at the expense of unaccompanied children. Specifically, it would have raised the standards for unaccompanied children to prove that they would be threatened if deported.\nIn what seems like an effort to enforce Germany's antiquated law, the Jugendamt terminated the parental rights of Petra over her son Jayson in June 2011. Left with no other choice, Petra came to the United States with her children on a visa waiver program. The Albrecht family explains that they spent the next three years ensuring that Jayson was educated at home.\n\"My mother and I believe in fundamental freedoms, and that parents have a right to direct their children's education, as per the core values with which a child has been brought up,\" says Nicole, Jayson's older sister, who has spent the last 11 months in U.S. immigration detention.\nU.S. Immigration Detention, Extradition, & Violations of the Law\nNicole and Petra were first detained together at the James Musick Jail in Orange County, California. Six days into their detention, after refusing to sign deportation documents, ICE retaliated against the family by separating mother and daughter. ICE transferred Petra to the Otay Detention Center, 100 miles further from her son Jayson. Later, around November 6, 2014, after Nicole filed approximately 10 grievances with the jail and the federal government about the inhumane detention conditions, ICE responded not by addressing the grievances, but by transferring Nicole to a higher security jail, the Santa Ana City Jail (SACJ).\nMeanwhile, in violation of the agency's own Parental Interests Directive , ICE prevented Petra from appearing in family court to retain custody over Jayson. \"I was not allowed to attend any court hearings and ask questions, therefore I could not defend and represent myself,\" wrote Petra in December 2014 to ICE's Chief Counsel in Los Angeles.\nOn December 17, 2014, a family court in California ordered Jayson extradited back to Germany--the very country from which he was applying for asylum. The U.S. government allowed this extradition in violation of the most fundamental principle of refugee law, the principle of non-refoulement . Because he had a pending asylum claim, Jayson had a right not to be refouled, that is, not to be forcibly returned to a place where he believed he would face a threat of persecution. Jayson deserved his day in court, and by allowing his extradition, the U.S. government deprived him of his right to have his asylum case adjudicated. Jayson is now living in an unspecified orphanage in Berlin; the German government refuses to notify the family of his exact whereabouts.\nJust a few days before his extradition, Jayson wrote to his sister Nicole at SACJ: \"I will try my best to stay with you here in America...I can't stop thinking of you when I go to bed. I love you very much and I hope you write me back.\"\nSeparated from each other and from Jayson for nearly a year, Petra and Nicole remain locked up with limited freedoms, helplessly in the dark about Jayson's well-being and unable to console his or each other's suffering. The U.S. government has refused to release Petra and Nicole on an immigration bond. And since January 2015, the family's attorney, Josh Effron, has submitted four petitions to ICE on behalf of Petra and Nicole for humanitarian parole, or release; according to Effron, ICE has responded with mere form letters affirming its refusal to release Petra and Nicole, but without giving detailed reasons.\nFurthermore, Nicole has been prevented from communicating with her attorney. The U.S. government has thrown Nicole into administrative segregation, or solitary confinement, at SACJ on multiple occasions, due to seemingly baseless reasons, which has contributed to her declining health. She spent the 14 days leading up to her asylum hearing in solitary confinement as well as the 24 hours prior to her bond hearing, and according to her attorney, she was prevented many times from making phone calls to him.\nMore recently, on May 15th, Nicole and 21 other women at SACJ filed a multi-individual complaint with the federal government, citing \"neglect and mistreatment,\" including physical and verbal assaults as well as medical neglect and violations of federal guidelines. Various ICE officers are named in the complaint, yet it was an ICE assistant field office director who interviewed some of the women on May 28, 2015. Unsurprisingly, ICE concluded that the accusations were unfounded. Shortly thereafter, many of the complainants were deported or transferred from the facility, according to a few of the women remaining. Five of the women who remain detained at SACJ filed a follow-up complaint, which Nicole says ICE has ignored.\nAt the Otay Detention Center, women like Petra also report inadequate medical care. Petra herself was prematurely reduced to a wheelchair for many months, and she now walks with a cane or walker. She also now suffers from chronic back issues with at least three herniated discs in her back. Her condition became unmanageable for the staff at Otay, and ICE eventually took her to emergency at the Sharp Chula Vista Medical Center on December 20, 2014. She continues to suffer from what she refers to as unbearable physical pain at Otay.\nPetra's and Nicole's experiences in the U.S. immigration detention system, unfortunately, are commonplace. Hidden from public view, immigration detention has become a black hole for civil rights.\n\"The targeted discrimination the government has taken against my wife, mother-in-law, and my 11-year old nephew is deplorable,\" says Nicole's U.S. citizen husband and Jayson's uncle, Richard Wheeler. \"I was never aware that this hypocritical system existed in the United States, the supposed champion of rights and freedoms of the world. This has been a nightmare of civil and human rights violations from day one.\"\nOur Demands\nCommunity Initiatives for Visiting Immigrants in Confinement (CIVIC) , a national advocacy organization for people in immigration detention, is concerned that ICE interfered with the administration of justice by refusing to allow Petra to attend her family court hearings and Nicole to speak with her attorney on multiple occasions. Additionally, ICE's actions against Nicole and Petra raise grave First Amendment concerns, as they seem to be in retaliation for Nicole's exercise of free speech. Furthermore, the U.S. government may have violated multiple domestic and international laws when it allowed Germany to extradite Jayson.\nToday, CIVIC and a robust multifaith coalition affiliated with Groundswell have launched a petition and are calling on President Obama to:\n(1) Release Petra Albrecht and Nicole Albrecht from immigration detention;\n(2) Grant them the ability to stay in the United States by administratively closing their cases, as has been done in other German homeschooling asylum cases, such as the Romeike family ; and\n(3) Work with the German government to reunite Jayson Albrecht with his mother and sister in the United States to be educated freely and surrounded by the love of his family.\nFollow Christina Fialho on Twitter: www.twitter.com/endisolation\nMore: Immigration Detention Homeschooling Germany Anti Semitism Judaism Extradition Jugendamt Barack Obama Immigration and Customs Enforcement", "external_links": ["http://lib.ohchr.org/HRBodies/UPR/Documents/Session4/DE/LCR_GER_UPR_S4_2009_LeagueforChildrensRights.pdf", "http://radaronline.com/exclusives/2014/09/alexandra-paul-restraining-order-immigration-deportation/", "http://www.twitter.com/endisolation", "http://action.groundswell-mvmt.org/p/endisolation", "http://www.cbn.com/cbnnews/world/2010/March/Child-Welfare-Agency-Echoes-Nazi-Germany/", "http://www.bbc.com/news/world-europe-17514394", "http://abcnews.go.com/US/home-schooling-german-family-allowed-stay-us/story?id=22788876", "http://www.unhcr.org/419c75ce4.html", "http://thinkprogress.org/immigration/2015/04/10/3644885/asylum-bill-homeschoolers/", "http://www.washingtonpost.com/news/morning-mix/wp/2014/07/23/anti-semitic-riots-in-europe-took-us-back-to-1938/", "http://www.ice.gov/parental-interest"], "published": "2015-08-19T02:45:00.000+03:00", "crawled": "2015-08-19T03:53:35.250+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}