{"organizations": [], "uuid": "8a4782aa802284752f46709f4a09157504d7370b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_091015getty_0.jpg", "site_section": "http://thehill.com/taxonomy/term/1752/feed", "section_title": "House", "url": "http://thehill.com/blogs/blog-briefing-room/253390-obama-dismisses-house-iran-vote", "country": "US", "title": "Obama dismisses House Iran vote", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama dismisses House Iran vote", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-11T21:19:00.000+03:00", "replies_count": 0, "uuid": "8a4782aa802284752f46709f4a09157504d7370b"}, "author": "csegal@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/253390-obama-dismisses-house-iran-vote", "ord_in_thread": 0, "title": "Obama dismisses House Iran vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 11, 2015, 02:19 pm Obama dismisses House Iran vote By Jordan Fabian President Obama on Friday dismissed a House vote against the Iran nuclear deal. Obama said in a statement he is grateful that lawmakers “who have taken care to judge the deal on the merits” are backing it. ADVERTISEMENT “Today’s vote in the House of Representatives is the latest indication that the more members have studied the historic deal that will prevent Iran from obtaining a nuclear weapon, the more they have come out in support of it,” he said. The House on Friday voted 162-269 to reject a resolution to approve the Iran nuclear deal. The vote was largely a symbolic rebuke of Obama, who has made the nuclear pact the centerpiece of his foreign policy legacy. The vote will not prevent the nuclear agreement from taking effect. The Senate, which failed to advance a disapproval resolution on Thursday, is not expected to take up the House measure. But the House vote served to expose divisions within Obama's party over the controversial agreement, which would lift sanctions on Iran in exchange for limits to its nuclear program. Twenty-five House Democrats voted against the measure. But Obama praised House Minority Leader Nancy Pelosi (D-Calif.) for leading an effort to build support for the deal in Congress. More than two-thirds of House Democrats voted together on Friday, enough to sustain a presidential veto if the legislation had gone that route. Under pressure from conservatives, House Republican leaders abandoned a plan to vote on a resolution of disapproval. Instead, they set up a complex legislative maneuver that could pave the way to a lawsuit against the deal. Obama said the country should turn its attention toward putting the deal into place. “Now, we must turn to the critical work of implementing and verifying this deal so that Iran cannot pursue a nuclear weapon,” Obama said. “In doing so, we’ll write the latest chapter of American leadership in the pursuit of a safer, more hopeful world.” Tags: Past: 1 day House rejects Obama's Iran deal The vote underscored how controversial the accord has been with Democrats. Biden opens up on loss of his son... “I’d be lying if I said that I knew I was there,” he says. “I’m being... Huckabee says Dred Scott still ‘... The infamous decision was overturned by the 14th Amendment. GOP in quagmire over refugees A political fight over the refugee crisis in Europe is spreading to the... DNC chair closes door on more... “We’re not changing the process. We’re having six debates,” she said. Conservative lawmaker insists GOP... Rep. Jim Jordan says party needs to make its case in \"a compelling,... Obama dismisses House Iran vote His comments came after the House rejected the Iran deal. McConnell: Planned Parenthood... McConnell wants a \"clean\" funding bill to be approved. Walker falls to 10th in Iowa in... The former front-runner's standing has fallen steadily since Trump joined... Dems filibuster Iran vote GOP says it will force more votes on Iran next week. Climate change: Seven indisputable... The truth is there are more questions about climate change than there are... Navy chief rejects report showing... Navy Secretary Ray Mabus said the report was biased. Lone House Republican votes '... Rep. Thomas Massie argued the deal is a treaty not subject to House... GOP senators file challenge over... Three Republicans say the president hasn't followed the law in pursuing... Trump says deportations of... He said that goal could be met with \"really good management.\" Trump’s 9/11 ‘haters and losers’... A spokesman for Trump said the tweet was from several years ago. Fiorina officially makes cut for... CNN revealed the 11 GOP presidential candidates that will make their prime... Donald Trump doesn't care And that's why he's leading in the polls, and leaving pundits... Bond actor donates $47,000 to... However, Sanders' campaign has asked the PAC to cease and desist. House panel votes to lift oil... The action is a significant step toward passing the legislation. Study: All-male Marine units... Ground combat units with only men were faster, more lethal and less... Top radio host vows to quit job if... Says it's \"not happening.\" Pro-Clinton group: Maybe private... \"The U.S. government has been hacked on numerous occasions,\" the super-PAC... House votes to accuse Obama of... House Republicans want to see the side deals between Iran and the IAEA. White House holds 9/11 moment of... Obama walked out at 8:46 a.m., the time when the first plane struck the...", "external_links": [], "published": "2015-09-11T21:19:00.000+03:00", "crawled": "2015-09-11T22:06:50.238+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}