{"organizations": [], "uuid": "ca16550784d1298a36f758412f24e77419f8c79b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3479858/images/o-MARIJUANA-ARREST-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/crime/blog.xml", "section_title": "Crime Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/amanda-reiman/2014-marijuana-arrests_b_8215204.html", "country": "US", "title": "In 2014, Someone Was Arrested for Marijuana Every 45 Seconds | Amanda Reiman", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "In 2014, Someone Was Arrested for Marijuana Every 45 Seconds | Amanda Reiman", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-29T20:59:00.000+03:00", "replies_count": 0, "uuid": "ca16550784d1298a36f758412f24e77419f8c79b"}, "author": "Amanda Reiman", "url": "http://www.huffingtonpost.com/amanda-reiman/2014-marijuana-arrests_b_8215204.html", "ord_in_thread": 0, "title": "In 2014, Someone Was Arrested for Marijuana Every 45 Seconds | Amanda Reiman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Every 45 seconds a life and a future is put in jeopardy.\nEvery 45 seconds, something that 38 percent of Americans admit to doing becomes an insurmountable barrier to future success. Barriers that are not placed randomly, but with intent so that they fall on the heads of the same people, in the same places over and over again.\nEvery 45 seconds, something that is the butt of jokes among well-fed politicians becomes a life-ending third strike for someone else.\nIn 2014 there were 700,993 arrests for marijuana in the United States. That's one every 45 seconds. That's also 7,000 more than the last year, with nearly 90 percent of those arrests for simple possession.\nTo look at the news reports coming out of states like Colorado, Washington and Oregon, it's hard to imagine such a sweeping disparity between the haves and the have nots of legalization. However, while folks on the west coast enjoy a day of cannabis yoga and art openings , possession of any amount of marijuana in Oklahoma can land you in jail for a year, with a subsequent possession offense deemed a felony, punishable by two to 10 years in prison.\nDue to the falling number of arrests in the legal states, and given the rise in arrests nationwide, those in prohibition states are getting hit harder than ever before. And while I am among those excited by the de-stigmatization of cannabis use and its emergence on the socio-cultural scenes in states like Oregon and Washington, wanting to host marijuana dinner parties is not and should not be the driving force behind ending marijuana prohibition.\nInstead, the driving force is the simple concept, that an arrest for marijuana poses more harm to the individual than the marijuana itself. Place this in the context of the frequency of marijuana use and unequal enforcement of marijuana laws in the United States and it is enough to warrant legalization in every state under the label of a human rights violation.\nCollateral sanctions such as barriers to employment and housing, loss of benefits such as food stamps and health care, the involvement of Child Protective Services and the life time of character defamation that comes with a criminal history, now plague 700,993 more Americans, disproportionately young men of color.\nIn 2016, several more states will decide whether to end marijuana prohibition. Luckily the life boats have begun to arrive and rescue those drowning in a sea of mass incarceration, felony exclusions, and collateral consequences. Those in Colorado and Washington were rescued first, followed by Oregon, Alaska and DC. Seven more states worth of marijuana consumers, their families and loved ones stand to be rescued in 2016.\nAnd while quite the party is starting on the shore, our work is not over until everyone has been rescued, and until the personal possession and use of marijuana by an adult in the United States does not ruin a life every 45 seconds.\nAmanda Reiman is the manager of marijuana law and policy for the Drug Policy Alliance .\nThis piece first appeared on the Drug Policy Alliance Blog: http://www.drugpolicy.org/blog/2014-someone-was- arrested-marijuana-every-45-seconds\nFollow Amanda Reiman on Twitter: www.twitter.com/AmandaReiman\nMore: 2014 Marijuana Arrests Nonviolent Drug Crime War on Drugs Drug War Drug Arrests Marijuana", "external_links": ["http://www.cheatsheet.com/business/5-states-and-one-city-ready-to-legalize-marijuana.html/?a=viewall", "http://www.ibtimes.com/marijuana-legalization-2015-us-pot-arrests-increased-2014-1-every-45-seconds-fbi-data-2116938", "http://www.twitter.com/AmandaReiman", "http://www.cannabisyoga.com/", "http://www.youtube.com/watch?v=U2LBp8lW-y0", "http://www.gallup.com/poll/163835/tried-marijuana-little-changed-80s.aspx?utm_source=marijuana&utm_medium=search&utm_campaign=tiles", "http://www.drugpolicy.org/blog/2014-someone-was-arrested-marijuana-every-45-seconds", "http://www.drugpolicy.org/resource/just-slap-wrist-life-changing-consequences-marijuana-arrest", "http://www.ibtimes.com/marijuana-arrests-colorado-plummet-after-legalization-report-1861236", "http://www.drugpolicy.org/blog/2014-someone-was-", "http://norml.org/laws/item/oklahoma-penalties-2", "https://www.aclu.org/feature/war-marijuana-black-and-white", "http://www.drugpolicy.org/about-us/staff-and-board/staff/amanda-reiman-manager-marijuana-law-and-policy"], "published": "2015-09-29T20:59:00.000+03:00", "crawled": "2015-09-29T22:39:32.546+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}