{"organizations": [], "uuid": "93fbddd72ae3f4a80c3146f0137d98f62ad11784", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/mcconnell_082815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/36/feed#", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/blogs/floor-action/senate/254424-mcconnell-senators-should-open-their-hearts-on-abortion-bill", "country": "US", "title": "McConnell: Senators should 'open their hearts' and pass abortion bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McConnell: Senators should 'open their hearts' and pass abortion bill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-21T23:47:00.000+03:00", "replies_count": 0, "uuid": "93fbddd72ae3f4a80c3146f0137d98f62ad11784"}, "author": "jcarney@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/senate/254424-mcconnell-senators-should-open-their-hearts-on-abortion-bill", "ord_in_thread": 0, "title": "McConnell: Senators should 'open their hearts' and pass abortion bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump: I'll close US borders 'in... Other topics in his Twitter Q-and-A included the NFL and guns. Huckabee rips Obama as 'most anti-... Huckabee said Obama is insulting the pope by inviting gay rights and pro-... Walker drops out of race The Wisconsin governor urges other candidates to follow suit. Cruz: Carson's stance on Muslim... \"The Constitution specifies there shall be no religious test for public... Judge: Anti-Planned Parenthood... The federal judge said the group can't plead the Fifth. AFL-CIO boss: Walker is 'still a... Walker had taken on unions in Wisconsin and vowed to do so again as... Kareem Abdul-Jabbar 'very... \"Religion is not supposed to be a litmus test for office,\" the NBA legend... Trump: Clinton created birther... “What I’ve said is nothing compared to Hillary,” Trump said. House votes to freeze federal... GOP leaders hope the legislation will help avert a government shutdown. Fiorina picks up first lawmaker... The endorsement comes a week after Fiorina's strong debate performance. Democrats: Sanders unelectable The doubts have nothing to do with policy. Kim Davis, conscientious objector? She would be well-served to study the actions of the honorable... Sanders scolds Carson for Muslim... Sanders said he is very disappointed with the GOP candidate's remarks. GOP senator defends the filibuster Sen. Lamar Alexander said Republicans have \"very short memories.\" GOP braces for Pope Francis Papal experts predict Francis’s address will be more of a headache for... US sees 'surprising' spike in... The White House said the August increase was unusual and concerning. Muslim group distributing Quran... The campaign is meant to educate Americans about the religion. Katie Pavlich: A kid, a clock, and... OPINION | These days, if you see something and say something, you’re just... WATCH LIVE: Scott Walker ends... The Wisconsin governor is bowing out of the race for the GOP nomination. Larry Kudlow ‘leaning towards’... Kudlow had threatened to run against Sen. Richard Blumenthal. Donald Trump's moral cowardice At a N.H. town hall, there were ugly sentiments and outright lies he... White House slams Carson's '... Josh Earnest said Carson’s remarks are \"entirely inconsistent with the... Republicans stoop low to attack... The Congressional Republicans’ real motive is clear: they want to ban... Dems see Biden entering race — and... Many Democrats increasingly think Biden will run for the White House. GOP senator: Shutdown argument is... Congress should \"do its duty\" and defund Planned Parenthood, Sen. Jeff... Julia Louis-Dreyfus jabs Trump in... “What a great honor it must be for you to honor me tonight,\" she said.", "external_links": [], "published": "2015-09-21T23:47:00.000+03:00", "crawled": "2015-09-22T02:14:16.131+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}