{"organizations": [], "uuid": "b7855872d088a09ec4ecb001c4155a29eafdf3c9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/putinobama_092415getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed", "section_title": "The Hill: International Policy", "url": "http://thehill.com/blogs/blog-briefing-room/news/254782-obama-to-meet-with-putin-next-week", "country": "US", "title": "Obama to meet with Putin next week", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to meet with Putin next week", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-24T18:01:00.000+03:00", "replies_count": 0, "uuid": "b7855872d088a09ec4ecb001c4155a29eafdf3c9"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/254782-obama-to-meet-with-putin-next-week", "ord_in_thread": 0, "title": "Obama to meet with Putin next week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 24, 2015, 11:01 am Obama to meet with Putin next week By Jordan Fabian Getty Images \nPresident Obama and Russian President Vladimir Putin will meet in New York on Monday, according to the White House. ADVERTISEMENT The meeting during the United Nations General Assembly, which Putin requested, comes amid tensions between the U.S. and Russia over the civil war in Syria.\n“Given the situations in Ukraine and Syria, despite our profound differences with Moscow, the president believes that it would be irresponsible not to test whether we can make progress through high-level engagement with the Russians,” a senior administration official said Thursday. \nObama and Putin have not met in person for close to a year, as the U.S. has sought to isolate Russia following its military intervention in Ukraine. \nBut the meeting is a sign the Obama administration has chosen to reopen engagement with Putin over the conflicts in Syria and Ukraine. \nThe official said Obama’s “core message” will urge Russia to abide by the terms of a ceasefire agreement in Ukraine, where pro-Russian separatists have battled government forces since last year. \nThe meeting also comes as Russia has sent military equipment and advisers to Syria to reinforce President Bashar al-Assad, who is locked in a two-front war against opposition rebels and the Islamic State in Iraq and Syria (ISIS). \nPutin has said the buildup is related to a military campaign against ISIS, which the U.S. is fighting with airstrikes in Syria. \nBut Obama administration officials have expressed concern that Putin is simply trying to shore up Assad, a Russian ally whom the U.S. has called on to step down from power. \n“Russia’s precise intentions inside of Syria are not clear,” White House Press Secretary Josh Earnest said Tuesday. \n“But we continue to be interested in Russia sending a signal about their willingness to constructively support the international coalition to degrade and ultimately destroy ISIL,” he added, using the administration’s preferred acronym for ISIS. \nPutin has proposed conducting joint operations with the U.S. against ISIS while leading a political transition away from Assad, according to Bloomberg . But that has not assuaged U.S. concern about Putin's plans in Syria. \nDefense Secretary Ashton Carter spoke to his Russian counterpart last week to avoid any unintended conflicts between their forces, according to defense officials. \n--This report was updated at 11:48 a.m. Tags:", "external_links": [], "published": "2015-09-24T18:01:00.000+03:00", "crawled": "2015-09-24T20:30:16.227+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}