{"organizations": [], "uuid": "7bb9c396969cc7c0a4d76ce5d515ba5289c16d0a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_072715getty.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/gop-primaries/250188-obama-urges-dems-to-watch-gop-debate", "country": "US", "title": "Obama urges Dems to watch GOP debate", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama urges Dems to watch GOP debate", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-04T19:25:00.000+03:00", "replies_count": 0, "uuid": "7bb9c396969cc7c0a4d76ce5d515ba5289c16d0a"}, "author": "csegal@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/ballot-box/gop-primaries/250188-obama-urges-dems-to-watch-gop-debate", "ord_in_thread": 0, "title": "Obama urges Dems to watch GOP debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 04, 2015, 12:25 pm Obama urges Dems to watch GOP debate By Jordan Fabian Getty Images President Obama is asking Democrats to put aside their contempt for Republican presidential candidates and watch their first debate on Thursday. ADVERTISEMENT “Tune in, listen carefully to what the Republican candidates for president say, and then hold them accountable for trying to undo all of the hard work we've done to move this country forward,” the president wrote in an email blasted out by the Democratic National Committee. The message is one of the first steps taken by Obama to publicly campaign for Democrats in the 2016 presidential race. The email is a way for Democrats to collect data from voters to build a list of supporters. It contains a link where people can enter their personal information and pledge they will watch the debate. Without mentioning anyone by name, Obama hits Republican candidates for trying to repeal his signature healthcare law, questioning the causes of climate change and opposing immigration reform and same-sex marriage, and says it's critical for Democrats to rebut those ideas. “While these Republicans may have bad ideas, they're still smart politicians,” he writes. “They know how to make policies that will take us in the wrong direction sound like they might actually be pretty good ideas.” The first sanctioned GOP presidential debate will take place on Thursday night in Cleveland. The top 10 candidates in the Republican field will appear on the main stage, while the other seven will be invited to participate in a lower-profile event a few hours earlier. Both events will air on Fox News. The White House has been relatively reluctant to weigh in on the 2016 presidential race. Obama’s advisers have indicated he won’t make an endorsement in the primary and he has mostly stuck to attending private fundraisers for Democratic campaign committees. In recent weeks, however, Obama has lashed out at GOP contenders who oppose the nuclear deal with Iran. He called Mike Huckabee’s comments invoking the Holocaust part of a pattern of Republican rhetoric “that would be considered ridiculous if it weren’t so sad.” Tags: Past: 1 day Bush drops 40 pounds on Paleo diet Bush talked about his weight loss in an interview at an Iowa Dairy Queen. Trump: Harvard students '... Trump fell victim to an elaborate prank by a group of Harvard students. Juan Williams: GOP's anger turns... OPINION | Republicans who feed the resentments of the base imperil GOP... Trump widens lead in new poll The billionaire businessman leads Jeb Bush 26 percent to 12 percent. Rand Paul attributes Trump's rise... \"We're going to come back to our senses and look for someone serious,\"... Trump builds his political machine He is taking aggressive steps in Iowa and New Hampshire. Kasich makes quick rise in polls Ohio Gov. John Kasich entered the GOP race late but has already made... Sanders disagrees with Clinton on... Sanders said he was surprised by Clinton's reluctance to state a position... Senate GOP thwarted in effort to... Two Democrats voted to move forward with the bill, which stalled in a 53-... GOP field gets ready to rumble The top 10 candidates are preparing to face off in the long-awaited Fox... Sanders: 'No question' I can beat... The longshot presidential candidate said he is forcing Hillary to \"respond... Trump sees double-digit surge in... Trump leads the GOP field in a new Wall Street Journal/NBC News poll. Signs of division in the GOP on... Some Republicans are questioning the strategy of using budget... Harvard Lampoon tricks Trump with... A fake endorsement called Trump \"the most formidable and competitive\" GOP... Cruz cooks bacon with a machine gun The presidential candidate shows off the method in a new video. Gawker publishes Trump phone number “Mr. Trump has several numbers so this is not an issue,” a campaign source... Jindal cuts off state Medicaid... The presidential candidate cited the recent controversial videos. Carson: Black Lives Matter... Carson also discussed illegal immigration in an NBC interview. Dem senator backs defunding... Manchin is the first Senate Democrat to back the legislation. Trump: GOP challengers 'viciously... \"They attacked me first and I hit them back,\" he said Sunday. Iran denies link between... A website alleged that Javad Zarif’s son was the best man at Vanessa Kerry... Poll: ObamaCare enrollees less... Cost is the most common problem cited by people who are enrolled.", "external_links": [], "published": "2015-08-04T19:25:00.000+03:00", "crawled": "2015-08-05T00:59:28.898+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}