{"organizations": [], "uuid": "b43190565fbb565be0d33175573f0ff186622b20", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/trump1.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/251328-trump-excites-base-befuddles-experts-with-hard-line-immigration-plan", "country": "US", "title": "Trump excites base, befuddles experts with hard-line immigration plan", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trump excites base, befuddles experts with hard-line immigration plan", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-18T00:40:00.000+03:00", "replies_count": 0, "uuid": "b43190565fbb565be0d33175573f0ff186622b20"}, "author": "bgoad@thehill.com (Peter Schroeder)", "url": "http://thehill.com/policy/international/251328-trump-excites-base-befuddles-experts-with-hard-line-immigration-plan", "ord_in_thread": 0, "title": "Trump excites base, befuddles experts with hard-line immigration plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump excites base, befuddles experts with hard-line immigration plan Getty Images By Peter Schroeder - 08/17/15 05:40 PM EDT \nDonald Trump has laid out an immigration policy plan that’s leaving experts scratching their heads while reaping plaudits from the right.The bombastic businessman made his first foray into policy as a presidential candidate this week, detailing specifically how he would tackle the nation’s immigration issues as president.Since launching his campaign more than two months ago, Trump has frequently steered clear of specific policy proposals, offering vague prescriptions and tough talk on everything from healthcare to trade. But in his first detailed policy proposal, he doubles down on tough rhetoric with specific policy steps. Trump’s plan would try and force Mexico to pay for a massive border wall, triple the number of officers charged with tracking down illegal immigrants, and perhaps even rewrite the U.S. Constitution.Immigration has loomed large over Trump’s campaign from the start. His comments about Mexico sending criminals across the border from his kick-off event led to days of recriminations from Hispanic groups, as well as several businesses cutting ties with Trump.Throughout, the real estate mogul has stuck to his guns, while carving out a position far to the right on immigration, blaming workers in the country illegally for everything from crime to economic malaise.On NBC’s “Meet the Press” Sunday, Trump vowed to undo President Obama’s executive actions providing relief to undocumented immigrants in the U.S., and deport everyone here illegally.“We’re going to keep the families together, but they have to go,” he said. “They have to go.”Some of the loudest, and most controversial, voices in the Republican Party were quick to heap praise on Trump’s plan. Sen. Jeff Sessions (R-Ala.), who worked with the GOP front-runner on the blueprint, called it “exactly the plan America needs.”And Rep. Steve King (R-Iowa), a vocal House conservative on all things immigration, said it was very promising.“It’s a very, very positive document,” he told CNN. “It’s bold. It’s strong. It’s broad.”Trump’s proposals rippled through the crowded GOP primary field as well. Wisconsin Gov. Scott Walker was quick to point out Monday the similarities between his plan and Trump’s, while New Jersey Gov. Chris Christie dismissed it on the campaign trail.Experts had plenty of questions about Trump’s plan, questioning the feasibility of some of his ideas and whether they would have the desired end result.Douglas Holtz-Eakin, the head of the conservative American Action Forum, said Trump’s proposals would do more economic harm than good.On his website, Trump argued that an influx of illegal immigrants had robbed American workers of jobs.“The influx of foreign workers holds down salaries, keeps unemployment high, and makes it difficult for poor and working class Americans — including immigrants themselves and their children — to earn a middle class wage,” his website stated.But Holtz-Eakin, who previously headed the Congressional Budget Office, said mass deportations could carry a stiff price tag.First off, his group estimates it would cost anywhere from $400 billion to $600 billion to detain, process and deport every undocumented immigrant in the U.S. And the end result would be pulling 11 million workers out of the country, reducing the nation’s gross domestic product by $1.6 trillion.“It would change the fabric of America in a big way,” Holtz-Eakin said. “He’s got the economics of immigration, generally, completely wrong.”Doris Meissner, director of the U.S. immigration policy at the Migration Policy Institute, said Trump does try to tackle some of the most vexing challenges facing the nation on immigration. But she said his proposals were extreme, oversimplistic and often based on flawed assumptions.“These are not realistic solutions to very serious issues,” said Meissner, who headed the Immigration and Naturalization Service under former President Clinton. “It involves important issues that have been part of the debate for a long time, but it gives unrealistic solutions.”Meissner said Trump’s call for Mexico to pay for a border wall was “pretty cheeky.” Trump said he would force the issue by impounding all money made by illegal labor sent back to Mexico, increasing fees on border crossing cards, and even going so far as to cancel visas for Mexican diplomats if necessary.But experts questioned the viability of overt action against foreign diplomats, as well as the ability to specifically identify and freeze money remittances stemming just from illegal wages.Christie told CNN that while Trump can use muscle when negotiating business deals, he wouldn’t be able to do the same as president.“This is not negotiation of a real estate deal,” he said. “This is international diplomacy.”And Trump’s requirement that companies hire American workers before seeking out immigrants had Holtz-Eakin dismissive.“We’ll just wait until every American responds to our ad?” he asked. “It’s a sound bite, but it’s not a policy.”One of the most profound changes proposed by Trump would be to repeal the U.S. policy of birthright citizenship. Making that happen would most likely require the nation to amend the U.S. Constitution, as the 14th Amendment stipulates that “all persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States.”Some conservatives believe simple legislation could revoke the automatic citizenship to people born in the U.S., but most experts believe the Constitution will need to be revised to make that happen.And experts warned that doing so could have the end result of creating an explicit underclass in the United States, of people who were born and raised in the country but lack the same rights as others.“The purpose of birthright citizenship ... is squarely in the national interest of the United States,” said Meissner.", "external_links": [], "published": "2015-08-18T00:40:00.000+03:00", "crawled": "2015-08-18T07:10:44.641+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}