{"organizations": [], "uuid": "e6d4ea1fbfd3eb5e4991f80136a6d8fe24a223cf", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/judicial/251097-what-obama-can-do-now-to-fix-criminal-justice", "country": "US", "title": "What Obama can do now to fix criminal justice", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "What Obama can do now to fix criminal justice", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-17T23:00:00.000+03:00", "replies_count": 0, "uuid": "e6d4ea1fbfd3eb5e4991f80136a6d8fe24a223cf"}, "author": "Lauren-Brooke Eisen", "url": "http://thehill.com/blogs/congress-blog/judicial/251097-what-obama-can-do-now-to-fix-criminal-justice", "ord_in_thread": 0, "title": "What Obama can do now to fix criminal justice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 17, 2015, 04:00 pm What Obama can do now to fix criminal justice By Lauren-Brooke Eisen \nIt’s clear that President Obama wants criminal justice reform to be part of his legacy. In the span of one week last month, he became the first sitting president to visit a federal prison, commuted the sentences of 46 non-violent drug offenders, and delivered a major speech calling for a revamping of the criminal justice system. “Mass incarceration makes our country worse off, and we need to do something about it,” he said. But there’s more the president can do with the time he has left in office. \nHere’s a look at reforms the administration has already begun: ADVERTISEMENT In August 2013, the Department of Justice launched the “ Smart on Crime ” initiative, revising federal charging policies to avoid triggering excessive mandatory minimums for low-level, nonviolent drug offenders. Obama also established a clemency initiative last year to encourage individuals sentenced under outdated laws to petition for commutation. And he appointed a Task Force on 21 st Century Policing to strengthen the trust between law enforcement and the community.\nThese are all big steps in the right direction, but there are other actions the president can take. \nFor example, the president could issue an executive order “banning the box” for federal contractors that asks an employment applicant if they’ve ever been convicted of a crime. He can urge Congress to enact other \"ban the box\" measures, to ensure that the formerly incarcerated have more opportunities upon release. He could also issue additional commutations so that federal prisoners serving time for outdated crack cocaine laws receive the same sentence as those who committed the same crime today. \nFurther, the president could prioritize federal funding for programs that reduce prison populations rather than add to them. This may seem like a small lift, but cutting funding for programs designed to fill prisons would go a long way to addressing our addiction to mass incarceration. \nToday, the federal government spends $3.8 billion a year on grants to state and local law enforcement for crime fighting and other criminal justice programs. Many of these grants support programs created by the draconian 1994 Crime Bill which incentivized the building of prisons and extended prisons sentences. In fact, from 1980 to 2008, the number of people incarcerated quadrupled from 500,000 to 2.3 million. Clearly, with 5 percent of the world’s population but 25 percent of its prison population, the U.S. has an over-incarceration problem. \nOne place the president could start is the Justice Department’s Justice Reinvestment Initiative. It provides state and local jurisdictions with funding to “improve strategies to manage corrections populations.” Instead of merely managing the current prison population, the president could enhance funding to states that aim to reduce prison populations, not just slow its growth. \nHe could also focus on the Second Chance Act, a law that provides federal grants to states to improve reentry and reduce recidivism for the roughly 700,000 who leave prison each year. The federal government could prioritize funds to states that allow for earlier parole eligibility, reducing costly and outdated sentencing policies. \nThe administration should also build on the strides made in the Edward Byrne Justice Assistance Grant Program (Byrne JAG), which provides about $300-500 million each year in grants to states and local governments. While JAG originally received criticism for focusing on regional drug task forces, it has since evolved into a more nuanced program providing much needed funding to alternatives to incarceration and criminal justice research. The president could streamline funding to states and cities that use Byrne JAG dollars to reduce incarceration and crime rates, i.e. on pretrial services programs, diversion from jails and prisons, and improving indigent defense. \nCalifornia is a great example of how changing funding incentives works. California’s Community Corrections Performance Incentive Act, passed in 2009, monetarily rewarded probation agencies for reducing the number of people sent back to prison for probation violations. The state saved almost $180 million in one year and reduced the number of people sent back to prison by almost a quarter. \nIt’s important to remember that all of these measures can implemented without jeopardizing public safety. Violent crime has fallen by 51 percent since 1991 and property crime has fallen by 43 percent. The American people are safer than they have been in decades. \nWith crime rates continuing to drop, it’s time restructure outdated federal funding that has rewarded states for lengthy prison stays and overcrowded prisons. Obama has a chance to reverse course and leave a legacy that can both reduce mass incarceration and protect public safety. \nEisen is counsel at the Brennan Center for Justice at NYU School of Law.", "external_links": [], "published": "2015-08-17T23:00:00.000+03:00", "crawled": "2015-08-18T00:01:12.807+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}