{"organizations": [], "uuid": "5baa9098b65aa7d5746c39dc27fe2f469d3166a7", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/overnights/255203-overnight-defense-obama-putin-trade-barbs-at-un", "country": "US", "title": "Overnight Defense: Obama, Putin trade barbs at UN", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Defense: Obama, Putin trade barbs at UN", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-29T01:09:00.000+03:00", "replies_count": 0, "uuid": "5baa9098b65aa7d5746c39dc27fe2f469d3166a7"}, "author": "mmali@thehill.com (Rebecca Kheel)", "url": "http://thehill.com/policy/defense/overnights/255203-overnight-defense-obama-putin-trade-barbs-at-un", "ord_in_thread": 0, "title": "Overnight Defense: Obama, Putin trade barbs at UN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Defense: Obama, Putin trade barbs at UN By Rebecca Kheel - 09/28/15 06:09 PM EDT \nTHE TOPLINE: It was a busy day at the United Nations General Assembly, as President Obama, Russian President Vladimir Putin and Iranian President Hassan Rouhani all gave speeches with defense implications. \nObama condemned Russia, Iran and other nations for fueling conflicts around the world and repeatedly urged world leaders to choose \"cooperation over conflict.\" \nHe also warned of \"dangerous currents pulling us back into a darker, disordered world,\" including nations that \"assert themselves in a way that contravene international law,\" a shot at Russian President Vladimir Putin. ADVERTISEMENT \"We're told that such retrenchment is required to beat back disorder, that it's the only way to stamp out terrorism,\" he continued. \"In accordance with this logic we should support tyrants like [Syrian President] Bashar al-Assad, who drops barrel bombs to massacre innocent children because the alternative is surely worse.\"\nObama said the U.S. is willing to work with Russia and Iran to end the four-year-long civil war in Syria, but stressed there cannot be a return to the \"status quo\" under Assad. \nLater, Putin doubled down on his support for embattled Syrian leader Bashar al-Assad in a combative speech to the UN. \n\"We think it is an enormous mistake to refuse to cooperate with the Syrian government and its armed forces,\" Putin said. \"We should finally acknowledge that no one but President Assad and the Kurdish militias are truly fighting the Islamic State and other Islamic terrorist organizations in Syria.\" \nPutin blamed the rise of ISIS -- which grew out of al Qaeda's affiliate in Iraq -- on the U.S. invasion of Iraq in 2003, as well as on the White House's support for rebel groups during the Arab Spring of 2010 and 2011. \n\"Policies based on self-conceit and belief in one's exceptionalism and impunity have never been abandoned,\" Putin said. \"It is now obvious that the power vacuum in the Middle East and North Africa led to the emergency of anarchy areas which immediately started to be filled with extremists and terrorists.\" \nIn addition to Syria, the U.S. and Russia have clashed on Ukraine, where Moscow has supported separatist rebels trying to break away from Kiev. \nHere, too, Putin dug in on Monday, making clear that he has no intention of ending his support for the rebels. \nFinally, Rouhani welcomed the beginning of \"a new chapter\" in his country's relationship with the rest of the world building on the nuclear deal. \n\"I can now proudly announce that today a new chapter has started in Iran's relations with the world,\" Rouhani said. \nRouhani though hit Israel for its policies on Palestinians and blamed the United States for the rise of the Islamic State in Iraq and Syria. \n\"If we did not have U.S. military invasion of Afghanistan and Iraq and the United States' unwarranted support for the inhumane actions of the Zionist regime against the oppressed nation of Palestine, today the terrorists would not have an excuse for the justification of their crimes,\" Rouhani said. \nCENTCOM: REBEL WHO GAVE WEAPONS TO AL QAEDA NOT U.S.-TRAINED: The Syrian rebel commander who handed over U.S. weapons to an al Qaeda affiliate was not trained by the United States and did so to secure safe passage for his group, officials said Monday . \nOfficials at first said that no weapons were given to al Nursa Front, but then later admitted about a quarter of the rebel group's weapons were given to the enemy. \nOn Monday, Col. Pat Ryder, a Centcom spokesman, told reporters that though some of the rebels the commander oversaw were trained by the United States, the commander himself did not participate in the U.S. training program. He and his group were vetted by the United States, Ryder said. \nThe commander had been contacted by a suspected al Nusra intermediary and told that he would be ambushed en route to a new location unless he surrendered some of his equipment, Ryder said. \nThe weapons incident is the latest embarrassment for the U.S. training program. It has been under fire since Centcom commander Gen. Lloyd Austin told a Senate committee only \"four or five\" of the original class of rebels remain in Syria. \nPentagon officials later upped that number to nine. But the original disclosure led lawmakers to call into question the efficacy of a program that cost $500 million and originally aimed to train 5,400 rebels by the end of the year. \nMCCARTHY LAYS OUT FOREIGN POLICY VIEWS: A couple hours before announcing his run for Speaker of the House, Majority Leader Kevin McCarthy (R-Calif.) gave an address on foreign policy in honor of a book launch by the John Hay Initiative, a group of Republican foreign policy advisors. \nThroughout the speech, McCarthy slammed the Obama administration as weak, which he said contributed to the current state of foreign affairs. \n\"When it comes to dictators and terrorists, strength and the threat of force are the only language they understand,\" McCarthy said. \nReferring to Russian President Vladimir Putin's advances in Ukraine as the \"greatest threat to European security since World War II,\" McCarthy called for providing Ukrainian forces with weapons. \nHe also advocated for placing sanctions directly on Putin, rather than on senior officials, as has been U.S. policy thus far. \nTurning to Iran, McCarthy criticized the recently sealed nuclear deal, saying it was worse than having no deal at all. He urged the next president not to follow it and said the United States should keep sanctions on Iran to prevent it from funding terrorist groups. \nIn Iraq and Syria, McCarthy said, the United States needs a completely new policy. \nTo fight the Islamic State in Iraq and Syria, he advocated for a limited number of U.S. troops on the ground. And to help with the refugee crisis, he suggested America and its allies set up a no-fly zone in northern Syria where refugees could find safety. \nSEALS READY TO OPEN JOBS TO WOMEN: The commander of the Navy's special warfare unit is recommending women be allowed to compete for jobs in the SEALs and combat crews. \nRear Adm. Brian Losey, though, also warns that those women could have a greater risk of injury and that the service could be pressured to adjust job standards in a five-page memo to U.S. Special Operations Command, the Associated Press reports. \nThe memo comes as the deadline for all military services to make recommendations on allowing women into combat roles approaches in a few days. \nThe services have until the end of September to ask for exceptions from Defense Secretary Ashton Carter, who will review those requests and make final decisions by January. \nThe issue has become a flashpoint after the Marines recommended keeping some jobs closed. A controversial Marines study, a summary of which was released earlier this month, found that all-male ground combat units outperformed those with both genders. \nIn his memo, Losey outlines many of the same concerns as the Marines, according to The AP, but he concludes that all qualified individuals should be able to test themselves. \nThe memo says it \"is ultimately the right thing to do and is clearly consistent with the struggle over centuries to fully represent our nation's values of fairness and equal opportunity,\" according to the AP. \nIN CASE YOU MISSED IT: \n-- Poll: Support for allowing Syrian refugees in U.S. sharply divided by party \n-- Benghazi panel now longest congressional investigation \n-- Republicans want clarification on Iran side deals \n-- Dem calls on US to suspend Syrian rebel training program", "external_links": [], "published": "2015-09-29T01:09:00.000+03:00", "crawled": "2015-09-29T22:34:34.253+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}