{"organizations": [], "uuid": "61a878100f5774e8b55f83175498ecb7c18ba89f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/trumpdonald_090315getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/campaign-issues/donald-trump-obama-muslim-birther-not-morally-obligated", "country": "US", "title": "Trump: I'm not ‘morally obligated’ to defend Obama from birthers", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trump: I'm not ‘morally obligated’ to defend Obama from birthers", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-19T16:13:00.000+03:00", "replies_count": 0, "uuid": "61a878100f5774e8b55f83175498ecb7c18ba89f"}, "author": "Mario Trujillo", "url": "http://thehill.com/campaign-issues/donald-trump-obama-muslim-birther-not-morally-obligated", "ord_in_thread": 0, "title": "Trump: I'm not ‘morally obligated’ to defend Obama from birthers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump: I'm not ‘morally obligated’ to defend Obama from birthers By Mario Trujillo - 09/19/15 09:13 AM EDT \nGOP presidential candidate Donald Trump on Saturday said he's not \"morally obligated to defend the president\" against inaccurate claims from supporters. \nTrump, who is leading in the polls for the Republican nomination, blasted out a series of tweets amid mounting criticism that he did not cut off an event attendee who questioned President Obama’s citizenship and religion. \nAm I morally obligated to defend the president every time somebody says something bad or controversial about him? I don't think so! — Donald J. Trump (@realDonaldTrump) September 19, 2015 \nThis is the first time in my life that I have caused controversy by NOT saying something. — Donald J. Trump (@realDonaldTrump) September 19, 2015 \nIf the roles were reversed, Trump predicted Obama would not come to his defense. \nIf someone made a nasty or controversial statement about me to the president, do you really think he would come to my rescue? No chance! — Donald J. Trump (@realDonaldTrump) September 19, 2015 \nTrump received plenty of blowback Friday after he failed to shut down a supporter in New Hampshire who alleged Obama is a Muslim, as well as not an American. The questioner added that “we have training camps growing where they want to kill us. That’s my question, when can we get rid of them?” \nMany have said Trump should have followed the lead of 2008 GOP presidential nominee John McCain, who cut off a woman who made similar comments about Obama during that election. But Trump has a history with the birther movement, fueling questions about Obama’s citizenship during the 2012 election, which eventually spurred Obama to release his long-form birth certificate to end any doubt that he was born in Hawaii in 1961. \nThe White House said the exchange wasn’t surprising given Trump’s history. \nEven rival GOP candidate Jeb Bush came to Obama’s defense in a speech Friday night in Michigan. \n\"Barack Obama is a talented man — and by the way he's an American, he's a Christian — his problem isn't the fact that he was born here or what his faith is,\" Bush said, according to reports. \"His problem is that he's a progressive liberal who tears down anybody that disagrees with him.\" Tags:", "external_links": [], "published": "2015-09-19T16:13:00.000+03:00", "crawled": "2015-09-20T07:46:31.682+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}