{"organizations": [], "uuid": "8858a1545b7b6c78f9ebc63be670b9839b3090e9", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/overnights/253003-overnight-defense-obama-clinches-votes-to-block-iran-deal", "country": "US", "title": "Overnight Defense: Obama clinches votes to keep Iran bill from his desk", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Defense: Obama clinches votes to keep Iran bill from his desk", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-09T01:59:00.000+03:00", "replies_count": 0, "uuid": "8858a1545b7b6c78f9ebc63be670b9839b3090e9"}, "author": "mmali@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/overnights/253003-overnight-defense-obama-clinches-votes-to-block-iran-deal", "ord_in_thread": 0, "title": "Overnight Defense: Obama clinches votes to keep Iran bill from his desk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Defense: Obama clinches votes to keep Iran bill from his desk By Kristina Wong - 09/08/15 06:59 PM EDT \nTHE TOPLINE: President Obama on Tuesday clinched 42 votes to block a resolution disapproving of the Iran nuclear deal in the Senate, marking a major political victory. \nThree Senate Democrats -- Sens. Ron Wyden (Ore.), Richard Blumenthal (Conn.) and Gary Peters (Mich.) -- came out in favor of the deal in the morning, giving supporters of the deal enough votes to potentially filibuster the resolution. And Tuesday evening, Sen. Maria Cantwell (Wash.) also backed the deal. \nAlso Tuesday, another Democrat, Sen. Joe Manchin (W.Va.) announced he would join all 54 Republicans and three other Democrats in opposing the deal. \nThe Senate began debating the resolution Tuesday afternoon. \nMinority Leader Harry Reid (D-Nev.) and Majority Leader Mitch McConnell (R-Ky.) are battling over how to proceed with the Iran resolution. \nMcConnell on Tuesday blocked an attempt by Reid to set up a vote on the Iran deal for later this week under a higher 60-vote threshold. \nReid tried to get unanimous consent to schedule a vote on a resolution to disapprove the nuclear agreement for Thursday in which 60 votes would be needed to attach the resolution to a House-passed shell bill that's being used as the Senate's vehicle. \n\"If the Republicans want more debate time, you can have it, but three days I thought would be adequate,\" Reid said. \nThe House is expected to vote on a resolution disapproving of the Iran nuclear deal on Friday, coinciding with the anniversary of the Sept. 11 terrorist attacks. \nSHORT-TERM FUNDING MEASURE? House Armed Services Committee Chairman Mac Thornberry (R-Texas) is predicting a short-term government funding measure, amid political gridlock. \n\"My guess we have a short-term [continuing resolution] for some period of time. I don't know 'til when, although I would assume it would be [calendar] late in the year,\" he said. The deadline to fund the next fiscal year is Oct. 1. \n\"I hope there are enough people in both parties who want to fund the essential parts of government and provide some stability that we can find a way forward,\" he said. \nMeanwhile, on the 2016 National Defense Authorization Act, the chairman said there are still outstanding issues between House and Senate Armed Services Committee lawmakers working to combine their 2016 defense policy bills together. \nThornberry said \"most issues are resolved,\" and that he is hopeful they could get all the issues agreed and produce a conference report \"as soon as possible.\" \n\"Hopefully we'll get it before long,\" he said, declining on outlining what those issues are until agreement is reached on every issue. \"Hopefully we will have a conference report available to come to the floor soon.\" \nThornberry said \"a number of members\" are trying to prevent the White House from vetoing the bill, which it has threatened to do. The administration opposes the bill primarily since it would authorize $38 billion more in war funding than it wants to allocate. \nThe White House would instead put that money into the base defense budget, but that would entail Congress breaking budget caps imposed in 2011, which Republicans oppose doing. \nThornberry said the war-funding issue would not be solved by vetoing the defense policy bill, which does not actually allocate money. Senate Democrats have vowed to block a defense appropriations bill -- which does allocate money -- for the same reason. \n\"We'll just have to see,\" he added. \"When the [National Defense Authorization Act] authorizes exactly the amount of money that [the White House] asks for, has lots of good things...it would be very unfortunate if the president vetoes it.\" \nGOP CHAIRMAN WARNS OF 'HASTY' AFGHAN WITHDRAWAL: House Armed Services Committee Chairman Rep. Mac Thornberry (R-Texas) is urging the Obama administration to halt the draw down of U.S. troops in Afghanistan amid worries it could again become a terrorist safe haven. \n\"I'm concerned about the decisions that the president is to make in the next few weeks or months\" about the planned pace of the drawdown, said Thornberry, who just returned from a trip to Afghanistan. \nThe Obama administration is scheduled to begin drawing down the current roughly 9,800 U.S. troops in Afghanistan to just an embassy presence of around 1,000 by the end of next year, when President Obama leaves office. \nThornberry said that move would leave Afghanistan vulnerable to the Taliban, al Qaeda remnants, a growing Islamic State in Iraq and Syria (ISIS) presence, and other terrorist groups, threatening to again make the country a safe haven for terrorists attacking the U.S. \n\"What I'm looking at is what's in U.S. national security interests, and I keep coming back to the point that terrorism is always going to be attracted to Afghanistan. We've seen homeland plots in the past come from there, and for us not to have a presence, for us not to be able to gather intelligence, it would just be a huge blunder,\" he said. \nThe chairman also said the ISIS presence in Afghanistan \"has grown faster there than most people in Washington appreciate.\" \nArmy Gen. John Campbell, the head of coalition forces there, is due to deliver his recommendations on the pace of the drawdown to the administration in the coming weeks. Thornberry said he met with him \"at length,\" as well as Afghan President Abdul Ghani. \nIN CASE YOU MISSED IT: \n-- House Iran vote will be on 9/11 anniversary \n-- Collins opposes Iran deal", "external_links": [], "published": "2015-09-09T01:59:00.000+03:00", "crawled": "2015-09-09T10:45:11.966+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}