{"organizations": [], "uuid": "16c21e6b1d788a063ff16e79967129f81dbbb0c4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/religion/blog.xml", "section_title": "Religion Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/neil-j-young/evangelicals-attacking-pope-abortion_b_8082982.html", "country": "US", "title": "Why Evangelicals Are Attacking Pope Francis on Abortion | Neil J. Young", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 96, "title_full": "Why Evangelicals Are Attacking Pope Francis on Abortion | Neil J. Young", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-04T19:34:00.000+03:00", "replies_count": 109, "uuid": "2986e4c04cef6af878a582be0aa3d2d088d236d2"}, "author": "Neil J. Young", "url": "http://www.huffingtonpost.com/neil-j-young/evangelicals-attacking-pope-abortion_b_8082982.html#post-0", "ord_in_thread": 0, "title": "Why Evangelicals Are Attacking Pope Francis on Abortion | Neil J. Young", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On Tuesday, Pope Francis issued a letter decreeing priests could absolve women who have had an abortion who now seek forgiveness . This decision is to take effect during the church's Holy Year of Mercy, which begins in December. (Pope John Paul II also allowed priests to do the same during the church's last Holy Year in 2000.)\nAs with every decree from Pope Francis, this pronouncement garnered immediate and spirited responses from all corners, but the disapproving reactions from evangelicals may surprise observers since evangelicals have been the Catholic Church's closest allies on many political issues, particularly abortion. Evangelical responses to Pope Francis' letter, however, remind us that these political alliances among religious conservatives have often disguised far deeper theological conflicts and religious differences that shape that political partnership.\nSecular outlets tended to praise Francis' decision, seeing it as yet further proof of the pope's supposedly progressive bent. \" The incredible pope has done it again ,\" New York magazine enthused, characterizing the move as a \"revolutionary act of compassion.\" The liberal website ThinkProgress called Francis' decree a \" step towards creating a more welcoming church .\"\nEvangelicals, on the other hand, blasted the pope's decision, seeing it not so much as a statement about abortion but rather proof of the Catholic Church's erroneous teachings and unbiblical practices regarding divine forgiveness and human salvation.\nAs one evangelical theologian told the publication Evangelical Focus, \" It is God who pardons sin \" and not the church. Gene Veith, provost of the evangelical Patrick Henry College, condemned the pope's decision as \" another example of the Gospel-denying effects of the Roman Catholic penitential system .\" Veith reminded his readers that it was Jesus' sacrifice on the cross that provided forgiveness, something no human agent, whether pope or priest, could grant. Russell Moore, president of the Southern Baptist Convention's Ethics and Religious Liberty Commission, voiced similar sentiments in a series of tweets (see here , here , and here ).\nIn our red state/blue state political culture, it's easy to see Americans as belonging to one camp or another on controversial topics. This has been especially true in our national conversation on abortion. Either you're pro-life or you're pro-choice, and that's pretty much all one needs to know when it comes to the politics of abortion in America.\nBut the evangelical response to Pope Francis' statement on abortion forgiveness demonstrates that theology often trumps politics with religious conservatives. Although evangelicals and conservative Catholics remain closely aligned regarding abortion and other social issues, including same-sex marriage, that political partnership has often obscured the deeper theological differences that have divided conservative Protestants and Catholics dating back to the Protestant Reformation.\nAs I discuss in my forthcoming book, We Gather Together: The Religious Right and the Problem of Interfaith Politics , theological differences have shaped evangelical-Catholic relations even as members of both faiths became the leading forces of the Religious Right. Evangelicals especially have used moments of political agreement with Catholics (and Mormons) to also point out important religious differences with their allies in order to assert evangelicalism's distinctiveness and sole possession of truth.\nFor example, as they began to embrace the pro-life cause in the 1980s, evangelicals insisted the Bible alone provided justification for opposing abortion, a deliberate rebuke to the Catholic Church's use of papal decrees and other church writings to support its anti-abortion efforts. In doing so, evangelicals could both mobilize a pro-life movement from their ranks while also critiquing the wrong theology of the Catholic Church that used texts other than the Bible to teach truth.\nMore recently, when the LDS Church emerged as a major player in the fight against same-sex marriage, evangelical leaders made sure to balance their defense of Mormon political activism with a clear message about Mormonism's erroneous theology .\nThese incidents help us better see the complicated relationship of religion and politics in contemporary America. While often depicted as a division between religious conservatives and secular liberals, the reality is far more complex. For religious conservatives, theological truth far outweighs political strategy. Although conservative evangelicals, Catholics, and Mormons continue to find themselves on the same side of the political battlefield, that result has prompted them to clarify how different they are from each other religiously. As experts continue to predict the end of the Religious Right , it's important to understand that its success or failure hinges more on how they handle internal theological disagreements than on any outside political forces.\nFollow Neil J. Young on Twitter: www.twitter.com/neiljyoung17\nMore: Evangelicals Catholic Church Pope Francis Abortion Religious Right", "external_links": ["http://nymag.com/daily/intelligencer/2015/09/pope-franciss-revolutionary-abortion-decision.html", "http://www.amazon.com/exec/obidos/ASIN/019973898X", "https://twitter.com/drmoore/status/638678609750654977", "http://www.twitter.com/neiljyoung17", "http://www.patheos.com/blogs/geneveith/2015/09/pope-will-allow-priests-to-forgive-abortion/", "https://twitter.com/drmoore/status/638680025194065921", "http://www.nytimes.com/2015/09/02/world/pope-francis-abortion-absolution.html?_r=2", "http://evangelicalfocus.com/family/935/Pope_Francis_decides_abortion_is_now_a_pardonable_sin", "http://thinkprogress.org/health/2015/09/01/3697333/pope-francis-abortion-forgiveness/", "http://www.conversantlife.com/morality/california-and-thank-a-mormon-day", "http://www.salon.com/2014/02/28/the_dying_right_why_christian_fundamentalists_are_in_panic_mode_partner/", "https://twitter.com/drmoore/status/638674833732055040"], "published": "2015-09-04T19:34:00.000+03:00", "crawled": "2015-09-04T20:30:14.759+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}