{"organizations": [], "uuid": "e6b3eb93796d3fc5f9619f05f232cbe51d3f2940", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/immigration_090814getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1134/feed", "section_title": "Civil Rights", "url": "http://thehill.com/blogs/congress-blog/civil-rights/249714-for-children-and-legacy-obama-must-end-family-detention", "country": "US", "title": "For children and legacy, Obama must end family detention", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "For children and legacy, Obama must end family detention", "spam_score": 0.0, "site_type": "blogs", "published": "2015-07-30T13:00:00.000+03:00", "replies_count": 0, "uuid": "e6b3eb93796d3fc5f9619f05f232cbe51d3f2940"}, "author": "jpicard@thehill.com (Bishop Eusebio Elizondo and Bishop Julian Gordy)", "url": "http://thehill.com/blogs/congress-blog/civil-rights/249714-for-children-and-legacy-obama-must-end-family-detention", "ord_in_thread": 0, "title": "For children and legacy, Obama must end family detention", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 30, 2015, 06:00 am For children and legacy, Obama must end family detention By Bishop Eusebio Elizondo and Bishop Julian Gordy \nOn July 24, Judge Dolly Gee of the Central District of California ruled that the Obama administration’s policy of detaining families—young mothers with children---fleeing violence in Central America violated a 1997 court settlement that protects children from unnecessary detention. The decision required the administration to show cause by August 3 why these children, preferably with their mothers, should not be released within 90 days. \nThe decision provides the administration an opportunity to end a practice that is both unnecessary and inhumane. Appealing the court decision and maintaining the policy of detaining families would tarnish President Obama’s immigration legacy, as jailing thousands of traumatized young mothers and children seeking safety for indefinite amounts of time does not read well in the annals of history. ADVERTISEMENT Compounded with the death of Congressional immigration reform despite the president’s best cheerleading efforts and a real possibility that his executive orders from November 2014, designed to protect over 4 million from deportation, may never be implemented, and he is left with, at best, a mixed record on immigration. Decades from now, this administration’s deportation record plus the traumatization of women and children seeking refuge in detention could be the central message of the nation’s history books. \nThe judicial order is the perfect chance to not only end the practice of family detention, but to avoid this characterization. Thankfully, there are humane alternatives to detention that would allow these families to live in the community but ensure they comply with the legal process. Community-based programs centered around case management, in which families are connected to social services and legal assistance, are more humane and cheaper than detention. They also boast over ninety percent appearance rates at immigration court proceedings. \nWe must remember that these families pose no threat to our communities and by and large have valid asylum claims—they are fleeing for their lives from violence in their home countries. The Administration’s original purpose for detaining them was to deter more refugees from coming, a strategy that does not work when a person’s life is at stake and a justification that the Administration has since abandoned. The second stated justification of ensuring compliance with legal obligations can be addressed by using these community-based programs. \nOne possible response to the court decision that could further soil the administration’s record would be to release the children but keep the parents detained. This, of course, would be cruel and unnecessary. It would harm the children emotionally and psychologically and force parents to make the difficult choice of being separated from their young children or keeping them in detention with them. No parent should have to make that decision and no child should be needlessly separated from their parent. \nIn the end, the administration is faced with a moral choice, plain and simple. Either do not appeal the court decision and stop detaining families or continue to tarnish their legacy forever. For the sake of the children and to avoid perpetuating this tragic practice under future administrations, let’s hope they make the right choice. \nElizondo is auxiliary bishop of Seattle and chairman of the U.S. Conference of Catholic Bishops’ Committee on Migration. Gordy is bishop of the Southeastern Synod of the Evangelical Lutheran Church in America.", "external_links": [], "published": "2015-07-30T13:00:00.000+03:00", "crawled": "2015-08-06T17:54:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}