{"organizations": [], "uuid": "dec6d8815a4d87fb0fa22e55b5fa37193c0a899c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3264708/images/o-OBAMA-AFRICA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/blog.xml", "section_title": "Business Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/stephen-peel/obama-africa-visit_b_7936160.html", "country": "US", "title": "What President Obama Didn't Say to the People of Africa | Stephen Peel", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "What President Obama Didn't Say to the People of Africa | Stephen Peel", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-05T02:25:00.000+03:00", "replies_count": 0, "uuid": "dec6d8815a4d87fb0fa22e55b5fa37193c0a899c"}, "author": "Stephen Peel", "url": "http://www.huffingtonpost.com/stephen-peel/obama-africa-visit_b_7936160.html", "ord_in_thread": 0, "title": "What President Obama Didn't Say to the People of Africa | Stephen Peel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With much fanfare, President Obama addressed the African Union last week in Addis Ababa. His speech highlighted that with Africa's population forecast to \"double to some two billion people\" there is an urgent need for the continent to \"generate millions more jobs than it's doing right now.\" The importance of this comment cannot be overstated. Sub-Saharan Africa's population is projected to increase from approximately 900 million currently to about 2 billion by 2050, according to UN estimates . Such growth rates are some of the highest the world has ever seen, and yet are occurring in some of its poorest and most undeveloped areas. Thirty-three of the world's least developed countries are in sub-Saharan Africa. Seventy percent of its population lives on less than $2 per day and around 48 percent lives in extreme poverty on under $1.25 per day, according to World Bank data . Due to the early stages of the continent's demographic transition, the population is very young. Fertility rates of some five children per woman combined with falling child mortality rates mean that children and adolescents dominate the populations. Some 42 percent of the sub-Saharan African population is under 15 years old . According to UNICEF estimates , by 2050, two in every five children born in the world will be African.\nSo Obama is right in emphasizing that Africa needs to create a huge number of jobs. But where are these jobs going to come from? The majority of sub-Saharan Africa's population lives in rural areas where agriculture is the primary economic activity. Africa's agricultural sector already exhibits low productivity and small lot sizes. The reasons for this low productivity are much debated, but efforts to improve it over the past decade have had little aggregate impact. Consequently, most of the increase in population will need to find jobs in the manufacturing and services sectors. In order to do this on a sustainable basis while generating incomes that lift people out of poverty, tradable goods manufacturing must become the principal driver of Africa's growth and employment.\nTradable goods manufacturing is essential to modernizing an economy, as seen from the successful development cases of Japan, Taiwan, Korea and Singapore. China, Indonesia, Malaysia and, to a lesser extent, India also now pursue export-led growth strategies. But Africa's manufacturing industry starts from a small base. Its share of global manufacturing value added and manufacturing exports are 1.1 percent and 1.3 percent respectively, half of which is from South Africa. In 2010, Africa's share of manufacturing in GDP is 10 percent, the same value as in the 1970s. Manufactured exports per person are about one-tenth of developing country average.\nTransport infrastructure without goods to be transported will never generate a return. Downstream industries without a competitive supply base will fail. Manufacturing today predominantly comprises global supply chains where production is allocated to wherever factor inputs are cheapest and most productive. For African nations to take part in the manufacture of globally tradable goods they need to develop cost competitive industry, initially overcoming their lack of local scale with low cost inputs, especially labor. Infrastructure bottlenecks must be addressed. They will need to access new technologies, most probably through foreign investment, and create the human capital that can master these technologies.\nHowever, in most African countries the conditions for such a structural transformation from an agricultural to a predominantly manufacturing economy are not in place. Critical factor inputs for manufacturing are lacking or too expensive. African governments are insufficiently focused on promoting export-orientated industry. The successful Asian development experience suggests that governments, in collaboration with private sector experts, need first to assess their current and potential manufacturing base. Policy must then relentlessly promote the manufacturing sector along with simultaneous investment and development of the multiple factor inputs on which the sector relies. Targeted industries must be supported with finance and specific policies that allow time for them to develop scale and competitiveness. Policy coordination is paramount. We have seen that education without jobs achieves little. Factories without power can never be competitive. Transport infrastructure without goods to be transported will never generate a return. Downstream industries without a competitive supply base will fail.\nMany argue that the self-interested leaders of African nations condemn any attempt to create competitive manufacturing economies to the fate that befell the poorly implemented import substitution policies of the 1960s. But surely there must be one or two African leaders who have the vision to take their country down the proven path of modernization via the development of a tradable goods manufacturing sector, providing a precedent for others to follow. If so, the U.S. and other Western nations should support such efforts wholeheartedly. As the refugee crisis on Europe's borders clearly demonstrates, the continued exclusion of Africans from the global economy is not an option.\nEarlier on WorldPost:\nClose  Attack At Mall In Nairobi of   A plume of black smoke billows over the Westgate Mall, in Nairobi, Kenya Monday, Sept. 23, 2013. Multiple large blasts have rocked the mall where a hostage siege is in its third day. Associated Press reporters on the scene heard multiple blasts and a barrage of gunfire. Security forces have been attempting to rescue an unknown number of hostages inside the mall held by al-Qaida-linked terrorists.(AP Photo/Jonathan Kalan)\nArmed police from the General Service Unit take cover behind a wall during a bout of gunfire, outside the Westgate Mall in Nairobi, Kenya Monday, Sept. 23, 2013. Hostages being held by al-Qaida-linked terrorists in a Nairobi mall have not been released despite an earlier statement from the military that \"most\" had been rescued, a person connected to the situation told The Associated Press on Monday. (AP Photo/Ben Curtis)\nParamedics and police officers run outside the Westgate Mall in Nairobi after heavy shooting started Monday, Sept. 23, 2013. Kenya's military launched a major operation at the upscale Nairobi mall and said it had rescued \"most\" of the hostages being held captive by al-Qaida-linked militants during the standoff. (AP Photo/Sayyid Azim)\nKenya security forces are seen behind a wall outside the Westgate Mall in Nairobi, Kenya Monday morning, Sept. 23, 2013. Kenya's military launched a major operation at the upscale Nairobi mall and said it had rescued \"most\" of the hostages being held captive by al-Qaida-linked militants during the standoff that killed at least 68 people and injured 175. (AP Photo/Jerome Delay)\nKenya security personnel take cover outside the Westgate Mall after shooting started inside the mall early Monday morning, Sept. 23, 2013. Kenya's military launched a major operation at the upscale Nairobi mall and said it had rescued \"most\" of the hostages being held captive by al-Qaida-linked militants during the standoff that killed at least 68 people and injured 175. (AP Photo/Sayyid Azim)\nKenya security forces are seen behind a wall outside the Westgate Mall in Nairobi, Kenya Monday morning, Sept. 23, 2013. Kenya's military launched a major operation at the upscale Nairobi mall and said it had rescued \"most\" of the hostages being held captive by al-Qaida-linked militants during the standoff that killed at least 68 people and injured 175. (AP Photo/Jerome Delay)\nKenya security forces are seen behind a wall outside the Westgate Mall in Nairobi, Kenya Monday morning, Sept. 23, 2013. Kenya's military launched a major operation at the upscale Nairobi mall and said it had rescued \"most\" of the hostages being held captive by al-Qaida-linked militants during the standoff that killed at least 68 people and injured 175. (AP Photo/Jerome Delay)\nOnlookers gather on a hill to observe the Westgate Mall after a bout of heavy gunfire just after dawn in Nairobi, Kenya Monday, Sept. 23, 2013. Helicopters circling overhead, Kenya's military launched a major operation Sunday night at the upscale Nairobi mall and claimed it had rescued \"most\" of the hostages being held captive by al-Qaida-linked militants during a standoff that killed at least 68 people and injured 175. (AP Photo/Ben Curtis)\nRelatives wait at the Nairobi City Mortuary following the mall attack in Kenya, Sunday, Sept. 22, 2013. Kenyan authorities said Islamic extremist attackers remain inside the upscale Kenyan shopping mall, holding an unknown number of hostages, after killing at least 39 and injuring 150 during Saturday's attack. (AP Photo/Khalil Senosi)\nGroups of onlookers gather on a road looking down over the Westgate Mall in Nairobi, Kenya Sunday, Sept. 22, 2013. Multiple barrages of gunfire erupted Sunday morning from the upscale Kenyan mall where there is a hostage standoff with Islamic extremists nearly 24 hours after they attacked using grenades and assault rifles. (AP Photo/Ben Curtis)\nA line of soldiers from the Kenya Defense Forces run in front of the Westgate Mall in Nairobi, Kenya Sunday, Sept. 22, 2013. Multiple barrages of gunfire erupted Sunday morning from the upscale Kenyan mall where there is a hostage standoff with Islamic extremists nearly 24 hours after they attacked using grenades and assault rifles. (AP Photo/Ben Curtis)\nSoldiers from the Kenya Defense Forces carry a wounded colleague, following the sound of explosions and gunfire, out of the Westgate Mall in Nairobi, Kenya Sunday, Sept. 22, 2013. Associated Press journalists at the scene of a hostage standoff said a barrage of gunfire erupted from the upscale Kenyan mall Sunday morning and moments later two wounded Kenyan security forces were carried out of the mall. (AP Photo/Ben Curtis)\nTrucks of soldiers from the Kenya Defense Forces arrive after dawn outside the Westgate Mall in Nairobi, Kenya Sunday, Sept. 22, 2013. Islamic extremist gunmen lobbed grenades and fired assault rifles inside Nairobi's top mall Saturday, killing dozens and wounding over a hundred in the attack. Early Sunday morning, 12 hours after the attack began, gunmen remained holed up inside the mall with an unknown number of hostages. (AP Photo/Ben Curtis)\nTrucks of soldiers from the Kenya Defense Forces arrive after dawn outside the Westgate Mall in Nairobi, Kenya Sunday, Sept. 22, 2013. Islamic extremist gunmen lobbed grenades and fired assault rifles inside Nairobi's top mall Saturday, killing dozens and wounding over a hundred in the attack. Early Sunday morning, 12 hours after the attack began, gunmen remained holed up inside the mall with an unknown number of hostages. (AP Photo/Ben Curtis)\nArmed special force aim their guns at the Westgate Mall in Nairobi, Kenya on Saturday, Sept. 21 2013, after gunmen threw grenades and opened fire during an attack that left multiple dead and dozens wounded. A witness to the attacks on the upscale shopping mall says that gunmen told Muslims to stand up and leave and that non-Muslims would be targeted(AP Photo/Khalil Senosi)\nCivilians who had been hiding inside during the gun battle manage to flee from the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013. Gunmen threw grenades and opened fire Saturday, killing at least 22 people in an attack targeting non-Muslims at an upscale mall in Kenya's capital that was hosting a children's day event, a Red Cross official and witnesses said. (AP Photo/Jonathan Kalan)\nA body is seen on the floor, below right, as smoke fills the air inside the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013. Gunmen threw grenades and opened fire Saturday, killing at least 22 people in an attack targeting non-Muslims at an upscale mall in Kenya's capital that was hosting a children's day event, a Red Cross official and witnesses said. (AP Photo/Jonathan Kalan)\nA woman who had been hiding during the gun battle runs for cover after armed police, seen behind, enter the Westgate Mall in Nairobi, Kenya, Saturday, Sept. 21, 2013. Gunmen threw grenades and opened fire Saturday, killing at least 22 people in an attack targeting non-Muslims at an upscale mall in Kenya's capital that was hosting a children's day event, a Red Cross official and witnesses said. (AP Photo/Jonathan Kalan)\nAn armed police officer takes cover during a bout of gunfire outside the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013. Gunmen threw grenades and opened fire Saturday killing at least 22 people in an attack targeting non-Muslims at an upscale mall in Kenya's capital that was hosting a children's day event, a Red Cross official and witnesses said. (AP Photo/Ben Curtis)\nGunmen threw grenades and opened fire during an attack that left multiple dead and dozens wounded. A witness to the attacks on the upscale shopping mall says that gunmen told Muslims to stand up and leave and that non-Muslims would be targeted.\nSuspected terrorists engaged Kenyan security forces in a drawn out gun fight at the Westgate Mall in Nairboi.\nA woman who had been hiding during the gun battle runs for cover after armed police, seen behind, enter the Westgate Mall in Nairobi, Kenya, Saturday, Sept. 21, 2013.\nGraphic shows detail of shopping mall site of fatal gun attack in Nairobi, Kenya.\nArmed police take cover behind escalators as smoke fills the air inside the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013.\nGunmen threw grenades and opened fire at an upscale mall in Kenya's capital on Saturday, killing at least 10 people.\nArmed police leave after entering the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013.\nCivilians who had been hiding inside during the gun battle manage to flee from the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013.\nThe mall in Kenya's capital was hosting a children's day event at the time of the attack, a Red Cross official and witnesses said.\nArmed police crouch down and take position during a gun battle outside the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013.\nCivilians who had been hiding during the gun battle hold their hands in the air as a precautionary measure before being searched by armed police leading them to safety, inside the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013.\nSecurity helps a woman outside the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013, after gunmen threw grenades and opened fire during an attack that left multiple dead and dozens wounded.\nSecurity helps people outside the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013, after gunmen threw grenades and opened fire during an attack that left multiple dead and dozens wounded.\nWitnesses say a half dozen grenades also went off along with volleys of gunfire in and around the mall.\nA witness to the attacks on the upscale shopping mall says that gunmen told Muslims to stand up and leave and that non-Muslims would be targeted.\nBursts of gunfire were heard from outside the Westgate Mall Saturday, where cars were left abandoned. Witnesses say a half dozen grenades also went off along with lobbies of gunfire that started at midday.\nA woman who had been hiding inside and managed to flee, sits in a state of shock, as an unidentified armed member of the security forces, above, keeps watch outside the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013.\nA security officer helps a wounded woman outside the Westgate Mall in Nairobi, Kenya Saturday, Sept. 21, 2013, after gunmen threw grenades and opened fire during an attack that left multiple dead and dozens wounded. A witness to the attacks on the upscale shopping mall says that gunmen told Muslims to stand up and leave and that non-Muslims would be targeted. (AP Photo/Khalil Senosi)\nA witness to the attacks says that gunmen told Muslims to stand up and leave and that non-Muslims would be targeted. Initial police reports had described the incident as a botched robbery. Witnesses say a half dozen grenades also went off along with volleys of gunfire in and around the mall.\nA witness to the attacks on the upscale shopping mall says that gunmen told Muslims to stand up and leave and that non-Muslims would be targeted.\n Share  Tweet  &#10006 Advertisement Share this &#10006 close Current Slide More: WorldPost Africa Africa Africa Poverty Africa Economy Sub Saharan Africa Africa Obama Africa Visit Obama Africa Summit", "external_links": ["http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937281_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941504_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941493_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941499_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937189_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941495_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941506_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941505_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937191_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941501_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937195_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937202_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937188_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941494_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937186_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937286_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941503_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937287_sq50.jpg", "http://www.un.org/africarenewal/magazine/august-2011/africas-least-developed-lands-opportunity", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941486_sq50.jpg", "http://global-growing.org/en/content/fact-4-average-woman-sub-saharan-africa-gives-birth-five-children-european-woman-birthes", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937284_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941488_sq50.jpg", "http://esa.un.org/unpd/wpp/Publications/Files/Key_Findings_WPP_2015.pdf", "http://data.worldbank.org/topic/poverty", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941497_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937204_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937192_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937198_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937200_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937193_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941498_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941490_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937190_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941496_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941487_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937196_sq50.jpg", "http://www.ictsd.org/bridges-news/trade-negotiations-insights/news/fostering-industrial-development-in-africa-in-the-new", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937282_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937205_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937280_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937201_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941492_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941489_sq50.jpg", "http://articles.baltimoresun.com/2004-07-04/business/0407030053_1_sub-saharan-africa-population-growth-poverty", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2941491_sq50.jpg", "https://www.whitehouse.gov/the-press-office/2015/07/28/remarks-president-obama-people-africa", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937279_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937199_sq50.jpg", "http://www.unicef.org/media/media_74754.html", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937283_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937203_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937187_sq50.jpg", "http://i.huffpost.com/gadgets/slideshows/318083/slide_318083_2937285_sq50.jpg"], "published": "2015-08-05T02:25:00.000+03:00", "crawled": "2015-08-05T02:07:24.269+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}