{"organizations": [], "uuid": "1ebf0148171f86e0c95bf433ba64f659f47cd730", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c7a0991700006e00567007.jpeg", "site_section": "http://www.huffingtonpost.com/raw_feed_index.rdf", "section_title": "The Huffington Post | The Full Feed", "url": "http://www.huffingtonpost.com/entry/wendy-williams-falls-off-stage_55c795c6e4b0923c12bd307f?kvcommref=mostpopular", "country": "US", "title": "Marco Rubio Tries To Clarify His Stance On Abortion Exceptions", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Marco Rubio Tries To Clarify His Stance On Abortion Exceptions", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-09T21:57:00.000+03:00", "replies_count": 0, "uuid": "1ebf0148171f86e0c95bf433ba64f659f47cd730"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/wendy-williams-falls-off-stage_55c795c6e4b0923c12bd307f?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Marco Rubio Tries To Clarify His Stance On Abortion Exceptions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marco Rubio Tries To Clarify His Stance On Abortion Exceptions Rubio supported exceptions in 2013, but now, he says he doesn't. By Megan Cassella Posted: 08/09/2015 02:57 PM EDT | Edited: 21 minutes ago \nWASHINGTON, Aug 9 (Reuters) - Florida Senator Marco Rubio on Sunday defended his stance against abortion without exceptions for rape or when a mother's life was in danger that he was asked about during a debate among Republican presidential candidates on Thursday. \n\"I personally and deeply believe that all human life is worthy of the protection of our laws. I do. And I believe that irrespective of the conditions by which that life was conceived, or anything else, and for me to be consistent on that belief,\" Rubio said on NBC's \"Meet the Press.\" \nDuring Thursday night's debate, Rubio said he never advocated for any exceptions on abortion, including when conception occurs following rape or incest or when the mother's life is in danger. \nHowever, Rubio supported such exceptions when he co-sponsored the Pain-Capable Unborn Child Protection Act in 2013, which aimed to ban late-stage abortions. \nOn Sunday, Rubio denied any inconsistency. He said that while he does not support such exceptions, he would not rule them out if the overall result is fewer abortions. \n\"I recognize that in order to have consensus on laws that limit the number of abortions, a lot of people want to see those exceptions,\" he said on NBC. \nRubio said he recognized that women have the right to make decisions about their own bodies, but that clashes with \"the right of a human being to live.\" \n\"I don't say it's easy,\" Rubio said. \"But when asked to make a decision between two very hard circumstances, I personally reached the decision, if I'm going to err, I'm going to err on the side of life.\" MANDEL NGAN via Getty Images \nFor Rubio, taking a bold stance against exceptions could hurt his standing with women. Wisconsin Governor Scott Walker and former Arkansas Governor Mike Huckabee have also said they do not support abortion in any cases. \nDemocrats seized on his remarks in the debate. \n\"Hey Marco Rubio, the women of the 21st century can hear you,\" Democratic National Committee spokesperson Christina Freundlich said. \"When you don't account for rape or incest, the only thing we see is a candidate with outdated, out of step, and offensive policies of the past. Get with the times or go home.\" (Reporting by Megan Cassella; Editing by Doina Chiacu and Lisa Shumaker) \nAlso on HuffPost: Fox News GOP Debates Aug. 6, 2015 of", "external_links": [], "published": "2015-08-09T21:57:00.000+03:00", "crawled": "2015-08-09T22:23:36.784+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}