{"organizations": [], "uuid": "1c99d21042ddaf17d66407ac7a15c4da2737d551", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3316542/images/o-BIBLE-facebook.jpg", "site_section": "http://www.huffingtonpost.com//feeds/index.xml", "section_title": "The Huffington Post | The Full Feed", "url": "http://www.huffingtonpost.com/roger-nam/immigration-love-without-borders-1-kings-8_b_8005910.html", "country": "US", "title": "Immigration: Love Without Borders (1 Kings 8)", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Immigration: Love Without Borders (1 Kings 8)", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-18T23:28:00.000+03:00", "replies_count": 0, "uuid": "1c99d21042ddaf17d66407ac7a15c4da2737d551"}, "author": "Roger Nam", "url": "http://www.huffingtonpost.com/roger-nam/immigration-love-without-borders-1-kings-8_b_8005910.html", "ord_in_thread": 0, "title": "Immigration: Love Without Borders (1 Kings 8)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThe 2016 presidential election season has brought increased attention to the topic of immigration in recent weeks. In the coming 16 months(!), the American public can expect the different presidential candidates to navigate through immigration issues in order to win voters, whether through shocking opening salvos designed for media attention, or strategically guarded statements intended to repel as few voters as possible. \nA quick look at the language of the candidates' rhetoric reveals that the immigration discussion revolves around two distinct groups. One group is described with terms like \"birthright,\" \"citizenship,\" and \"legals.\" Another group is described as \"undocumented,\" \"illegals\" with one particular candidate having referred to this group as \"criminals\" and \"rapists\" (\"and some, I assume, good people\"). \nOf course, the topic of immigration is not new for this election season. During a period of political transition for ancient Israel, Solomon addressed the issue of \"foreigners\" in his inaugural prayer as recorded in 1 Kings 8 . The preceding chapters narrate Solomon's tortuous path to the monarchy. He was an underdog to the throne as the second living son. The heir apparent was Adonijah, who had kingly physical stature ( 1 Kings 1:6 ) and political support of one of the priestly clans ( 1 Kings 1:7 ). But through the providence of God, alongside the work of Bathsheba and Nathan, Solomon was inaugurated as the king of Israel. His primary duty was to build the temple of God, a long-awaited consummation of a covenantal promise from the patriarchal days. With the construction of the temple ( 1 Kings 6-7 ), the children of Israel finally had a lasting place of worship, where God would dwell. \n1 Kings 8 begins with Solomon gathering the leaders to transport the Ark of the Covenant, thus effectively completing the temple. From verse 12, Solomon begins his dedicatory prayer. Because the temple serves as a dwelling place for God, much of the prayer and its context focus on divine presence. Consider the following movements in the passage: \n路 The movement of the Ark of the Covenant, symbolizing God's presence, into the temple ( 8:1 ). \n路 The placement of the Ark of the Covenant into the most holy place ( 8:6 ). \n路 The cloud and glory of the Lord filling the temple ( 8:11 ). \n路 The emphasis of the presence of God ( 8:22 ). \nThe presence of the cloud is a particularly significant moment. Israel had not experienced the presence of God in this form since the leadership transition from Moses to Joshua ( Deut 31:15 ). The appearance of the cloud during the prayer affirms both the selection of Solomon as the appropriate successor to David, and Israel as God's chosen people. This presence of the cloud also commissions the temple as the true worship site of the Lord. \nIn the middle of this celebratory prayer, Solomon unexpectedly takes a humble turn. He rhetorically asks, \"But will God indeed dwell on the earth? Even heaven and the highest heaven cannot contain you, much less this house that I have built\" ( 8:27 ). Despite the physical grandeur of the temple, it is still inadequate. The young king wisely recognizes that the temple does not, in any way, limit the vast presence of God. \nThis recognition of God's omnipresence reaches a stunning conclusion towards the end of the prayer. One must remember that Solomon is merely the third king in the very brief history of Israel. The early stages of the nation left Israel as politically vulnerable. An inaugural prayer, dedicating the national temple, typically required sweeping statements of the greatness of Israel against enemy polities. \nBut the prayer recognizes that if God dwells beyond Jerusalem, God's spirit must also dwell among other peoples. Thus, Solomon makes the surprising request to God, \"Hear in heaven your dwelling place, and do according to all that the foreigner calls to you\" ( 1 Kings 8:43 ). Even in the midst of a dedicatory prayer at the start of his monarchic reign, Solomon petitions God on behalf of worshippers across the border. In other words, the community of God in 1 Kings 8 crosses borders, transcending the ageless political language of \"insider/outsider.\" \nObviously, the land of Israel had political borders throughout the reign of Solomon. Yet these borders did not prevent Solomon from affirming the presence of God in the midst of non-Israelites. The prayer emphasizes the kindred spirit of those who \"Come from distant lands because of your name\" ( 1 Kings 8:41 ). By entreating God to hear their prayers, Solomon effectively makes them a part of the worshipping community as he asks God to show them hospitality and kindness. \nRegardless of our political leanings, should not Christians do the same for these residents without legal permission? After all, 1 Kings 8 teaches Christians that the presence of the Lord has no political borders. Neither should our love. \nBible Study Questions \n1. When did your family arrive to the United States? (Are you first-generation? Mayflower? Native-American?) How would the earliest generation of your ancestral line understand 1 Kings 8:41-43? \n2. How much do you know about the daily struggles of residents without legal permission? \n3. How can communities of faith more effectively extend hospitality to residents without legal permission? \nFor Further Reading \n1. M. Daniel Carroll, Christians at the Border: Immigration, Church, and the Bible . 2d ed. (Baker, 2013). \n2. Chris Heller, \"I Am An Undocumented Immigrant.\" The Atlantic (August 25, 2014). http://www.theatlantic.com/video/archive/2014/08/i-am-an-undocumented-immigrant/376124/ \n3. Helene Slessarev-Jamir, \"Immigrant Rights Activism\" in Prophetic Activism: Progressive Religious Justice Movements in Contemporary America . (NYU Press, 2011), pp. 131-166. Learn more about the ON Scripture Committee Like ON Scripture on Facebook Follow ON Scripture on Twitter @ONScripture ON Scripture - The Bible is made possible by generous grants from the Lilly Endowment and the Henry Luce Foundation \nFollow Roger Nam on Twitter: www.twitter.com/rogernam More: Click here to view Conversations Conversations", "external_links": [], "published": "2015-08-18T23:28:00.000+03:00", "crawled": "2015-08-18T23:41:57.058+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}