{"organizations": [], "uuid": "e4a41065c044683c487294e4a35755702ba5957d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamacubabiden_070115getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1138/feed", "section_title": "Foreign Policy", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/252485-plea-to-president-obama-regarding-the-iran-deal", "country": "US", "title": "Plea to President Obama regarding the Iran deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Plea to President Obama regarding the Iran deal", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-02T20:00:00.000+03:00", "replies_count": 0, "uuid": "e4a41065c044683c487294e4a35755702ba5957d"}, "author": "jpicard@thehill.com (Kazem Moussavi, PhD)", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/252485-plea-to-president-obama-regarding-the-iran-deal", "ord_in_thread": 0, "title": "Plea to President Obama regarding the Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 02, 2015, 01:00 pm Plea to President Obama regarding the Iran deal By Kazem Moussavi, PhD Getty Images \nDear President Obama, I am writing to you as one of the millions of victims of the Iranian regime’s violations of human rights and on behalf of those oppositionists who advocate democracy in a nuclear free Iran. \nJust as much as the regime knows no limits whatsoever in its terror against the Iranian people, its anti-Americanism, and in its striving to annihilate Israel, just as little will it abide by its obligations resulting from the Vienna nuclear deal. ADVERTISEMENT The Iranian regime’s decades-long relentless insistence on its nuclear projects and the international conflicts it has accordingly been willing to sustain are the result of its apocalyptic ideology and its global claim to power which will prohibit any reform of the system in perpetuity.\nThe religious and political leader Ali Khamenei – to whom the so-called moderate President Hassan Rouhani is avowedly devoted – has recently published a book called Palestine in which he once more emphasizes that Israel has to be wiped from the map and that the whole world has one day to be under his fundamentalist Islamic rule. He also labels the USA as “the great Satan“ and states that the Western hegemony in the Middle East has to be stopped. \nWe have to learn from history. In the summer of 2009, a unique civil rights movement had arisen and stirred millions of Iranians. Its success would have ended the global threat of the Iranian regime’s nuclear projects for good and would have helped provide the victory of the secular democratic demonstrators of the Arab Spring. Tragically, at this particular time, the U.S. chose to negotiate with the representatives of then President Ahmadinejad. The people in the streets of Iran were begging for your support: “President Obama, Obama! Are you with the Mullahs or are you with us?“ Deluded, the U.S. and Europe decided to cling to the inhuman system and ignore the protests of the long-suffering people. \nThe fundamental flaw of the Vienna nuclear deal is that it does not demand the regime to strictly comply with universal human rights. In the aftermath of the deal, the conditions of human rights in Iran have dramatically degraded. Now, every five hours a human being is executed by Rouhani’s vicarious agents. In the Islamic Republic’s prisons the bodies of the murdered freedom fighters are wrapped in American and Israeli flags and then buried in the ground. \nThe deal’s fifteen to twenty years-deadline will guarantee the terror regime’s continuation. During that period the regime is going to spend billions of dollars resulting from the abolition of sanctions on the intensification of its repressive politics in the region. In view of those conditions: How will the Iranian people who demand universal human rights, democracy, and secularism ever be able to fight for freedom again? \nI must criticize your equating the US representatives’ and senators’ opposition to the nuclear deal with the inhuman Iranian regime’s hardliners. While, at the same time, you yourself advocate an agreement with the worst of all hardliners: Ali Khamenei. You are being ill-advised if you derive your position from within the ranks of so-called peacemaking Iran lobbying organizations like NIAC. Thus you promote Rouhani’s tactical illusion of an alleged Iranophobia, the one and only objective of which is to denounce and isolate Israel in order to be able to unrestrictedly advance his politics of expansion. \nWith solely this one objective in mind, the Islamic Republic is now fighting against its Sunni competitor ISIS in its protectorates in Syria and Iraq. Not to mention that ISIS did arise from the ashes of the terror of the Iranian regime and the Western world’s appeasement of it. Accordingly: Tehran must never be courted as a partner to overcome the terror of ISIS. The quality and quantity of the more than three decades of state-run terror of the Iranian regime – the main sponsor and profiteer of international terrorism – is unprecedented. \nIt is much to my regret that you are willing to conclude the achievements of your presidency with a dangerous nuclear deal with the Iranian regime. Even worse is that you state that not signing the deal would result in war. A war, however, will happen if you ignore the immediate source of current and future conflicts. Accordingly, the U.S. and Europe have to condition their signing the deal on the immediate liquidation of the Revolutionary Guards and Al Quds Forces. They are the sole power-maintaining apparatus of the regime and responsible for the coordination and organization of building the nuclear bomb. Of all organizations, the West has in the end assigned the Revolutionary Guards to inspect the most important nuclear site in Parchim. In view of those conditions: How can the international community be preserved from the devastating consequences of a jihadist nuclear system? \nIt is your human obligation to immediately revoke the deal and the suspension of sanctions as long as the opposition, women, homosexuals, children, and minorities are being murdered in Iran and as long as the Iranian regime keeps chanting: “Death to the USA! Death to Israel!“ \nAgainst all odds: I plea to you, the Congress and everyone to support the democratic secular opposition in Iran and in exile and stop the mullahs from getting the bomb! \nMoussavi is a spokesman for the Green Party of Iran.", "external_links": [], "published": "2015-09-02T20:00:00.000+03:00", "crawled": "2015-09-03T01:36:43.328+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}