{"organizations": [], "uuid": "73482dc60c56066a29111821ab4057bf7d043aad", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/blog.xml", "section_title": "Business Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/dante-disparte/president-obama-and-the-e_2_b_7920518.html", "country": "US", "title": "President Obama and the Era of Afri-preneurship | Dante Disparte", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "President Obama and the Era of Afri-preneurship | Dante Disparte", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-05T00:52:00.000+03:00", "replies_count": 0, "uuid": "73482dc60c56066a29111821ab4057bf7d043aad"}, "author": "Dante Disparte", "url": "http://www.huffingtonpost.com/dante-disparte/president-obama-and-the-e_2_b_7920518.html", "ord_in_thread": 0, "title": "President Obama and the Era of Afri-preneurship | Dante Disparte", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Part 1 of 3 articles focused on entrepreneurship in Africa.\nWhite House invitation in hand, I was honored to speak at the Global Entrepreneurship Summit in Nairobi on the topics of innovation, navigating the funding cycle and entrepreneurial hubs. Kenya was abuzz with excitement ahead of a proverbial homecoming for President Obama. For all the temporary excitement that global summits evoke, GES2015 and the SPARK Global Entrepreneurship initiative acknowledge one lasting shift in Africa's promise -- namely that the continent's future lies in the hands of its people and not its natural resources.\nAfter the sun, Africa's most abundant resource is its people -- more than 960 million strong. While some liken a \"youth bulge\" to a curse and a source of social unrest, others see a youthful dynamic population as a massive untapped opportunity. Catalyzing the next generation of African entrepreneurs, Tony Elumelu has launched the Tony Elumelu Foundation Entrepreneurship Program (TEEP) and seeded this initiative with $100 million of his own money. The stated goals are to raise an entire generation of pan-African entrepreneurs identifying 10,000 startups with the potential to create 1 million new jobs and $10 billion in revenues over 10 years. In the disruptive era of hyper-valued Unicorns like Uber, this ambitious goal is entirely possible and it only takes 1 of the 10,000 startups to be a breakaway success to achieve these goals. In the program's launch year, 1,000 entrepreneurs from 51 African nations participated in an intensive curriculum honing their skills, mentoring relationships and networks. Guided by the experience of a successful African entrepreneur, TEEP underscores the need for a uniquely African response to market challenges and opportunities. In effect, Mr. Elumelu has triggered a necessary standards war on which model of entrepreneurship will set the African paradigm.\nTo be sure, importing the algorithmic decision making from advanced market banks, angel investors and many private equity firms that confound entrepreneurs in the U.S. and around the world, would be a setback for their African peers. For one, prospective early stage investors are often too formulaic in their approach. The formula of historical financials, market sizing, business plans and perfect 5-year exit strategies means that even the most seasoned early stage investors approach African opportunities with trepidation and the wrong yard stick. Not to mention the risk-aversion that sinks in when dealing with multiple currencies, opaque markets and the very real challenges of underdeveloped infrastructure and talent pools. This puts unreasonable financial demands on the risk-reward trade off driving up the cost of capital and evaporating its already scarce availability. The other pernicious effect of this funding reality is that entrepreneurs are lured by the siren call of building businesses they want to fund, as opposed to businesses they want to run. In pitch decks and spreadsheets it is very easy to make a perfect business. The market is much less forgiving and it is the only road to success, however tumultuous and indirect the path. Yet, herein lies the opportunity for a uniquely African entrepreneurial response to emerge.\nJust like banking in Africa was not constrained by the brick, mortar and tellers of international banks, so too funding for entrepreneurs need not conform to global norms. In fact, we would be wise to remember that more than 90 percent of startups in the U.S. go unfunded. Is the failure rate that high or is the funding model too risk-averse and formulaic driving up the failure rate? The truth is somewhere in the middle and it speaks to an entrepreneur's most valuable asset, namely their culture and resilience. Even when you fall, most of the time you are moving forward. If you fall backwards, land on your back so the blue sky inspires other uncontested markets to attack. Above all, get back up, dust yourself off, rinse and repeat.\nBeing an entrepreneur is hard everywhere. In Africa, at the risk generalizing, importing too many of the confines of established norms may prevent truly unique funding and entrepreneurial paradigms from emerging. The conversations, ideas and networks brought together at GES2015 and catalyzed in the market by President Obama, TEEP and other innovative programs building human capital are sure to trigger Africa's inexorable rise. A newly published book by Aubrey Hruby and Jake Bright, The Next Africa , chronicles the continent's inevitable ascension as a global powerhouse. While many obstacles remain, including grinding corruption, market opacity and a persistent lack of capital and market access, nevertheless, the die has been cast and investors would do well to go long on Africa.\n(First published in LinkedIn Pulse.)\nFollow Dante Disparte on Twitter: www.twitter.com/ddisparte\nMore:", "external_links": ["http://us.macmillan.com/thenextafrica/jakebright", "http://www.businessinsider.com/startup-odds-of-success-2013-5", "http://www.ges2015.org/", "http://www.twitter.com/ddisparte", "http://www.startthespark.org/"], "published": "2015-08-05T00:52:00.000+03:00", "crawled": "2015-08-05T02:08:28.617+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}