{"organizations": [], "uuid": "242d1ad01f485edba1e8c2e3e5bd4693d262acdf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3277018/images/o-HIROSHIMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/elliott-negin/on-the-a-bombs-70th-anniv_b_7953126.html", "country": "US", "title": "On the A-Bomb's 70th Anniversary, Obama Wants to Spend a Trillion Dollars on New Nuclear Weapons | Elliott Negin", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "On the A-Bomb's 70th Anniversary, Obama Wants to Spend a Trillion Dollars on New Nuclear Weapons | Elliott Negin", "spam_score": 0.0, "site_type": "blogs", "published": "2015-08-07T17:48:00.000+03:00", "replies_count": 0, "uuid": "242d1ad01f485edba1e8c2e3e5bd4693d262acdf"}, "author": "Elliott Negin", "url": "http://www.huffingtonpost.com/elliott-negin/on-the-a-bombs-70th-anniv_b_7953126.html", "ord_in_thread": 0, "title": "On the A-Bomb's 70th Anniversary, Obama Wants to Spend a Trillion Dollars on New Nuclear Weapons | Elliott Negin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama made the case for a nuclear-free world in Prague in April 2009.\nNews organizations love anniversary stories, and if for some reason you haven't heard, it's the 70th anniversary of when the United States dropped two atomic bombs on Japan. The first exploded over Hiroshima on August 6, and the second over Nagasaki on August 9.\nNot surprisingly, there's been a proliferation of print and broadcast stories on the making of the bomb, the politics of the bomb, the dropping of the bomb, the survivors of the bomb -- you name it. The Washington Post even ran a story about a 390-year-old Japanese white pine now in the U.S. National Arboretum that survived the Hiroshima blast.\nDespite all this coverage, however, I didn't notice any stories that bothered to mention the fact that the Obama administration wants the U.S. government to spend as much as $1 trillion over the next three decades on a new generation of nuclear warheads, bombers, submarines and intercontinental ballistic missiles (ICBMs).\nIsn't it time, as nutritionist Susan Powter used to say, to stop the insanity?\nU.S. Military Budget Higher than Cold War Average\nHaving grown up during the Cold War, nuclear bombs are all too familiar. In October 1962, during the Cuban missile crisis, my elementary school conducted regular drills, lining up all the boys and girls and leading us single file to the building's basement fallout shelter. In retrospect, it was a moderately better option than cowering under our desks. Years later, in the mid-1980s, I was the editor of Nuclear Times , a bimonthly magazine that covered what turned out to be the end of the Cold War. When Soviet leader Mikhail Gorbachev waved the white flag at the United Nations in 1988, there was great excitement about what was then called the \"peace dividend.\" No more Cold War, no more Cold War defense spending. Perhaps the U.S. government could finally use the billions it was lavishing on the military, the nuclear weapons complex, and defense contractors for other, more socially useful, ends.\nBut the peace dividend never happened. At $610 billion, the annual U.S. military budget today is actually higher than it was on average during the Cold War and is more than the combined military budgets of the next seven countries: China, Russia, Saudi Arabia, India, and our longtime NATO allies France, Germany and the United Kingdom. It eats up more than half of the U.S. annual discretionary budget.\nTo be sure, thanks to a series of treaties, both the United States and Russia have cut their respective nuclear arsenals considerably since the end of the Cold War. In 1988, the Soviets had 37,000 nuclear weapons and the United States had 23,000. Today, Russia has an estimated stockpile of 4,500 warheads, of which 1,800 strategic warheads are deployed on missiles and at bomber bases. The United States, meanwhile, has an estimated stockpile of 4,800 warheads. Approximately 2,100 of them are deployed on ballistic missiles or at bomber bases. That's a lot less than 30 years ago, but keep in mind that just one of those warheads is five to 40 times more powerful than the bomb dropped on Nagasaki, which exploded with a force of 20,000 tons of TNT.\nThe 3+2 Warhead Plan Doesn't Add Up\nIn April 2009 -- just a few months after taking office -- President Obama gave a widely acclaimed speech in Prague that focused largely on the threat posed by nuclear weapons. \"The existence of thousands of nuclear weapons is the most dangerous legacy of the Cold War,\" he said. \"And as the only nuclear power to have used a nuclear weapon, the United States has a moral responsibility to act. We cannot succeed in this endeavor alone, but we can lead it, we can start it.\" He then cited some of the \"concrete steps\" the United States would take \"toward a world without nuclear weapons.\"\nLater that year, Obama was awarded the Nobel Peace Prize, largely because of that speech. And in April 2010, he was back in Prague to follow through with one of his promised concrete steps: to sign a new Strategic Arms Reduction Treaty with Russia, further cutting both countries arsenals and reinstituting a strict verification system that the Bush administration had dropped.\nSince then, however, the Obama administration has apparently forgotten that Obama called for putting an \"end to Cold War thinking\" during that Prague speech. Remarkably, the administration is proposing that the U.S. government spend $1 trillion over the next 30 years to refurbish or replace the current nuclear arsenal.\nApproximately $60 billion is slated to replace existing nuclear weapons with a suite of new warheads, a task that would be handled by the National Nuclear Security Administration (NNSA), a semi-autonomous agency within the Department of Energy. The NNSA plan specifically calls for building new nuclear material production facilities and consolidating the current stockpile of seven types of warheads into five. The arsenal of tomorrow would consist of three warheads deployed on Air Force and Navy long-range missiles and two types of air-delivered weapons deployed on cruise missiles and bombers.\nThe so-called \"3+2\" plan, however, violates the spirit if not the letter of the Obama administration's pledge to not develop new nuclear weapons. Besides that, it's fiscally irresponsible and technologically problematic, according to a 2013 Union of Concerned Scientists (UCS) report .\n\"The United States needs to extend the life of its nuclear arsenal, but it should refurbish its existing weapons instead of spending tens of billions of dollars to build new ones,\" said report co-author Lisbeth Gronlund, co-director of UCS's Global Security Program.\nThe NNSA plan's major technical drawback, she added, is that it could be difficult for the agency to certify that its new warheads are safe, secure and reliable without nuclear explosive testing. The United States, which conducted its last explosive test in 1992, has signed but not ratified the Comprehensive Test Ban Treaty prohibiting them.\n\"The NNSA can vouch for the safety and reliability of currently deployed or refurbished warheads,\" she said, \"but the same level of confidence may not be possible if the agency makes substantial modifications.\"\nThe Air Force and Navy Want New Toys\nWhile the Energy Department is counting on funding for new warhead designs, the Defense Department is queuing up for new nuclear bombers, cruise missiles and submarines.\nThe Air Force wants a new stealth plane, dubbed the Long Range Strike Bomber, or B-3 bomber for short, that can reach targets deep inside Russia and China. The Air Force would like 80 to 100 of them at an estimated cost of $550 million each. Loren Thompson, an executive at the defense contractor-funded Lexington Institute, estimates the plane will more likely cost $900 million per plane, after factoring in inflation and a $20-billion research and development program to figure out its design. The planes wouldn't be operational until at least 2025.\nNorthrop Grumman and Boeing, the two main contractors that produced the problem-plagued B-2 stealth bomber, are vying for the contract. You may remember the bat-shaped, black B-2. At $3 billion apiece in today's dollars -- the most expensive plane ever built -- it didn't quite perform as advertised. It turned out the bomber only worked properly in fair weather. Its skin, which gives it its radar-evading \"stealth,\" deteriorated in rain, heat and humidity. The Air Force originally planned to order 132 B-2s, but settled for only 20 after the Soviet Union collapsed.\nEven so, do we really need a new stealth bomber? The Air Force has been spending billions of dollars to upgrade the three bombers it already has, the Center for Public Integrity reported in a March 2012 exposé , and \"has acknowledged the B-1 and B-52 will be structurally sound for at least another 29 years -- and the B-2 potentially for another 50 or more.\"\nThe Air Force also covets a new nuclear-armed cruise missile to replace its Air-Launched Cruise Missile, due for retirement in 2030. Called the Long-Range Standoff (LRSO) weapon, its proponents bill it as \"a hundred times\" more capable than its predecessor -- faster, more accurate, stealthy, longer range -- and nuclear-tipped. The estimated LRSO budget is pegged at as much as $32 billion: $20 billion for the missile and $8 billion to $12 billion for the warhead.\nPutting aside the cost, the LRSO is both unnecessary and dangerous, according to UCS senior analyst Stephen Young.\n\"The Air Force is already counting on an updated B61-12 [nuclear] gravity bomb and the Long Range Strike Bomber, the new super-stealthy penetrating bomber,\" Young pointed out in a blog post earlier this year. \"Why exactly do we need both a penetrating bomber with a gravity bomb and a long-range cruise missile that would be carried by the same bomber?\"\nMore troubling, \"nuclear-armed cruise missiles create a real risk of miscalculation and unintended escalation,\" Young added. It would be impossible for an adversary to know whether the United States had launched a conventional or nuclear cruise missile, which could very well trigger a nuclear war.\nNot to be outdone, the Navy wants a dozen new-generation, nuclear-armed submarines to replace its Ohio class subs by 2030. It estimates the total cost of the new subs at $79 billion, or on average $6.6 billion each, while the Congressional Budget Office projects a total cost of $92 billion, or $7.7 billion each.\nDoes the Navy really need 12 new nuclear subs? Critics say no. With budget constraints likely to continue into the future, the Pentagon will have to weigh the cost of that many subs against other pressing needs.\nLet's Really Put an End to Cold War Thinking\nFortunately, cooler heads in Congress are pushing back on the rush to saddle U.S. taxpayers with a trillion-dollar bill for weapons that can never be used. Massachusetts Sen. Edward Markey and Oregon Rep. Earl Blumenauer have reintroduced legislation this session that would cut $100 billion over the next 10 years from U.S. nuclear weapons programs.\nAmong other things, the proposed bill -- aptly titled the Smarter Approach to Nuclear Expenditures (SANE) Act -- would pay for only eight new replacement submarines, cut new warhead programs and defer development of new ICBMs, delay development of the B-3, and cancel new nuclear weapons-making facilities.\n\"We cannot afford these weapon systems and we don't need them,\" Blumenauer said in a press release he and Markey issued when they originally introduced the bill in February 2014. \"They are dangerous and costly to store and maintain. ...We can make the world, and our country, safer by reducing spending on these programs that we haven't used in 69 years and are better suited for the Cold War than the strategic challenges we face today.\"\nThe SANE Act doesn't have a ghost of a chance to pass Congress. But there are a number of things President Obama can do on his own -- without Congress and without Russia -- during the final lap of his last term to make good on the promises he made in Prague six years ago. David Wright, co-director of UCS's Global Security Program, spelled them out in a July blog post :\nThe president should take U.S. land-based missiles off hair-trigger alert and remove options from U.S. war plants to launch nuclear weapons based on warning of an attack. This option has led to the increased risk of a nuclear launch a disturbing number of times in past decades, and has been called for by high-level military and political officials -- including President Obama.\nHe should also declare a policy of \"sole purpose,\" that is, make it U.S. policy that the only use for its nuclear weapons is to deter, and if necessary respond to, a nuclear attack. Today, the United States reserves the option to use nuclear weapons first.\n[Finally,] he should require that the United States not develop new nuclear weapons, but instead refurbish U.S. warheads as they age to keep the U.S. deterrent credible. Currently the administration is proposing a new, untested warhead design that may lead to pressure on a future administration to restart nuclear testing. A resumption of testing would undermine the Nuclear Test Ban Treaty as well as the Nuclear Non-Proliferation Treaty.\nAgain, President Obama has the authority to take these concrete steps before he leaves office. And what more fitting way to commemorate the atomic bomb's 70th anniversary by doing just that? Otherwise, perhaps he should give his Nobel Peace Prize back.\nElliott Negin is a senior writer at the Union of Concerned Scientists.\nFollow Elliott Negin on Twitter: www.twitter.com/ElliottNegin\nMore: Nuclear Weapons Barack Obama Union of Concerned Scientists Comprehensive Test Ban Treaty Department of Defense Energy Department Air Force Navy Edward Markey Earl Blumenauer Nuclear Nonproliferation Boeing Northrop Grumman B 2 Bomber", "external_links": ["http://www.upi.com/Business_News/Security-Industry/2015/07/10/US-tests-B61-12-nuclear-gravity-bomb/7211436542217/", "http://www.markey.senate.gov/imo/media/doc/2014_SANE_Act.pdf", "http://www.publicintegrity.org/2012/03/26/8498/will-55-billion-bomber-program-fly", "http://cns.miis.edu/opapers/pdfs/140107_trillion_dollar_nuclear_triad.pdf", "http://allthingsnuclear.org/cancel-the-cruise/", "http://blog.ucsusa.org/president-obama-go-to-hiroshima-794", "http://www.forbes.com/sites/lorenthompson/2015/03/09/the-air-forces-b-3-bomber-isnt-as-secret-as-it-seems/", "http://www.nnsa.energy.gov/ourmission/managingthestockpile/ssmp", "http://www.bos.sagepub.com/content/early/2015/04/13/0096340215581363.full.pdf+html", "http://bos.sagepub.com/content/71/2/107.full.pdf+html", "http://www.twitter.com/ElliottNegin", "http://www.pgpf.org/Chart-Archive/0053_defense-comparison", "http://www.ucsusa.org/nuclear_weapons_and_global_security/solutions/us-nuclear-weapons/us-nuclear-weapons-arsenal.html#.VcO70PlBDkQ", "http://www.markey.senate.gov/news/press-releases/markey-and-merkley-introduce-legislation-to-cut-bloated-nuclear-weapons-budget", "http://www.breakingdefense.com/2014/12/navy-sticks-by-ohio-replacement-costs-cbo-says-its17-higher/"], "published": "2015-08-07T17:48:00.000+03:00", "crawled": "2015-08-07T17:29:05.449+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}