{"organizations": [], "uuid": "6f3e5fad2ba580bea457b03dd0d8b0bca9a7f254", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/entertainment/blog.xml", "section_title": "Entertainment Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/byron-williams/when-will-we-have-a-judic_b_8110678.html", "country": "US", "title": "When Will We Have a Judicious Immigration Debate? | Byron Williams", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 5, "title_full": "When Will We Have a Judicious Immigration Debate? | Byron Williams", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-09T19:08:00.000+03:00", "replies_count": 5, "uuid": "d113ad2a45c6b84d2dfaaf1519cb3d21a8dfb748"}, "author": "Byron Williams", "url": "http://www.huffingtonpost.com/byron-williams/when-will-we-have-a-judic_b_8110678.html#post-0", "ord_in_thread": 0, "title": "When Will We Have a Judicious Immigration Debate? | Byron Williams", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Since the Donald Trump phenomenon began I have asked a simple question:\n\"Which has the best chance to reach fruition: Donald Trump becoming president or a sparrow reaching Mars with an anvil tied to its tail?\"\nAs of this writing, the sparrow is a heavy favorite.\nThe significance of Trump is not so much his status as the Republican frontrunner with more than 400 days before Election Day, but how he managed to attain this position--his overt display of xenophobia under the guise of public policy to address immigration.\nAs much as the Republican Party would like to portray Trump as an aberration, the kooky uncle who picked the lock in the attic and crashed the Thanksgiving Day dinner, is he not saying what the party has been advocating since 2001, which has systematically cost them large swaths of the Hispanic vote?\nIn the aftermath of the 9/11 tragedy conservatives reprised the illegal immigration debate by comingling the people who risked their lives to come to America illegally for work with those who came here legally to send Jets into the World Trade Center, the Pentagon, and into a field in Pennsylvania.\nThe canard of fear conveniently and maliciously overshadows the much-needed debate on immigration, which can only be accomplished through a dispassionate lens that relies heavily on reality.\nThe obvious portion of that reality says it is impossible to deport some 11 million people. To this, Trump and others have questioned the validity of Section 1 of the 14th Amendment.\nWhat about the economic piece of the immigration debate?\nEconomists Angel Aguiar and Terrie Walmsley conducted a 2013 study and their findings reveal where full deportation (the unlikely Trump et al position) reduces gross domestic product by 0.61 percent; legalization with borders increases GDP by 0.17 percent.\nThis data factors high and low skill workers. Specifically addressing low-skill workers, University of California economist Gordon Hanson concludes that low-skilled immigrant workers can make the American economy more efficient. Hanson offers the mobility factor of low-skilled immigrant workers is higher than native-born American workers.\nAccording to Hanson :\n\"Low-skilled U.S.-born workers tend to be immobile across regions. When, say, the demand for low-skilled labor picks up in North Carolina, native-born workers in other regions are slow to move in . . . The consequence of the immobility of low skilled labor is to gum up the labor market, slowing the pace of growth in booming regions and the pace of recovery in slumping regions.\"\nThe xenophobia position also holds that the current immigration dilemma suppresses wages, but a 2010 study by the Brookings Institute concluded that, \"The most recent academic research suggests that, on average, immigrants raise the overall standard of living of American workers by boosting wages and lowering prices.\"\nEven a judicious immigration policy would not equate to perfection. The unintended consequences would most likely include individual cases where workers were pushed out of due to immigrant competition. But isn't competition germane to a market economy?\nMoreover, the xenophobes dominate this debate void of any historical context. Was it not a forced immigration policy that allowed America to go from fledging nation in 1787 to amassing more than 80 percent of the global market share for cotton by 1860?\nAccording to Cornell University professor Edward Baptist, cotton's economic impact in the 19th century was akin to oil in the 20th century and the microchip in the 21st century.\nBut the economic efficacy of immigration is not the debate we're having.\nIt is the same debate whether under the shroud of law and order, family values, or some other harmless sounding phrase that masks the vitriol that it spews.\nBecause one wants restrictions on immigration does not make one by definition a xenophobe, but that is not the conversation that is dominating the discussion. Rather, it is a mountain of reactionary hatred, fortified by fear, that subsumes the current conversation.\nTrump did not start this debate. But in his albeit overtly bombastic Neanderthal manner he has taken it to a place this is causing discomfort for his GOP rivals and many within the party at-large.\nIronically, Presidents George W. Bush and Barack Obama have put forth similar immigration plans that have gone nowhere.\nMaybe xenophobia is the flavor of the season. The only sticking point is the way Trump is serving the dish.\nFollow Byron Williams on Twitter: www.twitter.com/byronspeaks\nMore: Immigration Latino Politics Xenophobia", "external_links": ["http://business.time.com/2013/01/30/the-economics-of-immigration-who-wins-who-loses-and-why/", "http://www.washingtonpost.com/news/wonkblog/wp/2013/01/29/five-things-economists-know-about-immigration/", "http://www.twitter.com/byronspeaks", "https://www.washingtonpost.com/opinions/trump-flunks-immigration/2015/08/18/f6f7756c-45cb-11e5-8ab4-c73967a143d3_story.html"], "published": "2015-09-09T19:08:00.000+03:00", "crawled": "2015-09-09T19:12:10.424+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}