{"organizations": [], "uuid": "2b957c02ee072e73afbfb7933cb9cf547088bf41", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/blog.xml", "section_title": "WorldPost Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/georgianne-nienaber/obama-sends-merten-back-t_b_8204364.html", "country": "US", "title": "Obama Sends Merten Back to Haiti as New Election Crisis Looms | Georgianne Nienaber", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 23, "title_full": "Obama Sends Merten Back to Haiti as New Election Crisis Looms | Georgianne Nienaber", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-28T01:23:00.000+03:00", "replies_count": 27, "uuid": "12f9d6312ac01cbe602f30af3d9c42d0c9bd77f5"}, "author": "Georgianne Nienaber", "url": "http://www.huffingtonpost.com/georgianne-nienaber/obama-sends-merten-back-t_b_8204364.html#post-0", "ord_in_thread": 0, "title": "Obama Sends Merten Back to Haiti as New Election Crisis Looms | Georgianne Nienaber", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "U. S. Presidents will sometimes scheme to preserve a legacy, but the media is strangely silent on the Obama administration's latest move in Haiti. With little fanfare from our shores, Kenneth Merten was appointed as the Haiti Special Coordinator in August 2015. Merten served as the United States Ambassador to Haiti from 2009 to July 2012. Why President Obama and John Kerry would want to return Merten to Haiti is anyone's guess, since his tenure as Ambassador did little to lift Haiti from the hell of the 2010 earthquake or the corruption that followed.\nDuring Merten's time in Haiti, the country also faced allegations of a rigged Presidential election and misappropriation of earthquake relief funds. The U.S. House of Representatives Committee on Foreign Affairs attributed some of the most egregious waste to USAID in blistering testimony : \"Haiti: Is U.S. Aid Effective?\" Included is a Government Accountability Office (GAO) analysis of failures at the Caracol Industrial Park development, and other \"programs that have been slowly implemented, more costly than planned, and of questionably lasting impact.\" Caracol is the creation of Hillary Clinton, her former chief of staff Cheryl Mills, and the Clinton Foundation .\nNow, Merten returns to Haiti in the middle of another election crisis and an 18 percent August voter turn-out, which some observers think might be closer to 4-5 percent. The country's Provisional Electoral Council (CEP) has not yet released the final results from the August 9 legislative elections. The official website lists the population of each Department (similar to a province) and the number of votes cast, but no vote count by political party. The Haitian press has released \"preliminary\" results, but these have not been officially confirmed.\nLast week, fifty of the more than 120 political parties and groups registered with the Provisional Electoral Council (CEP) attended a meeting to determine why the CEP had not yet released a final vote tally. The meeting turned into a heckling fest, with attendees calling for the ouster of CEP President Pierre Louis Opont. According to a source with knowledge of the meeting, Opont has lost all credibility.\nMerten is a predictable choice to defend U.S. interests in the Haiti Parliamentary elections, since he was Ambassador to Haiti during the 2010-11 Haiti Presidential election cycle that installed musician \"Sweet Mickey\" Martelly. Results obtained by the CEP and the European Union-backed National Observation Council's (CNO) were switched, removing Jude Celestin from the runoff and advancing Martelly. It was essential to US interests that Martelly, and not Celestin, participate in the runoff.\nIn July 2015 CEP President Pierre Louis Opont said that the Unites States rigged the 2010 elections. As director general, Opont gave the official recount results to the international observers. He charged that Cheryl Mills, the Chief of State for Secretary of State Hillary Clinton, and the observers from the Organization of American States (OAS) then gave results different than what were passed to them. People are angry that Opont did not speak up at that time and fear that he may once again be functioning as a puppet of the United States until \"satisfactory\" election results are obtained.\nElection posters in October 2010, Port-Au-Prince (Photo Nienaber)\nThe release of emails from Hillary Clinton's private email server lends credence to Opont's story about 2010.\nAn email thread between Hillary Clinton and her Chief of Staff Cheryl Mills (Case No. F-2014-20439 Doc No. C05777664) was copied to Merten. In it, the Secretary of State participated in a heavily redacted discussion of a draft statement by the State Department on the elections. It appears that a defense was crafted that explained why the initial results released by the State Department were changed.\nThis is the statement we released late last night. Election results order Manigault, Celestin, Martielly (sic). May be good to have Tom Adams give you a quick update today.\nIn the email thread, on Tuesday December 7, 2010, Cheryl Mills instructs a staffer to \"print the traffic\" on a draft embassy statement that discusses something the \"tabulation center\" did not show in their first statement which Quote: d the CEP tabulations.\nCurrent events are echoing the 2010 Presidential election under Merten's tenure while Hillary Clinton was Secretary of State. Describing the August 2015 polling, the Miami Herald said, \"Around the country, polling stations were attacked and ballots were stuffed after candidates and their partisans thought they were losing. Polls also opened late and political parties had problems getting credentials for their observers.\"\nHaiti has been desperately seeking fair and credible elections since her formation, but\nmeddling in elections has been a part of U.S. policy towards Haiti since at least 1915. At that time, forces opposed to his close ties with the United States assassinated Haitian President Vilbrun Guillaume Sam. Sam had ordered his predecessor Oreste Zamor and 160 or so of his allies executed in Port-au-Prince.\nU.S. Marines then took over the harbors in what amounted to a military invasion. The Haitian legislature was in session during this crisis and about to proceed to the election of a new president, when Admiral William B. Caperton, under orders from the U.S. State Department, \"twice induced the Chambers to postpone the election.\" See \"The Seizure of Haiti by the United States; A report on the military occupation of the Republic of Haiti and the history of the treaty forced upon her.\"\nThe State Department, \"by the instruction of the President,\" requested the Navy Department to send a sufficient force of marines to control the situation absolutely, and Caperton was instructed that the United States favored the election of [Sudre] Dartiguenave.\nHistory shows that U.S. \"favored\" elections are a sine qua non of Haitian election cycles.\nThe current President, Martelly, who cannot run for re-election, has dozens of candidates running throughout the country under his Haitian Tet Kale (Bald Headed) Party (PHTK).\nThe United States and others in the international community provided $38 million to the CEP to organize the August 9, 2015 elections. This amount is more than four times the amount spent by nations of similar to greater populations and circumstances, according to the Haiti Sentinel.\nElection fixing is closely tied to USAID failures in Haiti.\nRewind the reels of history to November 2011 when Ambassador Merten stood with Bill Clinton, representatives from the Inter-American Development Bank (IDB), and Korean apparel manufacturer Sae-A Co. Ltd., as they officially laid the foundation stone for the Caracol Industrial Park. Their protégée, the new Haitian President Michel Martelly, infamously said, \"Haiti is open for business.\"\nMerten hailed the Caracol Industrial Park and Sae-A's investment in Haiti as \"a great victory\" and said, \"Investment is the real key to making the Haitian people more prosperous, which in turn will make the Haitian nation more independent and sovereign.\"\nA lot has not happened at Caracol since 2011 when Merten claimed a \"great victory\" for the industrial park. The 2013 GAO analysis of failures there under Merten's tenure is epic and shows the folly of unaccountable USAID and Clinton Initiative programs in a region of Haiti that was untouched by the earthquake of 2010. A third or more of earthquake reconstruction funding was allocated to the industrial park, a power plant to run it, and a port facility to service the park.\nMeanwhile Port-Au-Prince was rubble.\nThe 2015 GAO Report is not much improved from 2013. As of September 30, 2014, the U.S. Agency for International Development\n(USAID) had allocated $1.7 billion to the Haiti reconstruction effort, but has dispersed only 54 percent or $911 million.\nMerten has not said a word about the failure of USAID, but seems to be focusing on the unfolding election debacle. He urged \"all parties to work together to solve the shortcomings observed during the elections on 9 August, to ensure that the elections of 25 October and 27 December next are conducted peacefully and credibly.\"\nIf it does not work out to his liking, Merten can always steal a page from history and request that the U.S. send in the Marines (again).\nFollow Georgianne Nienaber on Twitter: www.twitter.com/nienaber\nMore: Haiti Haiti Earthquake Usaid Kenneth Merten Hillary Clinton Secretary of State Hillary Clinton Clinton Initiative Foreign Policy Usaid Policy This Blogger's Books and Other Items from... Horse Sense\nby Georgianne Nienaber Gorilla Dreams: The Legacy of Dian Fossey\nby Georgianne Nienaber", "external_links": ["http://www.miamiherald.com/news/nation-world/world/americas/haiti/article35643162.html", "http://www.haitilibre.com/en/news-15248-haiti-politic-kenneth-merten-continues-his-visit-to-the-country.html", "http://ecx.images-amazon.com/images/I/513w2sJwXgL._SL160_.jpg", "http://www.amazon.com/exec/obidos/ASIN/059537669X", "http://www.ijdh.org/2015/07/topics/politics-democracy/new-claims-of-us-backed-fraud-in-haitis-2010-presidential-election/#", "http://sentinel.ht/2015/09/18/haiti-political-parties-boycott-meeting-with-electoral-council/", "http://www.executedtoday.com/tag/jean-vilbrun-guillaume-sam/", "http://www.indiebound.org/?aff=HuffingtonPost", "http://www.state.gov/r/pa/ei/biog/197675.htm", "http://www.gao.gov/assets/680/670616.pdf", "http://www.haitilibre.com/en/news-14899-haiti-flash-complete-results-of-the-elections-of-august-9-2015.html", "http://www.amazon.com/exec/obidos/ASIN/B00790TI3E", "http://www.cephaiti.ht/Resultats-Preliminaires-Legislatives-2015.html", "http://www.gpo.gov/fdsys/pkg/CHRG-113hhrg85105/pdf/CHRG-113hhrg85105.pdf", "http://www.reuters.com/article/2015/08/10/us-haiti-election-idUSKCN0QE09H20150810", "https://www.youtube.com/embed/MPQQDc7iqR0", "http://www.iadb.org/en/news/news-releases/2011-11-28/caracol-industrial-park-in-haiti,9724.html", "http://www.gao.gov/products/GAO-14-47T", "https://www.clintonfoundation.org/main/clinton-foundation-blog.html/2012/10/25/president-clinton-announces-opening-of-caracol-northern-industrial-park-in-haiti", "http://www.amazon.com/", "https://archive.org/details/seizureofhaitiby00newy", "http://www.twitter.com/nienaber", "http://ecx.images-amazon.com/images/I/41bF1zkcMAL._SL160_.jpg"], "published": "2015-09-28T01:23:00.000+03:00", "crawled": "2015-09-28T04:42:55.772+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}