{"organizations": [], "uuid": "fddef39b05ce2cd8c9e030d28d0b9da84fa08779", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obama2_092715getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/ballot-box/presidential-races/255101-obama-marriage-equality-probably-wont-be-2016-issue", "country": "", "title": "Obama: Marriage equality probably won’t be 2016 issue | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama: Marriage equality probably won’t be 2016 issue | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-28T07:12:00.000+03:00", "replies_count": 0, "uuid": "fddef39b05ce2cd8c9e030d28d0b9da84fa08779"}, "author": "", "url": "http://thehill.com/blogs/ballot-box/presidential-races/255101-obama-marriage-equality-probably-wont-be-2016-issue", "ord_in_thread": 0, "title": "Obama: Marriage equality probably won’t be 2016 issue | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 27, 2015, 07:51 pm Obama: Marriage equality probably won’t be 2016 issue Getty Images \nPresident Obama late Sunday predicted marriage equality probably won’t be an issue in the 2016 presidential race, saying the U.S. has “come too far” since the 2004 campaign. ADVERTISEMENT \"Tonight we live in an America where 'Don't Ask Don't Tell' is something that 'don't exist,' \" he said to cheers and applause at the beginning of his remarks to a Democratic National Committee LGBT gala in New York, according to a reporter traveling with the president.\nThe president told the audience that cynics who said change is “too messy” have been proven wrong time after time. \nObama also said that 2016 Republican presidential candidates probably won’t use marriage equality as a wedge issue. \n\"Now, look, for some Americans, there’s no doubt that this change has been a whirlwind. And we believe that these changes have been for the better,\" he said, adding that there are \"still parts of the country that are getting there, but it's going to take some time.\" \nObama also said that religious freedom should be cherished. \n“But we also have to say clearly that our religious freedom doesn’t grant us the freedom to deny our fellow Americans their constitutional rights,” he added. \n“We've got to keep striving every day to treat each other the way I believe God sees us, as equal in His eyes,” Obama said. \nObama called on the crowd to stand up to bigotry and stand up for freedom -- “not just our own freedom, but for everybody’s freedom.” \n“We speak up to condemn hatred against anybody -- gay or straight, black or white, Christian, Muslim, Jew, non-believer, immigrant -- because we remember what silence felt like when hatred was directed at us, and we've got to be champions on behalf of justice for everybody, not just our own,” he said. \nObama also listed some of his accomplishments in his remarks, pointing to the 5.1 percent unemployment rate and his signature healthcare reform legislation. \n\"We were told ObamaCare would kill jobs, explode the deficit, destroy freedom. Today we see 66 consecutive months of private sector job growth, a streak that happened to begin when I signed ObamaCare into law,\" he said. \nHe also said the administration has made \"Incredible progress when it comes to climate change.\" \nObama on Monday will speak to the United Nations General Assembly, where he is expected to make the case that nations succeed when they work cooperatively. ", "external_links": [], "published": "2015-09-28T07:12:00.000+03:00", "crawled": "2015-09-28T07:11:27.272+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}