{"organizations": [], "uuid": "ccffa5f5a5dcaf8b39619b14bcba999d2b3543f2", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/29764/feed", "section_title": "The Hill: Cybersecurity", "url": "http://thehill.com/policy/cybersecurity/overnights/254137-overnight-cybersecurity-gop-lawmakers-press-obama-to-sanction-china-for", "country": "US", "title": "Overnight Cybersecurity: Republicans press Obama to sanction China", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Cybersecurity: Republicans press Obama to sanction China", "spam_score": 0.0, "site_type": "blogs", "published": "2015-09-18T02:25:00.000+03:00", "replies_count": 0, "uuid": "ccffa5f5a5dcaf8b39619b14bcba999d2b3543f2"}, "author": "cbennett@thehill.com (Cory Bennett and Katie Bo Williams)", "url": "http://thehill.com/policy/cybersecurity/overnights/254137-overnight-cybersecurity-gop-lawmakers-press-obama-to-sanction-china-for", "ord_in_thread": 0, "title": "Overnight Cybersecurity: Republicans press Obama to sanction China", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Cybersecurity: Republicans press Obama to sanction China By Cory Bennett and Katie Bo Williams - 09/17/15 07:25 PM EDT \nWelcome to OVERNIGHT CYBERSECURITY, your daily rundown of the biggest news in the world of hacking and data privacy. We're here to connect the dots as leaders in government, policy and industry try to counter the rise in cyber threats. What lies ahead for Congress, the administration and the latest company under siege? Whether you're a consumer, a techie or a D.C. lifer, we're here to give you ... \nTHE BIG STORIES: \n--JUST DO IT ALREADY: On Friday, Reps. Joe Wilson (R-S.C.) and Randy Forbes (R-Va.) will introduce a resolution urging President Obama to levy economic sanctions against Chinese businesses and state-backed entities that hack U.S. interests. The White House, under increasing pressure from lawmakers to penalize Beijing for cyber espionage, on Wednesday hinted that sanctions may be coming down the pike -- although unnamed White House officials have said such penalties won't happen until after Chinese President Xi Jinping's official state visit next week. Forbes and Wilson's resolution would put Congressional opinion on record when it comes to sanctioning China, but would not force any action by the White House. \"The world must see that attacking American families, whether through conventional methods or emerging tactics, such as cyberattacks, should be exposed,\" Wilson said in a statement to The Hill. \"It is clear that there are Chinese businesses and state-owned enterprises that can be linked to cyberattacks against United States. I'm introducing a resolution tomorrow to urge the President to apply economic sanctions to send a clear message -- this is dangerous to American families.\" To read our full piece, click here . \n--WE GOT A DEAL?: A senior Chinese official insisted Thursday that Beijing is willing to work with the U.S. on boosting Internet security, but will protect its own interests in the process. Ahead of next week's state visit from Chinese President Xi Jinping, Beijing and Washington have been sparring over allegations that the Chinese government is behind a massive campaign to pilfer American intellectual property. President Obama has strongly hinted economic sanctions are looming, although the two sides have apparently reached some type of detente until at least after Xi's visit. To read our full piece, click here . \n--HOUSE RULES: China is also tangling with U.S. tech firms ahead of Xi's trip stateside. Beijing officials are pressing major firms to sign a pledge that could require them to give access to user data and intellectual property. The document , distributed this summer, asks companies to promise they will store Chinese user data within the country. It also asks companies to pledge that their products are \"secure and controllable,\" a highly contentious phrase that critics say will give Beijing officials guaranteed access to encrypted data or even source code. The pledge could come up during next week's meeting in Seattle between Chinese officials and tech heavyweights like Apple, Facebook, IBM, Google and Uber. To read our full piece, click here . \n\nUPDATE ON CYBER POLICY: \n--The House Judiciary Committee approved a bill Wednesday that would give European citizens the right to sue in U.S. courts over misuse of their personal data. \nThe measure, known as the Judicial Redress Act, is seen as central to helping mollify European allies angered by the revelation of widespread U.S. surveillance programs. The bill is also the lynchpin in a recently signed deal between the U.S. and European Union that would allow law enforcement agencies on both sides to swap more data. \nThe offering from Reps. John Conyers (Mich.), the panel's top Democrat, and Jim Sensenbrenner (R-Wis.), is relatively non-controversial. It was approved by voice vote without amendments.", "external_links": [], "published": "2015-09-18T02:25:00.000+03:00", "crawled": "2015-09-18T07:39:49.853+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}