{"organizations": [], "uuid": "39959abc8cd4b70ae955e04cb6419317ad7cfca2", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/11107095w.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/09/17/cuban-envoy-us-presents-diplomatic-credential-ambassador-obama/", "country": "IL", "title": "Cuban envoy to U.S. presents diplomatic credentials to be ambassador to Obama", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Cuban envoy to U.S. presents diplomatic credentials to be ambassador to Obama", "spam_score": 0.0, "site_type": "discussions", "published": "2015-09-19T01:08:00.000+03:00", "replies_count": 0, "uuid": "39959abc8cd4b70ae955e04cb6419317ad7cfca2"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/17/cuban-envoy-us-presents-diplomatic-credential-ambassador-obama/", "ord_in_thread": 0, "title": "Cuban envoy to U.S. presents diplomatic credentials to be ambassador to Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cuban envoy to U.S. presents diplomatic credentials to be ambassador to Obama   EFE \nThe chargé d'affaires at the Cuban Embassy in the United States, José Cabañas, on Thursday presented his diplomatic credentials as ambassador to U.S. President Barack Obama in a new step toward the normalization of diplomatic relations. \nObama received the credentials of Cabañas and Mexico's new ambassador to the United States, Miguel Basañez, along with those of 14 other chiefs of mission in Washington, D.C., according to a White House statement. \nThe new Cuban ambassador has been the head of the Cuban Interests Section in Washington since late 2012, and, on July 20, with the normalization of diplomatic relations between the two nations, he became the chargé d'affaires at the embassy. \nCabañas becomes the first Cuban ambassador in Washington since Ernesto Dihigo López de Trigo was withdrawn in November 1959, less than two years before relations were official ruptured in 1961. \n\"The accreditation of the Cuban ambassador to the United States is another step in the process toward the normalization of relations between the two countries,\" the Cuban Embassy said in a statement. \nDuring the event in the Oval Office, Obama and Cabañas exchanged a few words \"about the state of bilateral relations,\" according to the embassy. \nThe U.S. does not yet have an ambassador posted to its embassy in Havana, where the former chief of the U.S. Interests Section, Jeffrey DeLaurentis, has been chargé d'affaires since July 20. \nObama has not nominated an ambassador to Cuba yet, although it is rumored that he is evaluating several candidates for the post. \nSeveral Republican lawmakers have promised to block the possible nomination of an ambassador to Cuba as a demonstration of their opposition to the normalizing relations. \nThe U.S. president accepted the credentials of Basañez, who replaced Eduardo Medina Mora, after the latter resigned his post to become a Mexican Supreme Court justice. \nIn addition, Obama received the new ambassadors from Belize, Jamaica, Antigua and Barbuda, Denmark, the Netherlands, Lithuania, Somalia, Afghanistan, Kosovo, Tanzania, Romania, Finland, Egypt and the Democratic Republic of the Congo. \nLike us on Facebook", "external_links": [], "published": "2015-09-19T01:08:00.000+03:00", "crawled": "2015-09-18T18:41:10.249+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}