{"organizations": [], "uuid": "8c4ddd525d7b1a0eccde9db13f4935dc942a4269", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Pope%20Congress%20Speech.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/09/24/pope-treads-carefully-into-immigration-debate-during-historic-speech-to/", "country": "IL", "title": "Pope treads carefully into immigration debate during historic speech to Congress", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Pope treads carefully into immigration debate during historic speech to Congress | Fox News Latino", "spam_score": 0.0, "site_type": "discussions", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "8c4ddd525d7b1a0eccde9db13f4935dc942a4269"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2015/09/24/pope-treads-carefully-into-immigration-debate-during-historic-speech-to/", "ord_in_thread": 0, "title": "Pope treads carefully into immigration debate during historic speech to Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino WASHINGTON, DC - SEPTEMBER 24: Pope Francis (C) addresses a joint meeting of the U.S. Congress with with Vice President Joe Biden (L) and Speaker of the House John Boehner (R-OH) in the House Chamber of the U.S. Capitol on September 24, 2015 in Washington, DC. Pope Francis is the first pope to address a joint meeting of Congress and will finish his tour of Washington later today before traveling to New York City. (Photo by Mark Wilson/Getty Images) 2015 Getty Images \nIn a historic speech before Congress, Pope Francis carefully treaded the controversial issue of immigration – urging U.S. leaders to “open their hearts” to immigrants though he did not, as some wished, forcefully demand a resolution.\nPope Francis made a plea to Americans not to turn their back on our “neighbors,” but instead “constantly relate to each other.”\n“In recent centuries, millions of people came to this land to pursue their dream of building a future in freedom,” said Francis, who spoke passionately but slowly and haltingly.  “We, the people of this continent, are not fearful of foreigners, because most of us were once foreigners.”\nHe spoke about immigrants almost as soon as he arrived in the U.S. on Wednesday – saying:  “As a child of immigrants. I am happy to be a guest in this country, which was largely built by such families.” Before Congress, his thoughts on immigration came 10 minutes into his speech.\nFrancis’ words in immigration seemed to affect some lawmakers emotionally, with Republican presidential candidate and Florida Sen. Marco Rubio tearing up during the speech.\nWhile the son of Italian immigrants to Argentina appeared to be saving his thoughts about the issue of immigration in the U.S. for his speech on Saturday at Philadelphia’s Independence Hall, Francis did quote the Gospel of Matthew and asked lawmakers – and thousands of people watching across the country – to have an open mind when dealing with immigrants living in the U.S.\nHe mentioned Martin Luther King before speaking about immigrants, saying that the civil rights leader’s movement led “to action, to participation, to commitment.”\nThen he cautiously said that immigrants have not always been respected in the past, and he warned lawmakers not to make the same mistakes others had.\n“…When the stranger in our midst appeals to us, we must not repeat the sins and the errors of the past.  We must resolve now to live as nobly and as justly as possible, as we educate new generations not to turn their back on our “neighbors” and everything around us,” he said. “Building a nation calls us to recognize that we must constantly relate to others, rejecting a mindset of hostility in order to adopt one of reciprocal subsidiarity, in a constant effort to do our best.  I am confident that we can do this.\nThe Argentine-born pope’s speech was in English, a language he had to practice recently and one he does not feel comfortable speaking. He tends to not go off script when he speaks in English.\n“On this continent, too, thousands of persons are led to travel north in search of a better life for themselves and for their loved ones, in search of greater opportunities,” he said. “Is this not what we want for our own children?  We must not be taken aback by their numbers, but rather view them as persons, seeing their faces and listening to their stories, trying to respond as best we can to their situation.”\nHe did not condemn lawmakers but instead largely kept his speech positive.\n“Let us treat others with the same passion and compassion with which we want to be treated.  Let us seek for others the same possibilities which we seek for ourselves,” he said.\nFrancis has made migration the top priority of his pontificate. His first trip outside Rome as pope was to the Sicilian island of Lampedusa, Ground Zero of Europe's migration crisis where some 365 migrants drowned within view of shore in October 2013. He has decried the \"inhuman\" conditions facing migrants crossing the U.S.-Mexico border and encouraged frontier communities to not judge people by stereotypes but rather welcome migrants and work to end discrimination.\nRecently, he called on all parishes and religious orders around the world to take in refugee families, and matched his call by hosting two such families in the Vatican. On his way to the airport last Saturday, he called on the Syrian family of four who had recently taken up residence in a Vatican flat. The experience was humbling, he said later: \"You could see the pain in their faces.\"\nThe wide-ranging speech addressed issues from global security and the Syrian refugee crisis to the mistreatment of Native Americans and the importance of family values, the leader of the Roman Catholic Church walked a line between praising American democracy while also calling on Washington’s leaders to be more compassionate on certain matters. Francis compared the work of lawmakers in Congress to that the Biblical figure Moses, by saying that it was their job to keep alive both the laws of the nation and of god.\n“Your own responsibility as members of Congress is to enable this country, by your legislative activity, to grow as a nation,” Francis said. “A political society endures when it seeks, as a vocation, to satisfy common needs by stimulating the growth of all its members, especially those in situations of greater vulnerability or risk. Legislative activity is always based on care for the people.  To this you have been invited, called and convened by those who elected you.”\nIn regards to the rise of groups like the Islamic State, the pontiff called for a \"delicate balance\" in fighting religious extremism to ensure that fundamental freedoms aren't trampled at the same time.\nHe says in his speech to Congress that \"no religion is immune from forms of individual delusion or ideological extremism.\"\nHe said religious, intellectual and individual freedoms must be safeguarded, while combatting violence perpetrated in the name of religion.\nThe pope cautioned against simplistically breaking the world into camps of good and evil.\nFrancis has expressed deep concern about the slaughter of Christians and other religious minorities in the Middle East at the hands of Islamic extremists, fearing that the Christian presence in the region is risk. He's dispatched envoys to Iraq with money and other forms of assistance to help refugees.\nOn domestic issues, the pontiff called for an end to the death penalty in the U.S. and across the world.\nFrancis said that every life is sacred and society can only benefit from rehabilitating those convicted of crimes.\nThe pope noted that U.S. bishops have renewed their call to abolish capital punishment. That idea is unpopular, however, with many American politicians.\nThe pontiff did not specifically mention abortion — a particularly contentious issue in Congress at the moment that threatens to force the shutdown of the U.S. government next week.\nStill, his remarks referred to the Catholic church's opposition to abortion. He urged lawmakers and all Americans to \"protect and defend human life at every stage of its development.\"\n\"A delicate balance is required to combat violence perpetrated in the name of a religion, an ideology or an economic system, while also safeguarding religious freedom, intellectual freedom and individual freedoms,\" Francis said.\nFrancis enjoys approval ratings the envy of any U.S. politician as he's remade the image of the Catholic Church toward openness and compassion, yet without changing fundamental church doctrine.\nAddressing a chamber full of elected officials Thursday, he may be the most adept politician in the room.\nAfter speaking in the House chamber Francis was to stop by the Capitol's Statuary Hall and its statue of Father Serra, the 18th-century missionary whom Francis elevated to sainthood Wednesday in the first canonization on U.S. soil.\nLater, he planned to stop at St. Patrick's Catholic Church and the Catholic Charities of the Archdiocese of Washington, before leaving for New York for more prayer services and a speech to the United Nations.\n \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-24T18:47:20.072+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}