{"organizations": ["Volkswagen", "Fox News Facebook", "United Auto Workers", "Twitter"], "uuid": "e210a290472d677ff5fa633e0f2c26a14a31ab54", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/NLRB.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/17/obama-nlrb-pushes-pro-labor-agenda-as-administration-winds-down/", "country": "", "title": "Obama NLRB pushes pro-labor agenda as administration winds down | Fox News", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama NLRB pushes pro-labor agenda as administration winds down | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T06:53:00.000+03:00", "replies_count": 0, "uuid": "e210a290472d677ff5fa633e0f2c26a14a31ab54"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/17/obama-nlrb-pushes-pro-labor-agenda-as-administration-winds-down/", "ord_in_thread": 0, "title": "Obama NLRB pushes pro-labor agenda as administration winds down | Fox News", "locations": ["Tenn.", "Chattanooga"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print Employees at the Volkswagen plant in Chattanooga, Tenn., recently voted against union representation from United Auto Workers. (Reuters/Billy Weeks) \nThe Democrat-leaning National Labor Relations Board is pushing a pro-union agenda with a flurry of rulings ahead of the 2016 elections and a possible swing to the right, say critics. \nIn recent months, the board charged with conducting union elections and enforcing fair labor practices has ruled that companies must hand employee contact information over to organizers, allow workers to use company e-mail systems for union business and compressed the amount of time between initial efforts and votes on representation. It has also ruled that existing unions can organize their employers' subcontractors. \n“They [NLRB] have been active in recent months,” said Trey Kovacs, a labor policy expert with the Competitive Enterprise Institute. “And the unions have been organizing much quicker than they ever have before. It gives employees less time to make an informed decision and gives them no opportunity to opt out.” \nThe five-member board includes three Democrats, one Republican and one vacancy. Terms end on a staggered basis, with openings coming in each of the next two years. Appointments have been so contentious that only two slots were filled for much of President Obama's first term. After that, confirmation battles in the Republican-controlled Senate and a failed attempt by Obama to make recess appointments have left the board with a tenuous Democrat majority. \nBut while the seemingly pro-union rulings from the board have given Big Labor a boost, the trend among states is toward right-to-work, where employees of a unionized company do not have to join. The result has been a labor-management stalemate, with a continuing and gradual decline in overall union membership. \nRule changes the NLRB has recently enacted, including those allowing for \"quick-snap\" elections that can take place within days of a petition being submitted, and the mandate that companies hand over employees’ personal contact information – names, home addresses, email addresses -- have angered anti-union activists. \n“Giving this information out is an open invitation for union organizers to bully, harass, and intimidate employees until they agree to support unionization,” Will Collins of the National Right to Work Foundation said. \nCollins also says that the NLRB has generally made it very difficult for employees to get rid of an unwanted union once it takes root. One recent example occurred this past April, when the United Auto Workers refused to relinquish power at an NTN-Bower ball-bearing plant in Alabama. Employees had to vote five times to get rid of the UAW because the union kept taking advantage of the NLRB’s election rules to keep from getting ousted, he said. \n“The NLRB has created aggressive procedures to speed up certification elections and help unions get into power, but ignores blocking charges and election bars that hinder or completely deny employees’ ability to decertify the union,” Glenn Taubman, an NRTW attorney said during his recent testimony before congress regarding these procedures. \nUnion membership among employed workers in the U.S. has been on a steady decline since the 1950s, when more than a quarter of the workforce was unionized. As of 2010, just over 12 percent of American workers were in a union. \nLast month, the NLRB issued a new ruling that has large implications for employment arrangements that broaden the definition of employer. In what has become known as the “Browning-Ferris” ruling , theboard held that unions can organize all employees at a facility even if it employs workers from different companies. The case involved hundreds of sorters and other workers at a landfill and recycling center in Milpitas, Calif. by outsourcing firm Leadpoint. Only 60 employees were under a union contact with the facility's operator and owner Republic, but the ruling allowed the local union to organize all workers, including those outsourced—despite Republic officials maintaining that they had no authority over workers from Leadpoint. \nCollins points out that the NLRB has also spent the past two years trying to implement biased notice posting rules that would have required businesses to post information with emphasis on employees’ rights to join or organize a union while downplaying their rights to refrain from union membership and opt out of paying dues for union politics. \n“Although these rules were eventually struck down in court, the fact that they were promulgated in the first place points to the NLRB’s pro-organizing agenda,” Collins said. \nOfficials for the NLRB did not immediately return requests for comment. \nAnd it seems as if the state politicians on the left are helping to bolster the NLRB’s efforts. \nAs recently as Wednesday, lawmakers in Missouri voted not to override Gov. Jay Nixon’s June veto of right-to-work legislation, which the Democrat governor called “a threat to unionized workers and wages.” The bill would have made Missouri the 26th state to enact the legislation. \nKovacs maintains that if Missouri were granted right-to-work status, employee income and the state economy would have benefited greatly, adding that from 1977 to 2012, Missouri’s estimated per capita income loss linked to not having RTW laws was $3,040, altogether making the total of estimated income loss in the state over $18.3 billion. \n“In failing to override the governor’s veto, Missouri lawmakers lost a chance to make history and dealt a devastating blow to worker freedom in favor of special interests and Big Labor,” Kovacs told FoxNews.com. \nPerry Chiaramonte is a reporter for FoxNews.com. Follow him on Twitter at @perrych Advertisement ", "external_links": [], "published": "2015-09-18T06:53:00.000+03:00", "crawled": "2015-09-18T06:53:33.449+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}