{"organizations": ["Fox News", "Iran By Sen. David Perdue Facebook", "Twitter"], "uuid": "2455d7869efa5a03ef5d199946457f33eafad226", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/2015/09/09/0/0/090915_kelly_iran_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/09/10/cannot-trust-tehran.html", "country": "", "title": "President Obama, we cannot trust Iran | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "President Obama, we cannot trust Iran | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "2455d7869efa5a03ef5d199946457f33eafad226"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/09/10/cannot-trust-tehran.html", "ord_in_thread": 0, "title": "President Obama, we cannot trust Iran | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "President Obama, we cannot trust Iran By Sen. David Perdue Facebook 0 Twitter 0 livefyre Email Print \nLast week, President Obama sent Secretary Kerry to assure Americans that his Iran nuclear deal is a good one. Kerry went so far as to say, “The Iran agreement is based on proof, not trust. \nMr. President, this deal is clearly based on trust, not proof. And we have no reason to trust Tehran. \nAs a member of the Senate Foreign Relations Committee, I’ve read every line of this 159-page agreement multiple times. I have heard from dozens of officials and outside experts, including the Director of the International Atomic Energy Agency (IAEA). There are a myriad of reasons to reject the Obama Administration’s deal with Iran, but one that stands out is the deeply flawed verification system. \nIran can deny international inspectors access to their nuclear and military sites. Without 24/7 'anytime, anywhere' access, international inspectors will have a hard time detecting new or existing covert facilities. In a nation twice the size of Texas, we cannot discount the possibility that Iran is hiding aspects of their nuclear program. In fact, should inspectors find a suspicious facility, this deal lays out a cumbersome process to gain access and investigate. \nFirst, Iran can delay inspectors for 24 days before the IAEA can visit a suspicious site. Then, a majority of members of the newly established “Joint Commission” (comprised of the P5+1 nations, Iran, and EU) must approve the IAEA’s request. What’s even more astounding, as part of this Joint Commission, Iran receives a vote equal to that of the United States. And at Iran’s bequest, no American inspectors will be allowed on the ground. \nSupporters claim Iran cannot cover up traces of nuclear material, whether the delay is 24 days or 24 months. Given Iran’s history of evading the IAEA, this assumption is again based on sorely misplaced trust. \nWe know Iran has gone so far as to destroy buildings and cart away the rubble, as they did with the Lavizan-Shian facility in 2003. With Iran’s current breakout period estimated at two to three months, absolutely no delays should be acceptable for‎ any inspections. Disturbingly, the deal is also silent on how to address IAEA inspectors being turned away from a suspected site after gaining approval from the Joint Commission. \nAccording to the agreement, the only ‎way to punish Iran's cheating or noncompliance is with snapback sanctions. Yet, paragraph 37 allows Iran to walk away should it be punished with such sanctions. It’s hard to enforce rules without real punishments. \nAdditionally, there are at least two secret side deals currently being negotiated between Iran and the IAEA. \nOne secret side deal covers accounting for past military dimensions (PMD). In order to understand how close Iran is to obtaining a nuclear weapons capability today, we must know more about these past nuclear activities. As William Tobey, a former senior nuclear official, testified in June, “Sacrificing knowledge of past and possibly present actions for a future agreement would signal to Tehran at the outset that verification and compliance will not be serious priorities.” \nWhen asked in April if the U.S. would let Iran keep past military dimensions secret, Secretary Kerry said, “No. They have to do it. If there’s going to be a deal, it will be done.\" Three months later, he went back on his word and accepted a deal that lets Iran keep previous nuclear activities classified. \nThe second secret side deal allows Iran to self-inspect the Parchin military base, where it is believed nuclear weapons research has previously taken place. In fact, Iran will use their own equipment and personnel to provide video surveillance, samples, and photos to the IAEA. By doing so, Iran’s Supreme Leader Ayatollah Khamenei can keep Iran’s military sites, like Parchin, off limits to the United States and the entire world. \nWhat makes President Obama and Secretary Kerry so confident they can catch Iran red-handed and hold them accountable? Most recently, Iranian Defense Minister Brigadier General Hossein Dehgan reportedly said, “Iran does not plan to issue permission for the [International Atomic Energy Agency] to inspect every site.” \nMr. President, we cannot trust Tehran. We cannot trust a Supreme Leader who will not change his anti-American policy and most recently vowed to eliminate Israel within 25 years. We cannot trust a country that supports the murderous Assad regime in Syria. Above all, we cannot trust Iran’s military leaders who have the blood of American soldiers on their hands. \nAn agreement of such immense global consequence should not be based on trust. It must be based on facts. Clearly, the facts are not in America’s favor. ", "external_links": [], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T13:14:55.209+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}