{"organizations": [], "uuid": "efa16445396f6a9f04cd1d41158a84cfd92043af", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_091015getty_0.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/homenews/administration/254770-obama-i-should-have-acted-sooner-on-climate-change", "country": "", "title": "Obama: I should have acted sooner on climate change | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama: I should have acted sooner on climate change | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T18:16:00.000+03:00", "replies_count": 0, "uuid": "efa16445396f6a9f04cd1d41158a84cfd92043af"}, "author": "", "url": "http://thehill.com/homenews/administration/254770-obama-i-should-have-acted-sooner-on-climate-change", "ord_in_thread": 0, "title": "Obama: I should have acted sooner on climate change | TheHill", "locations": ["Jordan Fabian"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama: I should have acted sooner on climate change Getty Images By Jordan Fabian - 09/24/15 10:18 AM EDT \nPresident Obama says he should have \"moved faster to a nonlegislative strategy\" to address climate change after Congress killed cap-and-trade legislation in 2009. \nIn an interview with Rolling Stone , Obama criticized \"folks like John McCain,\" who he said once backed cap-and-trade proposals but reversed their position and undermined congressional efforts. ADVERTISEMENT “I think the biggest problem we had was folks like John McCain, who had come out in favor of a cap-and-trade system, getting caught up in a feverish opposition to anything I proposed and reversing themselves — which meant that getting the numbers that we needed was going to be too difficult,” the president said in the interview published Wednesday.\nThat opposition led Obama to enact a slew of controversial regulations to curb greenhouse gas emissions. \nThe interview was conducted in early September during Obama’s trip to Alaska, which was intended to highlight the effects of global warming. \nIt was published on the same day Pope Francis visited Obama at the White House, where he praised the president for taking steps to address climate change. \nThe collapse of the cap-and-trade bill, which would have taxed companies for carbon pollution as an incentive to cut emissions, was one of the biggest legislative failures of Obama’s presidency. \nThe 2009 cap-and-trade bill passed the House but was never brought to the floor in the Senate, were it ran into opposition from Republicans and some centrist Democrats, who argued it would hurt energy producers. \nEnvironmental groups criticized Obama during his first term for not acting quickly enough on climate change. But Obama defended his push to court Republicans to back the cap-and-trade bill, saying their votes were necessary to pass the legislation. \n“We hadn't built enough of the consensus that was required to get that done,” he said. \nWith just 16 months left in his presidency, Obama is making a major push to take climate action and add to his presidential legacy. \nHe has enacted a raft of new rules and regulations, including the Environmental Protection Agency’s first ever limits on carbon emissions from power plants. His administration is also seeking a global agreement to curb emissions at a conference in Paris later this year. \nObama said the conference would be a success if it leads to major industrial nations agreeing to “aggressive-enough targets” to lower carbon pollution. \nBut he said any agreement is likely to fall short of what “science requires” to avoid the most drastic consequences of climate change. \n“I’m less concerned about the precise number, because let's stipulate right now, whatever various country targets are, it's still going to fall short of what the science requires,” he said. “A percent here or a percent there coming from various countries is not going to be a deal-breaker.” \n“The key for Paris is just to make sure that everybody is locked in, saying, ‘We're going to do this,’” he added. “Once we get to that point, then we can turn the dials.\" Tags: ", "external_links": [], "published": "2015-09-24T18:16:00.000+03:00", "crawled": "2015-09-24T18:15:30.962+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}