{"organizations": ["San Francisco Public Defender", "Fox News Latino FILE", "Fox News Latino San Francisco", "San Francisco Sheriff's Department"], "uuid": "95f8b32922c95302262919f1ecf69a95e0176ea1", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/San%20Francisco%20Pier%20shooting%20lex.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/09/04/san-francisco-man-at-center-national-immigration-debate-will-face-murder-trial/", "country": "", "title": "San Francisco man at center of national immigration debate will stand trial, judge rules | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "San Francisco man at center of national immigration debate will stand trial, judge rules | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T23:00:00.000+03:00", "replies_count": 0, "uuid": "95f8b32922c95302262919f1ecf69a95e0176ea1"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/09/04/san-francisco-man-at-center-national-immigration-debate-will-face-murder-trial/", "ord_in_thread": 0, "title": "San Francisco man at center of national immigration debate will stand trial, judge rules | Fox News Latino", "locations": ["San Francisco"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kathryn Steinle", "Diana Garciaor", "Michael Macor/San Francisco Chronicle", "Jeff Adachi", "Juan Francisco Lopez-Sanchez"], "text": "San Francisco man at center of national immigration debate will stand trial, judge rules Published September 04, 2015 Fox News Latino FILE - In this July 7, 2015 file photo, Juan Francisco Lopez-Sanchez, right, is lead into the courtroom by San Francisco Public Defender Jeff Adachi, left, and Assistant District Attorney Diana Garciaor, center, for his arraignment at the Hall of Justice in San Francisco. The parents of Kathryn Steinle filed a wrongful death claim Tuesday, Sept. 1, 2015 alleging that the San Francisco Sheriff's Department is to blame for releasing an illegal immigrant from jail despite a federal \"detainer\" request to keep in custody for possible deportation proceedings. A claim is usually a precursor to a lawsuit. (Michael Macor/San Francisco Chronicle via AP, Pool, File) \nSAN FRANCISCO (AP) – A judge ruled Thursday that a man at the center of the national immigration debate will stand trial on a murder charge in the shooting of a young San Francisco woman. \nJudge Brendan Conroy said he heard enough evidence over a preliminary hearing to order the jury trial. \nJuan Francisco Lopez-Sanchez, 45, is charged with second-degree murder in the random shooting death of Kate Steinle, 32, on July 1. Steinle was shot in the back as she walked with her father along the waterfront. He faces life in prison if convicted. \nLopez-Sanchez acknowledged shooting Steinle but said the gun fired accidentally. Prosecutors disagree. \n\"He could have fired the gun anywhere, but he fired at Kate Steinle,\" prosecutor Diane Garcia said in court. \"He played his own version of Russian roulette.\" \nLopez-Sanchez' public defender Matt Gonzalez said his client never pulled the trigger. Instead, he says Lopez-Sanchez found the gun wrapped in a t-shirt and it accidentally went off in his hands as he picked up the bundle. \n\"This gun has no safety,\" Gonzalez said of the .40 caliber semiautomatic pistol reported stolen by a federal agent. Gonzalez said the gun is a common law enforcement weapon and that police have reported accidental discharges of the gun. \nThe shooting triggered a national debate over immigration after it was revealed that the Sheriff's Department had released Lopez-Sanchez despite a federal request to detain him for possible deportation. \nLopez-Sanchez was previously deported five times to his native Mexico. \nRepublican presidential front-runner Donald Trump has repeatedly mentioned the killing of Steinle as he calls for a border wall and mass deportations to curb illegal immigration. California Sen. Dianne Feinstein and presidential hopeful Hillary Clinton, both Democrats, said Lopez-Sanchez should have been detained. \nSan Francisco Sheriff Ross Mirkarimi said he was following city law when jailers released Lopez-Sanchez after a 20-year-old marijuana possession charge was dropped. The sheriff said his department requires federal officials to obtain a warrant or some other judicial notice in order for his jail to hold an inmate facing possible deportation. \nSan Francisco Mayor Ed Lee also criticized the sheriff, saying Mirkarimi should have notified immigration officials of Lopez-Sanchez's impending release. \nLopez-Sanchez has pleaded not guilty in the killing of Steinle. \nHer parents have said federal and local authorities contributed to the death through negligence and bureaucratic bungling. \nThe family alleges in legal claims that a Bureau of Land Management ranger left his loaded service weapon in a backpack in plain view in his car before the gun was stolen in June. The semi-automatic pistol was later used in the killing of Steinle. \nBLM spokeswoman Martha Maciel said the agency is cooperating with the investigation of the shooting but she declined further comment. \nThe Steinle family and their attorneys filed three separate legal claims seeking unspecified damages from the BLM, San Francisco Sheriff's Department and U.S. Department of Homeland Security. \nSuch claims must be filed before government agencies can be sued. \nLike us on Facebook ", "external_links": [], "published": "2015-09-04T23:00:00.000+03:00", "crawled": "2015-09-04T23:00:51.574+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}