{"organizations": [], "uuid": "897740688123715937996c733515fbeb1ce72577", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarackfrancispope_032714getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/253131-obama-to-personally-greet-pope-francis-on-arrival-in-us", "country": "US", "title": "Obama to personally greet Pope Francis on arrival in US", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to personally greet Pope Francis on arrival in US", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T00:15:00.000+03:00", "replies_count": 0, "uuid": "897740688123715937996c733515fbeb1ce72577"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/253131-obama-to-personally-greet-pope-francis-on-arrival-in-us", "ord_in_thread": 0, "title": "Obama to personally greet Pope Francis on arrival in US", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to personally greet Pope Francis on arrival in US Getty Images By Jordan Fabian - 09/09/15 05:15 PM EDT \nPresident Obama and first lady Michelle Obama will greet Pope Francis when he lands in the United States later this month. \nThe first couple will meet the pope at Joint Base Andrews on Sept. 22, White House spokesman Eric Schultz said Wednesday. Obama will also meet with the Pope in the Oval Office the next day. ADVERTISEMENT It's rare for the president to greet a foreign dignitary upon landing in the U.S., but Schultz noted that President George W. Bush met Pope Benedict XVI at the air base in 2008.\nPope Francis's historic U.S. visit is highly anticipated on both ends of Pennsylvania Ave. \nThe pontiff will meet with Speaker John Boehner (R-Ohio) before giving an address on the west front of the Capitol that is expected to be attended by thousands. \nObama and Francis are expected to speak about a range of issues, including the U.S. detente with Cuba, climate change, income inequality and the Syrian refugee crisis. Tags: Past: 1 day House GOP to postpone vote on Iran... House Republicans will now meet at 4 p.m. to discuss strategy. WATCH LIVE: Trump, Cruz rally... The GOP presidential rivals are headlining a rally at the Capitol. Trump calls on CNN to donate... He sent a letter to CNN president Jeff Zucker insisting that he share the... McConnell rejects Iran delay McConnell says delay idea won't work. GOP scores early win in ObamaCare... A federal district judge ruled that the House has standing to sue the... Trump: Iran deal makes us 'look... “We are led by very, very stupid people,” Trump said. Trump storms Capitol for Iran... Trump, Cruz and others will rally in a show of force against the Iran... Sanders to roll out criminal... Sanders called the current system \"broken.\" Palin slams Obama's anti-police '... \"The dehumanization of our movement is fully underway,” one activist... Pelosi: GOP ‘out to get’ Planned... \"How dare they be so disregarding of women's health issues,” she says. Protester disrupts Palin at Iran... “The president is playing you, Congress,” she told listeners on the... Climate change: Seven indisputable... President Obama last week visited Alaska to preach about the inevitable... Software pioneer McAfee files... McAfee reportedly would be “founding a new party yet to be announced.” Poll: South Carolina wants Graham... Seventy-eight percent of voters in his home state want the senator to drop... Juan Williams: #BlackLivesMatter... OPINION | The movement is fast becoming its own worst enemy. House GOP faces shutdown crisis Heritage Action claims at least 28 Republicans will demand end to Planned... Is Trump proving that the Latino... His Latino support numbers also deserve closer, less culturally myopic... Feds: Highway funding will last... The update could give lawmakers more room to pass a temporary road funding... CNN to stream GOP debate for free Fox News decided against a livestream when it hosted the first debate last... Biden road-tests 2016 message The vice president insists he has not made up his mind on a run.", "external_links": [], "published": "2015-09-10T00:15:00.000+03:00", "crawled": "2015-09-10T00:34:28.958+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}