{"organizations": ["Elise Foley Immigration & Politics"], "uuid": "34ba66c2c305e942a81c293aedfc2add8c8a35d6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e4bdd31400002e002e4886.jpeg?cache=oZbTkhn6YK", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/karl-rove-william-mckinley_55e4bae7e4b0c818f618d635", "country": "", "title": "Karl Rove Wants Obama To Be More Gracious To William McKinley", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Karl Rove Wants Obama To Be More Gracious To William McKinley", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T01:26:00.000+03:00", "replies_count": 0, "uuid": "34ba66c2c305e942a81c293aedfc2add8c8a35d6"}, "author": "", "url": "http://www.huffingtonpost.com/entry/karl-rove-william-mckinley_55e4bae7e4b0c818f618d635", "ord_in_thread": 0, "title": "Karl Rove Wants Obama To Be More Gracious To William McKinley", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tony Gutierrez/Associated Press Karl Rove", "William McKinley Karl", "Barack Obama", "William McKinley", "Obama"], "text": "Karl Rove Wants Obama To Be More Gracious To William McKinley Sorry, Rove. Obama would be a citizen with or without the 25th U.S. president. Elise Foley Immigration & Politics Reporter, The Huffington Post Posted: 08/31/2015 05:24 PM EDT Credit: Tony Gutierrez/Associated Press Karl Rove said former President William McKinley made it possible for President Barack Obama to lead the country. \nKarl Rove, the former adviser to then-President George W. Bush, told Time Magazine on Monday that President Barack Obama \"ought to be more gracious\" to 25th President William McKinley, \"the guy who made it possible for him to be president.\" \nThe comments to Time Magazine were regarding Obama's Sunday announcement that Alaska's Mount McKinley would be renamed Denali, which is what it is called in the state. Alaskans, including Republicans, applauded the move. Others, particularly Republicans from McKinley's home state of Ohio, condemned it. \nRove, who is writing a book about McKinley, was among the critics. \nBut his comment about McKinley paving the way for Obama included a little flub on citizenship laws. Time noted by way of explanation that the U.S. annexed Hawaii under McKinley's presidency. Obama was born in Hawaii, making him a U.S. citizen and eligible to be president. \nObama would have been a citizen with or without McKinley, though. His mother, Ann Dunham, was born in Kansas and, as a U.S. citizen, passed along her citizenship to Obama. There's some debate over whether Americans born as citizens off U.S. soil can be president, but the general consensus is they can -- luckily for the Canadian-born Sen. Ted Cruz (R-Texas), who is running for the GOP's 2016 presidential nomination. \nRove told Time Magazine that Obama should come up with another way to honor McKinley. \n\"I think that he would be well advised to sit down with the governor of Ohio and the Speaker of the House and the Senators from Ohio [McKinley’s home state], and see if he can’t arrive at a thoughtful way to honor this important figure in American history,\" Rove said. For more from The Huffington Post, download our app for iOS or Android . ", "external_links": [], "published": "2015-09-01T01:26:00.000+03:00", "crawled": "2015-09-01T01:25:55.559+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}