{"organizations": [], "uuid": "c69d5e81b6f0b4a26bd8d7323b81ecab8af5111a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_boehner_mcconnellsplit092815.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/news/255306-mcconnell-boehner-open-budget-talks-with-obama", "country": "US", "title": "McConnell, Boehner open budget talks with Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "McConnell, Boehner open budget talks with Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T21:37:00.000+03:00", "replies_count": 0, "uuid": "c69d5e81b6f0b4a26bd8d7323b81ecab8af5111a"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/news/255306-mcconnell-boehner-open-budget-talks-with-obama", "ord_in_thread": 0, "title": "McConnell, Boehner open budget talks with Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McConnell, Boehner open budget talks with Obama Getty By Alexander Bolton - 09/29/15 02:37 PM EDT \nSenate Majority Leader Mitch McConnell and Speaker John Boehner are opening budget negotiations with President Obama.McConnell (R-Ky.) told reporters Tuesday that he and Boehner (R-Ohio) spoke to Obama last week and expect to sit down more officially with the administration \"soon.\"GOP leaders want to strike a deal on the top-line budget numbers for fiscal years 2016 and 2017 so they can avoid a messy standoff and possible government shutdown during an election year. \nBoehner, who is resigning from Congress at the end of October, indicated Sunday that he’d like to make life a little easier for the next Speaker by clearing the decks of some difficult issues. \n“I don’t want to leave my successor a dirty barn. I want to clean the barn up a little bit before the next person gets there,” he said on CBS’s “Face the Nation.” \nBut whether Boehner and McConnell will be able to reach a deal with the administration that is acceptable to their members remains to be seen. \nDemocrats are demanding that budget caps be lifted for all government spending, while Republicans are pushing an increase solely for defense programs. \n- This story was last updated at 3:02 p.m. Republican gets into shouting... Rep. Jim Jordan sparred with Planned Parenthood President and CEO Cecile... GOP: Planned Parenthood wasted... Rep. Jason Chaffetz said the organization racked up “exorbitant travel... Post-White House, first lady wants... \"I want to go to Target. I want to drive,\" she said. Fiorina under attack from left on... Watchdog cites video showing Fiorina referring to court decision as the \"... McConnell, Boehner open budget... The two GOP leaders spoke to Obama last week. Dem accuses GOP of 'misogyny' at... Rep. Gerry Connolly blasted the \"disrespect\" shown to the group's... House approves six-month FAA... The agency's funding is set to expire on Wednesday. Boehner open to raising debt limit \"We’ll have to see,\" the Speaker says. Lewinsky launches anti-bullying... She's teaming up with celebs including Michael J. Fox and Olivia Wilde for... What bills can lame-duck Boehner... His resignation adds a dash of uncertainty to a scramble on a host of... Team Biden: VP's time is now Joe Biden’s close friends and advisers believe the stars are aligning. Paul slams spending bill The Kentucky Republican said Congress is a \"withering shadow.\" Trump predicts Paul will soon exit... Trump said he'd \"do a much better job\" for Rand Paul's supporters. House conservatives seek Planned... Rep. Jim Jordan says he is one of several Republicans who will cosponsor... ObamaCare repeal bill advances in... \"We’re going to repeal the five worst parts of the law,\" Rep. Paul Ryan...", "external_links": [], "published": "2015-09-29T21:37:00.000+03:00", "crawled": "2015-09-29T22:47:30.845+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}