{"organizations": [], "uuid": "71b6ab46e84bc5b9446d3bb9efb51531485a3e9a", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/09/04/saudi-king-tells-obama-supports-iranian-nuclear-pact/", "country": "IL", "title": "Saudi king tells Obama he supports Iranian nuclear pact", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Saudi king tells Obama he supports Iranian nuclear pact | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "71b6ab46e84bc5b9446d3bb9efb51531485a3e9a"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2015/09/04/saudi-king-tells-obama-supports-iranian-nuclear-pact/", "ord_in_thread": 0, "title": "Saudi king tells Obama he supports Iranian nuclear pact", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  EFE Saudi Arabian King Salman bin Abd alAziz Al Saud told U.S. President Barack Obama, at a meeting Friday in the White House, that he supports the nuclear accord reached with Iran.\n\"King Salman expressed his support for the Joint Comprehensive Plan of Action (JCPOA) between Iran and the P5 + 1 countries, which once fully implemented will prevent Iran from obtaining a nuclear weapon and thereby enhance security in the region,\" the two governments said in a joint statement.\nThe meeting of the two leaders took place just days after Obama was assured of sufficient support in Congress to guarantee that the pact with Iran will take effect, by having enough promised votes to veto any Republican attempt to block it.\nRiyadh had expressed a series of concerns about the accord between Iran and the six powers - the United States, Russia, China, Britain, France plus Germany - and the monarch's visit to Washington represents the first important move by the U.S. government to calm its key allies in the Persian Gulf, as the pact enters the next phase.\nSalman stayed away from the summit of Middle Eastern countries that the president previously organized at Camp David, an absence considered by many experts as a sign of the Saudi king's disagreement with the talks that were progressing at the time between Iran and the P5+1 nations.\nThe statement was issued by the two countries after their leaders addressed a series of matters of bilateral interest, including the conflicts in Yemen and Syria, and the antiterrorist fight against the Islamic State, or IS.\nIn that regard, they agreed to fast-track the supply of certain types of military equipment to the Saudi kingdom, as well as to heighten cooperation in the areas of antiterrorism, maritime security, cybersecurity and ballistic missile defense.\nThis is the first official visit to Washington of the 81-year-old Saudi monarch since he ascended to the throne after the death of his brother Abdala Ibn Abdelaziz in January, and the first meeting between the two leaders since Obama traveled to the Arab nation on that occasion. EFE", "external_links": [], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-05T04:15:01.129+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}