{"organizations": [], "uuid": "9280eebaccdd71231c9919c6612e205f2b513ee1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/5609bd221800002b00831297.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/putin-obama-syria-un_5609bc37e4b0af3706dd8d00", "country": "", "title": "Obama And Putin Share Icy Exchange During First Formal Meeting In Two Years", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama And Putin Share Icy Exchange During First Formal Meeting In Two Years", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T01:56:00.000+03:00", "replies_count": 0, "uuid": "9280eebaccdd71231c9919c6612e205f2b513ee1"}, "author": "", "url": "http://www.huffingtonpost.com/entry/putin-obama-syria-un_5609bc37e4b0af3706dd8d00", "ord_in_thread": 0, "title": "Obama And Putin Share Icy Exchange During First Formal Meeting In Two Years", "locations": ["Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Obama"], "text": "Email Obama And Putin Share Icy Exchange During First Formal Meeting In Two Years Obama and Putin's disparate views of the grim situation in Syria left little indication of how the two countries might work together to end a conflict. Posted: 09/28/2015 06:32 PM EDT | Edited: 8 minutes ago \nUNITED NATIONS (AP) -- With a stony-faced handshake, U.S. President Barack Obama and Russian President Vladimir Putin on Monday began their first formal meeting in more than two years, a discussion expected to lay bare their deep differences over the chaos in Syria. \nThe meeting came hours after the leaders outlined their contrasting visions for Syria's future in dueling speeches at the United Nations General Assembly summit. Obama urged a political transition to replace embattled Syrian President Bashar Assad, while Putin warned it would be a mistake to abandon the current government. \nObama and Putin were also expected to discuss the crisis in Ukraine during their evening meeting at U.N. headquarters. \nAhead of their talks, Obama said he was open to working with Russia, as well as Iran, to bring Syria's civil war to an end. He called for a \"managed transition\" that would result in the ouster of Assad, whose forces have clashed with rebels for more than four years, creating a vacuum for the Islamic State and other extremist groups. \n\"We must recognize that there cannot be, after so much bloodshed, so much carnage, a return to the prewar status quo,\" Obama said. \nPutin, however, urged the world to stick with Assad, arguing that his military is the only viable option for defeating the Islamic State. \n\"We believe it's a huge mistake to refuse to cooperate with the Syrian authorities, with the government forces, those who are bravely fighting terror face-to-face,\" Putin said during his first appearance at the U.N. gathering in a decade. \nObama and Putin's disparate views of the grim situation in Syria left little indication of how the two countries might work together to end a conflict that has killed more than 250,000 people and resulted in a flood of refugees. \nThe Syria crisis largely overshadowed the summit's other discussions on peacekeeping, climate change and global poverty. \nFrench President Francois Hollande backed Obama's call for Assad's ouster, saying \"nobody can imagine\" a political solution in Syria if he is still in power. Hollande called on countries with influence in Syria, including Gulf nations and Iran, to be engaged in a transition. \nHowever, Iran - which along with Russia is a strong backer of Assad - said the Syrian president must remain in power to fight extremists. Iranian President Hassan Rouhani said that while Syria's government needs reform, the country will fall to the Islamic States if the international community makes getting rid of Assad its top goal. \nDespite Obama's staunch opposition to Assad remaining in office, the U.S. has struggled to push him from power. Russia has long been a major obstacle, shielding Assad from U.N. sanctions and continuing to provide the Syrian government with weapons. \nIn fact, Russia has appeared to deepen its support for Assad in recent weeks, sending additional military equipment and troops with the justification that it is helping the government fight the Islamic State. The military buildup has confounded U.S. officials, who spent the summer hoping Russia's patience with Assad was waning and political negotiations could be started. \nObama and Putin each framed his case for Syria's future in the context of a broader approach to the world, launching veiled criticisms at each other. \nThe U.S. president condemned nations that believe \"might makes right,\" and sought instead to highlight the benefits of diplomacy. He touted his administration's efforts to restore ties with Cuba after a half-century freeze and the completion of a nuclear accord with Iran, noting that Russia was a key partner in negotiating the Iran deal. \nPutin, without naming the United States, accused Washington of trying to enforce its will on others and mulling a possible reform of the U.N., which he suggested stands in the way of the perceived U.S. domination. \n\"After the end of the Cold War, the single center of domination has emerged in the world,\" Putin said. \"Those who have found themselves on top of that pyramid were tempted to think that since they are so strong and singular, they know what to do better than others and it's unnecessary to pay any attention to the U.N. Chip Somodevilla via Getty Images \nObama and Putin briefly shook hands during a leaders' lunch that followed the morning of speeches. Seated at the same table, they clinked glasses during a toast, with Putin smiling and Obama grim-faced. \nObama and Putin have long had a strained relationship, with ties deteriorating to post-Cold War lows after Russia annexed Crimea from Ukraine and allegedly backed rebels in Ukraine's east. The U.S. has sought to punish Russia through economic sanctions. \nObama, in his address, said the world could not stand by while Ukraine's sovereignty was being violated. \n\"If that happens without consequences in Ukraine, it could happen to any nation gathered here today,\" Obama said. \n--- \nAP writer Darlene Superville contributed to this report. \n", "external_links": [], "published": "2015-09-29T01:56:00.000+03:00", "crawled": "2015-09-29T01:56:48.794+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}