{"organizations": ["Fox News", "Sonora Carruseles"], "uuid": "a4ef7071746441527c53a85d4f381816f0bfe1f8", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/entertainment/0/0/Colombia%20Salsa%20Band%20_Garc.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/entertainment/2015/08/19/little-known-colombian-salsa-band-lands-on-obama-curated-spotify-playlist/", "country": "", "title": "Little-known Colombian salsa band lands on Obama-curated Spotify playlist | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Little-known Colombian salsa band lands on Obama-curated Spotify playlist | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T20:00:00.000+03:00", "replies_count": 0, "uuid": "a4ef7071746441527c53a85d4f381816f0bfe1f8"}, "author": "", "url": "http://latino.foxnews.com/latino/entertainment/2015/08/19/little-known-colombian-salsa-band-lands-on-obama-curated-spotify-playlist/", "ord_in_thread": 0, "title": "Little-known Colombian salsa band lands on Obama-curated Spotify playlist | Fox News Latino", "locations": ["Fla", "Doral"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Leonardo Sierra", "Jans Certuche", "Barack Obama", "Daniel Marmolejo"], "text": "Little-known Colombian salsa band lands on Obama-curated Spotify playlist Published August 19, 2015 Fox News Latino This photo taken Monday, Aug. 17, 2015, members of the Colombian salsa band Sonora Carruseles, from left, Leonardo Sierra, Daniel Marmolejo, and Jans Certuche, right, sing one of their hits during an interview in Doral, Fla. It was a great surprise for the band that President Barack Obama included their song, \"La salsa la traigo yo,\" as one of his favorite songs for the summer. (AP Photo/Alan Diaz) \nMIAMI (AP) – The members of the little-known Colombian salsa band are clueless as to how an obscure song they recorded more than a decade ago landed on a Spotify playlist curated by President Barack Obama. \nThe track, \"La Salsa la Traigo Yo,\" (\"I Bring the Salsa\") by Sonora Carruseles, is one of 40 songs featured on two #POTUSPlaylists on the popular music streaming service. The lists also include music by Bob Dylan, Bob Marley, Coldplay, Frank Sinatra, Beyoncé, Justin Timberlake, Stevie Wonder, Aretha Franklin and Spanish singer Mala Rodríguez. \n\"For us, it's an honor that an influential person such as the U.S. president is enjoying and having fun in his free time with the Colombian salsa of Sonora Carruseles,\" band member Daniel Marmolejo said. \nBand members were surprised when they heard the news — so surprised, in fact, that they thought it was a joke, Marmolejo said. \nThe biggest surprise: The song was one the band had virtually forgotten. \n\"We haven't played this song in a long time, and we even removed it from our repertoire to squeeze in our new material,\" said Marmolejo, adding that it's back in rotation now. \nThe White House said it was unable to supply explanations for how individual songs got on the playlist, though aides stressed that Obama picked out the tunes himself and in general discovers music as most other people do — from friends, family, movies, musicians and elsewhere. \nFounded in Medellín, Colombia, in 1995, the 12-member Sonora Carruseles released its first album in 2001. In 2005, the band members moved to Miami to make touring easier. To date, they've released 14 albums. \nThe band hopes that being included on the playlist is its lucky break. \n\"Now everything has changed. In these few days, more people know about us, they want to know who we are, where we come from and to learn more about our music. For us, it is very important that Obama has put us on the map,\" said Leonardo Sierra, one of the band's members. \n\"Our country hardly knows about us and that saddens us,\" Marmolejo added. \"But I think that this is a great opportunity for us to cross cultural and musical boundaries.\" \nLike us on Facebook ", "external_links": [], "published": "2015-08-19T20:00:00.000+03:00", "crawled": "2015-08-19T20:00:43.114+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}