{"organizations": ["Rally Around Muslim", "Rally Around Muslim Teen Arrested For Homemade Clock"], "uuid": "25cd035df1cdb55cac29690245f8725c20fcdb7b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f990162000002500242478.jpeg?cache=couuncFDMW", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/ahmed-mohamed-supporters_55f9879be4b0d6492d63be95", "country": "", "title": "President Obama, Hillary Clinton Rally Around Muslim Teen Arrested For Homemade Clock", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "President Obama, Hillary Clinton Rally Around Muslim Teen Arrested For Homemade Clock", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T21:11:00.000+03:00", "replies_count": 0, "uuid": "25cd035df1cdb55cac29690245f8725c20fcdb7b"}, "author": "", "url": "http://www.huffingtonpost.com/entry/ahmed-mohamed-supporters_55f9879be4b0d6492d63be95", "ord_in_thread": 0, "title": "President Obama, Hillary Clinton Rally Around Muslim Teen Arrested For Homemade Clock", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Nick Visser", "Huffington", "Obama"], "text": "President Obama, Hillary Clinton Rally Around Muslim Teen Arrested For Homemade Clock \"Assumptions and fear don't keep us safe -- they hold us back.\" Nick Visser Reporter, The Huffington Post Posted: 09/16/2015 12:17 PM EDT | Edited: 19 minutes ago \nAhmed Mohamed, the 14-year-old high school student in Texas who was arrested Monday after he brought a homemade clock to school , has gained a whole lot of admirers since then -- including a former secretary of state, a rocket scientist and even President Barack Obama himself. \nOn Wednesday, Obama shouted out to the young inventor on Twitter, inviting him to stop by the White House with his \"cool clock.\" Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great. — President Obama (@POTUS) September 16, 2015 \nThe support didn't end there. Former Secretary of State Hillary Clinton weighed in on the incident -- in which critics say Islamophobia played a major role -- telling Mohamed to \"stay curious and keep building.\" And U.S. Secretary of Education Arne Duncan said on Twitter that we need to encourage young engineers, not arrest them and suspend them from school. Assumptions and fear don't keep us safe—they hold us back. Ahmed, stay curious and keep building. https://t.co/ywrlHUw3g1 — Hillary Clinton (@HillaryClinton) September 16, 2015 We need to be encouraging young engineers, not putting them in handcuffs. #IStandWithAhmed — Arne Duncan (@arneduncan) September 16, 2015 \nMohamed, a ninth-grader at MacArthur High School in Irving, Texas, made headlines this week after he built a digital clock into a pencil case -- complete with circuit boards, a power supply and everything else a digital clock usually entails -- and took it to school Monday to show his teachers. Later that day, Mohamed, who is Muslim, was brought to the principal's office and asked whether he'd tried to \"make a bomb.\" He was then arrested and led through the halls in handcuffs. The incident was originally reported by The Dallas Morning News . \nSince then, a lot of people -- including Bobak Ferdowsi, a systems engineer at NASA's Jet Propulsion Laboratory whose haircut became the toast of the Internet a few years ago -- have come out in full support of Mohamed's work. Hey Ahmed, give me a call in a couple years. We could always use smart, curious & creative people. https://t.co/02a4feMrk5 — Bobak Ferdowsi (@tweetsoutloud) September 16, 2015 \nOthers who voiced their support for the teenage tinkerer include Tumblr founder David Karp and former \"MythBusters\" cast member Grant Imahara. Don’t mess with STEM in Texas: http://t.co/w3r8OQhO0g #IStandWithAhmed — David Karp (@davidkarp) September 16, 2015 Absolutely tragic. When I was his age, I took everything apart too and tried to make things. http://t.co/73Y8XQwlqM #IStandWithAhmed — Grant Imahara (@grantimahara) September 16, 2015 \nA Twitter account possibly associated with Mohamed -- Anil Dash, a tech entrepreneur and writer, said this week that he'd spoken with the teen's family and that the handle was \" official \" -- thanked people for their support after the hashtag #IStandWithAhmed began trending nationwide. Thank you fellow supporters. We can ban together to stop this racial inequality and prevent this from happening again pic.twitter.com/fBlmckoafU ", "external_links": [], "published": "2015-09-16T21:11:00.000+03:00", "crawled": "2015-09-16T21:13:40.353+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}