{"organizations": ["Senate", "Congress", "White House", "House", "CNN", "Democratic", "GOP-controlled House"], "uuid": "271939642e2d5e47e7e8a833dafcccf4c932ed1a", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/02/politics/iran-nuclear-deal-votes-sustain-veto/index.html", "country": "", "title": "Obama secures votes to secure Iran nuclear deal - CNNPolitics.com", "performance_score": 10, "site": "cnn.com", "participants_count": 0, "title_full": "Obama secures votes to secure Iran nuclear deal - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T17:34:00.000+03:00", "replies_count": 0, "uuid": "271939642e2d5e47e7e8a833dafcccf4c932ed1a"}, "author": "", "url": "http://www.cnn.com/2015/09/02/politics/iran-nuclear-deal-votes-sustain-veto/index.html", "ord_in_thread": 0, "title": "Obama secures votes to secure Iran nuclear deal - CNNPolitics.com", "locations": ["France", "Iran", "New York", "U.S.", "Washington", "Russia", "New Jersey", "Maryland", "Germany", "U.K.", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barbara Mikulski", "Chuck Schumer", "Barack Obama", "Kerry", "Bob Menendez", "Coons", "Christiane Amanpour", "John Kerry", "Obama"], "text": "Sen. Coons declares support for Iran deal 05:06 Washington (CNN) In a major victory for President Barack Obama, Democratic Sen. Barbara Mikulski of Maryland announced support for the Iran nuclear deal Wednesday, providing the White House the votes it needs to prevent Republicans from scuttling the agreement. The announcement means that at least 34 senators -- the number required by the Constitution to sustain a veto -- will back Obama in vetoing a Republican resolution to disapprove of the deal. While majorities of both the GOP-controlled House and Senate are expected to vote against the agreement, supporters of the multinational accord that aims to curb Iran's nuclear weapons program are also hoping to get the 41 votes needed to filibuster the bill and prevent it from even getting to a final vote in the Senate. Secretary of State John Kerry said the administration will continue to try and push support for deal past the 34 votes they now have \"until the last moment.\" \"Thirty-four votes are obviously enough votes for the president's veto to be upheld,\" Kerry told CNN's Christiane Amanpour. \"That is not satisfactory for us. We do want to try to go further. We'll continue to persuade.\" That prospect upsets some Republicans who believe the historic agreement deserves a final up-or-down vote. Nearly all Republicans have come out against the agreement, arguing it sets up weak standards for international inspectors to monitor whether Iran is complying with the agreement and would allow Iran to build nuclear weapons in a few years. But only two Democratic senators -- Chuck Schumer of New York and Bob Menendez of New Jersey -- have announced they oppose it. The Senate's 54 Republicans would need four more Democrats to join them in opposing the deal to end the filibuster and send the bill for a vote. The agreement, which took years for the so-called P5+1 -- the U.S., U.K., France, Germany, China and Russia -- to broker, has been the subject of intensive lobbying by both sides. Ultimately, opponents' multimillion-dollar campaign failed to resonate with enough of the Democratic lawmakers it was targeting. Votes are expected after lawmakers return from a summer recess next week but before Sept. 17, the statutory deadline for Congress to act on the deal. But GOP leaders have not announced when those votes will take place. The administration only needs one chamber to sustain its veto in order for the Iran deal to go through. House Democratic leadership aides are confident that they also have enough votes in the House to uphold a veto. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> White House news ", "external_links": [], "published": "2015-09-02T17:34:00.000+03:00", "crawled": "2015-09-02T17:34:33.152+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}