{"organizations": [], "uuid": "550dfbd63f089c90c1bf0285d126c3b4653115a3", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/19/opinions/nowrasteh-trump-immigration-myths/index.html", "country": "", "title": "Donald Trump's immigration myths (Opinion) - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Donald Trump's immigration myths (Opinion) - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T16:04:00.000+03:00", "replies_count": 0, "uuid": "550dfbd63f089c90c1bf0285d126c3b4653115a3"}, "author": "", "url": "http://www.cnn.com/2015/08/19/opinions/nowrasteh-trump-immigration-myths/index.html", "ord_in_thread": 0, "title": "Donald Trump's immigration myths (Opinion) - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Donald Trump's immigration myths Updated 1301 GMT (2001 HKT) August 19, 2015 6 photos: Republican politicians head to the border Sen. Ted Cruz, left, with Texas Gov. Greg Abbott, addresses the ruling by a federal judge in Texas delaying President Obama's executive action on immigration on February 18. Months later, on June 6, the 2016 presidential hopeful would hold a fund-raiser along the U.S.-Mexico border in McAllen, Texas. Hide Caption 1 of 6 6 photos: Republican politicians head to the border Mexican politician Tomas Yarrington, from left, then-Texas Gov. Rick Perry and Nuevo Leon Gov. Fernando Canales Clariond join hands during the U.S. and Mexico Border Summit on August, 22, 2001, in Edinburg, Texas. Perry, who is currently running for the 2016 GOP presidential nomination, is headed to the Rio Grande Valley in June for a fund-raiser with area elected officials. Hide Caption 2 of 6 6 photos: Republican politicians head to the border Wisconsin Gov. Scott Walker, seen here at the 2015 National Rifle Association annual meeting in April 10, visited the Texas border region in March. When it comes to immigration, the likely 2016 presidential contender declined to say whether he would support a pathway to citizenship even after the border was secure. Hide Caption 3 of 6 6 photos: Republican politicians head to the border A border patrol agent inspects a tunnel near Nogales, Arizona. Tunnels like this are used to transport drugs under the U.S. border. Hide Caption 4 of 6 6 photos: Republican politicians head to the border Cars line up at the Customs and Border Protection inspection station at San Ysidro, California, one of the busiest land ports in the Western Hemisphere. The district is north of the U.S.-Mexico border and is often used by travelers between San Diego and Tijuana, Mexico. Hide Caption 5 of 6 6 photos: Republican politicians head to the border The line of demarcation of the U.S.-Mexico border at San Ysidro, California, is the dividing point between domestic rules of the road (Inland Navigation Rules) and the international rules of the road (Convention on the International Regulations for Preventing Collision at Sea). Hide Caption Donald Trump's campaign has released a policy paper on immigration Alex Nowrasteh: Trump's proposals are not serious policy work Alex Nowrasteh is the immigration policy analyst at the Cato Institute's Center for Global Liberty and Prosperity. The views expressed are his own. (CNN) Donald Trump's newly released immigration position paper is the precise mix of fantasy and ignorance that one would expect from the newly self-described Republican. Trump's policies would grind down economic growth, slow assimilation and ultimately fail to rein in unlawful immigration. Trump's proposal boils down to building a wall along the southern border and beefing up interior immigration enforcement to deport those who still make it through. Aside from the fact that this wrongheaded plan would backfire spectacularly, the real problem is that it is based on patently false beliefs about immigrants in general and on myths that don't stand up to scrutiny. Myth: More immigrants means more crime Alex Nowrasteh Remember Trump's now-infamous description of Mexican immigrants as \"criminals\" and \"rapists\"? The facts suggest something quite the contrary. Indeed, the academic literature on this question is pretty clear : Immigrants are less likely to commit crimes than native born citizens, and there is no credible evidence that they have any effect on overall crime rates. According to research by the American Immigration Council based on data from the Census Bureau, 1.6% immigrant men from 18 to 39 are incarcerated compared with 3.3% of native born men in the same age bracket. Other studies look at crime rates in cities and states that have different immigrant populations, finding that increases in the immigrant population coincide with big decreases in violent crime rates. Nevertheless, the myth of the immigrant-driven crime wave remains prevalent. Myth: Immigrants take Americans' jobs Economists generally dismiss this trope. Immigrant workers don't take American jobs or lower our wages. There is no fixed pie of American jobs or wages to be divided up amongst an expanding group of people. The labor market is not like a crowded skating rink where each new immigrant knocks out a native worker. Instead, each new immigrant makes the rink a little bigger, allowing more space for all of the skaters. Meanwhile, productivity drives increases in American wages. Since 1990, highly skilled immigrants are responsible for between 10% and 25% of productivity gains across 219 American cities. One report found that roughly 25% of all international patents filed from the United States had an immigrant inventor or co-inventor -- remarkable since immigrants are only about 13%of the population. In addition to boosting American productivity, immigrants are almost twice as likely to start businesses as native born Americans, according to the Kauffman Foundation. It also notes that from 2005 to 2012, 44% of technology and engineering startups in Silicon Valley had an immigrant founder or co-founder. Natives and immigrants may work in the same locations, but they tend to specialize in different jobs. Immigrants concentrate in professions that don't require great English skills. Native born Americans, responding to immigrants who aren't great communicators, specialize in jobs that value English more. This specialization actually boosts the wages of all native born Americans by about 1%. Myth: Immigrants are a drain on welfare The other big myth Trump has promulgated is that immigrants come here and just gobble up welfare benefits. But the reality is that immigrants consume much less welfare than native born Americans. If poor Americans consumed Medicaid at the same rate and level as poor immigrants, the program would be 42% smaller. Over the long run, their fiscal impact is roughly zero , meaning immigrants and their descendants pretty much pay for themselves. A poor immigrant who comes at the age of 20 doesn't consume any public education -- one of the biggest government costs for any of us. His American-born children will be more educated, have higher incomes, pay more in taxes and help delay the bankruptcy of Social Security and Medicare. It'd be better to build a wall around the welfare state than seal up the border. But the more crucial point is that immigration is a net benefit to the economy , not a drain, as Trump and many other Republicans would have you believe. According to the Kauffman Foundation, immigrants are almost twice as likely to start as business as native-born Americans. The purchasing power of Hispanic and Asian Americans, the two newest immigrant groups, is about $2 trillion. That money fuels demand and represents wealth that would not have been created if we discouraged immigration by closing up the borders. Ultimately, Trump's position paper does little more than recycle the same stereotypes and discredited arguments that have dominated anti-immigrant talking points for years. It is not serious policy work and should not be treated that way. ", "external_links": [], "published": "2015-08-19T16:04:00.000+03:00", "crawled": "2015-08-19T16:05:28.733+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}