{"organizations": ["NBA"], "uuid": "380602e018bff2d0b3e08f9d8fd33998f713d421", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d4c00e14000077002e3626.jpeg?cache=9nLWWGEc45", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/steph-curry-obama-golf_55d4bc42e4b0ab468d9f571b", "country": "", "title": "Steph Curry Exposes Obama As The Trash Talker He Truly Is", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Steph Curry Exposes Obama As The Trash Talker He Truly Is", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T21:54:00.000+03:00", "replies_count": 0, "uuid": "380602e018bff2d0b3e08f9d8fd33998f713d421"}, "author": "", "url": "http://www.huffingtonpost.com/entry/steph-curry-obama-golf_55d4bc42e4b0ab468d9f571b", "ord_in_thread": 0, "title": "Steph Curry Exposes Obama As The Trash Talker He Truly Is", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mollie Reilly", "Obama"], "text": "Steph Curry Exposes Obama As The Trash Talker He Truly Is According to the NBA star, Obama talks a lot of smack on the green. Mollie Reilly Deputy Politics Editor, The Huffington Post Posted: 08/19/2015 02:17 PM EDT | Edited: 28 minutes ago \n2015 has been a big year for Stephen Curry. He was named the NBA's Most Valuable Player, led the Golden State Warriors to their first championship in 40 years and watched his daughter Riley become the most famous three-year-old in America (Sorry, Blue Ivy). Now, Curry can add getting heckled by President Barack Obama to that list. \nThe star point guard played golf with Obama, NBA free agent Ray Allen and Curry's father, Dell Curry, on Martha's Vineyard last week during the president's annual vacation. \nAppearing on ABC's \"Jimmy Kimmel Live\" Tuesday, Curry revealed the secret to Obama's golf game. \n\"The president was talking trash,\" Curry said. \"He'd be crickets -- just silent. Just looking at you like, 'Are you going to mark your putt? Are you going to make that?' He'd put the pressure on you, that kind of deal. He'd talk about, 'Oh, you're shaking,' that kind of stuff.\" \nIt wasn't just Obama's teasing that threw Curry off his game. \n\"There's 25 secret service agents on every hole so I couldn't relax at all,\" he told Kimmel. \"Snipers everywhere.\" Steven Senne/AP NBA basketball player Stephen Curry, left, returns a club to the cart as President Barack Obama, right, prepares to drive while golfing Friday, Aug. 14, 2015, at Farm Neck Golf Club, in Oak Bluffs, Mass., on the island of Martha's Vineyard. (AP Photo/Steven Senne) \nCurry said he and his father lost to Allen and Obama. \n\"It was my fault,\" he said. \"I pretty much triple bogeyed the last hole and lost the match for us. Hopefully there's a rematch.\" \nWatch the interview above. \nObama and Curry met earlier this year when the NBA player visited the White House in support of the President's Malaria Initiative. There was no golf outing during that trip, but Curry did get some quality time with the president's dogs: . @StephenCurry30 poses w/ Bo & Sunny during his @WhiteHouse visit. More to come on his meeting with the #POTUS soon. pic.twitter.com/SsGS6h89Sy — Laurence Scott (@LaurenceScott) February 25, 2015 \nAlso on HuffPost: Some Cool 2015 NBA Finals Photos of ", "external_links": [], "published": "2015-08-19T21:54:00.000+03:00", "crawled": "2015-08-19T21:54:19.473+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}