{"organizations": [], "uuid": "bbc2c156018f1dff63fed5c909ee4cf6012cba90", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/margaret%20sanger.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,0,00.rss", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/08/28/push-to-remove-planned-parenthood-founder-bust-from-national-portrait-gallery/", "country": "US", "title": "Anti-abortion groups demand Portrait Gallery remove Planned Parenthood founder bust", "performance_score": 5, "site": "foxnews.com", "participants_count": 13, "title_full": "Anti-abortion groups demand Portrait Gallery remove Planned Parenthood founder bust | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 15, "uuid": "0218365b402c7bc784eeaa958f109cf11f5a932e"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/08/28/push-to-remove-planned-parenthood-founder-bust-from-national-portrait-gallery/#post-0", "ord_in_thread": 0, "title": "Anti-abortion groups demand Portrait Gallery remove Planned Parenthood founder bust", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 28, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print  (National Portrait Gallery) \nWASHINGTON –   Anti-abortion activists held a rally Thursday outside the National Portrait Gallery to demand the Washington museum remove a bust of Margaret Sanger, a controversial eugenicist who founded the organizations that later became Planned Parenthood. \nThe modern-day abortion provider has come under scrutiny following the release of undercover videos that allegedly show employees brokering the sale of fetal tissue. Days after widespread protests against the group, E.W. Jackson, a conservative Christian minister and Virginia lawyer, led the rally in Washington urging the removal of the Sanger bust. \n“You must remove the bust!” Jackson said at the rally in front of the Smithsonian museum. He later added, “If Margaret Sanger had her way, MLK and Rosa Parks would never have been born.” \nThe event also was organized by conservative group ForAmerica and a group of black pastors. \nSanger, who died in 1966, founded two companies that eventually led to the creation of Planned Parenthood. \nGOP 2016 presidential candidate Sen. Ted Cruz, R-Texas, has publicly supported the movement to remove Sanger’s bust from the gallery. Cruz along with Rep. Louie Gohmert, R-Texas, circulated a letter to lawmakers calling the sculpture’s display “an affront broth to basic human decency and the very meaning of justice.”\nSanger, born in 1879, spent much of her life working to change federal and state statutes that had criminalized contraceptives. She was at the leading edge of the birth control movement. Her bust is part of the museum’s “Struggle for Justice” exhibit, which honors Americans who fought for the civil rights of groups that were disenfranchised. \nBut she was controversial because of her work in eugenics – the science of altering human population through controlled breeding and forced sterilization.\nThe Portrait Gallery, which has displayed the tribute to Sanger since 2010, said it would not take it down. A spokesperson for the gallery told The Associated Press that the museum’s displays include some people with “less than admirable characteristics.”\nIt also defended its decision to CNSNews.com and said the bust is in keeping with the museum’s goal to “see the past clearly and objectively.”\n“Margaret Sanger is included in the museum’s collection, not in tribute to all her beliefs, many of which are now controversial, but because of her leading role in early efforts to distribute information about birth control and medical information to disadvantaged women, as well as her later roles associated with developing modern methods of contraception and in founding Planned Parenthood of America,” the statement read.\n“Nonetheless, Sanger’s alliance with aspects of the eugenics movement raises questions about her motivations and intentions. The museum’s intent is not to honor her in an unqualified way, but rather to stimulate our audiences to reflect on the experience of Americans who struggled to improve the civil and social conditions of 20th-century America,” it added.\nEarlier this month, demonstrators gathered outside the Margaret Sanger Center in New York, holding signs and demanding Planned Parenthood be defunded. The rally was part of a nationwide day of protest.", "external_links": [], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-28T07:47:25.623+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}