{"organizations": ["Goldman Sachs"], "uuid": "12c14be4826ccc114149645de170cdc2c3638189", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150914122526-xi-jinping-obama-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_topstories.rss", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/09/17/news/economy/china-state-visit-xi-washington/index.html?section=money_topstories", "country": "US", "title": "Xi visits Obama: 4 problems for the U.S. and China", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Xi visits Obama: 4 problems for the U.S. and China", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T09:52:00.000+03:00", "replies_count": 0, "uuid": "12c14be4826ccc114149645de170cdc2c3638189"}, "author": "", "url": "http://money.cnn.com/2015/09/17/news/economy/china-state-visit-xi-washington/index.html?section=money_topstories", "ord_in_thread": 0, "title": "Xi visits Obama: 4 problems for the U.S. and China", "locations": ["Washington", "U.S.", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Charles Riley", "Obama"], "text": "Xi goes to Washington: 4 problems for the U.S. and China By Charles Riley @CRrileyCNN Goldman Sachs: Reaction to China's slowdown is overdone Chinese President Xi Jinping will be in Washington next week for his first official U.S. state visit. Already, there's drama, drama, drama. \nPresident Obama has made clear that he wants Beijing to stop building military facilities in disputed waters of the South China Sea. He also wants China to halt cyberattacks on U.S. government agencies and corporations. Progress on protecting intellectual property would be nice, too. \nXi, meanwhile, would like the U.S. to return hundreds of Chinese economic fugitives who have fled to America, taking their fortunes with them. He'd also like the U.S. to butt out of China's affairs in Asia. \nThere's plenty of evidence that tensions are rising: Obama was reportedly considering hitting Chinese companies with sanctions over their alleged involvement in hacking. Chinese state media have stepped up their criticisms of the U.S. \nAnd Republican presidential candidates have been throwing rhetorical firebombs from the sidelines, just for good measure. \nHere are four hot topics that Xi and Obama will find it hard to avoid: \nCybersecurity \nChinese hackers are thought to be behind the massive breach at the U.S. Office of Personnel Management, which exposed millions of U.S. government files. \nWashington also says it has caught Chinese spies stealing blueprints and business plans. Last year, federal prosecutors took the unprecedented step of filing formal criminal charges against five Chinese government spies for breaking into Alcoa, U.S. Steel Corp., Westinghouse and others. \nBeijing says it had nothing to do with the cyberattacks, but Obama's patience is clearly wearing thin. \"There comes a point at which we consider this a core national security threat,\" he said last week. \n\"We've made very clear to the Chinese that there are certain practices that they're engaging in that ... are not acceptable,\" Obama said. \"We can choose to make this an area of competition -- which I guarantee you we'll win if we have to.\" \nChinese fugitives \nThere is no extradition treaty between the U.S. and China. All the same, Beijing would like Washington's help in tracking down its most wanted fugitives -- some of whom have fled to the U.S. with their fortunes. \nTake the example of one businessman, Ling Wancheng, who is reported by The New York Times to be on China's list of targets. Ling is the brother of Ling Jihua, a former Chinese official who has been caught in Xi's anti-corruption drive. \nLing Wancheng could be privy to Communist Party secrets, and Beijing would like him back on Chinese soil. \nIn a sign of possible cooperation, China announced Friday that Yang Jinjun, a fugitive wanted on corruption and bribery charges, had been repatriated from the U.S. after 14 years on the run. \nIntellectual property \nAmerican businesses are often reluctant to work in China because they fear their trade secrets will be stolen. That means they could be missing out on opportunities in the world's second biggest economy. \nThe lack of enforcement of intellectual property rights worries nearly 80% of American firms operating in China, according to a survey conducted by the American Chamber of Commerce in China. \n\"Even though many companies have set up infrastructure for local innovation, significant improvements in intellectual property rights are needed for member companies to conduct more of their core global R&D and innovation activities in China,\" the group said in a report earlier this year. \nU.S. tech firms are particularly worried about new rules that could force them to turn over source code to Beijing, and otherwise submit to invasive audits. \nThe state of China's economy \nOn this point, everyone agrees: the entire world needs a strong Chinese economy. \nBut there are questions about Beijing's efforts this summer to confront two challenges: China's stock market has tumbled 40% since June, and there are signs that economic growth is slowing more quickly than analysts -- and Beijing -- had anticipated. \nChina still holds more U.S. debt than any other country, and some analysts are worried that Beijing might unload more of its Treasuries. But if China's economy does go into the ditch, its neighbors in Asia will be hardest hit. \nThe hiccups are already being felt around the world. China's woes have already helped send Canada and Brazil into recession, and caused the U.S. stock market to plunge dramatically at the end of August. \nXi will be under pressure to provide reassurance that Beijing has the economy under control.", "external_links": [], "published": "2015-09-18T09:52:00.000+03:00", "crawled": "2015-09-18T11:11:51.060+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}