{"organizations": [], "uuid": "13c9ac54cce6a5faf8914364de89af5a20d78470", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150828162437-naral-donald-trump-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/08/28/politics/abortion-rights-protest-trump-fundraiser/index.html", "country": "US", "title": "Abortion rights group protests Donald Trump event", "performance_score": 2, "site": "cnn.com", "participants_count": 1, "title_full": "Abortion rights group protests Donald Trump event - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "13c9ac54cce6a5faf8914364de89af5a20d78470"}, "author": "MJ Lee", "url": "http://www.cnn.com/2015/08/28/politics/abortion-rights-protest-trump-fundraiser/index.html", "ord_in_thread": 0, "title": "Abortion rights group protests Donald Trump event", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights A group that supports abortion rights protested outside the event Trump was once supportive of abortion rights, but is now anti-abortion. Norwood, Massachusetts (CNN) When Donald Trump arrived Friday at the home of a local car dealership magnate here for an event that he insisted wasn't a fundraiser , he wasn't greeted by just his supporters.\nNARAL Pro-Choice Massachusetts, a group that supports abortion rights, crashed the event, with about two dozen protesters meeting outside the home of Ernie Boch Jr., who hosted the event.\nThe group's political director, Christian Miron, said earlier Friday that he had expected at least 80 protesters to show up.\n\"While Donald Trump thinks that running for president is merely his own personal reality TV show, the reality is that women need access to safe, affordable reproductive health care,\" Miron told CNN. \"Our goal tonight is to illustrate Trump's very extreme views on women's health because they're very out of step with our core values here in Massachusetts.\"\nTrump, however, downplayed the protest when asked by CNN Friday evening.\n\"I don't see many protesters,\" Trump said. \"CNN is terrible. You people do not cover us accurately. So they have a few protesters outside, and thousands of people here, and the first question from CNN is about protests.\"\nNARAL Pro-Choice Massachusetts is taking issue with Trump's stance on women's reproductive issues. The billionaire businessman was once supportive of abortion rights, but is now anti-abortion.\nRELATED: Donald Trump allies quietly seek money from rich, anonymous patrons\nHe said he changed his position after seeing a friend contemplate an abortion and then choose to keep the baby.\nTrump told CNN's Dana Bash last month that while he's against abortions, he does support exceptions in cases of rape, incest and when the mother's health is at risk.\nTrump, the Republican Party's current front-runner, has faced numerous questions about his views and treatment of women. At the first GOP debate in Cleveland earlier this month, Fox News host Megyn Kelly questioned the candidate on his past inflammatory remarks about women.\nThe candidate has gone on the offensive, frequently stating \"I cherish women,\" and pointing out that many senior executives at his company are female and well-compensated.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-29T13:42:33.174+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}