{"organizations": [], "uuid": "97b8515f05ee330d8bde093c35aced17eb0ca239", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/parkgeunhye05262015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/250981-obama-to-host-south-korean-leader", "country": "US", "title": "Obama to host South Korean leader", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to host South Korean leader", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T00:02:00.000+03:00", "replies_count": 0, "uuid": "97b8515f05ee330d8bde093c35aced17eb0ca239"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/international/250981-obama-to-host-south-korean-leader", "ord_in_thread": 0, "title": "Obama to host South Korean leader", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to host South Korean leader Getty Images By Jordan Fabian - 08/12/15 05:02 PM EDT President Obama will host South Korean President Park Geun-hye at the White House on Oct. 16 amid rising tensions with North Korea. The meeting was initially scheduled for June, but was postponed due to an outbreak of Middle East Respiratory Syndrome in South Korea. ADVERTISEMENT Regional security is expected to be front and center during Park’s second White House visit. Experts in the U.S. and South Korea have become increasingly concerned about North Korea’s nuclear activities. Two South Korean soldiers patrolling the demilitarized zone were wounded last week by land mine blasts, which South Korea blamed on its northern rival. The leaders are also expected to discuss environmental, health, space and cybersecurity issues. Tags: Past: 1 day Sanders pulls crowd of 27,500 in LA The Vermont senator has been pulling record crowds on a three-day West... Trump's momentum keeps rolling Campaign says \"time and time again\" people have underestimated Trump. Sanders: Make Election Day a... The 2016 contender introduced legislation that would create a \"Federal... Oath Keepers descend on Ferguson An official called the presence of the heavily armed men \"both unnecessary... Former Trump home on sale for $54M Trump's signature gold look, however, has been replaced with “more livable... Trump slips in Rasmussen poll He still leads the GOP presidential field with 17 percent support in the... Protesters shut down Bernie... The protesters claimed affiliation with the Black Lives Matter movement. Poll finds Clinton losing to four... Clinton trails Rubio, Walker, Huckabee and Carson in the poll. Poll: Trump maintains lead in Iowa The post-debate poll shows a decline for Jeb Bush and an increase for... Dems rally around Schumer despite... Sen. Dick Durbin is among those backing Schumer. Bill Press: Schumer proves... OPINION | The senator is wrong on the policy and the politics of the Iran...", "external_links": [], "published": "2015-08-13T00:02:00.000+03:00", "crawled": "2015-08-13T06:30:46.697+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}