{"organizations": [], "uuid": "ea4b73799151c87b4f1cf09a2cc1ddfc673973ba", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarackfrancispope_032714getty.jpg", "site_section": "http://thehill.com/rss/syndicator/21684", "section_title": "TheHill - Video", "url": "http://thehill.com/video/in-the-news/254612-live-pope-visite-white-house", "country": "US", "title": "LIVE: President Obama welcomes Pope Francis to the White House", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "LIVE: President Obama welcomes Pope Francis to the White House", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T16:01:00.000+03:00", "replies_count": 0, "uuid": "ea4b73799151c87b4f1cf09a2cc1ddfc673973ba"}, "author": "The Hill Staff", "url": "http://thehill.com/video/in-the-news/254612-live-pope-visite-white-house", "ord_in_thread": 0, "title": "LIVE: President Obama welcomes Pope Francis to the White House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FBI reportedly recovers emails... Bloomberg reported that investigators found work-related and personal... New 'Daily Show' host: US has '... He also said Donald Trump \"makes it almost too easy\" for political comedy... Senate GOP takes lead to prevent... The action sets up a Thursday vote, the same day Pope Francis speaks to... Pope gets political in White House... The pope touched on climate change, immigration and religious liberty LIVE: President Obama welcomes... Watch live as President Obama welcomes Pope Francis to The White House. Pope Francis greeted by Obama with... Obama highlights refugee crisis, climate change in his remarks. Trump dodges Colbert’s birther... \"I talk about jobs, I talk about our veterans being horribly treated,\" he... Francis under fire from... The pope is facing fierce criticism ahead of his address to Congress. Sanders dons 'black-eyed peas... Host Larry Wilmore joked that all Sanders needs is a hat like Donald Trump. GOP lawmaker questions test scores... Rep. Steve Russell is concerned that two female graduates received special... Trump resumes attack on ‘... The GOP front-runner said the Fox News host is \"highly overrated.\" Bush would roll back net... The FCC's Internet rules are among the regs Bush would scrap as president... Trump threatens to sue Club for... Trump's lawyer says the Club for Growth must stop running attack ads. Democrats: Sanders unelectable The doubts have nothing to do with policy. Dems demand changes to financial... Concerns raised in a meeting with Labor Secretary Thomas Perez could spell... Pope Francis: I am not 'left-ish' Francis says he just follows \"the social doctrine of the church.\" Poll: Most think Trump is not... Just 29 percent of respondents in a new poll could envision Trump in the... OPM underestimated number of... OPM on Wednesday revised its original estimate of 1.1 million to 5.6... The four gifts of Donald Trump His No. 1 rank is unsustainable, and when he's gone, he'll have left four... Ayotte slams fellow GOPers over... The New Hampshire Republican is calling for a \"clean\" funding bill. Trump has 'big chance' to win,... Ivana Trump says anything Donald Trump touches “turns to gold.\" ObamaCare sign-ups swell to 17.6... New data indicates more people enrolled over the last five years than... Carson doubles down on no Muslims... Carson tells The Hill presidents shouldn't be sworn in on a Koran. GMO food fight heads to Senate Sen. John Hoeven is angling toward introducing a bill that would bar state...", "external_links": [], "published": "2015-09-23T16:01:00.000+03:00", "crawled": "2015-09-23T18:42:53.706+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}