{"organizations": [], "uuid": "e9867e70fec331a649a6020ae5d5e09ab24bcfa5", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/09/28/obama-onu.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/09/28/obama-llama-al-presidente-sirio-al-asad-un-tirano-que-mata-ninos", "country": "", "title": "Obama llama al presidente sirio al Asad un \"tirano\" que mata niños", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Obama llama al presidente sirio al Asad un \"tirano\" que mata niños", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "e9867e70fec331a649a6020ae5d5e09ab24bcfa5"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/09/28/obama-llama-al-presidente-sirio-al-asad-un-tirano-que-mata-ninos", "ord_in_thread": 0, "title": "Obama llama al presidente sirio al Asad un \"tirano\" que mata niños", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Obama llama al presidente sirio al Asad un \"tirano\" que mata niños El presidente estadounidense dijo que su homólogo sirio es un \"tirano\" y que es necesario buscar un régimen democrático en Siria Lunes, 28 de septiembre de 2015 a las 10:48 El presidente de Estados Unidos aseguró que no se arrepiente de usar sus fuerzas armadas para detener el terrorismo (Reuters). Lo más importante Obama aseguró que está dispuesto a trabajar con Rusia e Irán para resolver el conflicto en Siria Temas relacionados Los países que acogen refugiados sirios y los que no \n(CNNMéxico) — El presidente de Estados Unidos, Barack Obama, pidió este lunes a los países miembros de la Organización de las Naciones Unidas (ONU) \"hacer más por Siria\", país que ha estado en guerra civil desde 2011, tras un intento de derrocar al \"tirano\" que lanza bombas \"para matar a niños inocentes\", Bashar al Asad. \n\"Cuando nos unimos a la coalición internacional bajo mandato de Naciones Unidas, ayudamos al pueblo de Siria a ponerle fin a un tirano, pero la coalición podría hacer más\", dijo el mandatario durante la 70 Asamblea General de la ONU, celebrada este lunes en Nueva York. \nObama urgió la creación de un \"gobierno legítimo para volver a poner al país sobre sus pies\" mediante un sistema democrático. \n“Creo que progresar en lugar de retroceder requiere defender los principios democráticos que lo permiten. Comenzaré por una cosa: Lo que sucede en Siria no sucede en países donde hay una democracia”, dijo el presidente estadounidense, quien también señaló que \"la historia muestra que este tipo de regimen (el mantenido por al Asad), a la larga se desmorona\". \nPor ello, aseguró, su país \"está listo para trabajar con cualquier país, incluyendo Rusia e Irán, para resolver el conflicto en Siria\". \nRusia y Estados Unidos han tenido una nueva ola de fricciones debido al apoyo ofrecido por el presidente ruso Vladimir Putin al gobierno sirio . Washington ha acusado a Moscú de enviar armamento al país de Medio Oriente para continuar con la guerra civil que asola al país desde 2011. \nObama también destacó que es líder de la fuerza armada \"más poderosa\" que ha conocido el mundo, por lo que no dudará en desplegarla para defenderse a sí mismo o a otros países de los ataques terroristas. \n\" No nos arrepentimos de usar nuestras fuerzas armadas \" siempre y cuando eso envíe un mensaje a los terroristas, informó Obama. \nActualmente, el grupo yihadista ISIS tiene el control de algunas ciudades de Siria e Iraq, países donde busca establecer un califato islámico. Esta organización, reconocida por la brutalidad de sus ataques y las ejecuciones públicas a las que somete a sus detractores o rivales, es uno de los principales grupos terroristas en la actualidad. \nTanto el gobierno sirio como una coalición internacional liderada por Estados Unidos y las milicias kurdas intentan hacerle frente a la agrupación. Encuentra este artículo con: obama, estados unidos, onu, asamblea general, siria, basshar al assad Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-29T00:20:00.458+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}