{"organizations": [], "uuid": "14cf25b1ba4aa6dc1dfead7ea23197fd47b4591b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/2015/09/22/0/0/092215_foxhole_640.jpg?ve=1&tl=1", "site_section": "http://feeds.foxnews.com/foxnews/opinion", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2015/09/22/foxhole-charles-c-camosy-finds-middle-ground-in-abortion-debate.html", "country": "US", "title": "Foxhole: Charles C. Camosy finds middle ground in the abortion debate", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Foxhole: Charles C. Camosy finds middle ground in the abortion debate | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "14cf25b1ba4aa6dc1dfead7ea23197fd47b4591b"}, "author": "James Rosen", "url": "http://www.foxnews.com/opinion/2015/09/22/foxhole-charles-c-camosy-finds-middle-ground-in-abortion-debate.html", "ord_in_thread": 0, "title": "Foxhole: Charles C. Camosy finds middle ground in the abortion debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By James Rosen \nPublished September 22, 2015   Email Print   \nFor all the attention that abortion receives as a public issue – with the proviso that those most animated by the issue think it doesn’t receive nearly enough attention – seldom do we get a sense of how the American people truly feel about it. Are they implacably polarized, as the tenor of the debate and the difficulty of congressional action seem to suggest?\nA series of recent public opinion surveys lends some credence to the notion that there may be more middle ground on the issue than we popularly imagine. When Fox News asked registered voters nationwide in April whether they would say they are “more pro-life or more pro-choice,” 44 percent chose the former and 49 percent the latter, with “both/mix” claiming 5 percent and 3 percent not knowing the answer (the margin of error was +/- 3 percent).\nThe previous month, CBS News surveyed adults nationwide and found 38 percent “generally” favoring abortion on demand, 34 percent favoring abortion rights but under stricter limits than now exist, and 25 percent urged a complete ban on abortion (again with a margin of error of +/- 3 percent). This survey indicates that nearly six in ten Americans prefer to see abortion happening not at all or under strictly limited circumstances.\nAnd late last year, when Quinnipiac University queried registered voters nationwide, the result was similar, with 33 percent supporting abortion “in most cases” and 24 percent regarding it as illegal “in most cases.” Only 23 percent favored legalizing abortion in “all cases” and only 12 percent thought abortion should be illegal in “all cases.” Here again is an outcome in which nearly six in ten Americans – just enough for the cobbling of a majority in a legislative body – support some limitation on abortion.\nPlumbing such data for years now has been Charles C. Camosy, an associate professor of theological and social ethics at Fordham University, and author of \"Beyond the Abortion Wars: A Way Forward for a New Generation \" (William B. Eerdmans Publishing, 2015).\nA trained theologian and self-described “ Democrat for Life ,” Camosy believes the abortion issue is more susceptible to compromise than is broadly communicated to the general public. \"Beyond the Abortion Wars\" also assails both sides for measures of hypocrisy. He argues that pro-choice advocates fail to acknowledge those instances where abortion is aimed solely at the death of the unborn child, cloaking their views “with misleading language about ‘reproductive choice.’”\nYet while he personally believes that “the prenatal child is a person with full moral status and deserves equal protection of the law,” Camosy also faults pro-life advocates for recoiling from the logical conclusion of their belief system: namely, that anyone complicit in an abortion should be prosecuted. Camosy notes that former President Bill Clinton, stumping for his wife’s presidential campaign in Ohio in February 2008, called out pro-life advocates out on the point: “If you were really pro-life, you’d want to put every doctor and every mother as an accessory to murder in prison. And you won’t say you want to do that because you know that you wouldn’t have a lick of political support.”\nROSEN:  I have always regarded abortion as – outside of war and peace – the quintessential public issue, precisely because I've always seen it as irresoluble. It has always seemed to be one of those issues where, unlike almost anything else – even including war – there is no room for compromise. The generals may ask for X-hundred-thousand troops and the commander-in-chief may give them X-minus-10 or -20,000 troops; even there, there's room for compromise. But in the case of abortion, you're either pro-choice or you're pro-life.  You're well familiar with that perception of the issue.\nCAMOSY:  Yeah, well, historically, if we look at lots of issues that seemed intractable at the time, right, we look back at them now and say, “I can't believe we even thought this was a thing.” Right? So –\nROSEN:  Like what?\nCAMOSY:  Like slavery, for instance. Right?  Slavery existed for most of human history and in the 1860s we thought, “Oh, my gosh, like, this will be here forever.” And then forty years later, fifty years later, it was unthinkable. So I'm only comparing abortion to slavery [to] give us the sense that, “Hey, this is something we can make progress on.” And as I show in the book, there's plenty of things to make progress on.\nCamosy’s book appears as the Planned Parenthood videos have returned abortion to center stage in the American culture wars, and smack in the middle of presidential primary jockeying, where Republican candidates, courting activist voters in the early balloting states, have found advantage in taking positions – and sometimes denying having taken them – on the subject.\nPoliticians who fail to read \"Beyond the Abortion Wars\" may not be well positioned to leverage the support of the “broad majority of Americans” that Camosy argues is prepared to support the “way forward” he prescribes, in granular detail, at the book’s end.\nJames Rosen joined Fox News Channel (FNC) in 1999. He currently serves as the chief Washington correspondent and hosts the online show \"The Foxhole.\"\n ", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-23T17:42:56.888+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}