{"organizations": [], "uuid": "f6d5927f4486be32cd5c3fccec2d1faf6b78f3f2", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/maduro-pide-obama-que-derogue-decreto-que-considera-venezuela-una-amenaza/", "country": "", "title": "Maduro pide a Obama que derogue decreto que considera a Venezuela una amenaza | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Maduro pide a Obama que derogue decreto que considera a Venezuela una amenaza | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "f6d5927f4486be32cd5c3fccec2d1faf6b78f3f2"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/maduro-pide-obama-que-derogue-decreto-que-considera-venezuela-una-amenaza/", "ord_in_thread": 0, "title": "Maduro pide a Obama que derogue decreto que considera a Venezuela una amenaza | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Maduro pide a Obama que derogue decreto que considera a Venezuela una amenaza Published September 29, 2015 EFE \nEl presidente de Venezuela, Nicolás Maduro, pidió hoy al presidente Barack Obama que \"deber ser derogado, anulado\" el \"decreto amenazante\" que firmó el 9 de marzo y según el cual Estados Unidos declaraba a Venezuela \"una amenaza extraordinaria e inusual\". \nEn su discurso durante los debates de la Asamblea General de las Naciones Unidas, Maduro aseguró que las posteriores \"declaraciones del presidente Barack Obama reconociendo que Venezuela es un país de paz y que no ha sido ni es una amenaza hacia los Estados Unidos es un paso muy positivo, pero tengo que decirlo como jefe de Estado y de Gobierno: aún no suficiente\" \n\"Hemos adelantado conversaciones con el Gobierno de los EE.UU. en el mismo espíritu que ha animado a nuestra hermana Cuba. Para que más temprano que tarde podamos sacar del camino esa espada de Damocles que está sobre el cuello del pueblo venezolano\", prosiguió. \nDurante 40 minutos de discurso, Maduro también habló del conflicto fronterizo con Colombia, y aseguró que junto al presidente de este país, Juan Manuel Santos, han marcado \"una ruta para despejar provocaciones, amenazas y ataques de paramilitares y de narcotraficantes contra Venezuela\". \n\"La ruta va cumpliéndose. Puedo decir en este momento que tengo grandes expectativas positivas\", añadió. \nEl mandatario venezolano hizo una reflexión sobre los 70 años de las Naciones Unidas, de cuyo Consejo de Seguridad es miembro no permanente, y dijo que nació con \"el mundo bipolar de confrontación\" que, al caer el telón de acero, se convirtió en \"un mundo unipolar de imposiciones\". \n\"Ha llegado el tiempo en este siglo XXI de la construcción de un mundo multipolar, multicéntrico. De un mundo sin hegemonismos, de un mundo que sepa reconocer el peso específico de los nuevos centros emergentes del poder político, económico, cultural, humano\". \nAsí, desde su tribuna en la ONU, Maduro aseguró que Venezuela llevará \"una propuesta para ser conversada\" para \"proteger al pueblo de Siria\", que seguirá la idea de \"una nueva alianza de paz\" propuesta por Rusia. \n\"La ONU debe despertar ante el drama de Siria y debemos aprovechar el fracaso estrepitoso de estas cuatro guerras (Irak, Afganistán, Libia y la propia Siria) para desde el Consejo de Seguridad avanzar hacia nuevas normativas que prohíban el uso de métodos intervencionistas para sembrar la guerra, el terror\", dijo. \nFinalmente, Maduro recordó que hay elecciones parlamentarias en Venezuela el 6 de diciembre. \"Le pido al mundo estar muy atento a cualquier intento de violentar la vida política de Venezuela\", concluyó. EFE ", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T12:03:35.571+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}