{"organizations": [], "uuid": "426cbdd94509aca9f257571b52b8f7644c86f7c2", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/0/0/obamainalaska.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/politics/2015/09/01/in-climate-bid-obama-stares-down-melting-alaska-glacier/", "country": "US", "title": "In climate bid, Obama stares down melting Alaska glacier", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "In climate bid, Obama stares down melting Alaska glacier | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "426cbdd94509aca9f257571b52b8f7644c86f7c2"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/09/01/in-climate-bid-obama-stares-down-melting-alaska-glacier/", "ord_in_thread": 0, "title": "In climate bid, Obama stares down melting Alaska glacier", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print Sept. 1, 2015: President Barack Obama speaks to members of the media while on a hike to the Exit Glacier in Seward, Alaska, which according to National Park Service research, has retreated approximately 1.25 miles over the past 200 years.  (AP Photo/Andrew Harnik) \nSEWARD, Alaska –   President Barack Obama stared down a melting glacier in Alaska on Tuesday in a dramatic use of his presidential pulpit to sound the alarm on climate change.\nFrom a distance, Exit Glacier appears as a river of white and blue flowing down through the mountains toward lower terrain. In fact, it's just the opposite. The 2-mile-long chock of solid ice has been retreating at a faster and faster pace in recent years — more than 800 feet since 2008, satellite tracking shows.\n\"This is as good of a signpost for what we're dealing with on climate change as just about anything,\" Obama said, with the iconic glacier at his back.\nObama trekked up to the glacier with photographers in tow in a carefully choreographed excursion aimed at calling attention to the ways human activity is degrading cherished natural wonders. The visit to Kenai Fjords National Park, where the glacier is located, formed the apex of Obama's three-day tour of Alaska, his most concerted campaign yet on climate change.\nThe president, dressed for the elements in a rugged coat and sunglasses, observed how signposts along his hike recorded where the glacier once stood and now only dry land remains.\n\"We want to make sure that our grandkids can see this,\" Obama said, describing the glacier as \"spectacular.\"\nObama is counting on Alaska's exquisite but deteriorating landscape to elicit a sense of urgency for his call to action on climate change. He opened the trip on Monday night with a speech painting a doomsday scenario for the world barring urgent steps to cut emissions: entire nations submerged underwater, cities abandoned and refugees fleeing in droves as conflict breaks out across the globe.\nSome 700 square miles in the Kenai Mountains are blanketed by glacier ice, remnants of the Ice Age, when roughly a third of the Earth was covered with sheets of ice. One of nearly 40 glaciers springing out from Harding Icefield, Exit Glacier has been receding for decades at an alarming rate of 43 feet a year, according to the National Park Service.\nObama's trip was more about visuals than words, and the White House has put a particular emphasis on trying to get the message across to audiences who don't follow the news through traditional means.\nTo that end, Obama planned to tape an episode of the NBC reality TV show \"Running Wild with Bear Grylls,\" putting his survival skills to the test while in the national park. He also planned to board a U.S. Coast Guard vessel to tour the national park by boat before returning to Anchorage later Tuesday.", "external_links": [], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-02T02:17:27.728+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}