{"organizations": [], "uuid": "5090fcf2147c479636ec20a0b5f4d76d45bf2cdd", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/assets/0/0/trumpcampaign6600914.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/politics/2015/09/14/trump-riles-up-conservative-crowd-over-illegal-immigration-sanctuary-cities/", "country": "US", "title": "Trump riles up conservative crowd over illegal immigration, sanctuary cities", "performance_score": 4, "site": "foxnews.com", "participants_count": 12, "title_full": "Trump riles up conservative crowd over illegal immigration, sanctuary cities | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T03:00:00.000+03:00", "replies_count": 18, "uuid": "6256b5ac7bd99e1bfa54e97820fd21b991f6cc85"}, "author": "Christopher Snyder", "url": "http://www.foxnews.com/politics/2015/09/14/trump-riles-up-conservative-crowd-over-illegal-immigration-sanctuary-cities/#post-0", "ord_in_thread": 0, "title": "Trump riles up conservative crowd over illegal immigration, sanctuary cities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Christopher Snyder \nPublished September 14, 2015 FoxNews.com   livefyre Email Print Sept. 14, 2015: Republican presidential candidate Donald Trump speaks to supporters as he takes the stage for a campaign event in Dallas.  (AP Photo/LM Otero) \nKicking off a busy week of campaigning, Republican frontrunner Donald Trump Monday got a sizeable crowd at Dallas’ American Airlines Center riled up over hot-button issues that he says anger conservative voters.\nTrump received the most applause for his position on illegal immigration, which many voters in the crowd say the federal government is handling poorly. “It’s a massive problem we have to stop illegal immigration,” he explained. “It’s disgusting what is happening to our country, we are a dumping ground for the rest of the world.”\nThe crowd erupted when Trump went on the attack over sanctuary cities, in particular, the murder of Kate Steinle allegedly by an illegal immigrant, Francisco Sanchez. “Kate in San Francisco - this magnificent young woman shot in the back by a guy that was sent over here, probably pushed over, who knows but it was an illegal immigrant came over went to San Francisco - we have to end this sanctuary cities.”\nTrump told the crowd that a wall would go a long way to contain illegal immigration. “We have to build a wall folks, and a wall works … we are going to have a great border, they are all over the place, we want people to be in our country legally.”\nOne voter in the crowd, who went by “John” explained to FoxNews.com that his family’s concerns over U.S. immigration policy is a main reason he’s rallying behind Trump.\nTrump also went on the attack over American companies like Ford Motor Company opening up operations in Mexico. The U.S. car manufacturer announced earlier this year they would spend $2.5 billion on new engine and transmission plants in Mexico.\n“A Ford plant is being built in Mexico for cars and trucks and everything and it’s actually not a bad idea, and they will save a fortune,” he explained.\nIf elected, Trump explained, he would impose a high tax on those imported cars. Thus, he says, “I would get a call from the head of Ford and I guarantee you after I tell them all no, they will call up and decide to move their plant back to the United States.”", "external_links": [], "published": "2015-09-14T03:00:00.000+03:00", "crawled": "2015-09-15T07:47:52.170+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}