{"organizations": [], "uuid": "8fafca6ae6d931a9854822b2200757cfc9cf6e50", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarackasiachina_043014getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/254594-obama-xi-meeting-aims-to-smoothes-tensions", "country": "", "title": "Obama, Xi meeting aims to soothe tensions | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama, Xi meeting aims to soothe tensions | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T11:46:00.000+03:00", "replies_count": 0, "uuid": "8fafca6ae6d931a9854822b2200757cfc9cf6e50"}, "author": "", "url": "http://thehill.com/policy/finance/254594-obama-xi-meeting-aims-to-smoothes-tensions", "ord_in_thread": 0, "title": "Obama, Xi meeting aims to soothe tensions | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Vicki Needham", "Obama"], "text": "Obama, Xi meeting aims to soothe tensions Getty Images By Vicki Needham - 09/22/15 07:51 PM EDT \nU.S. businesses and top White House officials are urging U.S. and Chinese leaders to tackle their major differences and soothe growing tensions between the world’s two largest economies during a summit this week. \nPresident Obama and China’s President Xi Jinping will meet Friday at the White House, where the leaders will aim to make progress on a wide variety of issues including cybersecurity, climate and a mix of trade and economic concerns. \nMyron Brilliant, the U.S. Chamber of Commerce’s executive vice president for international economic affairs, said the meeting between the leaders represents a pivotal moment in a relationship that has lately become riddled with uncertainty and distrust. ADVERTISEMENT Brilliant, who along with Chamber President Thomas Donohue met with Xi and other top economic policymakers last week in China, said his impression was that the Chinese leader wants to express confidence about the bilateral alliance, acknowledge its long-term direction and “not skirt over differences but put those in context of the broader direction of the relationship.”\nHe expects Obama to take a similar tack while acknowledging where strains between the two nations remain in what the Chamber considers the most important bilateral relationship in the world. \n“We did not shy away from raising issues of concerns that are undermining and undercutting that relationship,” Brilliant told reporters. SPONSORED CONTENT By Intuit \nMeaningful tax reform starts with tax simplification. Read More \n“I think China’s heard it and now we’ll see how the visit plays out this week,” he added. \nXi will speak to business leaders Tuesday night in Seattle, where he will visit major U.S. firms including Microsoft and Apple, then head to Washington on Friday for meetings with Obama. \nCommerce Secretary Penny Pritzker will serve as Obama’s representative for the West Coast swing of Xi’s visit. \nJohn Frisbie, president of the U.S.-China Business Council, said that from the business community's perspective, the timing of the visit is perfect. \n“The most important thing Xi can do during his visit to the United States is address this uncertainty,” he wrote in the China Business Review on Monday. \nMeanwhile, Treasury Secretary Jack Lew said Tuesday that mixed signals from Beijing over the past several months put more pressure on Xi to make a commitment of staying the course of economic reform that will result in a stronger, more balanced global economy. \n\"Delaying reforms would exacerbate the long-term challenges it is currently facing and restrain the transition within China that is so important to the global economy,” Lew wrote in a op-ed in the Wall Street Journal . \n“But with the right reforms, China’s economic future can be very strong.” \nLew said a variety of new restrictions and extraordinary measures to stabilize China’s stock market “have raised doubts about the commitment of the country’s leaders to allow market forces to play a decisive role in allocating resources.\" \n“They have also unleashed new speculation about the prospects for China’s economy,\" he added. \nBrilliant pointed to a new law covering non-governmental organizations (NGO) that he is concerned could harm business groups in China. \nLew cited restrictions on the purchase of foreign-technology products, excessive reviews for foreign investments and the recent 3 percent drop in the yuan’s value that led to turbulence in international financial markets as reasons for the shaky ties. \nObama said recently that China needs to step up its pace of change along with its maturing economy. \n“You can’t act as if you are a third-world country and pursue protectionist policies, or engage in dumping, or not protect intellectual property at a time when we’re now — when you’re now the second and, eventually, probably the first-largest economy in the world,” he said during remarks at a Business Roundtable event last week. \n“I think in other areas, they still see themselves as the poor country that shouldn’t have any obligations internationally,” Obama said. \n“And in some cases, they still feel that when we call them on issues like their behavior in the South China Sea, or on intellectual property theft, that we are trying to contain them as opposed to us just wanting them to abide by the same rules that helped create an environment in which they can rise,\" he added. \nObama said he is expecting “a lot of outcomes around things like energy and climate change, around improvements in how they deal with investors that will show constructive progress.” \nBrilliant said there is an expectation the countries will agree to license seven biotechnology products during the trip, although he didn’t provide specifics. \nFour lawmakers — Senate Finance Committee Chairman Orrin Hatch (R-Utah) and ranking member Ron Wyden (D-Ore.), as well as House Ways and Means Committee Chairman Paul Ryan (R-Wis.) and ranking member Rep. Sandy Levin (D-Mich.) — urged Obama on Monday to make clear to Xi that they need to lower barriers that allow greater U.S. access to Chinese markets. \n“We recognize that progress is often incremental and slow, but we are increasingly concerned that we have lost forward momentum in the U.S.-China trade and economic relationship,” the lawmakers wrote. \nAnother major business issue is the Bilateral Investment Treaty (BIT), which has been moving along at a nearly glacial pace with the latest offer from Beijing viewed as “incremental and not substantial” progress, Brilliant said. \nHe said the newest offer reportedly cut the list from 80 to about 40 sectors that would be excluded from foreign investment. \n“Both sides need to double down and build out this relationship on meaningful commercial terms,” Brilliant said. \nLew said that a BIT presents “a tangible way for China to signal to businesses in America and the world that it is serious about welcoming and protecting foreign investment.” \n“It needs to provide fair market access and honor the rights associated with intellectual property for these relationships to remain strong,” he said. Tags: ", "external_links": [], "published": "2015-09-23T11:46:00.000+03:00", "crawled": "2015-09-23T11:46:28.253+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}