{"organizations": [], "uuid": "5b966977aa6eabd85f1c90d243e289960bcccfc7", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/09/02/barack-obama.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/09/02/barack-obama-asegura-el-acuerdo-nuclear-con-iran-con-el-voto-del-senado", "country": "", "title": "Barack Obama asegura el acuerdo nuclear con Irán con el voto del Senado", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Barack Obama asegura el acuerdo nuclear con Irán con el voto del Senado", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T19:09:00.000+03:00", "replies_count": 0, "uuid": "5b966977aa6eabd85f1c90d243e289960bcccfc7"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/09/02/barack-obama-asegura-el-acuerdo-nuclear-con-iran-con-el-voto-del-senado", "ord_in_thread": 0, "title": "Barack Obama asegura el acuerdo nuclear con Irán con el voto del Senado", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Barack Obama asegura el acuerdo nuclear con Irán con el voto del Senado La senadora demócrata Barbara Mikulski de Maryland anunció su apoyo por el acuerdo, con lo que el presidente tendrá poder de veto Miércoles, 02 de septiembre de 2015 a las 11:07 Con esta noticia, Obama recibe uno de los más importantes anuncios de su presidencia (Getty Images/ Archivo). Lo más importante Se espera que las mayorías del Congreso y el Senado, ambas controladas por republicanos, voten en contra del acuerdo Temas relacionados El acuerdo nuclear con Irán 'acerca' a Putin y Obama \nWASHINGTON, Estados Unidos (CNN) — En una enorme victoria para el presidente Barack Obama, la senadora demócrata Barbara Mikulski de Maryland anunció su apoyo para el acuerdo nuclear con Irán este miércoles, que le otorga a la Casa Blanca los votos necesarios para evitar el bloqueo de los republicanos. \nEl anuncio significa que al menos 34 senadores —el número requerido por la constitución para sostener un veto— apoyarán a Obama en vetar una resolución republicana para rechazar el acuerdo. \nMikulski se retirará al final de su término. \nSe espera que las mayorías del Congreso y el Senado, ambas controladas por republicanos, voten en contra del acuerdo. \nSin embargo, si los defensores del tratado multinacional que busca contener el programa de armas nucleares de Irán obtienen los 41 votos necesarios para obstruir el proyecto de ley, prevendrían que llegue a un voto final en el Senado. \nEl secretario de Estado John Kerry dijo que la administración continuará buscando apoyar el acuerdo más allá de los 34 votos que tienen ahora \"hasta el último momento\". \n\"34 votos son obviamente suficientes para que se mantenga el veto del presidente\", le dijo a Kerry a Christiane Amanpour, de CNN. \"Eso no es satisfactorio para nosotros. Queremos tratar de llegar más lejos. Continuaremos convenciendo\". \nLee: El significado y las implicaciones del acuerdo nuclear con Irán \nEsa posibilidad molesta a algunos republicanos que creen que el acuerdo histórico merece un voto \"sí o no\" final. \nCasi todos los republicanos han hablado en contra del acuerdo, argumentando que tiene bajos estándares para que los inspectores internacionales monitoreen si Irán está cumpliendo, y que permita al gobierno de Teherán construir armas nucleares en pocos años. \nPero solo dos senadores demócratas —Chuck Schumer de Nueva York y Bob Menendez de Nueva Jersey— han anunciado que se opondrán. Los 54 republicanos del Senado necesitarían cuatro demócratas más para poner fin a la obstrucción y enviar la ley a voto. \nEl acuerdo, que tomó años para que el llamado P5+1 —Estados Unidos, Reino Unido, Francia, Alemania, China y Rusia— negociara, ha sido el objeto de intensa presión por ambos lados. \nSe espera que los votos se realicen antes del 17 de septiembre. Encuentra este artículo con: obama, iran, casa blanca, acuerdo, nuclear, senado, congreso, democratas, republicanos, voto Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"5544baf4317c452cac947eb0f7c12ced\", \"time\": \"2015-09-02T16:09:50.044Z\" } Video ", "external_links": [], "published": "2015-09-02T19:09:00.000+03:00", "crawled": "2015-09-02T19:09:57.813+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}