{"organizations": [], "uuid": "130054366f8bceaa303d63e2b895535c6e57f67d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051815getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/252973-obama-to-head-to-iowa", "country": "US", "title": "Obama to head to Iowa", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to head to Iowa", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T23:55:00.000+03:00", "replies_count": 0, "uuid": "130054366f8bceaa303d63e2b895535c6e57f67d"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/252973-obama-to-head-to-iowa", "ord_in_thread": 0, "title": "Obama to head to Iowa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to head to Iowa By Jordan Fabian - 09/08/15 04:55 PM EDT President Obama will travel to Des Moines, Iowa, on Monday, putting him in a key early-voting state as the 2016 presidential campaign enters a busy fall season. Obama will speak with a group of high school juniors and seniors about college affordability, according to a message blasted out to the White House’s email list. ADVERTISEMENT “The students I hear from every day remind me that if we can come together around the idea that every American — no matter where they grew up, or how much money their parents have — deserves a quality education and a shot at success, then we can build a future as remarkable as our past,” Obama wrote. The president will be accompanied by Education Secretary Arne Duncan. First lady Michelle Obama will travel to the state to promote higher education next Thursday. Obama’s trip doubles as a chance to boost Democratic candidates with his economic message and draw a contrast with Republicans in a key battleground state. Obama has deep political roots in the Hawkeye State. He defeated Hillary Clinton in 2008 Democratic caucuses, jumpstarting his successful campaign. He won Iowa over John McCain in the 2008 general election, and beat Mitt Romney there in 2012 as well. But he remains a deeply polarizing figure among the state’s voters. Fewer than half of Iowa Republican caucusgoers believe Obama was born in the U.S., according to a recent Des Moines Register/Bloomberg Politics Iowa Poll . Murdoch: Biden 'very likely' wins... “Looks like Biden already running,” the media mogul tweeted. Juan Williams: #BlackLivesMatter... OPINION | The movement is fast becoming its own worst enemy. Obama cements Iran victory Obama has clinched the 41 votes he needs to block a resolution... Judge frees Kentucky clerk Kim Davis was jailed for refusing to issue marriage licenses to same-sex... Democrats pin Senate hopes on... The map of key Senate races largely matches up with presidential... Trump 'felt' that he was in the... \"I felt that I was in the military ... because I dealt with those people... Conservatives prepare to make... It remains to be seen whether they can force the hand of leadership. Warren: I agree with Trump on taxes Warren said her support on taxes does not mean she's endorsing the GOP... 28 Republicans pledge to oppose... Ten more people have signed onto a letter spearheaded by Rep. Mick... Andrea Mitchell worried Hillary... “I couldn’t ask everything that I did want to ask,” NBC's Andrea Mitchell... Huckabee on Kim Davis: I'm willing... The Kentucky clerk was released Tuesday afternoon after being held for... Krugman: Trump is 'right' on taxes... The economist and columnist said Trump is correct to embrace a tax hike on... McConnell blocks Reid's offer on... Reid tried to set up a vote on the Iran deal later this week. Protester interrupts Cheney speech “Dick Cheney is a war criminal,” a protester yelled. Rubio: Trump 'should run as a... Rubio is blasting Trump's call for the wealthy and hedge funds to pay more... McConnell: Don't filibuster Iran... Fourty-one senators have backed the Iran agreement. Obama eats 'bloody' salmon with... The fish was described by Grylls as a \"bloody carcass of half-eaten salmon... The Hill's Whip List: Obama has 41... Supporters have votes to potentially filibuster a measure of disapproval. Report: Clinton had 'top secret'... One of the emails reportedly dealt with North Korea's nuclear program. Gun control bill targets sales to... The bill from Sen. Tim Kaine (D-Va.) comes in response to a recent string... Nine Obama regulations to watch Pressure is mounting on the administration to complete its regulatory... Sanders to roll out criminal... Sanders called the current system \"broken\" and said his bill would be...", "external_links": [], "published": "2015-09-08T23:55:00.000+03:00", "crawled": "2015-09-09T00:18:02.961+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}