{"organizations": [], "uuid": "c928ec9afacfe22172a2921685dfeb56c2d0ceed", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150902103643-barack-obama-august-5-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_meast.rss", "section_title": "CNN.com - Middle East", "url": "http://edition.cnn.com/2015/09/02/politics/iran-nuclear-deal-votes-sustain-veto/index.html", "country": "US", "title": "Obama secures Iran nuclear deal with Barbara Mikulski vote CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama secures Iran nuclear deal with Barbara Mikulski vote - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T23:47:00.000+03:00", "replies_count": 0, "uuid": "c928ec9afacfe22172a2921685dfeb56c2d0ceed"}, "author": "Ted Barrett", "url": "http://edition.cnn.com/2015/09/02/politics/iran-nuclear-deal-votes-sustain-veto/index.html", "ord_in_thread": 0, "title": "Obama secures Iran nuclear deal with Barbara Mikulski vote CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Barbara Mikulski of Maryland became the 34th senator to back Obama's Iran nuclear deal That gives Obama a veto-proof coalition to protect the deal from being blocked by Congress Secretary of State John Kerry is pushing for more support of the deal in a speech Thursday Washington (CNN) In a major victory for President Barack Obama, Democratic Sen. Barbara Mikulski of Maryland announced support for the Iran nuclear deal Wednesday, providing the White House the votes it needs to prevent Republicans from scuttling the agreement.\nThe announcement means that at least 34 senators -- the number required by the Constitution to sustain a veto -- will back Obama's expected veto of a Republican resolution to disapprove of the deal. Mikulski is retiring at the end of her term.\nWhile majorities of both the GOP-controlled House and Senate are poised to vote against the agreement, supporters of the multinational accord that aims to curb Iran's nuclear weapons program are also hoping to get the 41 votes needed to filibuster the bill and prevent it from even getting to a final vote in the Senate.\nSecretary of State John Kerry said the administration will continue to try and push support for the deal past the 34 votes they now have \"until the last moment.\"\n\"Thirty-four votes are obviously enough votes for the president's veto to be upheld,\" Kerry told CNN's Christiane Amanpour. \"That is not satisfactory for us. We do want to try to go further. We'll continue to persuade.\"\nThat prospect upsets some Republicans who believe the historic agreement deserves a final up-or-down vote.\nRelated: Pro-Iran deal Sen. Chris Coons wants up-or-down vote\nNearly all Republicans have come out against the agreement, arguing it sets up weak standards for international inspectors to monitor whether Iran is complying with the agreement and would allow Iran to build nuclear weapons in a few years.\nBut only two Democratic senators -- Chuck Schumer of New York and Bob Menendez of New Jersey -- have announced they oppose it. The Senate's 54 Republicans would need four more Democrats to join them in opposing the deal to end the filibuster and send the bill disapproving of the deal for a vote.\nThe agreement, which took years for the so-called P5+1 -- the U.S., U.K., France, Germany, China and Russia -- to broker, has been the subject of intensive lobbying by both sides. Ultimately, opponents' multimillion-dollar campaign failed to resonate with enough of the Democratic lawmakers it was targeting.\nVotes are expected after lawmakers return from a summer recess next week but before Sept. 17, the statutory deadline for Congress to act on the deal. But GOP leaders have not announced when those votes will take place.\nHouse Speaker John Boehner's spokesman Cory Fritz said the White House shouldn't be celebrating.\n\"Forcing a bad deal, over the objections of the American people and a majority in Congress, is no win for President Obama. The White House may have convinced just enough Democrats to back an agreement that legitimizes Iran's nuclear program, trusts the regime to self-inspect and offers amnesty to terrorists, but this deal is far from being implemented,\" Fritz said.\nRead more: What is the Iran nuclear deal?\nThe administration only needs one chamber to sustain its veto in order for the Iran deal to go through. House Democratic leadership aides are confident that they also have enough votes in the House to uphold a veto.\nThe Iran deal has been a charged topic in the 2016 presidential race and GOP, candidate Sen. Marco Rubio of Florida, a member of the Senate Foreign Relations Committee, was the first in the field to react to the 34th vote.\n\"When I'm President, we won't just reverse President Obama's dangerous Iran deal. We will increase sanctions on Iran,\" Rubio tweeted Wednesday.\nVice President Joe Biden, meanwhile, tweeted that \"The #IranDeal is the best available option to block Iran from a bomb. It is in our national security interests.\"\nThe administration is clear it will continue to sell the Iran deal to the public as it looks to bolster the number of votes in favor of the deal and sway a divided public.\nFollow @CNNpolitics Kerry took the administration's sales pitch to Philadelphia on Wednesday, making a speech at the National Constitution Center to drum up further support for the deal.\n\"Rejecting this agreement would not be sending a signal of resolve to Iran,\" he told the audience there, \"it would be broadcasting a message so puzzling most people across the globe would it find impossible to comprehend.\"\nKerry also took aim at the deal's opponents, dispelling what he called \"myths\" and \"false information that has been circulating about the proposal on which Congress will soon vote.\"\n\"The outcome [of that vote],\" Kerry said, \"will matter as much as any foreign policy decision in recent history. \"\nAnd Kerry is now bringing his appeal to each member of congress, sending letters to all their offices on Wednesday morning ahead of the speech.\n\"We share the concern expressed by many in congress regarding Iran's continued support for terrorist proxy groups throughout the region,\" he wrote in that letter, \"it's propping up of the Assad regime in Syria, its efforts to undermine the stability of its regional neighbors and the threat it poses to Syria.\"\n\"We have no illusion that this behavior will change following implementation of the JCPOA,\" he added.\nKerry also reaffirmed Obama's pledge that Israel's security is \"sacrosanct,\" adding the administration is prepared to further strengthen\" the U.S.-Israel security relationship with talks on a new 10-year memorandum of understanding on Aid which Kerry said would \"cement for the next decade our unprecedented levels of military assistance.\"\nThe U.S. has already promised Israel Increased cooperation on missile defense and other capabilities for Israel, as well as increased military aid and other assistance to Gulf States.\nKerry said the Administration would work with Congress on legislation to appropriate funding for these measures and resources.\nHe added that while the administration believes the Iran deal would deny Iran pathway to a nuclear weapon, the U.S. would \"continue to provide Israel and our GCC partners the \"robust assistance and support they need to combat Iranian destabilizing activity in the region.\"\nIn his speech, Kerry also indicated the administration could use the deal as a launching point for other discussions with Iran, including talks to free the Americans currently jailed or missing in Iran -- Amir Hekmati, Saaed Abedini, Jason Rezaian, and Robert Levinson.\n\"We will do everything we can to see that our citizens are able to return safely to where they belong -- at home and with their families\" said Kerry.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-09-02T23:47:00.000+03:00", "crawled": "2015-09-02T22:34:23.764+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}