{"organizations": ["UN General Assembly", "UN General Assembly | Fox News Obama", "Facebook", "Twitter"], "uuid": "c8a312bc1bb95ba57c30f4e168ef9fb6f2fd5d5f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/oreilly_putin_092515.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/28/obama-putin-to-meet-face-to-face-for-first-time-in-10-months-at-un-general/", "country": "", "title": "Obama, Putin to meet face-to-face for first time in 10 months at UN General Assembly | Fox News", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama, Putin to meet face-to-face for first time in 10 months at UN General Assembly | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T12:39:00.000+03:00", "replies_count": 0, "uuid": "c8a312bc1bb95ba57c30f4e168ef9fb6f2fd5d5f"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/28/obama-putin-to-meet-face-to-face-for-first-time-in-10-months-at-un-general/", "ord_in_thread": 0, "title": "Obama, Putin to meet face-to-face for first time in 10 months at UN General Assembly | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Obama"], "text": "Obama, Putin to meet face-to-face for first time in 10 months at UN General Assembly Published September 28, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Barack Obama and Russian President Vladimir Putin will meet face-to-face Monday for the first time in ten months amid increasing Russian influence in the Middle East, as well as the ongoing crisis in Ukraine. \nUnderscoring their deep differences, the U.S. and Russia couldn't even agree on the purpose of the meeting, which will occur on the sidelines of the United Nations General Assembly. The White House said it would focus on Ukraine and getting Moscow to live up to a fragile peace plan. The Kremlin said Ukraine would be discussed only if time allowed, with Syria and the fight against the Islamic State (ISIS) dominating the discussions. \nThe latest measure of Russia's growing role in the war-torn region came Sunday, when the Iraqi military announced it would begin sharing \"\"security and intelligence\" information with Russia, Syria and Iran to help combat ISIS. Meanwhile, Moscow is ramping up its involvement in Syria in defense of its ally Bashar Assad, with activists saying that Russian soldiers on the ground in Syria. \nThe move could further complicate U.S. efforts to battle the extremists without working with Damascus and its allies. A U.S.-led coalition has been conducting aerial bombing campaigns against ISIS positions in Iraq and Syria, but U.S. officials insist they have no coordination with Tehran or Damascus on the matter. \nHours prior to their encounter, Obama and Putin will each have a chance to make their case to a broader audience of world leaders gathered in New York. Obama will address the body at approximately 10:30 a.m. ET Monday, with Putin scheduled to follow approximately one hour and 45 minutes later. \nObama is expected to emphasize the need for a political resolution to Syria's civil war that includes the ouster of President Bashar Assad, a Russian ally. Putin, meanwhile, is expected to argue that Assad's military is the most capable force for fighting ISIS and therefore needs to be strengthened. More on this... Putin sends ground troops into Syria \n\"There is no other solution to the Syrian crisis than strengthening the effective government structures and rendering them help in fighting terrorism,\" Putin said in an interview with CBS' \"60 Minutes\" that aired on Sunday. \nAhead of his U.N. visit, Putin deployed more weapons and troops to Syria. The Kremlin has also intensified its diplomatic efforts in recent months, launching a dialogue with Saudi Arabia, which is firmly bent on unseating Assad, and the Syrian opposition, in a renewed attempt to try to negotiate a political compromise. \nRussia has shown no indication that it would dump its support for Assad, whom it has shielded from U.N. sanctions and continued to provide with weapons throughout the nation's more than four-year civil war. \nPutin's calls for strengthening Assad's military come amid striking troubles for Obama's plan to train and arm moderate rebels to fight the ISIS in Syria. A $500 million Pentagon training program has resulted in just a handful of fighters to bolster airstrikes from a U.S.-led coalition. \nThe U.S. has agreed to talk with Russia about \"deconflicting\" their military action in Syria. U.S. Defense Secretary Ash Carter has spoken to his Russian counterpart about Syria earlier this month, the first military-to-military conversation in more than a year. \nIt will be hard for Moscow and Washington to reach any common ground on Syria beyond the military talks. Putin clearly has no intention of joining the U.S.-led coalition in Syria, which would mean accepting U.S. orders, and Washington has voiced concern that Russia is using its military presence in Syria to shore up Assad, whom it sees as the cause of the Syrian crisis. \nObama and Putin have long had a strained relationship and their body language in face-to-face meetings is always closely scrutinized for signs of tension. Their last formal meeting was in June 2013, though they've had a number of conversations on the sidelines of international summits, most recently in China last November. \nThe Ukraine crisis drove U.S.-Russian relations to post-Cold War lows. Russia annexed Crimea from Ukraine in 2014 and a pro-Russian armed insurgency continues in eastern Ukraine, with Kiev and NATO accusing Moscow of backing and supplying it. \nA shaky peace deal for Ukraine was brokered in February by France and Germany, and Russia doesn't want the United States to become engaged in those talks. Another four-way meeting of leaders of Russia, Ukraine, France and Germany is set to take place in Paris this weekend. \nU.S. officials say Obama will stress to Putin the importance of local elections in Ukraine scheduled for late October going forward without interference. \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-09-28T12:39:00.000+03:00", "crawled": "2015-09-28T12:39:31.937+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}