{"organizations": [], "uuid": "003e725fb7b146b61f74c04b47fa2d9ab372f250", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/scalefit_1200_noupscale/55e4cd351d00006e001466cb.jpeg", "site_section": "http://www.huffingtonpost.com/tag/hispanic-heritage/feed", "section_title": "Hispanic Heritage on Huffington Post", "url": "http://www.huffingtonpost.com/entry/tk-top-issues-for-latinos-that-arent-immigration_55e4c964e4b0aec9f35445a5", "country": "US", "title": "Issues Latinos Care About That Have Nothing To Do With Immigration", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Issues Latinos Care About That Have Nothing To Do With Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T14:52:00.000+03:00", "replies_count": 0, "uuid": "003e725fb7b146b61f74c04b47fa2d9ab372f250"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/tk-top-issues-for-latinos-that-arent-immigration_55e4c964e4b0aec9f35445a5", "ord_in_thread": 0, "title": "Issues Latinos Care About That Have Nothing To Do With Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tanisha Love Ramirez Latino Voices Editor, The Huffington Post Posted: 09/18/2015 11:52 AM EDT | Edited: 4 hours ago \nMany Latino voters care very deeply about immigration reform, but immigration isn’t the only issue on their minds. In fact, when the Pew Research Center asked registered Hispanic voters to rank issues that matter to them in order of importance, immigration didn’t rank first -- second or third -- on their lists. So if immigration isn't their number one priority, what is? \nHere are the three issues that ranked higher than immigration, according to the 2014 Pew report: Education Monkey Business Images via Getty Images According to the Pew Research Center, approximately 57 percent of Hispanic registered voters surveyed in 2013 said education was an “extremely important” issue facing the nation today. Makes sense when you think about it. Though Latinos have made major gains in college enrollment , they are less likely than their white peers to complete a bachelor’s degree. The reasons for these gaps are varied , ranging from poor college preparedness to a lack of familial or financial support. Wealth Winslow Productions via Getty Images College-educated Latinos are have a difficult time accumulating wealth compared with other demographics. Between 2007 and 2013, Hispanics the median real net worth fell 72 percent for Hispanic families with college degrees and 41 percent for Hispanic families without degrees, according a study from the Federal Reserve Bank of St. Louis. Though there isn’t a clear explanation for these financial disparities, the report points to debt as a major factor. The 2007 median debt-to-income ratios for college-educated Hispanics were higher than those among any other group. The Washington Post hypothesizes it may have something to do with the structural discrimination and inequality experienced by Latinos in the housing market and workforce. Health care Creatas via Getty Images A year after the Affordable Care Act began, 1 in 4 Latinos in the United States remained uninsured. According to a Pew Report published last September, approximately 6 million U.S.-born Hispanics lacked health insurance. Twelve percent of them were 18 years old or younger. Worse yet: Now that there’s a big push to cut funding for Planned Parenthood, those numbers can potentially skyrocket. According to Planned Parenthood’s website, up to a quarter of their patients are Latino -- many of whom face greater obstacles to obtaining sexual and reproductive services, which may in turn lead to later state diagnoses of preventable diseases. \nThis is by no means a definitive list of all of the issues that Latino voters care about. Latinos' concerns run the gamut from incarceration rates to representation in government. However, the above study is a good jumping off point for larger conversations concerning Latinos', well, concerns -- especially when we talk about the \"Latino vote.\" \nAs the 2016 presidential campaign gears up, The Huffington Post's national reporter Roque Planas, Teachers College at Columbia University's Dr. Blanca E. Vega, and author Javier Manjarres discuss Latino voters and what they care most about in this election in the video below. Check it out and share your biggest concerns in our comments section. \nAlso on HuffPost", "external_links": [], "published": "2015-09-18T14:52:00.000+03:00", "crawled": "2015-09-18T23:18:36.427+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}