{"organizations": [], "uuid": "721c94bda23f1bd1722e8a2d8bbf75077f715665", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/092815_anr_corke_1280.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/09/28/obama-in-un-address-warns-dangerous-currents/", "country": "US", "title": "Obama, at UN, stakes out Syria position ahead of Putin meeting", "performance_score": 1, "site": "foxnews.com", "participants_count": 24, "title_full": "Obama, at UN, stakes out Syria position ahead of Putin meeting | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 29, "uuid": "e768ce26bd860fce954168b565856b46f1dfec14"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/09/28/obama-in-un-address-warns-dangerous-currents/#post-0", "ord_in_thread": 0, "title": "Obama, at UN, stakes out Syria position ahead of Putin meeting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 28, 2015 FoxNews.com   livefyre Email Print \nPresident Obama used a United Nations address Monday to both appeal for global cooperation in dealing with terrorism and other threats -- and stake out his negotiating position on Syria ahead of a high-stakes meeting with Russia's Vladimir Putin. \nSpeaking to the U.N. General Assembly in New York City, Obama warned of \"dangerous currents\" that threaten the modern world. He cited \"brutal networks of terror\" that have filled the vacuum in fragile states and stirred a refugee crisis on an \"epic scale.\" \nBut he also urged nations against imposing order \"by force.\" \n\"If we cannot work together collectively, we will all suffer the consequences,\" Obama said. \nPortion of the address, and that message, appeared to be aimed at Russia, to which Obama made several specific references. He said the U.S. is \"prepared to work\" with Russia and Iran to resolve the bloody Syrian civil war. \nBut, in a clear reference to Putin's support for the regime in Damascus, Obama said the world cannot see a \"return to the pre-war status quo\" in Syria. \n\"Let's remember how this started,\" Obama said. \"[Bashar] Assad reacted to peaceful protests by escalating repression and killing.\" \nWithout elaborating, Obama said \"compromise\" will be required to end the fighting in Syria and stomp out the Islamic State. But he said there must be a \"transition\" away from Assad. \nObama plans to spend three days in New York, but perhaps the most anticipated moment was to come Monday evening -- in the meeting with Putin on the sidelines of the annual gathering of world leaders. \nIt will be their first face-to-face meeting in nearly a year. Putin plans to address the assembly's opening session on Monday. \nThe U.S. and Russia have quibbled over who requested the meeting and what the focus will be. Putin wants to talk about Syria; Obama wants to concentrate on Ukraine. Despite administration efforts to turn Putin into an international pariah after Russia annexed the Crimean Peninsula from Ukraine in March 2014, Obama believes not engaging with the Russian leader \"would be wrong\" given the pressing issues in Ukraine and Syria, Obama deputy national security adviser Ben Rhodes said. \nPutin has begun a military buildup in ally Syria for reasons that U.S. officials have said remain unclear. \nIn his address, Obama broadly defended his approach to foreign policy, and pointed to recent developments spearheaded by his administration. \nHe arrives at the U.N. after securing some major foreign policy achievements, including a nuclear deal with Iran and a diplomatic normalization with Cuba. Obama touted both those agreements on Monday. \nBut overshadowing those still-controversial moves are worsening conflicts across the Middle East and the rising influence of Russia in places like Syria and Ukraine. \nObama on Monday urged the world to choose \"cooperation over conflict.\" \n\"That is not weakness, that is strength,\" he said. \nHe also acknowledged that, in Libya, the international force \"should have done more\" to fill the vacuum left behind after Muammar Qaddafi was deposed. \n\"We must work more effectively in the future as an international community to build capacity for states that are in distress before they collapse,\" Obama said. \nDespite progress on the Iran nuclear front, Obama remains challenged elsewhere in the Middle East. \nA campaign against Islamic State militants who have claimed broad sections of Iraq and Syria remains far from achieving Obama's goal to \"degrade and ultimately destroy\" the group, despite more than a year of military airstrikes against ISIS targets by a U.S.-led coalition of more than 60 countries. \nA separate U.S. effort to train thousands of moderate Syrian rebels to fight ISIS has turned out to be a costly failure, with fewer rebels than originally anticipated involved.\nObama's first scheduled stop in New York was at a U.N. summit on steps to eradicate extreme poverty around the world. In the evening, the president planned to headline a Democratic Party LGBT fundraiser. \nBesides Monday's address to general assembly, Obama was to meet with Indian Prime Minister Narendra Modi and lead a summit on international peacekeeping. \nThe Associated Press contributed to this report.", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T18:32:36.988+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}