{"organizations": ["U.N.", "ISIS", "General Assembly", "U.N. Climate Change Conference", "U.N. General Assembly", "United Nations", "CNN"], "uuid": "556f4c8f9f47121722fe142f334f02f37ecd4577", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150928051402-un-headquarters-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_meast.rss", "section_title": "CNN.com - Middle East", "url": "http://edition.cnn.com/2015/09/28/world/united-nations-main/index.html?eref=rss_middleeast", "country": "US", "title": "Obama: Assad is 'tyrant' who kills kids", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama: Assad is 'tyrant' who kills kids", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T21:53:00.000+03:00", "replies_count": 0, "uuid": "556f4c8f9f47121722fe142f334f02f37ecd4577"}, "author": "", "url": "http://edition.cnn.com/2015/09/28/world/united-nations-main/index.html?eref=rss_middleeast", "ord_in_thread": 0, "title": "Obama: Assad is 'tyrant' who kills kids", "locations": ["United States", "Cuba", "Iran", "Saudi Arabia", "U.S.", "Jordan", "Paris", "Ukraine", "Syria", "Russia", "Middle East", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Laura Dolan", "Assad", "Putin", "Hassan Rouhani", "Francois Hollande", "Ban", "Rouhani", "Abdullah", "Obama", "Jinping", "Hollande", "Richard Roth", "Petro Poroshenko", "Vladimir Putin"], "text": "MUST WATCH Top 5 to watch at the U.N. General Assembly 02:11 The \"dangerous currents\" in Syria and other nations threaten to bring \"a darker, more disordered world,\" Obama said. \"I've said before and I will repeat: There is no room for accommodating an apocalyptic cult like ISIL, and the United States makes no apology for using our military as part of a broad coalition to go after them,\" he continued, using his administration's preferred acronym for ISIS. Obama said the United States is prepared to work with any nation, including Russia and Iran, to resolve the conflict. When Russian President Vladimir Putin addressed the General Assembly later Monday, he spoke about a \"great and tragic migration of peoples\" that requires members of the U.N. to unite to stabilize Syria. The way to do that, he said, is to \"cooperate with the Syrian government and its armed forces who are valiantly fighting terrorism face-to-face.\" To do otherwise would be a \"mistake,\" he said. \"We should finally acknowledge that no one but President Assad 's armed forces and Kurdish militia are truly fighting the 'Islamic State' and other terrorist organizations in Syria,\" Putin said. The Russian leader went on to blame a \"military coup\" for unrest in Ukraine . Ukrainian President Petro Poroshenko will speak before the assembly Tuesday. A call to maintain U.N. ideals Syria and the growing menace of ISIS terrorists are likely to occupy a lot of the discussion at this week's meeting of the world's megapowers. Obama chided leaders who have said that the United Nations' ideals are \"unattainable and out of date\" for the era. \"We cannot turn back those forces of integration ... no nation can insulate itself from the threat of terrorism,\" the flow of migrants or the danger of a \"warming planet,\" he said. \"No matter how powerful our military,\" Obama said, \"how strong our economy, we understand\" that the \"Untied States cannot solve the world's problems alone.\" Obama received applause for his comments about Cuba. The U.S. policy on Cuba wasn't working, he said, so \"we changed that.\" Though the United States has \"differences with the Cuban government,\" those disagreements can be addressed through diplomacy, increased revenue sharing and \"people-to-people ties,\" the President said. Obama pointed to the recent nuclear agreement with Iran as a sign that even two countries thought to be enemies were capable of reaching common ground. Iranian President Hassan Rouhani also spoke Monday, noting hat the agreement marked a \"new environment\" for global diplomacy. \"I say to all nations that we will not forget the past, but we do not wish to live in the past,\" he said. \"We will not forget war and sanctions, but we look to peace and development.\" Rouhani also took time at the U.N. to call for a full investigation of last week's Hajj stampede in Saudi Arabia that killed at least 769 people. \"Old, young, men and women who had come together in the grand and global spiritual gathering of the Hajj, but unfortunately fell victim to the incompetence and mismanagement of those in charge,\" Rouhani said, blasting Saudi officials. 'Give them a life' French President Francois Hollande, in his speech, pointed out the importance of the upcoming U.N. Climate Change Conference, to be held in Paris in November. \"In Paris we will be asking one question: Is humankind capable of deciding we will preserve life on this plant?\" he said. \"If we don't make this decision in Paris ... it will be too late for the world.\" He said the conference needs to produce a flexible agreement that will incorporate a review process. \"The agreement in Paris should not be the end all but a point of departure, the beginning of the process,\" he said. Developed nations should take on extra financial commitments to help the developing nations, Hollande added.. Earlier, United Nations Secretary-General Ban Ki-moon welcomed world leaders to the weeklong meeting by giving an impassioned speech that covered at least a dozen serious problems the world faces. He urged warring factions in Syria to put down their weapons and other countries to help millions of refugees born of that war . For those risking their lives, especially those taken advantage of by human traffickers, it's critical that aid come not only because international law mandates it, but because it would reflect \"basic compassion,\" he said. It is not enough to save lives, Ban said; the world must help the refugees find stability and happiness. \"Our aim is not just to keep people alive but to give them a life.\" He nodded toward the party of officials from Iran sitting in the assembly. They quickly put on their headphones to hear the translation of what he was saying. Ban praised the nuclear agreement between Iran and six world powers and said he hoped that cooperation would be an example for other countries to follow. Climate change promises, and return to Syria as topic After Obama, Chinese President Xi Jinping took the podium and urged members of the international community to adopt measures to combat climate change. His remarks come a few days after announcing a new cap and trade \"We should firmly pursue green, low-carbon, circular and sustainable development,\" he said. \"China will shoulder its share of responsibility and China will continue to play its part in this common endeavor.\" King Abdullah II of Jordan brought back the topic of instability in the Middle East. His speech focused largely on urging that extremists must be defeated. The peaceful world is under threat from \"the outlaws of Islam,\" he said, who \"target religious differences hoping to kill cooperation and compassion.\" Jordan is among one of the many nations joined with the United States in a coalition to degrade ISIS terrorists. \"Let us ask if they were not defeated,\" he said. \"Can we tolerate a future where mass murder, public beheadings, kidnapping and slavery is a common practice?\" He asked the U.N. members to think for a moment what it would be like to not fight against extremists who would seek to destroy -- as ISIS has -- cultural treasures that had stood for thousands of years. The battle against such terrorists, Abdullah said, is a \"third world war.\" CNN's Richard Roth and Laura Dolan contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from World", "external_links": [], "published": "2015-09-28T21:53:00.000+03:00", "crawled": "2015-09-28T22:24:22.584+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}