{"organizations": ["Congress", "Iran By Adam Kredo Facebook", "Fox News Obama", "Twitter"], "uuid": "b7f71201b666d33b3287d3fcbcf8bd9851ea7a27", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/091415_an_kt_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/18/obama-admin-wont-reveal-to-congress-number-americans-killed-by-iran/", "country": "", "title": "Obama admin won't reveal to Congress number of Americans killed by Iran | Fox News", "performance_score": 10, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama admin won't reveal to Congress number of Americans killed by Iran | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T16:10:00.000+03:00", "replies_count": 0, "uuid": "b7f71201b666d33b3287d3fcbcf8bd9851ea7a27"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/18/obama-admin-wont-reveal-to-congress-number-americans-killed-by-iran/", "ord_in_thread": 0, "title": "Obama admin won't reveal to Congress number of Americans killed by Iran | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama admin won't reveal to Congress number of Americans killed by Iran By Adam Kredo Facebook 0 Twitter 0 Email Print \nThe Obama administration is declining to inform Congress about the number of American citizens and troops killed by Iran and its terror proxies, according to a document provided to Congress and obtained by the Washington Free Beacon. \nThe administration was repeatedly asked by Congress to release figures describing how many Americans and Israelis have been killed by Iran's military and terror activities since the country's 1979 revolution. \nIn a series of on-the-record responses obtained exclusively by the Free Beacon, and provided in written form to Sen. Marco Rubio (R., Fla.), Kerry sidestepped the questions on all of the three separate occasions he was asked to provide the figures. \nThe questions come as the United States prepares to unfreeze more than $100 billion in Iranian assets under the terms of the recently inked nuclear deal. Experts fear the Islamic Republic will funnel the cash windfall into its rogue terror operations and proxy groups. \nLawmakers and experts also have expressed concern about portions of the deal that will lift international sanctions on the Iranian Revolutionary Guard Corps (IRGC), as well as Iranian Supreme Leader Ali Khamenei's financial empire. \nIn the list of questions submitted to Kerry, Rubio asks: \"How many U.S. citizens have been killed by Iran, including by Iran's terrorist proxies, since 1979?\" \nThe secretary of state declined to provide an answer, instead saying that the administration takes the murder of American citizens \"very seriously.\" ", "external_links": [], "published": "2015-09-18T16:10:00.000+03:00", "crawled": "2015-09-18T16:10:48.285+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}