{"organizations": [], "uuid": "3b4e31aaf18471a39c321de54e97a03d07c6d5f2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_090215ndn.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/252504-obama-stares-down-melting-alaska-glacier", "country": "US", "title": "Obama stares down melting Alaska glacier", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama stares down melting Alaska glacier", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T14:35:00.000+03:00", "replies_count": 0, "uuid": "3b4e31aaf18471a39c321de54e97a03d07c6d5f2"}, "author": "The Hill staff", "url": "http://thehill.com/policy/energy-environment/252504-obama-stares-down-melting-alaska-glacier", "ord_in_thread": 0, "title": "Obama stares down melting Alaska glacier", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama stares down melting Alaska glacier By The Hill staff - 09/02/15 07:35 AM EDT \nPresident Barack Obama stared down a melting glacier in Alaska on Tuesday in a dramatic use of his presidential pulpit to sound the alarm on climate change. \nWatch the video above for details. Past: 1 day Special ops brace for release of... \"Relentless Strike,\" a history of the Pentagon's most secret units, hits... Obama on cusp of Iran victory The President is one vote away from securing a major foreign policy goal. Budowsky: Megyn Kelly’s Murrow... OPINION | The problem with the Fox News debate was not Fox, it was Trump. Apple co-founder tells followers... Steve Wozniak gave a boost to Bernie Sanders's presidential campaign on... The difference between Republicans... In Iowa, a former congressman sums up the core — and stark — difference. Feds to treat pope's visit like a... The federal government is urging employees to work from home while the... Trump meets with Hispanic Chamber... Trump sought to mend fences with the prominent Hispanic business leader. Team Carson: Don’t count us out... In national polls, Carson has rocketed into second place, trailing only... Inside Clinton's emails: Boehner... The life of a jet-setting diplomat is rather tame, Clinton's emails... The Hill's Whip List: 33 Dem... Sens. Schumer (N.Y.) and Menendez (N.J.) are the only Dems to publicly... September headache ahead for... The Kentucky Republican is facing an uphill battle to reject Obama’s deal... Hillary confidant rips 'alcoholic... Sidney Blumenthal wrote that the Speaker is \"despised\" by younger, more... Trump pledges to reverse Obama’s... Obama rechristened Mount McKinley the mountain's Native Alaskan name,... Report: Clinton sent info now... Support for Clinton's campaign has been hurt by the server controversy. CNN changes debate criteria The new rules likely will help Carly Fiorina get on the stage. The complicated history of Hillary... Hillary Clinton and Speaker John Boehner's relationship is far from warm... Planned Parenthood fallout puts... Just two clinics now allow women to donate aborted fetal tissue for...", "external_links": [], "published": "2015-09-02T14:35:00.000+03:00", "crawled": "2015-09-02T15:50:57.423+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}