{"organizations": [], "uuid": "f5d1d38261a412021f746ddeb95185f555ba6368", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/28/fernandez-pide-obama-colaboracion-para-encontrar-stiuso/", "country": "", "title": "Fernández pide a Obama colaboración para encontrar a Stiuso | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Fernández pide a Obama colaboración para encontrar a Stiuso | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "f5d1d38261a412021f746ddeb95185f555ba6368"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/28/fernandez-pide-obama-colaboracion-para-encontrar-stiuso/", "ord_in_thread": 0, "title": "Fernández pide a Obama colaboración para encontrar a Stiuso | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Fernández pide a Obama colaboración para encontrar a Stiuso Published September 28, 2015 EFE \nLa presidenta de Argentina, Cristina Fernández, pidió hoy al Gobierno de EE.UU. su cooperación para encontrar al exdirector de operaciones de los Servicios de Inteligencia Antonio \"Jaime\" Stiuso, en relación al atentado de la AMIA, que hoy vinculó también a los \"fondos buitres\". \nFernández de Kirchner describió este atentado, ocurrido en 1994 en la sede de la mutual judía, como \"una telaraña de intereses externos a mí país, en la que como todas la telarañas quedan atrapados los más débiles y los más chicos y los otros permanecen afuera\". \n\"En la investigación por la muerte del fiscal (Alberto) Nisman -que presuntamente tenía pruebas que implicaban a los Kirchner- empiezan a aparecer datos relevantes y estremecedores con servicios secretos externos, con vinculaciones con los 'fondos buitres', no denunciados por esta presidenta sino por miembros de la comunidad judía de nuestro país\", aseguró la mandataria. \nFernández vinculó así a los fondos especuladores que le reclaman el pago de bonos de deuda en mora desde 2001 con el caso AMIA y aseguró que pedirá a Estados Unidos \"explicaciones de en qué calidad se encuentra este exmiembro del servicio secreto de inteligencia argentina acá en Estados Unidos (...), protegido no se sabe muy bien de qué y por quién\". \n\"No podemos seguir utilizando armas, instrumentos de intriga internacional dignos de John le Carré pero antiguos\", dijo. \nCristina Fernández aseguró también que, en el año 2010, \"nos visitó en la Argentina, Gary Samore, en ese entonces principal asesor de la Casa Blanca en materia nuclear\". \n\"Samore le explicó a nuestro canciller Héctor Timerman que estaban en negociaciones para llegar a un acuerdo y que Irán no siguiera enriqueciendo uranio (...) Nos vinieron a pedir que proveyéramos de combustible nuclear a Irán\", dijo. \nLuego explicó que, tras aceptar la petición pero con la condición de que fuera puesta por escrito, nunca más volvieron a saber de Seymour y ahora en 2015 vieron cómo se aprobaba el acuerdo nuclear entre el Grupo 5 + 1 con Irán. \n\"¿Por qué dedico tanto tiempo a este tema? Es mínimo al lado del tiempo que organizaciones pagadas por los 'fondos buitres' han dedicado a este país a criticarnos, a difamarnos como que éramos cómplices del régimen iraní. Si somos cómplices, ¿qué es el presidente (de EE.UU. Barack) Obama entonces?\", prosiguió. \nKirchner había empezado su discurso felicitando a las Naciones Unidas por haber aprobado los nueve principios básicos para la reestructuración de deuda soberana, iniciativa en la que Argentina había participado y que le afecta por su causa abierta con los llamados \"fondos buitres\". \nDe esos nueve principios, destacó el principio de sostenibilidad. \"Cuando una empresa quiebra, cuando no puede pagar sus deudas, en cualquier país, inclusive en este, EE.UU., donde está admitida la quiebra de los municipios, si el 66 % de los acreedores acuerda con el deudor forma y plazos de pago esto se convierte en ley\", resumió. EFE \nmsc/ag/lnm ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-30T11:57:24.026+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}