{"organizations": ["Andrews Air Force Base", "Muslim", "NBC", "CNN", "Catholic Church", "Newsmax TV"], "uuid": "7820f1a67b0510730cd192354aea6089a6742300", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150909094213-huckabee-interview-camerota-newday-00024206-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/09/23/politics/mike-huckabee-barack-obama-christian/index.html?eref=rss_latest", "country": "US", "title": "Mike Huckabee: Obama pretends to be a Christian", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Mike Huckabee: Obama pretends to be a Christian", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T00:19:00.000+03:00", "replies_count": 0, "uuid": "7820f1a67b0510730cd192354aea6089a6742300"}, "author": "", "url": "http://edition.cnn.com/2015/09/23/politics/mike-huckabee-barack-obama-christian/index.html?eref=rss_latest", "ord_in_thread": 0, "title": "Mike Huckabee: Obama pretends to be a Christian", "locations": ["United States", "America", "Washington", "U.S.", "U.S", "Arkansas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francis", "Barack Obama", "Donald Trump", "Trump", "Pope Francis", "Huckabee", "Obama", "Clinton", "Hillary Clinton", "Don Lemon", "Tom Joyner", "Carson", "Mike Huckabee", "Ben Carson", "Don"], "text": "Former Arkansas Gov. Mike Huckabee said President Barack Obama \"pretends to be\" Christian Huckabee also tweeted that Obama should treat Pope Francis better on his first U.S. trip Washington (CNN) Mike Huckabee suggested President Barack Obama \"pretends to be\" a Christian in knocking the President's handling of Pope Francis' first visit to the U.S. When asked on Newsmax TV's \"The Hard Line\" on Tuesday about Ben Carson's comments that a Muslim should not be president of the United States, the former Arkansas governor began by saying there is no religious test for public office, but then shifted to a comment about Obama. \"I'm less concerned about what faith the person has. I'm more concerned about the authenticity of their faith and how that plays out in their politics ... I'm also concerned about a guy that believes he's a Christian and pretends to be and then says he is, but then does things that makes it very difficult for people to practice their Christian faith,\" Huckabee said. \"I'm disappointed if someone says, 'I'm a Christian,' but you invite the pope into your home and then you invite a whole bunch of people who are at odds with the Catholic Church policy. I think there's something very unseemly about that,\" he added. Huckabee also tweeted earlier Tuesday that he was disappointed that Obama was not doing a better job welcoming Francis, despite Obama making a rare trip to Andrews Air Force Base to greet the pope. \"I welcome @Pontifex to America & offer my apologies that @POTUS will not offer him the warm, respectful welcome he deserves #PopeInUS\" Huckabee wrote.\" I welcome @Pontifex to America & offer my apologies that @POTUS will not offer him the warm, respectful welcome he deserves #PopeInUS — Gov. Mike Huckabee (@GovMikeHuckabee) September 22, 2015 Obama's faith has been a topic on the 2016 trail since a supporter at a Donald Trump rally last week said the President was Muslim and not an American, charges that Trump did not dispute. Carson then sparked an uproar of his own on Sunday when he told NBC's \"Meet the Press\" that a Muslim shouldn't be president. RELATED: Ben Carson: U.S. shouldn't elect a Muslim president The controversy even circled back to Hillary Clinton, who, running against Obama in the 2008 primaries, said the then-senator wasn't a Muslim \"as far as I know.\" Pressed by CNN's Don Lemon on \"The Tom Joyner Morning Show\" on Wednesday, Clinton said, \"That is so ludicrous, Don. You know, honestly, I believe -- first of all, it is totally untrue. Secondly, the president and I have never had any kind of confrontation like that.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-09-24T00:19:00.000+03:00", "crawled": "2015-09-24T00:36:36.529+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}