{"organizations": ["Republican", "Congress", "CNN", "CNN Republican"], "uuid": "aa10060bcb640021995a764f2655028bb090e7a9", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/16/politics/republican-debate-barack-obama-doom-gloom-patriotic/index.html", "country": "", "title": "Barack Obama slams Republican debate candidates - CNNPolitics.com", "performance_score": 7, "site": "cnn.com", "participants_count": 0, "title_full": "Barack Obama slams Republican debate candidates - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T20:00:00.000+03:00", "replies_count": 0, "uuid": "aa10060bcb640021995a764f2655028bb090e7a9"}, "author": "", "url": "http://www.cnn.com/2015/09/16/politics/republican-debate-barack-obama-doom-gloom-patriotic/index.html", "ord_in_thread": 0, "title": "Barack Obama slams Republican debate candidates - CNNPolitics.com", "locations": ["America", "Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Obama"], "text": "Panel: Make or break for candidates at CNN debate 05:16 Washington (CNN) As Republican presidential candidates lay into his record, President Barack Obama on Wednesday chalked up the attacks to expected election-year politics but said there was \"nothing particularly patriotic\" about their rhetoric. \"Despite the perennial doom and gloom that I guess is inevitably part of a presidential campaign, America is winning right now,\" Obama said at a meeting of the Business Roundtable in Washington. \"America is great right now. We can do even better.\" He cited job creation, the rising stock market and millions of Americans who now have health insurance as examples of a successful presidential run. RELATED: 7 things to watch at the CNN Republican debate \"You wouldn't know any of this if you were listening to the folks seeking this office that I occupy,\" the President told the group of American chief executives. \"In the echo chamber that is presidential politics, everything is dark and everything is terrible,\" he said. \"They don't seem to offer many solutions to the disasters they perceive, but they're quick to tell you who to blame. There's nothing particularly patriotic or American about talking down America, especially when we stand as one of the few sources of economic strength in the world.\" Obama said it was imperative that Republicans in Congress pass a government spending measure before the end-of-month deadline to avoid a shutdown, calling the standoff over funding for Planned Parenthood \"bad policymaking.\" ", "external_links": [], "published": "2015-09-16T20:00:00.000+03:00", "crawled": "2015-09-16T19:59:49.622+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}