{"organizations": [], "uuid": "487f3ccfede3db49bc8f3d8df9f2f7f87188741c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_4499245947001_092115-hn-fires-1280.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,0,00.rss", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/us/2015/09/22/obama-declares-major-disaster-in-california-wildfire/", "country": "US", "title": "Obama declares major disaster in California wildfire", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama declares major disaster in California wildfire | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "487f3ccfede3db49bc8f3d8df9f2f7f87188741c"}, "author": "Associated Press", "url": "http://www.foxnews.com/us/2015/09/22/obama-declares-major-disaster-in-california-wildfire/", "ord_in_thread": 0, "title": "Obama declares major disaster in California wildfire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 22, 2015 Associated Press Facebook 0 Twitter 0 Email Print \nMIDDLETOWN, Calif. –   President Obama declared a major disaster Tuesday in a Northern California wildfire that has destroyed at least 1,200 homes and killed at least three people.\nThe declaration issued for the fire that broke out in Lake County 90 miles north of San Francisco releases federal money for recovery and cleanup, including grant money for temporary housing and home repairs.\nThe devastating wildfire that started Sept. 12 ranks among California's most destructive and stands at 75 percent contained with 118 square miles scorched. Thousands of people fled their homes at the peak of the fire, and two men remain missing, according to the Lake County Sheriff's Office on Tuesday.\nAuthorities are searching for Robert Litchman, 61, of Middletown and Robert Fletcher, 66, of Cobb.\nSheriff Brian Martin said at a news conference Tuesday that his office had received reports of 15 people missing since the fire started. All have been accounted for except the two men. \"We are hopeful these people are located and returned and reunited with their loved ones,\" he said.\nThe fire has claimed the lives of three people. The body of 72-year-old Barbara McWilliams, who used a walker, was found in her burned-down home. The others who died in the Lake County fire are 69-year-old former newspaper reporter Leonard Neft and 65-year-old Bruce Beven Burns.\nSeveral areas remained under evacuation more than a week after the fire's start as crews continue to clear debris and trees and restore damaged power lines.\nThe presidential disaster declaration allows residents and business owners to apply for grants for repairs and temporary housing as well as apply for low-cost loans for uninsured property.\nCalifornia Gov. Jerry Brown requested disaster declarations for the fire in Lake County as well as another destructive wildfire in Calaveras and Amador counties, about 125 miles east of San Francisco. Federal officials are still working on the request for the other fire, said Kelly Huston, deputy director for the governor's Office of Emergency Services.", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-23T05:17:13.490+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}