{"organizations": ["GOP", "Muslim", "White House", "CNN"], "uuid": "b2b1d17eecde20315801f9f3bb26b1f1c722fe06", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/18/politics/trump-obama-muslim-birther/index.html", "country": "", "title": "Trump's history of suggesting Obama is a Muslim - CNNPolitics.com", "performance_score": 5, "site": "cnn.com", "participants_count": 0, "title_full": "Trump's history of suggesting Obama is a Muslim - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "b2b1d17eecde20315801f9f3bb26b1f1c722fe06"}, "author": "", "url": "http://www.cnn.com/2015/09/18/politics/trump-obama-muslim-birther/index.html", "ord_in_thread": 0, "title": "Trump's history of suggesting Obama is a Muslim - CNNPolitics.com", "locations": ["New Hampshire", "Rochester", "United States", "America", "Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald J. Trump", "Donald Trump", "Trump", "Barack", "Madonna", "Obama"], "text": "MUST WATCH Donald Trump previously mentioned Obama's faith in 2011 00:55 \"We do not have time for this kind of silliness,\" Obama told reporters. \"We've got better stuff to do. I've got better stuff to do.\" Obama's staff posted the birth certificate on the wall of the White House briefing room to serve as a permanent answer to reporters who had additional questions. The certificate is accessible on the White House website. On occasion, the President has turned the tables by lampooning Trump for his statements. During the White House Correspondents' Association dinner in 2011, Obama announced that he would release his official birth video — and then showed the opening scene from \"The Lion King,\" to roars of laughter from the audience. Trump, captured on camera during the dinner, looked unamused -- and refused to relent. In 2012, after Madonna made what she later called an \"ironic\" remark on stage that Obama was \"a black Muslim,\" Trump tweeted, \"Does Madonna know something we all don't about Barack? At a concert she said 'we have a black Muslim in the White House.'\" Does Madonna know something we all don't about Barack? At a concert she said \"we have a black Muslim in the White House.\" — Donald J. Trump (@realDonaldTrump) September 27, 2012 And during a candidate forum in Iowa earlier this year, when asked about Obama's commitment to the United States, Trump replied, \"I don't know if he loves America.\" Questions about whether Trump intentionally encourages his supporters to believe such claims resurfaced at a campaign rally Thursday. Trump is under fire after he didn't correct a supporter who said Obama was not an American and was a Muslim. \"We have a problem in this country. It's called Muslims,\" a man attending Trump's rally in Rochester, New Hampshire, said. \"You know our current president is one. You know he's not even an American.\"\"We need this question,\" Trump said, chuckling. \"This is the first question.\" The man continued: \"We have training camps growing where they want to kill us. That's my question: When can we get rid of them?\" \"We're going to be looking at a lot of different things,\" Trump said. \"You know, a lot of people are saying that and a lot of people are saying that bad things are happening. We're going to be looking at that and many other things.\" After the event, Trump's campaign manager told CNN that the GOP front-runner didn't hear the first part of the man's statement. JUST WATCHED ", "external_links": [], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-19T00:56:03.170+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}