{"organizations": [], "uuid": "e44c511547114b1a49390633e7ca13103391c6bc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/walkerscott07132015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/national-security/252196-walker-world-worse-after-clinton-obama", "country": "US", "title": "Walker: World worse after Clinton, Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Walker: World worse after Clinton, Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T20:07:00.000+03:00", "replies_count": 0, "uuid": "e44c511547114b1a49390633e7ca13103391c6bc"}, "author": "jhattem@thehill.com (Julian Hattem)", "url": "http://thehill.com/policy/national-security/252196-walker-world-worse-after-clinton-obama", "ord_in_thread": 0, "title": "Walker: World worse after Clinton, Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Walker: World worse after Clinton, Obama Getty Images By Julian Hattem - 08/28/15 01:07 PM EDT \nThe world has only become more dangerous, unstable and hostile to American interests in the years since President Obama entered the White House and Hillary Clinton took the reins at the State Department, Wisconsin Gov. Scott Walker (R) charged on Friday. \nThe governor, who has been seeking to bolster his foreign policy bona fides, charged the administration with failing to stem the tide of the Islamic State in Iraq and Syria (ISIS) and emboldening Iran. ADVERTISEMENT In doing so, Walker tied Clinton to Obama’s policies, and made a case for himself as the most “tested” presidential candidate.\n“I have a simple question: Are we safer now than we were seven years ago?” Walker said in a 30-minute speech at South Carolina’s military college, the Citadel. “Sadly, I believe the answer is no, America is not safer.” \n“Everywhere in the world Hillary Clinton has touched is more messed up now than before she and the president took office,” he added. \nWalker focused his barbs on the nuclear deal with Iran, which aims to limit Tehran’s ability to build a nuclear weapon in exchange for the lifting of financial and oil sanctions. \n“If this deal goes forward, it will be remembered as one of the greatest foreign policy failures in U.S. history,” he said, echoing a line of many prominent Republicans. “So let me be clear, if Congress fails to stop the nuclear deal, I will terminate it on Day One.” \nWalker also accused Obama of “barely disrupting” ISIS, and called for a vigorously enforced no-fly zone as part of “a greater investment of U.S. resources.” \n“We need to stop micromanaging the military and broadcasting our limits to our enemies,” he claimed. \nCorrect the Record, a rapid response group aligned with the Clinton campaign, quickly hit back at Walker’s attack. \n\"As a friendly reminder to the governor of Wisconsin, Hillary Clinton enacted the toughest sanctions against Iran in history, rebuilt America's reputation around the world, and fought to make America strong and safe at home through comprehensive immigration reform,” spokeswoman Adrienne Watson said in a statement. \n“Experience breeds wisdom — sadly, Scott Walker continues to raise questions about whether he has either.\" \nWalker, a two-term governor, has been forced into a tricky spot on foreign policy. Though he has had little hands-on experience managing multinational relationships or overseeing armed forces as chief of a landlocked Midwestern state, he has nonetheless expressed a relatively hawkish view. \nThis week, he called for the White House to cancel a visit from Chinese President Xi Jinping over the country's “increasing attempts to undermine U.S. interests.” Days later, however, he was forced to explain his own reluctance to talk tough with Xi when he traveled to China as part of a 2013 trade delegation. \nThe comments follow highly ridiculed remarks earlier this year in which he claimed that his experience battling public sector unions qualified him to take on Islamic extremism. \n\"If I can take on 100,000 protestors, I can do the same across the world,\" Walker said in February. \nOn Friday, Walker attempted to distinguish himself among the crowded flock of GOP contenders. \n“With all of the challenges we face around the globe today, now is not the time for untested leadership. I have been tested like no other candidate in this race,” Walker said. \n“President Reagan believed in achieving peace through strength. I do too, and I will follow his example.” \nThis story was updated at 2:39 p.m. Tags:", "external_links": [], "published": "2015-08-28T20:07:00.000+03:00", "crawled": "2015-08-29T01:14:00.345+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}