{"organizations": [], "uuid": "92a05a7552abd731b4280d7639884fd16d67a420", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d76b1f1400002e002e3a2a.jpeg?cache=VuNdJufzEB", "site_section": "http://www.huffingtonpost.com/tag/fracking/feed", "section_title": "Fracking on Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-shell-arctic-drilling_55d7323ce4b0f593f7f7068f?kvcommref=mostpopular", "country": "US", "title": "Obama Administration Gives Mixed Messages On Climate Change", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Gives Mixed Messages On Climate Change", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T17:41:00.000+03:00", "replies_count": 0, "uuid": "92a05a7552abd731b4280d7639884fd16d67a420"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/obama-shell-arctic-drilling_55d7323ce4b0f593f7f7068f?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Obama Administration Gives Mixed Messages On Climate Change", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Obama Administration Gives Mixed Messages On Climate Change The president allows Shell to drill in the Arctic Ocean, but isn't this inconsistent with his other environmental policies? Jared Greenhouse Post-Production, HuffPost Live Posted: 08/21/2015 02:41 PM EDT | Edited: 2 hours ago \nThe Obama administration gave final approval on Monday to Shell to resume exploratory drilling for oil in the Arctic Ocean for the first time since 2012. Environmentalists are worried that this decision might upset the Arctic ecosystem and increase greenhouse gas production. They are also confused by the president's choice , since he has made such an effort to leave the White House with a legacy of climate change progress. \nJennifer Dlouhy , an energy reporter at the Houston Chronicle, talked with HuffPost Live on Thursday to discuss the tricky position Obama was in when he allowed this possibly harmful drilling to continue in the Arctic Ocean. \n\"I think it's a mix of policy,\" Dlouhy told Caroline Modarressy-Tehrani . \"On the one hand, he wants to make oil and gas extraction cleaner. He wants to curb the the greenhouse gas emissions related to the production and transmission of natural gas. But he recognizes that we are kind of bound to this fossil fuel at least for a few more decades, even if we move swiftly to alternatives and renewable power.\" \n﻿Watch Dlouhy discuss the reasoning behind Obama's decision in the video above, and click here for the full segment on the implications of allowing Shell to drill for oil in the Arctic Ocean. \nSign up here for Live Today, HuffPost Live's new morning email that will let you know the newsmakers, celebrities and politicians joining us that day and give you the best clips from the day before! \n﻿ ﻿ ﻿ ﻿Also on HuffPost: Gisele Bündchen sends out an SOS for World Environment Day \"Are you ready?\" Julia Roberts is the voice of Mother Earth. \"Nature doesn't need people. People needs nature.\" 'Save the Rhinos' starring Jackie Chan. \"Please tell your friends and relatives never buy products made from Rhino horns.\" Catching Rain \"Rainwater belongs to each of us, but how do we catch and share?\" Severn Suzuki, 9, speaking at UN Earth Summit 1992 \"I am fighting for my future.\" Boy Genius: How the Oceans Can Clean Themselves Boyan Slat was 17 when he invented a machine that would clean up the earth's oceans of plastic in five years. Slat, along with his friend Nguyen Tan are taking his ambitious project to the ocean in 2016. Hear his Ted Talk. Kathy Jetnil-Kijiner from the Marshall Islands recites a poem at the climate change summit in New York \"No one is losing their homeland, no one is becoming climate change refugee, no one else.\"", "external_links": [], "published": "2015-08-21T17:41:00.000+03:00", "crawled": "2015-08-22T00:31:22.540+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}