{"organizations": [], "uuid": "2778499a2cda14ff034114fb901a377ebbabee8b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/needle640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/health/2015/08/31/dr-manny-why-anti-abortion-views-arent-strong-enough-argument-for-vaccine/", "country": "US", "title": "Dr. Manny: Why anti-abortion views aren’t a strong enough argument for vaccine exemption", "performance_score": 0, "site": "foxnews.com", "participants_count": 8, "title_full": "Dr. Manny: Why anti-abortion views aren’t a strong enough argument for vaccine exemption | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 11, "uuid": "01e6b1570a62bbbeaf2b8be8b59670f1a7a5853e"}, "author": "Manny Alvarez", "url": "http://www.foxnews.com/health/2015/08/31/dr-manny-why-anti-abortion-views-arent-strong-enough-argument-for-vaccine/#post-0", "ord_in_thread": 0, "title": "Dr. Manny: Why anti-abortion views aren’t a strong enough argument for vaccine exemption", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Dr. Manny Alvarez\n FoxNews.com livefyre Email Print\nIn light of the recent revelations that Planned Parenthood has allegedly been caught participating in the sale of fetal parts to biotechnology companies, I can understand that parents may be concerned that some children’s vaccines, especially the measles/mumps/rubella (MMR) vaccine, are partly manufactured using human cell lines from aborted fetuses.\nWith the graphic coverage and leaked footage that has come out from the Center for Medical Progress, I can see how a person’s views on abortion may have shifted. However, to change your stance on vaccines based on these revelations would be a grossly misinformed decision.\nI recently read the news that a New York Russian Orthodox mother won the right to exempt her son from getting the school-mandated MMR vaccine while citing her moral opposition to abortion. This is a mistake.\nAllow me to first explain what actually goes into manufacturing these vaccines.\nWell over 50 years ago, human cells from elective aborted fetuses were created and controlled by the FDA for the purpose of research. Many research projects over the last half century have been conducted and completed by using these cell lines that were established and have since re-cultured themselves over and over again.\nWhen it comes to vaccines, many of the viruses, especially rubella, hepatitis and rabies, which affect humans, can only be cultured in human cell lines in order to create the mechanisms of vaccine activation. As I said, these cell lines have been multiplied over and over again, so when you look at the final product of the resulting vaccine, there are just perhaps infinitesimal amounts of DNA fragments from those aborted human cells.\nIt would be impossible for human research to be conducted if we did not have human cells to experiment on. Having said that, it’s a far stretch to utilize an anti-abortion position in seeking exemption, and completely disregard all of the overwhelming benefits that these vaccines bring to the prevention of illness in children and adults as well.\nMany religious leaders are not against vaccinations, and many understand that scientific research and the discoveries of new treatments for the prevention of diseases are quite vital and necessary because it preserves the unity of the human body in this planet, which at the end of the day is a noble cause.\nI think that citing religious exemption in this particular case was not strong enough to reverse the initial rejection by the city’s Department of Education. While I understand that everybody has a right to choose what’s best for their child, I believe this mother perhaps was poorly informed. I think that we must all understand that science is part of God’s will, and I do believe that we have to maintain a very strong moral compass in the quest for cures.\nFollow Dr. Manny on Facebook and subscribe to his YouTube channel for more.\nDr. Manny Alvarez serves as Fox News Channel's Senior Managing Editor for Health News. Prior to this position, Alvarez was a FNC medical contributor. Click here more information on Dr. Manny's work with Hackensack University Medical Center . Visit AskDrManny.com for more.", "external_links": ["https://www.youtube.com/subscription_center?add_user=askdrmanny", "http://www.facebook.com/DrManny"], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-09-01T02:13:51.948+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}