{"organizations": [], "uuid": "48ebb9f5140dd5de189ed49f8f11c419d08e0bce", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/083015_foxreport_mckinley_640.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,0,00.rss", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/08/31/obama-to-rename-mt-mckinley-to-denali-during-alaska-trip-that-focuses-on/", "country": "US", "title": "Ohio lawmakers slam Obama plans to rename Mt. McKinley 'Denali' during Alaska trip", "performance_score": 10, "site": "foxnews.com", "participants_count": 9, "title_full": "Ohio lawmakers slam Obama plans to rename Mt. McKinley 'Denali' during Alaska trip | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 16, "uuid": "1d86a7d67dac87466da9958dedb73ba9f91a46af"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/08/31/obama-to-rename-mt-mckinley-to-denali-during-alaska-trip-that-focuses-on/#post-0", "ord_in_thread": 0, "title": "Ohio lawmakers slam Obama plans to rename Mt. McKinley 'Denali' during Alaska trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 31, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print \nOhio lawmakers reacted angrily Sunday to the White House's announcement that President Obama would formally rename Alaska's Mt. McKinley — North America's highest peak — \"Denali\" during his trip to The Last Frontier this week.\n\"Mount McKinley ... has held the name of our nation's 25th President for over 100 years,\" Rep. Bob Gibbs, R-Ohio, said in a statement. \"This landmark is a testament to his countless years of service to our country.\" Gibbs also described Obama's action as \"constitutional overreach\", saying that an act of Congress was required to rename the mountain because a law formally naming it after McKinley was passed in 1917.\n\"This political stunt is insulting to all Ohioans, and I will be working with the House Committee on Natural Resources to determine what can be done to prevent this action,\" Gibbs said.\nThe Ohio delegation's disappointment at the decision cut across party lines. \n\"We must retain this national landmark's name in order to honor the legacy of this great American president and patriot,\" Democratic Rep. Tim Ryan, whose district includes McKinley's hometown of Niles, in eastern Ohio.\nSen. Rob Portman, R-Ohio, also blasted the decision as \"yet another example of the President going around Congress\", while House Speaker John Boehner said the naming of the mountain after McKinley was \"a testament to [the 25th president's] great legacy .. I am deeply disappointed in this decision.\nThe state of Alaska has had a standing request to change the name to \"Denali\"  — a native Athabascan word meaning \"the high one\"  — dating back to 1975, when the legislature passed a resolution and then-Gov. Jay Hammond appealed to the federal government.\nBut those efforts and legislation in Congress have been stymied by members of Ohio's congressional delegation. Even when Mount McKinley National Park was renamed Denali National Park in 1980, the federal government retained Mount McKinley as the name of the actual peak, which rises 20,320 feet above sea level.\n\"With our own sense of reverence for this place, we are officially renaming the mountain Denali in recognition of the traditions of Alaska Natives and the strong support of the people of Alaska,\" said Interior Secretary Sally Jewell.\nThe White House cited Jewell's authority to change the name, and Jewell issued a secretarial order officially changing it to Denali. The Interior Department said the U.S. Board on Geographic Names had been deferring to Congress since 1977, and cited a 1947 law that allows the Interior Department to change names unilaterally when the board fails to act \"within a reasonable time.\" The board shares responsibility with the Interior Department for naming such landmarks.\nIn 1896, a prospector in the mountains of central Alaska named the range after William McKinley upon learning that he had been nominated as a candidate for U.S. president. \nMcKinley became the country’s 25th president and was assassinated in 1901, six months into his second term. The 20,000-foot-tall peak had been previously known as Denali -- generally believed to be central to the Athabascan tribe's creation story and the site of significant cultural importance to many Alaska natives, according to the White House. \nDenali also is an Athabascan word meaning \"the high one\" and is widely used across the state today, according to the White House.\nSen. Lisa Murkowski, R-Alaska, who had pushed legislation for years to change the name, said Alaskans were \"honored\" to recognize the mountain as Denali.\n\"I'd like to thank the president for working with us to achieve this significant change to show honor, respect, and gratitude to the Athabascan people of Alaska,\" Murkowski said in a video message recorded atop the mountain's Ruth Glacier, with cloudy snow-capped peaks behind her.\nObama will not personally visit the peak during his stay in Alaska, which runs through Wednesday. He'll spend much of the trip in Anchorage, south of the peak, where he will attend a State Department-sponsored meeting on climate change, titled GLACIER/Global Leadership in the Arctic Conference.\nThe conference will bring together foreign ministers of Arctic nations and key non-Arctic states with scientists, policymakers and stakeholders from Alaska and the Arctic, the White House said.\n“The Arctic is warming twice as fast as the rest of the world and is experiencing the consequences,” the White House also said Sunday.\nSupporters of the global warming theory say those changes include higher average temperatures and less winter sea ice, which is allowing for heavy storm surges that the sea ice once kept at bay, the White House said.\nOn Monday, Obama is scheduled to meet with leaders from the Alaska native community along with Gov. Bill Walker, Lt. Governor Byron Mallott and Murkowski to discuss ways to strengthen cooperation between the federal government and Alaska native tribes. Among the issues scheduled to be discussed is management strategies for fish and wildlife.\nThe Associated Press contributed to this story.", "external_links": [], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-08-31T12:06:46.454+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}