{"organizations": [], "uuid": "f4e805e9aa25dbff73e2258d7370360f442c03ae", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/oreilly_PlannedParenthood_081215.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,0,00.rss", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/08/21/anti-abortion-group-releases-video-snippet-after-court-win/", "country": "US", "title": "Anti-abortion group releases video snippet after court win | News", "performance_score": 5, "site": "foxnews.com", "participants_count": 10, "title_full": "Anti-abortion group releases video snippet after court win | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 11, "uuid": "1a6fa18910da35c8514e71e71191de8d9749c78a"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/08/21/anti-abortion-group-releases-video-snippet-after-court-win/#post-0", "ord_in_thread": 0, "title": "Anti-abortion group releases video snippet after court win | News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 21, 2015 Associated Press Facebook 0 Twitter 0 livefyre Email Print \nLOS ANGELES –   An anti-abortion group released a snippet of video on Friday showing a California company executive discussing fetal tissue for research after a judge ruled the group could show the footage even if it was illegally recorded.\nLos Angeles Superior Court Judge Joanne O'Donnell rejected efforts by StemExpress to block the videos, though she said the company likely will prevail in its lawsuit claiming its privacy was violated by an anti-abortion activist posing as a biomedical company employee.\nThe company that provides blood, tissue and other biological material for medical research said it was considering an appeal, but the little-known Center for Medical Progress didn't hesitate to preview its latest covert video targeting organizations that trade in fetal tissue.\nThe Irvine, California-based anti-abortion group reignited the abortion debate after releasing undercover videos last month of Planned Parenthood officials discussing aborted fetal organs it provides for research.\nAbortion opponents said the video showed Planned Parenthood was illegally harvesting and selling the organs. Planned Parenthood said it did nothing wrong and the videos were deceptively edited to support extremists' false claims.\nFervent reaction to the videos prompted members of Congress to try to kill funding for Planned Parenthood, which provides health services to women such as birth control, sexual-disease screening and abortions. It has also led to calls for investigations of the center and of Planned Parenthood.\nPlacerville-based StemExpress, which got some of its fetal tissue from Planned Parenthood, was drawn into the controversy when its chief executive and general counsel met in May at a Northern California restaurant with two representatives of the phony Biomax Procurement Services.\nIt was a ruse orchestrated by the center's leader, David Daleiden, who posed as \"Robert Sarkis\" to secretly record the conversation.\nIn a 10-second clip included in a highlights reel, StemExpress Chief Executive Officer Catherine Dyer can be seen discussing liver tissue.\nThe Center for Medical Progress said the excerpt showed her discussing intact fetuses, though she never used that term in the snippet or in a nearly three-minute clip provided by StemExpress.\nStemExpress said the clip was misleading and the entire discussion was about livers, which are highly sought by medical researchers. \"StemExpress has never requested, received or provided to a researcher an 'intact fetus,'\" the company said.\nThe company, which broke ties with Planned Parenthood last week, said the videos were illegally obtained because they weren't notified they were being recorded and the company's right to privacy was violated.\nReleasing video would draw the company and Dyer \"deeper into the vortex of public animosity stirred up by CMP's crusade to brand everyone associated with Planned Parenthood as evil criminals,\" the company said in court papers.\nDyer said the company's connection to Planned Parenthood led to violent threats and forced her to hire a security team.\nStemExpress won a temporary restraining order last month, but O'Donnell said Friday that the center's First Amendment rights to release the videos trumped the company's right to block them under privacy claims.\nThe judge said she couldn't tell who was telling the truth the confidentiality of the May meeting, but she said the fact Daleiden concealed his identity and secretly recorded the conversation made his account less believable.\nO'Donnell rejected the center's argument that the secret recordings were legal under an exemption that allows such subterfuge if someone believes they are gathering evidence of a crime. \"Defendants' apparent ideological conviction that fetal tissue procurement is a violent felony does not, without more, rise to the level of a 'reasonable belief,' \" O'Donnell wrote.\nWhile O'Donnell said StemExpress would probably prevail in its privacy lawsuit, the center's lawyer said that statement was based on little evidence.\nAttorney Charles LiMandri said the recordings will show Dyer had no expectation of privacy in a public restaurant where a diner sat nearby and waiters interrupted the meal.\n\"I'm very pleased that justice was done and that my client is in a position to release the video,\" LiMandri said. \"The constitution is vindicated, and the truth will be shown.\"\nThe Los Angeles case is one of two the anti-abortion group is facing in California.\nA federal judge in San Francisco who temporarily blocked the center from releasing recordings it secretly gathered at annual meetings of National Abortion Federation is scheduled next Thursday to consider a permanent injunction.", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-22T05:43:33.989+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}