{"organizations": [], "uuid": "be1f06484f3348a0cf6d9eaeb64bbd7e71265791", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1382491/images/o-STATUE-OF-LIBERTY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/politics/feed", "section_title": "Politics on Huffington Post", "url": "http://www.huffingtonpost.com/mike-shammas/from-a-recipient-of-birth-citizenship_b_8032428.html", "country": "US", "title": "Michael Shammas: From a Recipient of Birthright Citizenship: Immigration Made America Great, Because Immigrants Are Us", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Michael Shammas: From a Recipient of Birthright Citizenship: Immigration Made America Great, Because Immigrants Are Us", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T16:04:00.000+03:00", "replies_count": 0, "uuid": "be1f06484f3348a0cf6d9eaeb64bbd7e71265791"}, "author": "Michael Shammas", "url": "http://www.huffingtonpost.com/mike-shammas/from-a-recipient-of-birth-citizenship_b_8032428.html", "ord_in_thread": 0, "title": "Michael Shammas: From a Recipient of Birthright Citizenship: Immigration Made America Great, Because Immigrants Are Us", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nWhat an unlikely, an incredibly precious, human life we all have. The thin container wrapping that life -- its color, its gender, its religious claims and political delusions ... that container is nothing next to the one exquisite and inexplicable miracle: the one life, breathing and hoping and pulsing against the container, valuable in itself. Truly it is the greatest crime, to stifle a thing so precious. \nYet within its container, that consciousness -- that life -- thrives or shrivels to the extent that its environment is rich or decrepit, peaceful or violent. Too many places on this earth are trash heaps of wrenching poverty, or of violence that sizzles over pools of hatred too deep for many Americans to comprehend. \nComing from a place torn by a civil war fought by \"religious\" maniacs , my parents understood the dark depths of those pools too well. More than two decades ago they, like so many, did something very brave: They left their home country -- Lebanon -- in search of a better life in the United States. Because America had many things Lebanon, at the time, did not: Rule of law, peace, opportunity for true career advancement, immunity from sporadic terrorist attacks or regular invasions. \nBeing peaceful and rather secular Eastern Orthodox Christians in a country where being peaceful and minding your own religious business had fallen out of fashion long ago, they gave up all they had previously known -- Lebanon's beautiful Mediterranean climate, its food, its warm and ancient culture -- in order to do one thing: To find a place where life grows rather than shrivels. That reality arrived when they reached the U.S., in their case legally , which for its faults is a heck of a lot more fertile with opportunities than far too many other countries on this earth. \nLike most of the immigrants coming into the United States from Mexico and other Latin American countries, legally or illegally, my parents have repaid the chance to live in an environment where life is allowed to grow rather than be shriveled, slowly but surely, by cycles of hunger or hatred or violence. They've made positive contributions to this country since the moment they arrived. The compound effect of their positive contributions, of the positive contributions made by hundreds of thousands of other immigrants, are readily discernible to anyone living in the United States. Because the United States is entirely a product of immigration. \nAmericans are all the products of immigrants. Some -- Puritans seeking religious freedom in New England, refugees of the Holocaust seeking asylum -- found an environment that enabled their lives to grow in wondrous ways, now that the shade of whatever injustice pervading their former homeland was replaced by sunlight. For others, like the black slaves sold and forced here in bonds of blood and chains, immigration had the reverse effect: oppressed slaves found themselves immigrating, against their will, into an environment that stifled all and any attempts at life. And, of course, Old World immigration unleashed devastating effects -- through disease, through war -- on the Native Americans who had arrived in the Americas thousands of years before. \nStill. Whether we are descended from majority who came here willfully and found a better life, or from the many who came here unwillingly and lived lives of destitution and terror, the fact remains: We are all transplants, all the descendants of immigrants who, whether they found it or not, desired to have a flourishing and not a withering life. \nThat's what allows us to create bonds that transcend religion and race, ideology and culture, unlike other nations, places like Syria, that are tragically balkanized to the core. Our common identity as immigrants is a social superglue. \nNone of us, excepting Native Americans, can assert an exclusive ethnic claim to the Americas. \nYet descendants of immigrants like Donald Trump have, for years and years now, been engaged in a ruthless campaign of demonization against the hardworking men and women fleeing across our southern border (which we annexed from Mexico) in search of a better life for themselves and their children. Descendants of people fleeing Europe due to oppression are criticizing refugees fleeing Central America due to oppression -- from drug cartels, from hardened governments, from harsh economic realities. We are supposed to believe that this opposition comes from outrage at illegal immigration, rather than from nativist (and perhaps racist) outrage at the undocumented immigrants themselves. Please. If undocumented immigrants, many of them refugees, were coming from, say, Norway and Canada instead of Mexico and Guatemala, who would dare have the temerity to suggest the outrage levels would be remotely the same? We have to protect our borders, yes. We have to reform immigration responsibly, yes. But in the process, let's not forget that the subjects and objects of this great inquiry our country is now embarking on -- immigration reform -- are fellow humans , fellow immigrants just like your ancestors, just like my parents. Whether or not you ultimately wish to welcome undocumented immigrants into the fabric of America, as I believe we should, at least agree to treat these people as humans instead of trash to be flushed from our country like a virus. Because unless you're Native American, your ancestors were recently immigrants, and they may have come for similar reasons as the Central American immigrants clambering over the border today: To secure a life of flourishing for themselves and their children. \nAs the privileged beneficiary of immigration -- of the life I have now because my parents made the decision to come here decades ago -- I would not dare judge anyone for wishing to find a semblance of the same security and opportunity I now enjoy. \nImmigrants are humans. And immigrants are us, Americans -- all of us. More:", "external_links": [], "published": "2015-08-27T16:04:00.000+03:00", "crawled": "2015-08-27T20:24:50.721+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}