{"organizations": [], "uuid": "d90713d8439aa49373977e807deb18e6603d5013", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150820164644-iran-deal-nuclear-inspections-sciutto-dnt-lead-00013414-large-169.jpg", "site_section": "http://us.cnn.com/", "section_title": "Breaking News, U.S., World, Weather, Entertainment &amp; Video News - CNN.com", "url": "http://www.cnn.com/2015/08/21/politics/obama-iran-nuclear-deal-nadler-letter/index.html", "country": "US", "title": "Obama: Will use 'whatever means are necessary' to keep Iran from a nuclear bomb - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Obama: Will use 'whatever means are necessary' to keep Iran from a nuclear bomb - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "d90713d8439aa49373977e807deb18e6603d5013"}, "author": "Ben Brumfield", "url": "http://www.cnn.com/2015/08/21/politics/obama-iran-nuclear-deal-nadler-letter/index.html", "ord_in_thread": 0, "title": "Obama: Will use 'whatever means are necessary' to keep Iran from a nuclear bomb - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights The President sent a strategic letter to a Democratic Jewish lawmaker on the fence about the Iran deal Rep. Jerrold Nadler feels he must decide between the lesser of two evils Prominent Jewish Democrats have come down against the deal (CNN) To counter nail biting on Capitol Hill over the Iran nuclear deal, particularly nerves frayed over Israel's security, President Obama delivered a message this week: All options are still on the table.\nIn a way, it was a repeat message. But this time, it was also a strategic blow to the chisel chipping at resistance against the deal within his own party.\nThe President directed it at Rep. Jerrold Nadler of New York in an open letter with Wednesday's date. But it addressed many questions on the minds of many legislators in one written piece. A day earlier, Obama also penned an editorial backing up his arguments and distributed it to news organizations.\nUnlike some other Democratic legislators, like Sen. Charles Schumer who came out against the deal, Nadler doesn't know yet how he'll vote, though he has publicly agonized over the process of considering which way to go.\n\"What I do know is that no member of Congress should take this decision lightly,\" he wrote this month in an op-ed for the Jewish Telegraphic Agency. Nadler's priority in his vote is the security of the United States and of Israel, its loyal ally.\n'Including military means'\nJUST WATCHED Webb: Obama is wrong about Iran nuclear deal Replay More Videos ... MUST WATCH\nWebb: Obama is wrong about Iran nuclear deal 03:55 Obama left no doubts about how far he'd go to keep Iran from a nuclear weapon.\n\"As I have repeatedly emphasized, my Administration will take whatever means are necessary to achieve that goal, including military means,\" he wrote to Nadler.\nThis goes for \"the life of the deal and beyond,\" the letter read. The President dedicated paragraphs to avowing the financial and strategic muscle his administration has put behind Israel's defense.\nIn the tug-of-war for legislative sign-off on the Joint Comprehensive Plan of Action -- the name for the anti-nuke deal -- Nadler could be seen as the red mark in the middle of the rope.\nHis congressional district covers much of Manhattan and a chunk of Brooklyn and has one of the country's largest Jewish constituencies. It also includes the area of the World Trade Center, the main site of the September 11, 2001, terror attacks.\nBut despite tremendous pressure in the 9/11 aftermath -- including from Israel -- to go along with the Iraq war effort, Nadler voted against \"the Bush administration's crusade against Saddam Hussein,\" he wrote in his op-ed. \"I was the only Jewish member in the New York delegation to go against the president.\"\nIn retrospect, he is proud of his opposition. He has said he will, once more, not succumb to pressure. And both sides are applying it with might.\nObama vs. Netanyahu\nJUST WATCHED Sen. Menendez: Iran deal is 'aspirational' Replay More Videos ... MUST WATCH\nSen. Menendez: Iran deal is 'aspirational' 05:19 The Obama administration is tugging hard at one end; on the other pulling against him are Republicans and Israeli Prime Minister Benjamin Netanyahu, who has done the political equivalent of jumping up and down and yelling.\nHe has visited Capitol Hill to hold a speech against the deal -- seen by many as an affront to President Obama. Groups of U.S. legislators have gone to Israel to visit Netanyahu.\nAnd a major Jewish lobbying group, the American Israel Public Affairs Committee, has thrown its full weight behind Netanyahu.\n\"From our perspective, this is one of the most significant mobilization efforts in our organization's history,\" an AIPAC official said.\nTo counter its opponents' efforts, the Obama administration has developed an outreach playbook dozens of pages long.\nNadler is a target of that outreach, and it got him an individual meeting with the President. That's special. Obama has a reputation of not doing much personal outreach.\nBad signs\nJUST WATCHED Obama: U.S. credibility on the line with nuclear deal Replay More Videos ... MUST WATCH\nObama: U.S. credibility on the line with nuclear deal 03:24 If either side can sway Nadler, it could give the impression that the rope is inching their way.\nThere have been some bad signs for the President in winning support for his foreign policy legacy deal.\nA similar outreach target, Rep. Eliot Engel, a liberal from the Bronx, who is also Jewish and the ranking Democrat of the House Foreign Affairs Committee, came down against the deal when Sen. Schumer did.\nA day before the President sent his letter to Nadler, another Democrat, Sen. Robert Menendez, came out publicly against the deal .\nAnd Nadler has already said that he sees his vote as a choice between the lesser of two evils.\n\"Whichever decision Congress makes, Israel's security will be at risk. Approving the agreement may place Iran in a better position to support Hezbollah and Hamas in their terrorist campaigns, while disapproving the deal could swiftly put Iran back on course for a nuclear breakout time line even shorter than the current two to three months,\" he wrote.\nNagging questions\nAnd Nadler still has serious questions about the deal:\n- How will the world keep Iran away from the bomb when the 15-year deal runs out and the sanctions are long gone?\n- How will Washington deal with Iran's possible increased support of terror organizations, when dropping the sanctions boosts its economy?\n- What is the punishment if Iran makes small to middling infractions against the agreement?\nThe President's open letter appeared to address those questions. And it outlines what the administration might do outside the framework of the Iran agreement to deal with issues that arise.\nBut the question now is, will his arguments convince Nadler and like-minded lawmakers?\nPresident Obama and Secretary of State John Kerry tout the JCPOA as the best possible option to prevent Iran from getting a nuclear weapon. And at this point the only one.\nIf lawmakers vote to scrap his deal, President Obama could veto that, but it's an ugly option.\nThe Administration labored through 18 months of diplomatic tug-of-war with Iranian negotiators to reach the JCPOA. Getting enough Democrats to tow the line on Capitol Hill is also proving a challenge.", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150820220004-exp-iran-inspections-webb-intv-erin-00000428-full-169.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150820220004-exp-iran-inspections-webb-intv-erin-00000428-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150809134539-obama-iran-deal-us-credibility-intv-zakaria-gps-00013723-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150408212914-era-bob-menendez-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150809134539-obama-iran-deal-us-credibility-intv-zakaria-gps-00013723-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150408212914-era-bob-menendez-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150408212914-era-bob-menendez-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150820220004-exp-iran-inspections-webb-intv-erin-00000428-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150820220004-exp-iran-inspections-webb-intv-erin-00000428-large-169.jpg", "http://nadler.house.gov/press-release/op-ed-careful-analysis-not-political-pressures-should-sway-iran-vote", "http://i2.cdn.turner.com/cnnnext/dam/assets/150408212914-era-bob-menendez-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150820220004-exp-iran-inspections-webb-intv-erin-00000428-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150408212914-era-bob-menendez-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150408212914-era-bob-menendez-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150809134539-obama-iran-deal-us-credibility-intv-zakaria-gps-00013723-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150809134539-obama-iran-deal-us-credibility-intv-zakaria-gps-00013723-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150820220004-exp-iran-inspections-webb-intv-erin-00000428-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150809134539-obama-iran-deal-us-credibility-intv-zakaria-gps-00013723-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150809134539-obama-iran-deal-us-credibility-intv-zakaria-gps-00013723-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150809134539-obama-iran-deal-us-credibility-intv-zakaria-gps-00013723-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150408212914-era-bob-menendez-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150820220004-exp-iran-inspections-webb-intv-erin-00000428-super-169.jpg", "http://www.nj.com/opinion/index.ssf/2015/08/president_obama_iran_nuclear_deal_regardless_of_wh.html"], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-21T14:02:20.051+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}