{"organizations": [], "uuid": "779cb7b9b0c518355888d1307cbd39568bb67305", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3377548/images/o-OBAMA-ALASKA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/09/03/obama-dulces-propina-alaska_n_8083600.html", "country": "", "title": "Obama pidió todos los dulces y dejó una buena propina", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama pidió todos los dulces y dejó una buena propina", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T19:56:00.000+03:00", "replies_count": 0, "uuid": "779cb7b9b0c518355888d1307cbd39568bb67305"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/09/03/obama-dulces-propina-alaska_n_8083600.html", "ord_in_thread": 0, "title": "Obama pidió todos los dulces y dejó una buena propina", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "\n\"¡Me llevo todos esos!”, fue la reacción de Barack Obama cuando hizo su pedido en una pastelería en su reciente viaje a Alaska. \nEl presidente demostró que gusta de los cinnamon rolls (panes con canela) y no dudó en pedir todos los que habían salido del horno en Snow City Cafe, uno de los sitios más populares en el downtown de Anchorage. \nPero, no le bastó con eso, y se dirigió a los periodistas que le acompañaban en su recorrido para preguntarles si querían algo más: “¿Café?”. \nEl presidente pagó con un billete de 50 dólares la cuenta de $18.15 y dejó más de $30 dólares de propina. \nEntre los detalles más curiosos que se filtraron, después de la visita de Obama a la pastelería, figura que los dueños del local se habían preparado para la posible visita presidencial y habían incluido en su menú una ensalada de kale , especialidad del chef … pero Obama se fue por una opción más simple y apetitosa. \nLa ensalada, nombrada \"Kale to the Chief” (\"Kale para el Jefe\"), permanecerá en el menú por el resto de la semana, aunque Obama no la haya probado. \nEl presidente viajó esta semana a la remota región con el fin de alertar acerca del drástico impacto que está teniendo en esta zona el cambio climático. \n>>>MIRA AQUÍ LAS FOTOS DE OBAMA EN LA PASTELERÍA: MANDEL NGAN via Getty Images Pidió panes de canela para todo el equipo que le acompañaba. MANDEL NGAN via Getty Images También probó el helado de la casa. MANDEL NGAN via Getty Images Y se lo llevó para saborearlo. MANDEL NGAN via Getty Images Conversó con dos niñas que se encontraban en la pastelería. MANDEL NGAN via Getty Images El presidente parecía indeciso a la hora de escoger su helado. MANDEL NGAN via Getty Images Pero se decidió. MANDEL NGAN via Getty Images Esos ojos lo dicen todo. ASSOCIATED PRESS ", "external_links": [], "published": "2015-09-03T19:56:00.000+03:00", "crawled": "2015-09-03T19:56:22.098+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}