{"organizations": [], "uuid": "ca7be23dac4c284e4b87726f5c7d0b529b2238a4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/082515_yw_scott_640.jpg", "site_section": "http://www.foxnews.com/yourworld/", "section_title": "Your World with Neil Cavuto | Fox News", "url": "http://www.foxnews.com/transcript/2015/08/25/sen-scott-on-obama-calling-iran-deal-opponents-crazies/", "country": "US", "title": "Sen. Scott on Obama calling Iran deal opponents 'crazies'", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Sen. Scott on Obama calling Iran deal opponents 'crazies' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "ca7be23dac4c284e4b87726f5c7d0b529b2238a4"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/08/25/sen-scott-on-obama-calling-iran-deal-opponents-crazies/", "ord_in_thread": 0, "title": "Sen. Scott on Obama calling Iran deal opponents 'crazies'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 25,\nThis is a rush transcript from \"Your World,\" August 25, 2015. This copy may not be in its final form and may be updated.\nSTUART VARNEY, GUEST HOST: After the president calls opponents of his Iran deal crazies, the White House is now saying he may have been -- Quote: -- \"a little too flip.\"\nIs that enough for South Carolina Republican Senator Tim Scott?\nHe was maybe calling you, Mr. Senator, crazy. You happy with that walk back?\nSEN. TIM SCOTT, R-S.C.: Well, I'm not, actually, because not only was he calling me crazy. He was also calling the American people -- more than 50 percent of Americans do not like this deal, so I guess he was referring to the American public as crazy.\nI will tell you what is crazy, not who is crazy. It is crazy to believe that you can make a good deal with Iran. It is crazy to believe that self- inspections, allowing Iran to self-inspect, has any grain of common sense.\nWhat is crazy is to listen to the leaders in Iran, the ayatollahs, say death to America, and think you can make a good deal with them. It is crazy for us to allow for there to be a $100 billion signing bonus, five years later having an arms embargo lifted, eight years later ballistic missiles, and then 10 years later a fast path to a nuclear weapon.\nThat is crazy. But calling those of us who believe that this deal is bad crazy is inappropriate.\nVARNEY: Can you block it? Senator, can you block it?\nSCOTT: I hope that we can. I hope that we can.\nI think we are still gaining momentum. We certainly have to continue to talk to our friends on the left. We have to make sure that people understand what's in the deal. The more you understand the deal, the less you like it.\nVARNEY: Can you block this? President Obama wants to shift some Gitmo prisoners to I think the Navy brig in Charleston, South Carolina.\nSCOTT: Yes.\nVARNEY: What do you think to that, and can you block it?\nSCOTT: For heaven's sake, how is it a good idea to ever bring an combatant to American soil unnecessarily?\nThe Hanahan brig in Charleston is less than a couple of minutes away from schools. Think about it this way. It is already against the law of our country to bring enemy combatants, these terrorists from Gitmo, to America, and yet the president and his team at DOD are analyzing the feasibility of transferring these detainees to Charleston or Leavenworth and other locations around the country that are not military installations.\nThat -- I can't understand any rationale that would put our lives in danger by bringing those enemy combatants to America.\nVARNEY: And, Mr. Senator, there is a new poll from Monmouth University that has Trump surging in South Carolina, your state, 30 percent to Trump. Lindsey Graham has 4 percent.\nWhen he heard that news, Donald Trump tweeted this -- I'm going to Quote: directly -- \"Congratulations, Lindsey Graham. You just got four points in your home state of South Carolina, far better than zero nationally. You're only 26 points behind me.\"\nThat sounds a little harsh to your fellow Republican South Carolina senator. What do you say?\nSCOTT: There is certainly no lack of hyperbolic language in the primary process. I'm sure that we will hear more.\nThe key for us to remember is that the primary process is a long-distance race. We are starting that process now, a long way to go. I think one of the keys for us to being successful in 2016 is making sure that we run as one unified family on the right. And that means that we have to figure out how to make sure that we position ourselves for success in how we frame the debate.\nVARNEY: You could have taken on Donald Trump directly, but you didn't.\n(LAUGHTER)\nSCOTT: Well, I think it's important for us to continue -- I'm hosting each presidential candidate in a Tim's Town Hall, town hall-style, over the next several months.\nSo, while I think we should make sure that we engage each candidate, I will have an opportunity to ask Donald Trump specific questions at Columbia, September 23, 6:00 p.m. And I will also have a chance to have Lindsey answer questions on September the 27th in Myrtle Beach. I'm going to have each candidate there. So, I will have an opportunity to have my conversation with all the candidates.\nVARNEY: Senator Tim Scott, Republican South Carolina, thanks very much for joining us, sir. Appreciate it. Thank you.\nSCOTT: Absolutely. It's good to be back. Thanks, Stuart.\nVARNEY: Now, speaking of Mr. Trump, he tweeted out some personal attacks about our own Megyn Kelly. And in response to those attacks, our boss, FOX News chairman and CEO Roger Ailes, has issued this statement:\n\"Donald Trump's surprise and unprovoked attack on Megyn Kelly during her show last night is as unacceptable as it is disturbing. Megyn Kelly represents the very best of American journalism and all of us at FOX News Channel reject the crude and irresponsible attempts to suggest otherwise.\n\"I could not be more proud of Megyn for her professionalism and class in the face of all of Mr. Trump's verbal assaults. Her questioning of Mr. Trump at the debate was tough but fair, and I fully support her as she continues to ask the probing and challenging questions that all presidential candidates may find difficult to answer.\n\"Donald Trump rarely apologizes, although, in this case, he should. We have never been deterred by politicians or anyone else attacking us for doing our job, much less allowed ourselves to be bullied by anyone, and we're certainly not going to start now. All of our journalists will continue to report in the fair and balanced way that has made Fox News Channel the number one news network in the industry.\"\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\n ", "external_links": [], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-27T01:13:10.156+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}