{"organizations": [], "uuid": "c8216e9025d674be8b83f27a24b875265c09619c", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/33/feed#", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/overnights/253316-overnight-healthcare-senate-leaders-eying-vote-on-late-term", "country": "US", "title": "Overnight Healthcare: Senate leaders eye vote on late-term abortion ban", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Overnight Healthcare: Senate leaders eye vote on late-term abortion ban", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T02:00:00.000+03:00", "replies_count": 0, "uuid": "c8216e9025d674be8b83f27a24b875265c09619c"}, "author": "sferris@thehill.com (Sarah Ferris and Peter Sullivan)", "url": "http://thehill.com/policy/healthcare/overnights/253316-overnight-healthcare-senate-leaders-eying-vote-on-late-term", "ord_in_thread": 0, "title": "Overnight Healthcare: Senate leaders eye vote on late-term abortion ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overnight Healthcare: Senate leaders eye vote on late-term abortion ban By Sarah Ferris and Peter Sullivan - 09/10/15 07:00 PM EDT The Senate is planning a vote on anti-abortion legislation this month that could include a bill banning abortions after 20 weeks of pregnancy, a GOP leader said Thursday. \"There's going to be a number of things,” Senate Majority Whip John Cornyn (R-Texas) told reporters. “Senator McConnell's already talked about some pro-life legislation he'll be filing for cloture on at the end of next week.\" A vote on the 20-week abortion ban — which passed the House earlier this year — could help divert attention away from a riskier government funding fight over Planned Parenthood. But Rep. Diane Black (R-Tenn.), who has introduced several bills defunding Planned Parenthood in the House, said the Senate's 20-week bill would not do enough to punish the organization for alleged wrongdoing. \"I think that it certainly would make people feel better... but it doesn’t take care of the possible illegalities that are taking place at Planned Parenthood — the partial birth abortions, the sale of the fetus, and altering the procedure. Those are still really big concerns that have to be addressed,\" Black told The Hill. Read more here . MORE CONSERVATIVES COMMIT TO SHUTDOWN: The House Freedom Caucus announced Thursday said its members will oppose any spending measure that continues funding for Planned Parenthood. The decision by the group, which has more than 40 members, complicates any effort by GOP leaders to move a spending bill through Congress by Oct. 1, the deadline to prevent a shutdown. A GOP aide said the group's position would apply in the case of any short-term or long-term continuing resolution (CR) or omnibus spending bill. \"Given the appalling revelations surrounding Planned Parenthood, we cannot in good moral conscience vote to send taxpayer money to this organization while still fulfilling our duty to represent our constituents. We must therefore oppose any spending measure that contains funding for Planned Parenthood,” the group said in an official statement. The House's other conservative caucus, the Republican Study Committee, is not taking a position on the issue, a spokeswoman said. Read more here . PAUL VOWS FIGHT AGAINST PLANNED PARENTHOOD: Presidential candidate Sen. Rand Paul (R-Ky.) vowed at a Thursday rally on Capitol Hill to block funding for Planned Parenthood, underscoring the pressure facing GOP leaders to avoid a government shutdown. “We should hold our ground,” Paul said at a rally with anti-abortion groups outside the Capitol, where surprise guest Sarah Palin also made an appearance. “If the Democrats want to shut down government over this, then it goes to Democrats,” he added. Senate Majority Leader Mitch McConnell (R-Ky.) has vowed that there will not be a shutdown, and said that Republicans must wait for a new president before Planned Parenthood can be defunded. “We just don’t have the votes to get the outcome that we’d like,” McConnell said last week. But Paul rejected that argument, calling for a strategy of excluding Planned Parenthood from the spending bill and then calling a vote on a separate bill to fund the organization, which he said would make clear where members stand. Read more here . Friday’s schedule: The House Energy and Commerce Committee holds a hearing focused on closing loopholes in Medicaid. What we’re reading Pelosi: Judge’s ruling on ObamaCare lawsuit ‘ astounding ’ A prescription for more black doctors Kraft Heinz pushes retirees to health exchanges to cut costs State by state Fla. governor’s office deeply involved in Planned Parenthood probe results, emails show \nVideo shows object thrown in Planned Parenthood arson in Washington state CDC: Nearly 300 people sickened from parasite What you might have missed from The Hill GOP senator: Defunding Planned Parenthood is a ‘ side show ’ Sanders introducing bill to combat high drug prices FDA releases sweeping food safety rules \nPelosi: ObamaCare will prevail in court Please send tips and comments to Sarah Ferris, sferris@thehill.com , and Peter Sullivan, psullivan@thehill.com . Follow on Twitter: @thehill , @sarahnferris , @PeterSullivan4", "external_links": [], "published": "2015-09-11T02:00:00.000+03:00", "crawled": "2015-09-11T07:36:22.817+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}