{"organizations": [], "uuid": "456167294a57fee07644a99c66cae7af3d3a6a75", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/27/politics/obama-republicans-gay-marriage/index.html", "country": "", "title": "Obama rips Republican candidates on gay marriage - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama rips Republican candidates on gay marriage - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "456167294a57fee07644a99c66cae7af3d3a6a75"}, "author": "", "url": "http://www.cnn.com/2015/09/27/politics/obama-republicans-gay-marriage/index.html", "ord_in_thread": 0, "title": "Obama rips Republican candidates on gay marriage - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama rips Republican candidates on gay marriage By Kevin Liptak , CNN White House Producer Updated 0232 GMT (0932 HKT) September 28, 2015 WASHINGTON, DC - JUNE 26: U.S. President Barack Obama gives remarks on the Supreme Court ruling on gay marriage, in the Rose Garden at the White House June 26, 2015 in Washington, DC. Today the high court ruled that same-sex couples have the right to marry in all 50 states. (Photo by Mark Wilson/Getty Images) Story highlights Hits the GOP at a New York fundraiser Says Republicans back 'discrimination' to win votes (CNN) President Obama on Sunday dismissed Republicans opposed to same-sex marriage as ‎living in another era, saying the national conversation had moved beyond whether gays and lesbians deserve equal marriage rights. And he lambasted statements made by GOP candidates as woefully out-of-touch with reality. \"One of their leading candidates argued that going to prison turns you gay,\" Obama said, an apparent reference to Ben Carson, who had claimed that homosexuality in prison is proof that being gay is a choice. \"I'm just stating the facts,\" Obama continued. \"Another candidate boasts that he introduced an amendment to end nationwide marriage equality. One said he loves the Constitution except for Article 3.\" The President said that \"America has left the leaders of the Republican Party behind.\" \"We need to reject politicians who are supporting new forms of discrimination as a way to scare up votes,\" he added. \"That's not how we move America forward.\" During the event at Gotham Hall, which Democratic donors paid upwards of $33,400 to attend, Obama claimed Republican presidential contenders were pining for an era of economic failure. \"In their world, everything was terrific back in 2008 when we were in the midst of a spiral into the worst financial crisis and economic crisis since the Great Depression, when unemployment and uninsured rates were rising and when our economy was shedding jobs each month, and we were mired in two wars, hopelessly addicted to foreign oil, and bin Laden was still at large,\" he said. \"Those were the Golden Years, apparently.‎\" ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T05:11:10.557+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}