{"organizations": ["Centennial Institute", "Fox News Latino Walker", "Fox News Latino FILE", "Colorado Christian University", "Western Conservative", "AP"], "uuid": "ab254a9f43cd41b619c6e4c751c2a61e88553602", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/GOP%202016%20Walker_Garc.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/30/walker-adds-twist-to-immigration-debate-says-wall-alongside-us-canadian-border/", "country": "", "title": "Walker puts twist to immigration debate, says wall along northern border worth reviewing | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Walker puts twist to immigration debate, says wall along northern border worth reviewing | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T21:30:00.000+03:00", "replies_count": 0, "uuid": "ab254a9f43cd41b619c6e4c751c2a61e88553602"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/30/walker-adds-twist-to-immigration-debate-says-wall-alongside-us-canadian-border/", "ord_in_thread": 0, "title": "Walker puts twist to immigration debate, says wall along northern border worth reviewing | Fox News Latino", "locations": ["Denver", "Wisconsin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Linsley", "Scott Walker", "Walker"], "text": "Walker puts twist to immigration debate, says wall along northern border worth reviewing Published August 30, 2015 Fox News Latino FILE- In this June 27, 2015, file photo, Republican Wisconsin Gov. Scott Walker speaks at the Western Conservative Summit, hosted by the Centennial Institute, Colorado Christian University's think tank, in Denver. Walker, who is to enter the 2016 Republican presidential contest on Monday, July 13, has a national profile largely due to his clashes with labor unions. (AP Photo/Brennan Linsley, File) \nWASHINGTON (AP) – Wisconsin Gov. Scott Walker is putting a new twist on the topic of securing the border, a staple among the GOP candidates running for president, by pointing north. \nWalker said in an interview that aired Sunday that building a wall along the country's northern border with Canada is a legitimate issue that merits further review. \nRepublican candidates for president have often taken a get-tough approach on deterring illegal immigration, but they usually focus on the border with Mexico. Walker was asked Sunday morning on NBC's \"Meet the Press\" whether he wanted to build a wall on the northern border, too. Walker said some people in New Hampshire have asked the campaign about the topic. \n\"They raised some very legitimate concerns, including some law enforcement folks that brought that up to me at one of our town hall meetings about a week and a half ago. So that is a legitimate issue for us to look at,\" Walker said. \nThe U.S.-Canada boundary is the longest international border in the world at 5,525 miles long. \nBillionaire Donald Trump is riding the issue of illegal immigration to the top of the Republican presidential primary polls. He has said he would make Mexico pay for completing a permanent wall along the border. He also says he would also end automatic citizenship for those born in the United States, a right guaranteed by the 14th Amendment to the Constitution that was originally added to grant citizenship to freed slaves and their descendants after the Civil War. His positions appear to have pushed rivals to also take strong stands on immigration. \nWalker, at one point, echoed Trump's call for ending birthright citizenship, but later said he's against any such repeal. \nLike us on Facebook ", "external_links": [], "published": "2015-08-30T21:30:00.000+03:00", "crawled": "2015-08-30T21:30:31.006+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}