{"organizations": [], "uuid": "b3f996e8388a96c55a24a6a03cdcd78d5f218675", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/john-feffer/headshot.jpg", "site_section": "http://www.huffingtonpost.com/tag/hillary-clinton/feed", "section_title": "Hillary Clinton on Huffington Post", "url": "http://www.huffingtonpost.com/john-feffer/after-obama-clinton-vs-sa_b_8159918.html", "country": "US", "title": "John Feffer: After Obama: Clinton vs. Sanders", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "John Feffer: After Obama: Clinton vs. Sanders", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T16:35:00.000+03:00", "replies_count": 0, "uuid": "b3f996e8388a96c55a24a6a03cdcd78d5f218675"}, "author": "John Feffer", "url": "http://www.huffingtonpost.com/john-feffer/after-obama-clinton-vs-sa_b_8159918.html", "ord_in_thread": 0, "title": "John Feffer: After Obama: Clinton vs. Sanders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Last week, Democratic presidential hopeful Hillary Clinton gave a major foreign policy speech that provided a glimpse of one possible post-Obama future. \nIn many ways, it was not a pretty picture. \nBut let's first look at the good points. Clinton endorsed the Iran deal that just squeaked through Congress despite unanimous Republican opposition. \"Either we move forward on the path of diplomacy and seize this chance to block Iran's path to a nuclear weapon or we turn down a more dangerous path leading to a far less certain and riskier future,\" she said at the outset. \nThis was not exactly news. Clinton had earlier endorsed the deal. Nor is her support a big surprise: She played an important role as secretary of state setting up the backchannel discussions that eventually produced the agreement. \nClinton also called for a stronger U.S. response to the refugee crisis. And she acknowledged the Saudi role in promoting extremism. \nThe rest of the speech, however, was a throwback to her 2008 run for the president, when she presented herself as the adult alternative to Obama's innocent abroad who would naively coddle U.S. adversaries. As it turned out, of course, Obama's gambles have largely paid off. He initiated spectacular breakthroughs with Iran and Cuba, plus a semi-success with Burma (though these achievements have been offset somewhat by failures with Russia and North Korea). \nClinton, however, prefers to talk tough, as if to dispel all the demeaning stereotypes of wishy-washy women, Democrats, and liberals. In her bid to win the squishy middle, she's betting that a more hawkish foreign policy can appeal to that segment of the electorate that remains skeptical of Iran's intentions (and the intentions of, frankly, any country, including U.S. allies like France). The U.S. electorate may well be anti-war, in the sense of not wanting U.S. boots on the ground overseas. But that doesn't mean it's actively pro-peace. Between these positions, Clinton has pitched her tent of \"smart power.\" \nWill Clinton's more muscular alternative be the future of U.S. foreign policy if the Democrats hold on to the Oval Office in 2016? Or would Bernie Sanders, if he grabs the Democratic nomination and triumphs in the general election, guide the United States in a different direction? \nClinton's Worldview \nAfter giving the Iran deal some cautious praise, Hillary Clinton hastened to emphasize that the United States should treat Iran like a juvenile delinquent that is genetically disposed to engage in \"bad behavior.\" \n\"We need to be prepared for three scenarios,\" Clinton said. \"First, Iran tries to cheat, something it's been quite willing to do in the past; second, Iran tries to wait us out -- perhaps it waits to move for 15 years when some, but not all, restrictions expire; and, third, Iran ramps up its dangerous behavior in the region, including its support for terrorist groups, like Hamas and Hezbollah.\" \nFor these and other reasons, Clinton concluded, \"I don't see Iran as our partner in implementing the agreement.\" This is a curious formulation for a former diplomat to make. \nContrast Clinton's approach with the EU's response. \nCoincidentally, EU High Representative for Foreign Affairs and Security Policy Federica Mogherini gave a speech on Iran at the European Parliament on the same day that Clinton was speaking to the foreign policy establishment at Brookings. Mogherini laid out the post-deal tasks for the EU -- including economic cooperation, addressing environmental issues, and dealing with drugs and terrorism -- that treat Iran precisely as a partner. \nAs Eldar Mamedov, who works in the European Parliament on inter-parliamentary relations with Iran, points out in LobeLog: \nThis is a much more promising approach than Hillary´s tough talk. Based on past experiences, Iran is more likely to respond to incentives than coercion. That's why it is pointless to guess whether Iran will or will not cheat on the deal. Rather, conditions should be created to make Iran want to respect the deal. If Clinton assumes that Iran will cheat, then her threats of using a military option could make this a self-fulfilling prophecy. Rather than cow Iran into compliance, such talk is only likely to reinforce the positions of those in Iran who are deeply skeptical or hostile about American intentions. \nClinton's tough talk at Brookings wasn't confined to Iran. She promised to bulk up Israel's military, including selling the country the most expensive piece of military hardware ever, the F-35. She also assured the audience that she would stand toe to toe with Putin: \"We have to do more to get back talking about how we try to confine, contain, deter Russian aggression in Europe and beyond, and try to figure out what are the best tools for doing that.\" \nThere's a whiff of the Cold War to Clinton's posturing. Still, for all of her muscle flexing, Clinton at least understands the importance of diplomacy, which is more than can be said about the Republican presidential hopefuls. Yes, Clinton can sound depressingly 20 th -century in her approach. But that's still a big improvement over the medieval perspectives of her potential challengers, including the purported moderate, John Kasich, who all view the rest of the world as a big nail that needs repeated hammering. \nBut how do Clinton's views on foreign policy stack up against her more immediate threat, Bernie Sanders, who's surging in the polls? \nThe Sanders Alternative \nMy introduction to professional journalism was in 1983, when I had a summer internship at the Vermont Vanguard -- the free alternative weekly published in Burlington, Vermont. Bernie Sanders was the socialist mayor of Burlington at the time, and I was struck by his political pragmatism. This was no dreamy academic but a gruff, New York-style pol who also happened to believe passionately in economic justice. \nBecause the Vermont Democrats were predisposed against him, Sanders often cooperated with the local Republicans to get initiatives passed. His commitment to making deals that brought jobs to the city led him to make alliances with business, and some purists on the left grew disenchanted. But particularly after 1983, when he was able to achieve a political majority on the City Council, he was able to push his agenda forward effectively . \nSanders has made economic inequality the centerpiece of his presidential bid. It's a wise strategy, given widespread populist resentment over the benefits of economic growth going disproportionately to the very wealthy. These pocketbook issues can energize the progressive base of the Democratic Party -- and attract quite a few disgruntled independents -- in a way that no foreign policy issue can at the moment. \nSo for the most part, Sanders hasn't talked about foreign policy. He's made mention of his opposition to the war in Iraq. He's praised the diplomatic initiatives of the Obama administration toward Iran and Cuba. \"It is my firm belief that the test of a great nation, with the most powerful military on earth, is not how many wars we can engage in, but how we can use our strength and our capabilities to resolve international conflicts in a peaceful way,\" he writes on his website . Sanders has also emphasized his human rights voting record and his concern about climate change. But generally he's focused on domestic concerns. \nIt's not just that economic issues are a clear winner with his likely constituency. Sanders is also wise to steer clear of foreign policy because some of his stances would clearly alienate his progressive following. Writing in Seven Days , the alternative weekly that took over from the Vanguard , Kevin Kelley observes: \nSanders has in turn been slammed by some progressives for his support of the 1999 U.S.-led bombing campaign against Serbia following its massacre of Muslims in the contested territory of Kosovo. Jeremy Brecher, a former member of Sanders' staff in Washington, D.C., resigned in protest over that vote. \nThree days after the 2001 terrorist attacks on New York and Washington, Sanders joined 419 House members in authorizing war in Afghanistan. More recently, Sanders backed Israel's attacks on Gaza last summer. Numerous progressives, in Vermont and nationally, have criticized him for that stand. \nThose criticisms may have had some impact. Sanders did criticize Israel's attacks on Gaza in 2013 as \"disproportionate\" and \"completely unacceptable.\" He was also the first Senate Democrat to declare that he would boycott Benjamin Netanyahu's speech before Congress last February. \nStill, Sanders has proven surprisingly mainstream on a number of foreign policy issues. \nFor instance, he's backed a more active Saudi role in combatting the Islamic State -- which raises eyebrows among progressives , given the Saudi role in Yemen, spreading religious extremism, and maintaining a repressive theocracy at home. He's made some noises about the unacceptably high level of U.S. military spending, but he's also been a supporter of basing F-35s in Vermont (a controversial issue ). \nAnd he's also distanced himself from the left on military questions more generally. \"I believe the United States should have the strongest military in the world,\" he told ABC News . \"We should be working with other countries in coalition. And when people threaten the United States, or threaten our allies, or commit genocide, the United States with other countries should be prepared to act militarily.\" \nIf Sanders were somehow to make it into the White House, he would no doubt govern as pragmatically as he did in Burlington. He's a dealmaker, whether that means with adversaries of the United States or the natural adversaries of American progressives. He's not a revolutionary, and he's not interested in deconstructing American militarism. He'll try to push the envelope, of course, but with a focus on getting a better deal for working Americans. \nAs he proved in Burlington, Sanders is, above all, a politician who knows how to navigate within the American system. He's not interested in running as a protest candidate like Ralph Nader. Sanders wants to achieve and then exercise power. \nThe Corbyn Alternative? \nAlso last week, the British Labor Party elected a new chairman who's been called the Sanders of Britain (as Sanders has been called the Corbyn of America ). They're both political outsiders who have gained traction in part because of their socialist critique of big business and income inequality. \nBut when it comes to foreign policy, they're quite different. Jeremy Corbyn, a long-time parliamentarian and peace activist, has put international issues at the front and center of his agenda . He's the head of the Stop the War coalition in the UK. He's against Britain's Trident nuclear submarines and skeptical of British involvement in NATO. He's against military interventions in the Middle East. He's unabashedly on the side of the oppressed and even sends a shout-out to the displaced Chagos Islanders on his website. \nAs Graham MacPhee writes in Foreign Policy In Focus , Corbyn will also challenge the imposition of austerity economics in the European Union and throw some sand in the gears of the Transatlantic Trade and Investment Partnership. \nA sign of Corbyn's unorthodoxy is the level of vitriol that the mainstream has directed at him, from the Labor Party's Tony Blair to points further right. Alex Massie, writing in Foreign Policy , called him the \"joke candidate\" whose views on world affairs \"mark him out as a man of the far-left,\" a politician who calls extremists in Hamas and Hezbollah his \"friends\" and never distanced himself from the IRA in Northern Ireland. \nCorbyn, however, is a politician of principle, and he believes in dialogue. As Joseph Finlay sensibly writes in The New York Times , Corbyn \nhas spent much of his long and rebellious parliamentary career talking to people most other MPs have shunned, adopting the position that it is only by engaging in dialogue with violent and unsavory groups that war can be averted. And he has been vindicated by history: He invited the Sinn Fein leader Gerry Adams to Parliament in 1984, and supported the African National Congress when Prime Minister Margaret Thatcher considered both groups terrorist organizations. Mr. Adams was later instrumental in the Good Friday peace agreement; the A.N.C. became the governing party of South Africa under Nelson Mandela. \nIn talking to groups like Hamas, Mr. Corbyn may once again be ahead of his time. After several attempts to destroy Hamas militarily, Israel is now reportedly negotiating with the group in attempt to broker a long-term truce. \nThe differences between Jeremy Corbyn and Bernie Sanders, which are most salient on foreign policy, reflect not so much the differences in their personalities or their ideologies. Rather, they represent the differences between the political systems of the United States and Britain. \nCorbyn has been an activist within the Labor Party, an institution that the United States so obviously lacks. \"Socialism\" is not necessarily a dirty word in Great Britain, though it certainly has suffered mightily over the years from the one-two punch of Margaret Thatcher and Tony Blair. The British parliamentary system, moreover, is far more sympathetic to a diversity of political opinions such that a politician like Corbyn can maintain foreign policy views that would invite extreme marginalization on Capitol Hill (if such a politician somehow managed to get there in the first place). \nSo, progressives might look with envy at what might be politically possible in the UK. But that should not distract us from what's on offer here in the United States. Bernie Sanders, despite an imperfect foreign policy, is a clear alternative to Hillary Clinton. And Clinton, despite an even more imperfect foreign policy, is a clear alternative to the Republicans. \nAnd the Republicans, with a collective foreign policy from hell, are a clear alternative to sanity. Oh, how the world must look at us and laugh. \nFollow John Feffer on Twitter: www.twitter.com/johnfeffer More:", "external_links": [], "published": "2015-09-18T16:35:00.000+03:00", "crawled": "2015-09-18T20:41:29.632+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}