{"organizations": [], "uuid": "5c1cf130725b49bd4724cdacd1069f376304cb91", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/ECIG.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/health/2015/09/08/high-school-students-use-e-cigarettes-to-vape-marijuana-study-says/", "country": "US", "title": "High school students use e-cigarettes to vape marijuana, study says", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "High school students use e-cigarettes to vape marijuana, study says | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5c1cf130725b49bd4724cdacd1069f376304cb91"}, "author": "Reuters", "url": "http://www.foxnews.com/health/2015/09/08/high-school-students-use-e-cigarettes-to-vape-marijuana-study-says/", "ord_in_thread": 0, "title": "High school students use e-cigarettes to vape marijuana, study says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 08, 2015 Reuters March 5: A man uses an E-cigarette, an electronic substitute in the form of a rod, slightly longer than a normal cigarette, in this illustration picture taken in Paris. (Reuters)\nNearly one in five high school students who said they used electronic cigarettes to vaporize nicotine also used them to vaporize pot, according to a survey of nearly 4,000 Connecticut teens.\nThe study, published on Monday in the journal Pediatrics, is the first evidence that teens are using electronic cigarettes to vaporize cannabis, the researchers said.\nThe paper by Meghan Morean of Oberlin College in Ohio and colleagues raises concerns that the rising popularity of e-cigarettes may encourage teens to use the devices to vaporize cannabis, potentially exposing them to higher concentrations of tetrahydrocannabinol or THC, the main psychoactive ingredient in marijuana.\n\"Forms of cannabis that can be vaporized, like hash oil, can be many times stronger than marijuana that is smoked,\" Morean said in an email.\nA study released last month suggested U.S. teens who try electronic cigarettes may be more than twice as likely to move on to smoking conventional cigarettes than those who have never tried the devices. [ID:nL1N10S1XY]\nAccording to the U.S. Centers for Disease Control and Prevention, about 2 million middle- and high-school students tried e-cigarettes in 2014, triple the number of teen users in 2013.\nMorean and colleagues found that of students who had used e-cigarettes, 18 percent had used them to vaporize cannabis in some form, including hash oil and wax infused with tetrahydrocannabinol (THC), the main psychoactive cannabis ingredient.\nHigh school students in the study were 27 times as likely to use e-cigarettes to vaporize cannabis as adults who use e-cigarettes, the researchers said.\nMale and younger students were more likely to use e-cigarettes to vaporize cannabis than female and older students, but socioeconomic status was not a factor. Use differed among the five schools involved, possibly because of different policies.\nWhile the findings were limited to Connecticut schools and may not apply to states with varying cannabis laws, the pattern is worrisome, said Dustin Lee, a postdoctoral fellow at the Geisel School of Medicine in Dartmouth College, New Hampshire, by email. Lee was not involved in the study.\n\"We know very little about the acute and long-term effects of high-potency THC on neurobiology and behavior,\" Lee said in an email. \"This is especially concerning for teens, who are in a critical time for development of brain structures that are integral in executive functioning.\"", "external_links": ["http://www.reuters.com/"], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T16:32:19.507+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}