{"organizations": [], "uuid": "af19376f24079be1949b65b3d9ecbea8d68dace0", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/09/30/obama-is-being-badly-outplayed-by-putin-in-syria/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1443630064567.jpg?ve=1&tl=1", "site_section": "http://feeds.foxnews.com/foxnews/opinion", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2015/09/30/obama-is-being-badly-outplayed-by-putin-in-syria.html", "country": "US", "title": "Syria: Putin's a brutal tyrant, but he has a policy and a plan, Obama doesn't", "performance_score": 1, "site": "foxnews.com", "participants_count": 3, "title_full": "Syria: Putin's a brutal tyrant, but he has a policy and a plan, Obama doesn't | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 2, "uuid": "474121f565f17b28dd01d95dc5470795d094f10a"}, "author": "Michael Goodwin", "url": "http://www.foxnews.com/opinion/2015/09/30/obama-is-being-badly-outplayed-by-putin-in-syria.html#post-0", "ord_in_thread": 0, "title": "Syria: Putin's a brutal tyrant, but he has a policy and a plan, Obama doesn't", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Michael Goodwin \nPublished September 30, 2015 New York Post   livefyre Email Print Sept. 30, 2015: Russian President Vladimir Putin holds a meeting with senior government officials at the Novo-Ogaryovo residence outside Moscow, Russia. (The Associated Press) \nThe United Nations showdown this week has demonstrated just how badly President Obama is being outplayed by Vladimir Putin . Hold onto your hat, the worst is yet to come.\nClaiming to be lining up a coalition to fight the Islamic State, Putin is also aligned with Iran and Iraq to keep the butcher of Syria, Bashar al-Assad, in power.\nThis axis of evil would be trouble anywhere, but the involvement of Iraq adds a unique dimension. We are helping to prop up that government and launching airstrikes against the Islamic State in Iraq, an effort that involves giving Iraq’s military our intelligence data.\nBut The Wall Street Journal reports that Iraqi officials say they will now give that data to the Russian military. That means our intelligence will be used to keep Assad in power.\nMore than four years after Obama demanded that Assad resign, the Syrian dictator not only survives, he has gained powerful allies. And we have effectively become one of them, even as Obama still insists Assad must go.\nSo more than four years after Obama demanded that Assad resign, the Syrian dictator not only survives, he has gained powerful allies. And we have effectively become one of them, even as Obama still insists Assad must go.\nTo read again his initial demand that Assad quit in August 2011 is to appreciate the consequences of Obama’s failure to act. “For the sake of the Syrian people, the time has come for President Assad to step aside,” he said then.\nAt the time, The Washington Post reported that “hundreds of Syrian civilians” had been killed by the government.\nNow the dead are said to number 250,000, with 4 million Syrians driven into exile. Yet Obama was at the U.N. Monday, sounding very much like it was still 2011. He demanded “a managed transition away from Assad into a new leader,” yet again offered no plan for making that actually happen.\nPutin is a brutal tyrant, but he has a policy — and a forceful plan to deliver results. Therein lies the difference between a leader and a charlatan.\nTo continue reading Michael Goodwin's column in the New York Post, click here . \n\n\nMichael Goodwin is a Fox News contributor and New York Post columnist. \n ", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T20:07:57.124+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}