{"organizations": [], "uuid": "56fca4f2b225a998d81232cc2a1f73f17bda81b2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_091615getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/253815-obama-gop-playing-chicken-with-economy-in-shutdown-fight", "country": "", "title": "Obama: GOP 'playing chicken' with economy in shutdown fight | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama: GOP 'playing chicken' with economy in shutdown fight | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T19:20:00.000+03:00", "replies_count": 0, "uuid": "56fca4f2b225a998d81232cc2a1f73f17bda81b2"}, "author": "", "url": "http://thehill.com/policy/finance/253815-obama-gop-playing-chicken-with-economy-in-shutdown-fight", "ord_in_thread": 0, "title": "Obama: GOP 'playing chicken' with economy in shutdown fight | TheHill", "locations": ["Jordan Fabian"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama: GOP 'playing chicken' with economy in shutdown fight Getty Images By Jordan Fabian - 09/16/15 12:01 PM EDT \nPresident Obama is wading into the contentious budget fight on Capitol Hill two weeks ahead of a possible government shutdown. ADVERTISEMENT During a speech at the Business Roundtable in Washington, Obama pressured Republicans who control Congress to reach a deal with Democrats to fund the government before a Sept. 30 deadline.\nHe chided GOP lawmakers for threatening to shut down the government unless Planned Parenthood is defunded. \n“The notion we play chicken with a $18 trillion economy … all because of an issue around a woman’s health provider that receives less than 20 cents out of every 1,000 dollars in the federal budget, that’s not good policy making.” \nObama urged the business executives in the audience to contact their lawmakers to “remind them what’s at stake” as Congress hurtles toward a shutdown. \nObama also pushed Republicans to support a tax increase on some investment managers by scrapping a provision, known as the carried-interest loophole, to help fund increased domestic and defense spending. \n“You’ve got two leading candidates on the Republican side who’ve said we should eliminate the carried-interest loophole,” he said. “Keeping this tax loophole, which leads to folks who are doing really well paying lower rates than their secretaries, is not in any demonstrable way improving for our economy.” \nThe president first supported eliminating the carried-interest provision during his 2008 campaign. His latest push comes amid a heated debate over income inequality on the 2016 presidential campaign trail. \nDemocrats have long called for higher taxes on fund managers. But the idea has gained traction among Republicans, with GOP presidential candidates Donald Trump and Jeb Bush backing the so-called loophole. \nTrump, the GOP front-runner, last month said the “hedge fund guys are getting away with murder” because of the tax provision. Looking to tap into the populist sentiment fueling Trump, Bush released a tax plan that would scrap the tax break, which is prized by Wall Street. \nThe carried-interest break allows hedge fund and private equity partners to count money-management profits as capital gains, which are taxed around half the rate of ordinary income. \nTreating those profits as individual income would allow them to be taxed at a top rate of 39.6 percent. The change could bring in $17.7 billion over the next decade, according to Obama’s 2016 budget. Obama said the money could be used to pay for job-training programs or college-affordability initiatives. \nBut change has little chance of passing through Congress, where tax reform has proven elusive in recent years. Many GOP lawmakers who oppose tax increases oppose Obama’s plan. \nThe conservative Club for Growth this week launched a $1 million ad campaign attacking Trump for, among other reasons, his support for higher taxes on hedge fund managers. \nBy highlighting the tax issue, Obama sought to play up the division between Republican lawmakers and candidates running for president. But he also chided those seeking to become his successor, accusing them of ignoring the economic progress since he took office in 2009 on the heels of the financial collapse. \n“In the echo chamber that is presidential politics, everything is dark and everything is terrible,” Obama said. “They don’t seem to offer many solutions for the disasters that they perceive.” \nIn a veiled shot at Trump, whose campaign slogan is “Make America Great Again,” Obama said “there is nothing particularly patriotic or American about talking down America.” \nRepublicans and Democrats are locked in a broader stalemate over government spending with no clear solution in sight. \nA group of House Republicans is threatening to block any spending bill that includes funding for Planned Parenthood. The organization has been roiled by a controversy stemming from videos depicting controversial discussions about fetal tissue donations. \n\"The goal here is not to shut down the government,” Speaker John Boehner (R-Ohio) said last week. “The goal is to stop these horrific practices of organizations selling baby parts. So that's the goal.\" \nObama has said he does not support de-funding Planned Parenthood and the White House has cast doubt on the authenticity of the videos, which were released by an anti-abortion rights group. \nObama has said he would veto a final budget deal that does not lift spending caps, known as sequestration, which GOP leaders favor keeping in place. The president wants to raise spending to fund infrastructure, education and research programs. \n“My hope is that Congress aims a little higher than just not shutting the government down,” Obama said. “That’s a good start … but we can do better.” Tags: ", "external_links": [], "published": "2015-09-16T19:20:00.000+03:00", "crawled": "2015-09-16T19:19:42.253+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}