{"organizations": [], "uuid": "6875a8ff88253f174b070d8e4ccbb40a4af3d8c3", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150929062022-obama-remarks-on-immigration-execitive-action-2014-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/29/politics/immigration-obama-lawsuit-delays/index.html", "country": "US", "title": "Lawsuit against Barack Obama's immigration action stalls", "performance_score": 2, "site": "cnn.com", "participants_count": 1, "title_full": "Lawsuit against Barack Obama's immigration action stalls - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "6875a8ff88253f174b070d8e4ccbb40a4af3d8c3"}, "author": "Ariane de Vogue", "url": "http://www.cnn.com/2015/09/29/politics/immigration-obama-lawsuit-delays/index.html", "ord_in_thread": 0, "title": "Lawsuit against Barack Obama's immigration action stalls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights In February, U.S. District Judge Andrew S. Hanen sided with Texas and 25 other states challenging the Obama administration programs and temporarily blocked them from going forward U.S. Court of Appeals for the Fifth Circuit heard arguments in July but has not ruled (CNN) Mario Sidonio is an aspiring astrophysicist with big American dreams. But lately the 17-year-old has been waking up every day hoping a federal appeals court will come down with a ruling that could help his family secure a better future.\nMario is a U.S. citizen born and raised in Texas. But his father is an undocumented worker, trying to support his six children who are all U.S. citizens.\nThe family has been on an emotional roller coaster since last November when President Barack Obama announced executive actions that would ease deportation threats to some 4 million undocumented workers. Mario's father would have been eligible for one of the programs. But last February, U.S. District Judge Andrew S. Hanen sided with Texas and 25 other states challenging the programs and temporarily blocked them from going forward.\nRELATED: CNN/ORC poll: Guns, immigration, abortion increasingly important to voters\nTemporary, however, could mean more than a year. The Sidonios and millions of other similarly situated families across the country have seen their dreams turn into a slow-moving court case that remains stalled. Meanwhile, several Republican candidates have seized on the President's programs as a talking point on the campaign trail, with some presidential hopefuls endorsing strict deportation policies and suggesting that not all children born in the U.S. should be eligible for citizenship in the first place.\nAfter losing in the district court, the administration appealed its case to a three judge panel on the U.S. Court of Appeals for the Fifth Circuit based out of New Orleans. The appeals court heard arguments in July — and both sides are getting impatient.\n\"Almost three months later, we are still waiting on a decision,\" said Josh Blackman, an Associate Professor of Law at the South Texas College of Law. Blackman, working with the libertarian CATO Institute, has filed a brief in support of Texas and the other states who believe the President's executive actions were an unprecedented expansion of executive power.\nBlackman supports comprehensive immigration reform, but he writes in the brief, \"it is not, however, for the President to make such changes alone, in conflict with the laws passed by Congress, and in ways that go beyond constitutionally-authorized executive power.\"\nNo final decision coming soon\nThis step won't be the last. This court battle will most likely reach the Supreme Court, and the appeal process might outlive Obama's presidency.\n\"We're very frustrated,\" Mario said in an interview. His father planned to apply for a program called \"Deferred Action for Parents of Americans and Lawful Permanent Residents \" (DAPA) that would have made him eligible for work authorization and associated benefits.\n\"We are wondering what is taking so long,\" said Mario. He hopes that even if his side loses at the Fifth Circuit, the case could be appealed to the Supreme Court in time for it to be heard and decided this term. But for that to happen, the case would need to be decided very soon.\nOn dark days Mario fears the appeals court, which is generally considered to be very conservative, is slow-walking a decision as a way to run out the final months of the Obama administration.\n\"I feel like it's being delayed on purpose, but maybe that's just the frustration talking,\" he said.\n\"There is a distinct possibility that if this case is decided too late, there may not be enough time for the Supreme Court to argue and decide the inevitable appeal by June 2016,\" said Blackman who added that if the case is kicked to the fall of 2016, the decision could come after the next presidential election.\nRELATED: Jeb Bush on immigration: my plan is 'dignified'\nAccording to the Center for the Study of Immigrant Integration at the University of Southern California, there are approximately 6.3 million children who live in a household with a DAPA eligible mother or father, and 5.5 million are U.S. Citizens.\nIn a recent study, CSII says that nearly 600,000 children of parents that could be eligible for DAPA currently have the right to vote.\nNext fall, that will include Mario who was shocked when he hear Republican front-runner Donald Trump explain his immigration views during the most recent debate.\n\"A woman gets pregnant. She's nine months, she walks across the border, she has the baby in the United States, and we take care of the baby for 85 years. I don't think so.\" Trump said.\nMario said he expects to respond at the voting booth.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T18:00:06.041+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}