{"organizations": ["Portland Press Herald", "New Hampshire Want Feds To Respect State Marijuana Laws Candidates", "New Hampshire Want Feds To Respect State Marijuana Laws Email"], "uuid": "7b66b72fd36b752b8628c123a864a134b3c20571", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55dcba331d00002f00145d5f.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/voters-primary-state-marijuana-laws_55dca76be4b04ae497049b07", "country": "", "title": "Majority Of Voters In Iowa, New Hampshire Want Feds To Respect State Marijuana Laws", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Majority Of Voters In Iowa, New Hampshire Want Feds To Respect State Marijuana Laws", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T01:06:00.000+03:00", "replies_count": 0, "uuid": "7b66b72fd36b752b8628c123a864a134b3c20571"}, "author": "", "url": "http://www.huffingtonpost.com/entry/voters-primary-state-marijuana-laws_55dca76be4b04ae497049b07", "ord_in_thread": 0, "title": "Majority Of Voters In Iowa, New Hampshire Want Feds To Respect State Marijuana Laws", "locations": ["Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Ferner", "Huffington"], "text": "Email Majority Of Voters In Iowa, New Hampshire Want Feds To Respect State Marijuana Laws Candidates who say they would shut down legal state marijuana businesses are “out of touch with the voters,” one advocate says. Matt Ferner National Reporter, The Huffington Post Posted: 08/25/2015 05:09 PM EDT | Edited: 38 minutes ago Portland Press Herald via Getty Images \nVoters in the two earliest presidential voting states overwhelmingly agree: states should be able to set their own marijuana laws without federal interference. \nDemocratic-leaning Public Policy Polling asked voters in Iowa and New Hampshire if states should be able to execute their own marijuana laws without the involvement of the federal government, or if the feds should arrest and prosecute those who are following state drug laws. \nThe survey, released Tuesday, found a supermajority of voters in both states believe that the feds should not interfere with state marijuana laws -- 71 percent in Iowa and 73 percent in New Hampshire . \nIowa and New Hampshire are often viewed as critical bellwether states, together helping to cement each party's presidential front-runner. The Iowa caucus in the first week of February serves as the launch into election season, quickly followed the next week by the first primary election in New Hampshire. \nThe PPP poll also found substantial bipartisan support for states' rights when it comes to marijuana policy, with very large Democratic and independent majorities leading in both states, but with strong majority support from Republicans as well. \nPresidential hopefuls should take note of how strongly these voters want to end federal marijuana prohibition, Tom Angell, chairman of Marijuana Majority, a drug policy reform group that commissioned the PPP poll , said in a statement. \n\"Candidates who say they would send in the DEA to shut down legal, taxpaying marijuana businesses are effectively announcing that they're out of the mainstream and out of touch with the voters they need support from in order to get elected,\" Angell said. \"That type of rhetoric is just not going to score any points in 2016.\" \nTo date, 23 states have legalized marijuana for medical purposes while 17 others have legalized the limited medical use of cannabis extracts, frequently used to treat debilitating seizures. New Hampshire legalized medical marijuana in 2013, and Iowa is one of the states that allows limited medical use of extracts. \nFour states and D.C. have legalized recreational marijuana. (The District still bans retail sales.) \nBut marijuana, be it medical or recreational, remains prohibited under federal law. Under the Controlled Substances Act, the U.S. has five categories for drugs and drug ingredients . Schedule I is reserved for what the DEA considers to have the highest potential for abuse and no medical value. Marijuana has been classified as Schedule I for decades, alongside other substances like heroin and LSD. \nStates that have legalized rely on Department of Justice guidance urging federal prosecutors to refrain from targeting their state-legal marijuana operations. \nWhile federal prosecutions of medical marijuana patients and providers have slowed more recently, the Drug Enforcement Administration and several U.S. attorneys under the Obama administration have raided marijuana dispensaries and sent people to prison, even though they complied with state laws. According to a 2013 report released by advocacy group Americans for Safe Access, the Obama administration spent almost $80 million each year -- more than $200,000 per day -- cracking down on medical marijuana. \nThe PPP poll is some of the strongest sentiment yet from voters who want to see an end to prohibition-style marijuana policies. In April, CBS News found that 58 percent of Americans believe that legalizing marijuana should be left to each state, without involvement from the federal government. A recent report from centrist think tank Third Way found 60 percent of Americans feeling similarly and also found that a larger majority of Americans would also support the creation of a new federal law that would make those marijuana-legal states a \"safe haven\" from federal laws against cannabis. \nState legislators also appear to agree -- just this month, the National Conference of State Legislatures, a nongovernment organization composed of state lawmakers and their staffs, passed a resolution urging the federal government to amend the Controlled Substances Act and other federal laws \"to explicitly allow states to set their own marijuana and hemp policies without federal interference\" and to refrain from undermining state marijuana and hemp laws. \nThe PPP surveys included 1,500 registered voters in Iowa and 841 voters in New Hampshire. The Iowa poll was conducted Aug. 7-9 and the New Hampshire poll was conducted Aug. 21-24. \n﻿ ﻿Also on HuffPost: ", "external_links": [], "published": "2015-08-26T01:06:00.000+03:00", "crawled": "2015-08-26T01:06:35.856+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}