{"organizations": ["Abortion Providers Spike In Wake Of Planned Parenthood Videos"], "uuid": "1a46582d5d0612b0855b8cbd4d92f4eda9853486", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e899491d0000d301146bf2.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/abortion-providers-face-death-threats-in-wake-of-planned-parenthood-videos_55e88bbae4b0b7a9633c3f47", "country": "", "title": "Death Threats On Abortion Providers Spike In Wake Of Planned Parenthood Videos", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Death Threats On Abortion Providers Spike In Wake Of Planned Parenthood Videos", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T23:26:00.000+03:00", "replies_count": 0, "uuid": "1a46582d5d0612b0855b8cbd4d92f4eda9853486"}, "author": "", "url": "http://www.huffingtonpost.com/entry/abortion-providers-face-death-threats-in-wake-of-planned-parenthood-videos_55e88bbae4b0b7a9633c3f47", "ord_in_thread": 0, "title": "Death Threats On Abortion Providers Spike In Wake Of Planned Parenthood Videos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Deborah Nucatola", "Laura Bassett Laura Bassett"], "text": "Death Threats On Abortion Providers Spike In Wake Of Planned Parenthood Videos \"I'll pay ten large to whomever kills Dr. Deborah Nucatola,\" one person posted. Laura Bassett Laura Bassett, Senior Politics Reporter, The Huffington Post Posted: 09/03/2015 03:59 PM EDT | Edited: 22 minutes ago Pacific Press via Getty Images \nIn July, shortly after an anti-abortion group aired an undercover video of a top Planned Parenthood doctor discussing the donation of fetal tissue after abortions, an individual using the name \"Joseywhales\" posted an ominous warning on Fox Nation. \n\"I'll pay ten large to whomever kills Dr. Deborah Nucatola,\" the person wrote, referring to the senior director of Planned Parenthood who was filmed in the video. \"Anyone. Go for it.\" \nThe same person went on to threaten Cate Dyer, the CEO of StemExpress, a biomedicine company that procures fetal tissue for medical research. \n\"The CEO of StemExpress should be hung by the neck using piano wire and propped up on the lawn in front of the building with a note attached,\" Joseywhales wrote, according to a legal complaint filed by the National Abortion Federation in a California district court. \nThe person then posted Dyer's home address and offered \"ten grand to whomever beats me\" to her house, warning that Dyer \"must die to save the innocents.\" \nAccording to abortion rights advocates, Joseywhales' post is just one example of an alarming spike in death threats and violent acts against abortion providers, clinics and companies that work with them since the undercover videos of Planned Parenthood were released. Two Planned Parenthood clinics have reported arsons , anti-abortion protesters are showing up in large numbers at doctors' homes , and commenters on conservative websites and online forums are calling for the bombings of abortion clinics across the country, according to Vicki Saporta, president of the National Abortion Federation. Saporta is so alarmed by the escalation of threats against providers that she asked the U.S. Department of Justice and the Federal Bureau of Investigations to intervene. \n\"In my 20 years at NAF, I have never seen such a volume, intensity and escalation of hate speech, threats and criminal activity, and we would like to prevent a serious violent act from occurring,\" she told The Huffington Post in an interview. \"We have enlisted law enforcement's help.\" \nIf history is any indication, death threats against abortion providers should be taken seriously. Two abortion doctors have been murdered during Saporta's tenure at NAF: Dr. George Tiller in 2009 and Dr. Barnett Slepian in 1998. Slepian was shot in his home after returning from synagogue, and Tiller was shot in the head while attending church services on a Sunday morning. \nSaporta had worked with them both. \n\"I in 20 years have taken two phone calls telling me two of my member physicians had been murdered by anti-abortion extremists,\" she said. \"I don't ever want to take a call like that again.\" \nThe heavily edited videos of Planned Parenthood were designed to incite strong emotional responses. They show Nucatola and other doctors discussing in a frank tone how they would preserve fetal organs during an abortion in order to obtain intact specimens to donate for medical research. In one video, a Planned Parenthood official jokes that she would like to buy a Lamborghini with the modest reimbursements her clinic receives from fetal tissue procurement companies. \nPlanned Parenthood maintains that it has done nothing illegal; a law passed in 1993 explicitly allows for the donation of fetal tissue after elective abortions and small reimbursements for the associated costs. The family planning organization reported that it receives no more than $60 per specimen, which only covers the costs of transporting and preserving the tissue. Five state investigations into Planned Parenthood have turned up no evidence of wrongdoing. But the videos have enraged abortion opponents, who claim Planned Parenthood is engaged in the illegal trafficking of fetal body parts for profit. \nAbortion providers are staying mum about the threats for security reasons. A Planned Parenthood spokesperson said the organization is concerned about the safety and security of its providers in the wake of the videos, but could not comment on the specifics of the threats or the security measures it is taking. Nucatola could not be reached for comment, and StemExpress directed all questions to the press releases it has already issued on its website . \nThe Department of Justice convened a meeting of its National Task Force on Violence Against Health Care Providers in the wake of the videos. Saporta said law enforcement is continuously investigating death threats online as her organization finds and reports them. \n\"We would like to see this deescalate and not continue to escalate into a violent incident,\" she said. ", "external_links": [], "published": "2015-09-03T23:26:00.000+03:00", "crawled": "2015-09-03T23:25:46.145+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}