{"organizations": ["Fox News Latino FILE", "EU", "AP"], "uuid": "f974a724956828f72e2f609351ecb9c28458beae", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Migrant%20woes%20US%20Europe%20Latino.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/08/divisions-over-immigration-are-common-ground-between-us-europe/", "country": "", "title": "Divisions over immigration are common ground between U.S. and Europe | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Divisions over immigration are common ground between U.S. and Europe | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T15:30:00.000+03:00", "replies_count": 0, "uuid": "f974a724956828f72e2f609351ecb9c28458beae"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/08/divisions-over-immigration-are-common-ground-between-us-europe/", "ord_in_thread": 0, "title": "Divisions over immigration are common ground between U.S. and Europe | Fox News Latino", "locations": ["Roszke", "Hungary", "U.S.", "Africa", "Europe", "Middle East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Divisions over immigration are common ground between U.S. and Europe Published September 08, 2015 Fox News Latino FILE - In this Tuesday, Sept. 1, 2015 file photo, a Hungarian police officer looks through binoculars as he checks the border for refugees entering the country illegally next to the town of Roszke, Hungary. In the 28-nation EU, some countries have sought to block the unprecedented flow of migrants fleeing war or poverty in the Middle East and Africa. (AP Photo/Santi Palacios, File) \nNEW YORK (AP) – The United States and the European Union project themselves as models for the world when it comes to democracy and human rights. Yet a common issue — migration — is bitterly dividing each of them, testing whether they can maintain solidarity amid virulent debate over border controls, deportations and national values. \nIn the 28-nation EU, some countries have sought to block the unprecedented flow of migrants fleeing war or poverty in the Middle East and Africa, while Germany — the EU's powerhouse — is bracing to handle 800,000 migrants this year and wants other nations to step up as well. \nIn the U.S., the influx of immigrants entering illegally has eased recently, but the political rhetoric is red-hot. Donald Trump, the leading Republican presidential candidate, is calling for mass deportation of millions of immigrants living in the U.S. without legal permission, and some of his rivals have joined in proposing to stop granting citizenship to children born to such immigrants and to wall off the U.S.-Mexico border. \nIn Europe, the future of the EU's passport-free internal borders is now in question, and a rising death toll adds to the sense of urgency. More than 2,800 migrants have died this year trying to reach Europe, mostly at sea, according to the International Organization for Migration; the decomposing bodies of 71 migrants were found Aug. 27 in an abandoned truck near Vienna, apparently after suffocating. \nOn Hungary's border with Serbia, some 300 flag-waving extremists marched to a crossing point a few days ago and shouted at frightened migrants — many of whom had just completed a daylong hike — to go back where they came from. \nIt was reminiscent of the scene in July 2014 in Murietta, California, where screaming anti-immigration protesters, some waving American flags, blocked buses of women and children headed to a Border Patrol processing center after making their way to the U.S. from troubled parts of Central America. \"Return to Sender\" was among the messages on the protesters' signs. \nSo volatile is the issue that President Barack Obama has drawn fire from both the left and right for his moves on immigration. \nSupporters of a crackdown were angered by Obama's efforts to ease up on deportation of immigrants living illegally in the U.S. over the long term. Led by Texas, 26 states have sued to block that change in deportation policy. \nIn contrast, immigrant-rights groups note that Obama has overseen a record number of deportations and allowed the detention of many of the Central American mothers who flooded across the border with their children. \n\"Our historical narrative is that the U.S. is welcoming, that we are a nation based on immigrants,\" said Cecillia Wang, head of American Civil Liberties Union's immigrants' rights project. \"It's incredibly sad and disappointing that we have lost sight of those values... and are detaining and deporting asylum seekers as a way of deterring other people.\" \nIn Europe, where an estimated 364,000 migrants have arrived so far this year, there's been relatively little use of deportations and detentions during the current crisis. New arrivals landing in Greece, Italy and elsewhere have not been turned back; many assume they will be allowed to stay in Europe indefinitely. \nDemetrios Papademetriou, president emeritus of the Washington-based Migration Policy Institute, said this approach by the EU is workable and humane when the influx of migrants is modest, but may soon become unfeasible. \n\"Are we seeing the vanishing of the Mediterranean borders of the EU or not? In the next six months we'll find the answer,\" he said. \"Europe has its back against the wall. It can't say, 'We'll take in all of you and treat you well.'\" \nIn Germany, which is accepting more migrants than any European nation, Chancellor Angela Merkel has argued that the EU risks betraying its core commitment to human rights. \n\"If Europe fails on the question of refugees, this close connection with universal civil rights will be destroyed and it won't be the Europe we want,\" she said. \nIn many EU countries, the debate has grown nastier due to the rise of nationalist and right-wing anti-immigration political movements. Such parties have won double-digit support in recent elections in Sweden, Austria, Denmark, Hungary, France, Britain and the Netherlands. \nIn Germany, by contrast, the major parties have taken a unified stance in support of welcoming refugees, and the far-right National Democratic Party won only 1.5 percent of the vote in the latest parliamentary elections. \n\"It's a very sensitive issue, and here in Germany we're trying not to politicize it,\" said Astrid Ziebarth, a Berlin-based migration specialist with the German Marshall Fund. \"There have been different opinions and stances, but a general agreement that we can manage the refugee situation.\" \nHowever, she said even Germany — while expected to accommodate most asylum-seekers from war-torn countries — is likely to rebuff many of the \"economic\" migrants arriving from non-EU Balkan countries such as Albania and Kosovo. \nJust as the migrant crisis has created rifts among EU nations, immigration has sharply divided jurisdictions in the U.S. There are now about 11.3 million immigrants living in the country illegally, according to the Pew Research Center, down from a peak of 12.2 million in 2007. \nScores of cities have adopted \"sanctuary\" policies that offer some sort of protection to immigrants who lack legal status. In some states, they can get driver's licenses. \nIn contrast, Arizona, Alabama and a few other states enacted laws in 2010 and 2011 empowering local police officers to question people's immigration status and demand that they show documentation. Federal authorities and immigrant-rights groups took court action that blocked many of the provisions, but the disputes highlighted the deep divisions over immigration enforcement. \nThe Republican Party itself is divided. While Trump leads the polls as he advocates mass deportation, one of his main rivals, former Florida Gov. Jeb Bush, supports changes that would provide a rigorous pathway to legal status for immigrants in the U.S. illegally. Many Democrats, including presidential front-runner Hillary Rodham Clinton, go even further by advocating a pathway to full citizenship. \nOverall, there have been far more deportations under Obama than under his Republican predecessor, George W. Bush, with an increased emphasis in recent years on deporting people with criminal records and those who've just crossed the border. According to federal figures, there were 368,644 deportations in the 2013 fiscal year and 315,943 in 2014. \nDuring those years, tens of thousands of families and unaccompanied minors from Honduras, Guatemala and El Salvador surged across the U.S.-Mexico border. \nAuthorities sought to place most of the unaccompanied children with relatives in the U.S., but many of the families were detained. The detentions and deportations have angered immigrant-rights advocates, who say many of those Central Americans were fleeing rampant violence and met the standards for obtaining asylum. \n\"These are incredibly traumatized women and kids who do not belong in detention,\" said Karen Lucas, associate director of advocacy for the American Immigration Lawyers Association. \"The international community is watching us, and we will be judged as to how we respond.\" \nIn recent years, the U.S. has accepted roughly 55,000 to 70,000 refugees annually from scores of countries. But it has been criticized for accepting only a small number of the 4 million Syrians who have fled their war-torn homeland — fewer than 1,500 thus far, according to the International Rescue Committee. \n\"As the German government calmly says that it expects 800,000 refugees and asylum seekers in 2015, it is vital for the U.S. to step up its response,\" said the IRC's president, David Miliband. \nDan Stein, president of the Federation for American Immigration Reform, which advocates for tighter immigration controls, says both the EU and the United States face crucial choices. \n\"We can go down the road of accommodation and anarchy, or the path of law and the notion that sovereignty involves maintaining borders,\" he said. \nStein contends that Obama — by easing U.S. deportation policy — has sent an unwise message of welcome to other would-be migrants. \n\"You can see into our future by looking at Europe today,\" Stein said. \"The Obama administration is setting the stage for a sustained, uncontrolled influx from all over the world.\" \nKaren Tumlin, legal director of the National Immigration Law Center, hopes the U.S. draws a different message from the EU's crisis and heeds Merkel's advice to honor long-standing values. \n\"It's not like she's saying it's going to be easy,\" Tumlin said. \"She's saying we have to have certain principles.\" \nLike us on Facebook ", "external_links": [], "published": "2015-09-08T15:30:00.000+03:00", "crawled": "2015-09-08T15:30:30.134+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}