{"organizations": [], "uuid": "b0aeda9dd0eaab0285f68cbcb7223a786a7b76e3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3327316/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/democrats/feed", "section_title": "Democrats on Huffington Post", "url": "http://www.huffingtonpost.com/marvin-meadors/obama-has-to-brag-more-economy_b_8052330.html", "country": "US", "title": "Marvin Meadors: Obama Has to Brag More About the Economy", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Marvin Meadors: Obama Has to Brag More About the Economy", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T14:36:00.000+03:00", "replies_count": 0, "uuid": "b0aeda9dd0eaab0285f68cbcb7223a786a7b76e3"}, "author": "Marvin Meadors", "url": "http://www.huffingtonpost.com/marvin-meadors/obama-has-to-brag-more-economy_b_8052330.html", "ord_in_thread": 0, "title": "Marvin Meadors: Obama Has to Brag More About the Economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nSpeaking of President Obama's economic record, Terry McAuliffe, who was chairman of Mrs. Clinton's 2008 presidential campaign, stated, \"I think they need to do a much better job of explaining their successes. I don't get it.\" In fact, he called on President Obama to \"market his policies better .\" \nPresident Obama is a self-effacing man. He was never one to highlight his own accomplishments or strike too dramatic a chord. In his primary contest against Hillary Clinton years ago he was labeled \"no drama Obama\" by his campaign staff and the media. However, these times call for a little drama! \nHe inherited an economy in free fall, a nation engaged in two wars, and one which had lost faith in the very functioning of government because of the calamitous Bush years. In fact, on Obama's very inaugural night , Republicans were already meeting to undermine his presidency. Newt Gingrich and several GOP lawmakers loomed large in this Machiavellian plot to sabotage him. \nA $800 million dollar stimulus was passed without a single Republican vote -- a much smaller one than many liberal economists called for, such as, Joseph Stiglitz and Paul Krugman. As a result, the country was pulled kicking and screaming from the Great Bush Recession. The stimulus was credited with creating or saving one million jobs and boosting GDP \" by between 2 and 2.5 percent from late 2009 through mid-2011.\" \nWhile wages have remained stubbornly stagnant and many are still hurting, especially in minority communities, the economy has added \"7.2 million jobs, and the unemployment rate is now lower than the historical median \" since Obama took office. This record is especially impressive given that the economy lost 4.3 million jobs in his first 13 months in office due to the recession he inherited. In a direct comparison, the economy actually lost private sector jobs during the two terms of the Bush administration, a remarkable underachievement. In fact, Bush's job creation performance was the worst since Hoover . \nThe unemployment rate is now at 5.3 percent , which has fallen from 10 percent during the height of the Great Recession. The stock market has reached record highs, only stumbling in the last couple weeks due to a slowing of growth in China , but again rebounding in the last two days. \n\" The federal deficit has shrunk from 12.1 percent of GDP in FY 2009 to just 2.4 percent in FY 2014\", which should please deficit hawks in both parties. A bipartisan GOP would praise this reduction in the federal deficit relative to GDP instead of one where the Republican presidential candidates are repeatedly touting the president's economic record as a failure. \nThe right says the real reason for the decline in unemployment is the decline in the labor force participation rate, which is a measure of the number of people employed or actively looking for work. According to most mainstream economists, the majority of the decline in the labor force participation rate, however, can be explained by changing demographics , primarily the increased retirement of baby boomers. \" The Federal Reserve released a report on the labor force participation rate and they came to the conclusion that as much as 65 percent of the decline in the labor force participation rate can be attributed to changing demographics.\" \nPunctuating this economic performance is the fact that the Commerce Department just announced that the nation's gross domestic product grew at a seasonally adjusted 3.7 percent in the spring, faster than the initial estimate of a 2.3 percent growth rate. \nAnd how did the president highlight this feat? In a speech in New Orleans at the 10th anniversary of Hurricane Katrina, Obama opined with his characteristic understatement that the U.S. \"remains an anchor of global strength and stability in the world.\" \nStill \"half of the country flat out disapproves of how the president is handling the economy, according to recent Wall Street Journal/NBC poll .\" The polling indicates that the president and the Democratic presidential contenders need to do a much better job at trumpeting this economic performance. Is there any doubt that if a Republican was in office the GOP would be screaming to the rooftops about a 3.7 percent growth in GDP and a coordinated media campaign to get out the message would result? \nDemocrats always seem to concede the narrative to Republicans -- perhaps because Republicans are so much better at the repetition of simple, digestible sound bites. Fox News has built an empire on repeating such far right noise. However, now is the time for Democrats to rally and speak in unison about the economic performance under this president, something Republicans orchestrate so well. While not stellar and considering we were on the brink of collapse, the president's economic performance is highly notable and praiseworthy. As a party, the Democrats should bury their pride and brag a little, in fact, quite a lot! More:", "external_links": [], "published": "2015-08-28T14:36:00.000+03:00", "crawled": "2015-08-28T18:56:42.604+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}