{"organizations": [], "uuid": "f5af7438919a0bb2e3d890c19edc7f6b0366ee67", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150827102053-trump-wearing-red-hat-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_news_economy.rss", "section_title": "Economic news - CNNMoney.com", "url": "http://money.cnn.com/2015/09/02/investing/donald-trump-wall-street/index.html?section=money_news_economy", "country": "US", "title": "Donald Trump might hate Wall St. more than Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Donald Trump might hate Wall St. more than Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T15:21:00.000+03:00", "replies_count": 0, "uuid": "f5af7438919a0bb2e3d890c19edc7f6b0366ee67"}, "author": "", "url": "http://money.cnn.com/2015/09/02/investing/donald-trump-wall-street/index.html?section=money_news_economy", "ord_in_thread": 0, "title": "Donald Trump might hate Wall St. more than Obama", "locations": ["Mexico", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Heather Long", "Donald Trump", "Obama"], "text": "By Heather Long @byHeatherLong Donald Trump: I'll take jobs from China, Mexico President Obama was roundly criticized when he dubbed Wall Street bankers as \" fat cats \" in a 2009 interview on \"60 Minutes.\" But that comment sounds almost tame compared to Donald Trump's recent jabs. \nThe Republican presidential candidate said hedge fund managers are \" getting away with murder \" on a recent appearance on CBS' \"Face the Nation.\" \n\"The hedge fund guys didn't build this country. These are guys that shift paper around and they get lucky,\" he said. \nTrump's comments almost appear even further to the left than Obama's. It's a populist tone. \n\"There's great antipathy toward big banks and Wall Street. You see it in all the polls,\" says Greg Valliere, chief political strategist at Potomac Research. Still, \"it's particularly surprising to hear a Republican do it.\" \nRelated: Donald Trump says tax the rich more \nWhile Wall Street isn't exactly popular, presidential candidates have tended to do a dance with bankers. They may criticize the financial industry somewhat, but they want their campaign contributions. \nObama, for example, got millions from the investment industry in both his campaigns, according to the Center for Responsive Politics, although it's notable that he received far less in 2012 after he enacted new reforms on Wall Street and made the \"fat cats\" remark. \nBut Trump doesn't need that cash, at least not right now. He is self-funding his campaign. \nIt enables him to be more bold. \nRelated: Everything you want to know about Donald Trump's bankruptcies \nTrump wants hedge funds managers to pay more in taxes . He's proposed getting rid of the \"carried interest\" loophole in the tax code that allows investment managers, especially private equity and hedge funds, to have most of the their earnings taxed at the capital gains tax rate of 20% -- far lower than the top income tax bracket of 39.6%. \n\"They're paying nothing, and it's ridiculous. I want to save the middle class,\" Trump said. \nTrump hasn't said what rate he thinks the middle class should be taxed at, he has said enough is enough on the low tax rate of hedge fund managers. \n\"I don't know anyone who can justify [carried interest] with a straight face,\" says Dean Baker, co-director of the left-leaning Center for Economic and Policy Research. \"In terms of going after something that is unjustified, Trump is certainly right.\" \nThat said, Baker doesn't think Trump's hedge fund criticism is on par with prominent Wall Street critics Bernie Sanders and Elizabeth Warren, both Democratic senators. Trump isn't proposing any extra regulations on Wall Street beyond a tax code change. \nWarren, in contrast, wants to break up the big banks like Bank of America ( BAC ) and JPMorgan so they will never be \"too big to fail\" again. Sanders, now a presidential candidate who is moving up in the polls, has proposed a \"financial transaction tax\" on all Wall Street trades. Trump hasn't embraced either of those ideas. \nRelated: Elizabeth Warren says the market is broken \nTrump may not be taking Wall Street's money, but he has strong ties there. He often cites his friendship with billionaire hedge fund manager Carl Icahn. Trump says if he is elected president, he would make Icahn his treasury secretary . \nIcahn apparently called Trump to have a chat after Trump's latest round of anti-Wall Street rhetoric, according to Reuters. \nStill, Trump's Wall Street comments are almost the opposite of what many of his Republican opponents are saying. \nGOP candidates like Marco Rubio want to repeal Dodd-Frank, the law enacted after the financial crisis to curb the worst of Wall Street's practices. It's a key annoyance for the financial industry. \nJPMorgan Chase ( JPM ) CEO Jamie Dimon says his bank is \" under assault \" from regulators these days.", "external_links": [], "published": "2015-09-02T15:21:00.000+03:00", "crawled": "2015-09-02T15:38:11.347+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}