{"organizations": [], "uuid": "b25e8b3b43c20a4a72003f476e4aa3bf9c1db870", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/083115_an_corke_640.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,0,00.rss", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/08/31/in-alaska-obama-depicts-stark-future-without-climate-action/", "country": "US", "title": "In Alaska, Obama depicts stark future without climate action News", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "In Alaska, Obama depicts stark future without climate action | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "b25e8b3b43c20a4a72003f476e4aa3bf9c1db870"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/08/31/in-alaska-obama-depicts-stark-future-without-climate-action/", "ord_in_thread": 0, "title": "In Alaska, Obama depicts stark future without climate action News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 31, 2015 Associated Press Facebook 0 Twitter 0 Email Print \nANCHORAGE, Alaska –   Submerged countries, abandoned cities and floods of refugees await the world barring urgent action on climate change, President Obama warned Monday, painting a doomsday scenario as he opened a historic visit to Alaska.\nIn a bid to further his environmental legacy, Obama brought the power of the presidential pulpit to Anchorage and called on other nations to take swift action as negotiations for a global climate treaty near a close. In a speech to an Arctic climate summit, Obama sought to set the tone for a three-day tour of Alaska that will put the state's liquefying glaciers and sinking villages on graphic display.\n\"On this issue — of all issues —there is such a thing as being too late,\" Obama said. \"And that moment is almost upon us.\"\nDuring his tour of Alaska, Obama planned to hike a glacier, converse with fishermen and tape a reality TV show with survivalist Bear Grylls — all part of a highly orchestrated White House campaign to illustrate how climate change has damaged Alaska's stunning landscape. The goal at each stop is to create powerful visuals that show real-world effects of climate change and drive home Obama's message that the crisis is already occurring.\nEvoking ominous consequences, Obama said that climate change left unchecked would soon trigger global conflict and \"condemn our children to a planet beyond their capacity to repair.\" In the Arctic, which is warming faster than any other corner of the globe, Obama said melting permafrost and disintegrating sea ice risk floods, fires and unimaginable economic damage.\n\"It's already changing the way Alaskans live,\" Obama said.\nObama has two audiences in mind as he traverses Alaska this week: Alaskans, who are hungry for more energy development to boost the state's sagging oil revenues, and the broader public, whose focus Obama hopes to concentrate on the need for drastic action to combat global warming, including a climate treaty that he hopes will help solidify his environmental legacy.\nWhether Obama can successfully navigate those competing interests — energy and the environment — remained the prevailing question of his trip.\nThe president has struggled to explain how his dire warnings and call to action to cut greenhouse gases square with other steps he's taken or allowed to expand energy production, including oil and gas. Environmental groups took particular offense at the administration's move to allow expanded drilling off Alaska's northwest coast — just a few weeks before Obama arrived in Alaska to preach on climate change.\nEven Alaska Natives, who have echoed Obama's warnings, have urged him to allow more oil and gas to be sucked out of Alaska's soil and waters. Alaska faces a roughly $3.5 billion deficit this year as a result of falling oil prices, forcing state budget cuts that have wreaked havoc on rural services.\n\"History has shown us that the responsible energy development which is the lifeblood of our economy can exist in tandem with, and significantly enhance, our traditional way of life,\" leaders of the Arctic Slope Regional Corporation, which represents Inupiat Eskimo shareholders, wrote Monday in a letter to Obama.\nWalking a fine line, Obama sought to portray the U.S. as doing its part even as it develops energy resources it will need during the longer-term transition to cleaner, renewable fuels. He ticked through a list of steps he's taken to cut greenhouse gas emissions and said America is doing its part.\n\"We're proving that there doesn't have to be a conflict between a sound environment and strong economic goals,\" he said.\nObama's first stop after arriving in Anchorage was a listening session with Alaska Natives, who relayed concerns about crippling energy costs and uncertainty about hunting and fishing rights. Highlighting what he described as progress for Alaska Natives on his watch, Obama said he hoped to be setting a new pattern of cooperation that would extend beyond his presidency.\nHis tour continues Tuesday with a boat tour Kenai Fjords National Park and a hike to Exit Glacier, a sprawling expanse of ice that is retreating amid warming temperatures. In southwest Alaska on Wednesday, Obama will meet with fishermen locked in conflict with miners over plans to build a massive gold and copper mine in Bristol Bay, home to the world's largest salmon fishery.\nObama will close his trip by becoming the first sitting president to travel north of the Arctic Circle. In Kotzebue — population 3,153 — Obama planned to address the plight of Alaska Natives, who face dire economic conditions amid some of the worst effects of global warming.\n\"They don't get a lot of presidents in Kotzebue,\" quipped Alaska Gov. Bill Walker, who joined Obama for the flight to Anchorage.\nThe White House unveiled a new National Park Service map bearing the name Denali on the former Mount McKinley. Before departing Washington, Obama announced that North America's tallest mountain was being renamed using its traditional Athabascan name. The move drew applause from Alaska's leaders and harsh condemnations from Ohio politicians angry that the name of its native son, former President William McKinley, will be erased from the famed peak.", "external_links": [], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-09-01T05:57:47.218+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}