{"organizations": [], "uuid": "23cd420860a4ed29b4f0dd031d0a1c2a42c50970", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e60cc3170000430156933e.jpeg?cache=TPEbRPTurv", "site_section": "http://www.huffingtonpost.com/feeds/verticals/religion/news.xml", "section_title": "Religion News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-rejects-the-charge-that-defending-the-iran-deal-makes-him-anti-semitic_55e5e8dae4b0aec9f354b222", "country": "US", "title": "Obama Rejects Iran Deal Critics' Charges Of Anti-Semitism", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Rejects Iran Deal Critics' Charges Of Anti-Semitism", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T00:05:00.000+03:00", "replies_count": 0, "uuid": "23cd420860a4ed29b4f0dd031d0a1c2a42c50970"}, "author": "Carol Kuruvilla", "url": "http://www.huffingtonpost.com/entry/obama-rejects-the-charge-that-defending-the-iran-deal-makes-him-anti-semitic_55e5e8dae4b0aec9f354b222", "ord_in_thread": 0, "title": "Obama Rejects Iran Deal Critics' Charges Of Anti-Semitism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Rejects Iran Deal Critics' Charges Of Anti-Semitism Obama sat down with leading American Jewish voices to defend the nuclear deal with Iran. Religion News Service By Lauren Markoe Posted: 09/01/2015 05:05 PM EDT \n( RNS ) President Obama told the editor of an influential Jewish publication that “there’s not a smidgen of evidence” that he is anti-Semitic, a charge some critics have leveled as the president defends the Iran nuclear deal. \nJane Eisner, editor-in-chief of The Forward, used her 45 minutes in the Oval Office Friday (Aug. 28) to ask Obama to respond to critics of the deal, which has divided the Jewish community — and also what she called “a more personal question.” \n“Does it hurt you personally when people say that you’re anti-Semitic?” \n“Oh, of course,” he told Eisner. “And there’s not a smidgen of evidence for it, other than the fact that there have been times when I’ve disagreed with a particular Israeli government’s position on a particular issue.” Ron Sachs \nIn addition to the interview with The Forward, Obama spoke with Jewish American leaders via a separate video webcast watched live by more than 5,000 YouTube users on Friday . \n“Apparently we were able to find one venue we have not already used” to lobby for the Iran deal, White House Press Secretary Josh Earnest said. \nThough American Jews are divided over the deal, Israeli Jews largely oppose it, polls show. Earlier this year, Israeli Prime Minister Benjamin Netanyahu addressed Congress and argued that Iran could not be trusted . Congress is expected to vote on the deal in September. \nDiscussing the vitriolic rhetoric supporters and opponents of the deal have lobbed at each other, Eisner told Obama that “even some of his supporters say that he has contributed to the incendiary language by implying that opponents of the deal are ‘warmongers.’” \n“He rejected that outright,” Eisner wrote. “It was the only time during our interview that I saw him bristle and his back stiffen.” \nObama’s use of the term “warmonger” has offended some who note age-old anti-Semitic conspiracy theories charging Jews as conniving forces behind war. \n“What I said,” Obama explained to Eisner, “is that if we reject the deal, the logical conclusion is that if we want to prevent Iran from getting a nuclear weapon, military strikes will be the last option remaining at some point. It may not be under my administration; it might be under the next one. And that is something that has to be taken into account.” \nObama also likened the current chill between him and Netanyahu to a family spat, reaffirmed the historically strong alliance between the U.S. and Israel, and predicted that tensions over the deal would dissipate as the deal itself proved itself the best strategy to assure that Iran does not build a nuclear weapon. \nThe president received tough but respectful questioning from the moderators of the Friday YouTube webcast, which included leaders of the Conference of Presidents of Major American Jewish Organizations and the Jewish Federations of North America. \n﻿ ﻿Also On HuffPost:", "external_links": [], "published": "2015-09-02T00:05:00.000+03:00", "crawled": "2015-09-02T00:23:46.928+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}