{"organizations": [], "uuid": "1e68720d630acec80ab78da97a66ed6a96a32871", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3363818/images/o-CUBA-EMBARGO-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/barack-obama/feed", "section_title": "Barack Obama on Huffington Post", "url": "http://www.huffingtonpost.com/jose-gabilondo/can-obama-end-longtime-cuba-embargo_b_8059762.html", "country": "US", "title": "Jose Gabilondo: Can Obama Unilaterally End the Cuba Embargo?", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Jose Gabilondo: Can Obama Unilaterally End the Cuba Embargo?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T16:34:00.000+03:00", "replies_count": 0, "uuid": "1e68720d630acec80ab78da97a66ed6a96a32871"}, "author": "Jose Gabilondo", "url": "http://www.huffingtonpost.com/jose-gabilondo/can-obama-end-longtime-cuba-embargo_b_8059762.html", "ord_in_thread": 0, "title": "Jose Gabilondo: Can Obama Unilaterally End the Cuba Embargo?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nEspecially when imposed by a hegemon on a small and vulnerable country, an embargo is an act of political hatred for that country and its people. Its goal is to isolate these targets from the support of others, so an embargo also visits collateral damage on third parties. \nPresident Obama has said that he wants to end the Cuban embargo. Soon he must make two decisions that will suggest how serious he is. \nThis month he must decide whether the Trading With the Enemy Act still authorizes sanctions against the island. TWEA requires an annual determination by the president that a national emergency exists with respect to Cuba, one that justifies sanctions. Every U.S. President since Jimmy Carter (including Obama ) has so determined. This year is different, as I have pointed out . On December 17, 2014, the leaders of both countries announced the restoration of diplomatic relations. Given this rapprochement, I don't believe that the president can invoke TWEA, even if he wanted to. Such emergencies may have existed during the Cuban missile crisis or the Mariel boatlifts , but budding diplomatic relations do not an emergency make. Though a handful of hardliners (in the U.S. and, to a much lesser extent, Cuba) oppose normalization, it enjoys broad support. Scrapping TWEA would not mean the end of Cuba sanctions, because they rest on other legal support . The embargo began as a creature of executive discretion in 1962 when Kennedy imposed it. His statutory authority was the Foreign Assistance Act of 1961, which allowed - but did not require - him to do so. Added later as separate authority for the sanctions, TWEA also allowed but did not require an embargo. \nIn 1992, Cuba hawks in Congress tried to bind the president's hands. Fearing a dovish executive, they 'codified' the embargo. This meant enacting as federal statute rules that had formerly depended on the president's discretion. This legislative strategy intensified four years later with the Helms-Burton Act , which added new preconditions for the embargo to be lifted. By sleight of hand, Congress had shifted the locus of control of the embargo from the president to Congress. Or so it seemed. A second litmus test of the president's resolve is the annual resolution of the United Nations against the embargo. Last year, all but five of the General Assembly´s 193 countries supported it. Predictably, the U.S. has opposed the resolution for over 20 years. \nFor the first time in half a century, though, the president and Congress have parted ways on Cuba. Though confirmed by Congress to represent the U.S in the United Nations, Ambassador Power represents the president, who has spoken against the embargo. She should support the resolution or at least abstain during the vote, recognizing the federal government´s internal conflicts on the issue. We´ll see. Can the president end the embargo on his own? According to the Congressional Research Service, the consensus is 'no' because of Congress' 1992 and 1996 power grabs. The question of independent presidential authority never mattered while the president and Congress were in cahoots because executive authority is unambiguously broad enough to support the embargo. Occasional inter-branch skirmishes took place, as when President Carter authorized the Cuban and U.S. interest sections, but they did not rupture the policy harmony. \nNow the question of presidential authority becomes relevant because the president and Congress hold sharply different views. The Constitution divides authority for foreign affairs between the president and Congress, although determining their respective roles can be tricky. Sometimes Congress must yield to the president, however, the Israeli passport case being a good recent example. Insofar as the embargo - the executive embargo - rested on authority vested only in the president - but not Congress - the 'codifications' fall short of the goal. So what? Well, in a long-arm assertion of executive power, the president could retract any discretionary executive authority for the embargo. Just as TWEA was added as additional authority, a notice in the Federal Register could state that henceforth the embargo rested neither on TWEA nor the Foreign Assistance Act of 1961 but, instead, only on Congress´ putative codification. That would leave a Congressional embargo on Cuba, implemented by the president insofar as required to statutorily, but no further. \nWould that embargo be different from the one currently supported by executive authority? Maybe. It depends on whether Congress had authority on its own to impose and remove an embargo on Cuba, a legal question yet to be adjudicated by federal courts. \nThe president wouldn't have to litigate the issue. By explicitly revoking all discretionary executive authority for the embargo, he'd be clearing a path for private actors to challenge the Congressional embargo in federal courts. \nAssume that the president revokes this authority. Imagine a U.S. business that wants to trade with Cuba but is stymied by the Congressional embargo. Without executive support, the sanctions become more vulnerable to legal challenge. If the business could show standing (no mean feat), a district court might be persuaded to take up the question now. \nFederal courts often - but not always - stay out of disputes between the president and Congress over who can do what in international affairs, so I'm not holding my breath. That said, the only players in this drama are not the Congress, the president, and the Cuban government. As it must, D17 will create new incentives for private actors to get involved now that the stakes on the island are higher. \nFollow Jose Gabilondo on Twitter: www.twitter.com/JMGabilondo More:", "external_links": [], "published": "2015-08-31T16:34:00.000+03:00", "crawled": "2015-08-31T20:57:59.948+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}