{"organizations": [], "uuid": "52fe58456d37f6553a12247b9183673b84ded6d9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaalska.png", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/energy-environment/251450-obama-to-mark-katrina-anniversary", "country": "", "title": "Obama to mark Katrina anniversary | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama to mark Katrina anniversary | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T19:29:00.000+03:00", "replies_count": 0, "uuid": "52fe58456d37f6553a12247b9183673b84ded6d9"}, "author": "", "url": "http://thehill.com/policy/energy-environment/251450-obama-to-mark-katrina-anniversary", "ord_in_thread": 0, "title": "Obama to mark Katrina anniversary | TheHill", "locations": ["Jordan Fabian"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama to mark Katrina anniversary White House By Jordan Fabian - 08/19/15 11:48 AM EDT \nTen years after Hurricane Katrina devastated New Orleans, President Obama will visit the city to celebrate its recovery. \nObama on Aug. 27 will meet with Mayor Mitch Landrieu (D), tour neighborhoods and meet with local residents. He will deliver a speech hailing the city’s rebuilding efforts and how they have helped spur economic innovation, the White House said. ADVERTISEMENT The 2005 storm was the costliest natural disaster in U.S. history, flooding 80 percent of the city, killing more than 1,800 people and leaving a million people displaced. \nNew Orleans was still reeling from Katrina’s aftermath when Obama first took office, and next Thursday’s trip will give him the chance to frame the city’s recovery as a success for his administration. \nOn Katrina’s fifth anniversary, Obama slammed President George W. Bush’s response to the storm. \n“It was a natural disaster but also a man-made catastrophe,” he said during a speech in New Orleans. “A shameful breakdown in government that left countless men and women and children abandoned and alone.” \nThe Obama administration has focused on “bolstering the recovery efforts already underway by state, local and federal officials by cutting red tape to deploy important resources quickly, investing in hard hit communities, and ensuring that affected communities build back stronger and more resilient,” the White House said in a statement. \nObama will be accompanied by FEMA Administrator Craig Fugate, whose agency has given $6.5 billion to Gulf states since 2009 for infrastructure and public works projects to help them rebuild roads, bridges, schools, hospitals and homes. \nDuring a speech in Washington Tuesday, Landrieu praised both Bush and Obama’s efforts to help the city recover. \n“Thank you for caring for us during our time of need,” Landrieu said . Tags: ", "external_links": [], "published": "2015-08-19T19:29:00.000+03:00", "crawled": "2015-08-19T19:30:02.236+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}