{"organizations": [], "uuid": "dfb7c5ec6ba75d34bff4c93234c181c017a21adb", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://thehill.com/regulation/administration/252994-obama-administration-to-put-175-million-toward-apprenticeships", "country": "", "title": "Obama administration to put $175 million toward apprenticeships | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama administration to put $175 million toward apprenticeships | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T13:55:00.000+03:00", "replies_count": 0, "uuid": "dfb7c5ec6ba75d34bff4c93234c181c017a21adb"}, "author": "", "url": "http://thehill.com/regulation/administration/252994-obama-administration-to-put-175-million-toward-apprenticeships", "ord_in_thread": 0, "title": "Obama administration to put $175 million toward apprenticeships | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lydia Wheeler", "Obama"], "text": "Obama administration to put $175 million toward apprenticeships By Lydia Wheeler - 09/09/15 06:00 AM EDT \nThe Obama administration is spending $175 million on apprenticeship programs across the country in an effort to grow a skilled workforce. \nPresident Obama will announce the funding later Wednesday while visiting Macomb Community College in Warren, Mich. \nIn an call with reporters on Tuesday afternoon, Labor Secretary Tom Perez said 46 grantees will use the money to develop or expand apprenticeships in high-growth industries like healthcare, IT, high-tech services and advanced manufacturing. \nThose grants, which are the Department of Labor’s first to focus solely on apprenticeships, are expected to create 34,000 career-training opportunities, Perez said. \nInternational Transportation Learning Center in Silver Spring, Md. was among the grantees in the Mid-Atlantic region with a $5 million award to train signal maintainers and transit coach operators; Houston Community College was a southern grantee with a $4.2 million award to train workers in emerging healthcare and IT industries; and South Seattle College on the West Coast was awarded a $4.8 million to fund a partnership for advanced technology apprenticeships in manufacturing and marine engineering. \nAccording to the White House, the average starting salary for the 87 percent of apprentices that gain employment is over $50,000. For every dollar spent on the programs, employers get an average $1.47 back in higher productivity, retention rates and reduced waste, the White House said. \nAccompanied by second lady Jill Biden and Education Secretary Arne Duncan, Obama will also announce that an independent board has been formed to push Congress to make two years of community college free for students. \nCecilia Muñoz, director of the White House Domestic Policy Council, said Biden, who teaches at Northern Virginia Community College’s Alexandria campus, will chair the newly formed College Promise Advisory Board. Former Wyoming Gov. Jim Geringer will serve as vice-chair and former Secretary of Education Martha Kanter will serve as the board’s director. \nThe White House will also release a report later Wednesday that it says shows growing momentum behind efforts to make at least two years of college the norm. This year Oregon, Minnesota launched statewide programs, while communities in Pennsylvania, Illinois and Ohio found ways to make tuition free. And legislation has been introduced in 11 states to create free community college programs. 1 day Juan Williams: #BlackLivesMatter... OPINION | The movement is fast becoming its own worst enemy. Sanders to roll out criminal... Sanders called the current system \"broken\" and said his bill would be... Obama hits 41, cements Iran victory Obama has clinched the 41 votes he needs to block a resolution... Software pioneer McAfee files... McAfee reportedly would be “founding a new party yet to be announced.” House GOP faces shutdown crisis Heritage Action claims at least 28 Republicans will demand end to Planned... Trump 'felt' that he was in the... \"I felt that I was in the military ... because I dealt with those people... Trump storms Capitol for Iran... Trump, Cruz and others will rally in a show of force against the Iran... Kim Davis freed from Kentucky jail She was jailed for refusing to issue marriage licenses to same-sex couples. McConnell blocks Reid's offer on... Reid tried to set up a vote on the Iran deal later this week. Democrats pin Senate hopes on... The map of key Senate races largely matches up with presidential... Climate change: Seven indisputable... President Obama last week visited Alaska to preach about the inevitable... Protester interrupts Cheney speech “Dick Cheney is a war criminal,” a protester yelled. United Airlines CEO resigns amid... The resignation follows a pay-for-play investigation about flights at... Trump: 'I will renegotiate with... \"The next president better be someone who knows how to negotiate,\" Trump... Businesses wary of a President... Many business leaders are skeptical of his immigration, investment and... Biden road-tests 2016 message The vice president insists he has not made up his mind on a run. Mia Love: I billed taxpayers for... The freshman congresswoman had been reimbursed $1,160 to fly between Salt... Andrea Mitchell worried Hillary... “I couldn’t ask everything that I did want to ask,” NBC's Andrea Mitchell... Dick Morris: Sanders has a shot OPINION | Don’t assume that Hillary Clinton will be able to win in a walk... Conservatives prepare to make... It remains to be seen whether they can force the hand of leadership. Warren Buffett backs Trump on taxes \"I haven't heard him say anything yet that I disagree with,\" the... Obama eats 'bloody' salmon with... The fish was described by Grylls as a \"bloody carcass of half-eaten salmon... Poll: Trump beats Hillary head-to-... The survey finds Trump with 45 percent support and Clinton with 40 percent. Nine Obama regulations to watch Pressure is mounting on the administration to complete its regulatory... Krugman: Trump is 'right' on taxes... The economist and columnist said Trump is correct to embrace a tax hike on... Reid: I may be permanently blind... \"I'm sorry I hurt myself doing something that I've been doing for years.\" ", "external_links": [], "published": "2015-09-09T13:55:00.000+03:00", "crawled": "2015-09-09T13:55:05.860+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}