{"organizations": [], "uuid": "039854c16443773f963d1f72addbb867bae13acb", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150918104557-michelle-obama-colbert-620xa.jpg", "site_section": "", "section_title": "", "url": "http://money.cnn.com/2015/09/18/media/michelle-obama-stephen-colbert/index.html", "country": "", "title": "Michelle Obama to appear on 'Late Show' with Colbert - Sep. 18, 2015", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Michelle Obama to appear on 'Late Show' with Colbert - Sep. 18, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "039854c16443773f963d1f72addbb867bae13acb"}, "author": "", "url": "http://money.cnn.com/2015/09/18/media/michelle-obama-stephen-colbert/index.html", "ord_in_thread": 0, "title": "Michelle Obama to appear on 'Late Show' with Colbert - Sep. 18, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Stephen Colbert", "Tom Kludt", "Colbert", "Tim Cook", "Obama", "Michelle Obama"], "text": "Michelle Obama to appear on 'Late Show' with Colbert By Tom Kludt @tomkludt Tim Cook tells Stephen Colbert why he came out as gay All that's left for Stephen Colbert now is to book President Obama. \nWithin a month of assuming hosting duties of the \"Late Show,\" Colbert will have interviewed two of the president's closest confidants. Last week, Colbert welcomed Vice President Joe Biden on the program. And on Sept. 28, Colbert will sit down with Michelle Obama. \nCBS announced the first lady's appearance on Friday. \n\"It's always an honor to have the First Lady,\" Colbert said in a press release. \"Better than that, it's always fun!\" \nThe battle to book America's best-known politicians and public figures has emerged as a new front in the late night wars. \nDonald Trump will visit the \"Late Show\" next week, but the billionaire developer and Republican presidential frontrunner already appeared on the \"Tonight Show\" with Colbert's top rival, Jimmy Fallon, earlier this month. \nRelated: Late night booking wars: Fight for 2016 candidates \nAnd Colbert's producers were unable to book Hillary Clinton for his \"Late Show\" premiere because the former secretary of state was already in talks for an interview with Fallon. (Her \"Tonight Show\" appearance came on Wednesday.) \nBut Colbert has managed to land other 2016 contenders. He interviewed Jeb Bush on his first episode of the \"Late Show\" earlier this month, and Bernie Sanders will appear on the program tonight. \nRelated: Hillary Clinton and a fake Donald Trump helps Fallon beat Colbert \nThe political bookings are a reflection of the public's interest in the ongoing presidential contest, but they also speak to the candidates' desire to reach a different audience. \nBarack Obama became the first sitting president to appear on a late night talk show in 2009, when he was interviewed by Colbert's \"Late Show\" predecessor, David Letterman. President Obama has continued to make use of the format since then, making appearances on the \"Tonight Show, the \"Daily Show\" and \"Jimmy Kimmel Live.\" ", "external_links": [], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-18T19:56:01.734+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}