{"organizations": ["UN", "Facebook", "Fox News Obama", "Twitter"], "uuid": "bdab05753a68e462664de665ddbc8e95ec5971d4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_4515825713001_092815-rs-griffin-1280.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/28/obama-putin-meet-on-un-sidelines-after-dueling-statements-on-syria/", "country": "", "title": "Obama, Putin meet on UN sidelines after dueling statements on Syria | Fox News", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama, Putin meet on UN sidelines after dueling statements on Syria | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T00:38:00.000+03:00", "replies_count": 0, "uuid": "bdab05753a68e462664de665ddbc8e95ec5971d4"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/28/obama-putin-meet-on-un-sidelines-after-dueling-statements-on-syria/", "ord_in_thread": 0, "title": "Obama, Putin meet on UN sidelines after dueling statements on Syria | Fox News", "locations": ["Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Obama"], "text": "Obama, Putin meet on UN sidelines after dueling statements on Syria Published September 28, 2015 Facebook 0 Twitter 0 livefyre Email Print \nAfter delivering dueling public statements on the crisis in Syria, President Obama and Russia’s Vladimir Putin huddled in private late Monday afternoon for their first face-to-face meeting in nearly a year. \nThe two met on the sidelines of the United Nations General Assembly. Syria and Ukraine were expected to top the agenda for the sit-down. \nEarlier, the two clashed sharply in separate addresses to the General Assembly in New York City, with Obama urging a political transition to replace the Syrian president but Putin warning it would be a mistake to abandon the current government. \nObama said the U.S. is \"prepared to work\" with Russia and Iran to resolve the bloody Syrian civil war. \nBut, in a clear reference to Putin's support for the regime in Damascus, Obama said the world cannot see a \"return to the pre-war status quo\" in Syria. \n\"Let's remember how this started,\" Obama said. \"[Bashar] Assad reacted to peaceful protests by escalating repression and killing.\" \nWithout elaborating, Obama said \"compromise\" will be required to end the fighting in Syria and stomp out the Islamic State. But he said there must be a \"transition\" away from Assad. \nPutin, though, used his own address to voice support for the Syrian government and argue that its military is the only viable option for defeating the Islamic State. \n\"We believe it's a huge mistake to refuse to cooperate with the Syrian authorities, with the government forces, those who are bravely fighting terror face-to-face,\" Putin said during his first appearance at the U.N. gathering in a decade. \nObama and Putin's disparate views of the grim situation in Syria left little indication of how the two countries might work together to end a conflict that has killed more than 250,000 people and resulted in a flood of refugees. \nThe Syria crisis largely overshadowed the summit's other discussions on peacekeeping, climate change and global poverty. \nThe Obama-Putin meeting comes as Moscow builds up its military presence in Syria, for reasons that U.S. officials have said remain unclear. \nAhead of the meeting itself, the U.S. and Russia have quibbled even over who requested the meeting and what the focus would be. Putin wanted to talk about Syria; Obama wanted to concentrate on Ukraine. \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-09-29T00:38:00.000+03:00", "crawled": "2015-09-29T00:38:56.958+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}