{"organizations": ["Iran Deal Will Survive Past Obama"], "uuid": "e95ba1d3970e055a82e9aaa3ff6b064023cfdbab", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e8e9651d0000d101146c98.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/john-kerry-confident-the-iran-deal-will-survive-past-obama-plots-his-next-big-task_55e8e714e4b03784e275738b", "country": "", "title": "John Kerry, Confident The Iran Deal Will Survive Past Obama, Plots His Next Big Task", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "John Kerry, Confident The Iran Deal Will Survive Past Obama, Plots His Next Big Task", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T15:42:00.000+03:00", "replies_count": 0, "uuid": "e95ba1d3970e055a82e9aaa3ff6b064023cfdbab"}, "author": "", "url": "http://www.huffingtonpost.com/entry/john-kerry-confident-the-iran-deal-will-survive-past-obama-plots-his-next-big-task_55e8e714e4b03784e275738b", "ord_in_thread": 0, "title": "John Kerry, Confident The Iran Deal Will Survive Past Obama, Plots His Next Big Task", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Stein", "John Kerry"], "text": "Email John Kerry, Confident The Iran Deal Will Survive Past Obama, Plots His Next Big Task The secretary of state boldly predicts the deal will have a 90 percent approval rating by 2017. Sam Stein Senior Politics Editor, The Huffington Post Posted: 09/04/2015 07:50 AM EDT | Edited: 38 minutes ago \nWASHINGTON -- Having secured the votes to protect the Iran nuclear deal in Congress, Secretary of State John Kerry now sees the main threat to the long-term viability of the accord coming from abroad. \nIn an interview with The Huffington Post on Thursday , Kerry argued that domestic perceptions of the deal -- and by extension its political well-being -- would dramatically improve over time. And not just incrementally. The secretary of state predicted the country “will be 90 percent supportive” of the deal once the next president takes office, making it impossible for him or her to rip it up, as virtually every Republican candidate has promised to do. \n“I cannot see a president willfully taking the United Nations, five other nations who supported us in this negotiation and saying, 'Sorry, we're just going to walk away from this and create a more dangerous situation in the Middle East.' I just don't see that happening,” Kerry said, calling it “absurd” that a candidate would pull off such a move. \nThe aura of confidence from Foggy Bottom is the outgrowth of generally positive developments for the administration this past week. A number of Senate Democrats, formerly on the fence, announced their support for the Iran deal, thereby assuring the president can successfully veto a resolution of disapproval. \nAssessing the hurdles ahead, Kerry said his primary occupation was Iran’s domestic politics, not his own. \n“I think the one concern one would have is that you have some element within Iran that pushes back or refuses to do something. In which case, the Iranian government is going to have to answer for that , ” said Kerry. “So I can see the potential that you may have a hiccup here or there where you've got to confront something like that, but I don’t see the government, at this point, opening itself up to the potential of a snapback of all of these sanctions, and the potential obviously also of military action -- if that was the only option available.\" Huffington Post \nLike a well-practiced salesman pitching his product, Kerry touted the virtues of the deal and downplayed larger criticisms. He dismissed concern of a so-called heckler’s veto -- in which Iran, fattened by sanctions relief, might feel encumbered to walk away from the agreement if the U.S. were to go after it for activities like regional destabilization and terrorist sponsorship. And he outlined a future Middle East in which Israel and Gulf states, bolstered by defensive arms agreements with the United States, worked in “common cause” on a new “security architecture” for the region. \n“It will indeed be unique,” he said, “but I think that’s very much in the air right now.” \nPerhaps the most tantalizing geopolitical realignment, however, could take place between the U.S. and Iran. In an interview in early August, Kerry relayed to The Atlantic’s Jeffrey Goldberg that Iran’s Foreign Minster Javad Zarif said he’d be “empowered to work with and talk to” him about “regional issues” once the deal was finished. Those talks have yet to materialize, as the agreement has yet to formally take hold. But Kerry told The Huffington Post that he saw the resolution of the Syrian civil war as a potential area of collaboration, should Iran-U.S. relations further thaw. ASSOCIATED PRESS Secretary of State John Kerry with Iran's Foreign Minister Javad Zarif \nForging an end to that conflict would be an unexpected and masterful diplomatic stroke, one made all the more pressing by the worsening refugee crisis spilling into neighboring countries and Europe. Kerry said he had seen the powerful news image of a 3-year-old dead Syrian boy on a Turkish beach. And though he ducked the suggestion that the U.S. could take in more refugees, he did lay out steps to alleviate the burden in other countries, absent a resolution of the fundamental problem of Syria’s civil war. \n“Obviously you have to create a structure so those people aren't so desperate. They have to be provided with temporary housing, and the capacity to be fed,” said Kerry. “We have huge refugee camps in Jordan, in Lebanon. They're spread more in the population. In Turkey, we have refugee camps. It may be that we have to set up some sort of a refugee camp structure for the time being in order to deal with it.\" \nThe Syria crisis is one of several that Kerry said he hopes to tackle during his remaining time at the State Department. At the top of that bucket list, he said, was putting in place a larger international pact to address climate change during an upcoming summit in Paris. Matt Cardy via Getty Images The Syrian refugee crisis has spilled into Europe. Secretary Kerry acknowledged that more needs to be done. \nAs for matters of legacy, however, the secretary’s seems largely secured (for better or worse) with the all-but-certain passage of the Iran deal. A presidential run, he said, is “not on the table right now,” despite the persistent chatter amid the difficulties being encountered by Hillary Clinton (and before you read into the “right now” clause, he also said, more definitively: “I’m not running”). \nAnd in a way, the deal with Iran is an appropriate final, or near final, benchmark for his time in public service. As much as anyone other than Clinton, Kerry has been politically affected for his vote for the authorization of use of military force in Iraq in 2002. And though he bristled at the notion that there was something redemptive in his pursuit for a diplomatic resolution with Iran, it’s hard not to draw the lines between the two. Even he saw a common thread. \n“I regretted that vote ... because I thought it was abused. I thought there was a rush to war, contrary to what had been promised in terms of exhausting the remedies. So it was a bad vote. And that's the way it is,” said Kerry. “And I believe that in this case, we had an obligation to exhaust the possibility of a diplomatic solution with Iran before we start heading down a road towards inevitable conflict.\" \nTo read the full interview, click here . \nVideo production by Marielle Olentine, Jon Strauss and Samuel Wilkes. ", "external_links": [], "published": "2015-09-04T15:42:00.000+03:00", "crawled": "2015-09-04T15:42:30.885+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}