{"organizations": [], "uuid": "bac35a475f35694579136dc821fb006694cb96d3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/5605e02c1b00002f00dfd9a5.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/index.xml", "section_title": "WorldPost - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-xi-climate-cyber_5605d282e4b0dd850307b45a", "country": "US", "title": "Obama And Xi: A Lot Of Climate, A Little Cyber, Mostly Fluff", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama And Xi: A Lot Of Climate, A Little Cyber, Mostly Fluff", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T04:13:00.000+03:00", "replies_count": 0, "uuid": "bac35a475f35694579136dc821fb006694cb96d3"}, "author": "Akbar Shahid Ahmed", "url": "http://www.huffingtonpost.com/entry/obama-xi-climate-cyber_5605d282e4b0dd850307b45a", "ord_in_thread": 0, "title": "Obama And Xi: A Lot Of Climate, A Little Cyber, Mostly Fluff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama And Xi: A Lot Of Climate, A Little Cyber, Mostly Fluff The summit was historic more because it happened than because it achieved anything. Akbar Shahid Ahmed Foreign Affairs Reporter, The Huffington Post Posted: 09/25/2015 09:13 PM EDT Xinhua News Agency via Getty Images WASHINGTON D.C., Sept. 25, 2015-- Chinese President Xi Jinping, left, addresses a welcome ceremony held by U.S. President Barack Obama at the South Lawn of the White House in Washington D.C., the United States, Sept. 25, 2015. Xi arrived in Washington, the second stop of his state visit to the United States, on Thursday after a busy two-and-a-half-day stay in Seattle. (Xinhua/Pang Xinglei via Getty Images) \nWASHINGTON -- The leaders of the world's two most powerful countries just spent more than four hours together, with visions of their countries' futures on their minds and their most trusted aides at the ready. \nThey walked out without much to show for it. \nU.S. President Barack Obama and Chinese President Xi Jinping invited reporters to the White House Rose Garden on Friday to describe what they had discussed during meetings that morning and the night before. \nThey stood side by side, trying to project some level of intimacy despite their wooden body language. An accompanying White House fact sheet featured unsurprising announcements -- minor moves on issues ranging from cooperation in building a stable Afghanistan and preventing Iran's development of a nuclear weapon to expanding bans on the ivory trade and being more transparent in military actions, including the launch of ballistic missiles. \nTwo developments stood out. \nThe progress the two leaders made on combating climate change -- by introducing a cap-and-trade system of carbon emissions in China and underscoring the U.S. focus on reducing its own emissions -- topped their list of accomplishments. \nTheir movement on regulating cyberwarfare was a distant second -- which meant it largely met close observers' expectations. \nYes, Chinese hackers' penchant for digging through the computer systems of American businesses and government institutions has worried Washington for years. And yes, the Obama administration has faced increasing pressure to act following its announcement last year that it believed five Chinese army officers had tried to pilfer U.S. companies' trade secrets, and its suggestions that China was behind the recently revealed hack of millions of government employee records. \n\" We made very clear to China our deep concerns about certain cyberactivities,\" Ben Rhodes, deputy national security adviser, told reporters on Tuesday prior to Xi's arrival in Washington. \nBut Friday's press conference showed that those concerns would not be met immediately, in part because China is loath to acknowledge its role in the cyberattacks. \nInstead, the leaders reached a symbolic agreement -- one that matters because of its language, rather than any action it implies. \"Neither country’s government will conduct or knowingly support cyber-enabled theft of intellectual property, including trade secrets or other confidential business information,\" the two leaders pledged, according to the White House. \nCommitting to this agreement in principle does not guarantee any change of behavior, Obama emphasized. \" The question now is, are words followed by actions?\" the president said. \"We will be watching carefully to make an assessment as to whether progress has been made.\" \nYet it brings Beijing closer to tacitly acknowledging that state-sponsored cyberassaults on American business targets are possible -- which means it is one step closer to acknowledging that it may have initiated or at least encouraged such attacks. \nXi didn't make that kind of admission Friday, though he did condemn the theft of business information. \nThe Obama administration's dialogue with China about belligerence in the cybersphere has focused on the interests of American industry. It has retained that focus, even as officials like N ational Security Agency chief Michael Rogers warn that state-on-state cyberwarfare is a greater threat to the U.S. than attacks on the private sector. That's largely because shielding non-government actors is a more feasible battle for Washington. When it hears complaints about attacks on the U.S. government, Beijing is fond of pointing out that government-on-government espionage is de rigeur for most international players, including the U.S. \nThe U.S. believes China ultimately will realize that targeting American firms will be a self-defeating strategy, Rhodes told reporters on Tuesday. \" So we want to make very clear that this puts at risk China’s ability to continue on its economic growth if businesses don’t have confidence that they’re not going to be subjected to cybertheft,\" Rhodes said. \nThe two presidents spent little time talking about their points of disagreement, though they repeatedly said such disputes will not be settled any time soon. On contentious issues, they stuck to oft-heard talking points. Consider the globally important, resource-rich South China Sea. Obama mentioned U.S. concerns about China's expansion there. Xi argued that the Chinese have for millennia thought of themselves as owning a number of strategically located islands in the region. \nDespite the dearth of earth-shattering progress, Obama's focus on engaging with Xi and encouraging what he describes as the rise of a peaceful, internationally oriented China has, the Chinese president said, left the two countries making \"important progress.\" \nSkeptics of the U.S.-China relationship say that progress is possible because Obama is willing to overlook China's regressive approach to human rights. \nInfluential members of Congress held a bipartisan \"stateless\" breakfast on the Hill Friday, around the time Xi reached the White House, hoping to push human rights issues higher on the summit agenda. \nHouse Democratic Leader Nancy Pelosi (D-Calif.) and Republican presidential hopeful Sen. Marco Rubio (R-Fla.) attended the event, led by Rep. Jim McGovern (D-Mass.), Rep. Joe Pitts (R-Pa.) and Rubio. \n“We want to build a constructive relationship with China as a partner on the world stage, but the human rights abuses that continue there cannot be ignored,\" McGovern said. \"Today, we are giving a voice to all those who China has tried to silence.” \nBy partnering with civil society organizations like Human Rights Watch, the lawmakers featured testimony from six activists working on various human rights issues in China, including freedom of expression, women's rights, arbitrary detention and the targeting of the communist state's Muslim population. \nTheir entire message may not have made it all the way to 1600 Pennsylvania Avenue, but echoes of it did. Scores of protesters, their numbers swelling as the time of the Rose Garden press conference approached, chanted messages like \"Xi Jinping is a terrorist\" and \"murder murder Chinese government.\" \nReporters could hear the activists in the Rose Garden before the press conference began, and whenever one of the leaders paused during remarks. \nBut sure enough, camera shutters and lofty talk of China's success largely drowned them out -- relegating the talk of regime abuses to the status of an easily ignored addendum to Friday's historic summit. \nAli Watkins contributed reporting.", "external_links": [], "published": "2015-09-26T04:13:00.000+03:00", "crawled": "2015-09-26T05:44:45.279+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}