{"organizations": [], "uuid": "a10a4a732d9c592a6ffd6f73813ffd10f146efeb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/brownsherrod_041523gn.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed#", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/249897-sherrod-brown-obama-talked-it-out-after-warren-gender-spat", "country": "US", "title": "Sherrod Brown, Obama talked it out after Warren gender spat", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Sherrod Brown, Obama talked it out after Warren gender spat", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T16:52:00.000+03:00", "replies_count": 0, "uuid": "a10a4a732d9c592a6ffd6f73813ffd10f146efeb"}, "author": "bgoad@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/249897-sherrod-brown-obama-talked-it-out-after-warren-gender-spat", "ord_in_thread": 0, "title": "Sherrod Brown, Obama talked it out after Warren gender spat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sherrod Brown, Obama talked it out after Warren gender spat By Jordan Fabian - 07/31/15 09:52 AM EDT \nSen. Sherrod Brown (D-Ohio) revealed he had a lengthy conversation with President Obama, after he suggested gender played a role in the president’s feud with Sen. Elizabeth Warren (D-Mass.) on trade.Despite the charged nature of Brown’s comments , the Ohio senator said Friday he never accused Obama of sexism and that his personal relationship with the president was unharmed. “I did not use the word sexism, I did not say he was sexist,” Brown, a vocal critic of Obama’s trade agenda, said on the \"Bill Press Show.\" “I said it was inappropriate what he said. But we talked for 20 minutes on the phone a couple of days later — it’s fine.”Brown said he had an amiable conversation with Obama over the Export-Import Bank during a meeting at the White House two weeks ago. “It affected our personal relationship not at all,” he said.The Ohio senator in May accused the president of being “disrespectful” by repeatedly calling Warren by her first name, adding “he might not have done that for a male senator.” The National Organization of Women piled on , accusing Obama of being sexist. White House press secretary Josh Earnest said he expected an apology from Brown, but that it didn’t necessarily have to come publicly. Brown’s comments poured gasoline on the fire during the heated spat between Obama and Warren over trade. Warren emerged as one of Obama’s fiercest opponents during the debate over a bill to give the president fast-track power to negotiate free trade deals. While Brown said there is no hard feelings between him and the president, he expects the trade debate to heat back up when Congress debates the Trans-Pacific Partnership, which lawmakers could vote on as soon as January. “The rifts are still there and they will be apparent again when the TPP comes for a vote, probably in January,” Brown said. But he said the divide wouldn’t be permanent because Democrats agree on most core issues. “It will be divisive, but it will be healable,” he said of the trade debate. 1 day Fifth Planned Parenthood video... An official also discusses altering abortion procedures to meet specific... Bush drops 40 pounds on Paleo diet Bush talked about his weight loss in an interview at an Iowa Dairy Queen. Trump: Harvard students '... Trump fell victim to an elaborate prank by a group of Harvard students. Field set for first GOP debate Rick Perry fails to make the top 10, officially announced by Fox late... Senate GOP thwarted in effort to... Two Democrats voted to move forward with the bill, which stalled in a 53-... Kelly Osbourne makes racial remark... \"If you kick every Latino out ... then who is going to be cleaning your... Harvard Lampoon tricks Trump with... A fake endorsement called Trump \"the most formidable and competitive\" GOP... Iran denies link between... A website alleged that Javad Zarif’s son was the best man at Vanessa Kerry... Trump: Shut down government over... Trump called for the tactic to cut off the group's funding in the wake of... Trump's leaked phone number... Callers to Trump's number are told about his website and Twitter account. Poll: Clinton's favorability takes... Clinton is viewed unfavorably by 48 percent; favorably by 37 percent. Capitol Police: Staffer arrested... Rep. Duncan Hunter says his staffer is \"a hero\" and the incident must be... Judge extends block on videos from... A hearing is set for Aug. 27. Obama celebrated birthday at Rose'... The president and his guests reportedly skipped the line on their way in. McConnell's vow: No more... The Senate majority leader pledges to begin talks \"at some point.\" Three lines of attack against... Opponents are looking to all three branches of government to block the... Gawker publishes Trump phone number “Mr. Trump has several numbers so this is not an issue,” a campaign source... Juan Williams: GOP's anger turns... OPINION | Republicans who feed the resentments of the base imperil GOP... Congress holds hearing on... Why would anyone take seriously such a biased hearing on the BDS movement? Biden challenge to Clinton would... The biggest challenge would be finding a niche — and a reason for his... GOP lawmaker diagnosed with... Rep. Curbelo says last few weeks have been trying for family. Fifth Planned Parenthood video to... The videos have led to a defunding fight over Planned Parenthood. Two undocumented immigrants... VIDEO | The outcry was loud Monday night in Huntington Park, Calif. Carson: Black Lives Matter... Carson also discussed illegal immigration in an NBC interview.", "external_links": [], "published": "2015-07-31T16:52:00.000+03:00", "crawled": "2015-08-06T17:01:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}