{"organizations": [], "uuid": "776e729379c701e0217aa68c427b10232c1de3d8", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/11/politics/obama-waldorf-astoria/index.html", "country": "", "title": "Obama won't stay at Chinese-owned Waldorf-Astoria - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama won't stay at Chinese-owned Waldorf-Astoria - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T21:58:00.000+03:00", "replies_count": 0, "uuid": "776e729379c701e0217aa68c427b10232c1de3d8"}, "author": "", "url": "http://www.cnn.com/2015/09/11/politics/obama-waldorf-astoria/index.html", "ord_in_thread": 0, "title": "Obama won't stay at Chinese-owned Waldorf-Astoria - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama won't stay at Chinese-owned Waldorf Astoria By Jim Acosta and Aliie Malloy, CNN Updated 1916 GMT (0216 HKT) September 11, 2015 Located on Park Avenue, the Waldorf-Astoria has hosted every U.S. president from Hoover to Obama and even features a \"secret\" train platform beneath the hotel, used by high-security VIP guests such as Franklin Delano Roosevelt. (It is no longer operational). (CNN) President Obama and his staff will be breaking with decades of tradition by foregoing a stay at New York's Waldorf-Astoria Hotel on the president's trip to the United Nations General Assembly in September, White House Press Secretary Josh Earnest said Friday. The official announcement from the White House comes after months of speculation that the President and his staff would not stay at the Waldorf-Astoria after a Chinese company purchased the hotel. A senior administration official told CNN Friday that the move was being made \"due to costs and space needs of the U.S. government as well as security concerns.\" The move from the Waldorf-Astoria is more than just a symbolic protest of a Chinese company's purchase of the hotel chain from Hilton last year. The White House has very real concerns about the potential for cyber intrusions carried out by Chinese hackers. The official did not specifically say the prospect of hacking was a concern. But Chinese entities have long been suspected of cyber intrusions. In July, Director of National Intelligence James Clapper told CNN that China is the \"leading suspect\" in the Office of Personnel Management hack, which compromised sensitive personal information, including the Social Security numbers of roughly 21.5 million people. The President and his staff will be staying instead at the New York Palace Hotel during the UNGA trip later this month, Earnest said. American presidents have traditionally stayed at the Waldorf-Astoria for decades. On a trip to New York in July with his daughters, Sasha and Malia, the President stayed at the Millennium One Hotel. ", "external_links": [], "published": "2015-09-11T21:58:00.000+03:00", "crawled": "2015-09-11T21:58:40.552+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}