{"organizations": ["Obama Muslim", "NBC", "Muslim", "Muslim Christie"], "uuid": "a956b8bb0c4da86992016e1a7490242609793de7", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/18/politics/donald-trump-muslim-barack-obama-2016-candidates-chris-christie/index.html", "country": "", "title": "Chris Christie would've corrected Trump's Obama Muslim remark - CNNPolitics.com", "performance_score": 3, "site": "cnn.com", "participants_count": 0, "title_full": "Chris Christie would've corrected Trump's Obama Muslim remark - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "a956b8bb0c4da86992016e1a7490242609793de7"}, "author": "", "url": "http://www.cnn.com/2015/09/18/politics/donald-trump-muslim-barack-obama-2016-candidates-chris-christie/index.html", "ord_in_thread": 0, "title": "Chris Christie would've corrected Trump's Obama Muslim remark - CNNPolitics.com", "locations": ["New Hampshire", "Washington", "New Jersey"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Barack Obama", "Bush", "Trump", "Chris Christie", "Obama", "Christie"], "text": "Trump to Bush: Lead by 'speaking English' Story highlights New Jersey Gov. Chris Christie said that a real leader would correct someone who called Barack Obama a Muslim Christie said Donald Trump needs to decide if he's a \"serious\" candidate Washington (CNN) New Jersey Gov. Chris Christie on Friday called out Donald Trump for not correcting an audience member who falsely said Obama is a Muslim and \"not even an American.\" \"If somebody at one of my town hall meetings said that, I would correct them and I would say, 'The President's a Christian and he was born in this country. Those two things are self-evident,'\" Christie told NBC's \"Today Show\" on Friday. \"I'll tell you what I would do, and I wouldn't have permitted that if someone brought that up at a town hall meeting of mine; I would have said, 'No, listen. Before we answer, let's clear some things up for the rest of the audience.' And I think you have an obligation as a leader to do that.\" Trump is taking fire after failing to correct a New Hampshire supporter who called Obama a Muslim. \"We have a problem in this country. It's called Muslims,\" an unidentified man at Trump's New Hampshire town hall said Thursday night. \"You know our current President is one. You know he's not even an American.\" RELATED: Trump doesn't challenge anti-Muslim questioner at event Christie said Friday he wasn't going to tell Trump what to do, but he said, \"Donald Trump has to decide how serious a candidate he wants to be and how he handles different problems like this are going to determine that in the eyes of the American people. I'm not going to lecture him about what to do.\" ", "external_links": [], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-18T18:01:49.156+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}