{"organizations": [], "uuid": "c111c29f8b10a57b6d23969480e9b54448bb9bbc", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/09/01/jeb-bush-blasts-trump-on-immigration/", "country": "IL", "title": "Jeb Bush blasts Trump on immigration", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Jeb Bush blasts Trump on immigration | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "c111c29f8b10a57b6d23969480e9b54448bb9bbc"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2015/09/01/jeb-bush-blasts-trump-on-immigration/", "ord_in_thread": 0, "title": "Jeb Bush blasts Trump on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  EFE Republican presidential hopeful Jeb Bush said Tuesday that if he becomes president he will propose a path to legalization for undocumented migrants, especially the ones brought to the United States as children, and he distanced himself from the harsh radical line on immigration taken by magnate Donald Trump.\n\"What he (Trump) has proposed is not practical. What I have made is a plan (that will allow) more security on the borders and will (include) a reform of the current (immigration) system,\" said Bush while meeting with students at La Progresiva Presbyterian School, located in the heart of Miami's Little Havana.\nBush, who has fallen significantly in the polls since the immigration debate heated up with assorted proposals targeting undocumented migrants, said that he has \"a real plan that is not going to cost hundreds of billions of dollars and that will not break up the communities in this country.\"\nIn this way, the former Florida governor criticized Trump's plan to deport the roughly 11 million undocumented foreigners living in the country and to erect a wall along the border with Mexico, among other measures.\nTrump's ideas have been seconded by other candidates vying for the 2016 Republican presidential nomination.\nNew Jersey Gov. Chris Christie has proposed tracking undocumented foreigners the way FedEx does packages, while Wisconsin Gov. Scott Walker suggested building a wall on the Canadian border.\nBush in early August presented an immigration plan that puts the emphasis on border security and includes providing legal status to undocumented migrants after a \"rigorous\" process that includes reviewing past criminal history, paying fines and taxes.\nIn his Miami speech, he lamented the fact that his rivals are using the immigration issue to divide the public.\nAlong those lines, he emphasized that \"the political climate\" is not the best in which to discuss immigration, but, despite the pressures, he said that he has not changed his opinion on the matter.\n\"I don't believe that it's anything bad. I think that (immigration) is something incredibly positive for this country, and it has to be done in a legal way. I'm committed to doing that,\" he said in reference to potential immigration reform.\nHe also said that the U.S. borders must be secured and a system must be created whereby it will be \"easier to get here legally than illegally.\"\nBefore the young people participating in the forum, many of them of Latino origin, Bush remarked that, if he wins the 2016 presidential election, he will create \"a process of legalization, particularly for the (undocumented) children\" living and studying in the United States.\n\"It makes no sense for us to return a child, who has no connections with the country of his parents, to that country. That's not common sense,\" said Bush, who emphasized that his aim is to help children in this situation \"with dignity and respect.\" EFE\nab/bp", "external_links": [], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-02T04:02:25.989+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}