{"organizations": ["Senate", "Center for Medical Progress", "ABR", "Advanced Bioscience Resources", "Planned Parenthood Pacific Southwest", "Congress", "CNN", "Advanced Bioscience Resources, Inc.", "CMP"], "uuid": "9a5c32e94aa72029b93b94a01866783f050023bc", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/01/politics/planned-parenthood-intact-fetuses/index.html", "country": "", "title": "Anti-abortion group releases video after Planned Parenthood forensics report - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Anti-abortion group releases video after Planned Parenthood forensics report - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "9a5c32e94aa72029b93b94a01866783f050023bc"}, "author": "", "url": "http://www.cnn.com/2015/09/01/politics/planned-parenthood-intact-fetuses/index.html", "ord_in_thread": 0, "title": "Anti-abortion group releases video after Planned Parenthood forensics report - CNNPolitics.com", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Daleiden", "Ferrero", "Eric Ferrero", "Daleiden", "Cecile Richards"], "text": "Video puts Planned Parenthood on defense 02:35 Story highlights The Center for Medical Progress spotlighted a representative of Advanced Bioscience Resources as being able to procure fetal tissue Planned Parenthood has repeatedly denied accusations from the CMP accusing the group of breaking federal laws Washington (CNN) An anti-abortion group released its ninth video Tuesday accusing a new company of illegally buying parts from aborted fetuses at Planned Parenthood locations. The latest video focuses on Advanced Bioscience Resources, Inc., a biomedical company that works with Planned Parenthood, according to the Center for Medical Progress, an anti-abortion group behind the series of under cover videos. The Center for Medical Progress, which has released multiple videos aimed at Planned Parenthood, spotlighted a representative of Advanced Bioscience Resources as being able to procure fetal tissue. ABR declined to comment when contacted by CNN. Previous videos had focused on the relationship between Planned Parenthood and StemExpress, a company that provides blood, tissue and other specimen to biomedical researchers. RELATED: 6th Planned Parenthood video released Planned Parenthood has repeatedly denied accusations from the CMP accusing the group of breaking federal laws during their abortion procedure. \"The video released today is not about Planned Parenthood. Staff from two independent health care firms that work with medical providers and research institutions appear to discuss their policies and practices. Multiple times in this video, staff from independent health care firms appear to say that Planned Parenthood is not interested in any financial gain and adheres to ethical standards,\" said Planned Parenthood Vice President Eric Ferrero on Tuesday. CMP has been accused of breaking laws by filming people undercover without their consent. Anti-abortion group releases fifth Planned Parenthood video \"In the twisted world of baby parts trafficking from Planned Parenthood abortion clinics, there are few unbroken rules,\" said David Daleiden, head of CMP. \"After the serious admissions in Planned Parenthood's letter to Congress last week, it is imperative for lawmakers and law enforcement to act decisively to determine the full extent of Planned Parenthood and their proxies' lawbreaking, hold them accountable, and stop the taxpayer funding of these barbaric atrocities against humanity.\" Planned Parenthood sent a letter to Congress last week that included a 10-page forensic report claiming that the CMP videos are so heavily edited that a thorough investigation of what happens in Planned Parenthood clinics is unclear. Lawmakers launched several investigations into both Planned Parenthood and CMP after the release of the videos . Planned Parenthood officials said it is not possible to decipher the words of the Planned Parenthood employee on the most recent tape, Ferrero said. Third Planned Parenthood video released as Senate Republicans seek to end funding \"While the Planned Parenthood staff member doesn't appear to say anything improper, it's also impossible to know what she said, given that this video has been edited, no source footage has been provided, her mouth is obscured, and this group has a history of editing videos to misrepresent facts. Indeed, this group provided different versions of one of her statements this morning in the video captioning, the transcript, and the press release they issued,\" Ferrero said. CMP denies that the videos have been edited in a way to manipulate facts. \"We now know from Cecile Richards' letter that $60 per collected tissue specimen is what will 'get a toe in' to harvest baby parts at Planned Parenthood Pacific Southwest,\" Daleiden wrote Monday in a letter to Congress. ", "external_links": [], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-02T02:05:40.438+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}