{"organizations": [], "uuid": "7b55d2ef651773368934254903ee22fd8b0272e7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaun_092815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/255140-obama-uses-un-speech-to-pressure-putin", "country": "US", "title": "Obama uses UN speech to pressure Putin", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama uses UN speech to pressure Putin", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T18:18:00.000+03:00", "replies_count": 0, "uuid": "7b55d2ef651773368934254903ee22fd8b0272e7"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/international/255140-obama-uses-un-speech-to-pressure-putin", "ord_in_thread": 0, "title": "Obama uses UN speech to pressure Putin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama uses UN speech to pressure Putin Getty Images By Jordan Fabian - 09/28/15 11:18 AM EDT \nPresident Obama condemned Russia, Iran and other nations for fueling conflicts around the world, in a speech to the United Nations General Assembly on Monday meant to push nations to choose diplomacy over war. \nObama repeatedly urged world leaders to choose “cooperation over conflict” but warned of “dangerous currents pulling us back into a darker, disordered world.” \nThat includes nations that “assert themselves in a way that contravene international law,” Obama said, a thinly veiled shot at Russian President Vladimir Putin. ADVERTISEMENT \"We're told that such retrenchment is required to beat back disorder, that it's the only way to stamp out terrorism,” he said. “In accordance with this logic we should support tyrants like [Syrian President] Bashar al-Assad, who drops barrel bombs to massacre innocent children because the alternative is surely worse.”\nObama said the U.S. is willing to work with Russia and Iran to end the four-year-long civil war in Syria. But he stressed there cannot be a return to the “status quo” under Assad, whose violent reign sparked an uprising. \n“The United States is prepared to work with any nation, including Russia and Iran, to resolve the conflict,” he said. “We must recognize that there cannot be, after so much bloodshed, so much carnage, a return to the prewar status quo.” \nObama’s comments came just hours before he was scheduled to meet with Putin for the first time in nearly two years. The two leaders are expected to discuss Russian intervention in Ukraine and Syria. \nPutin has sent military equipment and weapons to Syria, a move he said is meant to help the country combat the Islamic State in Iraq and Syria (ISIS). But Obama has expressed concern that Putin is simply trying to prop up Assad. \nObama’s confrontational words were meant to set the tone for his sit-down with the Russian leader. But his offer to work with Russia and Iran, both Assad allies, is a reluctant acknowledgement of the influence they wield in Syria. \nObama sought to draw a contrast with Putin, arguing that the U.S. is abiding by international norms as it responds with sanctions to Russia's military intervention in Eastern Ukraine and Crimea. \n“We cannot stand by when the sovereignty and territorial integrity of a nation is flagrantly violated,” he said. “That is the basis of the sanctions that the United States and our partners impose on Russia. It is not a desire to return to a Cold War.” \nThe president pointed to his nuclear deal with Iran as a successful example of how diplomacy can be used to resolve a dispute with a major adversary while avoiding war and suffering. \n“No matter how powerful our military, how strong our economy, we understand the United States cannot solve the world's problems alone,” he said. \nObama drew one of his few applause lines from the U.N. delegates when he laid out how the U.S. ended decades of enmity with Cuba by engaging in diplomacy. \n“As these contacts yield progress, I am confident that our Congress will inevitably lift an embargo that should not be in place anymore,” he said. \nThe president also took a subtle jab at the Republicans running to succeed him as president for promoting a “politics of us versus them.\" \n“We see an argument made that the only strength that matters for the United States is bellicose words and shows of military force. That cooperation and diplomacy will not work,” he said. \n“But I stand before you today believing in my core that we, the nations of the world, cannot return to the old ways of conflict and coercion,” the president added. \nThe rise of ISIS, however, has challenged Obama’s foreign policy, as the extremist group fuels a humanitarian crisis in Syria. Hundreds of thousands of Syrians have died and millions have fled, triggering a refugee crisis in Europe and the Middle East. \nU.N. Secretary-General Ban Ki-moon for the first time called for the situation to be referred to the International Criminal Court during a speech Monday morning. \nDespite calling for Assad to go in 2012, the Obama administration has been unsuccessful at brokering a political transition in Syria. \nIn defiance of Obama, Putin called for an anti-ISIS coalition that includes the Assad government in his address to the United Nations later Monday. \nThe Russian leader said it would be a “huge mistake” not to include the Syrian army in a force fighting the extremist group. \nThis story was updated at 12:56 p.m. Tags:", "external_links": [], "published": "2015-09-28T18:18:00.000+03:00", "crawled": "2015-09-29T04:01:55.993+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}