{"organizations": ["Congress", "Fox News Facebook", "AP", "Twitter"], "uuid": "5d1e89bcb57ffe20298dd63e03cc08dd9742da28", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/09/08/iran-deal-why-wont-obama-reveal-terms-and-conditions-as-congress-gets-ready-to-vote/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1441727096924.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/09/08/iran-deal-why-wont-obama-reveal-terms-and-conditions-as-congress-gets-ready-to-vote.html", "country": "", "title": "What Obama doesn't want you (and Congress) to know about his Iran deal | Fox News", "performance_score": 5, "site": "foxnews.com", "participants_count": 0, "title_full": "What Obama doesn't want you (and Congress) to know about his Iran deal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5d1e89bcb57ffe20298dd63e03cc08dd9742da28"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/09/08/iran-deal-why-wont-obama-reveal-terms-and-conditions-as-congress-gets-ready-to-vote.html", "ord_in_thread": 0, "title": "What Obama doesn't want you (and Congress) to know about his Iran deal | Fox News", "locations": ["Iran", "Anchorage", "Alaska"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Harnik", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print FILE - In this Aug. 31, 2015 file photo, President Barack Obama speaks in Anchorage, Alaska. (AP Photo/Andrew Harnik, File) \nCongress plans to start voting this week on Obama’s Iran deal – minus the facts. As a result, Congressman Mike Pompeo and others are urging the GOP leadership not to proceed with the vote . When it comes to the acquisition of the world’s most dangerous weapon by the world’s leading state sponsor of terrorism, it should be obvious that what you don’t know can hurt you. \nThis spring, the GOP leadership in Congress set aside the strong argument that the Iran deal would be a treaty and agreed with the president on one essential condition for implementing its terms. The president would be required to transmit “the agreement” to Congress for review, defined as a long list of items including “side” and “related agreements.” Failure to comply with the duty to transmit would vitiate the president’s authority to waive or provide relief from sanctions. \nSo why is President Obama refusing to unveil the terms and conditions upon which Congress is poised to vote – and many Democrats are prepared to support – sight unseen? \nThe answer is to be found in the devious and disturbing role being played by the U.N. Security Council and the Atomic Energy Agency (IAEA) to drag the Iran deal across the finish line. \nCongress is not missing 18 minutes of blank tape. It is missing the details necessary to analyze the IAEA’s “final assessment,” to know exactly what Iran has done, and to gauge what it is capable of doing when those floodgates open. Think of it as the whole enchilada. \nAfter the deal was reached, the president rushed first to the Security Council for approval, in order to turn any future Congressional disapproval into a violation of American international legal obligations . He also demolished the Council’s hard-won and more onerous Iran sanctions resolutions, handing Putin and company a win they could otherwise never have accomplished given America’s veto power. \nSecretary Kerry tried a bah-humbug reply. But his explanation to the press on June 16, 2015 that “ we’re not fixated on Iran specifically accounting for what they did at one point or another” failed to impress . The administration needed the IAEA to fall on its sword. \nThe side deals struck between the IAEA and Iran in July do just that. They were never intended to expose in a few months what Iran has hidden for years, or to guarantee adequate inspections that Iran has successfully stymied for a decade. Their point is to give Iran a free pass, thus “closing the issue” (in the words of the deal itself.) To give the mullahs something – billions in sanctions relief – for nothing except promises to do better in the future. \nMoreover, what we do know about the IAEA-Iran side deals is shocking enough. Under a so-called “ Roadmap for Clarification ” Iran was to provide written “explanations” to the IAEA by August 15, 2015 on “all past and present outstanding issues.” The IAEA has until September 15, 2015 to “submit to Iran questions on any possible ambiguities.” There will then be “discussions in Tehran to remove such ambiguities.” And “ all activities will be completed by October 15, 2015 .” \nIn other words, Iran will not even have to self-inspect. The IAEA is going to dialogue nuclear proliferation away. \nA draft of the second side deal on Iran’s Parchin military site was released in August – not by the president or congress – but by the Associated Press . Three of its six sentences begin “Iran will provide to the Agency…” Another says Iran can use “Iran’s authenticated equipment.” Still another permits “a public visit of the [IAEA] Director General” and only one deputy “as a courtesy by Iran.” And the final insult, “Iran and the Agency will organize a one-day technical roundtable on issues relevant to Parchin.” \nThis means that the Parchin side deal – as far as we are aware – is a regime of self-inspection, with Iran’s own equipment, followed by a one-day roundtable as an Iranian “courtesy.” \nAnd yet by December 15, 2015 the IAEA will miraculously be in a position to present “the final assessment on the resolution of all past and present outstanding issues.” That assessment will be rubber-stamped by the Iran deal negotiators themselves and an IAEA Board of Governors all set to fall in line. \nThis final move is the ticket for the floodgates to open and the billions to roar into a country openly committed to a second Holocaust while denying the first one. \nCome December, Iran will be allowed to lie and insist it has never had nuclear weapons ambitions. Secretary Kerry will insist we know what they did, but what difference does it make? And the Obama legacy will be an age of nuclear proliferation amongst demagogues, despots, strongmen, kings and all their terrorist proxies. \nCongress is not missing 18 minutes of blank tape. It is missing the details necessary to analyze the IAEA’s “final assessment,” to know exactly what Iran has done, and to gauge what it is capable of doing when those floodgates open. Think of it as the whole enchilada. \nThe irony in all this is that Obama came to power via the siren call of multilateralism and the glories of the United Nations. And he will leave office having emasculated the Security Council’s potential to promote international peace and security and enforce non-proliferation, destroyed the credibility of the world’s nuclear watchdog agency, and undermined the relevance of treaties for American foreign policy from here on. \nUsing the U.N. and the IAEA to do the president’s bidding was too clever by half. If Congress decides to play by the president’s (lack of) rules, it will warrant the same criticism. \nAnne Bayefsky is director of the Touro Institute on Human Rights and the Holocaust. Follow her on Twitter @AnneBayefsky . ", "external_links": [], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-09T13:04:37.301+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}