{"organizations": [], "uuid": "746f0a69b028e358c89ba428dd3a7379cbd403ff", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/56005f2d1c00006b007578d3.jpeg?cache=TumehE3amH", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-administration-diverse_56005e3de4b0fde8b0cf4c36", "country": "", "title": "Obama Administration Most Diverse In History", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Administration Most Diverse In History", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T00:26:00.000+03:00", "replies_count": 0, "uuid": "746f0a69b028e358c89ba428dd3a7379cbd403ff"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-administration-diverse_56005e3de4b0fde8b0cf4c36", "ord_in_thread": 0, "title": "Obama Administration Most Diverse In History", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Philip Lewis Fellow, The Huffington Post Posted: 09/21/2015 04:01 PM EDT ASSOCIATED PRESS President Barack Obama speaks during a town hall meeting, Monday, Sept. 14, 2015, at North High School in Des Moines, Iowa. (AP Photo/Charlie Neibergall) \nPresident Barack Obama has the most diverse administration in history, with women and minorities holding a majority of the top policy positions for the first time ever. \nThe analysis , compiled by University of California at Berkeley law school professor Anne Joseph O’Connell and published by The Washington Post, demonstrates that one of Obama's legacies may be in fundamentally changing the face of the federal workforce. \nO'Connell's research covers more than 80 policy positions requiring Senate confirmation. Obama has placed women and minorities in 53.5 percent of those spots, compared with 25.6 percent during George W. Bush's presidency and 37.5 percent under Bill Clinton. \nThe research comes on the heels of Obama's nomination of Eric Fanning to lead the Army . If confirmed, Fanning will be the first openly gay Army secretary in history, just four years after the country ended its prohibition on gay men and women serving openly in the military. \nThe administration is also currently looking at ending the ban on transgender service members , a move Fanning has said he supports. \nObama has also made his mark on the federal judiciary and will leave the White House with record diversity on the federal bench . He has nominated more female judges than any other president in history -- breaking Clinton's record -- and put in place more African-American judges than every other president combined. \nWhite House senior adviser Valerie Jarrett told the Washington Post that Obama has \"made a very deliberate effort to be inclusive in the diversity of his administration at all levels.\" ", "external_links": [], "published": "2015-09-22T00:26:00.000+03:00", "crawled": "2015-09-22T00:26:06.427+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}