{"organizations": [], "uuid": "fd0f9ac7b06afb039d8e933497190d59e1ea3896", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabear_090815.png", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/252966-obama-eats-bloody-salmon-with-bear-grylls", "country": "US", "title": "Obama eats 'bloody' salmon with Bear Grylls", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama eats 'bloody' salmon with Bear Grylls", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T23:23:00.000+03:00", "replies_count": 0, "uuid": "fd0f9ac7b06afb039d8e933497190d59e1ea3896"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/252966-obama-eats-bloody-salmon-with-bear-grylls", "ord_in_thread": 0, "title": "Obama eats 'bloody' salmon with Bear Grylls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama eats 'bloody' salmon with Bear Grylls By Devin Henry - 09/08/15 04:23 PM EDT \nPresident Obama discusses the impacts of climate change on Alaska and chows down on a \"bloody\" half-eaten salmon in a clip from \"Running Wild\" with host Bear Grylls. \nMSNBC previewed an early clip of Obama's episode with the famed outdoorsman on Tuesday, recorded during the president's recent visit to Alaska. ADVERTISEMENT The two share a fish which already been chewed up a bear, and is described by Grylls as a “bloody carcass of half-eaten salmon.”\nObama ate the salmon, but said it “would have been nice if we had had a cracker to go with it.” \nThe White House also released a clip from the forthcoming episode showing the two discussing climate change's effect on the Alaskan wilderness. Watch a sneak peek of @POTUS in the wild with @BearGrylls talking about climate change → http://t.co/eAVC9RjeMV https://t.co/iN73E8fqwL — The White House (@WhiteHouse) September 8, 2015 \n“One of the main purposes of our trip here is to highlight the effects of climate change and what’s happening to our planet,” Obama told Grylls during the video shoot in last week. \n“You’re so right,” Grylls said. “I think speeches are one thing, but we live and breathe this stuff every day because we’re out in it and we’ve seen the harsh kind of reality of it and a lot of it, actually, is pretty shocking.” \n“That’s exactly right,\" Obama responded. \"And I’ve got two daughters, and I don’t want grandchildren too soon, but eventually I hope to have some, and I want to make sure this is there for them, not just for us.” \nClimate change was the led the agenda during Obama’s trip to Alaska last week. \nAdministration officials made a point of publicizing the trip in a variety of special ways, including turning over the White House Instagram account to Obama himself, having the president film a video on a selfie stick and also appear on “Running Wild.\" \nIn the White House video, Obama also called his time with Grylls “one of my best days of my presidency,” mostly, he said, because he was out of the office and not wearing a suit. \n“Every once in a while, when I do something unexpected, the phrase we use is, ‘the bear is loose,’” he said. “So to be with Bear in the woods, it doesn’t get any better than that. \nNo air date has been set for Obama’s appearnce on “Running Wild.” Tags:", "external_links": [], "published": "2015-09-08T23:23:00.000+03:00", "crawled": "2015-09-08T23:32:25.488+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}