{"organizations": [], "uuid": "89880ced9754c9de03846a22bb26152d48754ca0", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/caseyinternal5454.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/politics/2015/09/01/bob-casey-becomes-32nd-senator-to-back-iran-nuke-deal/", "country": "US", "title": "Supporters of Iran deal near key vote total to back up Obama", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "Supporters of Iran deal near key vote total to back up Obama | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "89880ced9754c9de03846a22bb26152d48754ca0"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/09/01/bob-casey-becomes-32nd-senator-to-back-iran-nuke-deal/", "ord_in_thread": 0, "title": "Supporters of Iran deal near key vote total to back up Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print Oct. 9, 2014: Pennsylvania Senator Bob Casey takes the stage for Democratic challenger for Pennsylvania Governor Tom Wolf at a \"Women for Wolf\" grassroots rally at the National Constitution Center in Philadelphia. (Reuters) \nSupporters of the Iran nuclear deal are on the cusp of clinching the necessary Senate votes to keep the contested agreement alive and hand President Obama a major foreign policy victory in spite of furious opposition. \nDemocratic Sens. Bob Casey of Pennsylvania and Chris Coons of Delaware on Tuesday became the 32nd and 33rd senators to announce support for the deal, just one shy of the 34 votes needed to uphold an Obama veto of GOP legislation aimed at blocking it. \n\"This agreement will substantially constrain the Iranian nuclear program for its duration, and compared with all realistic alternatives, it is the best option available to us at this time,\" Casey said in a statement. In remarks at the University of Delaware, Coons said:  \"I will support this agreement despite its flaws because it is the better strategy for the United States to lead a coalesced global community in containing the spread of nuclear weapons.\" \nEarlier Tuesday Sen. Ben Cardin of Maryland, top Democrat on the Foreign Relations Committee, predicted that Obama would get to 34 votes by week's end. \nRepublicans unanimously oppose the deal, which aims to curb Iran's nuclear program in exchange for relief from economic sanctions, and the Israeli government is vehemently opposed. But critics have failed to use Congress' summer recess to turn the tide against the deal. Only two Democratic senators have come out against it. \nWith 34 votes looking to be within reach, supporters have begun aiming to get 41 votes, which would block the disapproval resolution from passing in the first place, and would spare Obama from having to use his veto pen. Cardin, who said he remains undecided, didn't address that possibility. \nIn a session with students at Johns Hopkins University, Cardin discussed the pros and cons and said his decision will be made on which approach is likeliest to keep Iran from becoming a nuclear weapons state. Either decision carries risks, he said. \n\"I think it's a tough call and I sort of bristle when people say this is such an easy decision, why haven't you made it,\" Cardin said. \"I don't think it is an easy judgment call. I think there are high risks either way.\"", "external_links": [], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-01T22:16:43.741+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}