{"organizations": [], "uuid": "1351c378eb55a730b1ed1009beaaf0681f3bc1ff", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/783285/images/o-KIVALINA-ALASKA-CLIMATE-CHANGE-LAWSUIT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/alaska/feed", "section_title": "Alaska on Huffington Post", "url": "http://www.huffingtonpost.com/jamie-rappaport-clark/alaska-bound-president-ob_b_8067242.html", "country": "US", "title": "Jamie Rappaport Clark: What Obama Must Address During His Visit To The Nation's Climate Change Frontier", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Jamie Rappaport Clark: What Obama Must Address During His Visit To The Nation's Climate Change Frontier", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T19:19:00.000+03:00", "replies_count": 0, "uuid": "1351c378eb55a730b1ed1009beaaf0681f3bc1ff"}, "author": "Jamie Rappaport Clark", "url": "http://www.huffingtonpost.com/jamie-rappaport-clark/alaska-bound-president-ob_b_8067242.html", "ord_in_thread": 0, "title": "Jamie Rappaport Clark: What Obama Must Address During His Visit To The Nation's Climate Change Frontier", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nPresident Obama flew to Alaska today and will be the first sitting president to visit an Arctic Alaskan community. Why? Because Alaska and the Arctic are on the front lines of the single greatest challenge our planet faces: climate change. \nAs the president points out in his video announcing his trip, climate change isn't just affecting Alaska. It's contributing to extreme drought in California and the Northwest, intensifying storms, like the three major hurricanes currently moving across the the Pacific Ocean, and melting glaciers across the Arctic. But Alaska is facing unique challenges this year: wildfires are raging across the state, and a shocking 30 humpback and fin whales have died recently in the Gulf of Alaska. Both disasters are likely tied to climate change: unusually warm temperatures and lack of rain have made it all too easy for fires to rage out of control, and a large mass of warm water in the North Pacific dubbed the \"warm blob\" has made conditions perfect for toxic algal blooms, a leading suspect in the deaths of the whales. As climate change continues to change the world around us, events like these could become more common. \nPresident Obama will meet with people and visit communities experiencing climate change firsthand and talk about its impacts, as well as attend and open the Conference on Global Leadership in the Arctic: Cooperation, Innovation, Engagement and Resilience (GLACIER). I hope to see President Obama address the following issues threatening Alaska and arctic wildlife. \nClimate change resilience and protecting wildlife habitat. As our planet's climate systems dramatically change, we need to protect and preserve wildlife habitat that supports our native species-by land and by sea. We hope President Obama will reiterate his support for designating the coastal plain of the Arctic National Wildlife Refuge as wilderness, protecting it from oil drilling forever. But drilling isn't the only threat that arctic animals face. \nUnprecedented sea ice melt has increased ship traffic in the Bering Strait by an incredible 118% between 2008 and 2012, and the numbers continue to climb. But current international regulations aren't strict enough to prevent non-ice class ships from setting sail in Arctic waters. This could spell tragedy for people and wildlife alike if a spill occurs from a ship sinking or running aground. The president needs to push for stronger controls to ensure that ships that sail in the Arctic Ocean are equipped and prepared for the conditions. \nA strong oil spill response for marine mammals. It is tragically ironic that President Obama is allowing Shell to move forward with oil drilling when the Arctic is already being impacted by climate change. Pacific walrus, polar bears, whales and ice-dependent seal species all call the Arctic home and depend on its winter sea ice for habitat--habitat that's quickly melting away. With more and more ships traversing the Bering Strait and Shell's plans to re-attempt oil drilling in the Arctic Ocean, the risk of an oil spill is increasing every year. \nDefenders is doing what we can to mitigate this risk: we've co-funded specially designed large mammal spill response equipment, such as polar bear holding cages and washing tables, and recently hosted a Pacific walrus oil response workshop with the U.S. Fish and Wildlife Service to help them revise their response plan for Pacific walrus. But we need more of this equipment staged in high-risk areas, as well as additional ice-breaking ships dedicated to oil spill response. Agencies that would respond to a spill, like the U.S. Fish and Wildlife Service and the Coast Guard, need to work with local communities on developing a strong early response if we are to make a real difference when and if an oil spill happens. \nThe impacts of climate change on wildlife and people. Nowhere else is this more apparent than in Alaska, where many communities depend on native wildlife for subsistence and are exposed to extreme weather year-round. \nMany Alaska Native communities built on permafrost are fighting to prevent damage as melting of the permafrost causes the ground to sink beneath their homes. Thawing permafrost also releases methane frozen beneath it underground, and contributes to greenhouse gases in our atmosphere, which will only continue as thawing frees up more and more trapped gas. Increased evaporation has also caused a decline in Alaska's lakes and wetlands, which provide food and habitat for millions of waterfowl and shorebirds. Our warming climate has caused shrubs to encroach onto Arctic tundra, replacing lichens, a critical food source for caribou, which in turn are an important source of food in Alaska for wolves, bears and people. And every year, polar bears and Alaska Native communities face a smaller window of time during which they can hunt seals and walrus on Alaska's winter sea ice. \nWildlife and habitat management in Alaska that takes into account the threat of climate change can help lessen the effect of these impacts. But our nation also needs to be a leader in the fight against climate change. Congress should support President Obama's Clean Power Plan which establishes the first-ever national standards to limit carbon pollution from power plants; a crucial step in reducing emissions in the United States and around the world. \nAlaska is truly a climate change frontier. This is President Obama' chance to take a significant leadership role during this international conference and address the myriad threats that face this unique landscape. Wildlife and people in Alaska, the Arctic and across our nation need swift action now. \nFollow Jamie Rappaport Clark on Twitter: www.twitter.com/JClarkprez More:", "external_links": [], "published": "2015-08-31T19:19:00.000+03:00", "crawled": "2015-09-01T00:36:38.468+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}