{"organizations": [], "uuid": "79dc43dca84068db4ac2ad9cdb9cb0b7349329b8", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150910144524-barack-obama-september-10-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_meast.rss", "section_title": "CNN.com - Middle East", "url": "http://edition.cnn.com/2015/09/28/world/obama-isis-stalemate/index.html", "country": "US", "title": "Obama vs. ISIS = stalemate?", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama vs. ISIS = stalemate? - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T21:57:00.000+03:00", "replies_count": 0, "uuid": "79dc43dca84068db4ac2ad9cdb9cb0b7349329b8"}, "author": "Peter Bergen", "url": "http://edition.cnn.com/2015/09/28/world/obama-isis-stalemate/index.html", "ord_in_thread": 0, "title": "Obama vs. ISIS = stalemate?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights President Barack Obama will meet with key leader of nations involved in effort against ISIS Top administration officials paint a mixed picture of how the fight against ISIS has gone so far Peter Bergen is CNN's national security analyst, vice president at New America and a professor of practice at Arizona State University. He is the author of \"Manhunt: The Ten-Year Search for bin Laden -- From 9/11 to Abbottabad.\"\n(CNN) On Tuesday, President Barack Obama will meet in New York with the leaders of dozens of countries who are involved in the fight against ISIS in some manner to assess how that campaign is going.\nSo what is the state of play more than a year into the campaign against the terrorist army?\nEarlier this month, Gen. Martin Dempsey, outoing chairman of the Joint Chiefs of Staff, said that the war is \"tactically stalemated\" and there are no \"dramatic gains on either side.\"\nFrance launches its first airstrikes against ISIS in Syria\nIndeed, in early 2015, ISIS retreated from the town of Kobani on the Syrian-Turkish border and in March the group lost the Iraqi city of Tikrit. But a month later, ISIS seized the city of Ramadi in western Iraq as well as the town of Palmyra in Syria.\nISIS, in short, isn't winning, nor is it really losing. This is despite the more than 7,000 airstrikes aimed at the terrorist army in the past year or so.\nHow top officials see the situation\nAhead of the ISIS summit in New York, four senior administration officials spoke with half a dozen reporters, including myself, to give their views of the campaign.\nDeputy Secretary of State Tony Blinken conceded, with some understatement, that the train- and-equip program of Syrian fighters to fight ISIS is \"not where we want it to be.\"\nThe $500 million program to train more than 5,000 rebel fighters has trained only 125 fighters in the past year, and some of those fighters have given up their weapons to al Qaeda's Syrian affiliate .\nBlinken, however, compared how ISIS is faring today with where it was a year ago when the Iraqi cities of Erbil and Kirkuk were threatened by the group as well as Baghdad. Blinken asserted that as a result of the US-led campaign against ISIS, its cadre have lost \"freedom of movement\" in around a third of the territory that they control in Iraq.\nJUST WATCHED Was U.S. military intelligence on ISIS skewed? Replay More Videos ... MUST WATCH\nWas U.S. military intelligence on ISIS skewed? 02:21 Blinken also pointed to ISIS losses in Syria, asserting that the terrorist army had lost large amounts of territory in northern Syria, so that it now controls only some 60 miles of the Syrian-Turkish border, down from the 600 miles of border that the group had previously controlled.\nU.S. support for Kurdish and Turkmen groups fighting ISIS has contributed to those losses and \"some of these elements are within 20 miles of Raqqa,\" ISIS' de faction capital in northern Syria, Blinken said.\nBlinken explained that these intelligence estimates did not originate from U.S. Central Command, which is in charge of the war against ISIS, but from other U.S. intelligence agencies. The Pentagon is investigating claims by intelligence analysts that senior officials at Centcom distorted their analytical product to make it appear that the war against ISIS is going better than the facts on the ground.\nThe gains against ISIS have significantly hurt the ability of the group to move foreign fighters from around the Muslim world through Turkey into Syria, Blinken said. Transiting Turkey is how most foreign fighters, who are some of the most brutal of ISIS' cadre, travel to reach the group.\nA tougher stance along the border\nJUST WATCHED Turkey's 'reluctant' role in the fight against ISIS Replay More Videos ... MUST WATCH\nTurkey's 'reluctant' role in the fight against ISIS 04:45 Turkey, which had long been criticized by several Western countries for its lackadaisical policy about foreign fighters moving through its territory, has \"significantly increased\" efforts to detain and arrest those fighters, Blinken said.\nThose efforts by the Turks are clearly working according to ISIS' own propaganda. In early 2015, ISIS posted online a 50-page booklet, \"Hijrah to the Islamic State.\" Hijrah is an Arabic word that means emigrating for religious reasons. The booklet's subtitle explained, \"What to Packup. Who to Contact. Where to Go. Stories & More!\"\nIt is clear from the 50-page booklet that by earlier this year, ISIS had begun to feel pressure from the Turkish government. ISIS explained, \"It is important to know that the Turkish intelligence agencies are in no way friends of the Islamic State [ISIS].\"\nIn 2014, ISIS advised that, as long as its recruits did their best not look too \"religious,\" they would simply pass through the best-known Turkish-Syrian border crossings, but over time that route had became more challenging.\nISIS now instructed its recruits to run across the border at an unguarded spot where a car and driver would take them on to Raqqa.\nObama's top counterterrorism adviser, Lisa Monaco, noted that in the past year, some 40 countries had introduced new laws to prevent the recruitment of these fighters to ISIS or had launched criminal investigations of militants who had joined the group.\nU.S. Assistant Attorney General John Carlin, who oversees the prosecutions of ISIS recruits in the States, said that one of the fruits of these efforts is that Interpol now has some 4,000 profiles of foreign fighters.\nCarlin added that the United States has charged 60 militants with traveling or attempting to travel to Syria to join jihadist groups and a further 10 militants had been arrested in 2015 for plots to attack inside the States that were either inspired or directed by ISIS. Carlin said 250 Americans have traveled or attempted to travel to the conflicts in Syria and Iraq.\nThe United States has had relatively small numbers of its citizens join or attempt to join ISIS or other jihadist groups compared with other Western countries that have seen far larger numbers. About 1,500, for instance, have traveled from France to Syria and 700 from the United Kingdom, as have many hundreds of others from other European countries. There have also been smaller numbers from Canada and Australia.\nTightening up on 'visa waivers'\nThese are all \"visa waiver\" countries whose citizens can travel easily to the United States. Recognizing that Western veterans of the Syrian conflict might pose a threat to the United States, the Department of Homeland Security has tightened up on the reporting requirements of those traveling from visa waiver countries asking for more information about each individual visitor, according to Deputy Secretary of Homeland Security Alejandro Mayorkas.\nThe U.S. government has estimated that the flow of foreign fighters to ISIS is around 1,000 a month, which is also around the number of fighters that the Centcom-led air campaign is estimated to be killing every month.\nTaken together, the four senior administration officials outlined a campaign that has had some success in constraining, though not reducing, the flow of foreign fighters to ISIS as well as restricting the ability of the group to move freely in large portions of Syria and Iraq where it had once enjoyed freedom of movement.\nThat said, the overall strategic picture remains, for the moment, something of a draw because ISIS retains its centers of power in Raqqa in Syria as well as in Mosul, Iraq's second-largest city, as well as Anbar province in western Iraq, the largely Sunni region where Ramadi is located.\nIn the long term, which could be many years, the US-led coalition against ISIS is likely to wear the group down, but for the moment there is an overall strategic stalemate.", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150811120012-turkey-role-against-isis-pkk-intv-wrn-00021017-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150910184846-isis-pentagon-intelligence-dnt-starr-tsr-00015420-small-169.jpg", "http://www.nytimes.com/2015/09/16/us/politics/analysts-said-to-provide-evidence-of-distorted-reports-on-isis.html?_r=1", "http://i2.cdn.turner.com/cnnnext/dam/assets/150811120012-turkey-role-against-isis-pkk-intv-wrn-00021017-small-169.jpg", "http://www.latimes.com/world/middleeast/la-fg-syria-rebels-pentagon-20150925-story.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150811120012-turkey-role-against-isis-pkk-intv-wrn-00021017-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150910184846-isis-pentagon-intelligence-dnt-starr-tsr-00015420-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150811120012-turkey-role-against-isis-pkk-intv-wrn-00021017-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150910184846-isis-pentagon-intelligence-dnt-starr-tsr-00015420-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150811120012-turkey-role-against-isis-pkk-intv-wrn-00021017-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150910184846-isis-pentagon-intelligence-dnt-starr-tsr-00015420-exlarge-169.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150811120012-turkey-role-against-isis-pkk-intv-wrn-00021017-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150910184846-isis-pentagon-intelligence-dnt-starr-tsr-00015420-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150910184846-isis-pentagon-intelligence-dnt-starr-tsr-00015420-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150910184846-isis-pentagon-intelligence-dnt-starr-tsr-00015420-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150811120012-turkey-role-against-isis-pkk-intv-wrn-00021017-exlarge-169.jpg", "http://www.defense.gov/News/Special-Reports/0814_Inherent-Resolve"], "published": "2015-09-28T21:57:00.000+03:00", "crawled": "2015-09-28T18:26:53.355+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}