{"organizations": [], "uuid": "7c9e23166c841dcc1d4ac828cc7fc7e6826732c5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/55fd7cc81c00002d007576d4.jpeg?cache=HYXOk0kgm2", "site_section": "http://www.huffingtonpost.com/feeds/verticals/crime/news.xml", "section_title": "Crime News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/vice-obama-prison-documentary-hbo_55fd7c1ee4b00310edf74566", "country": "US", "title": "Vice Went To Prison With Obama. Now It's Going Deep Into Inmate Issues.", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Vice Went To Prison With Obama. Now It's Going Deep Into Inmate Issues.", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T15:00:00.000+03:00", "replies_count": 0, "uuid": "7c9e23166c841dcc1d4ac828cc7fc7e6826732c5"}, "author": "Michael Calderone", "url": "http://www.huffingtonpost.com/entry/vice-obama-prison-documentary-hbo_55fd7c1ee4b00310edf74566", "ord_in_thread": 0, "title": "Vice Went To Prison With Obama. Now It's Going Deep Into Inmate Issues.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vice Went To Prison With Obama. Now It's Going Deep Into Inmate Issues. \"It was too good an opportunity not to throw the kitchen sink at it.\" Michael Calderone Senior Media Reporter, The Huffington Post Posted: 09/22/2015 08:00 AM EDT ASSOCIATED PRESS Obama was the first sitting president to visit a federal penitentiary. NEW YORK -- \"Is the criminal justice system in America racist?\" \nVice co-founder and CEO Shane Smith put that question to President Barack Obama after running through the grim statistics of how federal mandatory minimum laws have disproportionately hurt poor and minority communities, with long prison sentences issued for nonviolent drug offenses. While 1 in 17 white men will spend time in prison, Smith noted, the rate is 1 in 3 for black men. \n\"I think the criminal justice system interacts with broader patterns of society in a way that results in injustice and unfairness,\" Obama told Smith during their July trip to El Reno Federal Prison in Oklahoma, the first time a sitting president has visited a federal penitentiary. \n\"The system, every study has shown, is biased somewhere institutionally in such a way where an African-American youth is more likely to be suspended from school than a white youth for engaging in the same disruptive behavior, more likely to be arrested, more likely to be charged, more likely to be prosecuted aggressively, more likely to get a stiffer sentence,\" Obama said. \nThe president's interview with Smith appears in \"Fixing the System,\" a Vice documentary on mass incarceration airing Sunday night on HBO. \nThe White House did not comment as to why Vice was invited to follow Obama at El Reno. Criminal justice reform, and the president's support for it, is something the White House wants to showcase -- and Vice has been covering the topic closely for years. (It may also have been helpful that Vice's chief operating officer , Alyssa Mastromonaco, worked for Obama from 2005 to 2014.) \nIn May, the president participated in a Vice roundtable with Smith and five students on the cost of college education, and last week, he spoke at a White House screening of \"Fixing the System.\" \nThe HBO documentary is just one component of a Vice editorial project stretching beyond television to all of the company's 10 online channels, its print magazine and mobile offerings like Snapchat Discover. \n\"When we realized that something of this magnitude was going to happen in front of our cameras, we thought it was too good an opportunity not to throw the kitchen sink at it,\" Alex Miller, Vice's global head of content, told The Huffington Post. \"What we're doing is finally leveraging ... the multitude of media platforms which we have at our disposal to truly ram home how seriously we take this issue.\" \nVice plans to publish more than 50 pieces on prisons and reform in the coming weeks, through the editorial lens of its various sites. For instance, Vice Sports will look at the significance of handball to inmates, while Motherboard, a science and technology site, is examining the high costs of Skype in prison. Food site Munchies will look at the cooking practices of Italian inmates, while Noisey is appropriately covering music in prison. Vice's next print edition, \"The Prison Issue,\" hits newsstands Oct. 5. Vice \n\"When the idea for the documentary started to be bounced around the office, it was clear that this was an enormous project for us, a significant moment in the history of Vice,\" said Miller. \nHe added that criminal justice is \"not only undeniably significant in the eyes of the American people,\" but of particular interest to Vice's CEO, who helped found a punk magazine in 1994 that has since grown into a youth media juggernaut valued at $2.5 billion. \"What we're trying to do is shine a spotlight,\" Smith said Monday on MSNBC's \"Morning Joe.\" \"We're trying to say, 'Hey, look, there's bipartisan support -- support from the judiciary, support from the president. Let's push this together and reform.'\" \nFor \"Fixing the System,\" Smith interviewed several inmates serving long prison sentences for nonviolent drug offenses, their families, members of the law enforcement community, former Attorney General Eric Holder, and reform-minded lawmakers like Sen. Cory Booker (D-N.J.). \nWhat's most striking is the unprecedented sit-down between Obama and six inmates. He listens to their stories and expresses empathy with the situations they've landed in. \nThe president admits doing a \"lot of stupid stuff\" during his younger years, including using drugs. But Obama acknowledges he was fortunate that such youthful indiscretions took place \"in an environment where you could afford to make some mistakes,\" as opposed to low-income communities with high levels of drug activity whose residents often don't get a second chance. \n\"I had more of a margin of error than a lot of kids do,\" Obama says. \nWatch the trailer for \"Fixing the System.\"", "external_links": [], "published": "2015-09-22T15:00:00.000+03:00", "crawled": "2015-09-22T15:56:48.973+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}