{"organizations": [], "uuid": "552968b5f52404ddeecdab464c72218a460807e7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaneworleans08272015getty.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/252149-a-decade-after-katrina-obama-tells-new-orleans-you-inspire-me", "country": "US", "title": "Recalling Katrina, Obama tells New Orleans: 'You inspire me'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Recalling Katrina, Obama tells New Orleans: 'You inspire me'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T02:14:00.000+03:00", "replies_count": 0, "uuid": "552968b5f52404ddeecdab464c72218a460807e7"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/252149-a-decade-after-katrina-obama-tells-new-orleans-you-inspire-me", "ord_in_thread": 0, "title": "Recalling Katrina, Obama tells New Orleans: 'You inspire me'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Recalling Katrina, Obama tells New Orleans: 'You inspire me' By Jordan Fabian - 08/27/15 07:14 PM EDT \nPresident Obama visited New Orleans on Thursday, hailing the city as a shining example of resilience a decade after the devastation of Hurricane Katrina. \nObama praised the Big Easy as a city that is “slowly, unmistakably, together, moving forward” after the costliest natural disaster in American history. ADVERTISEMENT “I’m here to hold up a mirror and say because of the people of New Orleans working together, this story is moving in the right direction, and I have never been more confident that together we will get to where we need to go,\" he told a crowd at a newly built recreation center in the Lower Ninth Ward, the section of the city hit hardest by Katrina. “You inspire me.” \nBut he cautioned that the job of rebuilding the city is far from over, because the economic and racial inequality that plagued the city before the storm still exists. \nEarlier on Thursday, Obama walked through Tremé, one of the oldest black neighborhoods in America, where he took photos and shook hands with residents who gathered in front of their homes to greet him. \nThe president said many pockets of the city still suffer from extreme poverty that pushes young people toward a life of crime. \n\"We came to realize that what started out as a natural disaster became a man-made disaster — a failure of government to look after its own citizens,\" Obama said. \"What the storm laid bare was another tragedy, a deeper tragedy that had been brewing for decades.\" \nDespite the somber tone of his remarks, Obama’s tour of New Orleans was a chance for him to declare his administration’s recovery efforts a success. \nAs a presidential candidate in 2007 Obama declared that the country had “failed the people of New Orleans and the Gulf Coast” under President George W. Bush. \nBut standing in the city eight years later, Obama said his administration has shown what happens when the federal government works. \nHe touted his administration’s efforts to cut red tape to speed financial aid to disaster-stricken communities and rebuild roads, bridges, schools and hospitals in a way so they can withstand future storms. \nHe also heaped praise on local officials, such as Mayor Mitch Landrieu (D), for their work with the administration. \nAhead of Obama’s visit, the White House touted the $6.5 billion in federal aid that has been provided since 2009 for infrastructure and public works projects, and the $102 million spent overhauling New Orleans’ school system. Combined, the George W. Bush and Obama administrations have given almost $71 billion to help regional recovery efforts. \n\"I made promises when I was a senator that I’d help,” Obama said. “And I’ve kept those promises.\" \nAt one point the president singled out his Federal Emergency Management director, saying, “I love me some Craig Fugate.” \nThe line harkened back to Bush’s praise for FEMA director Michael Brown shortly after Katrina hit, when he delivered the infamous line, “Brownie, you're doing a heck of a job.” \nObama’s trip to the Big Easy had him in a celebratory mood. He sung the theme from “The Jeffersons” after meeting a woman on the street who goes by the name “Wheezy.” \nHe also joked to the audience at his speech that he got a grease spot on his suit while eating fried chicken at the Willie Mae Scotch House, a famous restaurant rebuilt after the storm. \n“That’s OK,” he said. “If you didn’t get a grease spot somewhere, you didn’t enjoy the city.” \nThe president is in the midst of a major climate change push, but mostly steered clear of the issue during his visit. He noted readiness efforts are more important than ever in cities like New Orleans because of changes in the climate. \n“We’re going to see more extreme weather events as a result of climate change.” \nRepublicans were on alert for Obama to tie Katrina to climate change. Louisiana Gov. Bobby Jindal, a 2016 presidential candidate, warned Obama on Wednesday not to deliver “a lecture on climate change” while in his home state.", "external_links": [], "published": "2015-08-28T02:14:00.000+03:00", "crawled": "2015-08-28T03:01:42.547+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}