{"organizations": ["Fox News", "Facebook", "Twitter"], "uuid": "cb7b13bc59cfc0234b0a779044efd285996f998f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/090915_otr_off_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/12/report-iran-finds-unexpectedly-high-uranium-reserve-after-dems-seal-nuke-deal/", "country": "", "title": "Report: Iran finds 'unexpectedly high' uranium reserve after Dems seal nuke deal for Obama | Fox News", "performance_score": 10, "site": "foxnews.com", "participants_count": 0, "title_full": "Report: Iran finds 'unexpectedly high' uranium reserve after Dems seal nuke deal for Obama | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-13T05:13:00.000+03:00", "replies_count": 0, "uuid": "cb7b13bc59cfc0234b0a779044efd285996f998f"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/12/report-iran-finds-unexpectedly-high-uranium-reserve-after-dems-seal-nuke-deal/", "ord_in_thread": 0, "title": "Report: Iran finds 'unexpectedly high' uranium reserve after Dems seal nuke deal for Obama | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Report: Iran finds 'unexpectedly high' uranium reserve after Dems seal nuke deal for Obama Published September 12, 2015 Facebook 0 Twitter 0 livefyre Email Print \nIran has reportedly found an unexpectedly high reserve of uranium, following assessments that the country is running low on the nuclear raw material and just days after President Obama essentially secured an international nuclear deal with the country's leaders. \nThe discovery was reported first by Reuters and based on comments made by Iranian nuclear chief Ali Akbar Salehi to the state news agency IRNA. \n\"I cannot announce (the level of) Iran's uranium mine reserves,\" Salehi was quoted as saying. \"The important thing is that before aerial prospecting for uranium ores we were not too optimistic, but the new discoveries have made us confident about our reserves.\" \nThe international deal with Iran, largely brokered by the Obama administration, slows the country’s nuclear development for nearly a decade in exchange for the lifting of billions of dollars worth of crippling economic sanctions. \nWorld leaders think Iran is trying to develop a nuclear weapon, despite Tehran’s denial. \nHowever, Iran under the deal will still be able to pursue a nuclear-development program, for which the uranium could be used. \nThe remarks by Salehi, head of Iran’s Atomic Energy Organization, could not be found Saturday morning on the IRNA website. But another story had him as saying the deal -- reached in July and officially known as the Joint Comprehensive Plan of Action -- will not slow the pace of Iran’s nuclear program. \n“The official said the restrictions which the JCPOA entails are by no means the ones which would restrict Iran in its nuclear activities,” reads one line in the story. \nSeveral other news-gathering agencies have either picked up the Reuters’ story or cited it in their own version. \nThat Obama would win congressional approval of the deal became apparent in recent weeks, but not without a fight from the GOP-controlled Congress and other critics including conservative groups and pro-Israel organizations. \nHowever, the president worked all summer to garner support from Senate Democrat, who on Thursday block chamber Republicans from disapproving of the deal and from forcing Obama to resort to a presidential veto to win approval for what will likely be considered his biggest foreign policy achievement. \nSalehi reportedly said uranium exploration had covered almost two-thirds of Iran and would be complete in the next four years. \nUranium can be used for energy production and scientific purposes but is also a key ingredient in nuclear weapons. \nSome Western analysts have previously said that Iran was close to exhausting its supply of yellowcake -- or raw uranium -- and that mining it domestically was not cost-efficient, according to Reuters. \nA report published in 2013 by U.S. think-tanks Carnegie Endowment and the Federation of American Scientists said the scarcity and low quality of Iran's uranium resources compelled it \"to rely on external sources of natural and processed uranium,” the wire service also reported. \nIran has repeatedly denied overseas media reports that it has tried to import uranium from countries like Kazakhstan and Zimbabwe. \n", "external_links": [], "published": "2015-09-13T05:13:00.000+03:00", "crawled": "2015-09-13T05:12:43.247+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}