{"organizations": ["Senate", "Congress", "House", "House Democrats"], "uuid": "54983428f9193d38ad6c0ddff8ead9c89a364fb1", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/18/politics/government-shutdown-planned-parenthood-abortion-house-republicans/index.html", "country": "", "title": "House Republicans advance abortion bills - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "House Republicans advance abortion bills - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T23:19:00.000+03:00", "replies_count": 0, "uuid": "54983428f9193d38ad6c0ddff8ead9c89a364fb1"}, "author": "", "url": "http://www.cnn.com/2015/09/18/politics/government-shutdown-planned-parenthood-abortion-house-republicans/index.html", "ord_in_thread": 0, "title": "House Republicans advance abortion bills - CNNPolitics.com", "locations": ["Washington", "Texas", "New Jersey"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Hillary Clinton", "Bernie Sanders", "Black", "Boehner", "Ted Cruz", "Jan Schakowsky", "Eric Ferrero", "Chris Christie", "Schakowsky", "John Boehner", "Kevin McCarthy"], "text": "Rep. Black defends position against Planned Parenthood 10:08 Story highlights The first bill bars taxpayer money for Planned Parenthood for a year while Congress conducts investigations Another bill to impose criminal penalties on health care workers who fail to provide adequate care to babies who survive abortion procedures also passed Washington (CNN) Although House Republican leaders still have no plan to avoid a government shutdown, they moved forward Friday with a pair of votes on abortion-related legislation they hope give conservatives a chance to act on their opposition to Planned Parenthood. The GOP-led House first approved a bill that bars taxpayer money for the women's health organization for a year while Congress conducts investigations. Earlier this summer, an anti-abortion group released a series of videos that purportedly show Planned Parenthood selling fetal tissue for profit. Planned Parenthood denies the allegations. Friday's measure passed mostly along party lines, 241 to 187. A bloc of roughly 30 House conservatives insist that any government funding bill include a provision to deny all federal money for Planned Parenthood, so it's unlikely the vote on the standalone measure will satisfy their call to defund the group. Another bill to impose criminal penalties on health care workers who fail to provide adequate care to babies who survive abortion procedures also passed, 248 to 177. The Senate is not expected to act on the legislation, but has scheduled a vote next week on a bill banning abortions after 20 weeks of pregnancy. During the floor debate, Republicans argued the two bills had nothing to with a potential shutdown and were focused instead on stopping any federal support for an organization they said engaged in illegal and immoral activity. \"I want every member to ask themselves a simple question: In this face of these videos, and with all the alternatives women have for health, why would you want to force your constituents to pay for something so evil?\" House Majority Leader Kevin McCarthy, R-California, said on the House floor. Democrats maintained that denying federal money to Planned Parenthood would cut off millions of women from preventive health care services. They pointed out that one in five American women have obtained health care services through the group's clinics. \"Here we go again,\" Illinois Democratic Rep Jan Schakowsky said on the House floor, noting that a fight over Planned Parenthood threatened a government shutdown shortly over Republicans took control of the House in 2011. \"This time they've manufactured a witch hunt based on heavily edited videos that were clearly intended to mislead the public and the Congress,\" Schakowsky said. Eric Ferrero, a spokesman for Planned Parenthood Action Fund, denounced Friday's vote. \"It's clear those behind these attacks have always had a clear agenda: to ban abortion, and cut millions of women and men across the country from necessary reproductive health care. They're continuing to push that agenda no matter how many they hurt in the process,\" he said in a statement. The two leading Democratic presidential hopefuls also blasted the votes. Hillary Clinton, who has recently rushed to the defense of the embroiled women's health organization, tweeted that \"The House voting to defund Planned Parenthood is an attack on women's health—nothing more, nothing less. Republicans should be ashamed.\" The House voting to defund Planned Parenthood is an attack on women's health—nothing more, nothing less. Republicans should be ashamed. — Hillary Clinton (@HillaryClinton) September 18, 2015 A half hour later, she tweeted, \"Cutting off Americans from lifesaving health care at Planned Parenthood is wrong. #standwithPP.\" Cutting off Americans from lifesaving health care at Planned Parenthood is wrong. #standwithPP pic.twitter.com/XQbcLdzbUJ — Hillary Clinton (@HillaryClinton) September 18, 2015 Clinton's main challenger, Bernie Sanders, also voiced his opposition. \"The attempt by Republicans to cut off support for Planned Parenthood is an attack on women's health. #StandWithPP,\" he tweeted. The attempt by Republicans to cut off support for Planned Parenthood is an attack on women's health. #StandWithPP — Bernie Sanders (@SenSanders) September 18, 2015 The proposal also were referenced during the Republican presidential debate with both New Jersey Gov. Chris Christie and Texas Sen. Ted Cruz both advocating for the measure. Meanwhile, House Speaker John Boehner is in discussions with Democrats about a short-term funding bill, and with the continuing feud inside his own conference, he'll need to rely on Democratic votes to prevent a shutdown. A group of nearly 80 House Democrats sent a letter to Boehner saying that the House should stay in session until it can agree on a bill to avoid another shutdown. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics ", "external_links": [], "published": "2015-09-18T23:19:00.000+03:00", "crawled": "2015-09-18T23:18:51.446+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}