{"organizations": ["U.N."], "uuid": "df8308c1833178389cf9cabfc4e07199bbb0a7e3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3478086/images/o-PUTIN-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/09/29/the-morning-email_n_8213190.html", "country": "", "title": "Tuesday's Morning Email: U.N. Features Icy Showdown for Putin, Obama", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Tuesday's Morning Email: U.N. Features Icy Showdown for Putin, Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T15:59:00.000+03:00", "replies_count": 0, "uuid": "df8308c1833178389cf9cabfc4e07199bbb0a7e3"}, "author": "", "url": "http://www.huffingtonpost.com/2015/09/29/the-morning-email_n_8213190.html", "ord_in_thread": 0, "title": "Tuesday's Morning Email: U.N. Features Icy Showdown for Putin, Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Obama"], "text": "Tuesday's Morning Email: U.N. Features Icy Showdown for Putin, Obama Posted: reddit \nTOP STORIES \nTo get The Morning Email, HuffPost's daily roundup of the news, in your inbox, sign up here. And listen to the news in under two minutes here. \nOBAMA, PUTIN STILL AREN'T FRIENDS \"U.S. President Barack Obama and Russian President Vladimir Putin sharply disagreed Monday over the chaos in Syria, with Obama urging a political transition to replace the Syrian president but Putin warning it would be a mistake to abandon the current government. After dueling speeches at the United Nations General Assembly, Obama and Putin also met privately for 90 minutes -- their first face-to-face encounter in nearly a year.\" Here's a breakdown of their competing worldviews , as well as a history of all their awkward photo ops . [ AP ] KEVIN MCCARTHY ANNOUNCES RUN FOR SPEAKER And Steve Scalise is fighting for House majority leader ten months after his white supremacy scandal . [ Laura Barron-Lopez, HuffPost ] \nWATCH TODAY'S MORNING NEWSBRIEF Take a look at the six news items driving the day. [ HuffPost ] \nAFGHAN SPECIAL FORCES HEAD TO KUNDUZ \"A day after the Taliban took their first major city in 14 years , a counterattack was underway Tuesday, but ground forces sent from other provinces to recapture the northern city, Kunduz, were delayed by ambushes and roadside bombs, officials said.\" [ NYT ] \nMEET THE 2015 MACARTHUR FELLOWS The 24 recipients of the \"genius\" grant, which will award them $625,000 over the next five years, range from a tap dancer to a stem cell biologist. [ Katherine Brooks, HuffPost ] \nYOUR INTERNET ADS ARE ABOUT TO GET A LOT MORE INTRUSIVE \"Online advertising giant Google will soon let marketers target ads to specific people using their email addresses when they use its search engine, Gmail or YouTube video platform … The tool will enable marketers to target ads to their existing customers and potentially to tailor messaging to them based on their purchase histories or other information.\" [ WSJ ] \nNASA ANNOUNCES LIQUID WATER FOUND ON MARS Life on the red planet could be possible after all. [ Ed Mazza, HuffPost ] \nTHE NEW YORK TIMES PROFILED DONALD TRUMP When asked when this crazy political ride might end, the candidate said, “I have no idea. But I’m here now. And it’s beautiful.\" [ NYT ] \nHUMANS OF NEW YORK SHARES MIGRANT PHOTOS \"A man whose brother was murdered by ISIS, a woman whose husband died in the harrowing sea journey, a child who cried out 'kill me instead!' when she saw her mother being crushed by a throng of people struggling to board a boat: These are the emotional stories of refugees in Europe that were captured this week in a poignant photo series.\" [ Dominique Mosbergen, HuffPost ] \nWHAT’S BREWING \nTREVOR NOAH TAKES OVER 'DAILY SHOW' And becomes everyone's \"stepdad.\" [ HuffPost ] \nWILL SNL BE UP TO THE TASK THAT IS THE 2016 PRIMARY? How will the show manage to parody the farcical? [ Vanity Fair ] \nWOMEN, SPORTS AND THE INTERNET \"The ugly truth about women in sports and social media.\" [ Sports Illustrated ] \nLIKE BLOWING STUFF UP? We have the chemistry GIFs for you. [ HuffPost ] \nYOU WILL NEVER NOT BLOT YOUR PIZZA AGAIN Blotting your pizza saves you the equivalent of 20 less slices a year. [ HuffPost ] \nGUESS HOW MUCH MONEY JAMES BOND WRECKS IN CAR CRASHES Hint, it's in the millions. [ Vanity Fair ] \nCOUGAR TOWN Looks like Kate Hudson, 36, and Nick Jonas, 23, maybe \"watched Netflix and chilled\" this past weekend. [ HuffPost ] \nFor more from The Huffington Post, download our app for iOS or Android . \nWHAT'S WORKING \nFACEBOOK IS BRINGING INTERNET TO U.N. REFUGEE CAMPS \"Facebook will help provide Internet access to United Nations refugee camps around the world, Mark Zuckerberg, CEO and founder of the social media giant, said over the weekend. 'Connectivity will help refugees better access support from the aid community and maintain their links to family and loved ones,' Zuckerberg said. 'And Facebook is in a unique position to help maintain this lifeline.'\" [ HuffPost ] \nON THE BLOG \nCLIMATE CHANGE COMMITMENTS MUST COME FROM EAST AND WEST \"Beyond the formal negotiations in preparation for Paris, parallel emphasis is also now needed on the 'softer' components of sustainable development and climate change mitigation. These include the behavioral patterns of individuals and firms. In part this relates to policy prescriptions on carbon regulation and carbon pricing.\" [ HuffPost ] \nBEFORE YOU GO \n~ Turns out using the iPhone if you're left-handed isn't a party . \n~ The man proposed with the cutest homemade monopoly game . Gentleman, the gauntlet has been thrown. \n~ Meet the American prequel, of sorts, to \"Harry Potter.\" \n~ Matt Damon is very aware of how you felt about his ponytail . \n~ These snails are teeny tiny . \n~ Stop the Facebook privacy status posts -- you're not doing anybody any good . \n~ Remember that time George and Amal Clooney got married and took all these gorgeous photos ? Just take a spin through their wedding photos and think about the advantages of the genetic lottery. \n~ Ariana Grande has gotten into the opera game . \n~ This can't be Gordo from \"Lizzie McGuire\" fame … can it ? \n~ When you spend a year without shopping . (Can you imagine the withdrawal? Maybe this is a sign we have a problem). \n~ Tom Brady is trying to walk back that endorsement of Donald Trump . \nSend tips/quips/quotes/stories/photos/events/scoops to Lauren Weber at lauren.weber@huffingtonpost.com. Follow us on Twitter @LaurenWeberHP . And like what you're reading? Sign up here to get The Morning Email delivered to you. More: ", "external_links": [], "published": "2015-09-29T15:59:00.000+03:00", "crawled": "2015-09-29T16:00:08.764+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}