{"organizations": ["Fox News", "Los Angeles Herald Examiner Collection of the Los Angeles Public Library", "Los Angeles Herald Examiner", "Fox News Latino Donald Trump"], "uuid": "e442be3d904cec59abccddab03a12aefdb977392", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Trump-Mass%20Deportatio_Garc.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/30/donald-trump-immigration-plans-similar-to-mass-removal-mexican-americans-in/", "country": "", "title": "Donald Trump's immigration plans similar to mass removal of Mexican-Americans in 1930s | Fox News Latino", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Donald Trump's immigration plans similar to mass removal of Mexican-Americans in 1930s | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T18:30:00.000+03:00", "replies_count": 0, "uuid": "e442be3d904cec59abccddab03a12aefdb977392"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/30/donald-trump-immigration-plans-similar-to-mass-removal-mexican-americans-in/", "ord_in_thread": 0, "title": "Donald Trump's immigration plans similar to mass removal of Mexican-Americans in 1930s | Fox News Latino", "locations": ["U.S.", "Mexico", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mexican-American", "Donald Trump"], "text": "Donald Trump's immigration plans similar to mass removal of Mexican-Americans in 1930s Published August 30, 2015 Fox News Latino This 1932 photo from the Los Angeles Herald Examiner Collection of the Los Angeles Public Library shows hundreds of Mexicans at a Los Angeles train station awaiting deportation to Mexico. Republican presidential candidate Donald Trump’s call for mass deportation of millions of immigrants living in the U.S. illegally, as well as their American-born children, bears similarities to a large-scale removal that actually happened to many Mexican-American families 85 years ago. (Los Angeles Herald Examiner Collection/Los Angeles Public Library via AP) \nALBUQUERQUE, N.M. (AP) – Republican presidential candidate Donald Trump's call for mass deportation of millions of immigrants living in the U.S. illegally, as well as their American-born children, bears similarities to a large-scale removal that many Mexican-American families faced 85 years ago. \nDuring the Great Depression, counties and cities in the American Southwest and Midwest forced Mexican immigrants and their families to leave the U.S. over concerns they were taking jobs away from whites despite their legal right to stay. \nThe result: Around 500,000 to 1 million Mexican immigrants and Mexican Americans were pushed out of the country during the 1930s repatriation, as the removal is sometimes called. \nDuring that time, immigrants were rounded up and sent to Mexico, sometimes in public places and often without formal proceedings. Others, scared under the threat of violence, left voluntarily. \nAbout 60 percent of those who left were American citizens, according to various studies on the 1930s repatriation. Later testimonies show families lost most of their possessions and some family members died trying to return. Neighborhoods in cities such as Houston, San Antonio and Los Angeles became empty. \nThe impact of the experience on Latinos remains evident today, experts and advocates say. \n\"It set the tone for later deportations,\" said Francisco Balderrama, a Chicano studies professor at California State University, Los Angeles. \nTwo weeks ago, Trump said that, if elected president, he would expand deportations and end \"birthright citizenship\" for children born to immigrants who are here illegally. Under his plan, American-born children of immigrants also would be deported with their parents, and Mexico would be asked to help build a wall along the U.S.-Mexico border. \n\"They're illegal,\" Trump said of U.S.-born children of people living in the country illegally. \"You either have a country or not.\" \nAmid his comments on immigration, polls show negative impressions of Trump among Latinos. A Gallup poll released Aug. 24 found that Hispanics were more likely to give Trump unfavorable ratings than favorable ones by 51 percentage points. \nSome immigrant advocates pointed to the removal of prominent Latino journalist Jorge Ramos from an Iowa press conference last week as a metaphor for the candidate's desire to remove Latinos from the United States. \n\"Mr. Trump should heed the following warning: Our Latino and immigrant communities are not going to forget the way he has treated them,\" the Washington, D.C.-based Fair Immigration Reform Movement said in a statement. \nRamos, an anchor for Univision, was escorted out by a Trump aide after Ramos, who had criticized Trump previously, tried to question Trump about his immigration plan. Trump interrupted Ramos, saying he hadn't been called on, and ultimately told Ramos, \"Go back to Univision.\" \nRamos was saying, \"You cannot deport 11 million people,\" as he was escorted away. He was later allowed to return. \nTrump has provided few details on how his proposed deportation effort would be carried out. The conservative-leaning American Action Forum concluded in a report it would cost between $400 billion to $600 billion and take 20 years to remove an estimated 11.2 million immigrants living in the country illegally. \nThe large-scale deportation he envisions would be impractical to enact, due to the extent to which Mexican immigrants have integrated into U.S. society, said Columbia University history professor Mae Ngai. \nU.S.-born children of immigrants have been automatically considered American citizens since the adoption of the Constitution's 14th Amendment in 1868. A Supreme Court ruling in 1898 halted previous attempts to limit the birthright of Chinese-American citizens after the passage of the Chinese Exclusion Act. \nThe ruling upheld the clause for all U.S.-born children, Ngai said, and there have been no successful challenges to the clause since. \nIn the 1930s, Balderrama said, officials skirted the issue of birthright citizenship by saying they did not want to break up families. \n\"But they did break up families and many children never saw their parents again,\" said Balderrama, co-author of a book about Mexican repatriation in the 1930s with the late historian Raymond Rodriguez, who testified before a California state committee about seeing his father for the last time at age 10, before the father left for Mexico. \nThat legacy lingers in songs, often played on Spanish-language radio stations, that allude to mass deportations and separation of loved ones, said Lilia Soto, an American studies professor at the University of Wyoming. \nFor example, the lyrics to \"Ice El Hielo,\" by the Los Angeles-band La Santa Cecilia, speak of a community afraid that federal agents about to arrive and launch deportations raids at any moment. The ballad \"Volver, Volver,\" sung by Mexican ranchera performer Vicente \"Chente\" Fernandez, speaks of someone vowing to return to a lover despite all obstacles. \n\"They're about families being apart,\" Soto said. \"The lyrics are all indirectly linked to this past.\" \nLike us on Facebook ", "external_links": [], "published": "2015-08-30T18:30:00.000+03:00", "crawled": "2015-08-30T18:30:25.018+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}