{"organizations": [], "uuid": "e06dcc68ba710c35a6f92394c4510b21b8d28ce3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e488981400002e002e47e5.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-guantanamo_55e4883ae4b0b7a96339b29c", "country": "", "title": "Obama Considering 'Wide Array' Of Options For Closing Guantanamo Prison", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Considering 'Wide Array' Of Options For Closing Guantanamo Prison", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T00:11:00.000+03:00", "replies_count": 0, "uuid": "e06dcc68ba710c35a6f92394c4510b21b8d28ce3"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-guantanamo_55e4883ae4b0b7a96339b29c", "ord_in_thread": 0, "title": "Obama Considering 'Wide Array' Of Options For Closing Guantanamo Prison", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama Considering 'Wide Array' Of Options For Closing Guantanamo Prison Posted: 08/31/2015 01:04 PM EDT | Edited: 1 hour ago \nWASHINGTON, Aug 31 (Reuters) - The White House is considering a \"wide array\" of options for closing the U.S. military prison in Guantanamo Bay, Cuba, spokesman Josh Earnest said on Monday, declining to rule out executive action as an option. \nEarnest said the best route for closing the prison would be winning Congressional approval to do so. \nThe White House said last month that it would soon be sending a plan to Congress to close the prison, which President Barack Obama has made a priority. MANDEL NGAN via Getty Images \nAsked if Obama would consider taking executive action to close the prison if Congress blocks him, Earnest said, \"The president and his team are always considering a wide array of options. \n\"But the fact is the best way for us to do this is for members of Congress of both parties to work effectively with the administration,\" Earnest said. \nClosing the prison is likely to involve transferring some detainees to prisons within the United States. Republicans have barred those transfers and already have begun to push back against suggestions floated by the administration as possible host sites. \nDefense Secretary Ash Carter said on Aug. 20 that a U.S. army delegation had visited a potential facility in Leavenworth, Kansas, and would soon tour the U.S. Naval Consolidated Brig at Charleston, South Carolina. \nIn response, Republican South Carolina Governor Nikki Haley said at a news conference, \"We are not going to allow any terrorists\" to be housed in Charleston. (Reporting by Julia Edwards in Washington and Roberta Rampton aboard Air Force One; Editing by Eric Walsh and Bill Trott)  ", "external_links": [], "published": "2015-09-01T00:11:00.000+03:00", "crawled": "2015-09-01T00:11:09.457+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}