{"organizations": ["White House"], "uuid": "a05ae1a8b12c7a09197a35dc06a9af0b23254880", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f9c4cb2000002500242524.png?cache=NDavnIck1M", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-ahmed-mohamed_55f9baa6e4b0fde8b0cc9620", "country": "", "title": "Obama Invites Ahmed Mohamed And His 'Cool Clock' To The White House For Astronomy Night", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Invites Ahmed Mohamed And His 'Cool Clock' To The White House For Astronomy Night", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T23:08:00.000+03:00", "replies_count": 0, "uuid": "a05ae1a8b12c7a09197a35dc06a9af0b23254880"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-ahmed-mohamed_55f9baa6e4b0fde8b0cc9620", "ord_in_thread": 0, "title": "Obama Invites Ahmed Mohamed And His 'Cool Clock' To The White House For Astronomy Night", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ahmed", "Jennifer Bendery", "Huffington", "Obama"], "text": "Obama Invites Ahmed Mohamed And His 'Cool Clock' To The White House For Astronomy Night \"It's clear that at least some of Ahmed's teachers failed him.\" Jennifer Bendery White House and congressional reporter, The Huffington Post Posted: 09/16/2015 03:52 PM EDT | Edited: 13 minutes ago \nWASHINGTON -- President Barack Obama on Wednesday invited 14-year-old Ahmed Mohamed to the White House for some stargazing next month. \nThe offer came two days after the Texas student, who is Muslim, was arrested at school for bringing in a homemade clock that teachers mistook for a bomb. \n\"Cool clock, Ahmed,\" Obama tweeted. \"Want to bring it to the White House?\" Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great. — President Obama (@POTUS) September 16, 2015 \nThe president reached out to Ahmed as news spread of him being handcuffed and sent to juvenile detention for bringing his invention to school. Ahmed told The Dallas Morning News on Tuesday that he loves robotics, so he thought it would be cool to build a clock by linking a circuit board, a power supply and a digital clock display together inside a pencil case. \nHis English teacher didn't think it was so cool. The teacher confiscated it, despite Ahmed's insistence that it was a clock. School officers interrogated him and sent him to a detention center, where they took his fingerprints and a mugshot. He was later released to his parents. \nWhite House press secretary Josh Earnest said Wednesday that the president specifically invited Ahmed to Astronomy Night at the White House on Oct. 19, an event that brings together students with scientists and NASA astronauts. \n\"It will be an opportunity to talk about science and our solar system and the universe,” Earnest said in his daily briefing. \"We are hopeful that Ahmed will be right at home here.\" \nThe White House spokesman said Obama decided to tweet to Ahmed because he was struck by the news reports about what happened to him. \n\"The fact is that America's best teachers in our schools, in our best schools at least, nurture the intellectual curiosity of all our students. In this instance, it's clear that at least some of Ahmed's teachers failed him,\" Earnest said. \"That's too bad ... This episode is a good illustration of how pernicious stereotypes can prevent even good-hearted people who have dedicated their lives to educating young people from doing the good work they set out to do.\" \nHe stopped short of saying Ahmed was targeted because he is Muslim. \n\"From this distance, it is far too early to draw that direct assessment from here,\" Earnest said. \"I think there are some difficult and penetrating questions that do need to be asked.\" For more from The Huffington Post, download our app for iOS or Android . \nAlso on HuffPost: Sasha, Malia, Michelle & Barack Obama of ", "external_links": [], "published": "2015-09-16T23:08:00.000+03:00", "crawled": "2015-09-16T23:08:38.618+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}