{"organizations": [], "uuid": "c1dc56f32dca8cb6acb069054e2b606d573aa5a3", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/09/24/el-presidente-de-estados-unidos-barack-obama-izquierda-y-el-mandatario-chino-en-washington.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/09/24/obama-y-xi-jinping-el-primer-encuentro-en-washington", "country": "", "title": "Obama y Xi Jinping, el primer encuentro en Washington", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama y Xi Jinping, el primer encuentro en Washington", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T06:08:00.000+03:00", "replies_count": 0, "uuid": "c1dc56f32dca8cb6acb069054e2b606d573aa5a3"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/09/24/obama-y-xi-jinping-el-primer-encuentro-en-washington", "ord_in_thread": 0, "title": "Obama y Xi Jinping, el primer encuentro en Washington", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Obama y Xi Jinping, el primer encuentro en Washington Los mandatarios de EU y China tienen una cena informal que les permitirá abordar temas de fricción antes del evento oficial de este viernes Jueves, 24 de septiembre de 2015 a las 21:33 Barack Obama (izq) y el mandatario chino en Washington (AFP). Lo más importante El encuentro informal que sin embargo podría ser tan importante como los actos oficiales del viernes. Xi es visto en Washington como uno de los líderes chinos más fuertes en décadas Temas relacionados Es prematuro hablar de una crisis en China \nWASHINGTON (AFP) — El presidente estadounidense, Barack Obama, recibió la noche de este jueves en Washington a su homólogo chino, Xi Jinping, en una cena informal que les permitirá abordar temas de fricción, pero también hacer avanzar la relación entre las dos grandes potencias. \nLos dos dirigentes de las potencias económicas y militares del mundo cenaron en la Casa Blanca, en un encuentro informal que, sin embargo, podría ser tan importante como los actos oficiales del viernes. \nPero los funcionarios estadounidenses admiten los numerosos problemas que hoy lastran las relaciones de las dos naciones y dudan que las diferencias vayan a resolverse en una cena. \n\"Hace mucho tiempo los compromisos más constructivos se alcanzaron en sus cenas privadas\", dijo sin embargo el asesor de seguridad nacional, Ben Rhodes. La cena informal de esta noche es una oportunidad, agregó, para comprender mejor las respectivas \"visiones del mundo”. \n“Y esas visiones del mundo son muy diferentes. Y por eso pienso que las conversaciones son útiles e importantes, porque proveen un contexto para todos los temas\", agregó. \n\"Cooperación y competencia\" \nXi, quien inició su visita a Estados Unidos reuniéndose en Seattle con presidentes de empresas, es visto en Washington como uno de los líderes chinos más fuertes en décadas, consolidando el poder político, militar y de gobierno a una velocidad nunca antes vista desde Deng Xiaoping. \nIncluso cuando la economía china se ha desacelerado, Xi ha reforzado su control en el país. \nPero la firmeza que ha demostrado generó serias disputas marítimas, económicas y de ciberseguridad, que funcionarios estadounidenses aseguran han desestabilizado las complejas y delicadas relaciones bilaterales. \n\"En todo momento estamos cooperando y compitiendo\", dijo un alto funcionario de la administración, quien pidió mantenerse en el anonimato. \n\"Por eso nos esforzamos (...)en que la competencia no defina las relaciones y (...) sea saludable y justa\". \nEn reuniones previas, los acuerdos sobre cambio climático, comercio y cooperación militar han ayudado a enfatizar los aspectos positivos entre las dos potencias. \nEsta vez, tales avances son poco probables, aunque un acuerdo en seguridad cibernética aún no ha sido descartado. 4 \n\"No creo que en esta visita de Estado veamos anuncios que realmente llamen la atención\", dijo un funcionario estadounidense. \nRobos cibernéticos, un tema \"serio\" \nObama y Xi tratarán de destacar la cooperación para frenar los programas nucleares de Irán y Corea del Norte, los esfuerzos para combatir el cambio climático y los lazos entre los pueblos de las dos naciones. \nTambién se espera un acuerdo para reducir el riesgo de enfrentamientos militares aéreos. \nEn la víspera de la visita del presidente chino, funcionarios estadounidenses revelaron que dos jets de combate chinos pasaron peligrosamente cerca de un avión espía de Estados Unidos en el espacio aéreo internacional sobre el Mar Amarillo. \nUna serie de ataques cibernéticos y la ocupación de Pekín por la fuerza de territorios en disputa en el Mar del Sur de China han empujado a la administración Obama a enviar un mensaje de que estos temas pueden tener un costo si Xi no brinda una respuesta satisfactoria. \n\"Tenemos serias y fundamentales preocupaciones con (...) los ataques cibernéticos a nuestras compañías, a la propiedad intelectual y secretos comerciales, en beneficio de compañías chinas\", dijo un alto funcionario de la administración de Obama. \n\"El presidente planteó varias veces esto a Xi. Esperamos que haya iniciativas. No dudaremos en tomar las medidas necesarias para proteger nuestra economía y nuestras compañías\", agregó la fuente que prefirió mantenerse en el anonimato. \n\"Esto no es un motivo de irritación menor. Esto llega al corazón de nuestra economía. Es un tema de seguridad nacional y económica\", observó. Encuentra este artículo con: mundo, barack obama, xi jinping, cena informal, problemas, potencias, casa blanca, militares, asiático, ben rhodes Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"68703f46b6d6444e8bb84dcf019ecfe2\", \"time\": \"2015-09-25T03:08:41.088Z\" } Video ", "external_links": [], "published": "2015-09-25T06:08:00.000+03:00", "crawled": "2015-09-25T06:07:51.225+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}