{"organizations": [], "uuid": "47601cc7a129a0c94b0bfeb8213138ed117d28c1", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150928153854-barack-obama-vladimir-putin-toast-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_europe.rss", "section_title": "CNN.com - Europe", "url": "http://edition.cnn.com/2015/09/28/opinions/ghitis-putin-obama-differences/index.html", "country": "US", "title": "Obama, Putin differences sharp and dangerous (Opinion) - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama, Putin differences sharp and dangerous (Opinion) - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T13:28:00.000+03:00", "replies_count": 0, "uuid": "47601cc7a129a0c94b0bfeb8213138ed117d28c1"}, "author": "Frida Ghitis", "url": "http://edition.cnn.com/2015/09/28/opinions/ghitis-putin-obama-differences/index.html", "ord_in_thread": 0, "title": "Obama, Putin differences sharp and dangerous (Opinion) - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Barack Obama and Vladimir Putin deliver speeches at the United Nations Frida Ghitis: The differences between the two are sharp, bitter and dangerous Frida Ghitis is a world affairs columnist for The Miami Herald and World Politics Review and a former CNN producer and correspondent. Follow her @FridaGhitis . The opinions expressed in this commentary are solely those of the author.\n(CNN) What a day we witnessed in New York on Monday. Barack Obama and Vladimir Putin completely dominated a momentous day at the U.N. General Assembly, with the two leaders -- in almost back-to-back speeches -- addressing and attacking each other, mostly through veiled accusations but sometimes through more direct reference to the other's behavior.\nIn one particularly stinging line, Obama issued a warning that seemed tailor-made for his Russian counterpart. \"The strongmen of today,\" he said, \"become the spark of revolution tomorrow.\"\n\"I believe a government that suppresses peaceful dissent is not showing its strength; it is showing weakness and it is showing fear,\" Obama said.\nFrida Ghitis But the core of the two speeches was the raging conflict in the Middle East, and particularly Syria, which has emerged as the most urgent crisis facing the international community as millions of Syrian refugees pour out of a war zone even as world powers including Russia enter the fray there. And here, you might expect the two countries to be on the same page.\nAfter all, the United States would seem to share enough common ground to want to join forces with Moscow to try to secure common objectives, including the defeat of the so-called Islamic State, which both see as a dangerous enemy that must be defeated. Indeed, both want to see stability return to the Middle East, and both would like to see Iraq -- which is also battling ISIS -- recover the territory it has lost to extremists and move toward peace and stability.\nAnd certainly, the two speeches contained some encouraging words -- Putin and Obama spoke approvingly of the need to respect international norms and of the benefits of international cooperation. In fact, for a moment here and there, it almost sounded like there was the potential for the beginning of a beautiful new alliance between Moscow and Washington to save Syria.\nBut save your Kumbayas, because if you think Obama and Putin are singing from the same hymn sheet on Syria, you have not been paying attention. Despite some apparent shared goals, the differences between the two are sharp, bitter and dangerous.\nIn fact, the gap between American and Russian goals is so wide, that if Obama and Putin end up working together, it will only be because one of them capitulated in a big way. (And we actually got a strong hint of who might be more likely to fold).\nConsider the competing views about the origin of the Syrian conflict and the role of Syrian President Bashar al-Assad. Obama said, correctly, that the conflict started when \"Assad reacted to peaceful protests by escalating repression and killing.\"\nObama described al-Assad as \"a dictator [who] slaughters tens of thousands of his own people.\" Having used chemical weapons and barrel bombs to kill Syrians, Obama said, al-Assad must leave power.\nPutin, in sharp contrast, described al-Assad as the true hero of the Syrian war. \"We should finally acknowledge,\" he declared , \"no one but President Assad's armed forces and [Kurdish] militia are truly fighting the Islamic State.\"\nBoth presidents promoted a multinational approach against ISIS. Obama praised the coalition that has come together to fight ISIS \"a terrorist group [that] beheads captives, slaughters the innocent and enslaves women.\"\nPutin went even further, calling for a \"genuinely broad alliance against terrorism, just like the one against Hitler.\"\nBut while Putin was trying to sound ready for dialog and cooperation, the reality on the ground is that he is already moving forward aggressively and rapidly with a policy that is directly antagonistic to the United States and its objectives while prolonging the suffering of the Syrian people by keeping al-Assad in power.\nRussia has already sent personnel to Syria. It is allegedly building a military base while claiming that it is doing all this to fight against ISIS, the evidence suggests the main motivation is to bolster al-Assad, who remains one of Russia's few allies. Ultimately, it seems, Putin is more interested in protecting Russian interests and expanding its influence than protecting the Syrian people.\nAnd Russia had another surprise for the United State, with the announcement of a new intelligence alliance encompassing Iran, Iraq, Syria and Russia. In Lebanon, Hezbollah has reportedly suggested the grouping was part of a new bloc, dubbed \"the P4+1 alliance,\" a clear mocking reference to the P5+1, the U.S.-led group that negotiated a nuclear agreement with Iran.\nPutin also blasted U.S. actions in the Middle East as a violation of the U.N. charter (this from a leader who violated international law by annexing parts of Ukraine and sending military personnel into eastern Ukraine) and criticized economic sanctions imposed on Moscow. He also stoked the conspiracy theory fires, saying ISIS \"was forged as a tool against 'undesirable secular regimes.' \"\nSo, Obama's speech was replete with idealism, promoting the virtues of diplomacy and coexistence. Putin's was down-to-earth, marked by urgency and muscularity.\nThese competing speeches each had somewhat different target audiences, domestic and international. Putin's undoubtedly pleased his Russian audience, while Obama's had the characteristically uplifting tone that has gained him many admirers around the world, painting a credible picture of what it takes to achieve a true democracy -- one that allows for dissent, free expression and open ideas.\nAlthough Obama's speech will inspire democracy activists when it comes to producing results on the ground in Syria, Russia has one big advantage over the United States: It has a plan. Russia wants al-Assad to stay, and it is helping to arm him to make that a reality. U.S. policy, in contrast, remains in disarray, with no visible endgame in mind or path forward.\nTrue, Obama did say that he was willing to work with anyone, including Russia. But in doing so, he may have showed his cards -- and revealed a troubling truth to all this in the process. How? Because despite all the veiled jabs and diplomatic language on this dramatic day in New York, there was one word that gave things away.\nAfter his high-minded explanation of why the brutal al-Assad regime must go, Obama said, \"Realism also requires a managed transition away from Assad.\" And with that word, \"managed,\" President Obama suggested that Putin might just end up getting his way.\nFollow @CNNOpinion Join us on Facebook.com/CNNOpinion.\nRead CNNOpinion's Flipboard magazine.", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/140926162935-frida-ghitis-profile-image-exlarge-169.jpg", "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=6&cad=rja&uact=8&ved=0CDMQFjAFahUKEwjCo-ro2JrIAhVBfxoKHVS9ABM&url=http%3A%2F%2Fuk.reuters.com%2Farticle%2F2015%2F09%2F28%2Fuk-un-assembly-obama-idUKKCN0RS1T820150928&usg=AFQjCNEYuctr7yJiFivVcxw-lECcQDiaWw", "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=3&cad=rja&uact=8&ved=0CCsQtwIwAmoVChMIsKWt1diayAIVx1kaCh2s_Ahy&url=http%3A%2F%2Fwww.cnn.com%2Fvideos%2Fworld%2F2015%2F05%2F31%2Fsyria-barrel-bombs-pkg.cnn&usg=AFQjCNGmXqFOCUJ6wPV_-uxJ4MHWgKmGTQ", "http://www.twitter.com/fridaghitis", "http://i2.cdn.turner.com/cnnnext/dam/assets/140926162935-frida-ghitis-profile-image-small-169.jpg", "https://flipboard.com/section/voices-baPbmr", "http://i2.cdn.turner.com/cnnnext/dam/assets/140926162935-frida-ghitis-profile-image-medium-plus-169.jpg", "https://now.mmedia.me/lb/en/NewsReports/565949-pro-hezbollah-daily-says-party-in-syria-pact-with-russia", "http://i2.cdn.turner.com/cnnnext/dam/assets/140926162935-frida-ghitis-profile-image-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140926162935-frida-ghitis-profile-image-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140926162935-frida-ghitis-profile-image-super-169.jpg", "https://twitter.com/CNNOpinion", "http://www.defense.gov/News-Article-View/Article/620807/obama-stresses-whole-of-government-approach-in-un-speech", "http://www.facebook.com/CNNOpinion", "http://i2.cdn.turner.com/cnnnext/dam/assets/140926162935-frida-ghitis-profile-image-large-169.jpg"], "published": "2015-09-29T13:28:00.000+03:00", "crawled": "2015-09-29T09:45:14.566+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}