{"organizations": [], "uuid": "758be5549cb461f4f08ff190d0c487015d9bb114", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/police_deaths.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/09/19/police-2016-gop-candidates-want-obama-administration-to-be-more-outspoken-on/", "country": "US", "title": "Police, 2016 GOP candidates want Obama administration to be more outspoken on officer slayings", "performance_score": 10, "site": "foxnews.com", "participants_count": 2, "title_full": "Police, 2016 GOP candidates want Obama administration to be more outspoken on officer slayings | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T03:00:00.000+03:00", "replies_count": 1, "uuid": "45cf0e8ed54f23ddb9a34d1651f3f1211885cb4b"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/09/19/police-2016-gop-candidates-want-obama-administration-to-be-more-outspoken-on/#post-0", "ord_in_thread": 0, "title": "Police, 2016 GOP candidates want Obama administration to be more outspoken on officer slayings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 19, 2015 FoxNews.com   livefyre Email Print Sept. 1, 2015: A supporter of slain Fox Lake (Ill.) Police Lt. Charles Joseph Gliniewicz, Fox Lake, Illinois.  (REUTERS) \nA recent series of police officers being shot and killing is raising calls on the campaign trail and across the country for Obama administration officials to be more outspoken on the issue, like they did when Michael Brown and other black males died in police custody.    \n“This is the president’s problem because he has not shown law and order to be the rule of the day,” Republican presidential candidate and New Jersey Gov. Chris Christie recent told Fox News. \nHe specifically pointed to the estimated 200 or more so-called “sanctuary cities” in the country that won’t help enforce federal immigration law and Colorado and Washington where the Justice Department essentially won’t enforced federal marijuana laws.\n “And … the president says little or nothing about these issues where police officers are being hunted,” Christie said.\nIn just the past three weeks, two officers were ambushed and another was shot in a police chase, resulting in two deaths.\nOn Aug. 28, Texas sheriff deputy Darren Goforth was ambushed while filling up his cruiser at a suburban Houston gas station, after responding to a traffic accident. He left behind a wife and two children.\nObama called Goforth’s widow two days later, offering condolences and prayers and saying the 10-year veteran was “contemptibly shot and killed,” according to the White House.\n“Targeting police officers is completely unacceptable -- an affront to civilized society,” the president also said in a statement. “We’ve got to be able to put ourselves in the shoes of the wife who won't rest until the police officer she married walks through the door at the end of his shift. That comfort has been taken from Mrs. Goforth.”\nHowever, another 2016 GOP presidential candidate, firebrand Texas GOP Gov. Ted Cruz, suggested Goforth’s death was in part the result of efforts by the president and others in his administration to \"vilify law enforcement.\"\nAbout two weeks later, Kentucky State Trooper Joseph Cameron Ponder was killed by a suspect in a car chase. And later that day, Wisconsin Gov. Scott Walker, another 2016 GOP presidential candidate, also suggested Obama needed to do more. \n“He has been silent on this. And that’s an outrage,” Walker told CNN.\nIn between Goforth and Cameroon’s deaths, Attorney General Loretta Lynch condemned the fatal shootings, saying, “This violence against all of us, regardless of what uniform any of us wear, has to end. … The Department of Justice stands ready to support law enforcement around this country as they continue to fight every day.\"\nShe also announced a summit later this month in Detroit with law enforcement officials on the issue of violence.\nA total 30 officers have so far this year been killed while on duty by gunfire or another form of assault, according to the online Officer Down Memorial Page.\nSome people argued the recent police deaths have been exaggerated and over-politicized, considering the number killed by gunfire is down by about 26 percent, compared to the FBI number of 51 killed in 2014.\nHowever, others point out that last year’s number was an 89 percent increase compared to 2013 and that one slain officer is too many.  \nAn average 64 law-enforcement officers a year were intentional killed from 1980 to 2014, according to the FBI.\nThe debate about whether the administration has said enough essentially started in August 2014 when unarmed black teen Michael Brown died when in contact with an officer in Ferguson, Mo.\nThe incident sparked protests and rioting in which officers were injured and property, including businesses, was damaged or destroyed.\nWithin days, Obama issued a statement calling Brown’s death “heartbreaking” and said that he and first lady Michelle Obama sent their “deepest condolences.”\nIn the weeks after, then-Attorney General Eric Holder went to Ferguson to talk with civil right leaders and Brown’s family. He also said the Justice Department would use “all the power” it has to reform the Ferguson police department, if needed.\nAnd in April, the death of 25-year-old black male Freddy Gray while in police custody in Baltimore sparked protests, looting and rioting, resulting in dozens of arrests, stores torched and at least 15 police officers being injured.\nPolice were purportedly told to stand-down during the violent protests. And six city police officers are now on trial in connection with Gray’s death, which has law enforcement officials saying officers are afraid to do their job.\nObama said there was “no excuse” for “criminals and thugs” tearing up the city. And Lynch visited Baltimore in the aftermath.\nAnd third high-profile death of a black make while in police custody over roughly the past year also sparked anger at officers.\nIn July 2014, Eric Garner died in New York City after he resisted arrest for a nuisance crime and was put in a chokehold.\nThe deaths of Brown, Gray and Garner gave rise to the group BlackLivesMatter, which has tried to push the issue to the forefront of the 2016 presidential debate.\nHowever the group and its affiliates were sharply criticized and accused of fueling attacks on police offices when some members chanted at the Minnesota State Fair in late-August: “Pigs in a blanket. Fry ’em like bacon.”\n“Stop trying to fix the police, fix the ghetto,” Milwaukee County Sheriff David Clarke, who is black, recently told Fox News. “We don’t have any support from the political class.”", "external_links": [], "published": "2015-09-19T03:00:00.000+03:00", "crawled": "2015-09-19T19:04:58.241+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}