{"organizations": [], "uuid": "6ddad5f43f8492fdfb53c9cdbd085fe48b1515b1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,0,00.rss", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/09/30/house-senate-move-to-send-obama-temporary-spending-bill/", "country": "US", "title": "House, Senate move to send Obama temporary spending bill", "performance_score": 6, "site": "foxnews.com", "participants_count": 1, "title_full": "House, Senate move to send Obama temporary spending bill | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "6ddad5f43f8492fdfb53c9cdbd085fe48b1515b1"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/09/30/house-senate-move-to-send-obama-temporary-spending-bill/", "ord_in_thread": 0, "title": "House, Senate move to send Obama temporary spending bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 30, 2015 Associated Press Facebook 0 Twitter 0 Email Print A temporary funding measure that would keep the government open past a midnight deadline should make its way to President Obama on Wednesday with time to spare. \nThe measure has already helped topple the top House GOP leader and exacerbated painful divisions between more pragmatic Republicans and a tea party wing that is increasingly dominant, especially in the rough-and-tumble House. \nTea party forces are frustrated that the bill, which would prevent a repeat of the partial shutdown of the government two years ago, fails to take away federal funding that goes to Planned Parenthood. \nThe Senate and then the House are scheduled to vote on the stopgap spending measure on Wednesday. It would provide 10 weeks of time to negotiate a more wide-ranging budget deal for the rest of fiscal 2016, which ends on Sept. 30, 2016. \nHaving dodged the immediate threat of a government shutdown, congressional Republican leaders are looking ahead to talks with President Barack Obama on a long-term budget pact. \nSenate Majority Leader Mitch McConnell, R-Ky., said Tuesday that he and House Speaker John Boehner spoke with Obama recently and that he expects talks to get underway soon. \nAt issue are efforts to increase the operating budgets for both the Pentagon and domestic agencies still operating under automatic spending curbs that would effectively freeze their budgets at current levels. Republicans are leading the drive to boost defense while Obama is demanding equal relief for domestic programs. \nThe conversation among McConnell, Boehner and Obama took place earlier this month -- before Boehner announced he was stepping down. Many of the conservative GOP lawmakers who brought Boehner down want to preserve stringent \"caps\" on the spending bills Congress passes every year. But Senate Republicans are generally more eager to revisit the 2011 budget deal that put them in place. \nBoehner's surprise resignation announcement on Friday followed unrest by arch-conservatives in his conference who wanted to use the pending stopgap spending bill to try to force Democrats and Obama to take federal funding away from Planned Parenthood. \nInstead, Boehner and McConnell opted for the pragmatic route -- a bipartisan measure that steers clear of the furor over Planned Parenthood and avoids the risk of a partial government shutdown -- over the opposition of the most hardline conservative Republicans. \nRepublicans have long targeted Planned Parenthood, and the group's top official appeared before a House panel on Tuesday to defend it in the wake of videos released this summer that raise questions about its practices in providing fetal tissue for scientific research. \nRepublicans say the videos, made by abortion foes posing as private purchasers of fetal organs, show Planned Parenthood has broken federal laws including a ban on for-profit fetal tissue sales. The organization says it has acted legally and says the videos were deceitfully edited. \nOne of the Republicans' presidential aspirants, Sen. Rand Paul of Kentucky, on Tuesday endorsed a partial government shutdown as a way to gain leverage over Obama. \n\"Why don't we start out with the negotiating position that we defund everything that's objectionable, all the wasteful spending, all the duplicative spending, let's defund it all and if there has to be negotiation, let's start from defunding it all and see where we get,\" Paul said in a Senate speech. \n\"But it would take courage, because you have to let spending expire,\" he said. \"If you're not willing to let the spending expire and start anew, you have no leverage.\" \nLast week, Democrats led a filibuster of a Senate stopgap measure that would have blocked money to Planned Parenthood. Eight Republicans did not support that measure, leaving it short of a simple majority, much less the 60 votes required to overcome the filibuster. After last week's vote failed, McConnell on Monday orchestrated a bipartisan 77-19 vote on a funding bill -- stripped of the Planned Parenthood provision -- to force a final vote. \n\"This bill hardly represents my preferred method for funding the government, but it's now the most viable way forward after Democrats' extreme actions forced our country into this situation,\" McConnell said Tuesday of the stopgap measure.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T16:23:04.990+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}