{"organizations": [], "uuid": "013731da6d4aa47bdcfd4c669a70a70ccb7c9aa7", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/abortion/feed", "section_title": "Abortion on Huffington Post", "url": "http://www.huffingtonpost.com/kari-wagnerpeck/someone-is-missing-from-t_b_8034382.html", "country": "US", "title": "Kari Wagner-Peck: Someone Is Missing From the Debate on Ohio's Bill to Ban Down Syndrome Abortions", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Kari Wagner-Peck: Someone Is Missing From the Debate on Ohio's Bill to Ban Down Syndrome Abortions", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T18:07:00.000+03:00", "replies_count": 0, "uuid": "013731da6d4aa47bdcfd4c669a70a70ccb7c9aa7"}, "author": "Kari Wagner-Peck", "url": "http://www.huffingtonpost.com/kari-wagnerpeck/someone-is-missing-from-t_b_8034382.html", "ord_in_thread": 0, "title": "Kari Wagner-Peck: Someone Is Missing From the Debate on Ohio's Bill to Ban Down Syndrome Abortions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThe New York Times reported Ohio legislators are soon expected to pass a bill that would \"make it illegal for a doctor to perform an abortion if a woman is terminating her pregnancy to avoid having a baby with Down Syndrome.\" North Dakota passed a similar law in 2013. \nI do not support this kind of legislation -- even though our son has Down Syndrome. I am pro-choice, which means I support whatever reasons a woman chooses for having an abortion. \nI do, however, want more people like my son in the world, which bucks the prevalent trend to want fewer people like him. \nAm I comfortable with the fact that 60-90% of women chose to abort a fetus found to have Down Syndrome? No, I'm not. In fact, It angers me. That anger, however, is not directed at the woman having the abortion. It is at our medical community in its supreme ignorance insisting on relaying antiquated information about Down Syndrome to women at what is likely the most vulnerable time in their life. \nI place blame as well on our insistence that disability be seen as a profound disadvantage in a society that places an inordinate emphasis on normal . The greatest disability our son faces is what people think of him and how they treat him as a result -- not his Down Syndrome. \nThe New York Times interviewed two primary sources for coverage of this legislation: Right to life groups and pro-choice organizations. Both responded pro forma , meaning, as expected. \nMy alliance is obviously with the pro-choice contingent, but I was disappointed with their advocates making no mention of people with Down Syndrome. They only spoke about \"Down Syndrome\" as a potential cause for concern for expectant mothers. \nWould they lose anything in this \"battle\" by acknowledging they are poised to serve the health care needs of women with Down Syndrome -- particularly since these women are often recipients of sub-standard medical care and over-represented victims of sexual violence? \nWhat harm would it be for pro-choice organizations to acknowledge women with Down Syndrome matter to them, too? Do they realize that women with Down syndrome read newspapers? And that they may be drawn to topics related to themselves? \nThere were two contingents suspiciously absent on the debate in the article. The Times reported \"the national and local Down Syndrome associations have not taken a position on the bill.\" How is that possible? If a contentious piece of legislation was being voted on that addressed the constituents of any other advocacy organization, I am convinced some kind of statement would be made. \nEven a statement that turns the debate on its head: We're Still Pro Down Syndrome! That must part of their mission somewhere. Can't you be that and still be pro-choice? \nAre the Down Syndrome organizations following some code of conduct when it comes to this sort of legislation and the people they advocate for? It reads like: Ignore the people with Down syndrome in all of this, that would not be very uncomfortable for us. When in reality it would read as common decency and what pays their bills. \nWhat about an offensive tact by all interested parties? How about addressing the human rights of people with Down syndrome as well as the rights of women seeking safe, legal means to abortion as parallel concerns without solely responding to legislative tactics? Meaning not wait for a \"battle call\" but offering an alternative conversation played out on a long-standing basis. \nI expect more from my allies -- of which I consider the Down Syndrome and pro-choice organizations. This debate doesn't have to be a zero-sum game where we have to play by prescribed roles. \nThe second group completely absent from the Times article were -- actual people with Down Syndrome. No one who has Down Syndrome was interviewed. I find it hard to believe the Times couldn't find anyone with Down Syndrome to weigh in on an issue central to their lives. I understand that it's harder to find them but certainly a few investigative hours could have been spent finding one. Or is it that they didn't even think about it? \nTo leave people with Down Syndrome out of this conversation -- however anyone of us stands on the issue -- is promoting the worse kind of patronizing thought. I have no idea how my son, who lives with Down Syndrome, will think about abortion but I will be willing to listen and accept whatever he has to say. \nPart of re-framing this debate into a conversation that is inclusive is to include people with Down Syndrome. Let's not act as if they are already gone. \nFollow Kari Wagner-Peck on Twitter: www.twitter.com/atypicalson More:", "external_links": [], "published": "2015-08-26T18:07:00.000+03:00", "crawled": "2015-08-27T06:22:11.704+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}