{"organizations": [], "uuid": "a5b315b717c4d2d101913afe2f6db831c5ac112c", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150806193229-barack-obama-aug-6-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/08/31/politics/obama-columbia-university-teaching/index.html", "country": "US", "title": "Columbia: Obama not returning to teach, for now anyway", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Columbia: Obama not returning to teach, for now anyway - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "a5b315b717c4d2d101913afe2f6db831c5ac112c"}, "author": "Kevin Liptak", "url": "http://www.cnn.com/2015/08/31/politics/obama-columbia-university-teaching/index.html", "ord_in_thread": 0, "title": "Columbia: Obama not returning to teach, for now anyway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights President Lee Bollinger said he was excited to welcome Obama back to campus in 2017 Columbia University clarified Bollinger was referring to a component of the Obama presidential center Washington (CNN) The head of Columbia University ignited a wave of speculation Monday about President Barack Obama's post-White House activities, though the school later said there were no plans for the commander-in-chief to return to a teaching job.\nLee Bollinger, speaking to new students at the upper Manhattan campus, said he was excited to welcome Obama back to campus in 2017, the Columbia student newspaper The Spectator reported .\nLater, the school clarified Bollinger was referring to a component of the Obama presidential center that was announced in May.\nThe Barack Obama Foundation announced then it would \"maintain a presence at Columbia University for the purpose of exploring and developing opportunities for a long term association.\"\nThe main library and presidential center will be located on Chicago's South Side.\nRELATED: Obama renames tallest U.S. peak\nJosh Earnest, the White House press secretary, said Monday that Obama \"has long talked about his respect for Columbia University and his desire to continue working with them.\"\n\"However, at this point no decisions have been finalized about his post-Presidency plans,\" Earnest said.\nOriginally enrolled at Occidental College in Los Angeles, Obama eventually transferred to Columbia in 1981 as a junior, majoring in political science with an emphasis on international relations.\nIn one recent interview, Obama's thoughts drifted back to his time on Columbia's Morningside Heights campus.\nAsked what his favorite bagel flavor was, Obama recalled excursions south to a now-shuttered Upper West Side bagel institution.\n\"I would walk down from Columbia just to get H&H bagels on Saturdays or on the weekends,\" he said.\nHis order: \"Lox and capers, OK, but generally just your basic schmear.\"\nFollow @CNNpolitics", "external_links": ["http://columbiaspectator.com/spectrum/2015/08/31/obamas-coming-back-town-2017-and-more-highlights-convocation", "https://twitter.com/CNNpolitics"], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-09-01T06:05:43.718+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}