{"organizations": [], "uuid": "16a7f297952f3a076e42459dd690ba68bdc9636e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/mountmckinleydenali06102015getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/252515-denalis-height-revised-down-10-feet", "country": "US", "title": "After renaming, Obama officials cut Denali's elevation by 10 feet", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "After renaming, Obama officials cut Denali's elevation by 10 feet", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T17:19:00.000+03:00", "replies_count": 0, "uuid": "16a7f297952f3a076e42459dd690ba68bdc9636e"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/252515-denalis-height-revised-down-10-feet", "ord_in_thread": 0, "title": "After renaming, Obama officials cut Denali's elevation by 10 feet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After renaming, Obama officials cut Denali's elevation by 10 feet Getty Images By Timothy Cama - 09/02/15 10:19 AM EDT \nFederal geologists on Wednesday reduced the estimated height of the mountain Denali by 10 feet, just days after President Obama made the controversial decision to drop the name Mount McKinley. \nUsing modern Global Positioning System (GPS) technology, the United States Geological Survey (USGS) found that Denali is 20,310 feet high, not the 20,320 feet that was previously measured in the 1950s. ADVERTISEMENT Denali is still comfortably the tallest mountain in North America, 759 feet taller than Canada’s Mount Logan, the runner-up. Mount Saint Elias, on Alaska’s border with Canada, is a distant second to both Denali and Logan at 18,008 feet.\n“Knowing the height of Denali is precisely 20,310 feet has important value to earth scientists, geographers, airplane pilots, mountaineers and the general public. It is inspiring to think we can measure this magnificent peak with such accuracy,” acting USGS Director Suzette Kimball said in a statement. \n“This is a feeling everyone can share, whether you happen to be an armchair explorer or an experienced mountain climber,” she said. \nThe new elevation reading comes came three days after President Obama controversially renamed the Alaska mountain to Denali, from Mount McKinley, in order to reflect the Alaska Native name that had been used for thousands of years. \nLawmakers from President McKinley's home state of Ohio have blasted the decision. \n\"There is a reason President McKinley's name has served atop the highest peak in North America for more than 100 years, and that is because it is a testament to his great legacy,\" Speaker John Boehner (R-Ohio) said in a statement issued Sunday night. \nRepublicans in the House have vowed to explore ways to stop Obama from changing the name of the mountain. \n“This political stunt is insulting to all Ohioans,” Rep. Bob Gibbs (R-Ohio) said in a statement. “I will be working with the House Committee on Natural Resources to determine what can be done to prevent this action.\" \nThe new measurement of Denali's height resulted from a mid-June expedition to Denali’s peak organized by federal, state and academic officials that USGS detailed in a Wednesday blog post . \nAlaskan officials measured Denali’s height at 20,237 feet in 2013, but USGS never recognized that measurement, since it only used airborne radar, a technology the federal officials did not completely trust. \nDespite the change in height reading, Denali is actually growing at a rate of about 1 millimeter per year due to plate tectonic shifts, according to NASA. Tags:", "external_links": [], "published": "2015-09-02T17:19:00.000+03:00", "crawled": "2015-09-02T18:12:09.660+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}