{"organizations": [], "uuid": "fd8a2664222dcd4a72f2f1eccfbc2a3c7dbe183d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1181301/images/o-LATINO-FARMERS-POVERTY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/pesticides/feed", "section_title": "Pesticides on Huffington Post", "url": "http://www.huffingtonpost.com/arturo-s-rodriguez/farm-workers-get-same-pes_b_8208448.html", "country": "US", "title": "Arturo S. Rodríguez: Farm Workers Get Same Pesticide Protections as Other U.S. Workers Under Rules Announced by UFW, Obama Administration", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Arturo S. Rodríguez: Farm Workers Get Same Pesticide Protections as Other U.S. Workers Under Rules Announced by UFW, Obama Administration", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T15:37:00.000+03:00", "replies_count": 0, "uuid": "fd8a2664222dcd4a72f2f1eccfbc2a3c7dbe183d"}, "author": "Arturo S. Rodríguez", "url": "http://www.huffingtonpost.com/arturo-s-rodriguez/farm-workers-get-same-pes_b_8208448.html", "ord_in_thread": 0, "title": "Arturo S. Rodríguez: Farm Workers Get Same Pesticide Protections as Other U.S. Workers Under Rules Announced by UFW, Obama Administration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nFarm workers across the nation will finally be afforded nearly all the protections from pesticides other American workers have enjoyed for years under new rules announced Monday by the U.S. Environmental Protection Agency. I was privileged to join EPA Administrator Gina McCarthy and Labor Secretary Thomas Perez for today's announcement of the updating of EPA's Worker Protection Standard. \nThis action by the Obama administration ends decades exclusion of farm workers from the same pesticide rules that have safeguarded other U.S. workers for years. The new rules for pesticides now include the workers most susceptible to pesticide poisoning. \nRacism forced farm workers to be excluded from major federal labor laws since the 1930s. Then, most farm workers in the Southern U.S. were African Americans. In California, they were mostly from Mexico and the Philippines--and Mexican Americans born in the U.S. such as Cesar Chavez and his family. \nWhen the national labor laws were passed in the '30s, some Members of Congress made it very clear they didn't want black or brown farm workers to enjoy the same rights and protections as white workers. They made such bigoted statements on the floor of Congress--and they demanded farm workers be excluded from all the important labor laws enacted during the New Deal. That discrimination continued when farm workers were exempted from pesticide rules first issued to protect all other U.S. workers in the 1970s by the Labor Department. \nProtecting both farm workers and consumer has been a hallmark of the United Farm Workers since the 1960s. The first time DDT and a few other toxic pesticides were banned in the United States was not by the EPA in the early '70s, but in a UFW contract with a grape grower in 1967. The UFW has continued negotiating union contracts with pesticide protections. Cesar asked, \"What good does it do to achieve the blessings of collective bargaining and make economic progress for people when their health is destroyed in the process?\" \nThe union exposed cancer clusters in the Central Valley during the '80s. Cesar Chavez's last--and longest--public fast, of 36 days, in 1988 was over the pesticide poisoning of farm workers and their children. \nThe UFW helped enact basic pesticide protections in California, Texas and Washington state during the '80s, '90s and early 2000s. They included postings in the fields, wait periods before re-entry and pesticide drift notifications near schools. \nMost recently, we worked with President Obama, EPA Administrator McCarthy, ‎Secretary Perez and others in the administration to end this discrimination against farm workers. We joined with a big coalition of farm worker groups such as Farmworker Justice and Lideres Campesinas, and environmental groups such as Earthjustice, to build public support. Here is what these new rules now mean for farm workers in all 50 states in the United States: \n• No longer will children be legally allowed to apply pesticides. New EPA pesticide rules include for the first time requiring all pesticide applicators be at least 18 years old (instead of 16). \n• Farm workers will be able to access their own records on exposure to pesticides. Under the new rules, employers must retain pesticide application records for two years. Workers or their representatives will have easy access to all records involving exposure to hazardous chemicals. \n• Training will be required every year for all farm workers in fields where pesticides are used. Previously, the law only required training every five years, even in states such as California and Washington state with stronger pesticide protections than the federal requirements. \n• There will be central posting of pesticide hazard information. This sounds basic, but farm workers will finally have a simple sign that warns them of potential dangers in the fields they are about to enter; \n• Farm workers will finally receive the same whistleblower protections that every other worker receives. This will mean field laborers can confidentially submit complaints over pesticide abuses, including through authorized representatives such as the UFW and other farm worker organizations. \nSo today, we can say that most of the same rules that have protected other American workers from dangerous cancer- and birth-defect causing pesticides are finally going to protect farm workers under the new EPA regulations. \nIs it ever too late to do the right thing? It's been a long time coming, but it has come today. \nFollow Arturo S. Rodríguez on Twitter: www.twitter.com/ufwupdates More:", "external_links": [], "published": "2015-09-29T15:37:00.000+03:00", "crawled": "2015-09-30T03:52:04.384+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}