{"organizations": [], "uuid": "1eed3dd1eedc421667b4d3210c72d8a947ac933e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/090215_otr_randpaul_640.jpg", "site_section": "http://www.foxnews.com/ontherecord/", "section_title": "On the Record with Greta Van Susteren | Fox News", "url": "http://www.foxnews.com/transcript/2015/09/02/rand-paul-obama-should-still-be-nervous-about-iran-deal/", "country": "US", "title": "Rand Paul: Obama should still be nervous about Iran deal", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Rand Paul: Obama should still be nervous about Iran deal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "1eed3dd1eedc421667b4d3210c72d8a947ac933e"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/09/02/rand-paul-obama-should-still-be-nervous-about-iran-deal/", "ord_in_thread": 0, "title": "Rand Paul: Obama should still be nervous about Iran deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 02,\nThis is a rush transcript from \"On the Record,\" September 2, 2015. This copy may not be in its final form and may be updated.\nGRETA VAN SUSTEREN, FOX NEWS HOST: President Obama scoring a major win today as he gets critical backing for his highly controversial Iran nuclear deal, retiring Maryland Democratic Sen. Barbara Mikulski announcing her support for the deal. And with her yes vote, President now has enough votes to block Republicans from vetoing the deal.\nGOP presidential candidate, Senator Rand Paul, goes \"On the Record.\" Nice to see you, sir.\nRAND PAUL, 2016 GOP PRESIDENTIAL CANDIDATE: Thanks for having me.\nVAN SUSTEREN: So, Barbara McKowski puts him over the top?\nPAUL: You know I think we have all prematurely given the president a victory without announcing how badly he is going to be defeated. I mean, 66 U.S. Senators are going to vote to disapprove of the Iranian agreement. That's two thirds of the Senate. It's all the Republicans and 12 Democrats are going to vote to disapprove of it. Now can he overturn it with a veto and sustain a veto? Yeah, but we haven't even gotten to the disapproval yet. So I think we need to announce and go through the process of disapproving it before we talk about the veto.\nVAN SUSTEREN: Here is the thing that disturbs me. This isn't naming a post office, obviously. This is nuclear weapons. Has a complete copy of the deal with all the side deals and all the secret deals been delivered to every member of the House and Senate, so everyone who is voting knows exactly what's in it and read it?\nPAUL: That's crazy that we would actually be able to read the bills and read about what we are voting on. Yeah, absolutely we should.\nVAN SUSTEREN: But you have seen everything?\nPAUL: No, I haven't seen the side deal.\nVAN SUSTEREN: Sen. Barbara Mikulski, hasn't seen this either, then?\nPAUL: No. And I think it's more party loyalty than it is anything else. I think he has gotten the people who will vote with the president because of party loyalty regardless of the facts.\nVAN SUSTEREN: For me, I think that's insane. I don't know how you vote on something so important. I can't even make a judgment on it because no one -- I can't read the bill. I can't see the side deals. And I think anyone who is going to be responsible to a constituent is going to -- this one, read it, understands it, know everything about it before making a decision.\nPAUL: Well, to my mind, what's very important is that there needs to be some leverage to ensure compliance by the Iranians. I want it to work. I do want negotiations to work. I think negotiations are preferable to war. But at the same time the Iranians have a long history of duplicity and not adhering to international agreements. So I had always hoped that if there were an agreement, that there would be a very slow releasing of sanctions over many year periods to ensure compliance. I think that's a problem.\nVAN SUSTEREN: Do you know for sure? There is a report that the U.N. is going to outsource -- the IAEA is going to outsource the inspections essentially to the Iranians to do almost an honor system. Is that part of this?\nPAUL: That's concerning.\nVAN SUSTEREN: Is that part of this?\nPAUL: I think that's some of it. I think there also is some that will be remotely monitored that will be 24 hour cameras and monitoring. But I think some of the sampling will be done by the Iranians. That also concerns me because this is about trust, but Reagan's whole deal was trust, but verify, and the verification is the most important aspect when dealing.\nVAN SUSTEREN: For the life of me, I don't know how anyone possibly votes on this without having a complete grasp on every single aspect of this. I think party loyalty on this is irresponsible way to vote.\nPAUL: But it's also why it's important that we not announce that this is a victory for the President. He is going to have two thirds...\nVAN SUSTEREN: They have already announced the numbers.\nPAUL: I know. But there is going to be a vote of disapproval. And two thirds of the Senate is going to vote to disapprove of this. The numbers I believe they are announcing is that they can sustain a veto, right?\nVAN SUSTEREN: I guess.\nPAUL: So there is going to be a vote. There is going to be a defeat. There is going to be a rebuke of the President over 60 senators will vote to rebuke that.\nVAN SUSTEREN: Ultimately it's going to sustain a veto -- ultimately it passes and nobody has read the thing.\nPAUL: But it's going to pass with the support of 34 senators, 66 are going to be opposed to this, which shows really that two thirds of the Senate is opposed to this. And the majority of the House is opposed to this.\nVAN SUSTEREN: You and I are both have different upsets, anyway Senator, nice to so you, sir.\nPAUL: Thanks for having me.\non-the-record On the Record , hosted by Greta Van Susteren, airs on Weekdays at 7PM ET on Fox News Channel.\nMore on this show", "external_links": [], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-03T18:13:26.600+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}