{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "21798c7c548c3759f8f9dc67746b477eef7b3709", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/09/02/pope-abortion-and-mercy-what-does-letter-mean/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1441203071053.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/09/02/pope-abortion-and-mercy-what-does-letter-mean.html", "country": "", "title": "Francis, abortion, and mercy: What the pope's latest move means | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Francis, abortion, and mercy: What the pope's latest move means | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "21798c7c548c3759f8f9dc67746b477eef7b3709"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/09/02/pope-abortion-and-mercy-what-does-letter-mean.html", "ord_in_thread": 0, "title": "Francis, abortion, and mercy: What the pope's latest move means | Fox News", "locations": ["St. Peter"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francis"], "text": "Facebook 0 Twitter 0 livefyre Email Print Sept. 2, 2015: Pope Francis caresses a baby in St. Peter's Square at the Vatican. \nAs director of the world's largest Catholic organization focused on the abortion issue ( Priests for Life ), and of the world's largest ministry for healing after abortion ( Rachel's Vineyard ), I've received a lot of inquiries about the letter Pope Francis issued on September 1 expanding the authority of priests to absolve the sin of abortion. \nOf course, we welcome this development, which is a concrete expression of what the Church wants to do in the upcoming Year of Mercy (Dec. 8 2015 - Nov. 20, 2016). Yet the development is easily misunderstood in several different ways. \nFirst, we need to put the letter in context. Ever since the Jubilee Year was announced several months ago, preparations have been underway in Rome about the many details that this special observance involves. These details are handled primarily by the office called the Pontifical Council for Promoting the New Evangelization, led by Archbishop Rino Fisichella. \nThe letter of September 1 was addressed by the pope specifically to Archbishop Fisichella, as one step in the ongoing communications within the Vatican about preparations for the Jubilee Year. In that letter, an indication is given in one paragraph about the sin of abortion and how, in the Year of Mercy, the pope wants the Church to be even more clear in expressing God's mercy in regard to that sin. This letter to the Archbishop will be followed up by more detailed communications regarding canonical and pastoral implementations of this decision. In short, there is more to come which will help both the laity and the clergy to understand this decision even better. \nThe eagerness of the Church to forgive those who repent of that sin is nothing new, and the sin of abortion is forgiven every day all around the world. \nThe first possible misunderstanding of the pope's letter is to think that the Church is softening her stance on abortion. Nothing could be farther from the truth. The position that every abortion is, as the pope's letter says, \"profoundly unjust,\" has not changed and is unchangeable. \nMoreover, the eagerness of the Church to forgive those who repent of that sin is nothing new, and the sin of abortion is forgiven every day all around the world. \nOne of the most beautiful reassurances of that was issued twenty years ago when, in his encyclical The Gospel of Life, Pope Saint John Paul II addressed directly those who have had abortions, and in tender words urged them, \"do not give in to discouragement and do not lose hope…. The Father of mercies is ready to give you his forgiveness and his peace in the Sacrament of Reconciliation\" (n. 99). \nAnd in our ministry of Rachel's Vineyard , which enjoys the strong personal support of Pope Francis, we see every day how people are coming to the Church with repentance and finding forgiveness for multiple abortions. I have ministered to those who have had as many as 25 abortions, and to former abortion providers who have taken tens of thousands of lives. So forgiveness for abortion is nothing new. \nThe other possible major misunderstanding of the Pope's letter is that those who have confessed an abortion in the past may doubt whether they are forgiven. To address them directly, let me say, Yes, you are forgiven. There is no need to doubt that at all. This letter has nothing to do with what has happened in the past. If you were absolved by a priest, it is because the priest knew he had the authority to do so. If he didn't have that authority, he would have said so. \nSo what does the pope's letter mean? According to Church law, a person who commits an abortion will sometimes incur, along with the guilt of sin, a penalty from the Church. In very many instances, priests are already authorized to both absolve the sin and lift the penalty. But not always. \nWhat the pope's letter does is to give to all priests, for the Holy Year, the authorization they may not have had before to reconcile those who confess the sin of abortion. It simplifies the process outlined in Church law whereby, in certain circumstances, the priest needs to get authorization before giving absolution. In the Jubilee Year, priests will not need to delay that absolution, provided there is repentance. \nI have spoken with Pope Francis on five occasions specifically about our work of healing those who have had abortions. We at Priests for Life will continue to train and encourage our brother priests to be the heralds of mercy and compassion in the face of abortion. Truth and compassion are not in tension; they are both aspects of the same God. To treat someone with compassion includes sharing with them honestly the truth they need to hear, and to be fully truthful includes revealing the reality of compassion and mercy. \nFather Frank Pavone is National Director of Priests for Life and Missionaries of the Gospel of Life. He is president of the National Pro-life Religious Council and Pastoral Director for Rachel's Vineyard , the world's largest ministry of healing after abortion. He travels throughout the country, to an average of four states every week, preaching and teaching against abortion. ", "external_links": [], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-03T14:37:37.454+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}