{"organizations": [], "uuid": "9a9e02595f6fdcb66141ae0c20c35e176a0ae704", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/climatechange02102015getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/255190-obama-climate-official-predicts-monumental-undertaking-at-un", "country": "US", "title": "Obama climate official predicts 'monumental undertaking' at UN", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama climate official predicts 'monumental undertaking' at UN", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T00:12:00.000+03:00", "replies_count": 0, "uuid": "9a9e02595f6fdcb66141ae0c20c35e176a0ae704"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/255190-obama-climate-official-predicts-monumental-undertaking-at-un", "ord_in_thread": 0, "title": "Obama climate official predicts 'monumental undertaking' at UN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama climate official predicts 'monumental undertaking' at UN Getty Images By Devin Henry - 09/28/15 05:12 PM EDT \nPresident Obama’s climate change point person at the United Nations laid out the stakes Monday for an international global warming conference later this year. \nTodd Stern, the State Department's special envoy for climate change, told Climate Week participants that world governments are on the verge of a “monumental undertaking” if a UN conference leads to a climate agreement this December. ADVERTISEMENT “We will either succeed in accelerating a fundamental transformation of the energy base of the global economy and avert the worst effects of climate change, or we will fail, to the benefit or detriment of our children and theirs,” he said. \n“A great deal of this effort will be driven by national governments, subnational actors, enterprising businesses, creative scientists and engineers, and an enlightened global public that demands its leaders take heed and take action.” \nStern said the talks in Paris, if successful, will mark a “fundamental pivot” for government leaders and lead to a new focus on climate policies around the world. \nBut he said the world’s countries need to be on the same page in order for the effort to succeed. \n“All of this depends upon a belief that world leaders have finally come together and aligned themselves in a global regime that will push us onward and upward to confront climate change together,” he said. \n“Countries will not do their best unless they see their partners and competitors doing the same, unless they see themselves engaged in a race to the top, and unless the salutary pressure of leaders leading pushes all of us forward.” \nOfficials hope the Paris talks will yield a global accord to reduce greenhouse gas emissions worldwide and help ease future global warming. \nThe greenhouse gas plans so far announced aren’t enough to keep warming under the 2-degree Celsius mark scientists say is critical to stop the worst impacts of global warming. But officials, including Stern, have said the conference is a first step toward the kind of emissions reductions that are necessary. \n“We will not yet be at the inflection point from which emissions head downwards, but will have taken a crucial and necessary step toward that point,” he said. \nStern’s speech comes the day after Brazil became the latest major polluter to announce a greenhouse gas reduction target for the climate talks. \nThe United States has committed to reducing its emissions by 26 to 28 percent before 2030. Stern plugged a handful of major Obama administration climate policies designed to achieve that goal. \n“I may be biased, but I think you’d be hard pressed to find another leader who has been more personally engaged to such striking effect than our president,” Stern said. Tags:", "external_links": [], "published": "2015-09-29T00:12:00.000+03:00", "crawled": "2015-09-29T03:53:57.769+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}