{"organizations": [], "uuid": "807fe531e00dd9e909a459d552fa12beeb318288", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55df87821700004301568d3b.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/index.xml", "section_title": "Green - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/north-dakota-clean-water-rule_55df86fce4b0aec9f352bf68", "country": "US", "title": "Judge Blocks Obama Administration's Rule On Waterways", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Judge Blocks Obama Administration's Rule On Waterways", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T01:01:00.000+03:00", "replies_count": 0, "uuid": "807fe531e00dd9e909a459d552fa12beeb318288"}, "author": "Sam Levine", "url": "http://www.huffingtonpost.com/entry/north-dakota-clean-water-rule_55df86fce4b0aec9f352bf68", "ord_in_thread": 0, "title": "Judge Blocks Obama Administration's Rule On Waterways", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Judge Blocks Obama Administration's Rule On Waterways It wasn't immediately clear if the injunction applied to other states. By James Macpherson Posted: 08/27/2015 06:01 PM EDT \nBISMARCK, N.D. (AP) — A federal judge in North Dakota on Thursday blocked a new Obama administration rule that would give the federal government jurisdiction over some state waterways. \nU.S. District Judge Ralph Erickson in Fargo issued a temporary injunction against the rule which would have given the U.S. Environmental Protection Agency and Army Corps of Engineers authority over some streams, tributaries and wetlands under the Clean Water Act. The rule was scheduled to take effect Friday. \n\"The risk of irreparable harm to the states is both imminent and likely,\" Erickson said in granting the request of 13 states to block the rule from taking effect. The judge said that among other things, the rule would require \"jurisdictional studies\" of every proposed natural gas, oil or water pipeline project in North Dakota, which is at the center of an energy exploration boom. \nThe 13 states led by North Dakota asked Erickson to suspend guidelines that they say are unnecessary and infringe on state sovereignty. The federal government says the new rule clarifies ambiguity in the law and actually makes it easier for the states to manage some waterways. It wasn't immediately clear if the injunction applied to states other than the 13 that requested the injunction. \nNorth Dakota Attorney General Wayne Stenehjem, who filed the request, said he was pleased by the ruling. ASSOCIATED PRESS North Dakota Attorney General Wayne Stenehjem seemed pleased by the ruling. \n\"This is a victory in the first skirmish, but it is only the first,\" Stenehjem said in a statement. \"There is much more to do to prevent this widely unpopular rule from ever taking effect.\" \nThe agriculture industry has been particularly concerned about the regulation, saying that it could apply to drainage ditches on farmland. The EPA and Army Corps said the only ditches that would be covered under the rule are those that look, act and function like tributaries and carry pollution downstream. A tributary would be regulated if it shows evidence of flowing water such as a bank or high water mark, the EP says. \nThe other states involved in the lawsuit are Alaska, Arizona, Arkansas, Colorado, Idaho, Missouri, Montana, Nebraska, New Mexico, Nevada, South Dakota and Wyoming. \nErickson cited Wyoming in his ruling, saying the state would have to bear the cost of things such as issuing permits and has no way of avoiding the increased expenses under the regulation. \nState officials in North Dakota said the new rule will cost the state millions of dollars and take away from more important programs. State Agriculture Commissioner Doug Goehring said there's \"confusion and anxiety\" among farmers and other landowners over the initiative. \nAt the very least, state officials argued, more time was needed to study the rule, which was finalized on May 27. \nStenehjem — along with attorneys general and officials from 30 other states — wrote last month to the EPA and the Army Corps asking that the law be postponed at least nine months. Lawyers for the states said they heard nothing back from the government, so they filed a request for the preliminary injunction. \nThe federal government said the request for an injunction was better suited to be heard by the 6th U.S. Circuit Court of Appeals rather than a federal judge, but Erickson rejected that notion.", "external_links": [], "published": "2015-08-28T01:01:00.000+03:00", "crawled": "2015-08-28T01:05:00.991+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}