{"organizations": ["Congress | Fox News Obama", "Congress", "Facebook", "Twitter"], "uuid": "50e16e155f3031d0c9dbadff5660256524e1639a", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/082915_anhq_peters_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/02/kerry-tries-to-close-deal-with-congress-on-iran/", "country": "", "title": "Obama wins critical backing on Iran deal, virtually ensuring passage in Congress | Fox News", "performance_score": 9, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama wins critical backing on Iran deal, virtually ensuring passage in Congress | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T17:39:00.000+03:00", "replies_count": 0, "uuid": "50e16e155f3031d0c9dbadff5660256524e1639a"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/02/kerry-tries-to-close-deal-with-congress-on-iran/", "ord_in_thread": 0, "title": "Obama wins critical backing on Iran deal, virtually ensuring passage in Congress | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama wins critical backing on Iran deal, virtually ensuring passage in Congress Published September 02, 2015 Facebook 0 Twitter 0 livefyre Email Print \nThe Obama administration now appears to have enough support in Congress to stave off Republican efforts to reject his controversial Iran nuclear deal, after a retiring Maryland Democratic senator came out Wednesday morning in favor of the pact. \nSen. Barbara Mikulski, D-Md., announced her support for the deal ahead of a speech on the agreement by Secretary of State John Kerry. She becomes the 34th senator to support the deal, giving President Obama enough backing to sustain a veto of a Republican bill opposing it, should that bill pass in a vote later this month. \n\"No deal is perfect, especially one negotiated with the Iranian regime,\" Mikulski said in a statement. \"I have concluded that this Joint Comprehensive Plan of Action is the best option available to block Iran from having a nuclear bomb. For these reasons, I will vote in favor of this deal.\" \nOpposition to the agreement among Republicans, among ex-military leaders and in Israel remains widespread. But unless a supporter flips his or her vote, Obama would appear to have the crucial coalition in place to preserve the agreement in the congressional vote. \nKerry, meanwhile, is delivering what is billed as a major policy speech Wednesday in Philadelphia. He's also sending a letter to all members of Congress outlining U.S. security commitments to Israel and the Gulf Arab states in light of the nuclear deal. \nHis speech will focus on how, in their view, the international agreement makes the U.S. and its allies safer and how the deal is being mischaracterized by some opponents. More on this... Ex-lawmakers pen letter to Congress in support of Iran deal \n\"I really believe the fastest way to a genuine arms race in the Middle East is to not have this agreement,\" Kerry said in a TV interview Wednesday. \"Because if you don't have this agreement, Iran has already made clear what its direction is.\" \nRepublicans in Congress and running for president unanimously oppose the deal, which aims to curb Iran's nuclear program in exchange for relief from economic sanctions. \nThe Israeli government is vehemently against it, contending that concessions made to Iran could empower that country, which has sworn to destroy Israel. But critics struggled to use Congress' summer recess to turn the tide against the agreement, despite a multimillion-dollar lobbying campaign funded by the powerful American Israel Public Affairs Committee, or AIPAC. \nOnly two Democratic senators have come out against the deal -- Chuck Schumer of New York and Robert Menendez of New Jersey -- while in recent weeks undeclared Democratic senators, even from red states, have broken in favor one after another. \nEach side, meanwhile, has been rolling out letters of support and opposition in the run-up to a vote. \nThe latest came this past weekend with a full-page letter in The New York Times signed by more than 200 retired military generals and admirals opposing the deal. \n\"This agreement will enable Iran to become far more dangerous, render the Mideast still more unstable and introduce new threats to American interests as well as our allies,\" the letter, which previously had been sent to congressional leaders, reads. \"In our professional opinion, far from being an alternative to war, the Joint Comprehensive Plan of Action makes it likely that the war the Iranian regime has waged against us since 1979 will continue, with far higher risks to our national security interests. Accordingly, we urge the Congress to reject this defective accord.\" \nEven if Congress had been able to pass the disapproval resolution, it couldn't completely stop the deal, which was agreed to among Iran, the United States, Britain, France, Germany, Russia and China. In July, the U.N. Security Council unanimously endorsed the nuclear deal, approving a resolution that would lift the international sanctions on Iran in 90 days. \nInterviewed on MSNBC's \"Morning Joe\" program Wednesday, Kerry said that the absence of an agreement is what could lead to a nuclear arms race in the region. Putting the deal in place, he said, will keep other nations \"from chasing a weapon on their own.\" \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-09-02T17:39:00.000+03:00", "crawled": "2015-09-02T17:39:42.085+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}