{"organizations": [], "uuid": "2e5a08dcc013d9335c23c571af3a88fd7747cb74", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/DYER82515.jpg", "site_section": "http://feeds.feedburner.com/foxnews/affiliates/kpth?format=xml", "section_title": "FOX News", "url": "http://www.foxnews.com/us/2015/08/25/new-anti-abortion-video-focuses-on-intact-specimens/", "country": "US", "title": "Born alive? New anti-abortion video focuses on 'intact specimens'", "performance_score": 4, "site": "foxnews.com", "participants_count": 15, "title_full": "Born alive? New anti-abortion video focuses on 'intact specimens' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 15, "uuid": "f5e04bd289c787bd004d26c0d9b7f949bbc1c283"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/us/2015/08/25/new-anti-abortion-video-focuses-on-intact-specimens/#post-0", "ord_in_thread": 0, "title": "Born alive? New anti-abortion video focuses on 'intact specimens'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 25, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print The eighth video release by an anti-abortion group focuses on 'intact specimens' and a tissue procurement company.  (Center for Medical Progress) \nThe CEO of a company that harvests fetal tissue appears to acknowledge shipping intact specimens, a concession that could mean some aborted fetuses are being legally “born alive.”\nThe allegations are part of a new video from the Center for Medical Progress, an anti-abortion activist group that has released a series of undercover and first-person interview videos focusing on Planned Parenthood and its partners.\nTuesday’s video centers around undercover footage of an individual identified as StemExpress CEO Cate Dyer. StemExpress is a California-based company that partnered with Planned Parenthood to supply human blood, cells and tissue products to biomedical researchers. Earlier this month, StemExpress said in a statement it was cutting ties with Planned Parenthood.\nClick to see the new Planned Parenthood video. \nCMP has been the target of two restraining orders by federal judges – including one from StemExpress – banning them from releasing some of their recordings. But Los Angeles Superior Court Judge Joanne O’Donnell on Friday rejected efforts by StemExpress to block the videos. A few snippets of Tuesday’s video, as well as some key quotes, were initially released by CMP late Friday.\n“Another 50 livers a week. We’re working with almost, like, triple-digit-number clinics, and we still need more”\n- Cate Dyer, StemExpress CEO\nNear the beginning of the edited, almost 10-minute video, one of the undercover CMP buyers asks about “intact specimens.”\n“Oh yeah, I mean, if you have intact cases, which we’ve done a lot, we sometimes ship those back to our lab in its entirety,” Dyer says.\nChemicals used to kill the fetus in utero, such as digoxin, aren’t used for tissue procurement cases, according to CMP. If a fully intact fetus is delivered, the group explains, it is “likely to be a born-alive infant.”\nAside from the apparent intact revelation, the video also shows how much volume a company such as StemExpress deals in. At one point, an undercover CMP actor asks what number would make the organization “happy.”\n“Another 50 livers a week,” Dyer says. “We’re working with almost, like, triple-digit-number clinics, and we still need more.”\nPrevious videos have appeared to show Planned Parenthood officials admitting the organization alters abortion procedures to procure fetal tissue, delivers intact fetuses and sells fetal tissue for profit. Each of those practices is against federal law. A video last week featured a former procurement technician alleging that StemExpress sometimes did not obtain consent from mothers to use their fetal tissue, which would be a serious ethical breach if true.\nPlanned Parenthood has denied breaking any laws and has said payments discussed in the videos relate to reimbursement costs for procuring the tissue – which is legal.\n“These extremists show a total lack of compassion and dignity for women’s most personal medical decisions,” an Aug. 4 statement from Planned Parenthood said.\nThe videos have spurred investigations of Planned Parenthood's policies on aborted fetuses by three Republican-led congressional committees and numerous states. Investigators in Florida cited four Planned Parenthood clinics for violations earlier this month.\nThe Senate failed to advance a Republican-led measure to halt federal aid to Planned Parenthood before its summer recess. But the issue of defunding Planned Parenthood has become a rallying cry for many groups on the right and is a top issue in the Republican primary battle.", "external_links": [], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-25T17:57:43.446+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}