{"organizations": [], "uuid": "c323df9f2b1fbed78d19847a1928f542fad85b23", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/11/politics/obama-refugees-syria/index.html", "country": "", "title": "Obama says U.S. must do more to aid Syrians - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama says U.S. must do more to aid Syrians - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T23:52:00.000+03:00", "replies_count": 0, "uuid": "c323df9f2b1fbed78d19847a1928f542fad85b23"}, "author": "", "url": "http://www.cnn.com/2015/09/11/politics/obama-refugees-syria/index.html", "ord_in_thread": 0, "title": "Obama says U.S. must do more to aid Syrians - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Obama says U.S. must do more to aid Syrians By Kevin Liptak , CNN White House Producer Updated 2115 GMT (0415 HKT) September 11, 2015 JUST WATCHED Story highlights Obama said every country needs to do more to help alleviate the crisis, including the United States Obama also said the U.S. would try and eliminate some bureaucratic hurdles for refugees entering the country Ft. Meade, Maryland (CNN) President Barack Obama said Friday that the image of a lifeless toddler who washed ashore on a Turkish beach after he and his family fled Syria should prompt action from the rest of the world, including the United States. Obama said every country needed to do more to help alleviate the crisis, and that the United States would accept at least 10,000 Syrian refugees in the next fiscal year. He also said the U.S. would try to eliminate some bureaucratic hurdles toward entering the country. But the White House said Friday that certain mandatory steps -- like security checks and vaccination requirements -- could not be lifted for Syrians looking to enter the United States. The wrenching picture of 3-year-old Aylan Kurdi, laying facedown on the sand after attempting to cross the Mediterranean with his family, has come to embody the humanitarian crisis unfolding as hundreds of thousands of Syrians flee the civil war in their country. \"Those of you that saw some of those heartbreaking images of that small boy drowned, I think anybody who's a parent understands that that stirs all of our consciences,\" Obama told military members during remarks at Ft. Meade, outside Washington. As they've attempted to reach countries in Western Europe, the refugees have encountered long treks by foot and crowded trains -- and, in some cases, governments unreceptive to additional migrants. The migrant crisis, Obama said, is a product of Syria's civil war, and will only be resolved when the country stabilizes. But he added that the broader problem would persist for decades. \"The reason is because there are too many states that are not doing well by their people,\" he said. \"They are desperate and willing to take extraordinary risks\" to achieve better lives. Climate change, he said, could also trigger a rise in people driven from their homes. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics ", "external_links": [], "published": "2015-09-11T23:52:00.000+03:00", "crawled": "2015-09-11T23:52:39.738+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}