{"organizations": ["United Nations", "Facebook", "Fox News Obama", "Twitter"], "uuid": "e768ce26bd860fce954168b565856b46f1dfec14", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/28/obama-in-un-address-warns-dangerous-currents/", "country": "", "title": "Obama at United Nations: Work together or 'suffer the consequences' | Fox News", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama at United Nations: Work together or 'suffer the consequences' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T17:43:00.000+03:00", "replies_count": 0, "uuid": "e768ce26bd860fce954168b565856b46f1dfec14"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/28/obama-in-un-address-warns-dangerous-currents/", "ord_in_thread": 0, "title": "Obama at United Nations: Work together or 'suffer the consequences' | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama at United Nations: Work together or 'suffer the consequences' Published September 28, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama delivered an appeal Monday for global cooperation in dealing with terrorism and other threats, saying \"we will all suffer the consequences\" if that advice is not heeded. \nSpeaking before the United Nations General Assembly, ahead of a highly anticipated meeting on the sidelines with Russian President Vladimir Putin, Obama warned of \"dangerous currents\" that threaten the modern world. \nHe cited \"brutal networks of terror\" that have filled the vacuum in fragile states and stirred a refugee crisis on an \"epic scale.\" \nBut he also urged nations against imposing order \"by force.\" \nNations, Obama said, \"cannot return to the old ways of conflict and coercion.\" \n\"We cannot look back,\" he said. \nHe arrives at the U.N. after securing some major foreign policy achievements, including a nuclear deal with Iran and a diplomatic normalization with Cuba. \nBut overshadowing those still-controversial moves are worsening conflicts across the Middle East and the rising influence of Russia in places like Syria and Ukraine. \nObama plans to spend three days in New York, but perhaps the most anticipated moment was to come Monday evening -- a meeting with Putin on the sidelines of the annual gathering of world leaders. \nIt will be their first face-to-face meeting in nearly a year. Putin plans to address the assembly's opening session on Monday. \nThe U.S. and Russia have quibbled over who requested the meeting and what the focus will be. Putin wants to talk about Syria; Obama wants to concentrate on Ukraine. \nDespite administration efforts to turn Putin into an international pariah after Russia annexed the Crimean Peninsula from Ukraine in March 2014, Obama believes not engaging with the Russian leader \"would be wrong\" given the pressing issues in Ukraine and Syria, Obama deputy national security adviser Ben Rhodes said. \nPutin has begun a military buildup in ally Syria for reasons that U.S. officials have said remain unclear. \nAmid the tension with Russia, Obama was able to achieve a major victory when opponents of the Iran nuclear deal failed to muster enough support for a congressional resolution disapproving of the agreement. That spared Obama having to make good on his threatened veto. \nThe U.S., Germany, Britain, China, Russia and France have agreed to lift economic sanctions on Iran in exchange for restrictions on its nuclear program. Republican lawmakers opposed the deal on grounds that it will not keep Iran from ever acquiring a nuclear weapon. \nDespite progress on the Iran nuclear front, Obama remains challenged elsewhere in the Middle East. \nA campaign against Islamic State militants who have claimed broad sections of Iraq and Syria remains far from achieving Obama's goal to \"degrade and ultimately destroy\" the group, despite more than a year of military airstrikes against ISIS targets by a U.S.-led coalition of more than 60 countries. \nA separate U.S. effort to train thousands of moderate Syrian rebels to fight ISIS has turned out to be a costly failure, with fewer rebels than originally anticipated involved. Obama's first scheduled stop in New York was at a U.N. summit on steps to eradicate extreme poverty around the world. In the evening, the president planned to headline a Democratic Party LGBT fundraiser. \nBesides Monday's address to general assembly, Obama was to meet with Indian Prime Minister Narendra Modi and lead a summit on international peacekeeping. \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-09-28T17:43:00.000+03:00", "crawled": "2015-09-28T17:44:09.458+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}