{"organizations": [], "uuid": "68094b42886ebe0652807a25231c0c09d4a91bd9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Health/0/0/660_PotLeaf.jpg", "site_section": "http://www.foxnews.com/health/", "section_title": "Health News | Latest Medical, Fitness, Healthcare &amp; Nutrition News | Fox News", "url": "http://www.foxnews.com/health/2015/08/26/for-marijuana-and-brain-questions-remain/", "country": "US", "title": "For marijuana and the brain, questions remain", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "For marijuana and the brain, questions remain | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "68094b42886ebe0652807a25231c0c09d4a91bd9"}, "author": "Reuters", "url": "http://www.foxnews.com/health/2015/08/26/for-marijuana-and-brain-questions-remain/", "ord_in_thread": 0, "title": "For marijuana and the brain, questions remain", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 26, 2015 Reuters Facebook 0 Twitter 0 Email Print\nTwo new studies out today in JAMA Psychiatry highlight the persistent questions about how cannabis might affect brain development.\nIn one study, twins had similar brain volume even when one used recreational marijuana and the other didn't. But in the second study, high-risk male teens who used marijuana did have changes in brain volume.\nExperts agree that much remains unknown and the new findings just \"scratch the surface.\"\n\"We do not know nearly enough about effects of cannabis on the brain, especially the developing brain,\" said Dr. David Goldman of the National Institute on Alcohol Abuse and Alcoholism in Rockville, Maryland, in email to Reuters Health.\nFor the twin study, researchers used interview and neuroimaging data collected between 2012 and 2014 from 71 pairs of young adult twins or siblings who had never used cannabis, 81 pairs who had both used cannabis at one point, and 89 pairs where one reported using cannabis and the other did not.\nOn the whole, those who reported ever using cannabis tended to have smaller volumes in certain areas of the brain, including the left amygdala and right ventral striatum, which are involved with emotions and reward, compared to those who had not used, but all were within the range of normal variation.\nThese differences seemed to be due to genetic or environmental variation, not to a causal role of marijuana in changing the brain, the authors wrote.\n\"Some have argued that cannabis use, particularly chronic use which we did not specifically study, might induce these morphological changes,\" said senior author Arpana Agrawal of Washington University in St. Louis.\n\"We provide an alternate explanation,\" Agrawal told Reuters Health by email. \"In our study, even those who did not ever use cannabis had lower amygdala volumes if their brother or sister had used cannabis, suggesting that predisposing factors that siblings share contribute to the link between cannabis use and lower amygdala volume.\"\nTwins with mismatched cannabis use histories did not appear to have differences in brain volume.\nFor the second study, researchers investigated the connection between cannabis use and schizophrenia in more than 1,500 adolescents and young adults at high risk for the condition.\nMore than half the participants were male. All were between the ages of 12 and 21 and in all of them, genetic testing had been done to assess their risk for schizophrenia.\nMale participants with a high genetic risk for schizophrenia who reported using marijuana before age 16 had less thickness of the layers of the cerebral cortex than non-users.\nCortical thickness indicates \"how 'bushy' the cells are, how many branches they have, how good they might be at processing information,\" said senior author Dr. Tomas Paus of the Rotman Research Institute in Toronto. But this study did not test thinking ability or other actual clinical changes.\nThe researchers did not see any links between marijuana use and brain volume in low-risk males nor in low or high-risk females.\nFor certain men with a predisposition to schizophrenia, however, using cannabis may alter brain development - but this study cannot prove that smoking marijuana causes changes in the brain, the authors wrote.\n\"Something might be going on in the male brain that may make it a bit more vulnerable,\" Paus said.\nBoys with higher risk were no more likely to use cannabis than those with lower risk, so it's unlikely that they were \"self-medicating\" with the drug, told Reuters Health by phone.\nIn general, the results are useful for researchers, but most people should not be concerned by them, he said.\n\"What they should worry about is if mental illness runs in their family and they started using cannabis early,\" Paus said. \"Also remember we don't know if the differences we see in adolescence get worse, persist, or disappear,\" he said.\nGoldman, who wrote an editorial accompanying the new studies, added in his email, \"What this new research shows is that it is also dangerous to make assumptions about causality from correlation.\"\nYoung cannabis users turn out differently than others, but were already innately different, either because of genetic factors or early life experience, he said.\n\"There are so many different ways to look at the brain, we just scratch the surface here,\" Paus said.", "external_links": ["http://www.reuters.com/"], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-27T01:58:15.624+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}