{"organizations": [], "uuid": "086f9487f204d08d6e5c1301b0827ac7324300f0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/08/31/huffpost-hill-_n_8067654.html", "country": "", "title": "HUFFPOST HILL - Obama To Check Out View Of Russia", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "HUFFPOST HILL - Obama To Check Out View Of Russia", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "086f9487f204d08d6e5c1301b0827ac7324300f0"}, "author": "", "url": "http://www.huffingtonpost.com/2015/08/31/huffpost-hill-_n_8067654.html", "ord_in_thread": 0, "title": "HUFFPOST HILL - Obama To Check Out View Of Russia", "locations": ["HUFFPOST HILL", "Russia", "Russia HUFFPOST HILL"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "HUFFPOST HILL - Obama To Check Out View Of Russia Posted: reddit \nPresident Obama's going to hang out with Bear Grylls in Alaska, so hopefully everyone can agree it would be unpresidential for Obama to drink his own pee. Donald Trump released a Willie-Horton-style video attacking Jeb Bush, in case anyone still wondered whether flaming racists are a core Trump constituency. And Rand Paul said it would be \"dumb\" to build a 5,500-mile wall along the Canadian border, but hopefully we could at least make the line thicker on a map. This is HUFFPOST HILL for Monday, August 31st, 2015: \nCLINTON MIGHT BE SAFE FROM HER EMAILS - Ken Dilanian: \"Experts in government secrecy law see almost no possibility of criminal action against Hillary Clinton or her top aides in connection with now-classified information sent over unsecure email while she was secretary of state, based on the public evidence thus far.\" [ AP ] \nTRUMP STILL DISLIKES IMMIGRANTS, JEB BUSH - Donald Trump released a video on Monday attacking fellow GOP presidential candidate Jeb Bush for his comments about undocumented immigrant families, attempting to associate the former Florida governor with three undocumented men who have been charged with murder . The video implies that Bush supports policies that allow undocumented criminals -- Trump seems to think many, if not most, unauthorized immigrants belong in this category -- to remain in the United States. Trump's attack features a clip of Bush from last year talking about people who come to the U.S. to provide for their children, but omits the context -- that he was talking specifically about families. \"Yes, they broke the law, but it's not a felony,\" Bush says in the clip. \" It’s an act of love .\" [ HuffPost ] \nRAND PAUL OPPOSES HUGE 'GAME OF THRONES' WALL ON CANADIAN BORDER - Sam Stein: \"The idea of constructing a massive wall along the Canadian border won’t win any prizes for ingenuity, according to Sen. Rand Paul (R-Ky.). ' That’s a pretty dumb idea ,' Paul said Monday, when asked about the proposal one of his fellow Republican presidential candidates, Wisconsin Gov. Scott Walker, said he would consider a day earlier. ' There have been a lot of dumb ideas put out ,' Paul said, speaking with Boston Herald Radio. 'One that the Mexicans will pay for a wall, [which] was probably the dumbest of dumb ideas. But putting a wall up between us and Canada is sort of a ridiculous notion.'\" [ HuffPost ] \nWalker's campaign would like everyone to stop talking about this : \"Despite the attempts of some to put words in his mouth, Gov. Walker wasn't advocating for a wall along our northern border,\" Walker spokeswoman AshLee Strong told Madison.com . \nCARSON CATCHES TRUMP - \"The Monmouth University Poll of likely Iowa Republican caucusgoers finds Ben Carson and Donald Trump tied for the top spot. This marks the first time since July 26 that a poll in any of the first four nominating states has not shown Trump with a nominal lead.\" [ Monmouth (PDF) ] \nJoe Biden called Elizabeth Warren \"mildly demagogic\" during debate over bankruptcy reform in 2005 and we talked about it on the latest So That Happened podcast . \nWHISKEY - Hillary Clinton and Tammy Baldwin: \"One of our nation's greatest strengths is that we are governed by each other -- what President Lincoln celebrated as 'a government of the people, by the people, and for the people.' But increasingly, Americans' trust in government is eroding. And a big reason for that is the so-called revolving door between government and the private sector.\" [ HuffPost ] \nPICKLE JUICE - Chris Spargo: \"Clinton attended not one, but two fundraisers on Sunday, starting with a pancake breakfast at the East Hampton home of Susan and Alan Patricoff before heading off to a garden luncheon at Tory Burch's Southampton estate.\" [ DailyMail ] \nHaircuts: Daniel Marans, Paul Blumenthal. \nPEOPLE UPSET AT NEW/OLD MOUNTAIN NAME - Jesse Byrnes: \"Ohio lawmakers are voicing disappointment with President Obama's decision to rename Alaska's Mount McKinley to Denali, the name used by nearby natives. ' There is a reason President McKinley's name has served atop the highest peak in North America for more than 100 years, and that is because it is a testament to his great legacy ,' Speaker John Boehner (R-Ohio) said in a statement issued Sunday night. 'I'm deeply disappointed in this decision,' Boehner said, after noting that McKinley served in the Army during the Civil War before representing Ohio in Congress and as governor.\" [ The Hill ] \nDoes somebody keep forwarding you this newsletter? Get your own copy. It's free! Sign up here. Send tips/stories/photos/events/fundraisers/job movement/juicy miscellanea to huffposthill@huffingtonpost.com. Follow us on Twitter - @HuffPostHill \nCHRIS COONS ANNOUNCES HE WILL MAKE ANNOUNCEMENT - Senate heartthrob Chris Coons will announce his position on the Iran deal tomorrow at 2 p.m., his office said today. Coons is on our list of wobbly Dems who could make or break the deal. \nPATRICK MURPHY COMES OUT FOR IRAN DEAL - Amanda Terkel: \"Rep. Patrick Murphy (D-Fla.) on Monday came out in support of the nuclear deal with Iran, calling it 'the toughest decision of my time in Congress.' … Murphy and Sen. Bill Nelson (D) are the only members of Congress from Florida who have publicly backed the deal. … One of the remaining undecided lawmakers is Rep. Debbie Wasserman Schultz of Florida, the chair of the Democratic National Committee and a usual backer of the president's agenda. Wasserman Schultz has a large number of Jewish constituents and has been meeting with rabbis, business owners, community leaders and others in her district.\" [ HuffPost ] \n'LINDSEY GRAHAM QUESTIONS NEW HAMPSHIRE MAN'S VIRILITY' - Niels Lesniewski on the South Carolina Republican riffing during his stump speech bit about Social Security needing a new baby boom: \"Graham… said he actually did have someone on the campaign trail volunteer to help Social Security’s solvency by procreating later in life . 'One guy raised his hand in New Hampshire, but he was deaf -- he didn’t understand what I said. He was a nice fella, and I didn’t have any confidence either that he could actually accomplish the mission,' Graham said.\" [ Roll Call ] \nJonathan Chait on Dick Cheney whining about Obama and Iran. \nOBAMA SEEKS TO PUNCTUATE - Truly this is the Obama period of American politics. Robert Rampton: \"President Barack Obama sets off for a three-day tour of Alaska on Monday, aiming to shine a spotlight on how the United States is being affected by warming temperatures and rising oceans. With 16 months left in office, Obama is trying to build support for tough new rules on carbon emissions from power plants ahead of a hoped-for international climate deal later this year that could cement his legacy on the issue. The White House has said Obama will announce new policies to help communities adapt to climate change and deploy renewable energy. But the main purpose of his trip is to use the media attention on his tour - amplified by an aggressive social media campaign - to convince Americans to take action. ' It's a really important punctuation mark on what he's saying is a top priority for him ,' said Sharon Burke, a former Pentagon official who worked on energy issues for Obama.\" [ Reuters ] \nNine times Bernie Sanders refused to talk about crap . \nTHE BEAR IS LOOSE - Allie Malloy: \"While on his three-day trip to Alaska -- aimed at promoting climate change action -- President Barack Obama will tape an episode of 'Running Wild with Bear Grylls,' NBC and the White House announced Monday. The President will 'trek through the wilderness' with survival expert Grylls , in the special edition of the show, set to air later this year according to a press release.\" [ CNN ] \nBECAUSE YOU'VE READ THIS FAR - Enjoy this story by Megan Garber on the the life and death of the American lawn . \nKANYE WEST RUNNING FOR PRESIDENT - Maxwell Strachan: \"Kanye West, greatest human on earth, announced Sunday that he will be running for president of the United States of America in 2020. ' I have decided in 2020 to run for president ,' West said Sunday at the VMAs. The announcement naturally led to huge applause for the future leader of the free world.\" [ HuffPost ] \nCOMFORT FOOD ", "external_links": [], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-09-01T02:21:48.393+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}