{"organizations": ["Obama Administration Warns Congress", "Obama Administration Warns Congress Treasury", "ASSOCIATED PRESS Treasury"], "uuid": "fb06d8b9a02b22781fe96fdf962fbe0aa4f4e778", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f1ec9d2c00004e00aaf727.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/debt-ceiling-will-be-hit-by-end-of-october-obama-administration-warns-congress_55f1ec69e4b03784e27897f2", "country": "", "title": "Debt Ceiling Will Be Hit After October, Obama Administration Warns Congress", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Debt Ceiling Will Be Hit After October, Obama Administration Warns Congress", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T01:11:00.000+03:00", "replies_count": 0, "uuid": "fb06d8b9a02b22781fe96fdf962fbe0aa4f4e778"}, "author": "", "url": "http://www.huffingtonpost.com/entry/debt-ceiling-will-be-hit-by-end-of-october-obama-administration-warns-congress_55f1ec69e4b03784e27897f2", "ord_in_thread": 0, "title": "Debt Ceiling Will Be Hit After October, Obama Administration Warns Congress", "locations": ["Capitol Hill"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lew", "Sam Stein", "Jacob Lew"], "text": "Debt Ceiling Will Be Hit After October, Obama Administration Warns Congress Treasury Secretary Lew urges lawmakers to act before deadline nears. Sam Stein Senior Politics Editor, The Huffington Post Posted: 09/10/2015 05:00 PM EDT | Edited: 1 hour ago ASSOCIATED PRESS Treasury Secretary Jacob Lew testifies on Capitol Hill on July 29. \nWASHINGTON -- The United States government will be unable to pay its bills shortly after the end of October, the Treasury Department warned Congress on Thursday. \nIn a letter to lawmakers, Treasury Secretary Jacob Lew said the government was close to exhausting all of its extraordinary means for paying its obligations unless the debt ceiling was raised. The timeline was similar to the one Lew gave Congress when he last updated it on the country's monetary situation in late July. Since then, nothing has been done by Congress to a prevent the potential default. \nRepublican leadership has stressed that it wants to avoid a showdown like the one that precipitated a crisis in the summer of 2011 and caused a downgrading in the nation's credit rating. But conservative groups have demanded that lawmakers receive either spending cuts or entitlement reforms in exchange for raising the country's borrowing limit. \n“Leadership constantly refers to the need to rein in mandatory spending,” said Dan Holler, the communications director for Heritage Action for America. “If they do not use the debt limit as an opportunity to enact those policies – policies that are embedded in their bicameral budget – then they have no credibility on the issue. They should use the debt limit to drive down spending, both in the near term and long term, by demanding real entitlement reform such as Medicaid block grant and Medicare premium support.” \nLew, in his letter, warned that there was nothing else his department could do to prolong the deadline. \nSince my previous letter, I have taken additional action to implement the extraordinary measures that allow us, on a temporary basis, to continue paying the nation's bills. Specifically, on August 31, I suspended, as necessary, the daily reinvestment of the portion of the Exchange Stabilization Fund that is invested in Treasury securities. Each of the measures employed to date is authorized by law, and each has been used during past debt limit impasses. The effective duration of these measures depends on factors that are inherently variable and irregular, including the unpredictability of tax receipts and changes in expenditure flows. If Treasury exhausts these measures, the United States will have reached the limit of its borrowing authority, and Treasury would be left to fund the government with only the cash on hand on any given day. \nLew went on: \nAs I have stated previously, extending borrowing authority does not increase government spending. It simply allows Treasury to pay for expenditures Congress has previously approved. \n\nIn the past, failure to raise the debt limit in a timely manner has negatively impacted business and consumer confidence, financial markets, and the credit rating of the United States. To avoid these unnecessary risks, I respectfully urge Congress to raise the debt limit as soon as possible, protect the full faith and credit of the United States, and remove the threat of default. ", "external_links": [], "published": "2015-09-11T01:11:00.000+03:00", "crawled": "2015-09-11T01:11:16.258+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}