{"organizations": ["Facebook", "Fox News Obama", "Twitter"], "uuid": "471ec2d2cbcc9639ad1f3943e63908536cf48e4e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/080315_shep_iran_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/08/05/obama-suffers-key-dem-defection-on-iran-deal-ahead-major-speech/", "country": "", "title": "Obama suffers key Dem defection on Iran deal ahead of major speech | Fox News", "performance_score": 9, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama suffers key Dem defection on Iran deal ahead of major speech | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T17:57:00.000+03:00", "replies_count": 0, "uuid": "471ec2d2cbcc9639ad1f3943e63908536cf48e4e"}, "author": "", "url": "http://www.foxnews.com/politics/2015/08/05/obama-suffers-key-dem-defection-on-iran-deal-ahead-major-speech/", "ord_in_thread": 0, "title": "Obama suffers key Dem defection on Iran deal ahead of major speech | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama suffers key Dem defection on Iran deal ahead of major speech Published August 05, 2015 Facebook 0 Twitter 0 livefyre Email Print \nA top-ranking Democrat has come out against the Iranian nuclear deal ahead of a major speech Wednesday where President Obama plans to make his public case for the agreement. \nRep. Steve Israel, D-N.Y., told Newsday he will oppose the plan. Spokeswoman Caitlin Girouard confirmed his opposition to Fox News. \nThe defection is a blow to the president as he tries to shore up party support ahead of a vote in Congress expected next month. Israel is policy and communications chairman for House Democrats and the chamber's highest-ranking Jewish Democrat. \nTrying to keep a rebellion at bay, Obama heads Wednesday morning to American University. He will argue that the looming congressional vote on the Iran nuclear deal is the nation's most consequential foreign policy debate since the authorization of the Iraq war. \nThe backdrop for Obama's speech is meant to link the nuclear accord to a long tradition of American diplomacy, often conducted with unfriendly nations. He'll speak at the same university where President John F. Kennedy made a famous call for Cold War diplomacy and nuclear disarmament. His address also coincides with the anniversary of the nuclear test ban treaty, the landmark 1963 agreement Kennedy and leaders from the Soviet Union and Britain finalized shortly after the president's well-known speech. \nAhead of the speech, Senate Majority Leader Mitch McConnell, R-Ky., pointed to \"growing bipartisan concern\" over the deal. More on this... Support for Iran nuclear agreement waning \n\"It's widespread and it's well-founded,\" he said, citing recent defections. Republicans unveiled legislation on the House side Tuesday to oppose the deal. \nObama's address is part of an intense summer lobbying campaign by both supporters and opponents of the nuclear deal. Congressional lawmakers will vote next month on a resolution either approving or disapproving of the pact. \nSome key Democratic lawmakers announced their support this week, including Sens. Tim Kaine of Virginia, Barbara Boxer of California and Bill Nelson of Florida. \nHowever, the administration lost the backing of three prominent Jewish Democrats -- Nita Lowey and Florida Rep. Ted Deutch, in addition to Rep. Israel. \nObama has presented the choice before lawmakers as one of war and peace. During a private meeting Tuesday with American Jewish leaders, Obama said that if Congress blocks the deal, the only option he or the next president would have for stopping Iran from obtaining a nuclear weapon is military action. \nCritics of the deal, including Israeli Prime Minister Benjamin Netanyahu, say Obama is delegitimizing their concerns and instead painting them as eager for war. In a webcast Tuesday aimed at American Jews, Netanyahu called that argument \"utterly false\" and said Israel wants peace, not war. \nTo Obama, Kennedy's willingness to negotiate with the Soviet Union at the height of the Cold War is a useful comparison for defending his engagement with Iran, a country long at odds with the U.S. and its allies, particularly Israel. \n\"This deal is also in line with a tradition of American leadership,\" Obama said as he announced the Iran accord last month. \"It's now more than 50 years since President Kennedy stood before the American people and said, `Let us never negotiate out of fear, but let us never fear to negotiate.\"' \nThat line, from Kennedy's 1961 inaugural address, was echoed in his disarmament address at American University two years later. Speaking to graduates, Kennedy said, \"No government or social system is so evil that its people must be considered as lacking in virtue.\" \nAmerican University is also where Kennedy's brother, the late Sen. Edward M. Kennedy, endorsed Obama in the 2008 Democratic presidential primary, a significant passing of the political torch from the youthful late president's family to a new generation. \nEven as they link Obama's diplomacy to Kennedy's, White House officials argue that the president's Iran accord has a key advantage over the nuclear test ban treaty. Earnest said that while Kennedy had to roll back components of the U.S. nuclear program to strike a deal, Obama made no concessions to Iran that weaken U.S. national security. \nFox News' Rich Edson and The Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-08-05T17:57:00.000+03:00", "crawled": "2015-08-05T17:58:06.634+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}