{"organizations": [], "uuid": "2081ff49b67ccc9668759c2af10aca8ab0f171ef", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/28/politics/president-barack-obama-united-nations-partisan-attacks/index.html", "country": "", "title": "Obama wades into 2016 politics at U.N. - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama wades into 2016 politics at U.N. - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T21:12:00.000+03:00", "replies_count": 0, "uuid": "2081ff49b67ccc9668759c2af10aca8ab0f171ef"}, "author": "", "url": "http://www.cnn.com/2015/09/28/politics/president-barack-obama-united-nations-partisan-attacks/index.html", "ord_in_thread": 0, "title": "Obama wades into 2016 politics at U.N. - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama wades into 2016 politics at U.N. By Jeremy Diamond , CNN Updated 1846 GMT (0146 HKT) September 28, 2015 President Barack Obama addresses the 70th annual United Nations General Assembly at the UN headquarters September 28, 2015, in New York City. Washington (CNN) President Barack Obama went beyond criticizing foreign powers at the United Nations on Monday to take veiled shots at Republican presidential candidates, including Donald Trump, though he didn't mention any by name. The President slammed the notion of \"building of walls to keep out immigrants,\" which several GOP candidates, including Trump, have espoused and generally the \"politics of us versus them.\" Obama's comments marked a rare moment when a president used an address to the global body as a venue for singling out domestic political opponents. Obama, however, didn't limit his attacks to Republicans, noting that some on the other side of the aisle have made similar objections. \"We see greater polarization, more frequent gridlock; movements on the far right, and sometimes the left, that insist on stopping the trade that binds our fates to other nations, calling for the building of walls to keep out immigrants,\" he said. He also took on the critique that many conservatives have leveled against him for projecting weakness and relying too much on diplomacy that doesn't serve U.S. interests, challenging their own approach. \"Even as our economy is growing and our troops have largely returned from Iraq and Afghanistan, we see in our debates about America's role in the world a notion of strength that is defined by opposition to old enemies, perceived adversaries, a rising China or a resurgent Russia, a revolutionary Iran or an Islam that is incompatible with peace,\" Obama said. He continued,\"We see an argument made that the only strength that matters for the United States is bellicose words and shows of military force. That cooperation and diplomacy will not work.\" Many Republicans have slammed Obama's foreign policy approach, criticizing the Democrat for not taking a hard enough stance on aggressive Russian actions in the world and for failing to curtail the rise of China. And Republican candidates running for president have nearly unanimously called for strengthening the U.S. military, favoring a stronger approach to defeating ISIS and to confronting the U.S.'s enemies in the world. The Republicans have also strongly opposed the nuclear deal Obama brokered with Iran, with several Republican presidential contenders vowing to tear up the deal if they become president. Obama has framed opposition to that deal as favoring a military solution over a diplomatic consensus. In his speech Monday, Obama also defended the deal and the international process he used to achieve it. \"After I took office, I made clear that one of the principal achievements of this body -- the nuclear non-proliferation regime -- was endangered by Iran's violation of the NPT,\" he said, referring to the treaty governing that regime. \"On that basis, the (U.N.) Security Council tightened sanctions on the Iranian government, and many nations joined us to enforce them. Together, we showed that laws and agreements mean something.\" ", "external_links": [], "published": "2015-09-28T21:12:00.000+03:00", "crawled": "2015-09-28T21:14:22.410+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}