{"organizations": [], "uuid": "6db97fb97d995cf6f9e05d704d74c1666102a31e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Health/0/0/e_cig_colorful_reuters.jpg", "site_section": "http://www.foxnews.com/health/", "section_title": "Health News | Latest Medical, Fitness, Healthcare &amp; Nutrition News | Fox News", "url": "http://www.foxnews.com/health/2015/09/08/survey-finds-teens-using-e-cigarettes-to-vaporize-marijuana-products/", "country": "US", "title": "Survey finds teens using e-cigarettes to vaporize marijuana products", "performance_score": 0, "site": "foxnews.com", "participants_count": 5, "title_full": "Survey finds teens using e-cigarettes to vaporize marijuana products | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 4, "uuid": "61b077cd769dce8b8b03ecd6079d972e01f7bc1c"}, "author": "Alexandria Hein", "url": "http://www.foxnews.com/health/2015/09/08/survey-finds-teens-using-e-cigarettes-to-vaporize-marijuana-products/#post-0", "ord_in_thread": 0, "title": "Survey finds teens using e-cigarettes to vaporize marijuana products", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Alexandria Hein\nPublished September 08, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print An e-cigarette sits in a tray on the bar at the Henley Vaporium in New York City December 18, 2013. (REUTERS/Mike Segar)\nResearchers surveying e-cigarette use in teens were surprised to find that nearly one in five high school students who admitted to using the device have also used it to vaporize cannabis or byproducts like hash oil.\n“We have been evaluating the use of e-cigarettes among this young group of users for a couple of years now, and we know they are using it at a pretty high rate and we assumed it was for nicotine,” senior study author Dr. Suchitra Krishnan-Sarin, a professor of psychiatry at Yale University School of Medicine, told FoxNews.com. “We did not anticipate the marijuana use with e-cigarettes.”\nThe study, published Sept. 7 in the journal Pediatrics, surveyed 3,847 Connecticut high school students and found 27.9 percent reported using e-cigarettes. Of those users, 18.7 percent say they have used e-cigarettes to vaporize marijuana.\nE-cigarettes are powered by batteries that activate a heating element when inhaled, vaporizing a liquid nicotine solution contained in small tubes. According to the study, hash oil can be substituted for the nicotine solution in many traditional e-cigarettes and some vendors sell the devices specifically designed for use with marijuana leaves or wax infused with THC, the chemical responsible for most of marijuana’s psychological effects.\n“The smell of vaping marijuana isn’t as strong as smoking it, plus the similarity in appearance of hash oil and nicotine solutions make this a really inconspicuous way of using marijuana,” study author Meghan Morean, assistant professor of psychology at Oberlin College, said in a news release.\nWhile the survey does not assess whether the availability of e-cigarettes leads to more marijuana use in youth, the authors noted that previous studies suggested vaping concentrated liquid forms can be more potent than smoking dried marijuana leaves.\nKrishnan-Sarin said the results of the current study suggest a need for better regulations around the use of e-cigarettes. Beginning with how they are manufactured, Krishnan-Sarin said regulators should look into making the e-cigarettes harder to manipulate for better control over how they are used.\n“We need to understand a lot of things about the use of marijuana and e-cigarettes,” Krishnan-Sarin said. “What are the use patterns and are these kids who have just used it once or is this actually leading to continued use of marijuana?” she said.\n“There’s a lot more of what we don’t know than what we do,” she said.\nPrevious studies have linked e-cigarette use in high students with later tobacco use. A government-funded study published in the Journal of the American Medical Association stopped short of proving that e-cigarettes are a “gateway drug,” for tobacco use in teens, but doctors said the results showed the devices need to be strictly regulated.\nThe research team is currently planning more follow-up surveys to better understand the relationship between e-cigarette use and marijuana use in teens.", "external_links": [], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T18:48:59.068+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}