{"organizations": [], "uuid": "960361dddd190f3dda2baa060b0a99b593a1d41a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/split_getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/cybersecurity/253713-obama-cyber-sanctions-could-spur-chinese-backlash", "country": "US", "title": "Obama cyber sanctions could spur Chinese backlash", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama cyber sanctions could spur Chinese backlash", "spam_score": 0.0, "site_type": "news", "published": "2015-09-15T22:51:00.000+03:00", "replies_count": 0, "uuid": "960361dddd190f3dda2baa060b0a99b593a1d41a"}, "author": "bgoad@thehill.com (Cory Bennett)", "url": "http://thehill.com/policy/cybersecurity/253713-obama-cyber-sanctions-could-spur-chinese-backlash", "ord_in_thread": 0, "title": "Obama cyber sanctions could spur Chinese backlash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama cyber sanctions could spur Chinese backlash By Cory Bennett - 09/15/15 03:51 PM EDT \nSwift economic retaliation against American businesses is expected if the White House levies hacking sanctions against Chinese companies. But U.S. industry groups are still pressuring the government to stand up to China over what’s believed to be a massive campaign to pilfer corporate secrets from U.S. firms. The alternative, they say, could be even worse: Unabated cyberattacks that drain the American private sector of its global competitive advantage. “You have, on one hand, the economic implications of doing something, but also the economic implications of not doing something,” said Nicholas Ahrens, vice president of privacy and cybersecurity for the Retail Industry Leaders Association (RILA), which represents retailers and retail product manufacturers. Despite reports that the Obama administration will hold off on sanctioning China before President Xi Jinping’s upcoming state visit, it’s still believed those penalties are coming. The White House is under considerable pressure to take a hard line with China. Lawmakers on both sides of the aisle have been hammering President Obama over what’s been seen as a lackluster response to China’s recent currency devaluation and its contested territorial claims in the South China Sea. The issue has become a major talking point in the GOP presidential primaries, where poll leader Donald Trump has scored points by bashing the administration for its inability to negotiate with China. \"They want our people to starve — they’re taking our business away,” Trump said of China late last month. “They've taken our jobs away.” President Obama issued a harsh warning for Beijing on Friday, calling the Asian superpower out for its cyber theft campaign. \"We've made very clear to the Chinese that there are certain practices that they're engaging in that we know are emanating from China and are not acceptable,\" Obama said at Fort Meade. \"And we can choose to make this an area of competition — which I guarantee you we'll win if we have to — or, alternatively, we can come to an agreement in which we say, ‘This isn't helping anybody,’” he continued. But going after China with hacking sanctions — which would likely freeze the U.S. assets of particular companies and individuals and bar them from making U.S. deals — will generate significant blowback, Chinese policy specialists explained. “It’s going to make it very tough for U.S. companies in the China market,” said Samm Sacks, a China analyst at the political-risk consulting firm Eurasia Group, who has advised government agencies on Chinese tech policy. “That’s a consequence that has to be weighed in the decisions.” China is currently considering a slate of laws that critics insist are designed to lock out foreign businesses. A new set of banking technology regulations would limit the Chinese financial sector’s ability to use non-Chinese technology. Meanwhile, a counterterrorism law would require outside companies to install Beijing-approved encryption and give up source code for inspection. Propelled by business groups such as the U.S. Chamber of Commerce, the White House has pressed hard to win minor concessions and delays on these pending regulations, particularly the banking procurement rules. Beijing briefly paused their rollout in March but last month began preparing a new version. The rules are causing great concern in the business community. Eighteen U.S. and international trade groups wrote to Chinese regulators on Monday, urging them to avoid prescriptive and discriminatory mandates. “Policies must allow companies to conduct their own risk assessments and determine what technology best meets their security needs,” said the letter.Hacking sanctions would likely weaken any bargaining power for these industry groups, not to mention the Obama administration, experts said. “Any type of compromise on those is going to come to a halt,” Sacks said. Sacks could also see the Chinese government retaliating against U.S. companies in the same sectors that the U.S. hits with its hacking penalties. Officials could rescind approval for projects in China, delay licenses or even put broad restrictions on foreign investment in that sector, she explained. It’s a prospect that has businesses slightly wary of the looming sanctions. “There is that tension, no question,” said the RILA's Ahrens. The Chinese market already presents myriad difficulties for outside firms, particularly tech companies. In recent years, Beijing has been turning the screws on foreign companies, imposing regulations, restricting licenses and levying fines that many see as simply protectionist. China's government has reportedly also slowly axed top Western tech firms from its approved state purchase list. Tech giant Apple, equipment maker Cisco Systems, security firm McAfee and software company Citrix Systems have all been dropped since 2012. “The tech industry is over a barrel [in China],” said Robert Atkinson, an economist and president of the Information Technology and Innovation Foundation (ITIF), a public policy think tank. “The question for them is just how high do they jump?” At times, policy analysts believe Beijing’s moves can be traced back to White House attempts to punish China for digital espionage. Over the last year, Beijing has slapped a series of high-profile fines on major U.S. tech companies. Mobile chipmaker Qualcomm was hit with a record $975 million antitrust fine, while Microsoft forked over $140 million for alleged tax evasion. Just last week, Apple paid China $10 million in a similar tax evasion case.Some see the penalties as ongoing retaliation for the Justice Department’s 2014 indictment of five Chinese military members for hacking American companies.Yet for many companies, one-off fines and restrictive local laws are less insidious than the ongoing deluge of cyberattacks that robs U.S. firms of proprietary information, slowly eroding a competitive edge over Chinese companies. Former National Security Agency Director Gen. Keith Alexander estimated in 2012 that China’s digital economic espionage campaign cost the U.S. economy $338 billion each year. It’s an estimate many believe is growing annually. “We feel daily the effects of cyberattacks against our companies,” Ahrens said. “Any steps the administration and the government can take to take that strain off of the private sector would be good.” Sanctions would be one of those steps. “U.S. business want to see the federal government stand by their word when they talk about enforcing the line against nation state cybersecurity attacks,” said Norma Krayem, a lobbyist who has represented a number of major U.S. tech firms. “Ultimately, I think that everyone understands the U.S. has to take some sort of action at some point,” added Krayem, who co-chairs the Data Protection and Cybersecurity division at law firm Holland & Knight. But some, including ITIF’s Atkinson, wonder if targeted penalties represent the worst of both worlds: Spurring retaliation against U.S. businesses while also failing to impede the flood of Chinese cyberattacks. Atkinson believes the government needs a broader approach to combat China’s legally questionable tactics to boost domestic industry at the expense of foreign competitors.“They’re just doing these little surgical hits here and there, poking the bear,” he said. “What they need to do is describe the bear’s overall strategy.\"", "external_links": [], "published": "2015-09-15T22:51:00.000+03:00", "crawled": "2015-09-16T01:12:03.052+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}