{"organizations": ["U.N.", "ISIS", "UN", "U.N. General Assembly", "NATO", "Raul Castro United Nations", "CNN"], "uuid": "08cb491409a7445518aba27f7db098e6fcac6fb6", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150928104355-obama-unga-sept-28-2015-large-169.jpg", "site_section": "http://feeds.feedburner.com/NewsUnNews-GoogleNews", "section_title": "NEWS UN news - Google News", "url": "http://edition.cnn.com/2015/09/27/politics/obama-un-general-assembly/", "country": "IL", "title": "Obama hits Putin, Republicans in UN speech - CNN", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama hits Putin, Republicans in UN speech - CNN", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T19:33:00.000+03:00", "replies_count": 0, "uuid": "08cb491409a7445518aba27f7db098e6fcac6fb6"}, "author": "", "url": "http://edition.cnn.com/2015/09/27/politics/obama-un-general-assembly/", "ord_in_thread": 0, "title": "Obama hits Putin, Republicans in UN speech - CNN", "locations": ["Iran", "Eastern Ukraine", "U.S.", "Moscow", "North Africa", "Russian", "Syria", "Libya", "Russia", "Middle East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevin Liptak", "Bashar al-Assad", "Assad", "Donald Trump", "Barack Obama", "Putin", "Ben Carson", "Vladimir Putin", "Obama"], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Obama hits Putin, Republicans in U.N. speech By Kevin Liptak , CNN White House Producer Updated 1800 GMT (0100 HKT) September 28, 2015 JUST WATCHED The President discusses the fight against ISIS Obama is expected to meet with Putin, Raul Castro United Nations (CNN) President Barack Obama slammed adversaries in Russia and Syria -- and political foes at home -- while defending the use of diplomacy over force in his address to the U.N. Monday. In a speech at times defensive and accusatory, Obama sought to use his favored weapon -- oratory -- to beat back his international challengers as well as conservatives in the U.S. who've branded him a weak leader presiding over a legacy of declining power abroad. He also took the unusual step of harnessing the global stage to rebuke the views of Republican presidential candidates on immigration and religious pluralism, perhaps mindful that this was his penultimate speech to the world body and the last before the race to replace him overwhelms the national dialogue. Obama slammed \"the building of walls to keep out immigrants\" and \"demonizing\" of those of different religions, an oblique reference to some of the incidents that have cropped up on the 2016 presidential campaign trail. He didn't mention Republican candidates Donald Trump or Ben Carson by name, but he seemed to be referencing their campaigns in his remarks. He also took direct aim at Russian President Vladimir Putin and Syrian President Bashar al-Assad, saying their actions had flouted international rules and brought their countries back in time. Putin, for his part, put the onus on the U.S. for much of the chaos in the Middle East. In a U.N. address that came within 90 minutes of Obama leaving the stage, Putin blamed the U.S. and its allies for creating a power vacuum in the Middle East and North Africa, including in Libya, and of waging a campaign against Russia using economic sanctions and NATO expansion. JUST WATCHED MUST WATCH Obama: We want a strong Russia that will work with us 02:12 Putin proposed a global alliance to rebuild the Syrian state and to wage war against ISIS. He also mocked the U.S. failure to deploy moderate opposition fighters in Syria to fight the terror organization, also know as the Islamic State. \"First they are armed and trained, and then they defect to the so-called Islamic State,\" Putin said. Speaking generally about Putin's remarks, a senior U.S. administration official pointed to Obama's own remarks earlier in the day. \"The best response is what the President said about the need to work collectively through -- and not in contravention of --today's institutions, including the UN,\" the official said. \"The President's remarks laid out in pretty stark terms how our approach differs from what we've seen from Moscow.\" Obama is under fire at home as well as from world leaders such as Putin, however, for the slow progress in the fight against ISIS. He also has failed to dislodge Russian fighters entrenched in Eastern Ukraine through the very measures Putin lambasted. Obama's address was in part an effort to shore up international support for U.S. appraoches to these and other global crises. In particular, he advocated for his efforts to utilize diplomacy to end the crises that have cost lives and displaced millions. READ: 5 things to watch at the U.N. General Assembly this week \"We, the nations of the world, cannot return to the old ways of conflict and coercion. We cannot look backwards,\" he said. \"We live in an integrated world, one in which we all have a stake in each other's success. We cannot turn back those forces of integration.\" Diplomatic wins -- including the Iran nuclear deal and a thaw in U.S.-Cuba ties -- have given Obama a boost. But a year after he announced his plan for airstrikes to combat ISIS terrorists, the President has faced pressure to explain the next steps in the unraveling situation in Syria. Calling Assad a tyrant, Obama criticized calls from other world leaders, namely Putin, to keep him in power. \"We're told that such retrenchment is required to beat back disorder -- that it's the only way to stamp out terrorism and prevent foreign meddling,\" Obama said. \"In accordance with this logic, we should support tyrants like Bashar al-Assad who drops barrel bombs to massacre innocent children because the alternative is surely worse.\" Obama made another call for a \"managed transition\" away from Assad's government as a way to end the country's bloody civil war. \"When a dictator slaughters tens of thousands of his own people, that is not just a matter of one nation's internal affairs,\" he said. \"It breeds human suffering on an order of magnitude that affects us all.\" JUST WATCHED", "external_links": [], "published": "2015-09-28T19:33:00.000+03:00", "crawled": "2015-09-29T21:23:29.953+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}