{"organizations": [], "uuid": "18d5115830ab6cd8419774a6bdfc0fa26c2143c5", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150921204005-donald-trump-pope-francis-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/24/politics/donald-trump-pope-francis-immigration-climate-change/index.html", "country": "US", "title": "Donald Trump vs. the Pope on immigration, climate - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Donald Trump vs. the Pope on immigration, climate - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "18d5115830ab6cd8419774a6bdfc0fa26c2143c5"}, "author": "Jeremy Diamond", "url": "http://www.cnn.com/2015/09/24/politics/donald-trump-pope-francis-immigration-climate-change/index.html", "ord_in_thread": 0, "title": "Donald Trump vs. the Pope on immigration, climate - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington Donald Trump believes Pope Francis' words on immigration are \"beautiful,\" but expressed fundamental disagreements with the Pope on how to handle immigrants as well as the need to address climate change.\nOn Wednesday, Pope Francis urged Americans to \"not be afraid to welcome\" immigrants into the U.S., a stark contrast with Trump's harsh language calling undocumented Mexican immigrants \"killers\" and \"rapists.\" Trump has also pledged to build a massive wall on the U.S.-Mexico border and deport the estimated 11 million undocumented immigrants living in the U.S.\n\"Well, I think his words are beautiful and I respect the Pope and I like the Pope very much,\" Trump said Thursday to CNN's Alisyn Camerota on \"New Day.\" \"I will say this, we have a country that is going through tremendous problems. We owe $19 trillion. So No. 1 we can't afford this process.\"\nTrump pointed to crimes committed by undocumented immigrants in the U.S., and said America needs to keep undocumented workers from taking jobs from Americans.\nTrump also broke with the Pope's strenuous plea for the U.S. and other countries to seriously address climate change and work to protect the environment.\nTrump insisted that he was \"not a believer in climate change,\" claiming that extreme weather patterns scientists attribute to man-made climate changes are simply \"weather.\"\n\"It's called weather changes and you have storm and you have rain and you have beautiful days,\" Trump said.\nTrump suggested clean energy policies to reduce CO2 emissions would \"imperil jobs\" and \"the middle class and lower classes.\"\nThere is overwhelming scientific evidence backing the theory that global warming is occurring and is tied to man-made activities.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-24T16:07:04.811+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}