{"organizations": ["Portland Press Herald", "Colorado Appeals Court Email Marijuana Conviction Overturned By Colorado Appeals Court"], "uuid": "1294f2578d1930ea7c4675ce6fedee534338d0ee", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d4c4ed1400002e002e3671.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/marijuana-conviction-overturned-colorado_55d4ac73e4b0ab468d9f4321", "country": "", "title": "Marijuana Conviction Overturned By Colorado Appeals Court", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Marijuana Conviction Overturned By Colorado Appeals Court", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T22:52:00.000+03:00", "replies_count": 0, "uuid": "1294f2578d1930ea7c4675ce6fedee534338d0ee"}, "author": "", "url": "http://www.huffingtonpost.com/entry/marijuana-conviction-overturned-colorado_55d4ac73e4b0ab468d9f4321", "ord_in_thread": 0, "title": "Marijuana Conviction Overturned By Colorado Appeals Court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Ferner"], "text": "Email Marijuana Conviction Overturned By Colorado Appeals Court \"Colorado voters made it clear that they do not want adults to be punished for possessing small amounts of marijuana.\" Matt Ferner National Reporter, The Huffington Post Posted: 08/19/2015 02:56 PM EDT Credit: Portland Press Herald via Getty Images \nA state appeals court has overturned the marijuana conviction of a Colorado woman who was sentenced and convicted for marijuana possession just days after voters approved a measure legalizing recreational marijuana in the state almost three years ago -- retroactively applying the law to her case. \nCiting a decision in a previous case, the appeals court ruled that convicted criminal defendants should receive “benefit of amendatory legislation which became effective at any time before the conviction became final on appeal,” the opinion, issued last week, reads . \nAccording to the court opinion, Pamela Boyd, the defendant in the case, and her boyfriend were in the boyfriend's van when they were approached by an undercover police officer who purchased marijuana from Boyd's boyfriend. Boyd's boyfriend placed the cash from the purchase on the van's dashboard and drove away. Moments later when police officers stopped the van and arrested Boyd and her boyfriend, they found a small amount of marijuana, and the cash from the purchase, in Boyd's pocket. \nBoyd was found guilty by a jury on Aug. 12, 2012, of possession of marijuana and attempted distribution of the drug and was convicted on Nov. 14 that same year. But a little more than a week before her conviction, Amendment 64, which legalized recreational marijuana in the state, was approved by state voters . Less than a month later, that law went into effect . \nBoyd argued that the state's recreational marijuana law retroactively decriminalized marijuana possession so it should apply to her conviction of being in possession of marijuana because the law, among other things, legalizes the possession of up to an ounce of cannabis. \nBecause Boyd's appeal was pending, the court decided that \"her conviction for possession of less than one ounce of marijuana must be vacated.\" \nThis logic follows a landmark 2014 appeals court decision stating that Colorado's marijuana law could be retroactively applied to minor marijuana offenses if the person convicted had already begun the appeals process when the law went into effect. In that 2014 ruling, the court overturned a possession conviction from a 2010 case in which a woman was found in possession of a small amount of marijuana as well as concentrated extract derived from the plant. \nWhile Boyd's possession conviction was voided by the court, her other conviction -- for attempted distribution of marijuana -- was affirmed, as Amendment 64 does not allow for sale of marijuana by anyone other than licensed retail outlets. \nAdvocates for marijuana legalization cheered the court's overturning of the possession count. \n\"Amendment 64 is doing exactly what it was intended to do,\" Mason Tvert, communications director for Marijuana Policy Project, said to The Huffington Post. \"Colorado voters made it clear that they do not want adults to be punished for possessing small amounts of marijuana. Hopefully this ruling will ensure these convictions get overturned in any similar cases that might be pending. Fortunately, we have taken the steps needed to prevent these possession convictions from occurring to begin with.” \nAttorney Michael Evans, who represents Brandon Coats, a quadriplegic medical marijuana patient from Colorado whose firing by Dish Network in 2010 for using the drug while at home and off-duty was upheld by the state Supreme Court earlier this year, found the appeals court ruling to be \"frustrating\" in relation to his client's case. \n\"Try to reconcile this with the holding in Coats v. Dish, which arguably said the exact opposite,\" Evans wrote Wednesday morning in an email to multiple reporters who have covered the Coats case. \nWhile both medical and recreational marijuana are legal in Colorado, the federal government continues to ban the plant, classifying it as one of the \"most dangerous\" and without medical value. And the federal government's position on the drug was used by both the state Supreme Court and Court of Appeals in their decisions against Coats . \n\"It’s never a good idea for the Court to take the path of least resistance when deciding a case, although commonly done like in Coats,\" Evans wrote. \"Coats urged the Court to take on and decide many more issues than it did -- and because they did not, now you get this... Pretty frustrating.\" For more from The Huffington Post, download our app for iOS or Android . \nAlso on HuffPost: Top 50 Most Influential Marijuana Users of ", "external_links": [], "published": "2015-08-19T22:52:00.000+03:00", "crawled": "2015-08-19T22:52:23.974+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}