{"organizations": [], "uuid": "5af47ac41981b836355c8311cced4b5f0166c44f", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/09/24/obama-putin.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/09/24/vladimir-putin-se-reunira-con-barack-obama-para-hablar-de-siria-y-ucrania?hootPostID=9ae4876d2df3802be50080fff0e119bf", "country": "", "title": "Vladimir Putin se reunirá con Barack Obama para hablar de Siria y Ucrania", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Vladimir Putin se reunirá con Barack Obama para hablar de Siria y Ucrania", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T13:15:00.000+03:00", "replies_count": 0, "uuid": "5af47ac41981b836355c8311cced4b5f0166c44f"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/09/24/vladimir-putin-se-reunira-con-barack-obama-para-hablar-de-siria-y-ucrania?hootPostID=9ae4876d2df3802be50080fff0e119bf", "ord_in_thread": 0, "title": "Vladimir Putin se reunirá con Barack Obama para hablar de Siria y Ucrania", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Vladimir Putin se reunirá con Barack Obama para hablar de Siria y Ucrania Ambos mandatarios estarán en la ciudad de Nueva York la próxima semana en el marco de la Asamblea General de la ONU Jueves, 24 de septiembre de 2015 a las 12:42 Los mandatarios en 2013, en uno de sus últimos encuentros cara a cara (Getty Images/ Archivo). Lo más importante Se trata del primer encuentro oficial entre ambos desde junio de 2013 Temas relacionados Al Assad debe dejar la presidencia de Siria: EU \nMOSCÚ (AFP) — El presidente ruso Vladimir Putin se reunirá con su par estadounidense Barack Obama el lunes 28 de septiembre en Nueva York, donde los dos jefes de Estado hablarán ante la Asamblea General de la ONU, anunció este jueves el Kremlin. \n\"Nos hemos puesto de acuerdo para una reunión con Obama\", declaró el portavoz del Kremlin, Dmitri Peskov, a las agencias de prensa rusas y agregó que Putin se entrevistará también con el primer ministro japonés, Shinzo Abe. \nSe trata del primer encuentro oficial entre ambos después de una entrevista bilateral en junio de 2013 en Irlanda del Norte durante un G8. \nDespués, el caso Snowden y en especial la crisis ucraniana impideron un encuentro oficial entre ambos presidentes. \nSin embargo, se entrevistaron con regularidad por teléfono y hablaron por esa vía al margen de acontecimientos como el 70 aniversario del Desembarco aliado en Normandía, el 6 de junio de 2014. \nLee: EU enviará jets F-22 Raptor a Europa por actividad de Rusia en Ucrania \nEste encuentro, previsto para el lunes 28 de septiembre, se llevará a cabo, pues rechazar el diálogo con Moscú sería \"irresponsable\" frente a la situación en Ucrania y Siria, indicó este jueves un responsable estadounidense, quien afirmó que el encuentro fue acordado a petición de la parte rusa. \nEsta reunión ocurrirá luego del discurso del jefe de Estado ruso en la Asamblea general de la ONU. \nVladimir Putin irá a Nueva York para promover su plan para Siria, en especial la construcción de una coalición ampliada que incluya el ejército de Bashar al-Assad, para combatir a ISIS. \nDesde hace más de una semana, el activismo de Rusia en Siria, diplomático, pero en especial, según Estados Unidos, militar, preocupa a los occidentales. \nEstados Unidos considera que Rusia, principal aliado del régimen de Damasco, aumenta su apoyo a Siria entregando nuevas armas al gobierno. Pero en especial, los estadounidenses se preocupan por el despliegue de aviones, tanques y militares rusos en el norte de Siria. \nRusia desmiente cualquier escalada militar, pero admite que apoya al gobierno sirio en su lucha contra los yihadistas de ISIS y que le entrega armas conforme a los contratos existentes. Encuentra este artículo con: rusia, siria, estados unidos, vladimir putin, barack obama, ucrania, onu, asamblea Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"5482b1600b794269a3b5e6c95b2d8d4b\", \"time\": \"2015-09-25T10:17:32.242Z\" } Video ", "external_links": [], "published": "2015-09-25T13:15:00.000+03:00", "crawled": "2015-09-25T13:17:38.266+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}