{"organizations": ["Fox News"], "uuid": "d20d2e5e3a0a92e058dfe073d6074a12f510305a", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/five_greg_091515.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/transcript/2015/09/15/gutfeld-is-trump-right-wing-obama/", "country": "", "title": "Gutfeld: Is Trump the right-wing Obama? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Gutfeld: Is Trump the right-wing Obama? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "d20d2e5e3a0a92e058dfe073d6074a12f510305a"}, "author": "", "url": "http://www.foxnews.com/transcript/2015/09/15/gutfeld-is-trump-right-wing-obama/", "ord_in_thread": 0, "title": "Gutfeld: Is Trump the right-wing Obama? | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "\nDid you hear Donald Trump gave a speech last night? My unicorn for a montage. \n(BEGIN VIDEO CLIPS) \nDONALD TRUMP, REPUBLICAN PRESIDENTIAL CANDIDATE: Jerry Jones is a great guy. \nThe silent majority is back, and it's not silent. I think we should call it -- maybe we should call it the noisy, the aggressive, the wanting to win, wanting to win majority. \nAnother great guy is Mark Cuban. \nSo the debate, I hear they're all going after me, whatever, whatever. \nWhere is Pastor Jeffress? He's around here someplace. \nI love this guy. \nBy the way, can you see in the back, they have the best view, can you see it's really my hair? \nYou know who's going to take the place of Trump? Arnold. And he's a friend of mine. \nYou are going to be -- if I'm elected president -- so proud of your country again. \n(END VIDEO CLIPS) \nAmazing. \nSo this is the historical first, Republican-style. Forget the first female in Hillary or the first African-American in Obama. No, this historical first is celebrity. Entertainment is the new black. Do this Exercise: Imagine some politician saying what Trump just said. He'd be toast. But Trump has a bubble of immunity. He says, \"I'm an entertainer,\" declaring himself a member of a new identity group that affords a protection. True, it has some drawbacks. It's creepy watching starry-eyed men in the media fawn over him, but who does that remind you of? \n(BEGIN VIDEO CLIPS) \nCHRIS MATTHEWS, MSNBC: The feeling most people get when they hear Barack Obama's speech. My, I felt this thrill going up my leg. I mean, I don't have that too often. \nJEFF ZELENY, THE NEW YORK TIMES: During this first 100 days, what has surprised you the most about this office? Enchanted you the most about certain in this office? Humbled you the most and troubled you the most? \nEVAN THOMAS, NEWSWEEK: In a way Obama is standing above the country, above the world, he's sort of God. \nLEE COWAN, NBC NEWS: From a reporter's point of view, it's almost hard to remain objective because it's infectious. \n(END VIDEO CLIP) \nThat's bad. So maybe Trump is the right-wing Obama, attracting both fanboys, but impervious to gaffes. How did this happen? Why? To quote the late Andrew Breitbart, \"Politics is downstream from culture.\" Meaning, culture influences politics, not the reverse. And Trump may be that culture candidate. He's the guy from TV, not D.C. His impact flows downstream to politics, so it's less a campaign and more a comedic crusade appealing to the bored and fed up. \nFact is, the right has been a part from culture for so long, that maybe it takes a TV star to build that bridge and speak to the America currently held captive by liberal media and entertainment. \nTrump's got problems. He can be crass, repetitious. I wish he would say something deep for once about terrorism. I wish he would read more and riff less. He's a gamble, one that must convince us that he's actually more than just a pretty, red persona. Or not, he could win as is. Well unless, the Dems wise up and run Clooney. Advertisement ", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-17T23:54:30.553+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}