{"organizations": [], "uuid": "6d377659455e2a8f234d26d8d0f9cf76ab2e44dd", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/140102162304-antarctic-ship-rescue-ice---s029738937-t3-entertainment.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/01/politics/obama-icebreakers-alaska-arctic-visit-climate-change/index.html", "country": "US", "title": "Obama wants new Coast Guard icebreakers in the arctic", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama wants new Coast Guard icebreakers in the arctic - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "6d377659455e2a8f234d26d8d0f9cf76ab2e44dd"}, "author": "Kristen Holmes", "url": "http://www.cnn.com/2015/09/01/politics/obama-icebreakers-alaska-arctic-visit-climate-change/index.html", "ord_in_thread": 0, "title": "Obama wants new Coast Guard icebreakers in the arctic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights U.S. Coast Guard has only two active icebreakers in its fleet Russia has 40 icebreakers with almost a dozen more planned (CNN) President Barack Obama on Tuesday will propose speeding up the timeline for purchasing and constructing new Coast Guard icebreakers in the Arctic, an area where the United States has fallen behind Russia in resources as the melting sea ice creates more opportunities for global commerce, tourism and scientific research.\nThe United States, which once had seven icebreakers in its fleet, now has only two that are fully functional. This is compared to Russia, which has 40 icebreakers with 11 planned or under construction, according to a statement released by the White House. The President will call on Congress to approve funding for replacing a new heavy icebreaker by 2020, instead of 2022.\nPolar icebreakers are ships specifically designed to cut through open water ice and are in high demand as industries push closer to exploration of either of the earth's poles, according to the Coast Guard .\nThe U.S. Coast Guard Cutter Healy, a 420-foot-long icebreaker homeported in Seattle, breaks ice in support of scientific research in the Arctic Ocean in 2006. Obama will hike to Exit Glacier and tour Kenai Fjords National Park by boat Tuesday, the second day of his three-day trip to Alaska largely focused on climate change.\nThe President will also announce a joint effort by the National Oceanic and Atmospheric Administration and the Coast Guard to increase safety in marine transportation in the region by mapping the recently opened Bering, Chukcki and Beaufort Seas.\nRELATED: Obama condemns climate change deniers\nMonday in Anchorage, the President opened the State Department sponsored GLACIER conference, challenging other world leaders as well as climate change deniers. Obama called on other nations to act quickly on climate change or \"condemn our children to a world they no longer have the capacity to repair.\"\nThe President went on to say \"the time to heed the critics and cynics is past. The time to plead ignorance is surely past. Those who want to ignore the science are increasingly alone, on their own shrinking island.\"\nBefore Obama embarked to Alaska, the administration announced the renaming of the highest peak in North America, Mount McKinley, to Denali, the name used by generations of Alaska Natives meaning \"the great one.\" The President, who has faced backlash on this decision, posted a photo of Denali on his Instagram before arriving in Anchorage on Monday.\nRELATED: Trump vows to reverse Obama's Mt. McKinley name change\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150901090956-uscgc-healy-super-169.jpg", "http://www.uscg.mil/acquisition/icebreaker/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150901090956-uscgc-healy-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150901090956-uscgc-healy-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150901090956-uscgc-healy-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150901090956-uscgc-healy-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150901090956-uscgc-healy-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150901090956-uscgc-healy-full-169.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-01T18:39:34.657+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}