{"organizations": ["Obama Fights To Expand Free Community College Programs Obama Fights To Expand Free Community College Programs"], "uuid": "cfc22bb07e54208e6caefa54f3573af1fa233878", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f09dd32c00003600aaf55c.jpeg?cache=DIbIluH0Ya", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-free-community-college_55f09c6fe4b002d5c077e7e2", "country": "", "title": "Obama Fights To Expand Free Community College Programs", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Fights To Expand Free Community College Programs", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T01:03:00.000+03:00", "replies_count": 0, "uuid": "cfc22bb07e54208e6caefa54f3573af1fa233878"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-free-community-college_55f09c6fe4b002d5c077e7e2", "ord_in_thread": 0, "title": "Obama Fights To Expand Free Community College Programs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Christina Wilkie", "Huffington"], "text": "Obama Fights To Expand Free Community College Programs The president also pledges $175 million for apprenticeship training. Christina Wilkie National Reporter, The Huffington Post Posted: 09/09/2015 05:54 PM EDT \nWASHINGTON -- President Barack Obama on Wednesday announced a series of new steps by his administration to help make community college affordable for most Americans. \nSpeaking at Macomb Community College in Warren, Michigan, Obama unveiled a new national advisory board and a wide-reaching advocacy campaign, both aimed at building support for America's College Promise, the higher education plan he first publicized in January. It calls for spending $60 billion over 10 years to provide participating students with two years of free community college. \nIn order to qualify for the tuition waiver, students would have to be enrolled at least half-time in accredited programs, and maintain their academic progress. \n\"Community colleges are at the heart of the American dream,\" Obama told an enthusiastic crowd of students and faculty. \"And for every young person willing to work hard, I want two years of community college to be as free and universal as high school is today.\" \nOffering free community college, he said, \"is a concrete way to reduce the cost of education for young people, to improve the skills of workers so they get higher paying jobs, and to grow our economy.\" \nThe president attended the event with Jill Biden, a community college professor and the wife of Vice President Joe Biden. Earlier in the day, the White House announced that she will chair the administration's new College Promise Advisory Board with Jim Geringer, a former Republican governor of Wyoming. \n\"Our task is to bring together leaders from across the country to highlight student success stories like we've seen in Tennessee, Chicago and Michigan,\" Biden told the crowd, \"to share best practices and to encourage others to join our efforts.\" \nIn addition to the community college initiatives, Obama also announced $175 million in federal grant money to expand apprenticeship programs, where students \"earn while you learn\" in job settings instead of traditional classrooms. The American Apprenticeship Grants will help train and place some 34,000 new apprentices at U.S. companies, a White House fact sheet stated. \n\"The average starting salary for a person who's finished an apprenticeship is now more than $50,000,\" said the president.\"We want to give workers across America the same chance you have [at Macomb] to get real-world experience that leads directly to a good job.\" \nObama's free community college proposal was one of the highlights of the domestic policy agenda he unveiled during his State of the Union address in January. But it was quickly met with stiff opposition from Republicans in Congress, who balked at both the price tag and at the notion of creating a new federal education program. \nThe concept has had more success outside of Washington, and 11 states are currently considering legislative proposals to offer free community college. In Tennessee, state lottery funds are used to fund Tennessee Promise, a program that covers community college tuition and fees for students who maintain a minimum 2.0 GPA. \n\"There's a movement going on here; it's an idea whose time has come,\" Obama said. \"Free community college for responsible students. It's an idea that makes sense.\" ", "external_links": [], "published": "2015-09-10T01:03:00.000+03:00", "crawled": "2015-09-10T01:03:35.664+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}