{"organizations": [], "uuid": "6b227d27b7608b47fd843c7d1d7dd27dfa45db1d", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Castro%20obama%20Latino.jpg", "site_section": "http://feeds.feedburner.com/foxnews/latest", "section_title": "FOXNews.com", "url": "http://latino.foxnews.com/latino/politics/2015/09/29/day-after-raul-castro-blasts-us-imperialism-cuba-president-meets-with-obama/", "country": "EU", "title": "Day after blasting U.S. 'imperialism,' Raul Castro meets with a smiling Obama Latino", "performance_score": 3, "site": "foxnews.com", "participants_count": 4, "title_full": "Day after blasting U.S. 'imperialism,' Raul Castro meets with a smiling Obama | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 3, "uuid": "7f92752707e8a78c9f7840cbd136becb85e1a0f6"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2015/09/29/day-after-raul-castro-blasts-us-imperialism-cuba-president-meets-with-obama/#post-0", "ord_in_thread": 0, "title": "Day after blasting U.S. 'imperialism,' Raul Castro meets with a smiling Obama Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 29, 2015 Fox News Latino President Barack Obama and Cuban President Raul Castro stand together in front of members of the media before a bilateral meeting, Tuesday, Sept. 29, 2015, at the United Nations headquarters. (AP Photo/Andrew Harnik) \nPresident Barack Obama held a bilateral talk with Cuban President Raul Castro on Tuesday, the second time they’ve met this year.\nIt came less than 24 hours after Castro delivered a blistering thinly veiled attack on the United States, condemning imperialism, and the U.S. control of the Guantanamo naval base, among other things.\nThe talk, which was not open to the media, is believed to have dealt with the lifting of the U.S.-Cuba embargo, which only the U.S. Congress can make happen, as well as other conditions that Castro laid out in his Monday speech.\nCastro has said that in order for diplomatic relations to be truly and fully restored between the decades-long adversaries, the naval base must be returned to Cuba, technological programs the U.S. uses to emit messages to the people of the island must stop, and the U.S. must compensate Cuba for damages suffered as a result of the embargo.\nObama, who in December announced that that U.S. trade and travel restrictions would be dramatically eased, has been pushing for the embargo to end.\nThe Tuesday meeting took place on the sidelines of the annual gathering of world leaders at the United Nations. Obama and Castro smiled and shook hands before beginning their private talks.\nSince the two leaders made their surprise announcement about restoring relations last December, the two countries have reopened embassies in each other's capitals. But sharp differences remain, particularly over Cuba's human rights record and detainment of political prisoners. Both sides want Congress to lift a longstanding economic embargo against the communist island nation, but many Republican lawmakers and some Democrats want to keep it in place.\nCuba also seeks the return of land occupied by the U.S. Navy base at Guantanamo Bay; the U.S. says that is not in the plan.\nIn his address Monday at the opening of the U.N. General Assembly's annual ministerial meeting, Obama discussed the shift in policy toward Cuba and said he was confident that Congress \"will inevitably lift an embargo that should not be in place anymore.\"\nBen Rhodes, a deputy national security adviser for Obama, said Castro's presence at the U.N. gathering is a signal \"that we're in a new era.\"\nObama and Castro first spoke in December after the secret process to restore diplomatic relations was revealed.\nThey met in person in April while attending a regional summit in Panama. Before then, the last time a U.S. and Cuban leader had convened a substantive meeting was in 1958.\nObama and Castro spoke by telephone again earlier this month before Pope Francis visited Cuba and the United States.\nFrancis was a go-between for the U.S. and Cuba during their secret talks.\nThe Associated Press contributed to this report. \nFollow us on twitter.com/foxnewslatino \nLike us at facebook.com/foxnewslatino", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T00:57:09.948+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}