{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "d6c75d55b1153ceb668093aa8225ac1b6d558551", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/09/02/real-truth-about-obama-and-iran-deal/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1441214641406.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/09/02/real-truth-about-obama-and-iran-deal.html", "country": "", "title": "The real truth about Obama and the Iran deal | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The real truth about Obama and the Iran deal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T22:28:00.000+03:00", "replies_count": 0, "uuid": "d6c75d55b1153ceb668093aa8225ac1b6d558551"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/09/02/real-truth-about-obama-and-iran-deal.html", "ord_in_thread": 0, "title": "The real truth about Obama and the Iran deal | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print (The Associated Press) \nOn Tuesday, two Democratic senators, Chris Coons of Delaware and Bob Casey of Pennsylvania, announced that they would vote in favor of President Obama’s nuclear deal with Iran. Wednesday Maryland Senator Barbara Mikulski added her support. \nThese announcements are being greeted with excitement by the White House and its supporters. The president now has enough votes from Senate Democrats to make his accord bulletproof in Congress. \nAfter the president’s long, charged battle against his Republican critics, a handful of Democratic dissidents, the American Jewish establishment and the government (and parliamentary opposition) of Israel, Obama -- barring some last minute shocker—is going to get what he has been seeking. \nBut it is not necessarily what he (and his party’s supporters) have bargained for. \nObama's Iran policy is not a mere difference of opinion with a certain Israeli government. It upends American policy in the region by ushering a genocidal, anti-Jewish regime into the family of respectable nations. \nDespite what the president may believe, Prime Minister Benjamin Netanyahu did not vehemently and vocally oppose this deal because he is a closet Republican, a glory seeker, a right-wing warmonger or simply a meanie. Netanyahu is truly and deeply convinced that this deal endangers Israeli national security. His concern doesn’t end with the signing of a bill in Washington. \nThe Israeli PM has expressed his concerns ad nauseam (as far as Obama is concerned). He points out that the Iranian regime is explicitly pledged to destroy Israel. It supports Shi’ite Muslim terrorism around the world, including against Jewish civilian targets. The ayatollahs have their armed a proxy army, Hezbollah, with tens of thousands of missiles aimed at Israeli cities. \nObama himself doesn’t deny any of this. He just doesn’t want it to spoil his diplomatic coup. What the hell, he’ll be gone in two years. \nMost Democratic lawmakers do not plan to retire along with Obama in 2016. They will have to live with the consequences of their support, and they know it. \nIn announcing his decision, Senator Casey underscored his “deep reservations” about Iran honoring the agreement. Almost all the Democratic ‘yes’ voters voice similar misgivings. Perhaps they regard these caveats as an insurance policy for the day when Middle East realities overtake the fantasy of Obama’s diplomacy and all hell breaks loose. \nIf that happens, the excuse, “ Hey, I said at the time that this was a bad idea ” isn’t going to work. Unlike the invasion of Iraq, or almost any major American foreign policy initiative since World War II, there is no bipartisan support for the administration. The Republicans are voting no. The Democratic Party’s public standing on foreign policy now rests in the hands of the Ayatollahs of Iran. \nObama doesn’t have to worry about reelection, but he has his historical reputation (not to mention his future opportunities) to consider. \nThis week Obama is trying to repair the breach with American Jews who, despite the administration’s spin, are not happy with the president. To calm things down, the president granted an interview to the editor of The Forward, a friendly Jewish weekly. “It’s not that I’ve received votes from the Jewish community,” he told the interviewer. “It’s that I have received ideas, values and support that helped shape me into the person I am.” \nPerhaps to illustrate his close ties to the community, he fondly recollected student days at Columbia when he would trek to an Upper West Side bakery for a poppy seed bagel with a schmear of cream cheese and maybe a piece of lox on the side. \nThe president said that he is hurt by some Jews (those with the wrong ideas and values, presumably) who are now calling him an anti-Semite. “There’s not a smidgen of evidence for it other than the fact that there have been times when I have disagreed with a particular Israeli government’s position on a particular issue,” the president asserted. \nPersonally, I don’t think Barack Obama hates Jews. I think he admires the wrong ones (and is admired by them in return, especially those who work for him). But his Iran policy not a mere difference of opinion with a certain Israeli government. It upends American policy in the region by ushering a genocidal, anti-Jewish regime into the family of respectable nations. \nObama’s legalistic defense (“not a smidgen of evidence”) is actually self-incriminating. It points to the fact that, whatever his intentions and personal feelings, he is the first American president in history whose behavior in office has obliged him to declare publicly: “I am not an anti-Semite.” \nCongress votes on the Iran deal this month. It is an accord Israel will not accept, Iran will not honor and the United States—at least under this administration—will not enforce. \nSigning it is not the end of anything. It is the first day of what comes next. ", "external_links": [], "published": "2015-09-02T22:28:00.000+03:00", "crawled": "2015-09-02T22:28:42.501+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}