{"organizations": [], "uuid": "d91eeeae0f255239d40031ecc95a41593f2f34d3", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/09/25/obama-us-will-candidly-discuss-differences-with-china/", "country": "US", "title": "Obama: US will 'candidly' discuss differences with China", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama: US will 'candidly' discuss differences with China | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "d91eeeae0f255239d40031ecc95a41593f2f34d3"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/09/25/obama-us-will-candidly-discuss-differences-with-china/", "ord_in_thread": 0, "title": "Obama: US will 'candidly' discuss differences with China", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print Against the backdrop of grand pageantry, President Barack Obama prodded Chinese President Xi Jinping Friday to \"candidly\" address deep differences on cyberespionage, China's territorial disputes, and human rights -- issues that have threatened ties between the world's two largest economies. \n\"The United States will always speak out on behalf of fundamental truths,\" Obama said as he welcomed Xi to the White House for a state visit. \"We believe that nations are more successful and the world makes more progress when our companies compete on a level playing field, when disputes are resolved peacefully, and when the universal human rights of all people are upheld.\" \nXi, speaking through a translator, called on the U.S. and China to be \"broadminded about differences and disagreements.\" He made no specific mention of the issues Obama raised. \nThe White House's concerns over China's cyberattacks in the U.S. have caused particular strain ahead of Xi's visit. Obama has faced calls from some Republican presidential candidates to scale back the grandeur of Xi's visit, which includes an Oval Office meeting, a joint news conference in the Rose Garden and a glitzy black-tie dinner. \nBoth countries were seeking to emphasize areas where they do agree, most notably on climate change. On the eve of the state visit, U.S. officials said the leaders would release a joint statement on climate change fleshing out how they plan to achieve targets for cutting carbon emissions set at a bilateral summit in Beijing last year. \nXi also planned to announce a blueprint for a nationwide cap-and-trade system beginning in 2017, one that would cover highly-polluting sectors ranging from power generation to papermaking. \nChina will also offer a \"very substantial financial commitment\" to help poor nations transition to low-pollution technologies, the U.S. officials said, without releasing the exact figure. \nClimate change is one of the few areas where bilateral cooperation has proceeded smoothly in recent months, largely because Beijing has struggled to contain heavy air, water and soil pollution that has destroyed farmland, sent cancer rates soaring and left its cities cloaked in dense smog. \nThe progress on China has been offset by disputes over cyberespionage and territorial claims that have spooked U.S. partners in the region. \n\"The assumptions that many people had, that cooperation on transnational threats like climate change would ameliorate problems in geopolitical arenas, were wrong,\" said Michael Green, White House Asian Affairs director under President George W. Bush and current senior vice president at the Center for Strategic and International Studies. \nU.S. officials have hoped for broader cooperation between Obama and Xi since the pair's unusually informal 2013 summit at the Sunnylands estate in southern California. Last year, Obama traveled to Beijing, and the two leaders strolled in the sprawling gardens next to the Forbidden City and met over a lengthy private dinner where details of the climate change agreement were finalized. \n\"I think what's been distinct about their relationship, starting at Sunnylands, is far and away the most constructive engagements they've had have been in their private dinners,\" said Ben Rhodes, Obama's deputy national security adviser. \nIn recent weeks, however, U.S. officials have been taking a tougher line publicly against China's hacking, saying it is reaching epidemic levels. Officials have warned of retaliatory sanctions on businesses and individuals. \n\"This is not just a matter of us being mildly upset, but is something that will put significant strains on a bilateral relationship if not resolved, and that we are prepared to take some countervailing actions,\" Obama said this month. \nObama administration officials say China is getting the message. After National Security Adviser Susan Rice sharply warned Beijing about its actions during a visit to lay the groundwork for Xi's trip, China dispatched its top domestic security official to Washington to try to stave off sanctions ahead of the president's arrival. \nChina has denied being behind cyberspying in the U.S. and says that it, too, is a victim of such espionage. \nLu Kong, a spokesman for the Chinese delegation, said progress on high-level cyber dialogue is contingent on \"mutual benefit, mutual respect and equality.\" \n\"Without that, I don't think there will be any cooperation,\" Lu said. \nObama and Xi are also expected to discuss China's disputed territorial claims, which have unnerved some U.S. partners in Asia. The U.S. is particularly concerned about China's building of artificial islands with military facilities in the South China Sea. \nForeshadowing Obama's message to Xi on the matter, Rice said this week that, \"The United States of America will sail, fly, and operate anywhere that international law permits.\"", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-25T18:31:43.494+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}