{"organizations": ["Fox News Latino FILE", "AP"], "uuid": "8b7e75c1c304c32f8b4b9a94389b53e9c136023c", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Trump%20Bush%20Ad.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/01/in-video-trump-attacks-bush-immigration-stance-forget-love-it-time-to-get-tough/", "country": "", "title": "In video, Trump attacks Bush's immigration stance: 'Forget love. It's time to get tough' | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "In video, Trump attacks Bush's immigration stance: 'Forget love. It's time to get tough' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T16:30:00.000+03:00", "replies_count": 0, "uuid": "8b7e75c1c304c32f8b4b9a94389b53e9c136023c"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/01/in-video-trump-attacks-bush-immigration-stance-forget-love-it-time-to-get-tough/", "ord_in_thread": 0, "title": "In video, Trump attacks Bush's immigration stance: 'Forget love. It's time to get tough' | Fox News Latino", "locations": ["Cleveland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush", "Donald Trump", "Bush", "Harnik"], "text": "In video, Trump attacks Bush's immigration stance: 'Forget love. It's time to get tough' Published September 01, 2015 Fox News Latino FILE - In this Aug. 6, 2015, file photo, Republican presidential candidates Donald Trump and Jeb Bush participate in the first Republican presidential debate at the Quicken Loans Arena in Cleveland. Trump is going after Bush with a new campaign video about immigration. In the video, Bush is shown saying in a 2014 interview that illegal immigration is \"not a felony\" but rather an \"act of love.\" The video has images of three men who were in the country illegally and have been charged or convicted in killings. (AP Photo/Andrew Harnik, File) \nDES MOINES, Iowa (AP) – Donald Trump is going after Republican presidential rival Jeb Bush with a new campaign video about immigration. \nIn the video, Bush is shown saying in a 2014 interview that illegal immigration is \"not a felony\" but rather an \"act of love.\" The video has pictures of three men who were in the country illegally and have been charged or convicted in killings. \nThe Trump campaign's short video, posted on Instagram, concludes with block letters on a black screen saying: \"Forget love. It's time to get tough.\" \nIn 2014, Bush said illegal immigration is a crime for which people should pay a price. But he said no one should be surprised that people cross the border to seek a better life for families they love. \nTrump has made a strict stand on immigration the cornerstone of his insurgent campaign, while Bush has said repeatedly that a path to permanent legal status for immigrants in the country illegally could ignite the slow-recovering economy. \nThe Bush campaign responded to the latest slap from Trump by calling attention to the billionaire's past political donations to Senate Democratic leader Harry Reid, New York Sen. Charles Schumer and former Secretary of State Hillary Rodham Clinton, now the leading candidate for the Democratic presidential nomination. \n\"While Donald Trump was still supporting liberal, soft-on-crime politicians, Jeb Bush accumulated an eight-year record of cracking down on violent criminals as governor of Florida,\" Bush campaign spokeswoman Kristy Campbell said in a statement. \nLike us on Facebook ", "external_links": [], "published": "2015-09-01T16:30:00.000+03:00", "crawled": "2015-09-01T16:30:28.272+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}