{"organizations": [], "uuid": "8909c2a03740b9efab020d13851fcbfc310d367d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e5fde21700009a0156931d.jpeg?cache=1F8xWQtZQH", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/majority-of-republicans-believe-obama-is-a-muslim_55e5fcade4b0aec9f354cefe", "country": "", "title": "A Majority Of Republicans Believe Obama Is A Muslim", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "A Majority Of Republicans Believe Obama Is A Muslim", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T00:45:00.000+03:00", "replies_count": 0, "uuid": "8909c2a03740b9efab020d13851fcbfc310d367d"}, "author": "", "url": "http://www.huffingtonpost.com/entry/majority-of-republicans-believe-obama-is-a-muslim_55e5fcade4b0aec9f354cefe", "ord_in_thread": 0, "title": "A Majority Of Republicans Believe Obama Is A Muslim", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "A Majority Of Republicans Believe Obama Is A Muslim Forty-four percent also say that he wasn't born in the U.S. Janie Velencia Associate Polling Editor, The Huffington Post Posted: 09/01/2015 05:22 PM EDT \nWell into his second term as president, over half of Republicans remain convinced that president Barack Obama is a Muslim, according to a poll released Tuesday by Democratic firm Public Policy Polling. \nThe poll finds that 54 percent of Republicans think Obama is a Muslim, 14 percent think he's a Christian and 32 percent say they are unsure. \nObama's country of birth also remains a question for Republicans. A plurality, 44 percent, say they don't think he was born in the U.S. Only a third believe that he is American-born, and slightly less than another third are unsure where he was born. \nBeliefs that Obama is a foreign-born Muslim are even stronger among Trump supporters. Sixty-six percent of Trump supporters surveyed think Obama is a Muslim; another 61 percent think he was not born in the U.S. \nConspiracy theories about Obama's faith, as well as his birth, have existed among Republicans since the start of his 2008 campaign and have persisted throughout his presidency. In 2010, a Pew Research report found that 31 percent of Republicans believed Obama was a Muslim. Most recently, Republican presidential hopeful Wisconsin Gov Scott Walker told The Washington Post that he didn't know if Obama was a Christian. \nObama has responded to criticism about his religion by asserting that he is in fact a Christian, but has made note that even if he practiced a different religion, that should not be treated as if it were a bad thing. \nQuestions about Obama's birth reached a peak in 2011 when Donald Trump became one of the more famous Republican figures to accuse Obama of not having been born in the U.S. Obama eventually released a copy of his birth certificate that proved he was born in Hawaii. \nChris Cillizza of The Washington Post notes the survey results could be overstated, and its question may have served as an excuse for some Republicans to vent their dislike of Obama by agreeing with a statement they see as negative, regardless of whether they truly believe he's a Muslim. \nPublic Policy Polling surveyed 572 likely Republican primary voters nationwide, reaching respondents through automated telephone interviews and online Aug. 28-30. ", "external_links": [], "published": "2015-09-02T00:45:00.000+03:00", "crawled": "2015-09-02T00:45:16.114+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}