{"organizations": ["Mets", "Fox News Latino Cespedes"], "uuid": "0e51a6c847bff24b9904faecf7c3428eb651a3cc", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/video/0/0/694940094001_4398118439001_Huntington-Park-meeting.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/31/provocative-city-appointments-turn-california-city-into-immigration-flashpoint/", "country": "", "title": "Provocative city appointments turn California city into immigration flashpoint | Fox News Latino", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Provocative city appointments turn California city into immigration flashpoint | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "0e51a6c847bff24b9904faecf7c3428eb651a3cc"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/31/provocative-city-appointments-turn-california-city-into-immigration-flashpoint/", "ord_in_thread": 0, "title": "Provocative city appointments turn California city into immigration flashpoint | Fox News Latino", "locations": ["California"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cespedes helps Mets take NL East lead \nAfter he was elected to the city council in Huntington Park, a small Southern California city, Jhonny Pineda wanted to extend a welcoming gesture to the city’s growing population of undocumented immigrants. \nSo he decided to use his appointment power to tap two constituents who were in the country illegally to city advisory boards. He appointed Francisco Medina to the city’s health and education commission, and Julian Zatarain to the parks and recreation commission. \n“I promised to create opportunities for all residents during my campaign,” Pineda, 32, who was elected in March and is Huntington Park's newest city council member, told Fox News Latino. \n“There are many young people that are college graduates and wish to implement their skills in a job, but unfortunately they cannot” because of their immigration status, Pineda said. \n“I think they should be given a chance,” he added. \nAt a time when the issue of immigration has become so divisive, his move drew immediate reactions from across the country. \nWhile some say the measure – a first for California – will foster involvement in a predominantly Latino immigrant community, others believe Huntington Park is attracting negative media attention and sending the wrong message to people in the country legally. \nSuddenly, this quiet city in South East Los Angeles has been thrust into the immigration spotlight and has become a focal point in the politically volatile debate. \n“How can we be a great nation when we reward people that come to this nation illegally? There’s a difference between a legal immigrant and an illegal immigrant.” Huntington Park resident Francisco Rivera said during a recent council meeting. “Not every immigrant that is here, is here illegally and that’s the difference. There’s a right way to do things and a wrong way… It’s not fair for guys like me.” \nThe Golden State already allows undocumented immigrants to obtain driver's licenses and to practice law. This summer, the state Senate passed a bill allowing undocumented immigrants to access health care. \nHuntington Park, billed as “the city of perfect balance” has a population that’s more than 97 percent Latino, and is one of several communities southeast of Los Angeles that serve as entry points for immigrants from Mexico and Latin America, many of them undocumented. \nFor some of its officials, including Mayor Karina Macias, there is nothing wrong with a local government that reflects its community. \n\"Our population includes documented and undocumented immigrants, and I wanted to make sure everyone could participate,\" Macias told the Los Angeles Times recently . \"If we're going to talk about transparency, being open and having a community that's involved, then the conversation also has to include undocumented immigrants. I'm hoping other cities are looking at what we're doing here.\" \nAll members of the council, aside from Councilmember Valentin Amezquita, approved the appointments during an Aug. 3 council meeting, with very little opposition from the public. \nBut a couple of weeks later, during the city’s next council meeting, dozens flooded the council chamber to voice their concern over the appointments. \nActivists from organizations that oppose illegal immigration, including Claremont, California-based We the People Rising, showed up with signs that read: “Get Back in Line – Come in Legally!” and “All Lives Matter.” \nMedina and Zatarain, who will be sworn in to their post in early September, did not return calls from Fox News Latino seeking comment. \nMedina, 29, graduated from Cal State Dominguez Hills University and now works with working-class immigrants. He organized campaign events during Los Angeles City Councilman Gil Cedillo’s 2013 election and recently interned for a state legislator. \nZatarain, 21, who arrived from Sinaloa in 2007 when he was 13, is a Santa Monica College student who graduated at the top of his class at Huntington Park High School and dreams of attending law school. \nPineda said they both have a long history of volunteering for the city and that they will not be paid the monthly stipend of $75 that commissioners receive for their services. They will only serve in an advisory role, and will not be permitted to vote on city policy. \nMedina and Zatarain will also have to pass background checks before they are sworn into their posts. \nNumerous phone calls and e-mails sent to Councilman Amezquita to inquire about the reason behind his opposition to the appointments were not returned. \n“It is absolutely wrong,” said Maria Espinoza, who heads a group against illegal immigration. “Illegals do not have any right to serve on these commissions; those are civic positions and are reserved for citizens.” \nEspinoza, who has been part of a movement in Texas pushing for stronger immigration enforcement and heads an organization there, added that the fact that neither Medina nor Zatarain will be paid for their work as commissioners does not make the appointments alright. \n“They should go volunteer in their country,” said Espinoza. “There are plenty of things that need to be corrected in Mexico,” she added. \nBut Councilman Pineda disagrees. \n“Everyone has the right to volunteer,” he said, adding that it “does not necessarily hurt the community because this was a decision where a law was not broken.” \nPineda insists that opposition to the appointment is coming from outside of Huntington Park. \n“Most of the people that I have spoken to in the city agree [with me] because these young men have not been given a job,” he said. “What they will do is donate their time.” \nLike us on Facebook Follow us on Twitter & Instagram \nMarcia Facundo is a freelance journalist who currently reports from Los Angeles, California. She has worked for El Nuevo Herald and as Hispanic Affairs Correspondent for the BBC World Service. \nLike us on Facebook ", "external_links": [], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-09-01T11:39:04.912+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}