{"organizations": [], "uuid": "2da35ff95667eb8cb9f7047509ed7e51158a83be", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150922105927-trump-on-colbert-show-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_latest.rss\r", "section_title": "Latest financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/09/22/media/donald-trump-stephen-colbert-late-show/index.html?section=money_latest", "country": "US", "title": "Trump ducks Colbert's question, was Obama born in the USA?", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Trump ducks Colbert's question, was Obama born in the USA?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:06:00.000+03:00", "replies_count": 0, "uuid": "2da35ff95667eb8cb9f7047509ed7e51158a83be"}, "author": "", "url": "http://money.cnn.com/2015/09/22/media/donald-trump-stephen-colbert-late-show/index.html?section=money_latest", "ord_in_thread": 0, "title": "Trump ducks Colbert's question, was Obama born in the USA?", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Stephen Colbert", "Donald Trump", "Colbert", "Obama", "Frank Pallotta"], "text": "Donald Trump faces big 'Late Show' test with Stephen Colbert By Frank Pallotta @frankpallotta Stephen Colbert joins the late night primary After weeks of lampooning Donald Trump , Stephen Colbert finally comes face to face with his favorite \"Late Show\" target. \nThe brash presidential candidate will be Colbert'sheadlineron Tuesday's \"Late Show.\" \nTrump, the GOP front runner, has done many late night appearances before, but has never sat down with Colbert. \nFor Trump, Tuesday could be a big test since Colbert isn't known to pull punches with his guests, especially those in the political realm. \nRelated: Ted Cruz and Stephen Colbert debate Reagan, gay marriage \nAt one point, Colbert challenged Cruz's claim that Reagan signed \"the largest tax cut in history\" by saying \"when conditions changed in the country, he [Reagan] reversed his world's largest tax cut and raised taxes when revenues did not match the expectations.\" \nColbert has been skewering Trump since June when the host released a web video lampooning the business mogul's presidential announcement. \n\"Donald Trump has announced that he is running for president... This will be the finest most luxurious gold plated diamond-encrusted campaign that will give hope to a weary nation,\" Colbert said in a Trump-like voice. \"Until together we reach that fine fall day when the new season of 'Celebrity Apprentice' premieres.\" Donald Trump will guest on Stephen Colbert's \"Late Show\" on Tuesday night. \nRelated: Michelle Obama to appear on 'Late Show' with Colbert \nThe Trump bashing has been a frequent facet of Colbert's \"Late Show.\" One of the highlights of Colbert's debut earlier this month was a bit in which Colbert gorged on Oreos while also gorging on Trump news coverage. \nColbert has won praise from critics and viewers for how he's interviewed political figures like Cruz, Bernie Sanders and Jeb Bush. \nOne of Colbert's most memorable moments in his early tenure was an emotional interview with Vice President Joe Biden after the death of Biden's son. \nThe \"Late Show\" appearance for Trump comes a little more than a week after he visited Colbert's late night rival Jimmy Fallon and \"The Tonight Show.\" \nTrump's \"Tonight Show\" guest spot was considered to be a \"love-fest\" by some , but gave Fallon a big ratings win over Colbert that night. Colbert looks to return the favor Tuesday against Fallon's guests, Anne Hathaway and Anthony Anderson. \nColbert spent years grilling politicians as a fake pundit on Comedy Central's \"The Colbert Report.\" \nOn Tuesday, Colbert will most likely do the same with Trump, one of the biggest names in politics. However, this time he'll be doing it as himself.", "external_links": [], "published": "2015-09-23T03:06:00.000+03:00", "crawled": "2015-09-23T03:30:24.611+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}