{"organizations": ["Public Religion Research Institute", "Vatican", "Roman Catholic Church", "Catholic Church", "Rainbow Association"], "uuid": "e190df2a6a8624b2518b506d532cf7f76aa030e7", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150812121345-pope-francis-climate-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_topstories.rss", "section_title": "CNN.com - Top Stories", "url": "http://edition.cnn.com/2015/09/01/europe/pope-francis-abortion/index.html?eref=rss_topstories", "country": "US", "title": "What Pope's abortion move means", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "What Pope's abortion move means", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T00:58:00.000+03:00", "replies_count": 0, "uuid": "e190df2a6a8624b2518b506d532cf7f76aa030e7"}, "author": "", "url": "http://edition.cnn.com/2015/09/01/europe/pope-francis-abortion/index.html?eref=rss_topstories", "ord_in_thread": 0, "title": "What Pope's abortion move means", "locations": ["United States", "New York", "America", "Washington", "Rio de Janeiro", "St. Peter's Basilica", "Brazil", "Philadelphia", "Latin America", "Rome", "Buenos Aires", "St. Peter"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jorge Mario Bergoglio", "Francis", "Riva", "James Martin", "Pope Francis", "Don Renzo Zocca", "Pope", "Jesus", "Pope Francis Pope Francis", "Pope Francis The Pope", "Vinicio Riva", "John Gehring", "Benedict", "Benedict XVI", "Francis Francis", "Francis Pope Francis"], "text": "Wind blows the papal skullcap off Pope Francis' head in February 2014. Hide Caption 19 of 34 34 photos: Pope Francis A lamb is placed around Francis' neck in January 2014 as he visits a living nativity scene staged at a church on the outskirts of Rome. Hide Caption 20 of 34 34 photos: Pope Francis Pope Francis meets with Pope Emeritus Benedict XVI in the Vatican in December 2013. Benedict surprised the world by resigning \"because of advanced age.\" It was the first time a pope has stepped down in nearly 600 years. Hide Caption 21 of 34 34 photos: Pope Francis Pope Francis marked his 77th birthday in December 2013 by hosting homeless men to a Mass and a meal at the Vatican. One of the men brought his dog. Hide Caption 22 of 34 34 photos: Pope Francis Pope Francis embraced Vinicio Riva, a disfigured man who suffers from a non-infectious genetic disease, during a public audience at the Vatican in November 2013. Riva then buried his head in the Pope's chest. Hide Caption 23 of 34 34 photos: Pope Francis Pope Francis jokes in November 2013 with members of the Rainbow Association, which uses clown therapy in hospitals, nursing homes and orphanages. Hide Caption 24 of 34 34 photos: Pope Francis A young boy hugs Francis as he delivers a speech in St. Peter's Square in October 2013. The boy, part of a group of children sitting around the stage, played around the Pope as the Pope continued his speech and occasionally patted the boy's head. Hide Caption 25 of 34 34 photos: Pope Francis Francis has eschewed fancy cars. Here, Father Don Renzo Zocca, second from right, offers his white Renault 4L to the Pope during a meeting at the Vatican in September 2013. Hide Caption 26 of 34 34 photos: Pope Francis Francis has his picture taken inside St. Peter's Basilica with youths who came to Rome for a pilgrimage in August 2013. Hide Caption 27 of 34 34 photos: Pope Francis During an impromptu news conference in July 2013, while on a plane from Brazil to Rome, the Pope said about gay priests, \"Who am I to judge?\" Many saw the move as the opening of a more tolerant era in the Catholic Church. Hide Caption 28 of 34 34 photos: Pope Francis Crowds swarm the Pope as he makes his way through World Youth Day in Rio de Janeiro in July 2013. According to the Vatican, 1 million people turned out to see the Pope. Hide Caption 29 of 34 34 photos: Pope Francis Francis frees a dove in May 2013 during his weekly general audience in St. Peter's Square. Hide Caption 30 of 34 34 photos: Pope Francis Francis embraces a young boy with cerebral palsy in March 2013 -- a gesture that many took as a heartwarming token of the Pope's self-stated desire to \"be close to the people.\" Hide Caption 31 of 34 34 photos: Pope Francis The Pope washes the feet of juvenile offenders, including Muslim women, as part of Holy Thursday rituals in March 2013. The act commemorates Jesus' washing of the Apostles' feet during the Last Supper. Hide Caption 32 of 34 34 photos: Pope Francis Francis stands at the reception desk of the Domus Internationalis Paulus VI residence, where he paid the bill for his stay during the conclave that would elect him leader of the world's 1.2 billion Catholics. Hide Caption 33 of 34 34 photos: Pope Francis Francis, formerly known as Argentine Cardinal Jorge Mario Bergoglio, was elected the Roman Catholic Church's 266th Pope in March 2013. The first pontiff from Latin America was also the first to take the name Francis. Hide Caption Story highlights The permission of a bishop is no longer needed to avoid excommunication The policy change applies only in the Catholic Church's mercy year, from December 8 of this year to November 20, 2016 The Pope has not changed church view that abortion is \"a moral evil\" (CNN) Pope Francis shook up the Catholic world -- again -- on Tuesday by announcing that all priests around the world will be authorized to forgive the \"sin of abortion\" during the church's \"Year of Mercy.\" Traditionally, Catholics knowingly involved in the procurement of abortion, condemned as a \"moral evil\" by the church, are automatically excommunicated and may be forgiven only with permission from a bishop. Under the new, temporary policy, Francis will essentially simplify the process and give all priests full authority to absolve Catholics with \"contrite\" hearts about the abortion. In the United States, many priests already have that power, but Vatican officials portrayed Tuesday's announcement as \"a widening of the church's mercy.\" \"What's new is that Pope Francis, at least for the Year of Mercy, is universalizing this permission,\" said the Rev. James Martin, a Jesuit priest and editor-at-large at America magazine in New York. \"Just as notable is his pastoral, compassionate and understanding tone towards women who have had abortions.\" The pontiff's announcement comes just weeks before he is scheduled to visit the United States, where he will land amid a fierce debate over the funding and morality of Planned Parenthood , a health services nonprofit that's one of the nation's largest providers of abortions. Vatican officials say Francis will try to transcend the culture wars when he visits Washington, New York and Philadelphia this month, but his church here remains bitterly divided over the morality of abortion. According to a new poll conducted by the Public Religion Research Institute , 51% of American Catholics believe abortion should be legal in all or most cases, while 45% say it should be illegal in all or most cases. In the hours after Francis' announcement, Catholics on both sides of the debate were seeking to spin the popular pontiff's remarks. The Pope's new policy, which does not change church doctrine, technically applies only to the Year of Mercy, a centuries-old Catholic practice during which believers may receive special indulgences for their sins. \"The tragedy of abortion is experienced by some with a superficial awareness, as if not realizing the extreme harm that such an act entails,\" Francis said in a statement Tuesday. \"Many others, on the other hand, although experiencing this moment as a defeat, believe that they have no other option.\" \"I think in particular of all the women who have resorted to abortion,\" the Pope continued. \"I am well aware of the pressure that has led them to this decision.\" The church's mercy year begins on December 8 and runs through November 20, 2016. Vatican officials say it is possible the pontiff will allow the abortion policy to continue in perpetuity. The move seems to showcase a new phase in Francis' papacy, which began in March of 2013. During the first two years, he changed the church's tone by welcoming people on the margins, including gays and lesbians, divorced Catholics, the elderly, the poor and the sick. This summer, for example, Francis said the church should take special care to embrace divorced Catholics. \"No closed doors!\" he told a crowd gathered for his weekly audience in Rome in August. Encouraging mercy With the new abortion announcement, Francis seems to be signaling a \"third way\" to govern the church. He's not quite changing long-standing church practices, but he's moving beyond rhetoric. In particular, he's encouraging Catholic clergy to be more merciful, and at times more flexible in the enforcement of church rules. This year, when top bishops hold a large meeting on challenges to modern families, the pontiff may seek to take a similar approach to divorced and remarried Catholics. For many years, Francis -- the first Pope from Latin America -- was an archbishop in Buenos Aires, a city with a large population of poor Catholics. In his statement Tuesday, the pontiff said that he has met \"so many women\" who are scarred by the \"agonizing and painful\" decision to have an abortion . \"The forgiveness of God cannot be denied to one who has repented,\" the Pope said. Abortion remains a grave matter 8 photos: The quotable Pope: Some of his more surprising sayings 8 photos: The quotable Pope: Some of his more surprising sayings Hide Caption 8 photos: The quotable Pope: Some of his more surprising sayings Hide Caption 8 photos: The quotable Pope: Some of his more surprising sayings Hide Caption 8 photos: The quotable Pope: Some of his more surprising sayings Hide Caption 8 photos: The quotable Pope: Some of his more surprising sayings Hide Caption 8 photos: The quotable Pope: Some of his more surprising sayings Hide Caption 8 photos: The quotable Pope: Some of his more surprising sayings Hide Caption 8 photos: The quotable Pope: Some of his more surprising sayings Hide Caption 8 of 8 \"It's another signal that the Pope wants a church of encounter that journeys with people,\" said John Gehring, Catholic program director at Faith in Public Life. \"He recognizes the church is anchored in the Gospel when mercy trumps finger-wagging judgment.\" Pope Francis' decree does not change Catholic Church teachings about the gravity of the sin of abortion, which Church law calls a \"moral evil.\"", "external_links": [], "published": "2015-09-02T00:58:00.000+03:00", "crawled": "2015-09-02T01:18:41.602+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}