{"organizations": [], "uuid": "12a5dddb5964f31e152fcd4340a473afd838bd6e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/560aecd31900003000fdeb1a.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/bernie-sanders-michael-froman-drug-prices-poor-countries_560aea3ce4b0dd850309818b", "country": "", "title": "Bernie Sanders Calls Out Obama Team On Global Drug Prices", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Bernie Sanders Calls Out Obama Team On Global Drug Prices", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T00:50:00.000+03:00", "replies_count": 0, "uuid": "12a5dddb5964f31e152fcd4340a473afd838bd6e"}, "author": "", "url": "http://www.huffingtonpost.com/entry/bernie-sanders-michael-froman-drug-prices-poor-countries_560aea3ce4b0dd850309818b", "ord_in_thread": 0, "title": "Bernie Sanders Calls Out Obama Team On Global Drug Prices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bernie Sanders", "Pope Francis", "Zach Carter", "Obama Team", "Huffington", "Obama", "Alex"], "text": "Bernie Sanders Calls Out Obama Team On Global Drug Prices The Democratic presidential hopeful invoked Pope Francis in his appeal. Zach Carter Senior Political Economy Reporter, The Huffington Post Posted: 09/29/2015 05:35 PM EDT | Edited: 7 minutes ago Alex Wong/Getty Images Bernie Sanders wants Obama's administration to ensure drug prices are low in poor countries. \nWASHINGTON -- Democratic presidential hopeful Bernie Sanders on Monday called on the Obama administration to reverse opposition to an international proposal to keep down the price of medications in the world's poorest countries. \n\"Making sure people in poor countries have access to life-saving medicine is our moral responsibility ,\" Sanders wrote in a letter to U.S. Trade Representative Michael Froman. \"I respectfully ask you to reconsider this position.\" In February, poor countries asked the World Trade Organization to exempt them from patents and other intellectual property standards for medicines. Such rules grant companies long-term monopolies, dramatically driving up the cost of treatment by preventing generic drugs from entering the market. \nAIDS and HIV treatment once cost thousands of dollars a year in poor countries before generics were introduced for about $1 a day. The WTO will rule on the plan in mid-October. \nIn public the Obama administration has been mum on the proposal all year, despite pressure from high-profile public health groups including Doctors Without Borders, Oxfam and Knowledge Ecology International. In his letter, Sanders said that his staff had learned that the government does not support the proposal. Sanders, an independent Senator from Vermont, quoted Pope Francis’ concern for the poor in his letter and called the proposed introduction of a more lenient international medicines standard an opportunity to fight global poverty. \nUnder the proposal, any country classified by the United Nations as a \" Least-Developed Country \" would be exempt from granting patents and other monopolies on medication. Unlike prior exemptions, this one would last for as long as the U.N. classifies a country as \"Least-Developed,\" making it easier for poor countries to make longer-term public health plans. The current exemption for LDC countries expires in January. \nThe U.N. Development Programme and the Joint U.N. Programme on HIV/AIDS have both said that the failure to approve the new proposal could jeopardize the public health of huge numbers of people worldwide. \n“Millions of people rely on access to affordable, assured quality generic medicines,” Michel Sidibé, executive director of UNAIDS, said. “WTO members have before them a critical opportunity to help least-developed countries to reach health and sustainable development goals -- failure to support them could put millions of lives at risk.” \nFroman's office declined to offer any details on the administration's thinking when contacted by The Huffington Post. \n“USTR has received Senator Sanders’s letter regarding the World Trade Organization (WTO) TRIPS Agreement, and we will respond to him directly regarding its contents,\" USTR spokesman Andrew Bates said in a written statement provided to HuffPost. \"The United States has agreed to all past extensions of TRIPS Agreement waivers for LDCs, and we are working at the WTO in Geneva with LDC members to find an appropriate solution.” \nMajor pharmaceutical companies, record labels and movie studios have long supported aggressive intellectual property standards as a method of securing higher profits. The Obama administration has supported such policies in a host of international forums, to the chagrin of public health advocates. \nRead the full Sanders letter here . ", "external_links": [], "published": "2015-09-30T00:50:00.000+03:00", "crawled": "2015-09-30T00:50:48.549+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}