{"organizations": [], "uuid": "9c633eb7b356eeb697a1ccb2cd516f97b0e6a218", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3451250/images/o-OBAMA-JINPING-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/jimmy-carter/obama-xi-jinping-china-state-visit_b_8176796.html", "country": "", "title": "Obama and Xi Must Do More Than Agree to Disagree | Jimmy Carter", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama and Xi Must Do More Than Agree to Disagree | Jimmy Carter", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T18:29:00.000+03:00", "replies_count": 0, "uuid": "9c633eb7b356eeb697a1ccb2cd516f97b0e6a218"}, "author": "", "url": "http://www.huffingtonpost.com/jimmy-carter/obama-xi-jinping-china-state-visit_b_8176796.html", "ord_in_thread": 0, "title": "Obama and Xi Must Do More Than Agree to Disagree | Jimmy Carter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jimmy Carter", "Obama"], "text": "reddit \nI have been fascinated with China since my first visit to Qingdao in 1949, just a short time before the Peoples' Republic was founded on October 1, my 25th birthday. \nI was governor of Georgia when President Nixon made his historic visit to China in 1972, and was disappointed when no additional moves were made to establish diplomatic relations between our two countries. I set this as a high priority when I became president, and initiated high-level negotiations with Chinese leaders. These efforts became successful when Vice Premier Deng Xiaoping and I announced on December 15, 1978 that full mutual recognition would take place at the beginning of the next year. He announced three days later that dramatic reforms would take place in his country, and that it would be \"opened up.\" Few people anticipated how these two decisions would so drastically affect the global community. \nSince leaving office, I have made regular visits to China, and have been welcomed by its top political leaders, those in the private sector, and by private citizens in many communities. The Carter Center has been asked by the government to perform important duties, including the implementation and assessment of fully democratic elections in China's 600,000 villages, which has included almost two-thirds of the population. We now concentrate on working to reduce misperceptions held by one nation about the other by convening annual forums on improving relations and finding ways for the U.S. and China to wage peace and sustain development in other countries, especially in Africa. \nDuring my four visits with President Xi Jinping in recent years, he has stressed, like Deng Xiaoping before him, the need for our political leaders to respect each other and to cooperate when possible, in spite of the dramatic differences in our history, culture, and political systems. It has always been clear that in both countries there are potential political leaders who, for their own benefit, have blamed the other country for domestic problems and tried to exacerbate the inherent differences that always exist. \nLike the United States, China is facing many serious domestic challenges. China is struggling to improve the quality of life for the citizens who live further from its East coast, and to shift from a relatively burgeoning economy based on exports to one that is accommodating increasing dependence on domestic consumers. Unlike in the past, its political and economic impact is felt in almost every corner of the globe. \nChina has remained at peace with its neighbors and others for the past 35 years, but its expansion of influence has brought it into contention, especially relative to its southern and eastern seas. \nAlthough many of my successors as president have made negative comments about relations with China during their campaigns, almost all of these have been moderated when they were elected to our nation's top office. I am sure the same situation has existed in China. \nThe first official state visit for President Xi Jinping to the United States will offer him and President Obama a chance to explore how our two great nations can deal with each other peacefully, as equals, and with mutual respect. \nThe Chinese must understand that America would like to see a peaceful, prosperous, and free China and that we do not wish to undermine the rise of China. Similarly, Americans need to understand that China differs from the Soviet Union that we faced in the Cold War. China needs to be encouraged to participate in and defend the international order governed by international laws and norms. \nWhile the current challenges that threaten to derail the U.S.-China relationship are great, I am sure that Deng Xiaoping would agree with me that none of these challenges are more daunting than the ones we worked together to conquer. \nFinding ways toward peace and sustained development at home and abroad are at the core of the missions of both President Obama and President Xi. With many conflicts raging and the global economy still fragile, now is the time for each nation to defend a global order conducive to peace and development. \nThe two presidents must use their meeting later this month to do more than simply agree to disagree on many issues. They can forge a consensus on how to build trust through U.S.-China collaboration that acts to solve our common global challenges. Our joint commitment to take the lead on pressing environmental challenges would set an example that few other nations could not follow. Former U.S. President Jimmy Carter (1977-81) is founder of the nonprofit Carter Center, which works to advance peace and health worldwide. More: ", "external_links": [], "published": "2015-09-22T18:29:00.000+03:00", "crawled": "2015-09-22T18:29:56.062+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}