{"organizations": [], "uuid": "0574e104431ae3be902a2516e065b330c55a4466", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/28/obama-y-putin-inician-su-primer-encuentro-formal-en-dos-anos-divididos-sobre/", "country": "", "title": "Obama y Putin inician su primer encuentro formal en dos años divididos sobre Siria | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama y Putin inician su primer encuentro formal en dos años divididos sobre Siria | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "0574e104431ae3be902a2516e065b330c55a4466"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/28/obama-y-putin-inician-su-primer-encuentro-formal-en-dos-anos-divididos-sobre/", "ord_in_thread": 0, "title": "Obama y Putin inician su primer encuentro formal en dos años divididos sobre Siria | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama y Putin inician su primer encuentro formal en dos años divididos sobre Siria Published September 28, 2015 EFE \nNaciones Unidas – Los presidentes de EE.UU., Barack Obama, y de Rusia, Vladímir Putin, iniciaron hoy su primera reunión formal en más de dos años enfrentados sobre cómo tratar de encontrar una solución al conflicto en Siria. \nLa reunión se está celebrando en una pequeña habitación en la sede de las Naciones Unidas adornada con banderas estadounidenses y rusas. \nObama y Putin se dieron la mano antes de comenzar el encuentro y no respondieron a preguntas sobre Siria de los periodistas presentes. \nLos dos mandatarios hablaron durante la mañana ante la Asamblea General de la ONU y expusieron muy claramente sus diferencias ante la crisis siria, que ya dura más de cuatro años. \nEn su discurso ante la Asamblea, Obama insistió en que el presidente sirio, Bachar Al Asad, debe renunciar para impulsar una \"transición\" que permita resolver el conflicto, mientras que Putin, en su intervención, pidió el apoyo de la comunidad internacional al \"Gobierno legítimo\" de Siria. \nDespués de sus discursos, los dos mandatarios se saludaron brevemente y brindaron en el almuerzo ofrecido por el secretario general de la ONU, Ban Ki-moon, a los jefes de Estado y Gobierno que asisten a la Asamblea General del organismo. \nObama y Putin flanqueaban a Ban en una de las mesas dispuestas para el almuerzo y los fotógrafos captaron el brindis entre ambos, con el presidente estadounidense con rostro serio y el líder del Kremlin sonriendo. \nLa última reunión formal entre Obama y Putin tuvo lugar a mediados de 2013. \nUnos meses después, a comienzos de 2014, comenzó la crisis ucraniana con la anexión rusa de Crimea, un asunto que ambos prevén abordar también su reunión de hoy. \nEn su intervención ante la Asamblea, Obama defendió las sanciones impuestas a Rusia tras la anexión de Crimea porque, según dijo, EE.UU. no puede quedarse callado \"cuando la soberanía y la integridad territorial de una nación se violan flagrantemente\". \nPor su parte, Putin denunció a su turno el uso de \"sanciones unilaterales\" para servir a \"intereses políticos\" y, al mismo tiempo, \"eliminar competidores\" económicos. ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-30T11:55:07.614+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}