{"organizations": ["CNN Washington Bureau", "Senate", "Chicago Tribune", "Institute of Politics", "University of Chicago", "U.S. Senate", "CNN", "Institute of Politics Washington"], "uuid": "a7e0aad8847355fa3bd08636bbf868065acd673e", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/03/politics/david-axelrod-joins-cnn/index.html", "country": "", "title": "Former Obama adviser Axelrod joining CNN - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Former Obama adviser Axelrod joining CNN - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T17:52:00.000+03:00", "replies_count": 0, "uuid": "a7e0aad8847355fa3bd08636bbf868065acd673e"}, "author": "", "url": "http://www.cnn.com/2015/09/03/politics/david-axelrod-joins-cnn/index.html", "ord_in_thread": 0, "title": "Former Obama adviser Axelrod joining CNN - CNNPolitics.com", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Paul Simon", "David", "Axelrod", "John Edwards", "Barack Obama", "Bill Clinton", "Sam Feist", "Patrick", "Harold Washington", "David Axelrod", "Obama"], "text": "Obama almost vetoed 'yes we can' slogan 10:20 Story highlights Former top Obama adviser David Axelrod is joining CNN as a senior political commentator Axelrod, a University of Chicago alum, currently runs the university's Institute of Politics Washington (CNN) David Axelrod, who was instrumental in electing President Barack Obama to the White House twice, will be joining CNN as a senior political commentator starting Friday. \"An all-around respected, well-connected commentator on the American political scene, we are delighted to have David join us and look forward to him sharing his political analysis with our global audience,\" CNN Washington Bureau Chief Sam Feist said in a statement Thursday morning. Axelrod, a University of Chicago alum, currently runs the university's Institute of Politics. He has long been one of Obama's most trusted campaign gurus. He was a senior adviser during Obama's first term, ran both his White House bids and Obama's 2004 U.S. Senate race. Prior to that, Axelrod played a role in other major campaigns, including the Senate and presidential races of Paul Simon, the mayoral campaign of Harold Washington, the gubernatorial campaign of Deval Patrick, Hillary Clinton's campaign for the U.S. Senate in 2000, and the presidential campaigns of Bill Clinton and John Edwards. Axelrod got his start as a reporter with the Chicago Tribune, covering state, local and national politics, before beginning his own political consulting firm. He recounted his life in politics recently in the memoir \"Believer: My Forty Years in Politics.\" Thrilled to join excellent CNN team as senior political commentator.'16 race already fascinating. No better forum to talk about big stories! ", "external_links": [], "published": "2015-09-03T17:52:00.000+03:00", "crawled": "2015-09-03T17:52:54.004+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}