{"organizations": [], "uuid": "007959f75a8510726715964fcb6629dcf87e77bf", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/081815_shep_iranrussia_640.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/politics/2015/08/19/obama-administration-objects-as-russia-reportedly-moves-ahead-with-iran-missile/", "country": "US", "title": "Obama administration objects as Russia moves ahead with Iran missile sale", "performance_score": 3, "site": "foxnews.com", "participants_count": 11, "title_full": "Obama administration objects as Russia moves ahead with Iran missile sale | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 23, "uuid": "ec35f58175edff69c13b0e4324ff4e517ea630f6"}, "author": "Lucas Tomlinson", "url": "http://www.foxnews.com/politics/2015/08/19/obama-administration-objects-as-russia-reportedly-moves-ahead-with-iran-missile/#post-0", "ord_in_thread": 0, "title": "Obama administration objects as Russia moves ahead with Iran missile sale", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Lucas Tomlinson \n  FoxNews.com   livefyre Email Print \nDespite a ban on arms shipments to Iran under international sanctions, Russia appears willing to proceed with the sale of advanced S-300 surface-to-air missiles to the country -- in a development triggering objections from the Obama administration.  \n“We have long expressed our concerns over reports of the possible sale of this missile system to the Iranians,” Pentagon spokesman Capt. Jeff Davis told Fox News.\nRussia, along with the U.S. and others, was a party to the recently struck Iran nuclear agreement, which keeps the arms embargo in place for five more years. A State Department official told Fox News this specific S-300 missile system is not technically prohibited under United Nations sanctions or the nuclear deal. But the department does not want the sale to proceed. \n“We certainly object to it,” department spokesman John Kirby told reporters.\nReuters first reported that Iran plans to sign the contract for four of the S-300 Russian missiles as soon as next week.\n\"The text of the contract is ready and our friends will go to Russia next week to sign the contract,\" Iran Defense Minister Hossein Dehghan reportedly said. \nWhen asked to characterize the capability of Russia’s S-300 air defense system, a U.S. defense official with knowledge of Russia’s weapons systems told Fox News, “This is a very capable weapons system that can bring down U.S. or Israeli jet aircraft.” \nThe Obama administration has made its objections known before. When Russia first announced its plans to proceed with the sale in April, White House Press Secretary Josh Earnest said, “The United States has previously made known our objections to that sale, and I understand that Secretary Kerry had an opportunity to raise these concerns once again in a recent conversation with his Russian counterpart.”\nThe announcement comes at a time when Russia and Iran appear to have grown their diplomatic and military ties in the weeks following the comprehensive nuclear accord struck July 14 in Vienna.\nFox News first reported a clandestine visit by Iran’s shadowy Quds Force commander Maj. Gen. Qassem Soleimani on July 24, just 10 days following the nuclear agreement. Senior military officers and U.S. lawmakers hold Soleimani and his proxy forces responsible for the deaths of hundreds of American soldiers in Iraq.\nThe Quds Force is the special operations wing of Iran’s Revolutionary Guard Corps, responsible for supporting terrorist groups and proxy forces in Lebanon, Yemen and Iraq. Like Russia, it supports the Syrian regime of President Bashar al-Assad. According to local reports, Russia also delivered six MiG 31 fighter jets to Syria on Sunday.\nSoleimani’s visit to Russia involved meetings with Russian President Vladimir Putin and his defense minister and appears to have kicked off a series of other bilateral engagements between Iran and Russia.\nLast week, Russia and Iran held joint naval exercises in the Caspian Sea, which separates the two countries.\nOn Monday, Russian Foreign Minister Sergei Lavrov hosted his Iranian counterpart Foreign Minister Javad Zarif, who was Iran’s point man in the nuclear negotiations.\n“We are confident that the Vienna agreement will have an enormous impact on developing ties between our two countries,” Zarif said at a Moscow presser Monday, according to Radio Free Europe/Radio Liberty.\nA last-minute provision added to the comprehensive nuclear agreement in Vienna prohibits the sale of arms for five more years with Iran.\nPage 7 of the White House fact sheet explaining the comprehensive July 14 nuclear agreement between Iran and six world powers reads:\n“While some of our P5 partners wanted these restrictions lifted immediately, we pushed back and were successful in keeping them for 5 and 8 more years or until the IAEA reaches its broader conclusion.”\nRussia is among the “P5” partners.\nFox News’ Wes Barrett contributed to this report.", "external_links": [], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-19T10:04:15.796+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}