{"organizations": ["Obama Administration Gives Police Departments Millions For Body Cams Email Obama Administration Gives Police Departments Millions For Body Cams Los Angeles"], "uuid": "ddbbb6e7c05db0b51edb10595d5c8651b1698c57", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/scalefit_1200_noupscale/5600218f2000002600242af1.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/police-body-camera-grants_56001b4be4b08820d919532b", "country": "", "title": "Obama Administration Gives Police Departments Millions For Body Cams", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Administration Gives Police Departments Millions For Body Cams", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T19:59:00.000+03:00", "replies_count": 0, "uuid": "ddbbb6e7c05db0b51edb10595d5c8651b1698c57"}, "author": "", "url": "http://www.huffingtonpost.com/entry/police-body-camera-grants_56001b4be4b08820d919532b", "ord_in_thread": 0, "title": "Obama Administration Gives Police Departments Millions For Body Cams", "locations": ["Detroit", "Washington", "Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ryan J. Reilly", "Huffington"], "text": "Email Obama Administration Gives Police Departments Millions For Body Cams Los Angeles, Washington, Chicago and Detroit are some of the biggest departments that will receive funding for cameras. Ryan J. Reilly Justice Reporter, The Huffington Post Posted: 09/21/2015 12:23 PM EDT | Edited: 14 minutes ago \nWASHINGTON -- Seventy-three law enforcement agencies across the country will receive $20 million in federal grants to help them purchase and implement the use of body cameras, the Justice Department's Bureau of Justice Assistance announced Monday. \nThe grants will help the departments to purchase 21,000 body-worn cameras -- fewer than half of the 55,000 cameras that 285 law enforcement agencies have requested. \nSeparately, the DOJ's Office of Community Oriented Policing Services announced it was giving out more than $107 million to help nearly 200 agencies hire or retain 870 officers. Law enforcement agencies that stressed community policing strategies received special attention for more funds, according to the DOJ. \nLarge police departments in Los Angeles, Washington, Miami-Dade County, Chicago, Detroit, and San Antonio received $1 million each to implement body-worn camera programs. \nOther cities and counties that received large grants for body cameras include: Glendale, Arizona; Pasadena, Sacramento and San Bernardino County, California; Colorado Springs, Colorado; Stamford, Connecticut; Orlando, Florida; Wichita, Kansas; New Orleans; Minneapolis and St. Paul, Minnesota; Fayetteville, North Carolina; Albuquerque, New Mexico; Las Vegas; Rochester, New York; Pittsburgh; Charleston, South Carolina; and Seattle. \nThere has been growing public interest in the need for police body cameras since the August 2014 death of 18-year-old Michael Brown in Ferguson, Missouri. The Huffington Post found last month that most major cities still don't provide body cameras for police officers. ", "external_links": [], "published": "2015-09-21T19:59:00.000+03:00", "crawled": "2015-09-21T19:59:23.881+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}