{"organizations": ["Fox News Facebook", "Coast Guard", "Twitter"], "uuid": "20d2914f09c531bdc0c41230d4aa212467e8e542", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/090115_sr_griffin2_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/01/ice-war-cometh-russia-makes-play-for-arctic-obama-seeks-more-navy-icebreakers/", "country": "", "title": "The Ice War Cometh? Russia makes play for Arctic, Obama seeks more Coast Guard icebreakers | Fox News", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "The Ice War Cometh? Russia makes play for Arctic, Obama seeks more Coast Guard icebreakers | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T06:30:00.000+03:00", "replies_count": 0, "uuid": "20d2914f09c531bdc0c41230d4aa212467e8e542"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/01/ice-war-cometh-russia-makes-play-for-arctic-obama-seeks-more-navy-icebreakers/", "ord_in_thread": 0, "title": "The Ice War Cometh? Russia makes play for Arctic, Obama seeks more Coast Guard icebreakers | Fox News", "locations": ["Russia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nWhile visiting Alaska and becoming the first American president to enter the Arctic Circle, President Obama announced Tuesday he would speed up the acquisition of icebreakers to help the U.S. Coast Guard navigate an area that Russia and China increasingly see as a new frontier. \nThe announcement is the latest power play in the Arctic north, where melting ice has led to a race for resources and access. \nForty percent of the world's oil and natural gas reserves lie under the Arctic. Melting ice also would lead to new shipping routes, and Russia wants to establish a kind of Suez Canal which it controls. More than a Cold War, Russia may be preparing for an Ice War, and the Pentagon is taking note. \nLast March, Russian President Vladimir Putin ordered a snap, full combat military exercise in Russia's Arctic north to mark the anniversary of his annexation of Crimea -- with 40,000 Russian troops, dozens of warships and submarines. \nAt the American Legion on Tuesday, the U.S. defense secretary warned against complacency. \n“We do not seek to make Russia an enemy,” Defense Secretary Ash Carter said. “But make no mistake: while Vladimir Putin may be intent on turning the clock back in Russia, he cannot turn the clock back in Europe. We will defend our allies.” \nRussia has reestablished Soviet-era military bases across the Arctic and begun building a string of search-and-rescue stations along its Arctic shores. In April, Russia’s economic minister explained the importance . \n\"For us, the Arctic is mineral resources, transportation, and one also should not forget about fish and sea products, and bio-resources. The potential here is enormous,\" Alexey Ulyukaev said. \nAfter invading Ukraine, Russia pulled out of the Arctic Council, a consortium of eight countries that includes the U.S. \nAsked about Russia’s recent moves in the Arctic, State Department spokesman Mark Toner said: \"And so do we have concerns specifically about Russia? I would say … we have concerns about how militaries conduct themselves in the Arctic, but that's for all of the Arctic Council members to discuss.\" \nIn 2007, the Pentagon also took note when Russia planted its flag on the seabed under the North Pole for the first time. \nPerhaps it was no coincidence that the Kremlin just released a video of Putin working out with his prime minister -- an insight into the psyche of the Russian leader, who is trying to “flex his muscles” in more ways than one. \nMeanwhile, the U.S. only has two functioning icebreakers. Russia has 41, with plans to build 11 more. Obama on Tuesday, while highlighting the effect of climate change, announced he will speed up acquisition of these coveted ships though they won’t be ready until 2020. \nThe commandant of the U.S. Coast Guard has warned the U.S. is already behind. \n“Russia has one-eighth the gross domestic product of the United States. Clearly the Arctic is a priority for Russia,” Adm. Paul Zukunft said in February during his “State of the Coast Guard” address. “There's a new ocean opening. Coast Guard authorities mandate our presence wherever U.S. national interests require people and ships to operate.” \nMeanwhile, the U.S. Army, facing budget cuts, plans to pull out 3,000 troops from Alaska, in what some say is poor timing as the U.S. plays catch-up to Russia in the Arctic. \nFox News’ Lucas Tomlinson contributed to this report. \nJennifer Griffin currently serves as a national security correspondent for FOX News Channel . She joined FNC in October 1999 as a Jerusalem-based correspondent. Advertisement ", "external_links": [], "published": "2015-09-02T06:30:00.000+03:00", "crawled": "2015-09-02T06:30:01.950+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}