{"organizations": [], "uuid": "0b6d9190e91497cef33d6c7f8eedd9706b2270bd", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/09/22/francisco-washington.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/09/22/el-papa-francisco-llega-a-estados-unidos-lo-recibe-barack-obama", "country": "", "title": "El papa Francisco llega a Estados Unidos, lo recibe Barack Obama", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "El papa Francisco llega a Estados Unidos, lo recibe Barack Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T23:12:00.000+03:00", "replies_count": 0, "uuid": "0b6d9190e91497cef33d6c7f8eedd9706b2270bd"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/09/22/el-papa-francisco-llega-a-estados-unidos-lo-recibe-barack-obama", "ord_in_thread": 0, "title": "El papa Francisco llega a Estados Unidos, lo recibe Barack Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "El papa Francisco llega a Estados Unidos, lo recibe Barack Obama El pontífice visitará Washington, Nueva York y Filadelfia hasta el sábado Martes, 22 de septiembre de 2015 a las 15:10 Una multitud espera el aterrizaje del avión de Alitalia que transporta al pontífice (AFP). Lo más importante La visita tiene lugar del 22 al 26 de septiembre Temas relacionados \nEl papa Francisco llegó este martes a la ciudad de Washington D.C. en Estados Unidos, para iniciar una gira por tres ciudades estadounidenses tras su estancia en Cuba. \nFrancisco fue recibido por el presidente Barack Obama y su familia, y el vicepresidente Joe Biden. \nEl pontífice visitará Washington, en donde hablará frente al Congreso; Nueva York, donde hablará en la Asamblea General de las Naciones Unidas; y Filadelfia. La visita tiene lugar del 22 al 26 de septiembre. \nUna agenda llena \nEl 23 de septiembre comenzarán las actividades del pontífice en suelo estadounidense, con la ceremonia de bienvenida en la Casa Blanca, una recepción similar a la recibida por anteriores papas que visitaron la capital norteamericana. \nPor la tarde del 23 de septiembre el papa presidirá la ceremonia de canonización de fray Junípero Serra en el Santuario Nacional de la Inmaculada Concepción, uno de los momentos principales del viaje a Estados Unidos. \nClaves en este viaje serán también sus citas en la ONU, donde será recibido por su secretario general, Ban Ki-Moon y pronunciará un discurso en español, y su visita en Nueva York a la Zona Cero, donde participará en una ceremonia ecuménica en recuerdo a las víctimas de los atentados del 11 de septiembre de 2001 en aquel lugar. \nLa etapa final del viaje del papa estará marcada por su asistencia a los eventos finales del Encuentro Mundial de las Familias en Filadelfia, ciudad en la que además tiene previsto, como ya hizo en su anterior gira sudamericana, encontrarse con presos de una cárcel. Encuentra este artículo con: francisco,e stados unidos, washington, barack obama, joe biden Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"a10f00f6b00e4b548dc5f11637e6b316\", \"time\": \"2015-09-22T20:13:12.951Z\" } Video ", "external_links": [], "published": "2015-09-22T23:12:00.000+03:00", "crawled": "2015-09-22T23:13:22.232+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}