{"organizations": [], "uuid": "31a50a8dfd37d0dfb05ccbf254aeca243dbd165c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/screen_shot_2015-09-17_at_5.19.26_pm.png", "site_section": "http://thehill.com/taxonomy/term/1132/feed", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/254100-obama-dem-leaders-unite-behind-clean-cr", "country": "US", "title": "Obama, Dem leaders unite behind plan to avert shutdown", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama, Dem leaders unite behind plan to avert shutdown", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T00:06:00.000+03:00", "replies_count": 0, "uuid": "31a50a8dfd37d0dfb05ccbf254aeca243dbd165c"}, "author": "bgoad@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/254100-obama-dem-leaders-unite-behind-clean-cr", "ord_in_thread": 0, "title": "Obama, Dem leaders unite behind plan to avert shutdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama, Dem leaders unite behind plan to avert shutdown By Jordan Fabian - 09/17/15 05:06 PM EDT \nPresident Obama and Democratic leaders in Congress want to pass a clean, stopgap bill to avert a government shutdown and allow negotiators more time to reach a long-term budget deal. \nSenate Majority Leader Harry Reid (D-Nev.) made the announcement after meeting at the White House with Obama and House Minority Leader Nancy Pelosi (D-Calif.) to plot their strategy on the spending talks. ADVERTISEMENT Congress faces a Sept. 30 deadline to pass a spending bill before government funding runs out.\nThe biggest hurdle? Demands from House conservatives that even a short-term continuing resolution (CR) funding the government block money for Planned Parenthood. \n“The three of us agree that we want a short-term CR,” Reid told reporters after the 90-minute huddle in the Oval Office. “We want to make sure the riders are off that, we want to make sure the government will be running.” \nThe top Democrats sought to present a united front in the contentious budget battle, even as Reid and Pelosi extended an olive branch to their Republican counterparts, Senate Majority Leader Mitch McConnell (Ky.) and Speaker John Boehner (Ohio), to sit down and hammer out a comprehensive budget agreement. \nReid said that he is prepared “to do something meaningful with spending” on a broader funding deal after the short-term measure is passed. But he would not reveal how much additional spending he wants. \nPelosi stressed that she wants spending talks to proceed in a “timely fashion” so Congress can tackle other pressing issues, such as highway funding and a reauthorization of the Export-Import Bank. \n“It’s important for us … to have not a very long CR, but one that enables us to have the time for the appropriators to write an omnibus bill,” she said. “The sooner we can agree on a number under which we can write the appropriations bill, the sooner we can get this job done and address some of the other issues.” \nBoehner and Pelosi met on Thursday to discuss a government funding bill, aides said. The meeting, which was first reported by Politico, lasted for about 20 minutes. \nPelosi's lieutenant, Rep. Steny Hoyer (D-Md.), on Wednesday said Democrats had \"no idea\" how Republicans were going to avoid a shutdown because they hadn't been included in the discussions. \nDemocrats have been demanding negotiations on next year’s spending levels with Republicans, who are dealing with an internal rift over Planned Parenthood. \nAfter the release of a series of undercover videos that showed Planned Parenthood officials discussing the sale of fetal tissue, conservative Republicans have insisted federal money for the organization must be turned off. \nMcConnell has warned against a standoff over the issue, arguing it would hurt the GOP brand just as the 2013 shutdown over ObamaCare damaged the party. \n“We’re going to fund the government,” McConnell told reporters Tuesday. “We’re not going to shut the government down and we will do that hopefully into late fall.” \nBut the Senate’s No. 2 Republican, John Cornyn (Texas), said Thursday the Senate will at least vote on a defunding measure in relation to a government funding measure. \nIn the House, Republican leaders are trying to convince the rank and file it would be unwise to risk a shutdown over defunding the organization. \nDuring a closed-door meeting Thursday, leaders showed members polling data indicating Republicans would be blamed if the government shuts down. \nReid agreed that Republicans would bare the brunt of the damage. The Democratic leader said the GOP took control of the Senate last year in spite of, and not because of, the shutdown in 2013. \n“They know what happened last time,” he said. “They know they got a gift.” \nIf a short-term deal can be worked out, Congress will still have to work out the terms for a longer funding plan that would last through the next fiscal year. \nDemocrats are demanding that any final deal lifts spending ceilings on defense and non-defense spending. Some Republicans are open to increasing the ceilings for defense, but most want to avoid any hike to non-defense spending. \nPeter Sullivan contributed. This story was last updated at 6:29 p.m.", "external_links": [], "published": "2015-09-18T00:06:00.000+03:00", "crawled": "2015-09-18T02:29:27.427+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}