{"organizations": [], "uuid": "259ea87415f906848b05b05573bf41f454d19277", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150916232118-cnn-debate-photo-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_world.rss", "section_title": "CNN.com - World", "url": "http://edition.cnn.com/2015/09/17/opinions/miller-gop-foreign-policy-new-president/index.html", "country": "US", "title": "GOP president may look like Obama on foreign policy (Opinion) - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "GOP president may look like Obama on foreign policy (Opinion) - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T21:12:00.000+03:00", "replies_count": 0, "uuid": "259ea87415f906848b05b05573bf41f454d19277"}, "author": "Aaron David Miller", "url": "http://edition.cnn.com/2015/09/17/opinions/miller-gop-foreign-policy-new-president/index.html", "ord_in_thread": 0, "title": "GOP president may look like Obama on foreign policy (Opinion) - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Aaron David Miller: Don't expect big changes under a GOP president Republican president might have to live with Iran deal, he says Aaron David Miller is a vice president and distinguished scholar at the Woodrow Wilson International Center for Scholars and was a Middle East negotiator in Democratic and Republican administrations. He is the author of \"The End of Greatness: Why America Can't Have (and Doesn't Want) Another Great President.\" Follow him on Twitter . The opinions expressed in this commentary are his.\n(CNN) Listening to last night's two Republican presidential candidate debates, you might have come away with the impression that if a Republican wins the White House, U.S. foreign policy is going to be radically different. The GOP will lead in juxtaposition to President Barack Obama's abdication, risk ready in contrast to his risk aversion. America -- now no longer feared, respected, and admired -- will once again stand tall.\nHaving worked as a foreign policy adviser to both Republican and Democratic administrations (and having voted for both, too) I'd suggest laying down until those dizzy feelings of enthusiasm and hope for a radically altered foreign policy for 2017 start to pass.\nAaron David Miller The reality is that politics (campaigning) is about telling people what they want to hear; governing is about what they eventually get. And given the cruel, and unforgiving nature of our world, the impact a predecessor's policies usually have on their successors, and the risk-aversion of several of the candidates themselves, I'd humbly suggest that a Republican president's foreign policy will have a lot more continuity than contrast with Obama's.\nHere's why:\nThe Iran deal: To paraphrase Mick Jagger, President Obama got what he needed out of the Iran deal (a smaller, slower, more easily monitored nuclear program for a limited period of time), but Iran got what it wanted (billions in sanctions relief, and legitimacy for a large residual nuclear infrastructure that will leave it a decade from now with the capacity to weaponize should it choose to do so).\nThe flawed nuclear deal has been accepted by the U.N. Security Council and by much of the international community. John Kerry may get the Nobel for it. And by the time 2017 rolls around, the deal will be well on its way to implementation. So Sen. Ted Cruz's solution (tear it up) or Donald Trump's (renegotiate it) may neither be feasible nor, for a new president, desirable.\nIndeed, Gov. John Kasich, Jeb Bush, Carly Fiorina and Sen. Rand Paul actually steered clear of the tear-it-up strategy, and for good reason. Would any new president want a major foreign policy crisis so early in his or her term, especially one that doesn't have an immediate solution? Of course, if Iran cheats or goes crazy in the region then things could change. But the deal the Iranians got was a very, very good one. Chances are they'll avoid major violations.\nBottom line: A Republican president may have no choice but to live with it.\nSyria: Building on his repeated comments about sending ground forces to Syria, Sen. Lindsay Graham asserted his intention to do just that. Indeed, most of the Republican candidates took a tough line on the Islamic State, though few were as specific as Graham in wanting to send thousands of U.S. combat troops. Sen. Marco Rubio also implied as much, saying that when we deployed force we needed to be in a position to win. Kasich (and Graham) spoke of a U.S. combat role in conjunction with others as part of an international coalition.\nYet their lack of specifics regarding putting boots on the ground speaks volumes about the reality these candidates are all too familiar with. In the wake of Iraq and Afghanistan, the two longest wars in U.S. history, the American public and Congress are wary of getting involved in another trillion dollar experiment in nation-building. Barring a major terror IS attack on the homeland, I can see a Republican president increasing the use of air power and providing more assistance to local forces. But this would be an extension of, not a radical shift from, Obama's approach.\nBottom line: The next Republican president knows that Syria and Iraq are hopeless messes that won't be fixed by thousands more U.S. ground forces.\nIsrael: Here there would be a dramatic change in the U.S. approach, certainly in style and tone. A half a dozen Republicans either declared their support for Israel and/or berated Barack Obama for abandoning America's closest ally.\nThis isn't just campaign rhetoric. The Republican Party has emerged as an avid supporter of Israeli Prime Minister Benjamin Netanyahu, and will go to great lengths to minimize tensions with Jerusalem. Indeed, Cruz talked about moving the U.S. Embassy to Jerusalem, while Carly Fiorina talked about a phone call to Netanyahu to reassure him about U.S. commitment to its ally, and another to threaten the Supreme Leader over the consequences of Iran weaponizing. There should also be little doubt that a Republican president is unlikely to push Israel on the peace process or settlement activity.\nA note of caution, however. Some of the worst tensions with Israel have occurred under Republican presidents (see Richard Nixon and George H. W. Bush). In fact, there were even tensions with Ronald Reagan and George W. Bush, too.\nBottom line: Relations will improve. But with Netanyahu as prime minister, there are bound to be tensions too.\nPutin and Russia: On how to deal with Vladimir Putin, the candidates were all over the parking lot, a sure indication that few had real strategies for countering Russia's expanding influence in Ukraine or Syria. Trump asserted he knew how to deal with Putin, while Fiorina opined she wouldn't talk to him but would strengthen the U.S. position in Europe and the Sixth Fleet. Rubio seemed alarmed by Russia's expanding influence in Syria. But nobody really offered any ways (sensible or otherwise) about how to check Russian ambitions.\nBottom line: If the candidates had a strategy on Russia, they didn't reveal it. And that reflects a certain reality. Given Russia's determination to protect interests it considers vital -- whether in Ukraine, Crimea or with its traditional client the al-Assads -- a new president may well have no better options than the current approach to dealing with Russian ambitions.\nWe're still a year-and-a-half away from the inauguration of the next president, and a great deal could still happen both to improve the next president's options or, perhaps more likely, to make them worse. But the inconvenient truth is -- Republican or Democrat in the Oval Office -- America will face a lot of headaches, long shots and lost causes in the Middle East and with Russia that may well have no real solutions. And any new president will have to deal with the cruel reality that Obama has set down parameters with Iran and Cuba that may be hard to alter.\nAlready, several of the putative Republican candidates, like Bush, Kasich and even Trump and Fiorina, seem pretty risk averse themselves when it comes to using military force.\nBottom line? To paraphrase The Who in one of their better songs, when it comes to foreign policy, the new boss may be pretty similar to the old boss.\nFollow @CNNOpinion Join us on Facebook.com/CNNOpinion.\nRead CNNOpinion's Flipboard magazine.", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/140410154604-aaron-david-miller-topics.jpg", "https://twitter.com/aarondmiller2", "http://www.wilsoncenter.org/", "http://i2.cdn.turner.com/cnnnext/dam/assets/140410154604-aaron-david-miller-story-body.jpg", "https://flipboard.com/section/voices-baPbmr", "http://i2.cdn.turner.com/cnnnext/dam/assets/140410154604-aaron-david-miller-story-top.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140410154604-aaron-david-miller-horizontal-large-gallery.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/140410154604-aaron-david-miller-hp-video.jpg", "https://twitter.com/CNNOpinion", "http://www.facebook.com/CNNOpinion"], "published": "2015-09-18T21:12:00.000+03:00", "crawled": "2015-09-18T18:31:34.699+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}