{"organizations": [], "uuid": "99d013392e29a99e0aa52bd43d96356b195d1390", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/tsa1.jpg", "site_section": "http://www.fedsmith.com/feed/", "section_title": "FedSmith.com", "url": "http://thehill.com/policy/transportation/254976-obama-signs-bill-to-boost-airport-security-after-tsa-shooting", "country": "US", "title": "Obama Signs Bill To Boost Airport Security After TSA Shooting", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama Signs Bill To Boost Airport Security After TSA Shooting", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T22:10:00.000+03:00", "replies_count": 0, "uuid": "99d013392e29a99e0aa52bd43d96356b195d1390"}, "author": "Ian Smith", "url": "http://thehill.com/policy/transportation/254976-obama-signs-bill-to-boost-airport-security-after-tsa-shooting", "ord_in_thread": 0, "title": "Obama Signs Bill To Boost Airport Security After TSA Shooting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama signs bill to boost airport security after TSA shooting Getty Images By Keith Laing - 09/25/15 02:33 PM EDT \nPresident Obama has signed a bill intended to boost airport security after the shooting of a Transportation Security Administration (TSA) employee at Los Angeles International Airport in 2013. \nThe measure, which is named after the TSA worker killed in the shooting, requires the agency to \"verify that all airports and high-risk surface transportation hubs have an appropriate security response plan in place to effectively train for and respond to security incidents when they occur,\" according to the sponsors of the legislation. \nThe White House said Obama signed the measure, known as the Gerardo Hernandez Airport Security Act, into law on Thursday afternoon. ADVERTISEMENT Hernandez was killed in the November 2013 shooting , which left two other TSA agents wounded. Hernandez's killing was the first time a TSA agent had died in the line of duty. \nThe shooting prompted calls for at least some TSA agents to be armed and also for the agency's workers to be given benefits similar to police officers' . \nThe sponsor of the new law to address vulnerabilities in airport security that was exposed by the L.A. airport shooting has said the measure will make \"important strides in enhancing preparedness to mitigate threats in our nation’s airports.” \n“The tragic shooting at LAX in 2013 is a reminder that there is still much work to be done to enhance security measures at our domestic airports, especially when it comes to coordinating our local, state, and federal law enforcement efforts in responding to these incidents,” Rep. John Katko (R-N.Y.), who is chairman of the House Homeland Security subcommittee on transportation, said when bill was sent to Obama earlier this month. \n“Developing preparedness in our airports will go a long way in helping to ensure that the traveling public is kept safe,\" Katko continued. \"Improving the response to threats to public safety will allow our nation’s transportation systems to overcome the challenges that were experienced by law enforcement, emergency first responders, TSA, and the public during the LAX shooting.” Tags:", "external_links": [], "published": "2015-09-25T22:10:00.000+03:00", "crawled": "2015-09-26T02:21:35.263+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}