{"organizations": ["Foundry United Methodist Church", "Dartmouth College", "Wellesley College", "Judiciary Committee", "Southern New Hampshire University in Manchester", "state", "CNN", "Senate", "GOP", "Liberty University", "Osama bin Laden", "NATO", "U.N.", "George Washington University", "Republican", "Victoria Mxenge Housing Project", "Unity Rally in Unity", "Senate Education and Labor Committee", "George Mason University", "Hewlett-Packard", "Association of Southeast Asian Nations", "ABC", "Ohio State University", "Senate Foreign Relations Committee", "White House", "Rodino Committee", "Congressional", "State Department", "Daily Telegraph", "CBS"], "uuid": "de9c8f51688d45318205b3512f91866f11d0c142", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/01/opinions/stanley-bernie-sanders-hillary-clinton/index.html", "country": "", "title": "Bernie Sanders' prize: The 'post-Obama' voters? - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Bernie Sanders' prize: The 'post-Obama' voters? - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "de9c8f51688d45318205b3512f91866f11d0c142"}, "author": "", "url": "http://www.cnn.com/2015/09/01/opinions/stanley-bernie-sanders-hillary-clinton/index.html", "ord_in_thread": 0, "title": "Bernie Sanders' prize: The 'post-Obama' voters? - CNN.com", "locations": ["Portugal", "Addison", "Rhinebeck", "South Carolina", "Rhode Island", "Portsmouth", "Philippi", "Cape Town", "Wellesley", "Afghanistan", "Dhaka", "Florida", "Hopkinton", "California", "New Hampshire", "Massachusetts", "United States of America", "Maryland", "Louisiana", "Cambridge", "Bangladesh", "Ohio", "Myanmar", "Miami", "S.C.", "Virginia", "Libya", "Texas", "Vermont", "Cairo", "New York City", "Queens", "New York", "U.S.", "New Jersey", "Pennsylvania", "Arkansas", "Manchester", "Tahrir Square", "United States", "Kabul", "Louisville", "North Korea", "Israel", "Colombia", "Iowa", "Vietnam", "Baltimore", "Detroit", "Washington D.C.", "South Africa", "Pittsburgh", "Wisconsin", "Cafe Havana", "Britain", "Hanoi", "Washington", "Ben Gurion International Airport", "Roosevelt Island", "Malta", "Hanover", "L.A.", "Lisbon", "America", "Denver", "Cartagena", "Alaska", "Contoocook", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Rodham Clinton", "Jeb Bush", "Donald Trump", "Bush", "Bill Clinton", "Andrew Cuomo", "Timothy Stanley", "Kasich", "Michelle Goldberg", "Livingston", "John Kerry", "Lindsey Graham", "Ted Cruz", "Ben Carson", "Aung San Suu Kyi", "Perry", "Jim Webb", "Hamid Karzai", "Rick Perry", "Fiorina", "Paul", "Mike Gravel", "Bernie Sanders", "Joe Biden", "Chafee", "Eliot Spitzer", "Hillary Rodham", "Al Gore", "Huckabee", "Felipe Bravo", "Jindal", "Obama", "Clinton", "Ann Selzer", "Marco Rubio", "Catherine", "Graham", "Santorum", "Hillary", "Scott Walker", "Chris Christie", "William", "Pataki", "Lincoln Chafee", "Monica Lewinsky", "Barack Obama", "Charles Schumer", "Lewinsky", "Dorothy Rodham", "Marc Mezvinsky", "Rosalynn Carter", "Carly Fiorina", "Chelsea", "Hillary Clinton", "Mike Huckabee", "Ron Paul", "John Doar", "Suu Kyi", "George Pataki", "Rand Paul", "Goldberg", "Barbara Boxer", "Martin O'Malley", "Rubio", "Rick Santorum", "Trump", "Don Hewitt", "Mitt Romney", "O'Malley", "Richard Nixon", "Hugh Rodham", "Tipper Gore", "Sanders", "John Kasich", "Bill", "Bobby Jindal", "Dennis Kucinich", "Timothy Stanley Sanders", "Cruz", "Tyler", "Christian Caraballo", "Ahmet Davutoglu"], "text": "Timothy Stanley says Bernie Sanders is appealing to \"post-Obama coalition\" Stanley: Years of Hillary Clinton's triangulation leaves her without a fixed political identity Liberals worry Clinton lacks passion on issues about which they care, he says Timothy Stanley is a historian and columnist for Britain's Daily Telegraph. He is the author of \" Citizen Hollywood: How the Collaboration Between L.A. and D.C. Revolutionized American Politics. \" The opinions expressed in this commentary are solely those of the author. (CNN) Here is something that political analysts always do. When an outsider candidate suddenly overtakes the presumptive presidential nominee, they don't ask what's so good about the rebel. They ask what's so bad about the establishment favorite. It's deeply unfair. Supporters of Sen. Bernie Sanders probably hate it. Timothy Stanley Sanders is now ahead of Hillary Clinton in New Hampshire and a much stronger second in Iowa. It's way too early to predict a Sanders nomination -- the experts will point out that Clinton is having a bad summer, Vice President Joe Biden isn't in the race right now and Sanders is about the most visible opponent Clinton has. But this should prompt us to consider Sanders' strengths. Which are many. First, he's not as unacceptably left wing as his \"socialist\" label implies . Sanders backed stationing the controversial F-35 bomber in Vermont -- so he is smart and understands constituency politics. He is not a pacifist and says that he wants \"the strongest military in the world .\" In the 1990s, he voted for the controversial Clinton crime bill now opposed by the Black Lives Matter movement. In short: He knows how to win elections. Yes, Vermont leans to the left. But it's still a rural state with pockets of deep conservatism, and it takes cunning for a self-described socialist to end up as one of its senators. 22 photos: Who's running for President? 22 photos: Who's running for President? Hide Caption 1 of 22 22 photos: Who's running for President? Sen. Rand Paul, R-Kentucky, officially announced his presidential bid April 7 at a rally in Louisville. Paul is the son of former presidential hopeful Ron Paul of Texas. \"Today I announce with God's help, with the help of liberty lovers everywhere, that I'm putting myself forward as a candidate for President of the United States of America,\" Paul said at the rally. Hide Caption 2 of 22 22 photos: Who's running for President? Sen. Ted Cruz of Texas has made a name for himself in the Senate, solidifying his brand as a conservative firebrand willing to take on the GOP's establishment. He announced he was seeking the Republican presidential nomination in a speech on March 23. \"These are all of our stories,\" Cruz told the audience at Liberty University in Virginia. \"These are who we are as Americans. And yet for so many Americans, the promise of America seems more and more distant.\" Hide Caption 3 of 22 22 photos: Who's running for President? Hillary Clinton launched her presidential bid on April 12 through a video message on social media. The former first lady, senator and secretary of state is considered the front-runner among possible Democratic candidates.\"Everyday Americans need a champion, and I want to be that champion -- so you can do more than just get by -- you can get ahead. And stay ahead,\" she said in her announcement video. \"Because when families are strong, America is strong. So I'm hitting the road to earn your vote, because it's your time. And I hope you'll join me on this journey.\" Hide Caption 4 of 22 22 photos: Who's running for President? Sen. Marco Rubio, R-Florida, announced his 2016 bid with a rally in Miami on April 13, a day after Clinton announced. He's a Republican rising star who swept into office in 2010 in a wave of tea party fervor.\"Grounded by the lessons of our history, but inspired by the promise of our future, I announce my candidacy for President of the United States of America,\" Rubio told supporters at Miami's Freedom Tower. Hide Caption 5 of 22 22 photos: Who's running for President? Sen. Bernie Sanders , an independent from Vermont who caucuses with Democrats, announced his run in an email to supporters on April 30. He has said the United States needs a \"political revolution\" of working-class Americans to take back control of the government from billionaires. \"This great nation and its government belong to all of the people and not to a handful of billionaires, their super PACs and their lobbyists,\" Sanders said at a rally in Vermont on May 26. Hide Caption 6 of 22 22 photos: Who's running for President? Carly Fiorina, a former CEO of Hewlett-Packard, announced her bid for the Republican nomination on May 4. In 2008 she served as an adviser to Mitt Romney's presidential campaign, and in 2010 she unsuccessfully ran for Barbara Boxer's Senate seat in California. \"Yes, I am running,\" Fiorina said on ABC's \"Good Morning America.\" \"I think I'm the best person for the job because I understand how the economy actually works. I understand the world; who's in it.\" Hide Caption 7 of 22 22 photos: Who's running for President? Republican Dr. Ben Carson announced he was running for President during a speech May 2 to thousands in Detroit. The retired neurosurgeon and surprise conservative star had been exploring the idea of running for a few months before the announcement.\"I'm probably never going to be politically correct, because I'm not a politician,\" he said in his announcement. \"I don't want to be a politician. Because politicians do what is politically expedient -- I want to do what's right.\" Hide Caption 8 of 22 22 photos: Who's running for President? Former Arkansas Gov. Mike Huckabee formally announced his candidacy at a rally in Hope, Arkansas, on May 5. Huckabee unsuccessfully ran for the Republican nomination in 2008. This is his second attempt.\"I truly am from Hope to higher ground,\" Huckabee told the crowd during his announcement. \"So it seems perfectly fitting that it would be here that I announce that I am a candidate for President of the United States of America.\" Hide Caption 9 of 22 22 photos: Who's running for President? Former U.S. Sen. Rick Santorum of Pennsylvania announced his candidacy for the Republican nomination from a factory on the outskirts of Pittsburgh on May 27. Santorum, who ran unsuccessfully in 2012, is widely considered the most socially conservative candidate who will enter the race. \"As middle America is hollowing out, we can't sit idly by as big government politicians make it harder for our workers and then turn around and blame them for losing jobs overseas. American families don't need another President tied to big government or big money,\" he said during his kickoff rally. Hide Caption 10 of 22 22 photos: Who's running for President? Former New York Gov. George Pataki formally announced his bid for the White House in a YouTube video released on May 28. The Republican served three terms as New York's governor, including during the 9/11 attacks.\"My vision was not a partisan vision. It was a vision about people, about what we could accomplish together,\" Pataki said as he narrated a four-minute announcement video. \"If we are to flourish as a people, we have to fall in love with America again.\" Hide Caption 11 of 22 22 photos: Who's running for President? Former Maryland Gov. Martin O'Malley launched his presidential campaign May 30 in Baltimore with an appeal to the party's progressive base that he hopes will upend the conventional wisdom that Hillary Clinton is destined to clinch the Democratic nomination.\"This is the urgent work calling us forward today: to rebuild the truth of the American Dream for all Americans,\" O'Malley said at his rally. \"And to begin right now.\" Hide Caption 12 of 22 22 photos: Who's running for President? South Carolina Sen. Lindsey Graham made himself the ninth Republican candidate to announce his candidacy. Graham launched his bid in Central, S.C., on June 1. Graham is betting his foreign policy experience will set him apart from other potential contenders. \"I want to be President to defeat the enemies trying to kill us, not just penalize them or criticize them or contain them, but defeat them,\" he said at his kickoff event. Hide Caption 13 of 22 22 photos: Who's running for President? Former Texas Gov. Rick Perry threw his name into the ring for the Republican nomination on June 4 in Addison, Texas. Perry ran in 2012 but his campaign ended after a debate gaffe and several stump speech missteps. During his announcement , Perry said: \"We don't have to settle for a world in chaos or an America that shrinks from its responsibilities.\" Hide Caption 14 of 22 22 photos: Who's running for President? Former Rhode Island Governor Lincoln Chafee jumped into the 2016 presidential race on June 3 at George Mason University in Virginia. Chafee previously served in the Senate as a Republican and as an Independent governor. He's now running for president as a Democrat.\"I enjoy challenges and certainly we have many facing America,\" Chafee said during his announcement . Hide Caption 15 of 22 22 photos: Who's running for President? New Jersey Gov. Chris Christie jumped into the race June 30 during a rally at his former high school in Livingston, New Jersey. He is the 14th candidate on the Republican side to join the race. \"We need a government in Washington D.C. that remembers you went there to work for us, not the other way around,\" he said during the rally. Hide Caption 16 of 22 22 photos: Who's running for President? On June 24, hours before a kickoff rally, Louisiana Gov. Bobby Jindal announced his intention to run. He was once a Republican rising star who passed on an opportunity to seek the White House in 2012.\"I'm running for President of the United States of America. Join me,\" Jindal tweeted, with a link to his website's announcement page. Hide Caption 17 of 22 22 photos: Who's running for President? Businessman Donald Trump announced June 16 at his Trump Tower in New York City that he is seeking the Republican presidential nomination. This ends more than two decades of flirting with the idea of running for the White House.\"So, ladies and gentlemen, I am officially running for president of the United States, and we are going to make our country great again,\" Trump told the crowd at his announcement. Hide Caption 18 of 22 22 photos: Who's running for President? Former Florida Gov. Jeb Bush kicked off his campaign for the 2016 GOP nomination on June 15 in Miami. If his campaign is victorious, the Bush clan will become the only American family to have elected three of their own to the highest office in the land.\"We will get back on the right side of free enterprise and freedom for all Americans,\" Bush said during his announcement. Hide Caption 19 of 22 22 photos: Who's running for President? Jim Webb, former U.S. senator from Virginia, announced in a tweet on July 2 that he is a candidate for the Democratic nomination for president, which makes him the fifth Democrat to do so.\"I understand the odds, particularly in today's political climate where fair debate is so often drowned out by huge sums of money,\" he said on his website . \"We need to shake the hold of these shadow elites on our political process.\" Hide Caption 20 of 22 22 photos: Who's running for President? On July 13, Wisconsin Gov. Scott Walker became the 15th Republican to join the race for his party's nomination. He launched his bid with a tweet and a video ahead of his rally in his home-state. In his video, he said, \"In the Republican field, there are some who are good fighters, but they haven't won those battles. There are others who have won elections but haven't consistently taken on big fights. We've showed you we can do both.\" Hide Caption 21 of 22 22 photos: Who's running for President? Ohio Gov. John Kasich joined the Republican field July 21 as he formally announced his White House bid.\"I am here to ask you for your prayers, for your support ... because I have decided to run for president of the United States,\" Kasich told his kickoff rally at the Ohio State University. Hide Caption 22 of 22 Second, Sanders is tapping into emerging liberal forces. The same Iowa poll that puts Sanders within seven percentage points of Clinton also says that 96% of his supporters like his policies. In particular, he's doing well among first-time voters, people under 45 and those who use the label \"independent.\" The pollster behind these results, Ann Selzer, argues: \"That's the Obama coalition. Those are the groups that he put together that surprised Hillary Clinton in 2008.\" They're motivated by an anti-establishment impulse -- a desire to see something new. But while they might have gone for Barack Obama in 2008, they could just as easily be dubbed the \"post-Obama coalition\" in 2016. These are folks worried about the things that Obama has failed to address and that they fear Clinton won't touch. Wall Street greed. Stagnating wages. Overpriced college education. And as the proportion of the electorate that is nonwhite and non-conservative grows, so there emerges a powerful group that has no time for equivocation. It's the mirror opposite of Trump's support. Both groups have been raised in a culture of ideological partisanship and can't stand it when they see their own side selling out for next-to-no reward. 50 photos: Hillary Clinton's career in the spotlight Former Secretary of State Hillary Clinton, pictured here on Tuesday, March 3, has become one of the most powerful people in Washington. Here's a look at her life and career through the years. Hide Caption 1 of 50 50 photos: Hillary Clinton's career in the spotlight Before she married Bill Clinton, she was Hillary Rodham. Here, Rodham talks about student protests in 1969, which she supported in her commencement speech at Wellesley College in Wellesley, Massachusetts. Hide Caption 2 of 50 50 photos: Hillary Clinton's career in the spotlight Rodham, center, a lawyer for the Rodino Committee, and John Doar, left, chief counsel for the committee, bring impeachment charges against President Richard Nixon in the Judiciary Committee hearing room at the U.S. Capitol in 1974. Hide Caption 3 of 50 50 photos: Hillary Clinton's career in the spotlight Arkansas Gov. Bill Clinton helps first lady Rosalynn Carter on a campaign swing through Arkansas in June 1979. Also seen in the photo is Hillary Clinton, center background. Hide Caption 4 of 50 50 photos: Hillary Clinton's career in the spotlight Bill Clinton embraces his wife shortly after a stage light fell near her on January 26, 1992. They talk to Don Hewitt, producer of the CBS show \"60 Minutes.\" Hide Caption 5 of 50 50 photos: Hillary Clinton's career in the spotlight With Hillary, Democratic presidential candidate Bill Clinton waves to the crowd at his victory party after winning the Illinois primary on March 17, 1992. Hide Caption 6 of 50 50 photos: Hillary Clinton's career in the spotlight Al Gore, Tipper Gore, Bill Clinton and Hillary Clinton wave to supporters at the Chautauqua Institution in Chautauqua, New York, after they gave speeches on family values on August 23, 1992. Hide Caption 7 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton gestures at a campaign rally November 3, 1992, in Denver. After taking office, President Clinton chose his wife to head a special commission on health care reform, the most significant public policy initiative of his first year in office. Hide Caption 50 photos: Hillary Clinton's career in the spotlight Bill and Hillary Clinton have a laugh together on Capitol Hill in 1993. Hide Caption 9 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton pours herself a cup of tea in 1993 while testifying to the Senate Education and Labor Committee about health care reform. Hide Caption 10 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton speaks at George Washington University on September 10, 1993, in Washington during her husband's first term. Hide Caption 11 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton waves to the media on January 26, 1996, as she arrives at federal court in Washington for an appearance before a grand jury. The first lady was subpoenaed to testify as a witness in the investigation of the Whitewater land deal in Arkansas. Hide Caption 12 of 50 50 photos: Hillary Clinton's career in the spotlight Hillary Clinton looks on as President Clinton discusses the Monica Lewinsky scandal in the Roosevelt Room of the White House on January 26, 1998. Hide Caption 13 of 50 50 photos: Hillary Clinton's career in the spotlight Hillary and Bill Clinton arrive at Foundry United Methodist Church on August 16, 1998, in Washington. He became the first sitting president to testify before a grand jury when he testified via satellite about the Lewinsky matter. Hide Caption 14 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton shakes hands during a St. Patrick's Day parade in the Sunnyside neighborhood of Queens, New York, on March 5, 2000. Hide Caption 15 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton waves to the crowd as she arrives on the stage at the Democratic National Convention on August 14, 2000, in Los Angeles. Hide Caption 16 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton campaigns for a Senate seat October 25, 2000, at Grand Central Station in New York. Hide Caption 17 of 50 50 photos: Hillary Clinton's career in the spotlight Hillary Clinton is sworn in as a senator of New York in a re-enactment ceremony with, from left, President Clinton, nephew Tyler, daughter Chelsea, brother Hugh Rodham, mother Dorothy Rodham and Vice President Al Gore on January 3, 2001, in Washington. Hide Caption 18 of 50 50 photos: Hillary Clinton's career in the spotlight Andrew Cuomo, Eliot Spitzer and Clinton celebrate with a crowd of Democratic supporters after their wins in various races November 7, 2006, in New York. Hide Caption 19 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton speaks during a post-primary rally on January 8, 2007, at Southern New Hampshire University in Manchester, New Hampshire. Hide Caption 20 of 50 50 photos: Hillary Clinton's career in the spotlight The Clintons pay a visit to the 92nd annual Hopkinton State Fair in Contoocook, New Hampshire, on September 2, 2007. Hide Caption 21 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton speaks at a campaign rally September 2, 2007, in Portsmouth, New Hampshire. She was running for the Democratic presidential nomination. Hide Caption 22 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton addresses a question during a debate with other Democratic presidential candidate at Dartmouth College in Hanover, New Hampshire, on September 26, 2007. Also pictured are U.S. Rep. Dennis Kucinich of Ohio, left, and former U.S. Sen. Mike Gravel of Alaska. Hide Caption 23 of 50 50 photos: Hillary Clinton's career in the spotlight Felipe Bravo, left, and Christian Caraballo are covered with Hillary Clinton stickers in downtown Manchester, New Hampshire, on January 8, 2008. Hide Caption 24 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton campaigns in Council Bluffs, Iowa, with her daughter, Chelsea, on January 1, 2008, two days ahead of the January 3 state caucus. Hide Caption 25 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton waves as she speaks to supporters at the National Building Museum on June 7, 2008, in Washington. After pulling out of the presidential race, Clinton thanked her supporters and urged them to back Barack Obama to be the next president of the United States. Hide Caption 26 of 50 50 photos: Hillary Clinton's career in the spotlight Obama and Clinton talk on the plane on their way to a Unity Rally in Unity, New Hampshire, on June 27, 2008. Hide Caption 27 of 50 50 photos: Hillary Clinton's career in the spotlight Obama watches Clinton address the Democratic National Convention on August 26, 2008. The two endured a long, heated contest for the 2008 nomination. Hide Caption 28 of 50 50 photos: Hillary Clinton's career in the spotlight Sen. Charles Schumer, left, looks toward Secretary of State designate Clinton as Senate Foreign Relations Committee chairman Sen. John Kerry, center, looks on during nomination hearings January 13, 2009, on Capitol Hill. Hide Caption 29 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton testifies during her confirmation hearing for secretary of state on January 13, 2009, in Washington. Hide Caption 30 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton, as secretary of state, dances with a local choir while visiting the Victoria Mxenge Housing Project in Philippi, a township on the outskirts of Cape Town, South Africa, on August 8, 2009. Hide Caption 31 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton looks through binoculars toward North Korea during a visit to an observation post July 21, 2010, at the demilitarized zone separating the two Koreas. Hide Caption 32 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton walks up the steps to her aircraft as she leaves a meeting of the Association of Southeast Asian Nations on July 23, 2010, in Hanoi, Vietnam. Hide Caption 33 of 50 50 photos: Hillary Clinton's career in the spotlight Hillary and Bill Clinton pose on the day of their daughter's wedding to Marc Mezvinsky on July 31, 2010, in Rhinebeck, New York. Hide Caption 34 of 50 50 photos: Hillary Clinton's career in the spotlight U.S. President Barack Obama and Clinton observe a moment of silence before a NATO meeting November 19, 2010, in Lisbon, Portugal. Hide Caption 35 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton listens as Turkish Foreign Minister Ahmet Davutoglu makes a brief statement November 29, 2010, before a bilateral meeting at the State Department in Washington. Hide Caption 36 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton shakes hands with a child during an unannounced walk through Tahrir Square in Cairo on March 16, 2011. Hide Caption 37 of 50 50 photos: Hillary Clinton's career in the spotlight Obama, Vice President Joe Biden, Clinton and members of Obama's national security team receive an update on the Osama bin Laden mission May 1, 2011, in the Situation Room of the White House. Hide Caption 50 photos: Hillary Clinton's career in the spotlight Clinton checks her personal digital assistant prior to departing Malta on October 18, 2011. Hide Caption 50 photos: Hillary Clinton's career in the spotlight Clinton dances while in Cartagena, Colombia, on April 15, 2012. Hide Caption 50 photos: Hillary Clinton's career in the spotlight Clinton enjoys a beer at Cafe Havana in Cartagena, Colombia, on April 15, 2012. Hide Caption 41 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton appears with little makeup during an event in Dhaka, Bangladesh, on May 6, 2012. She tells CNN, \"I feel so relieved to be at the stage I'm at in my life right now ... Because you know if I want to wear my glasses, I'm wearing my glasses. If I want to wear my hair back I'm pulling my hair back. You know at some point it's just not something that deserves a lot of time and attention.\" Hide Caption 42 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton speaks as Afghanistan President Hamid Karzai listens during a news conference at the presidential palace in Kabul, Afghanistan, on July 7, 2012. Hide Caption 50 photos: Hillary Clinton's career in the spotlight Clinton arrives at Ben Gurion International Airport in Israel on July 15, 2012. Hide Caption 44 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton looks on as Obama makes a statement in response to the attack at the U.S. Consulate in Libya on September 12, 2012. Hide Caption 45 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton applauds Myanmar opposition leader Aung San Suu Kyi during a ceremony where Suu Kyi was presented with the Congressional Gold Medal on September 19, 2012. Hide Caption 46 of 50 50 photos: Hillary Clinton's career in the spotlight Bill Clinton kisses his wife after introducing her at the Clinton Global Initiative annual meeting on September 24, 2012, in New York City. Hide Caption 47 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton shakes hands with Catherine, the Duchess of Cambridge, while attending a reception with Prince William, second from right, in New York in December. Hide Caption 48 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton speaks to reporters at U.N. headquarters on Tuesday, March 10, addressing her use of private email for official work as secretary of state. She said she used a private domain out of \"convenience\" but admitted in retrospect \"it would have been better\" to use multiple emails. Hide Caption 49 of 50 50 photos: Hillary Clinton's career in the spotlight Democratic presidential candidate, former Secretary of State Hillary Rodham Clinton gestures before speaking to supporters Saturday, June 13 on Roosevelt Island in New York, in a speech promoted as her formal presidential campaign debut. Hide Caption 50 of 50 All of which brings us back to Hillary Clinton. This race isn't all about her, but it is an interesting test of the limits to her political style. Writer Michelle Goldberg makes a good point : Clinton's entire career has been built on fighting a reputation for radicalism. As wife of the Arkansas governor and as first lady to a president, she had to react against accusations that she was using her husband as a Trojan horse for pinko-feminism. So she would bolt to the right. That was necessary then, but it looks outdated now. Nowadays the voters want authenticity, and judging by Sanders' popularity, many feel that their material conditions are bad enough to justify economic liberalism. Clinton senses that things have changed. Hence, she began the campaign by trying to sell herself as a relatable, practical woman who wanted to help you get ahead. It didn't work. So now she's acting as the unbeatable front-runner, telling the Democrats that it's their patriotic duty to rally around her . The party leadership is even accused of gaming the primary process in her favor by limiting the number of debates. This is Clinton at her controlling worst. Combined with the email scandal it just makes her seem as though the she thinks the rules don't apply to her. After all these years, the quest for power is the one constant in Clinton's career. Goldberg is quite right. A woman who had been prepared to triangulate in any direction in her bid for the White House now appears absent of a fixed political identity. She's like the invisible man. Unwrap the bandages of political strategy and underneath there is ... air where the populist passion was meant to be. ", "external_links": [], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-02T02:05:48.825+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}