{"organizations": [], "uuid": "909c24c6e1caf30da74ed9574faf702ee633eac7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/cellphonegetty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/cybersecurity/255418-tech-group-petitions-obama-to-oppose-backdoor-surveillance", "country": "", "title": "Tech group petitions Obama to oppose 'backdoor' surveillance | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Tech group petitions Obama to oppose 'backdoor' surveillance | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T19:08:00.000+03:00", "replies_count": 0, "uuid": "909c24c6e1caf30da74ed9574faf702ee633eac7"}, "author": "", "url": "http://thehill.com/policy/cybersecurity/255418-tech-group-petitions-obama-to-oppose-backdoor-surveillance", "ord_in_thread": 0, "title": "Tech group petitions Obama to oppose 'backdoor' surveillance | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama", "Cory Bennett"], "text": "Tech group petitions Obama to oppose 'backdoor' surveillance Getty Images By Cory Bennett - 09/30/15 09:43 AM EDT \nA coalition of tech companies and civil liberties groups are banding together to petition the White House to oppose guaranteed access to encrypted data. \n“We petition the Obama Administration to: Publicly affirm your support for strong encryption. Reject any law, policy, or mandate that would undermine our security,” their petition reads. ADVERTISEMENT The group behind the petition includes human rights organizations such as the American Civil Liberties Union, tech trade groups such as the Computer and Communications Industry Association and various tech leaders such as Twitter and privacy-focused search engine DuckDuckGo.\nThe tech community has been clashing for months with the Obama administration over encryption standards. \nLaw enforcement and intelligence officials are pushing for some type of process that would ensure their access to encrypted digital communications. But technologists and privacy advocates say any type of guaranteed pathway to this data would weaken encryption and expose individuals to hackers. \n“The government should not erode the security of our devices or applications, pressure companies to keep and allow government access to our data, mandate implementation of vulnerabilities or backdoors into products, or have disproportionate access to the keys to private data,” the petition says. \nAccording to recent reports, the White House is slowly backing away from its call for guaranteed access to encrypted data. The administration over the summer prepared four possible technological solutions for companies holding encrypted data but has since dismissed all four proposals because of the expected push back. \nNational Security Council spokesman Mark Stroh said the White House was seeking more input. \n“The United States government firmly supports the development and robust adoption of strong encryption, while acknowledging that use of encryption by terrorists and criminals to conceal and enable crimes and other malicious activity can pose serious challenges to public safety,” he said in a statement last week. “The administration continues to welcome public discussion of this issue as we consider policy options.” \nThe petition wants President Obama to go further. \n“Weakening encryption weakens the entire Internet,” it says. “Mr. President, please endorse strong encryption, and encourage other world leaders to do the same.” \nThe White House has pledged to respond to any petition that receives over 100,000 signatures in 30 days. In its first few hours online, the tech coalition’s petition had over 50 signatures. ", "external_links": [], "published": "2015-09-30T19:08:00.000+03:00", "crawled": "2015-09-30T19:08:52.372+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}