{"organizations": [], "uuid": "f150e16622389990233b00c69420ea3f0af4ea9e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/barack-obama/feed", "section_title": "Obama on Huffington Post", "url": "http://www.huffingtonpost.com/anis-shivani/poem-for-obama_b_8100870.html", "country": "US", "title": "Anis Shivani: Poem for Obama", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Anis Shivani: Poem for Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T14:16:00.000+03:00", "replies_count": 0, "uuid": "f150e16622389990233b00c69420ea3f0af4ea9e"}, "author": "Anis Shivani", "url": "http://www.huffingtonpost.com/anis-shivani/poem-for-obama_b_8100870.html", "ord_in_thread": 0, "title": "Anis Shivani: Poem for Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nAs the Obama years draw to a close, and we elect a new \"commander-in-chief,\" here is a poem, written early in the Obama years, reflecting on the unique position the U.S. president, whoever he is, finds himself in. It is part of a poem called \"Crisis,\" from a new manuscript, The Moon Blooms in Occupied Hours . \nCrisis \nHe has a slight stutter. He lingers over \"our boys,\" fights off boredom. His eyes are a shade of lemon, his lips dismiss genies invisible to us. He has been made to look like a banker in a bunker. Or a movie star tired of the stuntman's blaze. He reverberates with high hopes, sent his way by mothers in Ohio, wary but convinced of his finality. He says we have a duty and a rose and a garden and a rope and a reputation and a choke, and it is for him to decide who gets to win. He says he gets sunburnt too easily. He says there's water under the bridge. He says he has no fight to pick, he is skinny and a dope, such a pushover when his daughters come to play in the Oval Office. If he could, he would dream of the Mayans circling the tomb suddenly sprouting in the desert brown, wondering what possessed their predecessors. But he only dreams of playing with his daughters, the lovely and the lovelier one. Men become great in crisis-- or wither. He knows which is which. He almost winks, as he dissolves into white, leaving that perfume of power behind, burning our nostrils, cutting its way to the dead center of our brain. \nAnis Shivani is the author of several critically acclaimed books of fiction, poetry, and criticism, the most recent of which is the novel Karachi Raj (HarperCollins/Fourth Estate), released this summer. More:", "external_links": [], "published": "2015-09-09T14:16:00.000+03:00", "crawled": "2015-09-09T18:47:37.146+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}