{"organizations": [], "uuid": "b6a4ee0edca4b971746ead4f7c23779bbf4259eb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamavirginia.png", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/252064-obama-shooting-breaks-my-heart", "country": "US", "title": "Obama: Shooting ‘breaks my heart’", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Shooting ‘breaks my heart’", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T01:14:00.000+03:00", "replies_count": 0, "uuid": "b6a4ee0edca4b971746ead4f7c23779bbf4259eb"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/252064-obama-shooting-breaks-my-heart", "ord_in_thread": 0, "title": "Obama: Shooting ‘breaks my heart’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Shooting ‘breaks my heart’ By Jordan Fabian - 08/26/15 06:14 PM EDT \nPresident Obama said Wednesday the shooting death of two TV journalists “breaks my heart,” adding that U.S. gun deaths dwarfs those related to terrorism \n“It breaks my heart every time you read or hear about these kids of incidents,” Obama said in an interview with Philadelphia TV station WPVI. ADVERTISEMENT “What we know is that the number of people who die from gun-related incidents around this country dwarfs any deaths that happen through terrorism,” the president added. \nThe shooting outside of Roanoke, Va., was the latest in a string of high-profile shootings that have cast a pall over Obama’s presidency. \nLocal television news reporter Alison Parker, 24, and cameraman Adam Ward, 27, were gunned down on Wednesday morning while on assignment by a suspect identified as Vester Lee Flanagan, a former employee of the television station. \nFlanagan approached the pair as they were filming an interview and fired multiple shots in their direction. The harrowing incident was captured on live television. \nThe suspect posted video of the shooting on his social media account before reportedly shooting himself while being pursued by police. \nEarlier Wednesday, the White House chided Congress for refusing to tighten the nation’s gun laws. \n“This is another example of gun violence that is becoming all too common in communities large and small all across the United States,” press secretary Josh Earnest told reporters. \nObama has described the day 26 people including 20 children were killed by a gunman at an elementary school was the worst of his presidency. Earlier this year, nine people were killed at a historic African-American church in Charleston, S.C.", "external_links": [], "published": "2015-08-27T01:14:00.000+03:00", "crawled": "2015-08-27T01:26:23.765+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}