{"organizations": [], "uuid": "0a153c06aa307bdf2c7e6d2a0418e987ff7284d6", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/17/politics/government-shutdown-harry-reid-nancy-pelosi-john-boehner-obama/index.html", "country": "", "title": "Top Hill Dems meet with Obama, Boehner in hopes of avoiding government shutdown - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Top Hill Dems meet with Obama, Boehner in hopes of avoiding government shutdown - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T07:15:00.000+03:00", "replies_count": 0, "uuid": "0a153c06aa307bdf2c7e6d2a0418e987ff7284d6"}, "author": "", "url": "http://www.cnn.com/2015/09/17/politics/government-shutdown-harry-reid-nancy-pelosi-john-boehner-obama/index.html", "ord_in_thread": 0, "title": "Top Hill Dems meet with Obama, Boehner in hopes of avoiding government shutdown - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Top Hill Dems meet with Obama, Boehner in hopes of avoiding government shutdown Updated 0224 GMT (0924 HKT) September 18, 2015 22 photos: Photos: John Boehner's political career John Boehner has been the speaker of the U.S. House of Representatives since 2011, making him second in line for the presidency, behind the vice president. Look back at his career in politics so far. Hide Caption 1 of 22 22 photos: Photos: John Boehner's political career Afghanistan President Ashraf Ghani (right) expresses his country's gratitude for America's fiscal commitment and military sacrifices during an address to a joint meeting of the United States Congress with Vice President Joe Biden (left) and Speaker of the House John Boehner (R-OH) in the House Chamber of the U.S. Capitol March 25, 2015 in Washington, D.C. Hide Caption 2 of 22 22 photos: Photos: John Boehner's political career U.S. President Barack Obama walks with Speaker of the House John Boehner as they depart the annual Friend's of Ireland luncheon on Capitol Hill in Washington, DC, March 17, 2015. Hide Caption 3 of 22 22 photos: Photos: John Boehner's political career U.S. Vice President Joe Biden (left) and Speaker of the House John Boehner await the arrival of President Barack Obama for the State of The Union address on January 20, 2015 in the House Chamber of the U.S. Capitol in Washington, D.C. Hide Caption 4 of 22 22 photos: Photos: John Boehner's political career The image of the Speaker of the House John Boehner (R-OH) is displayed in a monitor of a camera as he talks with reporters in his office in the U.S. Capitol November 21, 2014 in Washington, D.C. Hide Caption 5 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner, R-Ohio, holds a copy of the Constitution on Capitol Hill in Washington on May 7, 1992, as Sen. Don Nickles, D-Oklahoma, looks on. Both men proclaimed it was a historic day when the Michigan House ratified the 27th Amendment to the Constitution, which would require that any Congressional pay raises not go into effect until after the next election. Hide Caption 6 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner at a Capitol Hill news conference on February 6, 1995. He has had a seat in the U.S. House of Representatives since 1990. Before that he was a member of the Ohio State House of Representatives for six years. Hide Caption 7 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner dumps out coal, which he called a Christmas gift to President Clinton, during a news conference about the federal budget on December 21, 1995. Many government services and agencies were closed at the end of 1995 and beginning of 1996 as a Republican-led Congress battled Clinton over spending levels. Hide Caption 8 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner and House Majority Leader Dick Armey, R-Texas, listen to House Speaker Newt Gingrich at a 1997 news conference with entrepreneurs promoting the GOP tax relief plan. Hide Caption 9 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – President George W. Bush signs into law the federal education bill No Child Left Behind at a high school in Hamilton, Ohio, in 2002. The law offered the promise of improved schools for the nation's poor and minority children and better-prepared students in a competitive world. Boehner, second from right, backed the bill. Hide Caption 10 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner answers questions during an interview with Bloomberg in Washington on June 29, 2005. Hide Caption 11 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner, center, and fellow Republican House members sing Boehner's birthday song during a news conference on Capitol Hill on November 17, 2006. Boehner served as the House Minority Leader from 2007 to 2011. Hide Caption 12 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner, center, looks on as President Barack Obama speaks with then-House Majority Leader Steny Hoyer in the East Room of the White House on February 23, 2009. Boehner and Obama have butted heads over the years. Hide Caption 13 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner, an avid golfer, talks with Tiger Woods while golfing at the Congressional Country Club in Bethesda, Maryland, in 2009. Hide Caption 14 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner voices his concerns about the health care reform bill championed by Obama during a news conference in Washington on October 29, 2009. Hide Caption 15 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner hugs his wife, Debbie, after addressing the crowd at the NRCC Election Night watch party on November 2, 2010, when Republicans took back control of the House of Representatives. Boehner met his wife in college, and they have been married since 1973. Hide Caption 16 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – On January 5, 2011, Boehner wipes away tears as he waits to receive the gavel from outgoing House Speaker Nancy Pelosi, D-California, during the first session of the 112th Congress. Hide Caption 17 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner presents golfing legend Arnold Palmer with the Congressional Gold Medal at a special ceremony in the Rotunda of the Capitol on September 12, 2012. Hide Caption 18 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner is sworn in as the speaker of the House after his re-election on January 3, 2013. Hide Caption 19 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner speaks to the media after a meeting with President Obama at the White House on October 2, the second day of the federal government's recent shutdown. The White House squared off with Republican rivals in Congress over how to fund federal agencies, many of which were forced to close, leaving a fragile economy at risk. Hide Caption 20 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Reporters question Boehner as he arrives at the U.S. Capitol as the government stalemate continued on October 7. President Obama signed a bill on October 17 that ended the 16-day shutdown and raised the debt ceiling. Hide Caption 21 of 22 22 photos: Photos: John Boehner's political career John Boehner's political career – Boehner blasts conservative groups during a press conference on December 12 after passing a compromise budget deal aimed at removing the threat of another government shutdown. Fed up with criticism from conservative advocates, Boehner said they were \"misleading their followers.\" He followed up with: \"Frankly, I just think that they've lost all credibility.\" Hide Caption 22 of 22 Story highlights Democrats want to keep pressure on Republicans to negotiate a broader budget deal that would remove the across-the-board forced spending cuts, known as \"sequestration\" Congress has until September 30 to pass a spending bill and avert a government shutdown Washington (CNN) President Barack Obama met with top Democratic leaders behind closed doors at the White House Thursday as Congress scrambles to avoid a government shutdown. Speaking to reporters outside the West Wing following the hour-and-a-half-long huddle that focused on budget negotiations, Senate Minority Leader Harry Reid announced that he, Obama and House Minority Leader Nancy Pelosi were in agreement on a short-term continuing resolution to keep the government running and allow time for negotiations on a \"meaningful\" budget. Democrats want to keep pressure on Republicans to negotiate a broader budget deal that would remove the across-the-board forced spending cuts, known as \"sequestration,\" that are in place now. The sooner they reach a deal, the sooner domestic programs would potentially be less impacted by these budget cuts. Pelosi said she felt prepared heading into budget talks focused on a deal that lifted sequestration caps in a way that domestic spending was increased at the same rate as defense spending -- \"dollar for dollar,\" as she put it. Reid praised Senate Majority Leader Mitch McConnell for acknowledging that something needed to be done on caps as well as discussing a clean continuing resolution, one that addresses funding the government without adding on other provisions, such as defunding Planned Parenthood. RELATED: John Boehner, allies tighten grip on speakership Congress has until September 30 to pass a spending bill and avert a government shutdown. Many House Republicans say they will not vote for a bill that provides any funding for the controversial women's health organization. House Republican leaders are expected to soon move forward with a short-term funding bill. Separately, they would aim to pass a measure to defund Planned Parenthood through a process known as \"budget reconciliation\" that would bypass a Democratic filibuster in the Senate. But Pelosi said she was optimistic about the chances of avoiding a shutdown. \"I'm hopeful that we're all in agreement ... that we should not have a government shutdown,\" she said. \"It's costly to the government and to the American people. So we are optimistic, we want to be cooperative, we want to negotiate in good faith.\" The White House later released a statement, saying Hill Democrats \"would support a clean, short-term continuing resolution to provide more time to negotiate an agreement that invests in middle-class economic priorities and helps our entire economy grow.\" Later Thursday, Pelosi met with House Speaker John Boehner for roughly 20 minutes in the speaker's office to discuss next steps on funding the government. \"We're having a conversation about getting close to how we negotiate,\" Pelosi told reporters. She didn't know when they would sit down again to get into specific details, and said they had not arrived on an overall budget level yet. Pelosi said she didn't like a GOP proposal to pass a stopgap bill to fund the government through mid-December \"I'd rather have it be a shorter term (continuing resolution),\" she said. \"Why should we put it off?\" CNN's Manu Raju contributed to this report. Congress ", "external_links": [], "published": "2015-09-18T07:15:00.000+03:00", "crawled": "2015-09-18T07:15:59.386+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}