{"organizations": [], "uuid": "43982bc788ab313759d52642950de1ebf91c6cc2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e370c91d00002f00146432.jpeg", "site_section": "http://www.huffingtonpost.com/tag/white-house/feed", "section_title": "White House on Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-denali-alaska_55e36f8ce4b0aec9f35398f3?d0don7b9", "country": "US", "title": "Obama To Rename Mount Mickinley As Mount Denali", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama To Rename Mount Mickinley As Mount Denali", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T20:10:00.000+03:00", "replies_count": 0, "uuid": "43982bc788ab313759d52642950de1ebf91c6cc2"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/obama-denali-alaska_55e36f8ce4b0aec9f35398f3?d0don7b9", "ord_in_thread": 0, "title": "Obama To Rename Mount Mickinley As Mount Denali", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Obama Will Restore Mt. McKinley's Name To Denali On Alaska Trip The peak was named Mount McKinley in 1896, but Alaska natives had long before called the mountain Denali, meaning \"the High One.\" Posted: 08/30/2015 05:11 PM EDT | Edited: 2 hours ago ASSOCIATED PRESS \nWASHINGTON, Aug 30 (Reuters) - President Barack Obama on Monday will officially restore Denali as the name of North America's tallest mountain, siding with the state of Alaska in ending a 40-year battle over what to call a peak that has been known as Mount McKinley. \nThe historic change, coming at the beginning of a three-day presidential trip to Alaska, is a sign of how hard the White House will push during Obama's remaining 16 months as president to ensure his fight to address climate change is part of his legacy. \nRenaming the mountain, which has an elevation of more than 20,000 feet (6,100 meters), makes headlines for his climate quest while also creating goodwill in a state that has not been broadly supportive to the Democratic president. \nObama is slated to tour a receding glacier and meet people in remote Arctic communities whose way of life is affected by rising ocean levels, creating images designed to build support for regulations to curb carbon emissions. \nThe peak was named Mount McKinley in 1896 after a gold prospector exploring the region heard that Ohioan William McKinley, a champion of the gold standard, had won the Republican nomination for president. \nBut Alaska natives had long before called the mountain Denali, meaning \"the High One.\" In 1975, the state of Alaska officially designated the mountain as Denali, and has since been pressing the federal government to do the same. Lance King via Getty Images \nAlaskans had been blocked in Congress by Ohio politicians, who wanted to stick with McKinley as a lasting tribute to the 25th U.S. president, who served from 1897 until his assassination in 1901. \nUnder Obama's action, Interior Secretary Sally Jewell will use her legal authority to end the long debate and rename the mountain. \nThe move elicited praise from Alaska Governor Bill Walker, a Republican turned independent, and Republican elected officials, who more typically are critical of an administration they see as hostile to the oil and gas interests of their state. \n\"I'd like to thank the president for working with us to achieve this significant change to show honor, respect, and gratitude to the Athabascan people of Alaska,\" said Republican Senator Lisa Murkowski, who led the fight for the Denali name in Congress. \nBut Ohio Senator Rob Portman said he was disappointed in what he called \"yet another example of the president going around Congress.\" He urged the White House to find another way to honor McKinley in Denali National Park. (Additional reporting by Steve Quinn in Juneau, Alaska; Editing by Peter Cooney, Robert Birsel) Generations of Alaskans, Alaska Natives hold Denali sacred. Time to honor its original name.SJ http://t.co/eD80BNJKTg pic.twitter.com/mS3kFiLoST — Sally Jewell (@SecretaryJewell) August 30, 2015 The mountain has spoken 🗻 Mt McKinley officially renamed Denali: http://t.co/VSN2vl7yZo Congrats, Alaska! pic.twitter.com/ZdRTJ2PEHL — US Dept of Interior (@Interior) August 30, 2015", "external_links": [], "published": "2015-08-30T20:10:00.000+03:00", "crawled": "2015-08-31T07:52:10.314+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}