{"organizations": ["Islamic State", "ISIS"], "uuid": "888f0db95b57044b4428e7983c75b4d6812b6664", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarack_putinvladimir_030714getty_0.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/253410-obama-russias-support-for-assad-a-big-mistake", "country": "", "title": "Obama: Russia's support for Assad 'a big mistake' | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama: Russia's support for Assad 'a big mistake' | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T23:42:00.000+03:00", "replies_count": 0, "uuid": "888f0db95b57044b4428e7983c75b4d6812b6664"}, "author": "", "url": "http://thehill.com/policy/defense/253410-obama-russias-support-for-assad-a-big-mistake", "ord_in_thread": 0, "title": "Obama: Russia's support for Assad 'a big mistake' | TheHill", "locations": ["United States", "U.S.", "Moscow", "Ukraine", "Syria", "Md.", "Russia", "Fort Meade", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kristina Wong", "Assad", "Putin", "Bashar Assad", "Vladimir Putin", "Obama"], "text": "Obama: Russia's support for Assad 'a big mistake' Getty Images By Kristina Wong - 09/11/15 03:51 PM EDT President Obama on Friday warned Russian President Vladimir Putin that his support for Syria's government in its four-year civil war \"is a big mistake.\" \"We are going to be engaging Russia to let them know that you can't continue to double down on a strategy that's doomed to fail,\" he said at Fort Meade, Md., where he met with troops. ADVERTISEMENT Moscow confirmed Wednesday it had military advisers in Syria, amid reports it had sent troops and equipment into the country to reinforce Syrian President Bashar Assad's position. Assad's forces are in a two-front war against coalition-backed rebel groups and extremist groups including the Islamic State in Iraq and Syria (ISIS). Obama said he warned Putin \"four or five years ago\" that it would be a mistake to financially support or sell arms to Assad. \"He did not take my warnings, and as a consequence, things have gotten worse,\" he said. Obama said Russia's support for Assad would not change the U.S.'s \"core strategy,\" which is to continue to put pressure on ISIS. \"The good news is that Russia shares with us a concern about countering violent extremism, and the view that [ISIS] is very dangerous,\" he said. \"So despite our conflicts with Russia in areas throughout Ukraine, this is an area of potentially converging interests.\" \"The bad news is that Russia continues to believe that Assad, who is their traditional partner, is somebody that is worthy of continuing support,\" he said. \"And it has been my view and the view of the United States government that as long as Assad is there, he has alienated so much of the Syrian population that it will not be possible to arrive at a peaceful cease-fire and political settlement, and continue to have this vacuum that's filled by extremists.\" Tags: ", "external_links": [], "published": "2015-09-11T23:42:00.000+03:00", "crawled": "2015-09-11T23:42:46.746+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}