{"organizations": [], "uuid": "dbf73601599715bb9b27c41a73b50b6a78b42ea8", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_090315getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/national-security/252810-how-obama-won-on-iran", "country": "US", "title": "How Obama won on Iran", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "How Obama won on Iran", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T17:15:00.000+03:00", "replies_count": 0, "uuid": "dbf73601599715bb9b27c41a73b50b6a78b42ea8"}, "author": "mmali@thehill.com (Julian Hattem)", "url": "http://thehill.com/policy/national-security/252810-how-obama-won-on-iran", "ord_in_thread": 0, "title": "How Obama won on Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How Obama won on Iran Getty By Julian Hattem - 09/05/15 10:15 AM EDT \nPresident Obama is poised for a major diplomatic victory on the Iran nuclear deal when Congress returns to Washington next week. \nAt best, opponents of the accord can merely strike a symbolic blow against the agreement, by passing a measure of disapproval. Obama has enough support to sustain a veto and now the deal's backers are on the verge of filibustering the bill, preventing it from reaching his desk in the first place. \nThe overwhelming Democratic support for the agreement — the most significant foreign policy achievement of Obama’s term — is the result of weeks of tough lobbying, detailed technical arguments, grassroots support and even a little help from Republicans. ADVERTISEMENT “This was the most extensive effort by the administration on any single piece of legislation since I’ve been in Congress,” said Rep. Adam Schiff (D-Calif.), a supporter of the agreement who came to Capitol Hill in 2001.\n“I think they were determined not to take support of the deal for granted and wanted to do everything possible to ensure the president’s veto was sustained,” he added. \nThe deck was stacked against opponents of the deal, even with Republicans in control of both chambers of Congress. \nIf they managed to get legislation disapproving of the deal to the president's desk, they would still need two-thirds majorities to override a veto — something that's hasn't happened during his term in office. \nBut Obama himself acknowledged just a few weeks ago that Democratic support for the deal was “squishy,” and spectators openly wondered whether this summer would repeat Democrats’ awful August of 2009, when Tea Party supporters overran town halls to voice their opposition to ObamaCare. \nThere were early setbacks, too. Sen. Chuck Schumer (D-N.Y.) — likely the next Senate Democratic leader — announced he would oppose the deal, a potentially punishing blow to the White House’s hopes. \nBut the worst of the Obama administration’s fears never materialized. \nThe White House — which has a reputation for keeping an arms-length relationship with Capitol Hill — mounted an all hands on deck effort in the three weeks after the deal was signed and before lawmakers left town for the August recess. \nSecretary of State John Kerry, Energy Secretary Ernest Moniz and other top officials became fixtures on Capitol Hill and sought to answer every lawmaker’s questions in person before they fanned out across the country. \nMoniz was the ringer, offering a detailed yet affable performance that contrasted with Kerry’s more pedantic style, and earned him the affection of even the deal’s most bitter critics. \nThe president, too, got personally involved, and refused to relent once Congress left town. \nObama spoke to more than 100 lawmakers in individual or small-group settings, according to a White House official, including 30 calls during his two-week August vacation in Martha’s Vineyard, Mass. \nCabinet secretaries and senior administration officials made the case directly to over 200 House members and senators after the deal was reached. \nSupporters were up against heavy artillery. At home, lawmakers were bombarded with tens of millions of dollars’ worth of TV ads from opponents of the agreement such as the American Israel Public Affairs Committee (AIPAC). \nTo counteract that firepower, organizations such as J Street spent millions of their own to run advertisements in key markets. \nObama also made an open plea for liberal groups to lend him a hand. \n“As big of a bully pulpit as I have, it’s not enough,” Obama told thousands of activists in July. \"I can’t carry it by myself.\" \nThey came through. \nGroups including MoveOn and Credo Action made the nuclear deal their No. 1 issue of the summer. Supporters flooded voicemails, email inboxes and canvassed town halls across the country to get lawmakers to back the pact. \nThe liberal support highlighted the partisan turn of the debate, despite the expressed wishes of lawmakers on both sides of the aisle. \nThe White House early on accused Republicans of refusing to give the deal a fair shake, though that narrative was disrupted by key defections from Democrats such as Schumer, Sen. Bob Menendez (N.J.) and Reps. Eliot Engel (N.Y.) and Steve Israel (N.Y.). \nBut the argument became easier when Republican hawks and presidential candidates raced to sound the most caustic alarms about the agreement. \n“It does not help their cause — that is, the opponents of the deal — that Dick Cheney is a spokesperson for their cause,” said Rep. Jan Schakowsky (D-Ill.), who has been whipping Democrats to support the agreement. \nCheney, the former vice president, has called the agreement a “train wreck” and is planning to give a speech denouncing the deal at the hawkish American Enterprise Institute on Tuesday. \nEven Israeli Prime Minister Benjamin Netanyahu inflamed partisan tensions. Many Democrats felt particularly spurned when he appeared to go behind the White House’s back to give a speech before Congress in March. \nThere is a “deep discomfort among Democratic members of Congress with the tone and direction of Prime Minister Netanyahu and his government’s policies,” said Dylan Williams, the vice president of government affairs at J Street. \n“Democrats were in some cases appalled by both the content of the prime minister’s speech and by the manner in which it was arranged.” \nThe administration was also relentless in building public support for the deal. \nObama and Kerry sat for multiple interviews with local news outlets, and White House staffers mounted a vigorous social media campaign that included a new Twitter account (@TheIranDeal) that blasted out talking points to its 27,700 followers. \nThere was a helping hand from overseas, too. \nMultiple Democrats said they became convinced about the impossibility of returning to the negotiating table for a better deal after speaking with ambassadors from the five other nations in the talks — the U.K., France, Germany, China and Russia. J Street also brought Israeli supporters of the agreement to Capitol Hill. \nEven the drip-by-drip pace of Democrats’ announcements was a carefully orchestrated strategy from House Minority Leader Nancy Pelosi (D-Calif.) to demonstrate that momentum was moving in the deal’s favor. \n“That was her idea,” said Schakowsky. “I saw as that was rolling out, how effective that was. I think she deserves a lot of credit.” \nThat drip turned into a flood this week. \nSenate Democrats not only easily surpassed the 34 votes necessary to uphold a veto, but appear to be within spitting distance of the 41 necessary to successfully filibuster the deal. \nThe number of backers in the House, meanwhile, easily sailed past 100. \n— Jordan Fabian contributed.", "external_links": [], "published": "2015-09-05T17:15:00.000+03:00", "crawled": "2015-09-05T17:43:16.189+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}