{"organizations": [], "uuid": "71bf5c7f6cff9d27c74232756299fbc637ea145b", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/2nd%20Tier%20Debate.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/09/16/gop-candidates-trade-barbs-over-immigration-path-to-citizenship-in-early-debate/", "country": "IL", "title": "GOP candidates trade barbs over immigration & path to citizenship in early debate", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "GOP candidates trade barbs over immigration & path to citizenship in early debate | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "71bf5c7f6cff9d27c74232756299fbc637ea145b"}, "author": "Fox News Latino", "url": "http://latino.foxnews.com/latino/politics/2015/09/16/gop-candidates-trade-barbs-over-immigration-path-to-citizenship-in-early-debate/", "ord_in_thread": 0, "title": "GOP candidates trade barbs over immigration & path to citizenship in early debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Fox News Latino SIMI VALLEY, CA - SEPTEMBER. 16: Republican presidential candidates, (L-R) George Pataki, Rick Santorum, Louisiana Gov. Bobby Jindal and U.S. Senator Lindsey Graham (R-SC) stand onstage during the presidential debates at the Reagan Library on September 16, 2015 in Simi Valley, California. Fifteen Republican presidential candidates are participating in the second set of Republican presidential debates. (Photo by Justin Sullivan/Getty Images) 2015 Getty Images \nIn pre-debate, GOP candidates come out swinging on immigration\nThe second-tier GOP presidential hopefuls came out with teeth bared when questioned about immigration reform and birth-right citizenship came up during the early Republican debate Wednesday afternoon at the Reagan Library.\nSouth Carolina Sen. Lindsey Graham and former Pennsylvania  Sen. Rick Santorum traded barbs over their own immigration strategies, while former New York Gov. George Pataki laid out his case for a path to citizenship. Louisiana Gov. Bobby Jindal argued for stronger border security.\n\"This debate shouldn't be about people here illegally, but about what should we do about hard-working Americans,\" Santorum said during the debate. \"Immigrants are holding wage earners down.\"\nSantorum, who supports slowing legal immigration, added that \"American workers are being hurt by immigration.\"\nSantorum accused much of the GOP field of supporting \"amnesty\" by proposing plans to legalize some illegal workers.\nPataki and Graham said that a proposal to deport millions of people would be impossible.\n\"I'm trying to fix the problem. We're not going to deport the 11 million here,\" Graham said.\nGraham supports allowing people in the country illegally to stay, arguing in part that Hispanic voters are an untapped source for Republicans.\n\"In my world, Hispanics are Americans,\" Graham said sharply.\nAll four candidates say they would secure the border and crack down on local officials who opt not to prosecute undocumented immigrants.\nEven before the candidates took the stage, the immigration portion of the Republican presidential debates was well under way in California.\nDozens of protesters angry about Republicans who oppose citizenship for millions of people in the U.S. illegally gathered at the entry to the Ronald Reagan Presidential Library compound.\nImmigration advocates in Latino-heavy southern California beat drums and carried signs that said: \"Are you going to deport me?\"\nThere were also people wearing oversized papier mache caricature heads of businessman Donald Trump, Florida Sen. Marco Rubio and Wisconsin Gov. Scott Walker. Trump and Walker have taken a harder line on immigration, while Rubio has stepped back from his support for a path to citizenship for people in the country illegally.\nThe Associated Press contributed to this report. \nLike us on Facebook \nFollow us on Twitter & Instagram", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-17T05:06:57.175+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}