{"organizations": [], "uuid": "19d7408ab1d0737da7b7d2a307f3d101aef9b3f2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f0ae762c00003600aaf586.jpeg?cache=EaAcAiH06A", "site_section": "http://www.huffingtonpost.com/feeds/verticals/parents/index.xml", "section_title": "Parents - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/barack-obama-malia-obama_55f0ab74e4b002d5c077fe78", "country": "US", "title": "President Obama Is 'Freaked Out' That His Daughters Are All Grown Up", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "President Obama Is 'Freaked Out' That His Daughters Are All Grown Up", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T01:37:00.000+03:00", "replies_count": 0, "uuid": "19d7408ab1d0737da7b7d2a307f3d101aef9b3f2"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/barack-obama-malia-obama_55f0ab74e4b002d5c077fe78", "ord_in_thread": 0, "title": "President Obama Is 'Freaked Out' That His Daughters Are All Grown Up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email President Obama Is 'Freaked Out' That His Daughters Are All Grown Up \"It makes no sense. Michelle and I are way too young to have daughters who are both almost in college now.\" Marina Fang Associate Politics Editor, The Huffington Post Posted: 09/09/2015 06:37 PM EDT \nPresident Barack Obama is not looking forward to his daughters heading off to college, lamenting at an event on Wednesday that they are growing up too fast. \n\"Just yesterday, Malia started her first day of senior year. You know, I was sitting in her room because I was going to see her off her first day of school. She puts her head on my shoulder and she says, 'Daddy, you know, you realize this is probably going to be the last time that you ever send me off for my first day of school,'\" Obama told the audience. \n\"I had to look away. I didn’t want to just be such a crybaby. It makes no sense. Michelle and I are way too young to have daughters who are both almost in college now. So as a parent, I was a little freaked out,\" he said, pretending to wipe away a tear. President Barack Obama pretends to wipe a tear during his speech at Macomb County Community College Wednesday, Sept. 9, 2015, in Warren, Mich. The president said he's \"a little freaked out\" that his oldest daughter, Malia, just started her senior year in high school. (AP Photo/Paul Sancya) \nObama shared his fatherly grief at an event in Michigan promoting his proposal to make community college more affordable, where he was introduced by Jill Biden, a community college professor and the wife of Vice President Joe Biden. \nIt's unclear where Malia, 17, will apply to college, but she has reportedly toured several elite schools, such as Yale, Stanford and her parents' alma maters, Princeton and Columbia. She has shown an interest in filmmaking and television production -- last year , she briefly worked as a production assistant on the set of \"Extant,\" a CBS series starring Halle Berry and produced by Steven Spielberg, and this summer, she scored an internship with Lena Dunham, the creator and star of HBO's \"Girls.\" From left, President Barack Obama, daughter Malia Obama, first lady Michelle Obama and daughter Sasha Obama walk form Marine One across the South Lawn of the White House in Washington, Sunday, Aug. 23, 2015, as they return from a family vacation on Martha's Vineyard. (AP Photo/Carolyn Kaster) \nIn June , her father praised Malia and her sister Sasha for being hardworking and has frequently noted that he thought he was too lazy when he was their age. \n\"The truth is the girls are wonderful,\" Obama said. \"You know they work hard, they work a lot harder than I ever did when I was a kid.\" \nAlso on HuffPost: Sasha, Malia, Michelle & Barack Obama of", "external_links": [], "published": "2015-09-10T01:37:00.000+03:00", "crawled": "2015-09-10T02:19:46.939+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}