{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "869d981aa152db742800b1a92a80e00e7f3591f4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/08/05/barack-obama-is-no-jfk/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1438798119265.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/08/05/barack-obama-is-no-jfk.html", "country": "", "title": "Obama is no JFK: Today's Iran is nothing like Russia in 1963 | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama is no JFK: Today's Iran is nothing like Russia in 1963 | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "869d981aa152db742800b1a92a80e00e7f3591f4"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/08/05/barack-obama-is-no-jfk.html", "ord_in_thread": 0, "title": "Obama is no JFK: Today's Iran is nothing like Russia in 1963 | Fox News", "locations": ["Iran", "Russia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nOn the surface President Obama’s Iran speech Wednesday at American University seems a perfect sequel to President Kennedy’s speech on a Nuclear Test Ban Treaty with the Soviet Union more than 50 years ago on the same turf. Both men are young, dynamic, good looking, smooth talking leaders seemingly determined to lead their countries towards peace by making deals with strong enemies. Obama clearly hopes to transform Islamic fundamentalist Iran down the road like Kennedy’s successors seemingly transformed the Soviet Union into a strong annoyance from an enemy. \nThere is only one problem with this charade: it hides the great differences between Kennedy and Obama and their enemies. Iran 2015 is nothing like the Soviet Union 1963. \nThe Soviet Union in 1963 was a global superpower with a GNP roughly 50% of that of the United States. It had roughly 500 strategic nuclear warheads, nearly 400 launches and 1,000 megatonnage and naval power. \nIt had the No. 2 scientific complex in the world consisting of almost one million scientists, engineers and technicians. \nThe Red Army, which had crushed the Luftwaffe in World War II and seized East Europea, was deployed in the center of Europe threatening NATO forces in West Germany and allied forces in France. Its Communist ideology had global appeal and allies of 13 major states, including China, Eastern European countries, Cuba and Vietnam. Significant on-Communist states, such as India, often aligned with Moscow. \nNone of this is true of Iran. Its GNP is barely 2 percent of that of the United States and one heavily dependent on oil and gas as a petro state. \nIran, while barely visible on the world economic scene (less than 1% of global GNP), is not even the strongest power in the Middle East compared to either Saudi Arabia with its oil and gas or Israel with its strong military and high tech. \nIt has no strategic or tactical nuclear weapons after more than 30 years of trying to build them and a weak technical infrastructure of a few hundred atomic scientists. \nAlmost five million Iranians, many of whom are educated, have emigrated abroad, further weakening Iran. Its 650,000 man army could not even in the 1980s beat the Iraqi army, which 150,000 American troops crushed in 22 days and seized Baghdad in 2003. It navy, although growing, is minimal to weak. \nIts Shiite fundamentalist ideology, while dangerous, has largely only a regional Middle Eastern appeal and minimal global appeal to the 90 percent of the Muslim world that is Sunni. It has few allies save for Shiite militia forces in surrounding countries and Alawite Syria. \nThe Soviet Union, with its great power and influence, was a major threat to the United States. The precipitating event, the Cuban Missile Crisis threatening the very existence of mankind and the United States that the world trembled until the Russians withdrew their forces and missiles from Cuba. President Kennedy himself later said in an aside that the chances of a major nuclear conflagration in 1962 were between one in five and one in three. \nThus, while the Soviet Union was a major military and political threat to the Free World, Iran poses no such threat at this time. And the parallel falls apart even faster if one considers the aftermath to Cuba in 1962. \nThe Soviet Union did not disappear because of its loss in Cuba or the 1963 Nuclear Test Ban Treaty. Indeed it remained global threat to the United States and NATO until the Gorbachev era in the late 1980s. In the end it was not this or other treaties that brought the Soviet Union down in 1991--it was massive internal disintegration. Its failing economy, defeat in Afghanistan, aging out of touch leaders, declining influence of its ideology, growing national sentiment among the half of its population that were non-Russian and a growing lag behind the rest of the world’s technology. \nIn 1987 I was part of a Western delegation that met for a week with a delegation from the Central Committee of the Communist Party of the Soviet Union in Telluride, Colorado. I followed that up in 1988 and 1989 with visits to Moscow. Everywhere I heard the same message--we have fallen seriously behind the world technologically politically and economically. No one in dozens of meetings ever mentioned the treaties with the West as a cause. \nThus, Obama, as an idealist, is not a realist like Kennedy. He is playing with fire in the Middle East elevating a weak and dangerous propagator of international terrorism to have an easy path towards nuclear weapons in the next decade. For as Winston Churchill once said, “Those who fail to learn from history are doomed to repeat it.” \nJonathan Adelman is a professor at the Josef Korbel School of International Studies at the University of Denver. Adelman has written several books on Russia and was Condoleezza Rice's doctoral adviser. ", "external_links": [], "published": "2015-08-05T03:00:00.000+03:00", "crawled": "2015-08-06T12:22:22.724+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}