{"organizations": [], "uuid": "7583e8786dad8daeff3792fca91fc9810515d464", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e32f041700004301568f1f.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/bobby-jindal-immigration_55e32e73e4b0c818f61832fd", "country": "", "title": "Bobby Jindal Claims Immigration Policy Is Not About Border Security, But About 'Values'", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Bobby Jindal Claims Immigration Policy Is Not About Border Security, But About 'Values'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T20:13:00.000+03:00", "replies_count": 0, "uuid": "7583e8786dad8daeff3792fca91fc9810515d464"}, "author": "", "url": "http://www.huffingtonpost.com/entry/bobby-jindal-immigration_55e32e73e4b0c818f61832fd", "ord_in_thread": 0, "title": "Bobby Jindal Claims Immigration Policy Is Not About Border Security, But About 'Values'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bobby Jindal"], "text": "Bobby Jindal Claims Immigration Policy Is Not About Border Security, But About 'Values' \"If they want to come here, they should want to be Americans.\" Marina Fang Associate Politics Editor, The Huffington Post Posted: 08/30/2015 01:11 PM EDT Bloomberg via Getty Images \nWASHINGTON -- GOP presidential hopeful and Louisiana Gov. Bobby Jindal suggested on Sunday that to stem illegal immigration, the solution is not to pursue stronger border security but rather to force immigrants to “adopt our values.” \nJindal, the son of Indian immigrants, claimed that his parents “raised their children to be Americans,” and said that the real issue with immigrants, particularly undocumented immigrants, is that they “should want to be Americans.” \n“Yes, we need to secure our border. Stop talking about it. I think we need to insist that folks who come here come here legally, learn English, adopt our values, roll up our sleeves and get to work,” he said on ABC’s “This Week.” \nHost Martha Raddatz quickly stopped him. \n“I’m sorry, but what do you mean by ‘adopt our values’? What values don’t immigrants have that you believe Americans have?” she asked Jindal. \nJindal responded by alleging that immigrants in Europe do not try to integrate into their country’s cultures, although part of the problem is that many European countries do not have birthright citizenship , which limits the rights of immigrants and their descendants. \n“What I worry about is you look to Europe, the contrast is -- you’ve got second-, third-generation immigrants that don’t consider themselves part of those societies, those cultures. We in our country shouldn’t be giving freedoms to people who want to undermine the freedom for other people,” he said. \n“If they want to come here, they should want to be Americans,” he added. \nJindal reiterated his argument on CBS’ “Face the Nation” and repeated a phrase he uttered during the first Republican debate earlier this month : “Immigration without assimilation is invasion.” \n“Let's insist on being the melting pot. Let's forget this politically correct, left notion that we're not a melting pot anymore,” he said. \nThe GOP presidential candidate frequently makes claims like these on the campaign trail, for example, telling voters that “we need to get rid of hyphenated Americans.” However, immigration scholars say that his views on immigrant assimilation are antiquated and no longer reflect the values of most immigrants, who embrace “hyphenated identities” -- adopting American values and culture but also preserving and celebrating the heritage of their ancestors. \nOn Sunday, Jindal also shrugged off concerns that other members of the GOP field are alienating minority voters with their nativist rhetoric on immigration. Real estate mogul and reality television star Donald Trump has repeatedly made offensive claims about Latino immigrants and has called for ending birthright citizenship and deporting all undocumented immigrants. This week, former Florida Gov. Jeb Bush claimed his use of the term “anchor babies” was not offensive because he was referring to Asian immigrants, not Latinos. And on Saturday , New Jersey Gov. Chris Christie suggested that the government should track immigrants using the same technology that FedEx uses to track packages. ", "external_links": [], "published": "2015-08-30T20:13:00.000+03:00", "crawled": "2015-08-30T20:13:02.424+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}