{"organizations": [], "uuid": "4f555fdcfa7b154be686f64fd0f7c05fddd7d2c9", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/28/obama-busca-un-compromiso-de-india-sobre-el-cambio-climatico-en-la-reunion-con/", "country": "", "title": "Obama busca un compromiso de India sobre el cambio climático en la reunión con Modi | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama busca un compromiso de India sobre el cambio climático en la reunión con Modi | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "4f555fdcfa7b154be686f64fd0f7c05fddd7d2c9"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/28/obama-busca-un-compromiso-de-india-sobre-el-cambio-climatico-en-la-reunion-con/", "ord_in_thread": 0, "title": "Obama busca un compromiso de India sobre el cambio climático en la reunión con Modi | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama busca un compromiso de India sobre el cambio climático en la reunión con Modi Published September 28, 2015 EFE \nNaciones Unidas – El presidente de EE.UU., Barack Obama, conversó hoy sobre cambio climático con el primer ministro de India, Narendra Modi, uno de los líderes que aún no han anunciado la contribución de su país al acuerdo global vinculante sobre la materia que debe alcanzarse en diciembre en París. \nObama y Modi mantuvieron una reunión bilateral en la sede de Naciones Unidas, donde ambos participan en las actividades de la Asamblea General, y \"buena parte\" de su conversación se centró en la conferencia de la ONU sobre cambio climático en París, según el mandatario estadounidense. \n\"Estamos de acuerdo en que este es un asunto crucial para el mundo, y todos nosotros tenemos responsabilidades. Estamos alentados por la naturaleza enérgica del compromiso de Modi con las energías limpias\", dijo Obama en declaraciones a la prensa después de la reunión. \n\"Lo que le he dicho (a Modi) es que verdaderamente creo que el liderazgo de India en esta conferencia marcará el tono no solo para ahora, sino durante las próximas décadas\", añadió. \nLa India es el cuarto mayor emisor de CO2 a la atmósfera tras China, Estados Unidos y la Unión Europea, y es uno de los pocos grandes contaminantes del planeta que todavía no han presentado un plan a la ONU para combatir el cambio climático, algo que todos los países del mundo deben hacer antes de la cumbre en París. \nModi, por su parte, afirmó en la reunión que Obama y él comparten \"un compromiso inflexible con el cambio climático sin afectar\" a su \"capacidad para hacer frente a las aspiraciones de desarrollo de la humanidad\". \nEl primer ministro indio recordó su objetivo de alcanzar 175 gigavatios de energía renovable en 2022 al tiempo que avanza hacia \"una estrategia de desarrollo que permita hacer la transición hacia una matriz energética más sostenible\". \nModi también dio las \"gracias al presidente Obama por su apoyo a la posición de India en un Consejo de Seguridad de la ONU reformado\". \nIndia, Alemania, Japón y Brasil insisten en la necesidad de que la ONU profundice y avance en la negociación para una reforma del Consejo de Seguridad que implique una ampliación del número de miembros permanentes y no permanentes. \nLa de hoy fue la tercera reunión que han mantenido Obama y Modi, tras la celebrada en septiembre de 2014 en la Casa Blanca y la que sostuvieron en enero de este año en Nueva Delhi. \nLas dos mayores democracias del mundo han estrechado sus relaciones tras la llegada al poder de Modi hace casi un año y medio, y se han esforzado en particular por impulsar sus lazos comerciales, que desde 2001 se han multiplicado por cinco hasta llegar a casi 100.000 millones de dólares anuales. \nObama y Modi han expresado su objetivo de volver a quintuplicar ese intercambio comercial en los próximos años, y hoy volvieron a hablar de \"comercio e inversión\", según el presidente estadounidense. ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-30T11:54:25.344+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}