{"organizations": ["Democratic Party | Fox News Latino Fox News Latino"], "uuid": "4d430ac7ba9a0169e520b0cc523ebb001590a6ce", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/trump%20pledge.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/opinion/2015/09/04/rick-sanchez-how-trump-is-helping-obama-and-democratic-party/", "country": "", "title": "Rick Sanchez: How Trump is helping Obama and the Democratic Party | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Rick Sanchez: How Trump is helping Obama and the Democratic Party | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "4d430ac7ba9a0169e520b0cc523ebb001590a6ce"}, "author": "", "url": "http://latino.foxnews.com/latino/opinion/2015/09/04/rick-sanchez-how-trump-is-helping-obama-and-democratic-party/", "ord_in_thread": 0, "title": "Rick Sanchez: How Trump is helping Obama and the Democratic Party | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rick Sanchez", "Obama"], "text": "Fox News Latino \nDonald Trump’s comment to Hispanic Chamber of Commerce CEO Javier Palomarez that “he didn’t need the Hispanic vote” because of his poll numbers is singularly clueless. Nothing could be further from the truth. What his poll numbers do show is that Latinos generally despise him. \nOh, and by the way, those polls don’t even take into account his more recent, intentional and hurtful comments about “anchor babies” or his complaint about Jeb Bush’s bilingualism —treating it as if it were a shortcoming or worse, a disease. A further look into Trump’s numbers reveals real problems with his base of support, which is generally old, uneducated and angry. He owns the over-60 crowd. He also owns Americans who barely just finished high school and he owns Americans with extreme views on race and ethnicity. Winning coalition? Hardly! \n- Rick Sanchez \nTrump may be winning with one-fourth of Republican primary voters, but he’s losing with just about everybody else who matters to the GOP. \nRepublican leaders established a well thought-out plan to try and broaden their base by being more inclusive to Latinos, women, blacks and younger demographics. But Donald Trump is quite literally dumping on that strategy. \nWhen Trump brags about not needing Hispanics to vote for him because his poll numbers are so high, what poll numbers is he talking about? Let’s break it down. \n- Women: Only one in five females in America say they would vote for Trump, according to a Quinnipiac poll. \n- Hispanics: 81 percent say they will not vote for him, according to a Washington Post/ABC News poll. \nTrump's negatives are so incredibly, well, negative, that he is actually helping Democrats and even President Obama. It seems the louder and more offensive Trump becomes, the better Obama does with Millennials. \nSince Trump began (take your pick) barking, screaming or acting, the president’s approval numbers among Millennials has grown to 75 percent among men and 57 percent among women. Among all 18-24 year olds, Obama’s at 68 percent and among 25-34 year olds he’s at 65 percent, according to Zogby. \nWithout having to even engage him or even mention him, Zogby’s poll finds that Obama may be getting a significant boost from Trump’s tirades. Obama is now doing extremely well with the gamut of anti-Trump voters and especially with those that he’s repeatedly insulted. \nAmong college graduates, Obama is at 62 percent; among Hispanics he’s at 72 percent; among African-Americans he’s at 82 percent, and among Asian Americans he’s at 79 percent. \nDonald Trump loves to crow about his polls, but the fact of the matter is he may be poisoning the GOP well for decades by peeing on the party’s plans to become more inclusive. A further look into Trump’s numbers reveals real problems with his base of support, which is generally old, uneducated and angry. He owns the over-60 crowd. He also owns Americans who barely just finished high school and he owns Americans with extreme views on race and ethnicity. Winning coalition? Hardly! \nFor the GOP and its future, Trump is the proverbial turd in the punch bowl. He is needlessly scarring away America’s new mainstream and leaving behind a stench so horrible, who knows if or when it will be fixable. \nSo what does that make Trump besides clueless, as previously described? He’s also selfish and the damage he is doing may be incalculable. Like a family member who comes to visit and drinks your booze, eats your food, parks his car in your neighbor’s yard and then leaves you to pick up the pieces when he’s gone, Donald Trump may leave the GOP with a mess that is simply too big for anyone to clean up. \nRick Sanchez is a contributor for Fox News Latino. \nLike us on Facebook Follow us on Twitter & Instagram \n", "external_links": [], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-06T01:13:55.390+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}