{"organizations": [], "uuid": "984d68ad4d284945ea8fad4396c1a27eb79bc2e5", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_070715getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/252368-ohio-republicans-vow-to-fight-obama-on-mountain-renaming", "country": "US", "title": "Ohio Republicans vow to fight Obama on Mount McKinley's renaming", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ohio Republicans vow to fight Obama on Mount McKinley's renaming", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T00:48:00.000+03:00", "replies_count": 0, "uuid": "984d68ad4d284945ea8fad4396c1a27eb79bc2e5"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/252368-ohio-republicans-vow-to-fight-obama-on-mountain-renaming", "ord_in_thread": 0, "title": "Ohio Republicans vow to fight Obama on Mount McKinley's renaming", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ohio Republicans vow to fight Obama on Mount McKinley's renaming By Devin Henry - 08/31/15 05:48 PM EDT \nRepublicans in Ohio’s congressional delegation are scrambling for a way to undo President Obama’s renaming of the nation’s tallest mountain. \nTo be sure, it will be an uphill fight. \nGOP lawmakers from the Buckeye State blasted Obama’s decision to officially call the mountain Denali, a Native Alaskan word, instead of Mount McKinley, a tribute to former President William McKinley, who hailed from Ohio. \nAlaskans, led by Sen. Lisa Murkowski (R) have long pushed to change the name back to its longtime local moniker, but top Ohio lawmakers have resisted the change, looking to ensure their state’s native son remains associated with America’s highest peak. \n“This political stunt is insulting to all Ohioans,” Rep. Bob Gibbs (R-Ohio) said in a statement. “I will be working with the House Committee on Natural Resources to determine what can be done to prevent this action.” \nGibbs introduced a bill in January — as he has done in past sessions — to reaffirm the name Mount McKinley, a measure Congress originally approved in 1917. \nAn aide for Sen. Rob Portman (R-Ohio) said that “he and the Ohio delegation are exploring options” related to preserving the name, though nothing is imminent. Rep. Mike Turner (R-Ohio) added that, “the president’s recent actions to remove [McKinley’s] name and undermine a prior act of Congress is disrespectful, and I will continue to fight for proper recognition of President McKinley’s legacy.”And Speaker John Boehner (R-Ohio) put out a statement Monday morning saying he was “deeply disappointed in this decision,” though he didn’t offer any hint about what, if anything, might be done to stop it. Possible lines of attack could include using Gibbs’s bill or employing policy riders on appropriations legislation to prevent the use of federal dollars to implement the change. \nAny measure would need to block the U.S. Board on Geographic Names from renaming the summit, which Interior Secretary Sally Jewell ordered in a memo last week. \nJewell’s order cites a federal law giving the head of the Interior Department the power to change geological names around the country. Congress approved the law giving the Interior Department that power, so lawmakers would need to pass something undoing that in order to institute the name that they want, said Bill Jordan, the associate dean of academic affairs at the University of Akron School of Law. \nLawmakers, he said, could employ other “legislative shenanigans” to try preserving the name elsewhere, such as blocking funding for changing signage from McKinley to Denali.But ultimately, any attempt to undo the Denali decision will run into opposition from Republicans such as Alaska Sen. Dan Sullivan, Rep. Don Young and Murkowski, who put out a 25-second video, filmed in front of the mountain, thanking Obama for his order. The name of the peak has been a long-simmering issue for Alaskans, who have called the mountain Denali for generations. \nThe Alaskan government recognized the name Denali in 1975 and asked the Board on Geographic Names to do the same. \nHaving ordered the name to change, Obama is likely to veto any legislative attempts to undo that action. And even if such an effort managed to get that far, there’s probably not broad interest in waging a protracted political fight over the name of a mountain.“Ultimately it would require the override of a presidential veto, and it’s not going to get that far,” Jordan said. “There are only so many legislators in Ohio. They’re the only ones who care.”", "external_links": [], "published": "2015-09-01T00:48:00.000+03:00", "crawled": "2015-09-01T01:25:09.629+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}