{"organizations": [], "uuid": "b877874881f10a51ca8d09e6523a65939a34096a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/presidentobama_080515getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/252223-obama-orders-pay-raise-for-federal-workers-military", "country": "", "title": "Obama orders pay raise for military, fed workers | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama orders pay raise for military, fed workers | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T00:26:00.000+03:00", "replies_count": 0, "uuid": "b877874881f10a51ca8d09e6523a65939a34096a"}, "author": "", "url": "http://thehill.com/policy/finance/252223-obama-orders-pay-raise-for-federal-workers-military", "ord_in_thread": 0, "title": "Obama orders pay raise for military, fed workers | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rebecca Shabad", "Obama"], "text": "Obama orders pay raise for military, fed workers Getty Images By Rebecca Shabad - 08/28/15 04:52 PM EDT \nPresident Obama on Friday ordered a 1 percent across-the-board base pay increase for federal civilian workers and a 1.3 percent raise for members of the military in 2016. \nFor federal civilian workers, the president said he would decide by Nov. 30 whether to tack on locality payments that could potentially increase their pay raise to 1.3 percent. \nThe wage hikes will take effect on Jan. 1, unless Congress proposes an alternative pay plan. \nObama notified Capitol Hill about his decision in two separate letters sent to leadership on Friday afternoon. ADVERTISEMENT A spokeswoman at the Office of Management and Budget told The Hill that the initial 1 percent pay increase is the “first step toward implementing an aggregate 1.3 percent increase,” which Obama proposed in his budget blueprint earlier this year.\nObama does not need congressional approval for the pay raise to be implemented. \nCongress, however, can pass legislation to establish an alternative pay plan at any point. Democrats in the House and Senate earlier this year proposed a 3.8 percent federal pay raise, but it is not expected to pass muster in the GOP-controlled Congress. \nPart of Obama’s plan means a slightly higher pay raise than the 1 percent increase he ordered last December for federal workers in 2015. It’s the third time Obama has ordered a pay increase during his presidency. \nDuring his first term, the president froze pay raises due to the recession. ", "external_links": [], "published": "2015-08-29T00:26:00.000+03:00", "crawled": "2015-08-29T00:26:20.894+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}