{"organizations": ["Border Patrol", "Catholic Charities", "Fox News"], "uuid": "3ff1c84b49977f3f63ee10eeb566e68302ae9c61", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/overload%20immigration.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/08/22/rejecting-obama-administration-appeal-federal-judge-orders-release-children/", "country": "", "title": "Rejecting Obama administration's appeal, federal judge orders release of children from family detention centers by October | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Rejecting Obama administration's appeal, federal judge orders release of children from family detention centers by October | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T19:51:00.000+03:00", "replies_count": 0, "uuid": "3ff1c84b49977f3f63ee10eeb566e68302ae9c61"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/08/22/rejecting-obama-administration-appeal-federal-judge-orders-release-children/", "ord_in_thread": 0, "title": "Rejecting Obama administration's appeal, federal judge orders release of children from family detention centers by October | Fox News Latino", "locations": ["Honduras", "Texas", "McAllen"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gladys Pina", "Obama"], "text": "Rejecting Obama administration's appeal, federal judge orders release of children from family detention centers by October Published August 22, 2015 Fox News Latino In this April 30, 2105 photo, Gladys Pina, 30, from Honduras holds her 8-month old baby girl at a respite center run by Catholic Charities in McAllen, Texas. She was among nearly two-dozen immigrant mothers who arrived at the center after being released by Border Patrol. Rather than getting locked up in a family detention facility, some families are released by Border Patrol with notices to appear in immigration court. (AP Photo/Seth Robbins) \nSAN ANTONIO (AP) – A federal judge in California has ordered the government to release immigrant children from family detention centers \"without unnecessary delay,\" and with their mothers when possible, according to court papers. \nIn a filing late Friday, California U.S. District Judge Dolly Gee refused the government's request to reconsider her ruling in late July that children held in family detention centers after crossing the US-Mexico border illegally must be released rapidly. \nCalling the government's latest arguments \"repackaged and reheated,\" she found the U.S. Department of Homeland Security in breach of a longstanding legal agreement stipulating that immigrant children cannot be held in unlicensed secured facilities, and gave agency officials until October 23 to comply. \nLawyers for Homeland Security had asked the judge to reconsider her ruling, arguing that the agency was already doing its best to move families through detention quickly and that the facilities had been converted into short-term processing centers. \nAttorneys for the government are reviewing the order, said Nicole Navas, a spokeswoman for the Department of Justice, said Friday night. \nThis is the second time Gee has ruled that detaining children violates parts of a 1997 settlement from an earlier case. The settlement requires minors to be placed with a relative or in appropriate non-secure custody within five days. If there is a large influx of minors, times may be longer, but children still must be released as expeditiously as possible, under the terms of the law. \nIn her order, Gee countered that immigration officials \"routinely failed to proceed as expeditiously as possible to place accompanied minors, and in some instances, may still be unnecessarily dragging their feet now.\" \nPeter Schey, executive director of the Center for Human Rights and Constitutional Law, said that the court's order \"will protect refugee children and their mothers from lengthy and entirely senseless detention.\" \nThe government poured millions of dollars into two large detention centers in Texas after tens of thousands of immigrant families, mostly mothers with children from Central America, crossed the Rio Grande into the U.S. last summer. Many have petitioned for asylum after fleeing gang and domestic violence back home. \nThe centers in Karnes City and Dilley, both south of San Antonio, recently held more than 1,300 women and children combined. A third, smaller facility located in Berks County, Pennsylvania, held about 70 people. All three are overseen by U.S. Immigration and Customs Enforcement, but the two centers in Texas are run by private prison operators. \nBetween September 2013 and October 2014, some 68,000 family members — mostly mothers with children in tow — were caught at the border, according to U.S. Customs and Border Protection. Between last October and July of this year, less than 30,000 have been apprehended, a drop authorities say is a result of better enforcement in both the U.S. and Mexico. \nIn her order Friday, Gee challenged Homeland Security's claim that drastically limiting or ending its family detention policy could spark another surge in illegal border crossings, calling this \"speculative at best\" and \"fear-mongering.\" \nLike us on Facebook ", "external_links": [], "published": "2015-08-22T19:51:00.000+03:00", "crawled": "2015-08-22T19:51:34.510+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}