{"organizations": [], "uuid": "a5116b469eef17cff5e28884bd7c7a76aecb0e18", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/shelbyrichard_082114getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/252180-obama-gop-in-blame-game-over-financial-nominees", "country": "", "title": "Obama, GOP in blame game over financial nominees | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama, GOP in blame game over financial nominees | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T15:20:00.000+03:00", "replies_count": 0, "uuid": "a5116b469eef17cff5e28884bd7c7a76aecb0e18"}, "author": "", "url": "http://thehill.com/policy/finance/252180-obama-gop-in-blame-game-over-financial-nominees", "ord_in_thread": 0, "title": "Obama, GOP in blame game over financial nominees | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Peter Schroeder", "Obama"], "text": "Obama, GOP in blame game over financial nominees Getty Images By Peter Schroeder - 08/30/15 08:00 AM EDT \nAbout a dozen key financial oversight positions in the Obama administration are vacant amid growing fears that they won’t be filled until after President Obama leaves office. \nNo top regulatory position is open, but key spots are unfilled at the Securities and Exchange Commission, the Federal Reserve, the Commodity Futures Trading Commission and the Federal Deposit Insurance Commission. ADVERTISEMENT The situation isn’t expected to improve this fall as Congress seeks to prevent a government shutdown and the political world increasingly turns its attention to the 2016 election year.\n“Realistically, it’s very difficult to get people confirmed during a presidential election year,” said Dennis Kelleher, president and CEO of the Wall Street reform group Better Markets. “I think the administration is working hard, but frankly, they have to work harder and faster.” \nThe White House and Congress have traded blame for the inaction. \nObama has failed to offer nominees for four positions, including a Federal Reserve position created in 2010. \nDemocrats blame much of the backlog on Sen. Richard Shelby (R-Ala.), the chairman of the Senate Banking Committee. Eleven nominees in total are pending at Shelby’s panel. \nIn July, Democrats on the Senate Banking Committee sent a letter to Shelby, complaining that he had failed to hold a single nomination hearing since taking the panel’s gavel in January – the only panel not to have done so this Congress. \nThe openings come at a critical time, with financial regulators grappling to handle broad new responsibilities created by the Dodd-Frank financial reform law, including writing rules and enforcing new powers. Experts warn that while regulators can technically function while short-handed, it’s far from ideal. \n“Sometimes it means nothing happens and there’s a lack of action at the agency,” said Aaron Klein, director of the Financial Regulatory Reform Initiative at the Bipartisan Policy Center. “Other times it means that staff are unusually empowered to carry out their vision. \n“They’re deprived of new points of view. For those who believe in diversity of opinion as one of the goals of policy made by boards or groups, it can lead to less ideas being brought to the table,” he added. \n“It’s in everybody’s interests to have all the positions at these agencies filled with presidentially nominated and Senate-confirmed people. That’s the core of political accountability,” added Kelleher. \nMark Wetjen, a Democratic Commissioner at the Commodity Futures Trading Commission, stepped down from the derivatives regulator Friday, making him the latest in a string of high-profile vacancies among the Wall Street watchdogs. \nThat list includes two SEC commissioners (the outgoing commissioners, Republican Daniel Gallagher and Democrat Luis Aguilar, have agreed to stay in their positions until there are replacements), two open spots at the CFTC, two positions on the Federal Reserve Board, and a spot at the FDIC. \nObama has yet to name replacements at the SEC or CFTC, and also has yet to name a nominee for the FDIC’s open position. Obama never nominated a person to fill a vice chairman for supervision position at the Fed that was created by Dodd-Frank back in 2010. \nAccording to a nominee tracker created by the Bipartisan Policy Center, a spot for a Republican CFTC Commissioner has sat open without a nomination for over a year, and the position at the FDIC has been vacant for over two years. \nAmong the nominees pending with Shelby’s panel are Allan Lazard and Kathryn Dominguez, two nominees for positions at the Fed. Also on the docket is Adam Szubin, nominated to serve as under secretary for terrorism and financial crimes at the Treasury Department. \nShelby said he held off on Lazard’s January nomination because he was waiting for Obama to fill the second Fed spot. Dominguez was nominated in late July, days before lawmakers broke for the month-long August recess. \nThe Banking chairman has announced plans to hold a nomination hearing on Szubin when they return in September, but no further action has been scheduled yet. A Shelby spokesperson said the chairman intends to hold additional hearings at an undetermined date. \nThe Senate Finance Committee, which processes Treasury nominees among other tax-related government posts, has a docket of 13 nominees pending, and has moved just two since January. \nBut it’s not just Republicans creating headaches for Obama nominees. \nOne position awaiting a nominee, the under secretary for domestic finance at Treasury, once had an Obama pick in place. But the nomination of Antonio Weiss, formerly of the investment firm Lazard, led to a fierce pushback from liberal Democrats. \nLed by Sen. Elizabeth Warren (D-Mass.), they criticized Weiss’s extensive Wall Street experience, leading him to ultimately withdraw his name in January. Weiss has since taken on an advisory role at Treasury that does not require Senate confirmation, and the under secretary position has lingered open ever since. \nLiberals are also pushing Obama to lean left when it comes to filling an opening at the SEC left by the outgoing Aguilar. That leaves the president trying to thread a needle by finding a nominee that can be confirmed by a GOP-led Senate while not inflaming the left. \nThere is hope for quick action on nominees, however. The spots at the SEC and CFTC require one Democrat and Republican apiece, and moving the nominees as a pair could speed the process. And the ball could begin rolling soon for the Fed nominees. \nBut the window is narrow, as Republicans will grow less likely to consider Obama nominees for spots as he enters lame duck status in 2016. \n“The window extends through certainly this calendar year. How far into 2016 the window extends depends on a lot of factors,” said Klein. \n", "external_links": [], "published": "2015-08-30T15:20:00.000+03:00", "crawled": "2015-08-30T15:20:42.024+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}