{"organizations": ["Congress", "U.S. Coast Guard", "Facebook", "Fox News Obama", "Twitter"], "uuid": "13aada707e69034a3666918cf33c5e01f3f1017b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/feeds/Associated%20Press/2014/11/11/0/0/California%20Last%20Arctic%20Icebreaker-2.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/01/obama-to-propose-building-new-icebreakers-to-protect-us-interests-in-arctic/", "country": "", "title": "Obama to propose building of new icebreakers to protect US interests in Arctic | Fox News", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama to propose building of new icebreakers to protect US interests in Arctic | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "13aada707e69034a3666918cf33c5e01f3f1017b"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/01/obama-to-propose-building-new-icebreakers-to-protect-us-interests-in-arctic/", "ord_in_thread": 0, "title": "Obama to propose building of new icebreakers to protect US interests in Arctic | Fox News", "locations": ["US", "U.S.", "Seattle", "Russia", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama to propose building of new icebreakers to protect US interests in Arctic Published September 01, 2015 Facebook 0 Twitter 0 livefyre Email Print FILE - In this March 10, 2010, file photo, a 25-foot harbor patrol boat passes by the 399-foot U.S. Coast Guard icebreaker Polar Star as it sits moored at a dock in Seattle. While Russia and China have dozens of icebreakers, opposition in Congress to funding means the U.S. has just one heavy-duty one, already a decade past its decommissioning date. (AP Photo/Elaine Thompson, File) (The Associated Press) \nPresident Obama will ask Congress Tuesday to speed up the construction of new icebreaker ships in order to protect U.S. interests and resources in the Arctic, amid growing concern that the U.S. has ceded influence to Russia in the strategic waters. \nThe proposals will be made on the second day of Obama's three-day trip to Alaska, during which the president has focused largely on climate change. The president's agenda called for him to travel to Seward, Alaska, where he planned to hike to Exit Glacier and tour Kenai Fjords National Park by boat. \nConcerns about Russia's activities in the Arctic have grown after Moscow submitted a claim to the United Nations Aug. 5 for 463,000 square miles of the Arctic sea shelf, extending more than 350 nautical miles from the country's shore. The Arctic is believed to hold up to 25 percent of the world's untapped oil and gas supplies, and the U.S., Russia, and Canada are among the nations trying to assert their jurisdiction over the region. \nDespite the immense stakes, the Obama administration acknowledged in a fact sheet about the president's proposal that the U.S. Coast Guard's icebreaker fleet is inadequate to handle a possible challenge from Moscow. Currently, the U.S. has just two working icebreakers, compared to Russia's 40. The New York Times, citing a White House fact sheet, said that Obama would also push up the expected acquisition date for a new icebreaker to 2020 from 2022. \nAlaskan lawmakers had previously described the Obama administration's response to Russia's Arctic claim as a \"strategic blunder.\" \n\"Meanwhile, in the face of this Russian military buildup, we are significantly reducing Army forces in our nation’s only Arctic state,\" Sen. Dan Sullivan, R-Alaska told FoxNews.com earlier this month . \"Right now, the Russians are playing chess in the Arctic and our Administration still seems to think it’s tic-tac-toe.\" \nAlaska Gov. Bill Walker also noted Russia's ongoing military buildup, telling the Times Monday, \"They’re reopening 10 bases and building four more, and they’re all in the Arctic, so here we are in the middle of the pond, feeling a little bit uncomfortable.\" \nIn addition to building and restoring military bases, the Russian military has also conducted large-scale military exercises involving tens of thousands of troops, dozens of ships and submarines, and over 100 aircraft. \nThe Associated Press contributed to this report. ", "external_links": [], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-01T16:30:39.510+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}