{"organizations": ["Obama Effort To Reduce Power Plant Emissions Seems", "Obama Effort To Reduce Power Plant Emissions Jeb Bush Energy"], "uuid": "bf528f84e0204fc0e490e054487ed28b0a633a57", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/560ab0fd1800002a0083130a.jpeg?cache=1gdAeQGofM", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/jeb-bush-energy-plan_560ab077e4b0af3706dde86a", "country": "", "title": "Jeb Bush Energy Plan Takes Aim At Obama Effort To Reduce Power Plant Emissions", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Jeb Bush Energy Plan Takes Aim At Obama Effort To Reduce Power Plant Emissions", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T21:26:00.000+03:00", "replies_count": 0, "uuid": "bf528f84e0204fc0e490e054487ed28b0a633a57"}, "author": "", "url": "http://www.huffingtonpost.com/entry/jeb-bush-energy-plan_560ab077e4b0af3706dde86a", "ord_in_thread": 0, "title": "Jeb Bush Energy Plan Takes Aim At Obama Effort To Reduce Power Plant Emissions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush", "Steve Holland"], "text": "Jeb Bush Energy Plan Takes Aim At Obama Effort To Reduce Power Plant Emissions Seems like a good start toward fighting climate change. By Steve Holland Posted: 09/29/2015 11:49 AM EDT | Edited: 2 hours ago \nRepublican U.S. presidential candidate Jeb Bush will lay out energy policy proposals on Tuesday that seek to spur job growth and take aim at President Barack Obama's plan to limit carbon emissions from power plants. \nIn a speech at Rice Energy Inc., in Canonsburg, Pennsylvania, Bush will give yet another detailed policy speech on what he would try to accomplish if elected president in November 2016. \nIt is part of an extended campaign approach by the former Florida governor to present himself as a conservative policy heavyweight as he attempts to make up ground to Donald Trump, who has been leading in opinion polls ahead of the Republican presidential nomination. \nIn details of his plan released by his campaign, Bush will call for lifting a U.S. ban on crude oil exports and lift restrictions on natural gas exports that have made it harder to export energy to countries like Japan, China and the European Union. \nLifting the ban, Bush said in a Medium post published on Tuesday, would create \"hundreds of thousands of additional jobs and significantly lower net energy costs within two years.\" \nBush will vow to fight Obama's plan, released last month, that would force U.S. power plants to reduce carbon emissions as part of an effort to attack climate change. \nThe White House plan would order power plants to cut carbon emissions 32 percent from 2005 levels by 2030. The aim is to encourage an aggressive shift toward renewable energy and away from coal-fired electricity, pushing utilities to invest even more heavily in wind and solar energy. \nIndustry groups and some lawmakers from states that have relied on coal-based energy have vowed to challenge the new requirements in the courts and through Congress. \nBush said in his post that the Obama plan \"needs to be stopped in its tracks\" and that any federal rules that would suppress domestic energy production and raise energy prices should be addressed by the next president. \nBush will also vow to approve the Keystone Xl pipeline, the Canada-to-Texas pipeline that the Obama administration has been reviewing for years without approving it. Democrat Hillary Clinton, who is seeking her party's nomination for president, has said she opposes the pipeline. \nBush has vowed to pursue policies that would lead to 4 percent annual economic growth, and his energy plan is part of that platform. \nAlso on HuffPost: ", "external_links": [], "published": "2015-09-29T21:26:00.000+03:00", "crawled": "2015-09-29T21:26:57.439+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}