{"organizations": ["Muslim"], "uuid": "8d9bb84c2896de7dd383c476b26a4e563813b65c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/scalefit_1200_noupscale/55fed47420000026002429ec.jpeg?cache=kdczsDZHuI", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/trump-obama-muslim_55fed420e4b0fde8b0ce9ef2", "country": "", "title": "Trump Refuses To Accept That Obama Was Born In U.S., Is Not Muslim", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Trump Refuses To Accept That Obama Was Born In U.S., Is Not Muslim", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T20:36:00.000+03:00", "replies_count": 0, "uuid": "8d9bb84c2896de7dd383c476b26a4e563813b65c"}, "author": "", "url": "http://www.huffingtonpost.com/entry/trump-obama-muslim_55fed420e4b0fde8b0ce9ef2", "ord_in_thread": 0, "title": "Trump Refuses To Accept That Obama Was Born In U.S., Is Not Muslim", "locations": ["U.S.", "Muslim Americans", "Hawaii"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nick Visser", "Trump", "Barack Obama", "Donald Trump", "Muslim", "Todd", "Huffington", "Obama"], "text": "Trump Refuses To Accept That Obama Was Born In U.S., Is Not Muslim The master of spin is at it again. Nick Visser Reporter, The Huffington Post Posted: 09/20/2015 01:27 PM EDT Anadolu Agency/Getty Images Trump has been actively addressing controversy following an awkward campaign interaction last week. Donald Trump still won't acknowledge President Barack Obama was born in the U.S. and insinuated on Sunday that the country has already had its first Muslim president. The real estate mogul called in to \"Meet The Press\" Sunday morning to address the ongoing controversy that followed his lack of response after a supporter asked Trump how he would address \"a problem in this country ... called Muslims.\" Host Chuck Todd used the line of question to turn to another tea party stumping point: that the president isn't a U.S. citizen. Trump refused to share his current views on the factually inaccurate sentiment, instead telling Todd he just doesn't like talking about it and \"won't talk about it.\" \"I just don't discuss it,\" the candidate said. \"Really, it hasn't been brought up in a long time.\" Ironically, Trump is actually one of the forefathers of the Obama birther conspiracy. He made headlines in 2011 after persistently demanding to see the president's birth certificate while raising doubts over Obama's birthplace in Hawaii. Even after the White House released an official copy of the document, Trump questioned its authenticity . Sunday's exchange comes just days after Trump ignited controversy by nodding along at a campaign event while a supporter linked the notion that the president was Muslim with his belief that all Muslims \"have training camps growing where they want to kill us.\" Todd also asked Trump how he'd feel should a Muslim president actually be elected down the road -- not a far-fetched idea, as the population of Muslim Americans is expected to surpass 6.2 million by 2030. Trump's response wasn't terribly shocking. \"W ould I be comfortable? I don’t know if we have to address it right now,\" he said. \"But I think it is certainly something that could happen.\" Todd reiterated his question before Trump interrupted: \"I mean, some people have said it already happened, frankly,\" Trump said, presumably referring to Obama. \"But of course you wouldn’t agree with that.\" Todd continued to press Trump on whether he believed Obama was Christian but the candidate said he didn't \"talk about people's faith\" and added that he was \"willing to take [the president] at his word.\" Despite his reluctance to address an individual's faith, the candidate made a point to note that he \"love[s] the Muslims\" and thinks \"they're great people\" during a stop at a high school homecoming Saturday night. He gave Todd a similar one-liner before reversing himself to say he believes there is, in fact, a problem there. \"I feel strongly that Muslims are excellent. I know so many Muslims that are such fabulous people,\" he told Todd. \"But there is a problem. I mean, there's no question about it. And we can be politically correct and we can say there is no problem whatsoever. But the fact is there is a problem with some. And it's a very severe problem.\" Also on HuffPost: 9 Outrageous Things Donald Trump Has Said About Latinos of ", "external_links": [], "published": "2015-09-20T20:36:00.000+03:00", "crawled": "2015-09-20T20:36:58.889+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}