{"organizations": ["Fox News Latino Obama"], "uuid": "3fd29fc0d0028308039d8aac45bfb8b8556eb0fc", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Castro%20Obama%20to%20meet%20Latino.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/29/pres-obama-and-cuba-raul-castro-to-meet-for-second-time-this-year/", "country": "", "title": "Obama and Cuban President Raúl Castro to meet for second time this year | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama and Cuban President Raúl Castro to meet for second time this year | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T16:45:00.000+03:00", "replies_count": 0, "uuid": "3fd29fc0d0028308039d8aac45bfb8b8556eb0fc"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/29/pres-obama-and-cuba-raul-castro-to-meet-for-second-time-this-year/", "ord_in_thread": 0, "title": "Obama and Cuban President Raúl Castro to meet for second time this year | Fox News Latino", "locations": ["Borgia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Castro", "Barack Obama", "Raúl Castro", "Obama"], "text": "Obama and Cuban President Raúl Castro to meet for second time this year Published September 29, 2015 Fox News Latino Raúl Castro (left) and Barack Obama. The two world leaders were expected to meet on Tuesday. (Photos: Castro, AP Photo/Gregorio Borgia; Obama, Spencer Platt/Getty Images) \nNEW YORK (AP) – Making good on a pledge to change U.S. posture toward Cuba, President Barack Obama is poised to hold talks with Cuban President Raúl Castro for the second time this year. \nThe meeting is scheduled to take place Tuesday on the sidelines of the annual gathering of world leaders at the United Nations. Castro is attending for the first time. \nThe encounter comes as the Cold War adversaries go about the long and complex process of normalizing relations following decades of animosity. The U.S. recently eased rules for citizens who want to visit or do business in Cuba, a step aimed at fostering greater economic freedom on the island. \nBoth leaders surprised the world last December by announcing they had agreed to restore diplomatic relations. \nSince then, the two countries have reopened embassies in each other's capitals. But sharp differences remain, particularly over Cuba's human rights record and detainment of political prisoners. Both sides want Congress to lift a longstanding economic embargo against the communist island nation, but many Republican lawmakers and some Democrats want to keep it in place. \nCuba also seeks the return of land occupied by the U.S. Navy base at Guantanamo Bay; the U.S. says that is not in the plan. \nIn his address Monday at the opening of the U.N. General Assembly's annual ministerial meeting, Obama discussed the shift in policy toward Cuba and said he was confident that Congress \"will inevitably lift an embargo that should not be in place anymore.\" \nBen Rhodes, a deputy national security adviser for Obama, said Castro's presence at the U.N. gathering is a signal \"that we're in a new era.\" \nObama and Castro first spoke in December after the secret process to restore diplomatic relations was revealed. \nThey met in person in April while attending a regional summit in Panama. Before then, the last time a U.S. and Cuban leader had convened a substantive meeting was in 1958. \nObama and Castro spoke by telephone again earlier this month before Pope Francis visited Cuba and the United States. \nFrancis was a go-between for the U.S. and Cuba during their secret talks. \nLike us on Facebook ", "external_links": [], "published": "2015-09-29T16:45:00.000+03:00", "crawled": "2015-09-29T16:46:43.150+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}