{"organizations": [], "uuid": "396bfe471bc757d6d6891e9d19fd3aa54234e1c6", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/lifestyle/2015/09/25/michelle-obama-china-1st-lady-name-panda-at-washington-zoo/", "country": "IL", "title": "Michelle Obama, China's 1st lady name panda at Washington zoo", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Michelle Obama, China's 1st lady name panda at Washington zoo | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "396bfe471bc757d6d6891e9d19fd3aa54234e1c6"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/lifestyle/2015/09/25/michelle-obama-china-1st-lady-name-panda-at-washington-zoo/", "ord_in_thread": 0, "title": "Michelle Obama, China's 1st lady name panda at Washington zoo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  EFE The first lady of the United States, Michelle Obama, and her Chinese counterpart, Peng Liyuan, on Friday gave the name Bei Bei to the giant panda cub that was born a month ago at Washington's National Zoo, in an act symbolic of the two countries' collaboration in preserving this endangered species.\nDuring the state visit of Chinese President Xi Jinping, and while he was meeting at the White House with U.S. President Barack Obama, the two first ladies went to the National Zoo in Washington to visit the giant pandas.\nThere they announced that together they had chosen the name Bei Bei, which means \"precious treasure,\" for the panda cub that the giant panda Mei Xiang had on Aug. 22, and which has become something of a sensation at the zoo park.\n\"Michelle once said that the giant panda exemplifies the common bond between China and the United States. That's a lot of responsibility for a cute animal like the giant pandas,\" China's first lady said during the announcement.\nThe natural habitat of giant panda bears is in the mountains and leafy bamboo forests of central China, where an estimated 1,600 specimens still survive. Another 300 are distributed among different zoos around the world.\nThe two first ladies made their joint announcement to a group of some 15 preschoolers from Yu-Ying Public School in Washington, which specializes in immersion courses in the Chinese language. The kids marked the occasion by singing a song in that oriental language.\nObama told the students she was sure they will become global citizens and \"share ideas\" with the rest of the world, while noting that both countries have hopes that 1 million students in the U.S. will learn Mandarin Chinese by the year 2020.\nThe cub named on Friday is one of two baby bears born in August to Mei Xiang, a 17-year-old panda and touristic icon of the capital.\nOne of the two cubs died four days after it was born, whereas Bei Bei continues to grow stronger and lives with its mother and another two pandas, sister Bao Bao and dad Tian Tian, in the zoo's artificial habitat. EFE", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-26T06:09:27.463+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}