{"organizations": [], "uuid": "e8e9dbd7797564281baccc0f357d5896c722842a", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150902123443-marco-rubio-barack-obama-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/02/politics/marco-rubio-energy-policy-speech-obama/index.html", "country": "US", "title": "Marco Rubio jabs at Obama in energy policy talk", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Marco Rubio jabs at Obama in energy policy talk - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "e8e9dbd7797564281baccc0f357d5896c722842a"}, "author": "Tal Kopan", "url": "http://www.cnn.com/2015/09/02/politics/marco-rubio-energy-policy-speech-obama/index.html", "ord_in_thread": 0, "title": "Marco Rubio jabs at Obama in energy policy talk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights The Florida senator on Wednesday will deliver a speech on energy in Oklahoma City. Rubio's plan will focus on removing federal energy regulations and on boosting the domestic energy business. Washington (CNN) As President Barack Obama highlights climate change and his energy agenda in Alaska this week, Marco Rubio, a Republican hoping to take his place, is using the opportunity to ding the President to spotlight his own energy policy ideas in the Midwest.\nThe Florida senator on Wednesday will give a speech on energy in Oklahoma City, and he previewed his message with an op-ed published Tuesday evening in the National Review.\nHe wrote about \"new and exciting possibilities\" in energy production in the U.S., including fracking, and took a shot at Obama in the process.\n\"This week, President Obama traveled to Alaska to talk not about seizing our energy potential, but about limiting that potential through environmental policies that grow government and raise costs,\" Rubio wrote. \"I believe this is an outrageous misalignment of priorities.\"\nObama traveled to Alaska this week to talk about the dangers of climate change, using a tour of a glacier to make the case for global warming and show the shrinking of the glaciers.\nRELATED: Boat tour frame's Obama's climate message\nRubio's plan will focus on removing federal energy regulations, he wrote, and on boosting the domestic energy business. He pledges to lift the crude oil export ban that prevents U.S. businesses from exporting oil overseas; to stop the Environmental Protection Agency's Clean Power Plan that the administration announced in August to reduce carbon emissions from power plants; and to turn over energy regulation to the states.\nThe latter two proposals are traditional conservative policies for transferring regulatory power from the federal government to the states and scaling back the EPA, but Rubio's first proposal is actually picking up some bipartisan steam in Washington. The administration's own Energy Information Administration released a report Wednesday found that easing restrictions on crude oil exports may actually lower gas prices domestically.\nRubio will hammer the message home in his speech Wednesday, according to excerpts released by his campaign -- and he'll expand his attacks to include the Democratic presidential front-runner Hillary Clinton.\n\"America's energy future must be entrusted to our businesses and scientists, not our bureaucrats,\" Rubio will say. \"And finding ways to empower our energy producers to capture our energy potential should be a priority for every presidential candidate. Unfortunately, what we hear from Hillary Clinton are more of the same ideas from yesterday -- and that's when she speaks up on the issue at all. For the most part, she resorts to empty rhetoric that refuses to chart much of a course in either direction.\"\nOn the trail, Rubio has avoided most of the party in-fighting that has gripped front-runners Donald Trump and former Florida Gov. Jeb Bush, focusing on rolling out wonky policy speeches. Last week, he focused on foreign policy and China.\nFollow @CNNpolitics", "external_links": ["http://www.nationalreview.com/article/423403/securing-americas-energy-future", "http://199.36.140.204/todayinenergy/detail.cfm?id=22772", "https://twitter.com/CNNpolitics"], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T21:39:19.833+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}