{"organizations": [], "uuid": "586db328a575cad6adbd3581b77d75bcd3e6b37b", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/28/world/obama-isis-stalemate/index.html", "country": "", "title": "Obama vs. ISIS = stalemate? - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama vs. ISIS = stalemate? - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "586db328a575cad6adbd3581b77d75bcd3e6b37b"}, "author": "", "url": "http://www.cnn.com/2015/09/28/world/obama-isis-stalemate/index.html", "ord_in_thread": 0, "title": "Obama vs. ISIS = stalemate? - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama vs. ISIS = stalemate? By Peter Bergen , CNN National Security Analyst Updated 1315 GMT (2015 HKT) September 28, 2015 56 photos: The ISIS terror threat Smoke rises above a damaged building following a U.S.-led coalition airstrike against ISIS positions during a military operation to regain control of the eastern suburbs of Ramadi, Iraq, on Saturday, August 15. Hide Caption 1 of 56 56 photos: The ISIS terror threat Iraqi men look at the damage following a bomb explosion that targeted a vegetable market in Baghdad's northern Shiite district of Sadr City on Thursday, August 13. ISIS claimed responsibility for the attack. Hide Caption 2 of 56 56 photos: The ISIS terror threat In this image taken from social media, an ISIS fighter holds the group's flag as he stands on a purportedly captured tank after the militant group overran the Syrian town of al-Qaryatayn on Thursday, August 6, the London-based Syrian Observatory for Human Rights reported. Hide Caption 56 photos: The ISIS terror threat An ISIS fighter poses with spoils purportedly taken after capturing the Syrian town. Hide Caption 4 of 56 56 photos: The ISIS terror threat Smoke rises as Iraqi security forces bomb ISIS positions in the eastern suburbs of Ramadi, Iraq, on August 6. The city fell in May to ISIS, a militant group that wants to create an Islamic state across Sunni areas of Iraq and Syria. ISIS has also claimed responsibility for attacks in other countries in the Middle East. Hide Caption 5 of 56 56 photos: The ISIS terror threat Buildings reduced to piles of debris can be seen in the eastern suburbs of Ramadi on August 6. Hide Caption 6 of 56 56 photos: The ISIS terror threat The governor of the Asir region in Saudi Arabia, Prince Faisal bin Khaled bin Abdulaziz, left, visits a man who was wounded in a suicide bombing attack on a mosque in Abha, Saudi Arabia, on August 6. ISIS claimed responsibility for the explosion, which killed at least 13 people and injured nine others. Hide Caption 56 photos: The ISIS terror threat Saudi officials and investigators check the inside of the mosque on August 6. Hide Caption 8 of 56 56 photos: The ISIS terror threat Mourners in Gaziantep, Turkey, grieve over a coffin Tuesday, July 21, during a funeral ceremony for the victims of a suspected ISIS suicide bomb attack. That bombing killed at least 31 people in Suruc, a Turkish town that borders Syria. Turkish authorities blamed ISIS for the attack. Hide Caption 9 of 56 56 photos: The ISIS terror threat Protesters in Istanbul carry anti-ISIS banners and flags to show support for victims of the Suruc suicide blast during a demonstration on Monday, July 20. Hide Caption 10 of 56 56 photos: The ISIS terror threat People in Ashmoun, Egypt, carry the coffin for 1st Lt. Mohammed Ashraf, who was killed when the ISIS militant group attacked Egyptian military checkpoints on Wednesday, July 1. At least 17 soldiers were reportedly killed, and 30 were injured. Hide Caption 11 of 56 56 photos: The ISIS terror threat Syrians wait near the Turkish border during clashes between ISIS and Kurdish armed groups in Kobani, Syria, on Thursday, June 25. The photo was taken in Sanliurfa, Turkey. ISIS militants disguised as Kurdish security forces infiltrated Kobani on Thursday and killed \"many civilians,\" said a spokesman for the Kurds in Kobani. Hide Caption 12 of 56 56 photos: The ISIS terror threat Residents examine a damaged mosque after an Iraqi Air Force bombing in the ISIS-seized city of Falluja, Iraq, on Sunday, May 31. At least six were killed and nine others wounded during the bombing. Hide Caption 13 of 56 56 photos: The ISIS terror threat People search through debris after an explosion at a Shiite mosque in Qatif, Saudi Arabia, on Friday, May 22. ISIS claimed responsibility for the attack, according to tweets from ISIS supporters, which included a formal statement from ISIS detailing the operation. Hide Caption 14 of 56 56 photos: The ISIS terror threat Iraqi soldiers fire their weapons toward ISIS group positions in the Garma district, west of the Iraqi capital of Baghdad, on Sunday, April 26. Pro-government forces said they had recently made advances on areas held by Islamist jihadists. Hide Caption 15 of 56 56 photos: The ISIS terror threat A member of Afghanistan's security forces stands at the site where a suicide bomber on a motorbike blew himself up in front of the Kabul Bank in Jalalabad, Afghanistan, on Saturday, April 18. ISIS claimed responsibility for the attack. The explosion killed at least 33 people and injured more than 100 others, a public health spokesman said. Hide Caption 56 photos: The ISIS terror threat Iraqi counterterrorism forces patrol in Ramadi on April 18. Hide Caption 17 of 56 56 photos: The ISIS terror threat Thousands of Iraqis cross a bridge over the Euphrates River to Baghdad as they flee Ramadi on Friday, April 17. Hide Caption 18 of 56 56 photos: The ISIS terror threat Yazidis embrace after being released by ISIS south of Kirkuk, Iraq, on Wednesday, April 8. ISIS released more than 200 Yazidis , a minority group whose members were killed, captured and displaced when the Islamist terror organization overtook their towns in northern Iraq last summer, officials said. Hide Caption 19 of 56 56 photos: The ISIS terror threat Kurdish Peshmerga forces help Yazidis as they arrive at a medical center in Altun Kupri, Iraq, on April 8. Hide Caption 20 of 56 56 photos: The ISIS terror threat A Yazidi woman mourns for the death of her husband and children by ISIS after being released south of Kirkuk on April 8. Hide Caption 21 of 56 56 photos: The ISIS terror threat People in Tikrit inspect what used to be a palace of former President Saddam Hussein on April 3. Hide Caption 22 of 56 56 photos: The ISIS terror threat On April 1, Shiite militiamen celebrate the retaking of Tikrit, which had been under ISIS control since June. The push into Tikrit came days after U.S.-led airstrikes targeted ISIS bases around the city. Hide Caption 56 photos: The ISIS terror threat Iraqi security forces launch a rocket against ISIS positions in Tikrit on Monday, March 30. Hide Caption 24 of 56 56 photos: The ISIS terror threat The parents of 19-year-old Mohammed Musallam react at the family's home in the East Jerusalem Jewish settlement of Neve Yaakov on Tuesday, March 10. ISIS released a video purportedly showing a young boy executing Musallam, an Israeli citizen of Palestinian descent who ISIS claimed infiltrated the group in Syria to spy for the Jewish state. Musallam's family told CNN that he had no ties with the Mossad, Israel's spy agency, and had, in fact, been recruited by ISIS. Hide Caption 25 of 56 56 photos: The ISIS terror threat Iraqi Shiite fighters cover their ears as a rocket is launched during a clash with ISIS militants in the town of Al-Alam, Iraq, on Monday, March 9. Hide Caption 26 of 56 56 photos: The ISIS terror threat Displaced Assyrian women who fled their homes due to ISIS attacks pray at a church on the outskirts of Damascus, Syria, on Sunday, March 1. ISIS militants abducted at least 220 Assyrians in Syria. Hide Caption 27 of 56 56 photos: The ISIS terror threat Safi al-Kasasbeh, right, receives condolences from tribal leaders at his home village near Karak, Jordan, on Wednesday, February 4. Al-Kasasbeh's son, Jordanian pilot Moath al-Kasasbeh, was burned alive in a video that was recently released by ISIS militants. Jordan is one of a handful of Middle Eastern nations taking part in the U.S.-led military coalition against ISIS. Hide Caption 28 of 56 56 photos: The ISIS terror threat A Kurdish marksman looks over a destroyed area of Kobani on Friday, January 30, after the city had been liberated from the ISIS militant group. The Syrian city, also known as Ayn al-Arab, had been under assault by ISIS since mid-September. Hide Caption 29 of 56 56 photos: The ISIS terror threat Kurdish people celebrate in Suruc, Turkey, near the Turkish-Syrian border, after ISIS militants were expelled from Kobani on Tuesday, January 27. Hide Caption 30 of 56 56 photos: The ISIS terror threat Collapsed buildings are seen in Kobani on January 27 after Kurdish forces took control of the town from ISIS. Hide Caption 31 of 56 56 photos: The ISIS terror threat Junko Ishido, mother of Japanese journalist Kenji Goto, reacts during a news conference in Tokyo on Friday, January 23. ISIS would later kill Goto and another Japanese hostage, Haruna Yukawa. Hide Caption 32 of 56 56 photos: The ISIS terror threat ISIS militants are seen through a rifle's scope during clashes with Peshmerga fighters in Mosul, Iraq, on Wednesday, January 21. Hide Caption 33 of 56 56 photos: The ISIS terror threat An elderly Yazidi man arrives in Kirkuk after being released by ISIS on Saturday, January 17. The militant group released about 200 Yazidis who were held captive for five months in Iraq. Almost all of the freed prisoners were in poor health and bore signs of abuse and neglect, Kurdish officials said. Hide Caption 34 of 56 56 photos: The ISIS terror threat Smoke billows behind an ISIS sign during an Iraqi military operation to regain control of the town of Sadiyah, about 95 kilometers (60 miles) north of Baghdad, on Tuesday, November 25. Hide Caption 35 of 56 56 photos: The ISIS terror threat Fighters from the Free Syrian Army and the Kurdish People's Protection Units join forces to fight ISIS in Kobani on Wednesday, November 19. Hide Caption 36 of 56 56 photos: The ISIS terror threat A picture taken from Turkey shows smoke rising after ISIS militants fired mortar shells toward an area controlled by Syrian Kurdish fighters near Kobani on Monday, November 3. Hide Caption 37 of 56 56 photos: The ISIS terror threat Iraqi special forces search a house in Jurf al-Sakhar, Iraq, on Thursday, October 30, after retaking the area from ISIS. Hide Caption 38 of 56 56 photos: The ISIS terror threat ISIS militants stand near the site of an airstrike near the Turkey-Syria border on Thursday, October 23. The United States and several Arab nations have been bombing ISIS targets in Syria to take out the militant group's ability to command, train and resupply its fighters. Hide Caption 39 of 56 56 photos: The ISIS terror threat Kurdish fighters walk to positions as they combat ISIS forces in Kobani on Sunday, October 19. Hide Caption 56 photos: The ISIS terror threat Heavy smoke rises in Kobani following an airstrike by the U.S.-led coalition on October 18. Hide Caption 41 of 56 56 photos: The ISIS terror threat Cundi Minaz, a female Kurdish fighter, is buried in a cemetery in the southeastern Turkish town of Suruc on Tuesday, October 14. Minaz was reportedly killed during clashes with ISIS militants in nearby Kobani. Hide Caption 42 of 56 56 photos: The ISIS terror threat Kiymet Ergun, a Syrian Kurd, celebrates in Mursitpinar, Turkey, after an airstrike by the U.S.-led coalition in Kobani on Monday, October 13. Hide Caption 43 of 56 56 photos: The ISIS terror threat Alleged ISIS militants stand next to an ISIS flag atop a hill in Kobani on Monday, October 6. Hide Caption 44 of 56 56 photos: The ISIS terror threat A Kurdish Peshmerga soldier who was wounded in a battle with ISIS is wheeled to the Zakho Emergency Hospital in Duhuk, Iraq, on Tuesday, September 30. Hide Caption 45 of 56 56 photos: The ISIS terror threat Syrian Kurds wait near a border crossing in Suruc as they wait to return to their homes in Kobani on Sunday, September 28. Hide Caption 46 of 56 56 photos: The ISIS terror threat A elderly man is carried after crossing the Syria-Turkey border near Suruc on Saturday, September 20. Hide Caption 47 of 56 56 photos: The ISIS terror threat A Kurdish Peshmerga fighter launches mortar shells toward ISIS militants in Zumar, Iraq, on Monday, September 15. Hide Caption 48 of 56 56 photos: The ISIS terror threat Kurdish Peshmerga fighters fire at ISIS militant positions from their position on the top of Mount Zardak, east of Mosul, Iraq, on Tuesday, September 9. Hide Caption 49 of 56 56 photos: The ISIS terror threat Displaced Iraqis receive clothes from a charity at a refugee camp near Feeshkhabour, Iraq, on Tuesday, August 19. Hide Caption 50 of 56 56 photos: The ISIS terror threat Aziza Hamid, a 15-year-old Iraqi girl, cries for her father while she and some other Yazidi people are flown to safety Monday, August 11, after a dramatic rescue operation at Iraq's Mount Sinjar. A CNN crew was on the flight, which took diapers, milk, water and food to the site where as many as 70,000 people were trapped by ISIS. But only a few of them were able to fly back on the helicopter with the Iraqi Air Force and Kurdish Peshmerga fighters. Hide Caption 51 of 56 56 photos: The ISIS terror threat Thousands of Yazidis are escorted to safety by Kurdish Peshmerga forces and a People's Protection Unit in Mosul on Saturday, August 9. Hide Caption 52 of 56 56 photos: The ISIS terror threat Thousands of Yazidi and Christian people flee Mosul on Wednesday, August 6, after the latest wave of ISIS advances. Hide Caption 53 of 56 56 photos: The ISIS terror threat A Baiji oil refinery burns after an alleged ISIS attack in northern Selahaddin, Iraq, on Thursday, July 31. Hide Caption 54 of 56 56 photos: The ISIS terror threat A Syrian rebel fighter lies on a stretcher at a makeshift hospital in Douma, Syria, on Wednesday, July 9. He was reportedly injured while fighting ISIS militants. Hide Caption 55 of 56 56 photos: The ISIS terror threat Children stand next to a burnt vehicle during clashes between Iraqi security forces and ISIS militants in Mosul on Tuesday, June 10. Hide Caption Story highlights President Barack Obama will meet with key leader of nations involved in effort against ISIS Top administration officials paint a mixed picture of how the fight against ISIS has gone so far Peter Bergen is CNN's national security analyst, vice president at New America and a professor of practice at Arizona State University. He is the author of \"Manhunt: The Ten-Year Search for bin Laden -- From 9/11 to Abbottabad.\" (CNN) On Tuesday, President Barack Obama will meet in New York with the leaders of dozens of countries who are involved in the fight against ISIS in some manner to assess how that campaign is going. So what is the state of play more than a year into the campaign against the terrorist army? Earlier this month, Gen. Martin Dempsey, outoing chairman of the Joint Chiefs of Staff, said that the war is \"tactically stalemated\" and there are no \"dramatic gains on either side.\" France launches its first airstrikes against ISIS in Syria Indeed, in early 2015, ISIS retreated from the town of Kobani on the Syrian-Turkish border and in March the group lost the Iraqi city of Tikrit. But a month later, ISIS seized the city of Ramadi in western Iraq as well as the town of Palmyra in Syria. ISIS, in short, isn't winning, nor is it really losing. This is despite the more than 7,000 airstrikes aimed at the terrorist army in the past year or so. How top officials see the situation Ahead of the ISIS summit in New York, four senior administration officials spoke with half a dozen reporters, including myself, to give their views of the campaign. Deputy Secretary of State Tony Blinken conceded, with some understatement, that the train- and-equip program of Syrian fighters to fight ISIS is \"not where we want it to be.\" The $500 million program to train more than 5,000 rebel fighters has trained only 125 fighters in the past year, and some of those fighters have given up their weapons to al Qaeda's Syrian affiliate . Blinken, however, compared how ISIS is faring today with where it was a year ago when the Iraqi cities of Erbil and Kirkuk were threatened by the group as well as Baghdad. Blinken asserted that as a result of the US-led campaign against ISIS, its cadre have lost \"freedom of movement\" in around a third of the territory that they control in Iraq. JUST WATCHED ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T16:49:14.241+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}