{"organizations": [], "uuid": "c2ca40267efc76ce3680ea0aad5e93461cb67b6c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/5602aea71c00007300757b3c.jpeg?cache=R0x5TRbet5", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/planned-parenthood-government-shutdown_5602adaee4b0fde8b0d08278", "country": "", "title": "Anti-Abortion Groups Split On Whether Government Should Shut Down Over Planned Parenthood", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Anti-Abortion Groups Split On Whether Government Should Shut Down Over Planned Parenthood", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T19:41:00.000+03:00", "replies_count": 0, "uuid": "c2ca40267efc76ce3680ea0aad5e93461cb67b6c"}, "author": "", "url": "http://www.huffingtonpost.com/entry/planned-parenthood-government-shutdown_5602adaee4b0fde8b0d08278", "ord_in_thread": 0, "title": "Anti-Abortion Groups Split On Whether Government Should Shut Down Over Planned Parenthood", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Samantha Lachman", "Carol Tobias"], "text": "Email Anti-Abortion Groups Split On Whether Government Should Shut Down Over Planned Parenthood They all want to target the family planning provider, but some don't think a shutdown is the way to do it. Samantha Lachman Staff Reporter, The Huffington Post Posted: 09/23/2015 11:50 AM EDT Tony Gutierrez/AP Photo Carol Tobias, president of National Right To Life. \nWASHINGTON -- The nation's most high-profile anti-abortion groups are divided about whether a government shutdown is really the most effective way to target Planned Parenthood. \nSenate Majority Leader Mitch McConnell (R-Ky.) offered a bill on Tuesday that links funding for the federal government with defunding Planned Parenthood, even though he had previously called the strategy \" an exercise in futility .\" \nDemocrats are almost universally opposed to the bill, and President Barack Obama has promised to veto any legislation that would strip federal funds from the family planning provider. This means McConnell's bill has set up a potential path to a government shutdown just days before the Sept. 30 deadline to fund the government. \nWhile the prospect of defunding Planned Parenthood is welcome news to anti-abortion groups, some have voiced concerns that the shutdown strategy is too risky, particularly because it would likely anger the majority of Americans who oppose defunding the health network. \nCarol Tobias, the president of National Right to Life, argued in a blog post Friday that refusing to fund Planned Parenthood and causing a government shutdown would damage the anti-abortion cause. \n\"The grim fact is this: in order to defund Planned Parenthood, we must have a pro-life president,\" she wrote. \"I do not believe that Obama will 'cave' to demands to sign legislation that blocks funding for Planned Parenthood, no matter how long he has to wait for the situation to be resolved—especially since he knows that every day that shutdown continues, Republican approval numbers will sink in the polls.\" \nTobias advocated instead for a more \"long-term\" approach to defunding Planned Parenthood, including electing a president who is opposed to abortion. \n\"Every well-informed pro-lifer wants to defund Planned Parenthood,\" she wrote. \"I want to defund Planned Parenthood. There are wonderful pro-life men and women in Congress who want to defund Planned Parenthood. And, certainly, National Right to Life wants to defund Planned Parenthood. The difference here is in strategy. National Right to Life is looking at the bigger, long-term picture.\" \nThe funding fight was reignited when the Center for Medical Progress, an anti-abortion group, released a series of heavily edited undercover videos that show Planned Parenthood doctors discussing the donation of fetal tissue for medical research after abortions. While anti-abortion advocates claim that the videos show the health care provider illegally selling fetal parts for profit, multiple state and federal investigations have found no evidence of wrongdoing. \nNational Right to Life's position gave political cover to members of Congress who support defunding Planned Parenthood, but not at the expense of keeping the government open. \n\"We agree with National Right to Life President Carol Tobias that a government shut down does not strengthen our movement in the long-term,\" a spokesman for Rep. Diane Black (R-Tenn.) told the Daily Signal . Black sponsored a standalone bill in the House that would defund Planned Parenthood for a year without affecting the government's ability to operate. \nOther anti-abortion groups believe that it's still worth pushing a bill that could shut down the government. \n“The Republican Party needs to show that they stand on principle and they will push to get something done,” Mallory Quigley of the Susan B. Anthony List told Al Jazeera America . “And if you look at the electorate right now, they’re not in [the] mood for business as usual.” \nThe anti-abortion group March for Life also favors doing whatever it takes. \n\"The pro-life movement is a movement of miracles,\" Tom McClusky, the group's vice president for government affairs, told the Christian Post . \"I think when you are standing on principle you are not doing the wrong thing. Personally, I want to see these guys stand up on principle.\" \n\"There is some disagreement over the current strategy but not the end result,\" he added. \nOther groups, such as Americans United for Life, have taken a relatively safer approach, which is to neither oppose nor support a government shutdown over Planned Parenthood funding. \n\"How that's resolved is up to the politicians to decide,\" the group's general counsel told the Washington Examiner. \"You have to ask politicians that.\" ", "external_links": [], "published": "2015-09-23T19:41:00.000+03:00", "crawled": "2015-09-23T19:41:26.976+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}