{"organizations": ["Huffington Post Ashley Alman Politics Social Media", "White House"], "uuid": "11ae540ed47e30afcf7a6c2bb987f21d867a7909", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55ef18ab1700004301569a30.jpeg?cache=ve6nSTdzHc", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-mike-krzyzewski-duke-basketball_55ef1460e4b002d5c076c639", "country": "", "title": "Obama Admits He 'Can Relate' To The Reviled Duke Men's Basketball Team", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Admits He 'Can Relate' To The Reviled Duke Men's Basketball Team", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T23:26:00.000+03:00", "replies_count": 0, "uuid": "11ae540ed47e30afcf7a6c2bb987f21d867a7909"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-mike-krzyzewski-duke-basketball_55ef1460e4b002d5c076c639", "ord_in_thread": 0, "title": "Obama Admits He 'Can Relate' To The Reviled Duke Men's Basketball Team", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike Krzyzewski", "Samantha Lachman", "Huffington", "Obama"], "text": "Email Obama Admits He 'Can Relate' To The Reviled Duke Men's Basketball Team He said the team \"knows what it’s like for people to oppose you no matter what you try to do.” Samantha Lachman Staff Reporter, The Huffington Post Ashley Alman Politics Social Media Editor, The Huffington Post Posted: 09/08/2015 02:09 PM EDT Credit: Chip Somodevilla/Getty Images President Obama hosted the Duke men's basketball team and Coach Mike Krzyzewski, left, at the White House, Sept. 8. \nWASHINGTON -- Turns out President Barack Obama has a lot in common with the Duke men's basketball team, and unlike most of America, he's willing to admit he admires them. \nObama honored the Duke basketball program at the White House Tuesday for winning the NCAA championship in April. As he stood next to Coach Mike Krzyzewski, Obama drew some comparisons between the vitriol he's faced as president and the intense hostility Duke inspires in its opponents. \n“I can relate to this program,” Obama said. “Does well in the classroom. Won twice in the past four years. Knows what it’s like for people to oppose you no matter what you try to do.” \nObama also compared himself to former Duke player Christian Laettner, who helped the team win consecutive NCAA championships in 1991 and 1992. \n“When I flip on ESPN and I see a documentary about how people still hate Christian Laettner, who played for Duke 23 years ago, I realize, maybe I don’t have it so bad,” Obama joked. “Or, I think this will be a long 23 years.” \nKrzyzewski promised Obama that when he’s through serving as president, the Duke basketball program will grant him a scholarship to Duke’s fantasy camp. \n“Reggie said you can play,” Krzyzewski said to the president, referencing former Duke player Reggie Love, who served as Obama’s \"body man\" in the White House. Krzyzewski noted that the program is for players over the age of 35. \n“I’ll dominate,” Obama quipped in response. \nFor his 2015 tournament bracket , Obama predicted that Duke would advance to the Final Four but then lose to Villanova. Krzyzewski presented Obama with a framed copy of the bracket displaying the final results of the tournament. \n“Any time you take a test and you put your answers there, you should always want the approved solution,” Krzyzewski told the president. \nObama previously hosted Duke at the White House in 2010, after they won their fourth national championship. \n“Obviously it’s not a smart thing to bet against Coach K,” he said at the time, alluding to the legendary coach’s criticisms of his leadership as president . “Coach K wasn’t too happy. He basically told me to stick it … Or stick to my day job, is what he said.” ", "external_links": [], "published": "2015-09-08T23:26:00.000+03:00", "crawled": "2015-09-08T23:26:20.053+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}