{"organizations": ["International Studies", "Interior", "Kenya Peace Corps", "Maasai Mara National Reserve", "East African Express Airlines", "Shell", "Royal Dutch Shell"], "uuid": "f8a1b2462318cef3e4f37353ef9d2b313bc4f702", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150828152327-obama-new-orleans-katrina-10-year-anniversary-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/08/30/politics/obama-alaska-denali-climate-change/index.html?eref=rss_politics", "country": "US", "title": "In Alaska, Obama to rename tallest U.S. peak", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "In Alaska, Obama to rename tallest U.S. peak", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T00:07:00.000+03:00", "replies_count": 0, "uuid": "f8a1b2462318cef3e4f37353ef9d2b313bc4f702"}, "author": "", "url": "http://edition.cnn.com/2015/08/30/politics/obama-alaska-denali-climate-change/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "In Alaska, Obama to rename tallest U.S. peak", "locations": ["United States", "Iran", "Nairobi", "Washington", "Moscow", "Gulf of Mexico", "Iraq", "Chukchi Sea", "Scandinavia", "U.S.", "Kenya", "Anchorage", "Kogelo", "Massachusetts", "Paris", "Africa", "Alaska", "Kisumu", "Russia", "Nevada", "China", "New Orleans", "Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sarah Obama", "Brian Deese", "Malia", "Barack Obama", "Pope Francis", "William McKinley", "George W. Bush", "IObama", "McKinley", "John Kerry", "Sally Jewell", "Obama", "Michelle Obama", "Deese", "Maasai Mara", "Denali", "Sasha"], "text": "MUST WATCH The president's Iran embarrassment 00:52 It's also using the trip to formalize the Denali name change, which native Alaskans have sought for decades. Named McKinley in 1896, shortly after President William McKinley was nominated as a candidate for office, the 20,320-foot peak has long been known locally as Denali, its name in the indigenous Athabascan language. The national park that surrounds the mountain was named Denali in 1980, but the peak itself is still listed in official federal documents as McKinley. Past attempts to make the change were blocked by lawmakers from McKinley's home state of Ohio. IObama is set to meet Monday with members of the native population to discuss ways the federal government can help them prepare for the effects of a changing climate, which the White House says include interrupted winter hunting seasons, newly hostile conditions for fish and wildlife and seawater encroaching on long-settled territory. \"The issue of climate change is not an issue of the future tense in Alaska, it is affecting people's lives and their livelihoods in real ways,\" White House senior adviser Brian Deese said in a preview of the three-day trip. During a conference call with reporters, Deese laid out the administration's latest data on the climate challenges facing Alaskans. The arctic has warmed almost twice as fast as the rest of the world and portions of northern Alaska have lost a \"football field's worth of land a day to coast erosions and sea-level rise,\" Deese said. 13 photos: Then-Senator Barack Obama's trip to Kenya Fourteen years after traveling to Kenya for the first time, Barack Obama received a warm welcome when he and his family visited in August 2006. Hide Caption 1 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Arriving on East African Express Airlines, Obama stepped off to far less fanfare than when he will later descend the steps of Air Force One. Hide Caption 2 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya A safari in the Maasai Mara National Reserve was one of the side trips on Obama's 17-day, six-nation tour of Africa in 2006. Hide Caption 3 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya On the lookout for wild game, Obama and his family set off across the Maasai Mara. A lion kill was the day's highlight. Hide Caption 4 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Artwork sprouted up across Kenya celebrating the ancestral roots of Obama, including this mural in Nairobi. Hide Caption 5 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Michelle Obama and the couple's two daughters, Sasha and Malia, joined a school dedication during the 2006 trip. Hide Caption 13 photos: Then-Senator Barack Obama's trip to Kenya Obama and Malia, who he playfully called \"Cool Breeze,\" enjoyed the scenery in rural Kenya. Hide Caption 7 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Peace Corps volunteers from the United States were pleased to run into Obama in Kisumu, Kenya. Hide Caption 8 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya The Obama brand was popular across Africa, too, with these admirers holding up shirts as they watched Obama pass. Hide Caption 9 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Sarah Obama, the matriarch of the family, welcomed Obama to her home in Kogelo. She was the stepmother of his father, Barack Obama Sr. Hide Caption 10 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Large crowds gathered across Kenya to welcome Obama, who received too many gifts to bring home to the United States. Hide Caption 11 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Five months before announcing his presidential bid, Obama sat in a Nairobi school and discussed the hopes and dreams of students. Hide Caption 13 photos: Then-Senator Barack Obama's trip to Kenya The Nation, the premiere newspaper in Nairobi, treated the freshman senator's visit as major news. Hide Caption 13 of 13 Wildfires have scorched \"5 million acres of land, which is approximately the size of my home state of Massachusetts,\" he added. Obama will deliver remarks at a conference of arctic nations in Anchorage to foreign ministers representing counties with a vested interest in the region. Secretary of State John Kerry, Interior Secretary Sally Jewell and other top administration officials are also making the 4,000-mile plus journey for the gathering. The foreign policy implications of a changing arctic are quickly coming into focus for the Obama administration, as Russia is increasingly behaving like a military rival in the area. The Center for Strategic and International Studies, a Washington think-tank recently warned Moscow is boosting its military presence in the arctic, dubbing the Russian ambitions as \"the ice curtain.\" The rapid ice melt in the Arctic is more than just a military concern. There are also vital economic considerations, as the evolving climate is opening up new shipping opportunities over the top of the world for counties from China to Scandinavia. But for fishermen who have relied on the predictability of Alaska's frigid temperatures for generations, the stakes are much higher. As the President noted in his weekly address, the state's independent governor warns four Alaskan villages are in \"imminent danger\" and must be relocated. \"Think about that. If another country threatened to wipe out an American town, we'd do everything in our power to protect ourselves,\" Obama said in the address. \"Climate change poses the same threat, right now.\" Even though environmentalists welcome the President's focus, some conservationists have accused Obama of climate hypocrisy, citing the recent approval for Royal Dutch Shell to begin oil and gas drilling in the Chukchi Sea off of Alaska's northwest coast. Also of concern to climate change activists is the administration's looming decision on the Keystone XL pipeline. \"Climate leaders don't drill in the arctic,\" tweeted the progressive group, Credo. The tweet featured a rendering of Obama wearing a Shell oil patch on his chest and standing on an aircraft carrier with a banner reading \"Mission Accomplished,\" a reference to the image of President George W. Bush during the Iraq War. The President defended the decision in favor of Shell's application as part of a balanced energy approach which he describes as the development of domestic resources of oil and natural gas until more sustainable, alternative fuel sources become the norm. \"I share people's concerns about offshore drilling. I remember the BP spill in the Gulf of Mexico all too well,\" Obama said in his weekly address. \"That's precisely why my administration has worked to make sure that our oil exploration conducted under these leases is done at the highest standards possible.\" One White House official dubbed the journey to Alaska a \"signature\" trip of the Obama presidency, noting climate change will come to be seen as a top priority in the administration's \"fourth quarter.\" Just last week, Obama paid visits to Nevada to discuss initiatives to expand solar power and New Orleans where he marked the 10th anniversary of Hurricane Katrina and warned about the effects of severe weather. Later this year, Obama will return to the issue of global warming when he meets with Pope Francis in September and again at a climate conference in Paris in December. Race to the White House More from Politics", "external_links": [], "published": "2015-08-31T00:07:00.000+03:00", "crawled": "2015-08-31T00:37:57.954+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}