{"organizations": [], "uuid": "3011a4aae6eaf818ff797f4172ea9badadccefb1", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/09/16/obama-urges-us-businessmen-to-exert-pressure-for-lifting-cuba-embargo/", "country": "IL", "title": "Obama urges U.S. businessmen to exert pressure for lifting Cuba embargo", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama urges U.S. businessmen to exert pressure for lifting Cuba embargo | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "3011a4aae6eaf818ff797f4172ea9badadccefb1"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2015/09/16/obama-urges-us-businessmen-to-exert-pressure-for-lifting-cuba-embargo/", "ord_in_thread": 0, "title": "Obama urges U.S. businessmen to exert pressure for lifting Cuba embargo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  EFE U.S. President Barack Obama on Wednesday urged businessmen to pressure Congress to lift the Cuban embargo, emphasizing the \"significant economic opportunities\" created by the process of normalizing bilateral relations.\nAfter delivering a speech at the Business Roundtable Headquarters in Washington at which he responded to several questions from the audience, Obama also said that the imminent visit of Pope Francis to Cuba will be \"an opportunity\" to broaden the \"conversations\" that are already occurring on the communist island.\nThe president reiterated that Cuba will not undergo an \"overnight transformation\" as a result of the normalization process, but he added that over time the rapprochement inevitably \"creates space for personal freedom and, I think, a long-term political transition.\"\n\"It doesn't make sense for us to keep sticking to the old ways of doing business,\" the president said, referring to the embargo.\nSince the announcement last December of the process of normalizing relations with Cuba, Obama has come out publicly in favor of lifting the embargo imposed on the island for more than half a century, something that only the U.S. Congress - which currently has a Republican majority - can do.\nLast week, Obama renewed for another year the legal provision for maintaining the economic embargo on Cuba to be able to continue exercising his executive authority to relax sanctions on the island during the course of the bilateral normalization process.\nThe renewal of the provision \"maximizes the president's flexibility in administering the Cuban embargo and authorizing specific transactions,\" a top U.S. official told EFE.\nThe historic process of rapprochement begun in December has led to the reestablishment of diplomatic relations, which had been broken off since 1961, with the reopening in July of embassies in Washington and Havana.\nIn August, Secretary of State John Kerry made the first visit in 70 years of a U.S. diplomatic chief to Cuba, and the White House said that Obama would like to visit Havana before he concludes his term in January 2017.\nObama and Cuban President Raul Castro also held a historic meeting in Panama in April within the framework of the Summit of the Americas.\nCuban Foreign Minister Bruno Rodriguez confirmed on Wednesday that Castro will attend the upcoming U.N. General Assembly meeting in New York, where Obama will also be on hand and, although no bilateral meeting has been set, he added that \"there will be interactions.\" EFE", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-17T05:07:36.639+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}