{"organizations": [], "uuid": "a7231f2966eeeb3aa7afd35a1d94144cfb73e05f", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150915112329-u-s-china-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/16/politics/president-obama-china-white-house-sanctions/index.html", "country": "US", "title": "President Obama talks tough on China cyber sanctions", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "President Obama talks tough on China cyber sanctions - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "a7231f2966eeeb3aa7afd35a1d94144cfb73e05f"}, "author": "Tal Kopan", "url": "http://www.cnn.com/2015/09/16/politics/president-obama-china-white-house-sanctions/index.html", "ord_in_thread": 0, "title": "President Obama talks tough on China cyber sanctions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Obama left the door open to holding off on the sanctions, putting the ball in Beijing's court. China has continually denied that it has engaged in cyber espionage against the U.S. Washington (CNN) President Barack Obama signaled a readiness to slap Beijing with sanctions over their alleged rampant hacking of American companies on Wednesday, continuing to ramp up pressure ahead of the Chinese president's state visit to Washington.\nSpeaking at the Business Roundtable in Washington on Wednesday, Obama seemed to personally address the issue of sanctions for the first time. The White House had previously confirmed they were in the works.\n\"We are preparing a number of measures that will indicate to the Chinese that this is not just a matter of us being mildly upset but is something that will put significant strains on the bilateral relationship if not resolved,\" Obama warned, though he didn't specifically use the term sanctions. \"And that we are prepared to take some countervailing actions in order to get their attention.\"\nBut Obama left the door open to holding off on the sanctions, putting the ball in Beijing's court.\n\"My hope is that it gets resolved short of that,\" he added.\nChinese President Xi Jinping is visiting the White House next week for a state visit, and the U.S. administration has been clear that cybersecurity will be a prevailing topic.\nChina has continually denied that it has engaged in cyber espionage against the U.S.\nRELATED: White House readying sanctions\nThe U.S. has been steadily upping the pressure on Beijing over its alleged state-sponsored hacking of American companies to steal sensitive trade secrets. In May 2014, the Justice Department indicted five Chinese military officials for allegedly hacking several U.S.-based companies, and this spring Obama signed an executive order allowing the U.S. to sanction entities who engage in or benefit from cyber-enabled economic espionage.\nThe White House confirmed last month that sanctions against China were being prepared at the highest levels, but a timeline for their imposition wasn't certain. Experts predicted the penalties wouldn't come until after Xi's visit, but the recent indications of their development could be used as leverage to get China to the table.\n\"This will probably be one of the biggest topics I discuss with President Xi,\" Obama said Wednesday. \"We have repeatedly said to the Chinese government that we understand traditional intelligence-gathering functions that all states, including us, engage in. ... That is fundamentally different from your government or its proxies engaging directly in industrial espionage and stealing trade secrets, stealing proprietary information from companies. That we consider an act of aggression that has to stop.\"\nJUST WATCHED EXCLUSIVE: Inside a U.S. spy plane Replay More Videos ... MUST WATCH\nEXCLUSIVE: Inside a U.S. spy plane 02:44 Also Wednesday, Defense Secretary Ashton Carter talked tough on China, referring to its increasingly aggressive military posture in the Pacific region.\n\"Given our concern about China's growing military capabilities and coercive approach to disputes, we are taking prudent steps to prepare for heightened competition,\" Carter said at an air and space convention.\nIn a reference to China's construction of islands in the South China Sea, for which it then asserts air and sea rights, Carter continued: \"There should be an immediate and lasting halt to land reclamation by all claimants. We also oppose any further militarization of disputed features.\"\nLike Obama, he warned China that the U.S. would not back down and would project its authority.\n\"There should be no mistake: The United States will fly, sail and operate wherever international law allows, as U.S. forces do all over the world,\" Carter said. \"America, alongside its allies and partners in the regional architecture, will not be deterred from exercising these rights.\n\"After all, turning an underwater rock into an airfield simply does not afford the rights of sovereignty or permit restrictions on international air or maritime transit,\" he added. \"With its actions in the South China Sea, China is out of step with both the international rules and norms that underscore the Asia-Pacific's security architecture.\"\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150617013458-sciutto-spy-plane-exlarge-169.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150617013458-sciutto-spy-plane-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150617013458-sciutto-spy-plane-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150617013458-sciutto-spy-plane-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150617013458-sciutto-spy-plane-medium-plus-169.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150617013458-sciutto-spy-plane-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150617013458-sciutto-spy-plane-small-169.jpg"], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-17T00:24:14.610+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}