{"organizations": ["Senate", "Fox News Latino Fox News"], "uuid": "7320f823293e67b94b0a5b7148d763b936267f92", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Russell%20Pearce%20and%20Salvador%20Rez.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/21/arizona-immigration-activist-continues-legal-fight-against-sb1070-author/", "country": "", "title": "Arizona immigration activist continues legal fight against SB1070 author | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Arizona immigration activist continues legal fight against SB1070 author | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "7320f823293e67b94b0a5b7148d763b936267f92"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/21/arizona-immigration-activist-continues-legal-fight-against-sb1070-author/", "ord_in_thread": 0, "title": "Arizona immigration activist continues legal fight against SB1070 author | Fox News Latino", "locations": ["Salvador Reza", "Arizona"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Russell Pearce"], "text": "Fox News Latino For the last four years, Salvador Reza (right) has been waging a lawsuit against former Senate President Russell Pearce (left), the author of Arizona’s controversial immigration law SB1070, after he was banned from the state’s senate buildings. \nFor the last four years, a 63-year-old immigrant activist has been waging a legal war against the author of Arizona’s controversial immigration law SB1070 after he was banned from the state’s senate buildings. \nSalvador Reza filed a civil lawsuit against Arizona’s former Senate President Russell Pearce in 2011 claiming his First Amendment rights were violated after being illegally barred from the Senate buildings by Pierce, a Republican, who at the time was the face of a law denounced by its critics as vehemently anti-immigrant. \nOn Tuesday, a federal appeals court panel overturned a judge’s 2012 ruling that dismissed the suit, reviving Reza’s claim. Now the case returns to the lower court for trial. \nAnd Reza’s fight continues. \nA community organizer in Arizona for the past 40 years, Reza was among vocal supporters and opponents of the controversial Senate Bill, attending a public hearing on Feb. 22, 2011 where Reza allegedly took part in disturbing the hearing. Pearce banned Reza from entering the state senate building. Two days later, Reza was arrested on suspicion of trespassing after he tried to enter the Senate building to speak to another lawmaker. \nReza claims he did not disturb the hearing, and instead was targeted by Pearce because he has been a vocal and consistent critic of Pearce’s policies which he characterizes as racist, anti-Latino and anti-immigrant. \n“I was targeted specifically because we were able to stop all of the anti-migrant legislation being proposed by Russell Pearce … he wanted to stop me,” Reza, a U.S. citizen and Air Force veteran, told Fox News Latino. \nReza believes his case could have national implications because it comes during a time when immigration is out front and center in the political arena. He believes now, more than ever, First Amendment rights for immigration activists are crucial – particularly their rights to attend public hearings in their own state senate buildings. \n“Just because an elected official, one of our employees, doesn't agree with our political discourse, doesn't give him the right to kick us out of one of our buildings,” said Reza’s lawyer, Stephen Montoya. “Elected officials are public employees and public servants.” \nPearce was ousted from the Senate in a recall election in November 2011, becoming the first legislator in state history to be removed from office. The 9th U.S. Circuit Court of Appeals, which sided with Reza this week, has stopped many of Pearce’s illegal immigration measures in the past. Pearce believes his actions to bar Reza were constitutional. \n\"The circuit court has contempt for the law, it has contempt for the Constitution, they have contempt for citizens,'' said Pearce, according to the Arizona Daily Sun. \"Anything they do should not surprise anybody.'' \nThe Judge Milan Smith Jr wrote in the majority split decision Tuesday that whether Reza was disruptive or not at the hearing was for a jury to decide, but ultimately even if he was disruptive, there was no constitutional justification for the ban. \n\"The effect of the ban was thus to exclude Reza not simply from all future hearings related to SB 1070, but from all future hearings on any subject,'' judge Smith Jr. wrote. \"In addition, because the building housed the legislative officers of all members of the Arizona Senate, the ban precluded Reza from visiting his elected representatives to urge legislative action on any subject.'' \nReza was arrested two days after the hearing when he entered the senate building to go visit his senator for an appointment. The longtime activist also claims in his suit that Pearce targeted him because he was Latino, but the court unanimously rejected that argument. \nMontoya says he believes his client will ultimately prevail, and that this case, in many ways reflects the conversation happening nationally in regards to the Latino community and immigration sparked by Republican presidential candidate and frontrunner Donald Trump. \n“Hispanics are not aliens,” Montoya told Fox News Latino. “This immigration issue has the potential, and sometimes, actualized to result in the deprivations of the constitutional rights of Hispanics who are native born citizens of the United States, many who are veterans of foreign wars.” \nBryan Llenas currently serves as a New York-based correspondent for Fox News Channel (FNC) and a reporter for Fox News Latino (FNL). Click here for more information on Bryan Llenas . Follow him on Twitter @BryanLlenas . \nLike us on Facebook ", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-22T07:30:27.150+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}