{"organizations": [], "uuid": "30bed8aae78c02aaec581f6d8e206c09c147270c", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Pope%20Francis%20Migrants.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/lifestyle/2015/09/01/pope-francis-allows-all-priests-during-holy-year-to-forgive-women-who-had/", "country": "", "title": "Pope Francis says priests can forgive women who've had abortions if they are 'contrite' | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Pope Francis says priests can forgive women who've had abortions if they are 'contrite' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T16:49:00.000+03:00", "replies_count": 0, "uuid": "30bed8aae78c02aaec581f6d8e206c09c147270c"}, "author": "", "url": "http://latino.foxnews.com/latino/lifestyle/2015/09/01/pope-francis-allows-all-priests-during-holy-year-to-forgive-women-who-had/", "ord_in_thread": 0, "title": "Pope Francis says priests can forgive women who've had abortions if they are 'contrite' | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francis"], "text": "Pope Francis says priests can forgive women who've had abortions if they are 'contrite' Published September 01, 2015 Fox News Latino (Photo by Franco Origlia/Getty Images) \nIn his latest move to have a more open and inclusive Roman Catholic Church, Pope Francis said he is letting all priests in the church's upcoming Year of Mercy to absolve the \"sin of abortion\" if the woman seeks forgiveness with a \"contrite heart.\" \nFrancis explained in a letter that his decision came after meeting many women bearing \"the scar of this agonizing\" decision to abort. He said God's forgiveness cannot be denied to those who repent, and thus is giving all priests the discretion to absolve the sin in the Holy Year of Mercy running Dec. 8, 2015 until late November 2016. \n\"What has happened is profoundly unjust; yet only understanding the truth of it can enable one not to lose hope,\" Francis wrote, according to the Washington Post . \nFrancis, the first non-European pontiff in 1,300 years, has marked his tenure as the leader of the Catholic Church by taking on taboo and controversial topics that his predecessors have shied away from. Amid a backlash from more conservative elements of the Catholic Church, the Vatican was quick to point out that the pope has no intention of retracting the Church's opposition to abortion. \n\"This is by no means an attempt to minimize the gravity of this sin but to widen the possibility of showing mercy,\" Vatican chief spokesman Father Federico Lombardi told reporters, according to Reuters . \nThe Vatican added that \"for now\" the changes would apply only during the Holy Year and Francis’ letter made no mention of people who perform abortions. Usually only a bishop, missionary or the chief confessor of a diocese, known by the Italian term \"penitenziere\", can formally forgive an abortion, but Francis’ decree allows any priests to perform the absolution in this Holy Year. \nThe Holy Year, one of the most important events in the 1.2 billion-member church, takes place every 25 years – unless a pope calls for one to bring attention to a particular topic – and sees thousands of Catholics make pilgrimages to Rome and other religious sites around the world. \nBesides permitting priests to forgive abortions, Pope Francis is also allowing members of the ultra-conservative Roman Catholic splinter group known as the Society of Saint Pius X (SSPX) to participate in Holy Year activities. The group, which rejects some of the tenets laid down in the 2nd Vatican Council, was excommunicated by the late Pope John Paul II after it defied the Vatican in 1988 by illegally consecrating four bishops. \nPope Benedict lifted the excommunications on the Swiss-based group in 2009 and made some concessions, even as one of its bishops, the British-born Bishop Richard Williamson, created a controversy by denying the Holocaust. \nThe Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-09-01T16:49:00.000+03:00", "crawled": "2015-09-01T16:49:13.193+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}