{"organizations": ["Supreme Court May Review Texas Abortion Law That Wendy Davis Filibustered Supreme Court"], "uuid": "b6a25f45002a85dc9d26d559ecf1261e00d17ced", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e862041400002e002e4d4d.jpeg?cache=4li4qDyCDW", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/supreme-court-texas-abortion-law_55e8576de4b0aec9f35632d2", "country": "", "title": "Supreme Court May Review Texas Abortion Law That Wendy Davis Filibustered", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Supreme Court May Review Texas Abortion Law That Wendy Davis Filibustered", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T19:25:00.000+03:00", "replies_count": 0, "uuid": "b6a25f45002a85dc9d26d559ecf1261e00d17ced"}, "author": "", "url": "http://www.huffingtonpost.com/entry/supreme-court-texas-abortion-law_55e8576de4b0aec9f35632d2", "ord_in_thread": 0, "title": "Supreme Court May Review Texas Abortion Law That Wendy Davis Filibustered", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Laura Bassett Laura Bassett"], "text": "Supreme Court May Review Texas Abortion Law That Wendy Davis Filibustered If the court rejects the case, eight abortion clinics will be forced to shut down. Laura Bassett Laura Bassett, Senior Politics Reporter, The Huffington Post Posted: 09/03/2015 12:05 PM EDT \nA national abortion rights group asked the Supreme Court on Thursday to review a pair of restrictions in Texas that would shut down eight abortion clinics across the state if it is allowed to go into effect. \n\"Without the court’s intervention, the impact on Texas women will be immediate and devastating, imposing insurmountable burdens on their access to essential reproductive health care statewide,\" said Nancy Northup, president and CEO of the Center for Reproductive Rights. \nThe abortion law in question, passed by the GOP-controlled state legislature in 2013 but currently not in effect, requires all abortions to take place in ambulatory surgical centers, or mini-hospitals. It also requires abortion providers to obtain admitting privileges at a local hospital -- a difficult move in politically conservative areas with Catholic hospitals that oppose abortion. Former state Sen. Wendy Davis (D) famously filibustered the bill for 11 hours in the state Capitol, but ultimately failed to block it from passing. \nWhile supporters of the new restrictions claim they are in place to protect women's health, abortion rights advocates argue that they impose an undue burden on women's constitutional right to have an abortion. The Supreme Court ruled in Roe v. Wade in 1973 that states cannot block women's access to abortion up until the fetus is viable outside the womb, around 22 to 24 weeks of pregnancy. \nBut the restrictions in question would end abortion access for low-income women in rural areas of the state, who are already having a hard time finding providers. Texas had 42 abortion clinics before the law was passed, and 24 of those clinics have already been forced to close due to a slew of other anti-abortion laws. \nThe law went into effect briefly before the Supreme Court temporarily blocked it in October 2014. The U.S. Court of Appeals for the 5th Circuit upheld the clinic regulations and admitting privileges requirement in June, but the Supreme Court stepped in and blocked them again. If the high court declines to formally review the case, the law will go into effect, shutting down all but 10 of the 18 remaining clinics and leaving large swaths of rural Texas without any access to a provider. \nFor the short time the law was in effect, Texas saw a glimpse of its consequences. The eight abortion clinics that remained open at the time were flooded with phone calls from panicked women and reported longer waits for appointments. The Huffington Post reported that Texas women were already seeking abortion pills on the black market and crossing into Mexico for illegal, unsafe abortions due to a lack of providers. \nAs women's health advocates fight the new laws, Texas Gov. Greg Abbott (R) is trying to crack down even more on abortion access. He recently pledged to end all state and local funding to Planned Parenthood, one of the few remaining abortion providers in the state and a leading source of birth control and family planning services. \nIn such a hostile political climate, Texas abortion clinics are now looking to the Supreme Court as a last-ditch effort to remain open. \n\"This is the real world and these laws have real implications on real women’s lives,\" said Amy Hagstrom Miller, the CEO of Whole Woman's Health, an abortion provider in Texas. \"We’re hopeful that the Supreme Court will take a stand, hear our case, and remind lawmakers that women’s health is not a game.\" ", "external_links": [], "published": "2015-09-03T19:25:00.000+03:00", "crawled": "2015-09-03T19:24:50.526+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}