{"organizations": [], "uuid": "6b13cf7a6b3d7fc2a46cc7c37d2a5196d18bf136", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150617162835-obama-putin-split-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/24/politics/obama-putin-un-syria-russia/index.html", "country": "US", "title": "Obama and Putin to meet at U.N. next week - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Obama and Putin to meet at U.N. next week - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "6b13cf7a6b3d7fc2a46cc7c37d2a5196d18bf136"}, "author": "Jim Acosta", "url": "http://www.cnn.com/2015/09/24/politics/obama-putin-un-syria-russia/index.html", "ord_in_thread": 0, "title": "Obama and Putin to meet at U.N. next week - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington (CNN) President Barack Obama and Russian President Vladimir Putin will meet during next week's gathering of the United Nations General Assembly, a senior administration official said. The official noted the meeting comes \"at the request of President Putin.\"\n\"Given the situations in Ukraine and Syria, despite our profound differences with Moscow, the President believes that it would be irresponsible not to test whether we can make progress through high-level engagement with the Russians,\" the official said.\nWhite House officials have repeatedly complained about Russia's recent military buildup in Syria, a move the Kremlin insists is aimed at defeating ISIS. But Obama administration officials suspect Putin is attempting to gain a foothold in the war-torn country should it collapse under the weight of a bloody civil war.\n\"Russia's decision to double down on Assad is a losing bet,\" White House press secretary Josh Earnest said, accusing Putin of propping up Syria's embattled leader, Bashar al-Assad.\nDuring their bilateral discussion, Obama will press Putin to deescalate tensions in Eastern Ukraine where pro-Russian forces continue to clash with the Ukrainian military.\n\"In particular, our European partners have underscored the importance of a unified message about the necessity of fully implementing the Minsk agreements,\" the senior official said about the ceasefire agreements designed to end the conflict.\nObama discussed the situation in Eastern Ukraine with German Chancellor Angela Merkel earlier this week.\nThe last face-to-face encounter for the two leaders occurred during the G20 summit in Australia last November. Prior to that, Obama and Putin briefly discussed the crisis in Ukraine in June during the 70th anniversary of D-Day. Their relationship has soured since Moscow's annexation of Crimea from Ukraine, a military action that resulted in Russia's expulsion from the G8 group of world leaders.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-24T19:34:22.878+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}