{"organizations": [], "uuid": "0d34e69f0771e1a988a62a78f56ac628cf9d47b1", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/04/politics/sarah-palin-barack-obama-alaska/index.html", "country": "", "title": "Palin: What Obama missed on his Alaska trip - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Palin: What Obama missed on his Alaska trip - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "0d34e69f0771e1a988a62a78f56ac628cf9d47b1"}, "author": "", "url": "http://www.cnn.com/2015/09/04/politics/sarah-palin-barack-obama-alaska/index.html", "ord_in_thread": 0, "title": "Palin: What Obama missed on his Alaska trip - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Sarah Palin: What Obama missed on his Alaska trip Updated 1634 GMT (2334 HKT) September 4, 2015 Washington (CNN) Former Alaska Gov. Sarah Palin took issue with President Barack Obama's visit to her state, saying he missed some key points while in the region. While Obama trekked the Alaskan wilderness to highlight the impacts of climate change, Palin pointed out the President did not visit with the oil industry in the state or seriously address the presence of Russian and Chinese military and oil exploration activity off Alaska's coast. Palin also appeared to slam Obama for recently changing the official name of the United States' tallest peak from Alaska's Mount McKinley to Denali. \"And, he renamed a mountain...our mountain...the tallest peak on the North America continent,\" Palin said, writing under the pen name \"Denali,\" which was her Secret Service code name. Palin herself, like most Alaska politicians and locals, has long referred to the peak by its local name \"Denali\" -- as she did in her farewell address as she left the governor's post in 2009. Palin, a tea party firebrand who unsuccessfully campaigned for the vice presidency, also slammed Obama for not checking out the Hubbard Glacier in Alaska, which according to a NASA report is expanding . Obama instead visited one of the thousands of glaciers in Alaska which have been shrinking in recent decades as a result of global warming, for which there is overwhelming scientific evidence. Palin has slammed such evidence as \"junk science\" in the past, and on Friday took the opportunity to slam Obama for the carbon footprint of his trip. \"Unlike most tourists, the President heads home now with his enormous fleet of transport vehicles -- ironically after plenty of finger pointing on this Global Warming tour. Astoundingly, with just this one trip, a bigger carbon footprint was created than what 33 cars combined would create in an entire year,\" she said. ", "external_links": [], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-04T18:49:36.208+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}