{"organizations": ["Fox News Missouri", "Jefferson City Correctional Center", "Facebook", "AP", "Twitter"], "uuid": "7cd681bb127c0fd5ab8fa5768e79e0e473ff9fd1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/0/0/mocannibus.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2015/09/01/missouri-man-who-got-life-sentence-for-marijuana-charge-goes-free/", "country": "", "title": "Missouri man who got life sentence for marijuana charge goes free | Fox News", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Missouri man who got life sentence for marijuana charge goes free | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T22:16:00.000+03:00", "replies_count": 0, "uuid": "7cd681bb127c0fd5ab8fa5768e79e0e473ff9fd1"}, "author": "", "url": "http://www.foxnews.com/us/2015/09/01/missouri-man-who-got-life-sentence-for-marijuana-charge-goes-free/", "ord_in_thread": 0, "title": "Missouri man who got life sentence for marijuana charge goes free | Fox News", "locations": ["Jefferson City", "Mo."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["L. Stewart", "Jeff Mizanskey"], "text": "Missouri man who got life sentence for marijuana charge goes free Published September 01, 2015 Facebook 0 Twitter 0 Email Print Sept. 1, 2015: Jeff Mizanskey speaks after being released from the Jefferson City Correctional Center, after serving two decades of a life sentence for a marijuana-related charge in Jefferson City, Mo. (AP Photo/Columbia Missourian/Justin L. Stewart) \nJEFFERSON CITY, Mo. – A man sentenced to life without parole on a marijuana-related charge was freed Tuesday from a Missouri prison after being behind bars for two decades — a period in which the nation's attitudes toward pot steadily softened. \nFamily, friends, supporters and reporters flocked to meet Jeff Mizanskey as he stepped out of the Jefferson City Correctional Center into a sunny morning, wearing a new pair of white tennis shoes and a shirt that read \"I'm Jeff & I'm free.\" \n\"I spent a third of my life in prison,\" said Mizanskey, now 62, who was greeted by his infant great-granddaughter. \"It's a shame.\" \nAfter a breakfast of steak and eggs with family, Mizanskey said, he planned to spend his post-prison life seeking a job and advocating for the legalization of marijuana. He criticized sentencing for some drug-related crimes as unfair and described his time behind bars as \"hell.\" \nHis release followed years of lobbying by relatives, lawmakers and others who argued that the sentence was too stiff and that marijuana should not be forbidden. \nMizanskey was sentenced in 1996 — the same year California became the first state to legalize marijuana for medical purposes. Medical marijuana is now legal in 23 states, and recreational marijuana has been legalized in Alaska, Colorado, Oregon, Washington state and Washington, D.C. \n\"The reason he's getting out is because the public clearly has changed its opinion about marijuana, and it's just one of many ways in which that has been reflected in recent years,\" said Mizankey's attorney, Dan Viets. \nJust last year, the heavily Republican Missouri Legislature passed a law to allow certain people with epilepsy to seek treatment with a marijuana extract containing little of the chemical that causes users to feel high and larger amounts of a compound called cannabidiol, or CBD. The patients can include babies, Viets said. \n\"Nobody saw that coming,\" he said. \"That is a pretty radical statement.\" \nPolice said Mizanskey conspired to sell 6 pounds of marijuana to a dealer connected with Mexican drug cartels. At the time, the life-with-no-parole sentence was allowed under a Missouri law for repeat drug offenders. Mizanskey already had two drug convictions — one for possession and sale of marijuana in 1984 and another for possession in 1991. \nHe was the only Missouri inmate serving such a sentence for a nonviolent marijuana-related offense when Democratic Gov. Jay Nixon agreed in May to commute his sentence. The commutation allowed Mizanskey to argue for his freedom before a parole board, which granted the request in August. \nThe governor cited Mizanskey's nonviolent record, noting that none of his offenses involved selling drugs to children. The law under which he was originally sentenced has been changed. \nOther states are re-evaluating punishments for drug-possession crimes, motivated in large part by the high cost of imprisoning low-level, nonviolent offenders. \nIn Connecticut, a new law will make possession of small amounts of hard drugs, including heroin, cocaine and crack cocaine, a misdemeanor for a first-time offense, rather than an offense carrying up to seven years in prison. Nebraska and Alabama expect to save hundreds of millions of dollars by using new laws to cut down on the number of offenders locked up for possessing small amounts of drugs. \nIn Missouri, backers of two ballot initiatives to legalize pot have permission from the secretary of state to begin collecting signatures to put the issue before voters in 2016. Another petition proposes reducing sentences for nonviolent drug offenders who are serving time without opportunity for parole. \nMizanskey said he will not smoke marijuana now that he's free; he's on parole, after all. \nBut if it ever becomes legal on the state and federal levels, he said, \"definitely.\" Advertisement ", "external_links": [], "published": "2015-09-01T22:16:00.000+03:00", "crawled": "2015-09-01T22:16:12.299+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}