{"organizations": [], "uuid": "13488efd7cc3e50cac2f93a495b38c1a7eee7d8b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/0920%20obamas.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/politics/2015/09/20/obama-set-to-speak-at-black-caucus-dinner-clinton-to-mingle/", "country": "US", "title": "Obama pays tribute to female civil rights leaders at Black Caucus dinner", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama pays tribute to female civil rights leaders at Black Caucus dinner | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "13488efd7cc3e50cac2f93a495b38c1a7eee7d8b"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/09/20/obama-set-to-speak-at-black-caucus-dinner-clinton-to-mingle/", "ord_in_thread": 0, "title": "Obama pays tribute to female civil rights leaders at Black Caucus dinner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press Facebook 0 Twitter 0 Email Print Sept. 19, 2015: President Barack Obama and first lady Michelle Obama arrive at the Congressional Black Caucus Foundation’s 45th Annual Legislative Conference Phoenix Awards Dinner at the Walter E. Washington Convention Center in Washington.  (AP) \nWASHINGTON –   President Barack Obama paid tribute Saturday to black women for their role in helping shape American democracy, calling them \"the thinkers and the doers\" who made things happen at the height of the civil rights movement half a century ago.\nObama said black women did the behind-the-scenes work of strategizing boycotts and organizing marches while others got the credit. He said they have been part of every great movement in American history, and that every American has benefited as a result.\n\"Women were the foot soldiers. Women strategized boycotts. Women organized marches,\" Obama said in a keynote address to the Congressional Black Caucus Foundation's annual awards dinner. \"Even if they weren't allowed to run the civil rights organizations on paper, behind the scenes they were the thinkers and the doers making things happen each and every day, doing the work that no one else wanted to do.\"\n\"Women made the movement happen,\" he said.\nBut Obama said that while black women and girls have made progress and are opening more of their own businesses and graduating from high school and college at higher rates, they are still overrepresented in low-paying jobs and underrepresented in management.\nHe even invoked his wife, Michelle, as an example of the attitudes about black women that he said persist. The first lady, a lawyer with degrees from two Ivy League universities, has spoken on numerous occasions of being told by her teachers that she was setting her sights too high.\n\"Those stereotypes and pressures, they still affect our girls,\" said Obama, the father of two teenage daughters. \"So we all have to be louder than the voices that are telling our girls they're not good enough, that they've got to act a certain way.\"\nObama has had the dinner spotlight to himself during all but one of his nearly seven years in office. But with the campaign to succeed him in full swing, he had some competition for attention at Saturday's gathering sponsored by a major Democratic Party constituency group.\nDemocratic presidential candidate Hillary Rodham Clinton, who wore lipstick red, attended the dinner to mingle. Vice President Joe Biden, who is considering a late entry into the Democratic race, attended a caucus prayer breakfast.\nThis year's dinner honored Fred Gray, a civil rights attorney who represented Rosa Parks and Rev. Martin Luther King Jr., and Juanita Abernathy, a civil rights activist who helped lead the historic Montgomery bus boycott in her home state of Alabama in the mid-1950s.\nPosthumous honors went to Amelia Boynton Robinson, an organizer of the Bloody Sunday march to Montgomery, Alabama, in March 1965. She celebrated this year's 50th anniversary of the march by crossing the Edmund Pettus Bridge in Selma, Alabama, while holding hands with Obama.\nBoynton Robinson died late last month at age 104.", "external_links": [], "published": "2015-09-20T03:00:00.000+03:00", "crawled": "2015-09-20T10:26:48.028+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}