{"organizations": [], "uuid": "541fba54db81253f2209f6fcfb7a8fe90d2b95eb", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e740c41d0000d301146a17.jpeg?cache=pbIfJi0Muk", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/news.xml", "section_title": "Business News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/arizona-taxes-legal-marijuana_55e732f8e4b0c818f61a21a4", "country": "US", "title": "Legal Marijuana In Arizona Would Generate Over $60 Million In Taxes Annually, Study Predicts", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Legal Marijuana In Arizona Would Generate Over $60 Million In Taxes Annually, Study Predicts", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T22:32:00.000+03:00", "replies_count": 0, "uuid": "541fba54db81253f2209f6fcfb7a8fe90d2b95eb"}, "author": "Matt Ferner", "url": "http://www.huffingtonpost.com/entry/arizona-taxes-legal-marijuana_55e732f8e4b0c818f61a21a4", "ord_in_thread": 0, "title": "Legal Marijuana In Arizona Would Generate Over $60 Million In Taxes Annually, Study Predicts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Legal Marijuana In Arizona Would Generate Over $60 Million In Taxes Annually, Study Predicts \"It might not be enough to solve all of our schools' budget problems, but it will help immensely.\" Matt Ferner National Reporter, The Huffington Post Posted: 09/02/2015 03:32 PM EDT Credit: Ed Andrieski/Associated Press \nArizona stands to generate more than $60 million in marijuana tax revenue annually, if voters decide to legalize and regulate the plant for adult recreational purposes in 2016. \nThat's according to an independent analysis released Monday by Arizona's nonprofit Grand Canyon Institute. It found the state would rake in about $64 million per year from legal marijuana taxes, including $51 million that would go to K-12 education and all-day kindergarten programs in the state. That's significantly more than the $40 million in tax revenue for education backers of the ballot initiative projected last month -- a sum that opponents of the measure lambasted as unrealistically high and a local newspaper characterized as \"a lie\" in an August op-ed. \nBut at least according to the GCI, a research organization focusing on Arizona's fiscal and tax issues -- one that describes itself as \"a centrist think-thank led by a bipartisan group of former state lawmakers, economists, community leaders, and academicians\" -- the advocates were being conservative in their estimates. \n\"The revenue gains do exceed the $40 million espoused by proponents of the initiative,\" GCI's report reads. \nFurther, the research group projects that if the ballot measure were to pass, by 2019, once the regulated market was fully established, the state would raise $72 million annually with about $58 million for education alone. \n“You can debate whether marijuana should be made legal for adults, but there’s no arguing the fact that this initiative will generate significant revenue for Arizona schools,\" J.P. Holyoak, chairman of the Campaign to Regulate Marijuana Like Alcohol, said in a statement reacting to GCI's report. \"It might not be enough to solve all of our schools’ budget problems, but it will help immensely.\" \nIn its report, the GCI says it neither supports nor opposes the effort to legalize marijuana in the state. \nAdvocates in the state are currently collecting signatures to help the measure qualify for the November 2016 state ballot. The campaign says it has gathered roughly 60,000 signatures since its petition drive began in May. \nSimilar to Colorado’s recreational marijuana legalization and regulatory framework, the Regulation and Taxation of Marijuana Act would allow Arizona adults 21 and older to be in possession of up to 1 ounce of marijuana and grow up to six plants for personal use in their homes. The measure would also allow for retail marijuana shops to sell the substance to adults and would enact a 15 percent excise tax on those sales. The revenue generated from that special excise tax would go to fund the implementation and enforcement of state regulations, but 40 percent of that tax revenue would go to education. \nIf Arizona’s marijuana measure makes it onto the ballot and passes, adults in the state would join those in Colorado, Washington, Oregon, Alaska and the District of Columbia, all of which have similar recreational marijuana laws. (D.C. continues to ban sales.) Twenty-three states, including Arizona and those that allow recreational use, have legalized marijuana for medical purposes. Marijuana remains illegal under federal law. \nSkepticism over the actual amount of tax revenue generated from recreational marijuana legalization stems from Colorado's first year of tax revenue, which came in around $44 million -- about $26 million shy of initial expectations. The state has since adjusted tax estimates downward, but has also seen a significant rise in revenue as the recreational marijuana program has continued to fully roll out. \nAlso on HuffPost:", "external_links": [], "published": "2015-09-02T22:32:00.000+03:00", "crawled": "2015-09-02T22:47:18.058+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}