{"organizations": [], "uuid": "0b4817d13f6338965a45bc9629bedd5fa727f7ce", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/feeds/Associated%20Press/2015/09/03/0/0/5f0a689a7276e627800f6a70670017ae.jpg", "site_section": "http://www.foxnews.com/us/", "section_title": "U.S. Latest &amp; Breaking News Headlines | U.S. | Fox News", "url": "http://www.foxnews.com/us/2015/09/03/san-francisco-judge-mulls-scheduling-murder-trial-for-suspect-in-middle/", "country": "US", "title": "San Francisco judge mulls scheduling murder trial for suspect in middle of immigration debate", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "San Francisco judge mulls scheduling murder trial for suspect in middle of immigration debate | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "0b4817d13f6338965a45bc9629bedd5fa727f7ce"}, "author": "Associated Press", "url": "http://www.foxnews.com/us/2015/09/03/san-francisco-judge-mulls-scheduling-murder-trial-for-suspect-in-middle/", "ord_in_thread": 0, "title": "San Francisco judge mulls scheduling murder trial for suspect in middle of immigration debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 03, 2015 Associated Press Facebook 0 Twitter 0 Email Print FILE - In this July 7, 2015 file photo, Juan Francisco Lopez-Sanchez, right, is lead into the courtroom by San Francisco Public Defender Jeff Adachi, left, and Assistant District Attorney Diana Garciaor, center, for his arraignment at the Hall of Justice in San Francisco. The parents of Kathryn Steinle filed a wrongful death claim Tuesday, Sept. 1, 2015 alleging that the San Francisco Sheriff's Department is to blame for releasing an illegal immigrant from jail despite a federal \"detainer\" request to keep in custody for possible deportation proceedings. A claim is usually a precursor to a lawsuit. (Michael Macor/San Francisco Chronicle via AP, Pool, File) (The Associated Press)\nAttorney Frank Pitre, with the family of Kathryn Steinle behind him, speaks during a news conference on the steps of City Hall Tuesday, Sept. 1, 2015, in San Francisco. The parents of the San Francisco woman shot to death by a man being sought for deportation filed legal claims against San Francisco and federal officials in connection with her killing. Kathryn Steinle was shot to death on Pier 14 on July 1 as she walked with her father. (AP Photo/Eric Risberg) (The Associated Press)\nJim Steinle, right, father of Kathryn Steinle, answers questions during a news conference on the steps of City Hall Tuesday, Sept. 1, 2015, in San Francisco. Listening in the background is Brad Steinle and Liz Sullivan, the brother and mother of Kathryn Steinle. The parents of the San Francisco woman shot to death by a man being sought for deportation filed legal claims against San Francisco and federal officials in connection with her killing. Kathryn Steinle was shot to death on Pier 14 on July 1 as she walked with her father. (AP Photo/Eric Risberg) (The Associated Press)\nPrevious Next SAN FRANCISCO – A San Francisco judge is deciding whether to schedule a murder trial for a Mexican national deported from the United States five times before shooting a young woman walking with her father.\nA preliminary hearing on the matter is scheduled to resume Thursday in San Francisco. A judge could decide to schedule a murder trial as well.\nJuan Francisco Lopez-Sanchez has pleaded not guilty to murder charges, though he admits to firing the shot that killed Kathryn Steinle on July 1. Lopez-Sanchez said the shooting was an accident.\nHe said he found a .40 caliber semiautomatic pistol under a bench on San Francisco's Pier 14. He said the gun accidentally fired when he picked it up.", "external_links": ["http://www.ap.org/"], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-03T09:24:14.483+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}