{"organizations": [], "uuid": "9b2b41c77e3b055c84c928d622030ec2826287eb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/boehnerjohn_072915gn.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/house/253026-boehner-to-skewer-obama-in-foreign-policy-speech", "country": "US", "title": "Boehner to skewer Obama in foreign policy speech", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Boehner to skewer Obama in foreign policy speech", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T14:25:00.000+03:00", "replies_count": 0, "uuid": "9b2b41c77e3b055c84c928d622030ec2826287eb"}, "author": "Scott Wong", "url": "http://thehill.com/homenews/house/253026-boehner-to-skewer-obama-in-foreign-policy-speech", "ord_in_thread": 0, "title": "Boehner to skewer Obama in foreign policy speech", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boehner to skewer Obama in foreign policy speech Greg Nash By Scott Wong - 09/09/15 07:25 AM EDT \nIn a speech Wednesday, Speaker John Boehner (R-Ohio) will rip into President Obama, questioning his commitment to democracy and highlighting what he views as the administration’s numerous foreign policy failures. ADVERTISEMENT \"Promoting democracy isn't a cornerstone of our government's foreign policy. If anything, it's an afterthought at best,” Boehner will say in a speech to the International Republican Institute, according to an excerpt first shared with The Hill.\nBoehner, who will receive the institute’s Freedom Award for his work for \"democracy, freedom and good governance,” specifically will take aim at Obama’s policies on Iraq, Iran and Cuba, aides said. \nFor the past year, Boehner has been one of the loudest critics of the president's strategy to defeat Islamic State in Iraq and Syria (ISIS) terrorists in the Middle East. \nThe Speaker will be introduced by Senate Armed Services Chairman John McCain (R-Ariz.), who also is chairman of the Washington, D.C.-based institute and was defeated by Obama in the 2008 presidential election. \nBoehner, who was first elected to Congress in 1990, will deliver remarks about how freedom has made all things possible in his own life and the lives of others in the world, aides said. And he’ll highlight how House Republicans are working to promote democracy and support international freedom fighters. \nAides said Boehner has played a key role in foreign policy matters since he was first elected majority leader in 2006. That year, Boehner helped President George W. Bush salvage his surge strategy in Iraq and block Democratic efforts to cut off war funding, according to aides. \nPast recipients of the Freedom Award include: Bush and his wife, Laura Bush; President Ronald Reagan; Pope John Paul II; human rights leader Aung San Suu Kyi; former Vice President Dick Cheney and his wife, Lynne Cheney; former Senate Majority Leader Bob Dole (R-Kansas); and a number of former secretaries of State, including Colin Powell and Henry Kissinger.", "external_links": [], "published": "2015-09-09T14:25:00.000+03:00", "crawled": "2015-09-09T15:32:20.424+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}