{"organizations": [], "uuid": "d8fac43a215777b985d6b8b6036b7596d09114ba", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e4c0891700009a015691a2.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/index.xml", "section_title": "Green - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/obama-alaska-climate-change_55e4be9be4b0b7a96339f3d5", "country": "US", "title": "In Alaska, Obama Highlights Climate Change While His Decisions Draw Accusations of 'Hypocrisy'", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "In Alaska, Obama Highlights Climate Change While His Decisions Draw Accusations of 'Hypocrisy'", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T01:16:00.000+03:00", "replies_count": 0, "uuid": "d8fac43a215777b985d6b8b6036b7596d09114ba"}, "author": "Kate Sheppard", "url": "http://www.huffingtonpost.com/entry/obama-alaska-climate-change_55e4be9be4b0b7a96339f3d5", "ord_in_thread": 0, "title": "In Alaska, Obama Highlights Climate Change While His Decisions Draw Accusations of 'Hypocrisy'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In Alaska, Obama Highlights Climate Change While His Decisions Draw Accusations of 'Hypocrisy' Environmental groups are outraged over his drilling policies. Kate Sheppard Senior reporter/Environment and energy editor, The Huffington Post Posted: 08/31/2015 06:16 PM EDT ASSOCIATED PRESS \nWASHINGTON -- As President Barack Obama visits Alaska this week, he is facing criticism and outright outrage from environmental advocates who say his focus on climate change while in the region contradicts his administration's decision to allow Shell to drill there. \nThe administration granted Shell permission to begin exploratory oil and gas drilling in the Chukchi Sea this summer. And Obama plans to put a major emphasis on climate change during his visit to Alaska, the frontline of climate change's effects in the United States. Environmental groups say the mixed messaging from Obama constitutes \" climate hypocrisy .\" The liberal group Credo Action put up a website mocking Obama's visit as his \"Mission Accomplished\" moment , likening it to George W. Bush's 2003 speech declaring that the U.S. had \"prevailed\" in Iraq. \n\"He somehow has made himself believe that you can have this transition to a clean energy economy and take action on climate change, and continue to develop domestic oil and gas,\" said Marissa Knodel, a climate campaigner at Friends of the Earth. \"If you continue to drill and develop these resources, you're going to continue to contribute to the production of greenhouse gases. They're contradictory.\" \nObama tried to head off this particular line of criticism ahead of his Arctic visit, the first by a sitting president. \"Now even as we accelerate this transition, our economy still has to rely on oil and gas,\" said Obama in his recorded weekly address on Saturday . \"As long as that's the case, I believe we should rely more on domestic production than on foreign imports, and we should demand the highest safety standards in the industry -- our own.\" \nObama said he shares the \"concerns about offshore drilling,\" citing the 2010 Deepwater Horizon spill in the Gulf of Mexico, and said that's why his administration \"has worked to make sure that our oil exploration conducted under these leases is done at the highest standards possible.\" He pointed to the draft rules for Arctic drilling that the Department of Interior rolled out in February , the first for the region. \nSome environmental advocates pointed to other actions the administration has taken with regard to Alaska that would discourage drilling -- instituting drilling rules, putting parts of Bristol Bay off limits for oil and gas operations , and protecting new areas of the Arctic Refuge . \"We are hoping that this administration is a leader in oil spill response, spill prevention, safety, and in protecting important marine areas critical for hunting and subsistence,\" said Marilyn Heiman, director of the U.S. Arctic program at the Pew Charitable Trusts. \nBut the administration is walking a fine line when it comes to the Arctic. \"The president is caught in the middle. It’s the frontier of global climate change, so it's an appropriate place for the president to make a speech about climate,\" said Charles Ebinger, a senior fellow on foreign policy, energy security and climate at the Brookings Institution. \"But he is caught in this quandary because his environmental constituency is adamantly opposed to drilling.\" \nEbinger notes that Shell's leases for the region predate Obama's tenure -- they were auctioned in 2008, under George W. Bush's Department of Interior -- and Shell has already invested a reported $7 billion in operations there. The Obama administration seems to have decided, he said, \"that they should let Shell at least progress with this activity.\" But, he added, it does not appear that the administration \"will welcome someone else following behind Shell, necessarily.\" \nFor one, it's not clear exactly how much oil is even up there, let alone how much can be easily accessed. The U.S. Geological Survey estimated in 2008 that there are 90 billion barrels of technically recoverable oil in the entire Arctic Region, and 84 percent of that is offshore. That's enough to provide about three years of oil for the world, according to consumption estimates from the International Energy Agency . The oil in offshore Alaska is only estimated at around 26.6 billion barrels -- or less than a year's supply for the world. \nShell clearly believes there's plenty of oil there to have invested so heavily in exploration, but isn't expected to begin production for at least a decade. \nHannah McKinnon, a senior campaigner with the group Oil Change International, argues that the administration's decision to allow drilling fits within its \"all-of-the-above\" energy strategy . \"I think the big part of the problems is that a lot of their energy policy and their climate policy simply aren't aligned,\" said McKinnon. The Department of Energy’s Energy Information Administration projects relatively stable demand for oil for the next 25 years, while the administration has taken a number of actions intended to drive down demand, like raising fuel economy standards for automobiles. Those projections, said McKinnon, \"assume climate policies are going to fail.\" \nIf demand did remain that high, said McKinnon, \"we're talking about a future of climate catastrophe.\"", "external_links": [], "published": "2015-09-01T01:16:00.000+03:00", "crawled": "2015-09-01T01:29:58.300+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}