{"organizations": [], "uuid": "e17c22b23925088432b97c06e61c2a9074ccab8e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/mountmckinleydenali06102015getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/252345-former-ohio-rep-obamas-mountain-renaming-shows-he-thinks-he-is-a", "country": "US", "title": "Former Ohio rep.: Obama ‘thinks he is a dictator’ renaming mountains", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Former Ohio rep.: Obama ‘thinks he is a dictator’ renaming mountains", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T22:11:00.000+03:00", "replies_count": 0, "uuid": "e17c22b23925088432b97c06e61c2a9074ccab8e"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/252345-former-ohio-rep-obamas-mountain-renaming-shows-he-thinks-he-is-a", "ord_in_thread": 0, "title": "Former Ohio rep.: Obama ‘thinks he is a dictator’ renaming mountains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Ohio rep.: Obama ‘thinks he is a dictator’ renaming mountains Getty Images By Timothy Cama - 08/31/15 03:11 PM EDT \nPresident Obama’s unilateral action to rename Alaska’s Mount McKinley to Denali shows that “he thinks he is a dictator and he can change the law,” a former Ohio lawmaker said on Monday. \nRalph Regula, a Republican who served in the House for 26 years, told The Columbus Dispatch that Obama undertook a “political stunt” by renaming North America’s highest mountain on Sunday in advance of his trip to Alaska on Monday. ADVERTISEMENT Regula joined a long list of Ohioans angered at Obama for removing the name of President William McKinley, whose name was attached to the peak for nearly a century despite his never having set foot in Alaska and lacking any connection to the state.\n“This is just show business,” said Regula, who retired in 2009 after representing an area that included McKinley’s hometown. “He’s going to Alaska and he wants to make a big splash up there,” he added, referring to Obama’s trip to the state. \nRegula also questioned the authority that Obama and Interior Secretary Sally Jewell asserted in changing the name of the mountain, which Congress mandated in 1917. \n“The law is it’s Mt. McKinley and he can’t change a law by a flick of the pen,” he said. “You want to change the Ohio River? You want to go around the country and start changing the names of these places because it is politically expedient?” \nAlaska Natives have called the mountain Denali for thousands of years, and Alaska has officially called it that since 1975. \nEarlier Monday and on Sunday, various Ohio politicians, including House Speaker John Boehner (R) and Sen. Rob Portman (R) sharply criticized Obama’s move. \nOhio Gov. John Kasich, who is vying for the Republican Party’s nomination to be president in 2016, also stood up for Ohio’s favorite son, tweeting that Obama “oversteps his bounds” with the name change. \nRepublican strategist Karl Rove, who has studied McKinley extensively, also questioned Obama’s authority. He asked Obama try to honor the 25th president, who was assassinated six months into his second term, in another way. \n“I would hope that he would find a gracious way to honor McKinley, who is an important figure in American history,” he told Time . \nHistorians credit McKinley with leading the United States through the Spanish-American War, the first time the country fought a major war outside of its own borders. Tags:", "external_links": [], "published": "2015-08-31T22:11:00.000+03:00", "crawled": "2015-08-31T22:40:22.623+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}