{"organizations": ["Fox News Latino", "Congress"], "uuid": "745ea259eed1c8bdb071817b6be76629c0f6acca", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/lifestyle/0/0/best%2020%20pix%20(21).jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/18/president-obama-urges-business-leaders-to-press-congress-to-lift-cuba-embargo/", "country": "", "title": "President Obama urges business leaders to press Congress to lift Cuba embargo | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "President Obama urges business leaders to press Congress to lift Cuba embargo | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T19:01:00.000+03:00", "replies_count": 0, "uuid": "745ea259eed1c8bdb071817b6be76629c0f6acca"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/18/president-obama-urges-business-leaders-to-press-congress-to-lift-cuba-embargo/", "ord_in_thread": 0, "title": "President Obama urges business leaders to press Congress to lift Cuba embargo | Fox News Latino", "locations": ["Cuba", "Havana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "President Obama urges business leaders to press Congress to lift Cuba embargo Published September 18, 2015 Fox News Latino A man drives his taxi past a Cultural Center with the word \"Cuba\" on it, in Havana, Cuba, Tuesday, April 14, 2015. \nPresident Barack Obama appealed to U.S. businessmen in a meeting Wednesday to press members of Congress to lift the U.S.-Cuba embargo. \n\"It doesn't make sense for us to keep sticking to the old ways of doing business,\" the president said, referring to the embargo, at the Business Roundtable Headquarters in Washington D.C., according to EFE. \nHis effort to shift the next – and what would be the final – chess move in the push to end the 53-year-old embargo dovetails with the launching of a new campaign by the public policy group Engage Cuba that entails taking the fight to lift the embargo to the home districts of members of Congress. \n“For too long, a small minority of status quo defenders sidelined the voices of the vast majority of the American people who support a change in U.S.-Cuba policy,” said James Williams, President of Engage Cuba, in a statement. “Engage Cuba will work on the ground in the states to ensure elected officials in Washington know where their constituents stand.” \nEngage Cuba says it plans to develop state-level coalitions to press members of Congress to lift the U.S.-Cuba trade and travel ban. The group says it will be implementing its grassroots campaign through local media, polling and advertisements. The first sites will be in Georgia, Iowa, Louisiana, Tennessee, Texas and Ohio. \nAt the Wednesday speech, Obama said that the imminent visit of Pope Francis to Cuba will be \"an opportunity\" to broaden the \"conversations\" that are already occurring on the communist island. \nThe president reiterated that Cuba will not undergo an \"overnight transformation\" as a result of the normalization process, but he added that over time the rapprochement inevitably \"creates space for personal freedom and, I think, a long-term political transition.\" \nSince the announcement last December of the process of normalizing relations with Cuba, Obama has come out publicly in favor of lifting the embargo imposed on the island for more than half a century, something that only the U.S. Congress – which currently has a Republican majority – can do. \nLast week, Obama renewed for another year the legal provision for maintaining the economic embargo on Cuba to be able to continue exercising his executive authority to relax sanctions on the island during the course of the bilateral normalization process. \nThe renewal of the provision \"maximizes the president's flexibility in administering the Cuban embargo and authorizing specific transactions,\" a top U.S. official told EFE. \nLike us on Facebook ", "external_links": [], "published": "2015-09-18T19:01:00.000+03:00", "crawled": "2015-09-18T19:01:39.584+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}