{"organizations": ["Fox News Latino Huge", "Fox News Latino Getty Images"], "uuid": "5bffbae68080c20c3da3d3c57d427e0e44685825", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/judges%20gavel.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/18/huge-immigration-backlog-taking-toll-on-judges-100-jurists-expected-to-retire/", "country": "", "title": "Huge immigration backlog taking toll on judges, 100 jurists expected to retire this year | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Huge immigration backlog taking toll on judges, 100 jurists expected to retire this year | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "5bffbae68080c20c3da3d3c57d427e0e44685825"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/08/18/huge-immigration-backlog-taking-toll-on-judges-100-jurists-expected-to-retire/", "ord_in_thread": 0, "title": "Huge immigration backlog taking toll on judges, 100 jurists expected to retire this year | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Huge immigration backlog taking toll on judges, 100 jurists expected to retire this year Published August 18, 2015 Fox News Latino Getty Images \nFederal immigration courts are struggling to review the large backlog of cases that has reached an all-time high, with more than 445,000 pending cases, according to a new report. \nAs of April of this year, 445,706 immigration cases were still pending in courts across the United States – a nearly 30 percent increase from the prior fiscal year – and experts expect it to become even worse this year. \n“There is no ability of the court to keep up,” Denise Gilman, director of an immigration clinic at the University of Texas law school in Austin, Texas, told the Los Angeles Times . “We really are in a vicious cycle.” \nAccording to the Transactional Records Access Clearinghouse at Syracuse University , the backlog of immigration cases has been years in the making, but courts became overwhelmed after the influx of more than 68,500 unaccompanied minors and families who crossed the southern border last summer. \nDuring the so-called border surge , immigration courts gave priority to unaccompanied minors, mostly from Central America, pushing back all other already pending cases. These cases make up a small portion of the back log – more than 70,000 cases, as of April, the report said. \nJonathan Ryan, executive director of the San Antonio-based advocacy group Raices, told the Times that while the federal government was addressing the unaccompanied minors’ cases, they were not focusing on the cases that “make up almost all of the backlog.” \n“We see people coming into our office every day whose lives are being negatively impacted by this,” he told the newspaper, noting about a case of Syrian family whose case has been pushed back until 2019. “This whole family is in a state of paralysis or suspense because they can’t move forward in the backlog.” \nA spokesman for the Executive Office for Immigration Review at the Justice Department, which handles immigration cases, told the Times that courts have been attempting to address the problem by hiring more judges. \nThere are 233 judges in 58 courts nationwide, and 17 more are expected to be hired this month. Louis Ruffino told the Times that 68 more are in the process of being hired. \n“Part of the solution to the backlog is vigorous, ongoing hiring process to bring on more immigration judges,” he said, adding that judges in Miami are now listening to Texas cases via videoconferencing. \nHowever, more than 100 immigration judges are expected to retire this year, according to San Francisco-based Judge Dana Leigh Marks. At least 130 of the 233 immigration judges are eligible for retirement this year. \n“We’re waiting for the tsunami to come,” she told the Times. “If you look at how difficult the working conditions become when you are so overworked and not given the support that you need, it makes sense that what happens is people retire at their earliest opportunity. That is really tragic for the country because these are skilled people.” \nShe said the pace of cases is “relentless,” which means cases are pushed back several years. \nAccording to the Immigration Police Center, immigration judges typically handle more than 1,400 cases and some even juggle more than 3,000 cases – while other kinds of judges handle around 500 cases. The high volume of cases and the emotional stories that immigrants recount takes a toll on judges, some say. \n“Why immigration judges get burned out is they have a high volume of cases, some on their dockets for years, and then those cases get pushed out because somebody in Washington says these other cases matter more,” Judge Eliza Klein, who was a judge in Boston, Miami and most recently Chicago, told the Times . “When I started, the longest you would put a case out was six weeks… If you have to put case out more than year, you lose the ability to retain that sense of what the case is all about.” \nLike us on Facebook ", "external_links": [], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-19T01:21:26.767+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}