{"organizations": ["Democratic National Committee", "Warren Easton High School", "Des Moines Area Community College", "Univision"], "uuid": "ca45da1c3ba91e41bc10a5cdf1086798d7026714", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150828132424-tease-02-week-in-politics-0828-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_topstories.rss", "section_title": "CNN.com - Top Stories", "url": "http://edition.cnn.com/2015/08/29/politics/gallery/week-in-politics-0830/index.html?eref=rss_topstories", "country": "US", "title": "Bush dances, Clinton waits, Obama flies", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Bush dances, Clinton waits, Obama flies", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T21:02:00.000+03:00", "replies_count": 0, "uuid": "ca45da1c3ba91e41bc10a5cdf1086798d7026714"}, "author": "", "url": "http://edition.cnn.com/2015/08/29/politics/gallery/week-in-politics-0830/index.html?eref=rss_topstories", "ord_in_thread": 0, "title": "Bush dances, Clinton waits, Obama flies", "locations": ["Iran", "Washington", "South Carolina", "Dubuque", "Londonderry", "Ankeny", "Texas", "Florida", "Iowa", "Vermont", "Little Rock", "New Hampshire", "New Brunswick", "U.S.", "Muscatine", "Pensacola", "Chabad", "Anderson", "Maryland", "New Jersey", "Wisconsin", "Arkansas", "Treme", "New Orleans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush", "Bernie Sanders", "Joe Biden", "Bush", "Donald Trump", "Trump", "Barack Obama", "Jorge Ramos", "Kerry", "George W. Bush", "Alexina Medley", "John Kerry", "Obama", "Clinton", "Hillary Clinton", "Marco Rubio", "Ramos", "Ted Cruz", "Ben Carson", "Scott Walker", "Chris Christie", "Biden", "Martin O'Malley"], "text": "Updated 0147 GMT (0847 HKT) August 30, 2015 16 photos: The week in politics Democratic presidential candidate Hillary Clinton waits to be introduced before speaking at the Des Moines Area Community College in Ankeny, Iowa, on Wednesday, August 26. Hide Caption 1 of 16 16 photos: The week in politics Univision anchor Jorge Ramos, left, asks Republican presidential candidate Donald Trump a question about his immigration plan during a news conference Tuesday, August 25, in Dubuque, Iowa. Ramos squabbled with Trump twice during the event, and at one point a security officer ejected Ramos before he was allowed back in. Hide Caption 2 of 16 16 photos: The week in politics White House guests have their hair blown back while they watch President Barack Obama depart in his Marine One helicopter on Thursday, August 27. Hide Caption 3 of 16 16 photos: The week in politics Former President George W. Bush dances with Alexina Medley, the principal of Warren Easton High School in New Orleans, on Friday, August 28. Bush's visit came as the city prepared to mark the 10th anniversary of Hurricane Katrina. Hide Caption 4 of 16 16 photos: The week in politics Vice President Joe Biden, left, arrives at the White House for his daily briefing with Obama on Wednesday, August 26. Biden revealed to members of the Democratic National Committee on Wednesday that he is assessing whether he has \"the emotional fuel\" to run for President. Hide Caption 5 of 16 16 photos: The week in politics New Jersey Gov. Chris Christie, a Republican presidential candidate, expresses his opposition to Obama's Iran deal while speaking at a Chabad house Tuesday, August 25, in New Brunswick, New Jersey. Hide Caption 6 of 16 16 photos: The week in politics A security official pushes away an environmental activist Tuesday, August 25, near the Washington house of U.S. Secretary of State John Kerry. The protesters were urging Kerry to stop the expansion of the Alberta Clipper oil pipeline. Hide Caption 7 of 16 16 photos: The week in politics Wisconsin Gov. Scott Walker, a Republican presidential candidate, speaks during a meet-and-greet in Guthrie Center, Iowa, on Thursday, August 27. Hide Caption 8 of 16 16 photos: The week in politics Supporters cheer for U.S. Sen. Ted Cruz, a Texas Republican running for President, during an event in Anderson, South Carolina, on Monday, August 24. Hide Caption 9 of 16 16 photos: The week in politics U.S. Sen. Bernie Sanders, a Democratic presidential candidate from Vermont, greets audience members after a town-hall meeting in Conway, New Hampshire, on Monday, August 24. Hide Caption 10 of 16 16 photos: The week in politics President Obama greets residents in the Treme neighborhood of New Orleans on Thursday, August 27. It has been 10 years since Hurricane Katrina devastated the historically black neighborhood. Hide Caption 16 photos: The week in politics Republican presidential candidate Jeb Bush addresses an audience in Pensacola, Florida, on Wednesday, August 26. Hide Caption 12 of 16 16 photos: The week in politics Democratic presidential candidate Martin O'Malley, left, leaves a public library in Muscatine, Iowa, after speaking there on Sunday, August 23. Hide Caption 13 of 16 16 photos: The week in politics Republican presidential candidate Ben Carson, left, poses for a selfie in Little Rock, Arkansas, on Thursday, August 27. Hide Caption 14 of 16 16 photos: The week in politics President Obama sits inside Marine One at Andrews Air Force Base in Maryland on Tuesday, August 25. Hide Caption 15 of 16 16 photos: The week in politics U.S. Sen. Marco Rubio, a Republican presidential candidate from Florida, holds a town-hall meeting in Londonderry, New Hampshire, on Wednesday, August 26. See the previous week in politics Hide Caption 16 of 16 Take a look at 16 photos of the week in politics from August 23 to August 29. More from Politics", "external_links": [], "published": "2015-08-30T21:02:00.000+03:00", "crawled": "2015-08-30T21:26:17.701+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}