{"organizations": ["White House", "Fox News Facebook", "Twitter"], "uuid": "f1f4035d3a7e4481d1c616ba03281c3022dc6c05", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/09/25/why-us-must-fight-china-and-xi-jinpings-rising-aggression/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1443197220736.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/09/25/why-us-must-fight-china-and-xi-jinpings-rising-aggression.html", "country": "", "title": "The message Obama must send to Xi and China | Fox News", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "The message Obama must send to Xi and China | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "f1f4035d3a7e4481d1c616ba03281c3022dc6c05"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/09/25/why-us-must-fight-china-and-xi-jinpings-rising-aggression.html", "ord_in_thread": 0, "title": "The message Obama must send to Xi and China | Fox News", "locations": ["Washington", "South Lawn", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Obama", "Michelle Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print President Barack Obama, Chinese President Xi Jinping, first lady Michelle Obama and Chinese first lady Madame Peng Liyuan wave from the Truman Balcony of the White House in Washington, Friday, Sept. 25, 2015, after a state arrival ceremony for the Chinese president on the South Lawn. (AP Photo/Evan Vucci) \nXi Jinping, the dictator of Communist China in his role as leader of its party and its military wing, the People's Liberation Army, is being rewarded by President Obama this week for his escalating aggression with a state visit . \nChina's state media have been full of articles, some written by pro-Beijing American “China hands,” admonishing America that nothing is more important than maintaining stable bilateral relations. In other words, we should continue to ignore the fact that Chinese goals increasingly threaten America's interests and security. \nThis “business uber alles ” approach has governed US-China relations for the last 25 years. It must stop, unless American leaders today wish to condemn our children to future wars with China. \nLet’s be clear: China’s highest priority goal is to end American political/strategic leadership in Asia and to force Asian democracies and U.S. allies to subordinate their security to Chinese hegemony and dictates. Its specific objectives include the termination in the near-term of democracy on Taiwan and the end of U.S. defense treaties with and presence in Japan, South Korea, the Philippines and Australia. \nIt is absolutely imperative that Xi comes away from his time here convinced that the United States is not going to cede Asia, outer space or cyberspace to Chinese dominance and will never abandon its democratic or military allies. \nTo be sure, Communist China regularly inveighs that it abjures “hegemony.” But it is unmistakably building today the forces it needs to invade Taiwan and to prevent the United States from rendering military assistance. The Chinese are also building the political-economic basis for extending their influence in Central Asia, Africa and Latin America. \nThis will soon be accompanied by a global power-projection military, allowing Beijing to advance its ambitions for domination beyond its own region, ambitions that may be further catalyzed by the need to seize on external “threats” to justify continued, and intensifying, internal repression. That is especially true insofar as the Chinese Communist Party is facing the combined challenges of serious economic setbacks, a demographic time-bomb and growing political unrest. \nChina is building space weapons to control Low Earth Orbit and – notwithstanding any accord it may sign with President Obama this week – it seeks to dominate cyberspace in order to threaten America's electronic infrastructure. \nThese are the sorts of conduct that hostile powers engage in, not friends or even business partners worthy of the honor and legitimization associated with a state visit to Washington. It is a serious strategic mistake to extend such a privilege to Xi Jinping under present circumstances. \nIt is, therefore, absolutely imperative that Xi comes away from his time here convinced that the United States is not going to cede Asia, outer space or cyberspace to Chinese dominance and will never abandon its democratic or military allies. This must start with continued support for Taiwan's ability to defend itself from a growing Chinese threat, as it must expand military cooperation with Japan and the Philippines to deter Beijing from imposing control over disputed maritime areas. We have to counter the impression of American military and geopolitical decline that is contributing to China’s increasingly aggressive conduct in various terrestrial, extraterrestrial and virtual domains. \nFurthermore, it is time for Washington to insist that China must cease its longstanding technical and political support that has enabled Pakistan, North Korea and soon, Iran, to become nuclear missile states. \nNot least, we should be exploiting China’s internal difficulties to weaken the Party’s hold on power – and not be legitimating it, propping it up or otherwise appeasing it. \nA failure to resist China's ambitions in Asia and beyond and its nuclear missile proliferation only serves to encourage the Communists to redouble their bid for eventual global strategic dominance at the expense of the United States and many other democracies. We must respond to Chinese provocations, rebuild our military to deter Beijing’s aggression and counter its efforts to use our corporations’ understandable desire for trade with China to undermine their own proprietary interests and the nation’s security and/or economic ones. \nSo the stakes for Americans in Xi Jinping's visit are enormous. Xi’s interlocutors must demonstrate that we will resist China's ambitions, not accede to them. The message should be: America is committed to: free passage in the East and South China Seas; its allies, partners and strategic interests in that region and elsewhere; and opposing the efforts of any nation to restrict or otherwise endanger those vital interests. \nOur failure to do so now will only compound the difficulty and expense entailed in dealing with China down the road for future presidents and for our country. \nFrank J. Gaffney, Jr. is president of the Center for Security Policy . He acted as an Assistant Secretary of Defense under President Ronald Reagan. ", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-26T07:29:23.792+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}