{"organizations": [], "uuid": "80846799ae1db9e7011e9813cff207120bb16e23", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/prolifeinternal878.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/09/01/court-orders-hhs-to-exempt-pro-life-group-from-abortion-drug-mandate/", "country": "US", "title": "Court orders HHS to exempt pro-life group from abortion drug mandate", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Court orders HHS to exempt pro-life group from abortion drug mandate | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "80846799ae1db9e7011e9813cff207120bb16e23"}, "author": "Bill McMorris", "url": "http://www.foxnews.com/politics/2015/09/01/court-orders-hhs-to-exempt-pro-life-group-from-abortion-drug-mandate/", "ord_in_thread": 0, "title": "Court orders HHS to exempt pro-life group from abortion drug mandate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Bill McMorris \nPublished September 01, 2015 Washington Free Beacon   Email Print Jan 22. 2014: Anti-abortion demonstrators participate in the annual March for Life in Washington. (Reuters) \nA federal judge granted March for Life an exemption from the ObamaCare birth control mandate on Monday, citing the Religious Freedom Restoration Act as well as the Fifth Amendment.\nMarch for Life sponsors an annual rally attended by tens of thousands of abortion opponents. The organization and Alliance Defending Freedom sued the Department of Health and Human Services after the agency refused to exempt it from sponsoring insurance plans that featured contraception that can in some cases induce abortions after conception.\nJudge Richard Leon of the U.S. District Court for the District of Columbia said the religious employer exemption should apply to the organization.\n“If the purpose of the religious employer exemption is, as HHS states, to respect the anti-abortifacient tenets of an employment relationship, then it makes no rational sense-indeed, no sense whatsoever to deny March for Life that same respect,” Leon wrote. “Defendants are hereby permanently ENJOINED from enforcing against plaintiff March for Life, its health insurance issuer, and the insurance issuer(s) of employee plaintiffs … the statutes and regulations requiring a health insurance issuer to include contraceptive coverage in plaintiffs’ health insurance plans.”\nMarch for Life’s attorney’s celebrated the case as a win for conscience rights over government mandates.\n“Pro-life organizations should not be forced into betraying the very values they were established to advance,” said Matt Bowman in a release. “This is especially true of March for Life, which was founded to uphold life, not to assist in taking it. The government has no right to demand that organizations provide health insurance plan options that explicitly contradict their mission.”\nClick for more from The Washington Free Beacon.", "external_links": [], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-01T16:22:05.116+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}