{"organizations": [], "uuid": "6d43b004efd5582546e2641e2dfea0899f683efb", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e5aa501700004301569211.png?cache=UCY5RLjriC", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/rachel-maddow-obamas-climate-change-message-undermined-by-arctic-drilling-greenlight_55e5a921e4b0b7a9633a27d8", "country": "", "title": "Maddow: Is Obama Being Hypocritical On Climate Change?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Maddow: Is Obama Being Hypocritical On Climate Change?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "6d43b004efd5582546e2641e2dfea0899f683efb"}, "author": "", "url": "http://www.huffingtonpost.com/entry/rachel-maddow-obamas-climate-change-message-undermined-by-arctic-drilling-greenlight_55e5a921e4b0b7a9633a27d8", "ord_in_thread": 0, "title": "Maddow: Is Obama Being Hypocritical On Climate Change?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Judah Robinson", "Maddow", "Obama"], "text": "Maddow: Is Obama Being Hypocritical On Climate Change? Environmental groups have called the president's actions \"hypocritical.\" Judah Robinson Fellow, HuffPost Media Posted: 09/01/2015 02:30 PM EDT | Edited: 09/01/2015 04:53 PM EDT ADVERTISEMENT \nPresident Barack Obama's trip to Alaska to push for action on climate change is being met with a bit of backlash not only from environmental groups, but also from the media. \nMSNBC host Rachel Maddow asked Monday if Obama's recent climate change rhetoric is hard to reconcile with his administration's decision to allow off-shore drilling in the Arctic, a measure environmental groups have said is \" hypocritical \" of the president. \n\"I mean, it is hard to square the president talking about climate change in these very aggressive terms in Alaska ... with the green light he just gave to drill the Arctic for oil up there,\" Maddow said on her program Monday. \nThe host asked NBC News's senior White House correspondent Chris Jansing if the administration hopes that the drilling will be overlooked when Obama's legacy on climate change is assessed. \n\"I mean, does the White House think that that is something people should sort of overlook when it comes to the president's legacy on climate change?\" she said. \"Or are they making the case for it not being as bad as seems?\" \nJansing responded by saying the administration is making a case that climate change is much larger than one issue, while environmental leaders continue to call out the president. \n\"They're making a case, and I have to say, some of the environmental leaders of major groups that I've talked to out-and-out called him a hypocrite for deciding to go ahead with the Shell lease -- which we should say, to be fair, started in the Bush Administration,\" she said. \"Here's what the president has to say about this: We are trying to go to more sustainable fuels, but we're not there yet. In the mean time, the reality is, we have to have an energy-driven economy.\" \nJansing pointed out that the administration has said in a video, released by the White House prior to Obama's official trip to Alaska, that the current leases have the strongest protections in them of any leases the U.S. has had. \nWatch the White House's video here: ", "external_links": [], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-03T10:46:22.719+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}