{"organizations": ["Facebook", "Twitter"], "uuid": "a2ad953d08ec8738d67bd87bb9273b3ce27013ff", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/092015_judge_pope_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/21/report-obama-administration-seeking-vatican-help-on-american-prisoners-in-iran/", "country": "", "title": "Report: Obama administration seeking Vatican help on American prisoners in Iran | Fox News", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Report: Obama administration seeking Vatican help on American prisoners in Iran | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T17:20:00.000+03:00", "replies_count": 0, "uuid": "a2ad953d08ec8738d67bd87bb9273b3ce27013ff"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/21/report-obama-administration-seeking-vatican-help-on-american-prisoners-in-iran/", "ord_in_thread": 0, "title": "Report: Obama administration seeking Vatican help on American prisoners in Iran | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Report: Obama administration seeking Vatican help on American prisoners in Iran Published September 21, 2015 Facebook 0 Twitter 0 livefyre Email Print \nThe Obama administration reportedly is seeking help from Pope Francis in negotiating the release of three American prisoners held in Iran. \nPolitico reported Monday that Washington and the Vatican have had discussions in recent months about the prisoners. Pope Francis will visit Washington and other American cities this week, though it's unclear whether the Iranian matter will come up. \nThe purported discussions follow Pope Francis playing an integral role in the normalizing of relations between the United States and Cuba. The pope personally wrote letters to President Obama and Cuban leader Raul Castro urging them to repair the broken bond between their countries. The Vatican later hosted talks, and played a role in the eventual release of American prisoner Alan Gross from Cuba. \nWhether the Vatican, though, can exert that kind of influence in Tehran is a very open question. Cuba is a mostly Catholic nation, giving the Vatican some natural sway in the country and with the Castros. Pope Francis would hold no such influence in Tehran, run by Muslim theocrats. \nStill, Politico noted that the pope met in February with a delegation of influential Iranian women. One of them, Shahindokht Molaverdi, told a Catholic-issues publication she'd be open to the pope helping improve ties between the U.S. and Iran as he did with the U.S. and Cuba. \n\"Certainly this pope has an ability to bring people together, which can also influence governments,\" Molaverdi, Iran's vice president for women and family affairs, told the publication Crux . \nPolitico cited an unnamed source familiar with the cases in saying the U.S. and Vatican have been in contact regarding the American prisoners in Iran, and at least one prisoner's family has appealed to the pope for assistance. \nThe status of the imprisoned Americans has loomed over the talks over the Iran nuclear deal. While some lawmakers urged the Obama administration to demand their release as a condition of any agreement, the State Department and White House resisted -- saying they needed to keep the issues separate. \nWith the nuclear deal now expected to be implemented, though, the prisoners' fate remains unresolved. Iran continues to hold Christian pastor Saeed Abedini, former Marine Amir Hekmati and Washington Post journalist Jason Rezaian on what their supporters say are bogus charges. Advertisement ", "external_links": [], "published": "2015-09-21T17:20:00.000+03:00", "crawled": "2015-09-21T17:21:09.827+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}