{"organizations": ["Chiron", "Fox News", "Republican Party", "GOP", "NARAL", "CNN", "NARAL Pro-Choice Massachusetts"], "uuid": "efef12591325a6e6cb4524982703fde7cd5daaac", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150828162437-naral-donald-trump-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/08/28/politics/barack-obama-envoy-hostage-affairs/index.html?eref=rss_politics", "country": "US", "title": "Abortion rights group protests Donald Trump fundraiser", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Abortion rights group protests Donald Trump fundraiser", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T01:22:00.000+03:00", "replies_count": 0, "uuid": "efef12591325a6e6cb4524982703fde7cd5daaac"}, "author": "", "url": "http://edition.cnn.com/2015/08/28/politics/barack-obama-envoy-hostage-affairs/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Abortion rights group protests Donald Trump fundraiser", "locations": ["Massachusetts", "Cleveland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Norwood", "Dana Bash", "Ernie Boch Jr", "Trump", "Donald Trump", "Boch", "Miron", "Sara Murray", "Kelly", "Christian Miron"], "text": "Donald Trump: I'm for the abortion exception 06:24 Story highlights A group that supports abortion rights is planning to crash the event. Trump was once supportive of abortion rights, but is now anti-abortion. Norwood, Massachusetts (CNN) When Donald Trump arrives Friday at the home of a local car dealership magnate here for an evening fundraiser, it won't just be supporters of the candidate greeting him. NARAL Pro-Choice Massachusetts, a group that supports abortion rights, is planning to crash the event hosted by Ernie Boch Jr. The group's political director Christian Miron said he expects at least 80 protesters to show up wearing bright purple T-shirts. They plan to be \"very loud and very visible,\" Miron said. \"While Donald Trump thinks that running for president is merely his own personal reality TV show, the reality is that women need access to safe, affordable reproductive health care,\" Miron told CNN. \"Our goal tonight is to illustrate Trump's very extreme views on women's health because they're very out of step with our core values here in Massachusetts.\" NARAL Pro-Choice Massachusetts is taking issue with Trump's stance on women's reproductive issues. The billionaire businessman was once supportive of abortion rights, but is now anti-abortion. RELATED: Donald Trump allies quietly seek money from rich, anonymous patrons He said he changed his position after seeing a friend contemplate an abortion and then choose to keep the baby. Trump told CNN's Dana Bash last month that while he's against abortions, he does support exceptions in cases of rape, incest and when the mother's health is at risk. Trump, the Republican Party's current front-runner, has faced numerous questions about his views and treatment of women. At the first GOP debate in Cleveland earlier this month, Fox News host Megyn Kelly questioned the candidate on his past inflammatory remarks about women. The candidate has gone on the offensive, frequently stating \"I cherish women,\" and pointing out that many senior executives at his company are female and well-compensated. Chiron said the protesters' message will be directed not only at Trump, but also the guests who turn out to mingle with the former reality TV star. \"It's important that we make sure that they all hear us, in addition to Mr. Trump,\" Chiron said. \"I'm not sure 1,000 people would be attending this fundraiser if they were fully aware of Mr. Trump's anti-choice positions.\" Boch, the evening's host, told CNN Thursday that he received around 1,000 RSVPs to the $100-per-head event. The Trump campaign, however, has said the gathering is not a fundraiser and that the proceeds will simply cover the costs of the event. Trump \"doesn't talk like the politician, he really speaks his mind,\" Boch said when asked what he finds appealing about Trump. \"You may not like Mr. Trump's message, you may disagree with Mr. Trump's message, but you cannot deny that he has changed the game.\" CNN's Sara Murray contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-08-29T01:22:00.000+03:00", "crawled": "2015-08-29T01:56:43.882+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}