{"organizations": ["FBI", "Relacion Historica de la Vida", "Andrews Air Force Base", "Congress", "White House", "Air Force", "CNN", "Apostolica Tareas del Venerable", "Supreme Court"], "uuid": "1082851e33e450eb5bd117c41e95f26e8480e0b4", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150922173502-pope-francis-arrives-in-u-s--large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_us.rss\r", "section_title": "CNN.com - U.S.", "url": "http://edition.cnn.com/2015/09/23/politics/pope-francis-washington-visit-updates/index.html?eref=rss_us", "country": "US", "title": "Obama welcomes Pope Francis at White House", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama welcomes Pope Francis at White House", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T16:27:00.000+03:00", "replies_count": 0, "uuid": "1082851e33e450eb5bd117c41e95f26e8480e0b4"}, "author": "", "url": "http://edition.cnn.com/2015/09/23/politics/pope-francis-washington-visit-updates/index.html?eref=rss_us", "ord_in_thread": 0, "title": "Obama welcomes Pope Francis at White House", "locations": ["United States", "Cuba", "Washington", "Philadelphia", "Old Mission Santa Barbara", "United States People", "California", "New York City", "New York", "America", "Mexico", "U.S.", "United States The Pope", "Santa Barbara", "Maryland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francisco Palou", "Francis", "Joe Biden", "Barack Obama", "Pope Francis", "Serra", "Obama", "Michelle Obama", "Father Serra", "Kevin Liptak", "Fermin Francisco de Lasuen", "Father Serra Washington", "Junipero Serra", "Father Jose Mosqueda", "Daniel Burke"], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Pope Francis gets political in Washington debut Updated 1444 GMT (2144 HKT) September 23, 2015 JUST WATCHED Story highlights Francis has very busy schedule Wednesday The Pope will first got to the White House, followed by the National Mall for a parade In the afternoon, Francis will canonize American saint Father Serra Washington (CNN) Pope Francis immediately dove into the whirlpool of U.S. politics on Wednesday, using his first direct address to the American people to weigh in on deeply divisive issues including climate change, Cuba, marriage and immigration. The pontiff, speaking before 11,000 ticketed guests at an elaborate welcoming ceremony on South Lawn of the White House, signaled he will take on controversial issues during his six-day visit. In prepared remarks that were laced more with politics rather than overtly religious messages and Scripture, Francis said he was ready to listen to the \"hopes and dreams of the American people\" and to offer guidance to those charged with guiding the nation's political future \"in fidelity to its founding principles.\" In comments that could antagonize Republicans, Francis endorsed President Barack Obama's efforts on climate change and rebuilding ties with Cuba after more than half a century of estrangement. 14 photos: Pope Francis in the United States People gather early Wednesday, September 23, along Pope Francis' parade route around the Ellipse south of the White House in Washington. Francis will be in the United States for six days, visiting Washington, New York and Philadelphia. It is his first trip to the country. Hide Caption 14 photos: Pope Francis in the United States Pope Francis departs from Andrews Air Force Base in Maryland on Tuesday, September 22. Hide Caption 14 photos: Pope Francis in the United States Pope Francis waves from his car after arriving at Andrews Air Force Base. Hide Caption 14 photos: Pope Francis in the United States People cheer for Pope Francis at the Air Force base. Hide Caption 4 of 14 14 photos: Pope Francis in the United States Pope Francis is escorted by U.S. President Barack Obama, first lady Michelle Obama and their daughters after arriving in the country. Hide Caption 5 of 14 14 photos: Pope Francis in the United States Clergy members brace for the wind as they stand on the tarmac at Andrews Air Force Base. Hide Caption 14 photos: Pope Francis in the United States People watch as Pope Francis arrives. Hide Caption 14 photos: Pope Francis in the United States Pope Francis shakes hands with dignitaries, including Vice President Joe Biden, after his plane landed. Hide Caption 14 photos: Pope Francis in the United States Pope Francis laughs with Obama upon his arrival. Hide Caption 14 photos: Pope Francis in the United States The Pope walks down the steps of his plane. Hide Caption 14 photos: Pope Francis in the United States The Pope waves at Obama and his family. Hide Caption 11 of 14 14 photos: Pope Francis in the United States Nuns pose for a selfie with a Pope Francis cutout at a conference in Philadelphia on September 22. Hide Caption 12 of 14 14 photos: Pope Francis in the United States A mural of Pope Francis was painted on the side of a building in New York City. Hide Caption 14 photos: Pope Francis in the United States Workers in Philadelphia build a stage Thursday, September 17, ahead of Pope Francis' scheduled visit. Hide Caption 14 of 14 He said it was \"encouraging that you are proposing an initiative for reducing air pollution. Accepting the urgency, it seems clear to me also that climate change is a problem that can no longer be left to a future generation.\" \"When it comes to the care of our 'common home' we are living at a critical moment of history.\" Francis also made reference to one of the central themes of his papacy: that the modern global economy is enriching the few at the expense of the many. A brief history of popes and presidents \"I would like all men and women of good will in this great nation to support the efforts of the international community to protect the vulnerable in our world and to stimulate integral and inclusive models of development,\" Francis said. But he also delivered a firm defense of traditional values, warning that the institution of marriage and family needed to be protected at \"a critical moment in the history of our civilization,\" remarks that could irk liberals months after the Supreme Court ruled in favor of same-sex marriage nationwide. He said that it was right that society was \"tolerant and inclusive\" but warned that American Catholics were \"concerned that efforts to build a just and wisely ordered society respect their deepest concerns and their right to religious liberty. That freedom remains one of America's most precious possessions.\" 5 photos: 5 photos: Few images exist of 18th-century Spanish missionary Junipero Serra, a founding figure of the American West. This portrait has become one of the standard representations of him and was done in the early 1900s by a Mexican priest, Father Jose Mosqueda, who said he copied it from a work that could have been an original portrait of Serra from the 1750s. Hide Caption 1 of 5 5 photos: This is Serra's personal \"novena\" prayer book, which is kept in the archives of Old Mission Santa Barbara. The first page is in Spanish. Hide Caption 2 of 5 5 photos: Here's another image of Junipero Serra from a first-edition book about the Spanish Franciscan friar entitled, \"Relacion Historica de la Vida y Apostolica Tareas del Venerable Padre Fray Junipero Serra,\" by Father Francisco Palou. His book was first published in Mexico in 1787. Hide Caption 3 of 5 5 photos: This is how Father Serra signed his name on a letter about the value of prayer to another Franciscan friar, Fermin Francisco de Lasuen. Hide Caption 4 of 5 5 photos: Serra often corresponded about the California missions as he evangelized Native Americans in the late 1700s. This letter is written by Serra's own hand and is kept in a climated-controlled vault at Old Mission Santa Barbara. Hide Caption 5 of 5 And stepping into another delicate political issue, the Argentine-born Francis pointedly noted that he was a \"son of immigrants\" -- a sign that he could step into the debate later in his visit on how to handle millions of undocumented immigrants in the United States that has roiled the 2016 presidential campaign. Opinion: 10 ways Pope Francis challenges us Obama paid warm tribute to the Pope as an individual as well as the leader of 70 million U.S. Catholics, saying he displayed \"unique qualities\" of a leader \"whose moral authority comes not just through words but also through deeds.\" The White House has said that Obama will not seek to exploit the visit of Francis for political gain -- but the president warmly welcomed the pontiff's support on climate change and Cuba, for which he is trying to build domestic support. \"Holy Father, we are grateful for your invaluable support of our new beginning with the Cuban people, which holds out the promise of better relations between our countries, greater cooperation across our hemisphere, and a better life for the Cuban people,\" Obama said. The president also said the Pope had offered reminders that \"we have have a sacred obligation to protect our planet.\" \"We support your call to all world leaders to support the communities most vulnerable to a changing climate and to come together to preserve our precious world for future generations.\" The Pope's visit is grinding Washington to a halt as thousands of people gather on downtown streets along a parade route Francis will trace in his popemobile following Oval Office talks with Obama. The Secret Service, FBI and other law enforcement agencies are mounting a huge security operation, which is complicated by the Pope's desire to interact directly with this crowds. Francis will later turn to pastoral duties, leading prayers at a Washington cathedral before celebrating an open air Mass in the evening. Francis' next political intervention could come on Thursday when he makes an address to a joint meeting of Congress. He will travel to New York and Philadelphia later in the week to wrap up his six-day visit. CNN's Daniel Burke and Kevin Liptak contributed to this report <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div>", "external_links": [], "published": "2015-09-23T16:27:00.000+03:00", "crawled": "2015-09-23T16:55:12.120+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}