{"organizations": ["Congress", "Justice Department", "Navy", "U.S. Navy", "CNN"], "uuid": "26c54e46e2fd37dcae5212d6bc45428e31c135b0", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150615194052-scott-walker-border-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/09/02/politics/scott-walker-obama-police-killings/index.html?eref=rss_latest", "country": "US", "title": "Scott Walker links police killings to President Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Scott Walker links police killings to President Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T01:52:00.000+03:00", "replies_count": 0, "uuid": "26c54e46e2fd37dcae5212d6bc45428e31c135b0"}, "author": "", "url": "http://edition.cnn.com/2015/09/02/politics/scott-walker-obama-police-killings/index.html?eref=rss_latest", "ord_in_thread": 0, "title": "Scott Walker links police killings to President Obama", "locations": ["Minnesota", "America", "Washington", "South Carolina", "Charleston", "Texas", "Wisconsin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kristin Beck", "Barack Obama", "Scott Walker", "Walker", "Obama", "Jeremy Moorhead", "S.E. Cupp"], "text": "In an op-ed, Walker lays the blame for recent fatal police shootings on the White House He cited his record in Wisconsin protecting both law enforcement and the people they arrest Washington (CNN) Republican presidential candidate Scott Walker is tying the recent spate of police killings to President Barack Obama, calling him a divider-in-chief. In an op-ed posted Wednesday on the conservative site Hot Air, Walker notes recent fatal police shootings in Texas and Illinois, laying blame squarely at the front door of the White House. \"In the last six years under President Obama, we've seen a rise in anti-police rhetoric,\" the Wisconsin governor wrote. \"Instead of hope and change, we've seen racial tensions worsen and a tendency to use law enforcement as a scapegoat.\" According to the National Law Enforcement Officers Memorial Fund , gunfire-related fatalities among officers are actually down this year compared with the same time last year by 13%. Traffic-related deaths are up. Since 2008, the number of officers being fatally shot peaked in 2011, but has fluctuated year-to-year. Walker decried a culture in which protesters chant about \"pigs\" to be \"fried like bacon,\" a slogan used by protestors over the weekend in Minnesota who displayed a \"Black Lives Matter\" banner. \"This inflammatory and disgusting rhetoric has real consequences for the safety of officers who put their lives on the line for us and hampers their ability to serve the communities that need their help,\" Walker said. RELATED: Police officers killed thousands of miles apart He cited his record in Wisconsin protecting both law enforcement and the people they arrest, including a law requiring an investigation if a suspect dies in custody. Walker said while local police need to be trained to use force appropriately, they also need the backing of politicians. \"After years of division under President Obama, America needs a leader who will seek to unite all Americans. Instead of focusing on what divides us, we need to concentrate on what brings us together,\" Walker said. \"No law enforcement officer should fear to do their job the way he or she was trained to do it, and no law-abiding citizen should fear for their safety from those sworn to protect us.\" He pledged that if he is elected president, he would follow the example of the victims of a racially motivated shooting in Charleston, South Carolina, to unite the nation. Obama eulogized the victims of that shooting in a widely heralded speech. He also directed the Justice Department to work on strengthening the relationship between communities and law enforcement, in the wake of the Ferguson riots -- tensions between activists and police have run high the past year since a fatal shooting by police there. Since then, there have been a number of fatal shootings or deaths in police custody of Americans around the country, sparking riots and protests. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> Politics Originals The Navy SEAL running for Congress, who happens to be transgender By S.E. Cupp; Video by Jeremy Moorhead, CNN So it's not every day that I get to go out with a former U.S. Navy SEAL to learn tactical shooting. But in addition to being a top weapons consultant, my friend, Kristin Beck, just happens to also be transgender.", "external_links": [], "published": "2015-09-03T01:52:00.000+03:00", "crawled": "2015-09-03T01:57:41.071+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}