{"organizations": [], "uuid": "25e045ed92c43d3041554d3c47802f7f07341e1b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obama-netanyahu-benjamin_032013getty_2.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/253845-obama-to-meet-netanyahu-in-november", "country": "US", "title": "Obama to meet Netanyahu in November", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to meet Netanyahu in November", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T21:03:00.000+03:00", "replies_count": 0, "uuid": "25e045ed92c43d3041554d3c47802f7f07341e1b"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/253845-obama-to-meet-netanyahu-in-november", "ord_in_thread": 0, "title": "Obama to meet Netanyahu in November", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to meet Netanyahu in November Getty Images By Jordan Fabian - 09/16/15 02:03 PM EDT \nIsraeli Prime Minister Benjamin Netanyahu will hold a highly anticipated meeting with President Obama on November 9, the White House announced Wednesday. \nObama and Netanyahu are expected to discuss the Iran nuclear agreement and a new security assistance deal, among other issues. \n“Prime Minister Netanyahu's visit is a demonstration of the deep and enduring bonds between the United States and Israel as well as the unprecedented security cooperation, including our close consultations to further enhance Israel's security,” press secretary Josh Earnest said in a statement. ADVERTISEMENT The meeting will mark the leaders’ first face-to-face encounter since the July finalization of the Iran nuclear deal — an accord Netanyahu has fiercely criticized.\nWhite House officials had floated the possibility of a meeting between Obama and Netanyahu to discuss the controversial pact after negotiations were completed. \nThe two leaders are also expected to discuss a new 10-year agreement on U.S.-Israel security cooperation, including military aid, and “countering Tehran’s destabilizing activities” in the Middle East, Earnest said. \nObama and Netanyahu will also touch upon Israeli-Palestinian relations and “the need for a genuine advancement of a two state solution.” \nThe two leaders have had a rocky relationship since both took office in 2009, but it reached a low point in March when the Israeli leader blasted the Iran nuclear agreement in a speech to Congress. \nThe president did not meet with Netanyahu during his U.S. visit in March. Their last in-person meeting was in October 2014. \nObama and Netanyahu have also clashed over the prime minister’s wavering on the creation of a Palestinian state during his reelection campaign this summer. \nNetanyahu later reaffirmed that he supports a two-state solution. \nThe meeting also comes on the heels of clashes between Israeli police and Palestinians at a Jerusalem holy site during Rosh Hashanah, the Jewish new year. Tags:", "external_links": [], "published": "2015-09-16T21:03:00.000+03:00", "crawled": "2015-09-16T21:50:58.396+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}