{"organizations": [], "uuid": "289da177a0a7f4da6d382f5c6cc53c4d10c398a2", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/09/29/castro-obama.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/09/29/raul-castro-y-barack-obama-celebran-segunda-reunion-bilateral-en-la-onu", "country": "", "title": "Raúl Castro y Barack Obama celebran segunda reunión bilateral en la ONU", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Raúl Castro y Barack Obama celebran segunda reunión bilateral en la ONU", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T17:42:00.000+03:00", "replies_count": 0, "uuid": "289da177a0a7f4da6d382f5c6cc53c4d10c398a2"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/09/29/raul-castro-y-barack-obama-celebran-segunda-reunion-bilateral-en-la-onu", "ord_in_thread": 0, "title": "Raúl Castro y Barack Obama celebran segunda reunión bilateral en la ONU", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "2768 Raúl Castro y Barack Obama celebran segunda reunión bilateral en la ONU El embargo económico será el tema de la reunión, ambos mandatarios lo trataron al hablar ante la 70 Asamblea de la ONU este lunes Martes, 29 de septiembre de 2015 a las 09:30 Los mandatarios posaron para las cámaras antes de iniciar su reunión (Reuters). Lo más importante Cuba y Estados Unidos anunciaron en diciembre pasado el restablecimiento de sus relaciones diplomáticas rotas por más de medio siglo Temas relacionados \n(CNNMéxico) — Barack Obama y Raúl Castro celebran este martes en la sede de las Naciones Unidas su segunda reunión tras el restablecimiento de las relaciones diplomáticas entre Estados Unidos y Cuba. \nAmbos líderes hablaron este lunes ante la Asamblea General de Naciones Unidas. \nObama dijo que es \"inevitable\" que el Congreso de su país levante la sanción contra la isla. \n\"El cambio no llegará de la noche a la mañana a Cuba, pero estoy convencido de que se va a mejorar el nivel de vida de los cubanos, tal como se lo merecen, así como la cooperación de Cuba con otros países\". \nCastro reiteró en su primera presentación ante la Asamblea que a pesar del restablecimiento de los lazos diplomáticos, la normalización de las relaciones entre La Habana y Washington están condicionadas por el levantamiento del embargo económico y la devolución del territorio que ocupa la Base Naval que Estados Unidos tiene en Guantánamo. \nCuba y Estados Unidos anunciaron en diciembre pasado el restablecimiento de sus relaciones diplomáticas rotas por más de medio siglo. \nLa reunión de este martes sigue a la que ambos mantuvieron en Panamá en abril pasado en el marco de la Cumbre de las Américas y que fue el primer encuentro entre gobernantes de Cuba y Estados Unidos en más de cinco décadas. \nFuncionarios de Estados Unidos y Cuba han sugerido que Obama podría visitar la isla el año entrante, si es que hay avances significativos para la normalización plena de sus lazos. Encuentra este artículo con: castro, obama, reunion, cuba,e stados unidos, onu, asamblea Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"989392cdfb1043cdb8d42750aa068765\", \"time\": \"2015-09-29T14:43:11.919Z\" } Video ", "external_links": [], "published": "2015-09-29T17:42:00.000+03:00", "crawled": "2015-09-29T17:43:19.716+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}