{"organizations": [], "uuid": "76fb30049134cbb7f6c147aec95488360a132cf6", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/082515_oreilly_ppvid_640.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/politics/2015/08/27/fox-news-poll-views-divided-over-issues-involving-abortion/", "country": "US", "title": "Fox News Poll: Views divided over issues involving abortion", "performance_score": 2, "site": "foxnews.com", "participants_count": 16, "title_full": "Fox News Poll: Views divided over issues involving abortion | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 24, "uuid": "329f85d7039a5cc1f73c681fde8492601976ac1f"}, "author": "Dana Blanton", "url": "http://www.foxnews.com/politics/2015/08/27/fox-news-poll-views-divided-over-issues-involving-abortion/#post-0", "ord_in_thread": 0, "title": "Fox News Poll: Views divided over issues involving abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Dana Blanton \n  FoxNews.com   livefyre Email Print \nThe country is closely divided over abortion and fetal tissue research, yet tends to view Planned Parenthood favorably. \nThe latest Fox News poll asks about these issues, as well as the secretly-shot videos that show Planned Parenthood employees talking about dollar amounts associated with fetal tissue and organs from abortions. \nNearly half of voters have seen or heard about the videos (49 percent).  More self-identified pro-life voters (54 percent) report having seen the videos than pro-choice voters (46 percent). \nAmong those familiar with the videos, 49 percent describe them as disturbing and would prefer to stop the use of fetal tissue from abortions in medical research.  Forty-three percent agree the videos are disturbing, but say the research should continue.\nAdditional undercover videos were released since the poll was conducted.\nCLICK HERE TO READ THE POLL RESULTS \nThe numbers are about the same when all voters are asked generally about using organs and tissue from aborted human fetuses for medical research on deadly diseases:  48 percent approve vs. 47 percent disapprove.\nMajorities of Democrats (64 percent) and independents (56 percent) approve of fetal tissue research in general, while more than two-thirds of Republicans disapprove (69 percent).\nBy a 52-42 percent margin, voters think Planned Parenthood should receive federal funding.   \nGroups most likely to support government funding include Democrats (79 percent), liberals (79 percent), blacks (79 percent), pro-choice voters (74 percent), young voters (64 percent), urbanites (61 percent) and women (55 percent).\nThose most likely to oppose federal funding include Republicans (72 percent), white evangelical Christians (69 percent), those in the Tea Party movement (69 percent), pro-life voters (64 percent), conservatives (61 percent) and regular church-goers (53 percent).\nIn addition, more voters than not view Planned Parenthood positively: 50 percent have a favorable opinion, while 38 percent view it unfavorably.  Six percent say they have never heard of Planned Parenthood.\nWomen (54 percent) are more likely than men (46 percent) and blacks (66 percent) are more likely than whites (46 percent) to have a positive view. \nThere’s also a big difference among age groups, as 61 percent of voters under age 30 have a favorable opinion of Planned Parenthood compared to just 44 percent of those ages 55 and over.\nDemocrats (74 percent) are more than three times as likely as Republicans (22 percent) to feel positively toward Planned Parenthood.  For independents, 52 percent have a favorable opinion.\nMeanwhile, 47 percent of voters consider themselves pro-choice, while 46 percent are pro-life.  Earlier this year more voters identified as pro-choice by a five-point margin (49 vs. 44 percent in April 2015).  Opinion has been narrowly divided on the abortion issue for years and which view is on top shifts back and forth. \nThe Fox News poll is based on landline and cell phone interviews with 1,008 randomly chosen registered voters nationwide and was conducted under the joint direction of Anderson Robbins Research (D) and Shaw & Company Research (R) from August 11-13, 2015. The poll has a margin of sampling error of plus or minus three percentage points for all registered voters.", "external_links": [], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-28T02:11:52.614+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}