{"organizations": [], "uuid": "45e9c410e5af429cf5bc1c185b54def717238cdd", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150930094205-prison-cell-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_topstories.rss", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/09/30/news/economy/arne-duncan-prisons-schools/index.html?section=money_topstories", "country": "US", "title": "Obama admin: Shift billions from prisons to schools", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama admin: Shift billions from prisons to schools", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T17:57:00.000+03:00", "replies_count": 0, "uuid": "45e9c410e5af429cf5bc1c185b54def717238cdd"}, "author": "", "url": "http://money.cnn.com/2015/09/30/news/economy/arne-duncan-prisons-schools/index.html?section=money_topstories", "ord_in_thread": 0, "title": "Obama admin: Shift billions from prisons to schools", "locations": ["Logan Whiteside"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "By Logan Whiteside @LoganWhiteside Lock up fewer people who get arrested for nonviolent crimes. And give the money you save to students and teachers. \nThat's the message Education Secretary Arne Duncan will deliver Wednesday in a speech at the National Press Club in Washington. \n\"It's about setting a different direction as a society, a different priority -- one that says we believe in great teaching early in our kids' lives, rather than courts, jails and prisons later,\" Duncan said in prepared remarks. \nTo that end, Duncan said if state and local governments could redirect half of those convicted of nonviolent crimes onto different paths to avoid jail time, it would save more than $15 billion a year. \nMoney could then be used to give all teachers in the poorest school districts a 50% raise. \nRelated: White House: Let's educate inmates \n\"I've long said great teachers deserve to be paid far more,\" Duncan said. \"With a move like this, we'd not just make a bet on education over incarceration, we'd signal the beginning of a long-range effort to pay our nation's teachers what they are worth.\" \nDuncan's suggestions for reallocating funds are part of the Obama administration's push to fix the criminal justice system. The Department of Education does not have the authority to implement these changes. Ultimately, it falls to state and local leaders to decide. \nAnd Duncan says those leaders will better know what's best for the community. As another option, he suggested creating five leadership positions for accomplished teachers at struggling schools, and giving them each a $25,000 raise. \nRelated: Costly prison fees are putting inmates deep in debt \nHe said it's about giving students the tools to succeed, especially minorities who face staggering incarceration rates. \nAn African-American male between the age of 20 to 24, who doesn't have a high school diploma or GED, has a higher chance of being imprisoned than of being employed, according to the Education Department. \nDuncan also points to Ferguson, Missouri, where the fatal police shooting of Michael Brown occurred. The school district there spends $9,000 per student. Just a few miles away in Clayton, funding is double that. \n\"In the last three decades, state and local correctional spending in this country has increased almost twice as fast as spending on elementary and secondary education. Ask yourself, 'What does that say about what we believe?'\"", "external_links": [], "published": "2015-09-30T17:57:00.000+03:00", "crawled": "2015-09-30T18:25:27.465+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}