{"organizations": ["GOP"], "uuid": "8708272b11ead5391aff0b1f643a0854966107fb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_092115getty_1.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/homenews/senate/254439-gop-wants-budget-talks-with-obama-not-pelosi-and-reid", "country": "", "title": "GOP wants budget talks with Obama — not Pelosi and Reid | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "GOP wants budget talks with Obama — not Pelosi and Reid | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T13:28:00.000+03:00", "replies_count": 0, "uuid": "8708272b11ead5391aff0b1f643a0854966107fb"}, "author": "", "url": "http://thehill.com/homenews/senate/254439-gop-wants-budget-talks-with-obama-not-pelosi-and-reid", "ord_in_thread": 0, "title": "GOP wants budget talks with Obama — not Pelosi and Reid | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alexander Bolton", "Pelosi", "Reid", "Obama"], "text": "GOP wants budget talks with Obama — not Pelosi and Reid Getty Images By Alexander Bolton - 09/22/15 06:00 AM EDT \nRepublicans want President Obama as a negotiating partner when it comes to budget talks, something Democrats are determined to avoid. \nWith a little more than a week to prevent a government shutdown, the GOP thinks the talks should be between them and Obama since they now have control of the House and Senate. ADVERTISEMENT Losing the Senate in last year’s midterm elections should force Obama to deal with them, they say.\nDemocrats, however, are determined to keep a seat at the table — in part because they think they’ll drive a tougher bargain than Obama, whose past efforts to make deals with Republicans unnerves Capitol Hill liberals. \nIn this case, Obama seems likely to go along with congressional Democrats — especially after bruising fights over trade policy and the Iran nuclear deal. \nBut Democrats are leaving nothing to chance. \nSenate Majority Leader Harry Reid (D-Nev.) and House Minority Leader Nancy Pelosi (D-Calif.) met with Obama at the White House on Thursday. At the end of the meeting, Pelosi and Reid spoke to reporters and said all agreed on their strategy moving forward. \nAnd on Monday, the White House stated its desire for Republicans to negotiate with congressional Democrats. \n“We've been disappointed that Republican leaders in Congress have not accepted the Democrats' invitation to engage in serious budget negotiations,” spokesman Josh Earnest said. “We believe those kinds of negotiations are required to find common ground to avert a government shutdown and just as importantly make sure that or national security and economic priorities are adequately funded.” \nSenate Majority Leader Mitch McConnell (R-Ky.) last week framed the upcoming talks as primarily between GOP leaders and the administration. \nHe said a short-term funding resolution “will give time for us to engage with the administration in determining how much we're going to spend and where we're going to spend it.” \nA Senate Republican leadership source insisted 2015 will not be a replay of 2013, when the Senate and House budget chairmen at the time, Sen. Patty Murray (D-Wash.) and Paul Ryan (R-Wis.), took the lead in negotiating a two-year deal. \n“That’s not going to happen,” the source said. “It’s going to be between Boehner and McConnell and Obama or whoever Obama appoints, maybe [White House chief of staff Denis] McDonough.” \nCongressional Republicans don’t want to raise discretionary spending caps — further chipping away at what they view as the historic achievement of the 2011 Budget Control Act — unless it’s offset with cuts to entitlement programs. \nAnd they think Obama might be more willing than members of Congress to engage in tradeoffs — which could go beyond spending issues to involve reauthorizing the Export-Import Bank, raising the debt ceiling or funding highway and infrastructure projects. \nWhile Congress faces a short-term deadline of Oct. 1 to prevent a shutdown, Washington is also trying to reach a deal on a longer spending measure that would run through the end of the fiscal year in September 2016. \n“They think they can get a better deal from Obama,” Darrell West, director of the governance studies program at the Brookings Institution, said of congressional Republicans. \n“When you look at past negotiations, Obama often has been willing to compromise on Democratic principles in ways his congressional counterparts have not been willing to do,” he said. \nDemocratic leadership aides argue that Reid and Pelosi — or their surrogates — should be involved in the talks because Republicans will need Democratic support to pass a package through both chambers. \n“A budget agreement will require Democratic votes so Hill democrats are very much relevant,” said an aide. \nIn 2011, senior aides to Obama and Boehner discussed cutting hundreds of billions of dollars in Medicare spending by raising the eligibility age and curbing the growth of Social Security benefits by implementing a new formula for calculating inflation. \nRepublicans were happy with the deal McConnell and Vice President Joe Biden (D-Del.) hammed out in the final days of 2012 making the Bush-era income tax rates permanent for individuals earning less than $400,000. \n(Biden, who has frequently been a deal maker for the White House, may be unable to take part this year as he considers running for the presidency himself. ) \nDemocrats voted overwhelming for the deal because they feared the across-the-board expiration of lower tax rates would create economic turmoil but they weren’t thrilled. \nCongressional Democrats say they haven’t received any indication this year that McConnell or Boehner is interested in talking to them. \n“Republicans are in charge in the Senate. Certainly, I’m willing to work with anybody but they have to make the decision on how they’re going to put this together and we’re waiting to hear from them,” Murray told The Hill. \n“Nobody knows what’s going to happen, at least on our side,” said a Democratic leadership aide. \nDemocrats want to combine the year-end spending talks, which will determine funding levels for fiscal year 2016, with negotiations over a multi-year transportation bill and overseas corporate tax reform that could raise billions of dollars in new revenue. \nMurray, who is now the senior Democrat on the Health Committee, published an op-ed in The Seattle Times Friday, calling on Republicans to “skip the government shutdown this time and let us go straight to bipartisan negotiations.” Two years ago, a 16-day shutdown preceded the year-end budget deal. \nRyan doesn’t envision himself sitting down with Murray this time around. \n“I’m busy doing Ways and Means issues. It’s somebody else’s job to do budget,” he said, referring to the tax-writing panel he now chairs. \nRyan also quashed the idea of merging a package linking highway funding and corporate tax reform into the year-end negotiations. \n“I’m working on highways and taxes,” he said. “Those are separate, we’re keeping them separate.” \nCongressional Democrats have suggested that if corporate tax reform is used to pay for a multi-year highway bill, the offsets identified earlier this year by McConnell to pay for transportation could be used to ease the budget caps. \nMcConnell wants to keep the two negotiations separate. \nJordan Fabian contributed. ", "external_links": [], "published": "2015-09-22T13:28:00.000+03:00", "crawled": "2015-09-22T13:29:05.599+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}