{"organizations": [], "uuid": "abb19104fa44522e770bb74e687fa3ea26f5e2e5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e5e4d71d00006e001467f9.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/iran-deal-within-one-vote-of-being-veto-proof_55e5e3d0e4b0c818f61948c5", "country": "", "title": "Obama Within One Vote Of Victory On Iran Deal", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Within One Vote Of Victory On Iran Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "abb19104fa44522e770bb74e687fa3ea26f5e2e5"}, "author": "", "url": "http://www.huffingtonpost.com/entry/iran-deal-within-one-vote-of-being-veto-proof_55e5e3d0e4b0c818f61948c5", "ord_in_thread": 0, "title": "Obama Within One Vote Of Victory On Iran Deal", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bob Casey", "Chris Coons", "Laura Barron-Lopez"], "text": "Obama Within One Vote Of Victory On Iran Deal Sens. Chris Coons and Bob Casey announced their support for the deal Tuesday. Laura Barron-Lopez Congressional Reporter, The Huffington Post Posted: 09/01/2015 02:19 PM EDT | Edited: 09/01/2015 04:07 PM EDT Bloomberg via Getty Images \nWASHINGTON -- Sen. Chris Coons (D-Del.) came out in favor of the Iran nuclear deal on Tuesday, calling his decision a \"very hard choice\" and putting the Obama administration within one vote of a victory. \nCoons is the 33rd Senate Democrat to come out in favor of the deal, which curbs Iran’s nuclear program in exchange for some sanctions relief provided by President Barack Obama. The president only needs one more Senate Democrat in support of the deal to reach 34, the number needed to sustain his veto on a resolution of disapproval. \n“I will support this agreement because it puts us on a known path of limiting Iran’s nuclear program for the next 15 years with the full support of the international community,\" Coons said during a speech at the University of Delaware. \"The alternative, to me, is a scenario of uncertainty and isolation.\" \nSenate Majority Leader Mitch McConnell (R-Ky.) could bring up the resolution of disapproval for a Senate vote as early as the second week of September, when the upper chamber returns from its summer recess. \nCoons said he plans to \"vote against any measures to disapprove it in Congress.\" \nHe was careful to note that it is not a \"perfect\" deal, but the \"most credible\" option to contain an \"existential threat.\" \nOver the last 10 days, Coons said, he spoke with Obama, Vice President Joe Biden and other administration officials, pressing for a redoubling of efforts to help maintain Israel's security through intelligence sharing, military operations and investment in its defense preparations. \nCoons said he did not receive a response from Obama to a letter laying out these concerns until Tuesday . Had Obama not responded, Coons admitted, his decision could have played out quite differently. \n\"I spent time last night thinking about delaying the speech,\" he said. \nBiden appeared to play a key role for Coons, who said the vice president took time to have a \"constructive conversation\" with him. \n\"I relied on his guidance on to whom I should go in the administration as to how to get these questions resolved,\" Coons said. \"I went through a whole series of concerns and saying, 'I am just having difficulty getting reassures getting to the bottom of this, getting clarity on this,' and we had a very positive and substantive conversation. \nCoons’ decision, which was first reported in The Washington Post, came just one hour after fellow Democrat Sen. Bob Casey (Pa.) announced he would back the deal after what he called \"six weeks of intensive review.\" \n\"This agreement will substantially constrain the Iranian nuclear program for its duration, and compared with all realistic alternatives, it is the best option available to us at this time,\" Casey said in his 17-page statement, vowing to also vote to sustain a presidential veto. \nThe controversy surrounding the deal didn't escape Casey, who added that it \"was one of the most difficult decisions of my public career.\" \nEleven Senate Democrats have yet to announce their position on the deal. Those who remain undecided have pointed to Israel's security as a reason for hesitancy. \nSens. Chuck Schumer (D-N.Y.) and Bob Menendez (D-N.J.) are the only Senate Democrats to come out in opposition to the deal so far. \n﻿CORRECTION: ﻿Due to an editing error, the headline on an earlier version of this story said the deal was within one vote of being veto-proof. In fact, the Senate needs one more vote to be able to sustain Obama's veto of the resolution. ", "external_links": [], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-03T10:46:32.248+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}