{"organizations": [], "uuid": "6fd1c2a332696fb65e58db0c789837751580aa45", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f5f08c2c0000a200aaf9b5.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/index.xml", "section_title": "Latino Voices - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/gop-immigration_55f5f018e4b042295e36a776", "country": "US", "title": "Immigration Reform Group Invokes Reagan In Ad Slamming GOP Nativist Rhetoric", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Immigration Reform Group Invokes Reagan In Ad Slamming GOP Nativist Rhetoric", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T00:57:00.000+03:00", "replies_count": 0, "uuid": "6fd1c2a332696fb65e58db0c789837751580aa45"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/gop-immigration_55f5f018e4b042295e36a776", "ord_in_thread": 0, "title": "Immigration Reform Group Invokes Reagan In Ad Slamming GOP Nativist Rhetoric", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration Reform Group Invokes Reagan In Ad Slamming GOP Nativist Rhetoric It uses Reagan's famous \"shining city upon a hill\" speech. Posted: 09/13/2015 05:57 PM EDT ASSOCIATED PRESS \nWASHINGTON, Sept 13 (Reuters) - Days before a Republican presidential debate at the Ronald Reagan Library, an immigration advocacy group invoked the former president to attack the tough immigration rhetoric of certain candidates, including front-runner Donald Trump. \nA television ad launched on Sunday by the National Immigration Forum Action Fund contrasts Reagan's call for the United States to welcome all people with the stances of Trump, Wisconsin Governor Scott Walker and Texas Senator Ted Cruz, who have proposed an end to birthright citizenship and urged other crackdowns. \nThe ad highlights Trump's demand for a wall along the U.S.-Mexican border and comments that Mexican immigrants were \"bringing crime\" and are \"rapists.\" \nIt shows a clip from Reagan's 1989 farewell address from the White House in which he references the journey to the United States of John Winthrop, an English Puritan who imagined America as a \"city upon a hill.\" \nReagan described his idea of the \"shining city\" as one that was \"teeming with people of all kinds living in harmony and peace.\" \n\"If there had to be city walls,\" he added, \"the walls had doors and the doors were open to anyone with the will and the heart to get here.\" \nTrump, Walker and Cruz will join other candidates including former Florida Governor Jeb Bush, former tech executive Carly Fiorina and retired neurosurgeon Ben Carson for a debate on Wednesday at the Ronald Reagan Presidential Library in Simi Valley, California. \nCarson said on CBS's \"Face the Nation\" on Sunday that Trump's plan for deporting undocumented workers is logistically unfeasible, but said he would \"turn off the spigot that dispenses the goodies\" to discourage the immigrants from coming to the United States. For undocumented immigrants already here, he said he would give them a six-month period to register. \nThe Action Fund's ad will screen nationally all week, peaking during the debate on CNN. The Fund is affiliated with the National Immigration Forum, a pro-immigration group which counts Bush's son, Jeb Bush Jr, as one of its directors. \nThe two entities share the same management and some resources but have different boards and separate budgets, according to a spokeswoman, Cathleen Farrell. \nJeb Bush, the candidate, has said Republicans should approach immigration as an opportunity to spur economic growth. (Reporting by Krista Hughes and Toni Clarke; Editing by Mary Milliken and Andrea Ricci)", "external_links": [], "published": "2015-09-14T00:57:00.000+03:00", "crawled": "2015-09-14T01:21:08.140+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}