{"organizations": [], "uuid": "9d0fa9e032a00d676c3b0130da16d3d5084c7ca5", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama2_090715getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19137#", "section_title": "TheHill - All Columnists", "url": "http://thehill.com/opinion/juan-williams/255039-juan-williams-democrats-should-embrace-obama-economy", "country": "US", "title": "Juan Williams: Democrats should embrace Obama economy", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Juan Williams: Democrats should embrace Obama economy", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T13:00:00.000+03:00", "replies_count": 0, "uuid": "9d0fa9e032a00d676c3b0130da16d3d5084c7ca5"}, "author": "Juan Williams", "url": "http://thehill.com/opinion/juan-williams/255039-juan-williams-democrats-should-embrace-obama-economy", "ord_in_thread": 0, "title": "Juan Williams: Democrats should embrace Obama economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Juan Williams: Democrats should embrace Obama economy Getty Images By Juan Williams - 09/28/15 06:00 AM EDT \nWho could have predicted that in 2015 it would be the Democrats howling about the Obama economy? \nIn the GOP primary race, the economy is the dog that has not barked. ADVERTISEMENT Given low unemployment, low gas prices and low inflation, it is easy to understand the GOP’s silence.\nThe current unemployment rate is 5.1 percent, the lowest since April 2008. \nUnder President Obama’s stewardship, the economy has added over 7 million private sector jobs. The Dow Jones has more than doubled and the NASDAQ has more than tripled. The president has exceeded every promise for speedy economic recovery made by his Republican opponent, Mitt Romney, in the 2012 campaign. \nBut now Democratic presidential candidate Sen. Bernie Sanders (I-Vt.) is drawing crowds with harsh indictments of the American economic system as unfair to the poor, the working class and the middle class. \nObama has been the keeper of that unfair economy for the last seven years. \nSanders recently described the nation as having a “rigged economy, designed by the wealthiest people in this country to benefit the wealthiest people in this country at the expense of everybody else.” \nHis criticism echoes that of Sen. Elizabeth Warren (D-Mass.) who has blasted erstwhile Obama economic officials such as Larry Summers and Tim Geithner for being too cozy with the Wall Street banks they were supposed to be regulating. \nObama critic Cornel West has appeared alongside Sanders at rallies and complained that the president’s policies have failed to lift blacks and Hispanics out of poverty. \nMeanwhile, big labor unions just lost a major fight with Obama over a new trade deal with Asian countries. \nThe unions have for decades been suffering from declining membership and declining leverage at the bargaining table. That was before the president beat them and their Democratic supporters in Congress on the trade deal in question, the Trans Pacific Partnership (TPP). He stood with the Chamber of Commerce and the GOP majority in Congress to win approval for fast-track authority pertaining to TPP. \nFormer Secretary of State Hillary Clinton, Sanders and other top Democrats give Obama credit for leading the nation’s steady economic growth after the 2008 recession. But, as with the unions, their current focus is on income inequality and stagnant wages. \n“The defining economic challenge of our time is clear,” Clinton, the Democratic frontrunner, said in July. “We must raise incomes for hard-working Americans so they can afford a middle-class life.” \nThe president, however, prefers to emphasize how the nation has recovered from an extraordinarily deep recession. \nHe is protecting his legacy by pointing out the errors of his past Republican critics. Senate Majority Leader Mitch McConnell (R-Ky.) once accused him of leading “the most anti-business administration at least since Jimmy Carter.” \nOther Republican antagonists predicted not long ago that stimulus spending, extended unemployment benefits, Wall Street reform and higher taxes on the wealthy – mostly due to bipartisan budget deals and the Affordable Care Act – would cripple the economy. \nIn his recent speech to the Business Roundtable, the president focused on those Republican criticisms, not the new carping from Democrats. \n“Seven years ago today was one of the worst days in the history of our economy,” he said, going on to note that in September 2008 “stocks had suffered their worst loss since 9/11…businesses would go bankrupt, millions of Americans would lose their jobs and their homes, and our economy would reach the brink of collapse.” \nObama then offered a contrasting picture of the current economy to the mostly Republican businessmen: \n“Here’s where we are today: Businesses like yours have created more than 13 million new jobs over the past 66 months -– the longest streak of job growth on record. The unemployment rate is lower than it’s been in over seven years. There are more job openings right now than at any time in our history. Housing has bounced back. Household wealth is higher than it was before the recession.” \nObama’s victory lap might also include mention that this year’s Republican candidates have no answer for income inequality. In fact, with the exception of Donald Trump, the current Republican candidates consistently call for tax cuts for the rich that would worsen inequality by widening the wealth gap in the name of spurring investment. \nThese are facts. They are powerful ammunition for any Democrat who wants to run on the strength of the Obama economic record in 2016. \nBut as debates begin next month among the Democrats, you can expect that consultants will be advising the candidates that they need to “distance” themselves from Obama because of stagnant wages and income inequality. \nObama’s current approval rating is 45.7 percent and his disapproval rating is 49.8 percent, according to the RealClearPolitics average. For a president entering his final year in office, this is an average show of support and it is likely to increase before he leaves office. If the economy had sunk under his watch, his ratings would be far worse. \nIn light of economic facts, perhaps a winning message for Democrats would be to promise to continue and improve on the president’s record by dealing with stagnant wages as they seek “Obama’s third term.” \nYet, even among Democratic candidates, that seems to be too much to ask. \nMr. President, just bite your tongue and let it go. A fair reading of history will show the economy came back to life on your watch. \nJuan Williams is an author and political analyst for Fox News Channel.", "external_links": [], "published": "2015-09-28T13:00:00.000+03:00", "crawled": "2015-09-29T00:52:00.211+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}