{"organizations": [], "uuid": "e7f8a121a3a02acc3bba44c72686818650347344", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/animas.png", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/energy-environment/253842-navajos-slam-obama-for-inaction", "country": "", "title": "Navajos slam Obama for inaction | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Navajos slam Obama for inaction | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T21:21:00.000+03:00", "replies_count": 0, "uuid": "e7f8a121a3a02acc3bba44c72686818650347344"}, "author": "", "url": "http://thehill.com/policy/energy-environment/253842-navajos-slam-obama-for-inaction", "ord_in_thread": 0, "title": "Navajos slam Obama for inaction | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevin Cirilli", "Obama"], "text": "Navajos slam Obama for inaction Getty Images By Kevin Cirilli - 09/16/15 01:52 PM EDT \nThe president of the Navajo Nation slammed President Obama and Democrats for deserting the tribe's 300,000 people after the Environmental Protection Agency (EPA) accidentally polluted a river the tribe depends on, leaving one-third of the reserve's drinking water unsafe. \nIn an exclusive interview with The Hill, Navajo Nation president Russell Begaye again called on Obama and administration officials to declare the San Juan River a disaster zone. ADVERTISEMENT In August, an EPA accident led 3 million gallons of contaminated water flowing into that Animas River, which runs into the San Juan River. One-third of the Navajo Nation’s people rely on the Animus for water.\nEPA officials have insisted that the toxins have been diluted. But Begaye said he “doesn't buy it.” He argues toxins are seeping into ranchers' soil and threatening livestock and crops. \n“There's no way we can guarantee that the drinking water is safe,” he said. \n“We are asking the Democratic Party to have President Obama declare the river a disaster area — and we haven't gotten anything. Nothing,” he said. “The Democrats? I don't know what happened. We basically are Democrats. We always vote Democrat. But it seems like they've just walked away. And we're not hearing anything that's of value to us from the Democrats.” \nBegaye's interview comes as a series of hearings are set to begin on Capitol Hill examining the EPA’s response to the accident. \n“With Obama, we've been asking for him to at least give us a call and tell us you are there to help us and walk with us. But we have heard not a word. It seems like they've just closed the doors and walked away,” Begaye said. “We were the swing vote for them for years and they haven't done a thing.” \nThe Navajo Nation is the country's largest Native American tribe. Its lands cover ground in Arizona, New Mexico and Utah. \nSome Democrats have begun speaking out for more action. Following meetings earlier this month with Navajo leaders, Sen. Tom Udall (D-N.M.) said that “the agencies, instead of being bureaucratic, need to be understanding.” \nBegaye is in Washington this week for hearings and to meet with lawmakers. He’s also preparing a lawsuit against the EPA. The tribe has retained John Hueston of Hueston Hennigan LLP. \nHueston prosecuted the 2006 case against former Enron executives Kenneth Lay and Jeffrey Skilling, who were found guilty of fraud and conspiracy. \nThey're also working with Erin Brockovich , whose work as a legal clerk in the 1990s investigating illness in a poor California town linked to groundwater pollutants was immortalized in the 2000 Julia Roberts film “Erin Brockovich.” \n“We as a nation will support any person that's willing to walk with us,” Begaye said. “If it's Obama and the Democrats, or Republicans — whoever is willing to work with us, walk with us and work with us. \n“It's disturbing because this has happened to us over the years ever since we were put on reservations,” he said. “The same type of thing when it happens elsewhere? The government rushes in with millions of dollars. But not on our land — that's always been the history.” \n", "external_links": [], "published": "2015-09-16T21:21:00.000+03:00", "crawled": "2015-09-16T21:20:42.973+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}