{"organizations": [], "uuid": "f9c5f548ea848048feb48d0f2e89bc2969114d95", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150417105142-hp-gallery-putins-russia-620xa.jpg", "site_section": "", "section_title": "", "url": "http://money.cnn.com/2015/09/28/news/economy/obama-putin-russia-economy/index.html", "country": "", "title": "Obama meets Putin: 5 things to know about Russia's failing economy - Sep. 28, 2015", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama meets Putin: 5 things to know about Russia's failing economy - Sep. 28, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T16:48:00.000+03:00", "replies_count": 0, "uuid": "f9c5f548ea848048feb48d0f2e89bc2969114d95"}, "author": "", "url": "http://money.cnn.com/2015/09/28/news/economy/obama-putin-russia-economy/index.html", "ord_in_thread": 0, "title": "Obama meets Putin: 5 things to know about Russia's failing economy - Sep. 28, 2015", "locations": ["Russia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ivana Kottasova", "Putin", "Obama"], "text": "Obama meets Putin: 5 things to know about Russia's failing economy By Ivana Kottasova @ivanakottasova There is no sugarcoating it. Russia's economy is failing. \nRussian President Vladimir Putin will try to reclaim his place in the superpowers club on Monday, addressing the UN General Assembly and meeting President Obama on the sidelines to discuss the crises in Syria and Ukraine. \nBut while Putin takes center stage in New York, millions of Russians are sliding back into poverty. \nHere are five things to know about the Russian economy: \n1. Economic misery \nRussia's economy will shrink by 3.4% this year, and by a further 1% next year, according to the International Monetary Fund. Ordinary Russians are feeling the pain. Prices have shot up by nearly 16% in the year to August, official data show, and around 22 million Russians are now living in poverty. \nFalling real wages and high interest rates have hit domestic demand. \n\"Credit conditions in Russia have tightened substantially over the past six months or so, with households and small businesses being particularly hard hit,\" Liza Ermolenko, emerging markets economist at Capital Economics, wrote in a recent research note. \"We don't expect a significant turnaround anytime soon,\" she added. \nRelated: Investors pull $1 trillion from emerging markets \n2. Low oil prices \nOil is Russia's biggest earner. Around 70% of its exports are energy-related, and 50% of government revenue comes directly from the oil sector. \nOil has dropped from well above $100 per barrel last summer to around $45 per barrel. \nAnalysts estimate Russia loses $2 billion for every dollar fall in the global oil price. \nThe low oil prices are also dragging down the ruble , which has dropped by nearly 20% against the dollar since July. \nRelated: Russia hints at squeeze in oil production \n3. Sanctions pain \nWestern countries have slapped Russia with tough economic sanctions over Moscow's role in the crisis in Ukraine. The embargo has left Russian companies unable to raise money in Europe, blocked arms trade, and restricted access to oil drilling technology. \nRussia has introduced a retaliatory ban on imports of food and agricultural products from the West. \n\"It's a shock to the confidence of the population, and the confidence of foreign investors, and therefore the investment for the economy,\" said Ernesto Ramirez Rigo, IMF mission chief for Russia, earlier this month. \nThe value of imports to Russia dropped by 39% in the first eight months of the year, while exports are down 30%. \nRelated: Ikea is making loads of money in Russia. Wait, what? \n4. No new friends \nMoscow turned to China last year after being hit with sanctions by the West. But the plan for a deeper economic relationship is not working out . \nChina's slowdown is making it harder for Beijing to deliver on promises it made to Moscow, and Chinese investors are spooked by Russia's deep economic crisis. Bilateral trade has dropped by a third in 2015, and Chinese investment into Russia is down 25%. \n5. It's not just oil and sanctions \nLow oil and sanctions are hitting Russia hard, but the country has many other economic problems. \nThe IMF says Russia needs to get serious about deep economic reforms if it wants to return to growth. The country's aging population is starting to be unable to pay its welfare bills, and a large amount of bureaucratic red tape and corruption is hurting domestic investment and productivity, the IMF said. ", "external_links": [], "published": "2015-09-28T16:48:00.000+03:00", "crawled": "2015-09-28T16:48:27.879+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}