{"organizations": ["CNN"], "uuid": "323504b44a03e18acf3669788fe064eddc6401ac", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/09/01/WE01235665/3676850/JoeyValdezheadshot2jpg-3676850_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1267790", "country": "", "title": "MEXICAN ACTOR JOEY VALDEZ SEEKS TO LAUNCH A MOVIE ON A CHANNEL ABOUT IMMIGRATION IN SAN DIEGO. - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "MEXICAN ACTOR JOEY VALDEZ SEEKS TO LAUNCH A MOVIE ON A CHANNEL ABOUT IMMIGRATION IN SAN DIEGO. - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "323504b44a03e18acf3669788fe064eddc6401ac"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1267790", "ord_in_thread": 0, "title": "MEXICAN ACTOR JOEY VALDEZ SEEKS TO LAUNCH A MOVIE ON A CHANNEL ABOUT IMMIGRATION IN SAN DIEGO. - CNN iReport", "locations": ["California", "SAN DIEGO"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JOEY VALDEZ"], "text": "By misael MEXICAN ACTOR JOEY VALDEZ SEEKS TO LAUNCH A MOVIE ON A CHANNEL ABOUT IMMIGRATION IN SAN DIEGO. By stevennews | Posted 17 hours ago | 651 3rd Ave,, California \nCNN PRODUCER NOTE By Maria Gonzalez Amarillo from La Prensa San Diego published on August 21, 2015 & Translated by Steven Escobar from Diversity News Magazine via Google Translator on 8-30-2015. The short film, “Tacos for lunch” comes from Chandan Gupta in order to educate the public about immigration and hopes to show both sides of the issue. Launched in 2013, the short film is 23 minutes and 45 seconds long. It stands out in the middle of the maelstrom that is causing the immigration issue. In about a month, the creation and writer-director will premiere the film on Channel 22 in Las Vegas Century Prism and states that Joey Valdez, one of the actors in the film, “The aim is to disseminate it through a channel in San Diego before being broadcast in Las Vegas. Everything depends on the space available and given to us.” When Christine, a single woman, decides to move, she enlists the help from some local day laborers. All seems to be going well, until she leaves to get “Tacos For Lunch”. She returns to a quiet apartment and a dead worker on her floor. The day continues to spiral out of control leading to a series of unexpected crazy twisted events. The story begins with the removal of Christine (Therese McLauglhin), a US citizen, and her hiring of two Mexican immigrants, Emilio (Joey Valdez) and Paul (Billynaire Cruz), to help move boxes. By the time she leaves the house to grab a few tacos, a series of terrible events happen, culminating into an overwhelming outcome. “We know we will be successful,” the actor told member of the press. “My agent is communicating with politicians such as Donald J. Trump Sr., to express their thoughts about the film.” Valdez began his career very young: at age 3 he participated in his first play in the Smythe Elementary School in San Ysidro, California. Subsequently he became Joseph, the husband of the Virgin Mary in a Christmas play, and finally to the early age of 13 officially began studying acting with Drama teacher Enrique Nolasco from the House of Culture in Tijuana, Mexico. He is now known to have worked for Ed Magik TV, a platform video entertainment and had done interviews with famous people where Valdez was the host of “Vayaconmigo” program, broadcast in Berea Vision 31.6 in Los Angeles, in which he worked with renowned artists such as singer Elvis Crespo. Valdez is defined as a man “with traditional values who prefers to work hard for a living, rather than compromise his integrity and principles.” In turn, the actor is a frequent host to celebrities in the online magazine Ke Chevere and as collaborated with singer and actress Carmen Jara on Univision for the show “Who is right” in Miami, which exposes and tries to solve family and marital conflict. Although the actor is confident everyone will enjoy “Tacos for lunch,” he hopes that the film reaches a significant audience—enough to impact the issues at hand and generate comments in the media, as well as prominent figures, fostering discussion, debate and more empathy towards immigration. Joey Valdez has also participated in television projects in Indonesia and has worked as a presenter on the red carpet with Diversity News TV produced by Diversity News Productions whose content is broadcast via Youtube and Vimeo, DailyMotion, among other online platforms in video, and is based on entertainment events, celebrity interviews, awards, concerts, fashion and more. To watch the short film for limited time visit https://vimeo.com/128915453 and for more information on Actor Joey Valdez visit his IMDB at http://www.imdb.com/name/nm4489108/ or his official website at http://joeyvaldez.com/ TAGS: ", "external_links": [], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T20:21:46.113+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}