{"organizations": [], "uuid": "5ce00438933c49930c63d250de8f38e38be25782", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150921173421-pope-u-s-politics-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/22/politics/pope-francis-obama-white-house-meeting/index.html", "country": "US", "title": "What Pope Francis and President Obama will talk about", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "What Pope Francis and President Obama will talk about - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "5ce00438933c49930c63d250de8f38e38be25782"}, "author": "Michelle Kosinski", "url": "http://www.cnn.com/2015/09/22/politics/pope-francis-obama-white-house-meeting/index.html", "ord_in_thread": 0, "title": "What Pope Francis and President Obama will talk about", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Two broad concepts defined the first meeting between Obama and Francis: conflict and poverty. The Pope's trip to Washington comes on the heels of his visit to Cuba Washington (CNN) Climate change, Cuba and poverty are the issues the White House expects to top the agenda when President Barack Obama welcomes Pope Francis on Wednesday.\nBut beyond hot-button political topics, a senior White House official said the two men enjoy a rapport that means many different subjects could be raised, should the Pope be so inclined.\n\"The President values hearing from the Pope on a number of issues that they both care about,\" the official said. \"We expect that the Pope will feel very comfortable bringing up any issues on his mind.\"\nTwo broad concepts defined the first meeting between Obama and Francis, held in March 2014 at the Vatican: conflict and poverty.\n\"I think the theme that stitched our conversation together was a belief that, in politics and in life, the quality of empathy, the ability to stand in somebody else's shoes and to care for someone even if they don't look like you or talk like you or share your philosophy -- that that's critical,\" Obama explained at the time. \"It's the lack of empathy that makes it very easy for us to plunge into wars. It's the lack of empathy that allows us to ignore the homeless on the streets.\"\nObama described that \"wide-ranging discussion\" as focusing on both \"the issues of the poor, the marginalized, those without opportunity, and growing inequality\" and \"the challenges of conflict and how elusive peace is around the world.\"\nJUST WATCHED The man who became Pope Francis Replay More Videos ... MUST WATCH\nThe man who became Pope Francis 02:39 He noted that the Pope has \"a deep interest\" in the Israeli-Palestinian conflict, events in Syria and Lebanon, and the potential persecution of Christians.\nObama, for his part, told Francis, \"It is central to U.S. foreign policy that we protect the interests of religious minorities around the world.\"\nThe Pope's trip to Washington, however, comes on the heels of his visit to Cuba, so the island nation is expected to be high on the list of international topics Obama and Francis discuss.\nThe U.S. reestablished diplomatic relations with Cuba only this summer, with the Pope urging a reconciliation between the two governments. He met with the Castro brothers while on the island over the weekend.\nAnother key issue in the news likely to feature in the Pope's White House visit is immigration, a subject that the two also addressed in their earlier meeting.\n\"He is very mindful of the plight of so many immigrants who are wonderful people, working hard, making contributions, many of their children are U.S. citizens, and yet they still live in the shadows, in many cases have been deported and are separated from families,\" Obama said of Francis' comments to him at the Vatican.\nREAD: The Pope vs. the GOP\nThe Pope has strongly urged Catholics throughout Europe to reach out to and even take in the massive numbers of Syrian refugees currently seeking refuge from their war-torn country. The Vatican itself is housing a Syrian family, and has asked churches to do the same.\nThe U.S. has committed to taking in about 10,000 more Syrian refugees in the next fiscal year, with more expected after that, while some smaller nations have committed to take in tens of thousands. It's not clear how the Pope will address that discrepancy.\nBut the pontiff seems to focus more on common ground in meetings with leaders, with stickier issues tending not to come up in a confrontational way.\nIn Cuba, rather than harshly rebuking the Castro regime for its decades of restricting freedom for its people, President Raul Castro walked away telling reporters how the Pope makes him consider returning to the Catholic Church and praying again.\nAs Obama described it last year, \"We actually didn't talk a whole lot about social schisms in my conversations with His Holiness. In fact, that really was not a topic of conversation.\"\nHe added, \"I don't think that His Holiness envisions entering into a partnership or a coalition with any political figure on any issue. His job is a little more elevated. We're down on the ground dealing with the often profane, and he's dealing with higher powers.\"\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150921181126-pope-francis-life-before-papacy-jorge-mario-bergoglio-org-00000718-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150921181126-pope-francis-life-before-papacy-jorge-mario-bergoglio-org-00000718-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150921181126-pope-francis-life-before-papacy-jorge-mario-bergoglio-org-00000718-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150921181126-pope-francis-life-before-papacy-jorge-mario-bergoglio-org-00000718-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150921181126-pope-francis-life-before-papacy-jorge-mario-bergoglio-org-00000718-large-169.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150921181126-pope-francis-life-before-papacy-jorge-mario-bergoglio-org-00000718-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150921181126-pope-francis-life-before-papacy-jorge-mario-bergoglio-org-00000718-small-11.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-22T13:48:09.505+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}