{"organizations": [], "uuid": "46ef28434b0bab161953a378cfca0f34c1eb3b45", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3425222/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/john-a-tures/why-liberals-see-barack-o_b_8175814.html", "country": "", "title": "Why Liberals See Barack Obama as Atticus Finch | John A. Tures", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Why Liberals See Barack Obama as Atticus Finch | John A. Tures", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T17:16:00.000+03:00", "replies_count": 0, "uuid": "46ef28434b0bab161953a378cfca0f34c1eb3b45"}, "author": "", "url": "http://www.huffingtonpost.com/john-a-tures/why-liberals-see-barack-o_b_8175814.html", "ord_in_thread": 0, "title": "Why Liberals See Barack Obama as Atticus Finch | John A. Tures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Atticus Finch", "John A. Tures"], "text": "reddit \nIt's hard to say who has been more disappointed, liberals with Barack Obama, or Harper Lee fans with the portrayal of Atticus Finch in \"Go Set A Watchman,\" the sequel to \"To Kill A Mockingbird.\" Yet the real Obama and the fictitious Finch are not so different, as we have recently learned. \nIn the book \"Go Set A Watchman,\" Atticus Finch turns out to be, well, not who we thought he was. I won't provide any spoilers, as it is a good book. But when compared to his noble character in \"To Kill A Mockingbird,\" at least on the silver screen, we're in shock that he isn't the same honorable person. We expected someone else. \nThat's not too different from how progressives saw Barack Obama when he ran in 2008. They looked past his rather centrist themes and saw him as the next Franklin Delano Roosevelt. Perhaps they assumed that who Obama was would prompt the changes, not what he was saying, or not saying. There's a reason he was known as \"No Drama Obama\" and why he couldn't win a liberal congressional district in 2000. \nJonathan Chait in The New Republic did admit there were difficult economic and political circumstances that Obama faced when entering office. But that was the same with FDR, wasn't it? And Liz Halloran from NPR writes \n\"From drones and Syria to immigration and the Keystone XL pipeline, the list of issues on which the president has induced frustration and disillusionment is not a short one.And fallout from that restive base is reflected in Obama's dismal year-end poll numbers (this article was written in September 2010).His approval rating has sunk to a low point, trust in his ability to do the job has eroded, and, as a new Washington Post poll found, he has lost ground among \"key members of his winning electoral coalition\" -- women, liberals and younger voters.\" \nAlan Silverleib of CNN echoes the same thoughts in his article. \n\"'It's a mixed legacy,\" said Adam Green, head of the Progressive Change Campaign Committee, a Washington-based liberal group. 'In some areas, like ending two wars, (Obama's) presidency has represented a return to some sanity. But on the core issue of corporate power and a government that fights for the little guy, this administration so far has had a lot of missed opportunities.' More specifically, as Democrats look toward the future, there's sharp disagreement over whether to stick with a Bill Clinton-style centrist agenda or embrace the unabashed left-wing populism most notably personified by Sen. Elizabeth Warren of Massachusetts and New York Mayor Bill de Blasio.\" \nEven when Obama did something clearly liberal, like nominating Elena Kagan to the Supreme Court instead of a centrist, Michael Myers from the NAACP ( as quoted in the New York Daily News ) tried to find fault with the pick. \n\"President Obama keeps upsetting liberals - especially blacks - who took a chance on sending him to the White House. Our latest disappointment is his choice of Elena Kagan to replace retiring Supreme Court Justice John Paul Stevens.We expected if not a black liberal - to counter Clarence Thomas' mendacity - at least a full-throated liberal of any color whose views on the hot-button civil rights issues were known if not discoverable, not left to Ouija board prognostication.Kagan is at best a vicarious ... [S]he suggested race-neutral means of fixing racial problems - something that liberal Justice Thurgood Marshall, the former NAACP counsel, would have surely winced at, if she had been drafting his opinion.\" \nThis all came, even as the full NAACP endorsed Kagan when she was nominated. And she won confirmation to the Supreme Court. \nThe Nobel Prize director now even regrets giving Barack Obama the award, claiming he has \"fallen short of expectations,\" meaning that he doesn't think Obama is a man of peace, according to the Huffington Post . Conservatives who have blasted Obama for drawing down our forces in the Middle East and not used the full might of our military arsenal might disagree. \nPerhaps this is why so many self-described progressives are flocking to Vermont Senator Bernie Sanders, even when they could vote for the first female nominee to win a major party nomination, Hillary Clinton, described by Republicans as liberal, even as some liberals say she's too centrist. \nIt's not too different of situation from the climax of \"Go Set a Watchman,\" when Scout's Uncle Jack confronts her (Jean Louise Finch) about discovering Atticus Finch's secrets, on page 185 of the e-book. \n\"[N]ow you...born with your own conscience, somewhere along the line fastened it like a barnacle onto your father's. As you grew up, when you were grown, totally unknown to yourself, you confused your father with God. You never saw him as a man with a man's heart, and a man's failings--I'll grant you it may have been hard to see, he makes so few mistakes, but he makes 'em like all of us. You were an emotional cripple, leaning on him, getting the answers from him, assuming that your answers would always be his answers.\" \nHe continues. \n\"When you happened along and saw him doing something that seemed to you to be the very antithesis of his conscience--your conscience--you literally could not stand it. It made you physically ill. Life became hell on earth for you.\" \nLife may have become hell on earth for Scout, but that may also be the case for Democrats, who seek a nominee that embodies the failures of the 1980s instead of the successes of the 1990s. \nJohn A. Tures is a professor of political science at LaGrange College in LaGrange, Ga. He can be reached at jtures@lagrange.edu More: ", "external_links": [], "published": "2015-09-22T17:16:00.000+03:00", "crawled": "2015-09-22T17:17:13.425+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}