{"organizations": [], "uuid": "b9449e39dc63caf58aa358a3d8317323ae9d7c10", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/arcticseaice03192015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/energy-environment/252219-obama-to-talk-climate-change-in-alaska", "country": "", "title": "Obama taking climate message to the Arctic | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama taking climate message to the Arctic | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T00:21:00.000+03:00", "replies_count": 0, "uuid": "b9449e39dc63caf58aa358a3d8317323ae9d7c10"}, "author": "", "url": "http://thehill.com/policy/energy-environment/252219-obama-to-talk-climate-change-in-alaska", "ord_in_thread": 0, "title": "Obama taking climate message to the Arctic | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Devin Henry", "Obama"], "text": "Obama taking climate message to the Arctic Getty Images By Devin Henry - 08/28/15 04:36 PM EDT \nPresident Obama is bringing his climate change message to the Arctic Circle, White House officials said Friday, previewing his trip to Alaska. \nObama’s trip next week is part of his “broader and longer-term effort” to speak about climate change and highlight how to prevent it, Obama’s senior climate adviser, Brian Deese, told reporters. ADVERTISEMENT “This trip to Alaska will be an important part of that ongoing effort,\" he continued.\n“For the president, I think that this is going to be principally exciting because it’s going to give him the opportunity to meet with Alaskans and hear from them about what’s going on in their lives and how climate change is impacting them now.” \nObama will discuss the need for a United Nations deal on climate change during a conference of Arctic Circle nations on Monday. Deese said the speech will also touch on ways for local communities to track and address climate change. \nObama will also tour a national park and hike on a receding glacier near Seward, Alaska. On Wednesday, he’ll meet with residents and fishing workers in Dillingham, a town known for its commercial fishing operations, and then travel to the town of Kotzebue, in the Arctic Circle. \nThe prevailing mission of the trip, officials said, will be to assess the direct impact of climate change in an area — the Arctic — that is particularly sensitive to it. Obama pledged in a video earlier this month to use the trip to illustrate the urgency of climate change to the American public. \n“This is an issue that is very here and now,” Deese said. “The issue of climate change is not an issue of the future tense in Alaska. It is affecting people’s live and their livelihoods in real ways.” \nThe trip is part of the Obama administration’s sharper focus on climate change. \nThe Environmental Protection Agency released a landmark rule governing greenhouse gas emissions from power plants in early August. This week, Obama issued a series of executive actions to boost renewable energy technology. \nHe spoke this week on climate change and energy issues in Las Vegas and New Orleans, where he marked the 10th anniversary of Hurricane Katrina. \nLater this year, a U.N. conference will meet to try to reach a deal aimed at preventing climate change. \n“We view this [trip] as part of a broader and longer-term effort by the president and the administration to speak openly, honestly and frequently about how climate change is already affecting the lives of Americans and the strength and health of our economy, and also what we can do, individually and collectively, to address it,” Deese said. Tags: ", "external_links": [], "published": "2015-08-29T00:21:00.000+03:00", "crawled": "2015-08-29T00:21:25.464+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}