{"organizations": [], "uuid": "a25cd79c6cf14151e48b908f305842984febea68", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/xi.jpg", "site_section": "http://thehill.com/rss/syndicator/21684", "section_title": "TheHill - Video", "url": "http://thehill.com/video/in-the-news/254947-live-obama-xi-hold-joint-press-conference", "country": "US", "title": "LIVE: Obama, Xi hold joint press conference", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "LIVE: Obama, Xi hold joint press conference", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T19:01:00.000+03:00", "replies_count": 0, "uuid": "a25cd79c6cf14151e48b908f305842984febea68"}, "author": "The Hill staff", "url": "http://thehill.com/video/in-the-news/254947-live-obama-xi-hold-joint-press-conference", "ord_in_thread": 0, "title": "LIVE: Obama, Xi hold joint press conference", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House conservatives warm to... Lawmakers discuss potential McCarthy-conservative coalition. Boehner to resign in October The embattled Ohio Republican will resign from both his Speakership and... Standing O at Values Voter Summit... Rubio told the crowd it is time for Republicans to \"turn the page.\" LIVE: Speaker Boehner announces... House Speaker John Boehner announces his plans to resign as Speaker of the... Boehner, GOP settle on strategy to... Boehner will lay out the GOP's strategy at a closed-door conference... Boehner stuns House GOP with... “He didn’t give anyone a heads up,\" Rep. Darrell Issa said. Boehner coup talk has House GOP on... Conservatives might use a government-funding showdown to overthrow the... Senate rejects effort to strip... The vote thwarted the opening move by Republicans to avoid a shutdown on... Cruz basks in news of Boehner's... The 2016 hopeful said Republicans have failed to live up to their promises. Sources: Boehner ally tried to... Three senior GOP sources says they've heard Patrick McHenry has led a... Five in GOP who could succeed... The post may not come open for a while, but the next generation is waiting. Sanders, top Dems urge repeal of '... The Dems are breaking with the White House on dealing with high-cost... Conservative leader cheers Boehner... Heritage Action CEO Michael Needham welcomed the Speaker's resignation. Paul Ryan won't run for Speaker Ryan said he doesn't want to be Speaker. Trump on Boehner resignation: 'It'... The presidential hopeful said he has no preference on who should succeed... Fast-track bill will incude... The GOP is also aiming to use the reconciliation process to defund Planned... Republican who sought to oust... Rep. Mark Meadows offered a symbolic resolution to remove Boehner earlier...", "external_links": [], "published": "2015-09-25T19:01:00.000+03:00", "crawled": "2015-09-25T19:30:22.464+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}