{"organizations": ["Northern Fleet", "U.N.", "Smolensk Regional Hospital", "ISIS", "Asia-Pacific Economic Cooperation", "Krasnaya Polyana", "KGB", "Time magazine", "Foreign Relations Committee of the City Council", "United Nations", "International Olympic Committee"], "uuid": "12487b617f9e2073a35768a4f742454633f20c53", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150928153854-barack-obama-vladimir-putin-toast-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_topstories.rss", "section_title": "CNN.com - Top Stories", "url": "http://edition.cnn.com/2015/09/28/politics/obama-putin-un-syria-isis/index.html?eref=rss_topstories", "country": "US", "title": "Analysis: Obama on defense about foreign policy legacy", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Analysis: Obama on defense about foreign policy legacy", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T04:37:00.000+03:00", "replies_count": 0, "uuid": "12487b617f9e2073a35768a4f742454633f20c53"}, "author": "", "url": "http://edition.cnn.com/2015/09/28/politics/obama-putin-un-syria-isis/index.html?eref=rss_topstories", "ord_in_thread": 0, "title": "Analysis: Obama on defense about foreign policy legacy", "locations": ["Belarus", "United States", "Iran", "Saudi Arabia", "Moscow", "Kyzyl", "Leningrad", "Sochi", "Ukraine", "Syria", "Belarussian", "Europe", "Novo Ogaryovo", "Russian Federation", "Eastern Europe", "Iraq", "India", "Jordan", "Pacific", "Rome", "Asia", "China", "Middle East", "Kirillovsky", "Washington", "Barentsevo Sea", "Krasnaya Polyana", "Libya", "St. Petersburg", "America", "U.S.", "Southern Siberia", "Beijing", "Russia", "Minsk", "Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Vladimir", "Francois Hollande", "Hassan Rouhani", "Bill Clinton", "Angela Merkel", "Boris Yeltsin", "Yeltsin", "Thomas Bach", "Bashar al-Assad", "Abdel Fattah el-Sisi", "John Paul II", "Petro Poroshenko", "Raul Castro", "Vladimir Putin", "Lyudmila", "Peng Liyuan", "Putin", "Dmitry Medvedev", "al-Assad", "Svetlana Khorkina", "Obama", "Alexander Lukashenko", "Maria", "Kazan", "Alina Kabayeva", "Xi Jinping", "Vladimir Putin Putin", "Vladimir Putin Medvedev", "Moammar Gadhafi", "Medvedev", "Sergei Shoigu"], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Putin steals Obama's thunder on the world stage Updated 0303 GMT (1003 HKT) September 29, 2015 JUST WATCHED (CNN) Vladimir Putin is back -- and stealing Barack Obama's thunder. The Russian president showed up at the United Nations on Monday for the first time in a decade, proposing a coup against U.S. global leadership and seeking to wrest control of a coalition battling ISIS away from America's grip. And he wasn't the only leader of a country challenging the United States to effectively upstage Obama at the annual global meeting, which a U.S. president traditionally uses to command the spotlight. Speeches by Chinese President Xi Jinping and Iranian President Hassan Rouhani on the 70th anniversary of the creation of the world body also left Obama defending not only his personal foreign policy legacy, which is already under assault at home from Republican presidential candidates, but the entire concept of a world order based on seven decades of U.S. global leadership. The day of speech-making, which also included an address by Cuban leader Raul Castro and Egyptian President Abdel Fattah el-Sisi, underscored the multipolar challenges to U.S. power, as slumbering empires seek a resurgence and America faces military challenges from Eastern Europe across the Middle East to Asia. Obama hits Putin, Republicans in U.N. speech Obama has embraced a policy of encouraging other actors to address threats in their region, for instance pulling Saudi Arabia and Jordan into the coalition to fight ISIS. But the approach means that other forces joining the fray -- including Iran and now Russia in Syria -- may not necessarily agree with America's preferred end game. Obama offered a full-throated justification of his policies -- particularly emphasizing diplomacy over the use of force -- in his own U.N. address, but he seemed on the defensive amid claims by critics that his policies have emboldened U.S. adversaries. The most ardent challenger on Monday was Putin, who appears to be probing openings in Ukraine and Syria where he believes the U.S. president will not resist. He recently ordered a military buildup in Syria apparently in support of President Bashar al-Assad, a longtime Russian client, and went behind Washington's back to conclude an anti-ISIS intelligence alliance with Iran, Syria and Iraq just this weekend. Russia criticizes U.S. interventions Putin's message at the U.N. podium Monday was a simple one: U.S. interventions and unilateralism have backfired in the Middle East, and it is time to try something new. His speech will do little to undercut a widespread impression in many Western capitals that his aim in Syria is not just to bolster a Moscow ally but, primarily, to thwart U.S. power and influence in the Middle East. Putin took particular aim at U.S. involvement in Iraq and Libya, which he said fostered a power vacuum filled with \"extremists and terrorists.\" \"Do you realize now what you've done?\" he asked. He called for a ministerial conference and then a U.N. resolution to reorient strategy against ISIS -- even though many U.S. observers believe his real aim is to prioritize attacks against rebels opposed to al-Assad and to thwart U.S. aspirations in a region in which Obama has shown little appetite of becoming embroiled. 35 photos: Russian President Vladimir Putin 35 photos: Russian President Vladimir Putin Russian President Vladimir Putin is a popular but polarizing figure who has dominated Russian politics for more than a decade. Click through to see images of his life and career. Hide Caption 35 photos: Russian President Vladimir Putin Putin, bottom, wrestles with a classmate in St. Petersburg, Russia, in 1971. Hide Caption 35 photos: Russian President Vladimir Putin Putin poses with his parents, Vladimir and Maria, in 1985. Hide Caption 3 of 35 35 photos: Russian President Vladimir Putin From 1991 to 1994, Putin served as the chairman of the Foreign Relations Committee of the City Council in St. Petersburg. Before becoming involved in politics, he served in the KGB, a Soviet-era spy agency, as an intelligence officer. Hide Caption 4 of 35 35 photos: Russian President Vladimir Putin Russian President Boris Yeltsin, right, shakes hands with Putin during a farewell ceremony at the Kremlin in Moscow in December 1999. Putin rose quickly through the political ranks, becoming the second democratically elected president of the Russian Federation in 2000. Hide Caption 5 of 35 35 photos: Russian President Vladimir Putin President-elect Putin watches the tactical exercises of Russia's Northern Fleet in the Barentsevo Sea in April 2000. Hide Caption 35 photos: Russian President Vladimir Putin Putin takes the presidential oath next to Yeltsin in May 2000. Hide Caption 7 of 35 35 photos: Russian President Vladimir Putin Putin dances with a young girl in Kazan, Russia, while taking part in mid-summer festivities in June 2000. Hide Caption 35 photos: Russian President Vladimir Putin Putin and U.S. President Bill Clinton talk in Moscow in June 2000. Hide Caption 35 photos: Russian President Vladimir Putin Putin meets Pope John Paul II in Rome in June 2000. Hide Caption 10 of 35 35 photos: Russian President Vladimir Putin Putin speaks to his wife, Lyudmila, as they pose in front of the Taj Mahal in India in October 2000. Hide Caption 11 of 35 35 photos: Russian President Vladimir Putin Putin shakes hands with famous Russian gymnasts Alina Kabayeva, center, and Svetlana Khorkina in March 2004. Hide Caption 12 of 35 35 photos: Russian President Vladimir Putin Putin attends an inauguration ceremony for President-elect Dmitry Medvedev in May 2008. Putin was constitutionally obliged to stand down as President, but he stayed close to power, becoming Prime Minister. Hide Caption 13 of 35 35 photos: Russian President Vladimir Putin This image, supplied by Time magazine, shows Putin on the cover after being named the magazine's 2007 \"Person of the Year.\" Hide Caption 35 photos: Russian President Vladimir Putin Putin skis in Krasnaya Polyana, Russia, in February 2008. Hide Caption 35 photos: Russian President Vladimir Putin Putin shakes hands with Libyan leader Moammar Gadhafi in November 2008. Hide Caption 16 of 35 35 photos: Russian President Vladimir Putin Putin vacations outside the town of Kyzyl in Southern Siberia in 2009. Over the years he has earned a reputation as a \"strongman,\" declaring a crackdown on Chechen militants a priority in his first presidential term. Hide Caption 17 of 35 35 photos: Russian President Vladimir Putin U.S. President Barack Obama meets Putin at his home in Novo Ogaryovo, near Moscow, in July 2009. Putin said Russia was pinning its hopes on Obama to revive ties with the United States. Hide Caption 35 photos: Russian President Vladimir Putin Medvedev and Putin ski together in Krasnaya Polyana in January 2010. Hide Caption 19 of 35 35 photos: Russian President Vladimir Putin Putin takes part in a judo training session at a sports complex in St. Petersburg in December 2010. Putin holds a black belt in judo. Hide Caption 20 of 35 35 photos: Russian President Vladimir Putin In April 2011, Putin attends the first Global Ministerial Conference on Healthy Lifestyles and Noncommunicable Disease Control. The event was held in Moscow. Hide Caption 21 of 35 35 photos: Russian President Vladimir Putin Putin receives a medical consultation in August 2011 during a visit to the Smolensk Regional Hospital in Russia. Putin said he hurt his shoulder during morning judo practice. Hide Caption 22 of 35 35 photos: Russian President Vladimir Putin Putin speaks to supporters at a Moscow rally in February 2012. He won the presidential election one month later with just under 65% of the vote. Former President Medvedev became his Prime Minister. Hide Caption 23 of 35 35 photos: Russian President Vladimir Putin During a massive rally of his supporters in Moscow, tears run down Putin's face in March 2012 after he was elected President for a third term. Hide Caption 24 of 35 35 photos: Russian President Vladimir Putin A topless protester shouts at Putin and German Chancellor Angela Merkel during a visit to the Hanover Industrial Fair in central Germany in April 2013. Human rights groups say civil liberties and democratic freedoms have suffered during Putin's rule. Hide Caption 35 photos: Russian President Vladimir Putin Putin addresses the media during his visit to Hanover. Hide Caption 26 of 35 35 photos: Russian President Vladimir Putin Putin and his wife, Lyudmila -- seen here in 2012 -- announced the end of their marriage in June 2013. Hide Caption 27 of 35 35 photos: Russian President Vladimir Putin Putin poses for a photo with Russian Olympic athletes in Sochi, Russia, in February 2014. Russia hosted the Winter Olympic Games and won the most medals. Hide Caption 28 of 35 35 photos: Russian President Vladimir Putin From left, International Olympic Committee President Thomas Bach, Putin and Medvedev look at their watches before the closing ceremony of the Winter Olympics in February 2014. Hide Caption 29 of 35 35 photos: Russian President Vladimir Putin Putin, center, and Defense Minister Sergei Shoigu, left, arrive to watch a March 2014 military exercise at the Kirillovsky firing ground in Russia's Leningrad region. Hide Caption 30 of 35 35 photos: Russian President Vladimir Putin Putin, left, controls the puck during an ice hockey game between Russian amateur players and ice hockey stars at a festival in Sochi in May 2014. Hide Caption 31 of 35 35 photos: Russian President Vladimir Putin Putin takes part in a wreath-laying ceremony at the Tomb of the Unknown Soldier outside Moscow's Kremlin Wall in June. Hide Caption 35 photos: Russian President Vladimir Putin Putin speaks with Obama in November, during the Asia-Pacific Economic Cooperation summit in Beijing. Hide Caption 33 of 35 35 photos: Russian President Vladimir Putin Putin puts a shawl on Peng Liyuan, wife of Chinese President Xi Jinping, as they arrive to watch a fireworks show in Beijing in November. Hide Caption 34 of 35 35 photos: Russian President Vladimir Putin Several world leaders gather in Minsk, Belarus, in February to negotiate a ceasefire to the fighting in Ukraine. Putin is second from left, next to Belarussian President Alexander Lukashenko on the far left. Ukrainian President Petro Poroshenko is on the far right. At center, German Chancellor Angela Merkel gestures in front of French President Francois Hollande. Fighting between Ukrainian troops and pro-Russian rebels in the country has left more than 6,000 people dead since mid-April, according to the United Nations. Hide Caption 35 of 35 Like Russia, China is also a nation that once enjoyed great power and is now seeking a rebound. Xi, president of a nation that Washington faults for stoking tensions in Asia with its territorial claims at sea while increasingly elbowing the United States in the Pacific, hit out at criticism of China's communist system. And in a thinly veiled warning against new U.S. military adventures, he warned that \"those who adopt the high-ended approach of using force will find that they are only lifting a rock to drop on their feet.\" And Iran, which the United States accuses of supporting terror throughout the Middle East, portrayed its deal with world powers over its nuclear capabilities as an example of U.S. capitulation and blamed \"incorrect actions of newcomers to the region and naive transregional actors\" -- a clear reference to Washington -- for the chaos in the Middle East. Sensing the rising challenges to U.S. power that were all too evident at the U.N. on Monday, Obama openly faulted the perception -- fueled by Republican presidential candidates -- that he is a weak leader who has emboldened American adversaries. Obama looks to defend his legacy He seemed to be addressing the historians who will consider his legacy as much as his contemporaries on the world stage, especially when he defended his policy of cooperating with some of the very leaders he faults. \"We see in our debates about America's role in the world a notion of strength that is defined by opposition to old enemies, perceived adversaries, a rising China, or a resurgent Russia, a revolutionary Iran,\" Obama said. He was particularly contemptuous of Putin, mocking \"state-controlled media\" notions of a revived Russia. He said Ukrainians wanted to align with Europe not Moscow and pointed out that sanctions had led to a \"fallen ruble and the emigration of more educated Russians.\" \"History is littered with the failure of false prophets and fallen empires, who believed that might always makes right, and that will continue to be the case. You can count on that,\" Obama said. But Obama also acknowledged that he was open to a realistic approach that could see him work with Russia and Iran to fight ISIS and back a \"managed transition\" away from al-Assad. Seeing al-Assad remain in power for some time and cooperating with Iran on Syria are positions that the administration has long frowned on, and their embrace exposes Obama to criticism from those at home as well as from the adversaries that he faced on the world stage Monday.", "external_links": [], "published": "2015-09-29T04:37:00.000+03:00", "crawled": "2015-09-29T05:13:08.686+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}