{"organizations": [], "uuid": "cd4c70bddd35be3701d96e36c1c9ae45f27ef177", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/GOP%202016%20Trump_Cham(6)640360.jpg", "site_section": "http://www.foxnews.com/politics/", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/09/18/trump-declines-to-correct-questioner-who-calls-obama-muslim-at-nh-event/", "country": "US", "title": "Trump declines to correct questioner who calls Obama a Muslim at NH event", "performance_score": 10, "site": "foxnews.com", "participants_count": 1, "title_full": "Trump declines to correct questioner who calls Obama a Muslim at NH event | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "cd4c70bddd35be3701d96e36c1c9ae45f27ef177"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/09/18/trump-declines-to-correct-questioner-who-calls-obama-muslim-at-nh-event/", "ord_in_thread": 0, "title": "Trump declines to correct questioner who calls Obama a Muslim at NH event", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 18, 2015 Associated Press Email Print Sept. 17, 2015: Republican presidential candidate Donald Trump acknowledges applause at a town hall event in Rochester, N.H. (AP Photo/Robert F. Bukaty)\nROCHESTER, N.H. – Republican presidential candidate Donald Trump declined Thursday to correct a questioner at a town hall event who incorrectly stated that President Barack Obama is Muslim and said he'd be \"looking at\" claims of terrorist training camps on American soil.\nTrump, who has a history of making controversial remarks about immigrants and other groups, was kicking off a town hall event in Rochester, New Hampshire — his first since Wednesday evening's second Republican primary debate.\n\"We have a problem in this country. It's called Muslims,\" said the first man Trump called on to ask a question. \"We know our current president is one. You know he's not even an American.\"\nTrump, who was a driver of the \"birther\" movement that claimed Obama wasn't born in the U.S, first responded with feigned exasperation — \"We need the question,\" he said, to laughs — but let the man continue.\n\"We have training camps growing where they want to kill us. That's my question,\" the questioner continued. \"When can we get rid of it?\"\nTrump did not dispute the man's assertions and said he'd heard others raise the issue.\n\"We're going to be looking at a lot of different things. And you know, a lot of people are saying that, and a lot of people are saying that bad things are happening out there,\" said Trump. \"We're going to be looking at that and plenty of other things.\"\nThe incident evoked a moment during the 2008 campaign when Republican nominee John McCain took the microphone away from a woman who said she didn't trust Obama because he was an \"Arab.\"\nTrump's questions about the president's country of birth pushed Obama to release a copy of his birth certificate in 2011. But the billionaire businessman has distanced himself from the issue during his current run.\nTrump's town hall, in a sweaty auditorium in Rochester, was also interrupted several times by a protester, whose interruptions were met by hostility from the friendly crowd.", "external_links": ["http://www.ap.org/"], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-18T08:42:57.483+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}