{"organizations": [], "uuid": "a3948347af5f40e9ff17fa6aaffef827838e3585", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150725101658-chris-christie-july-24-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/02/politics/nuclear-deal-chris-christie-obama/index.html", "country": "US", "title": "Christie: Obama must have paid off Iran deal backers", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Christie: Obama must have paid off Iran deal backers - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "a3948347af5f40e9ff17fa6aaffef827838e3585"}, "author": "Gregory Wallace", "url": "http://www.cnn.com/2015/09/02/politics/nuclear-deal-chris-christie-obama/index.html", "ord_in_thread": 0, "title": "Christie: Obama must have paid off Iran deal backers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) Those backing the Iran nuclear deal must have been paid off, Republican presidential candidate Chris Christie said Wednesday.\n\"I cannot believe a lot of these folks would actually agree to this without then getting something else from the president,\" the New Jersey governor said in an interview on Fox News.\nHis comments came as the Obama administration's effort to get lawmakers on board with the deal hit a milestone : a 34th senator announced her support for the measure. That's just enough votes to prevent Republicans from sinking the accord when it comes up for a vote, which could be as soon as next week .\nBut Christie, known for making no bones when he speaks, seemed to say the tactics went beyond addressing lawmakers' concerns with the agreement's provisions about inspections, sanctions and effectiveness.\nRELATED: Iran deal clinching adds fuel to 2016 race\n\"I'd like the President to chronicle for all of us the deals, back rooms, secret deals, he's made,\" Christie said.\nHe invoked a side agreement -- that Republicans find particularly objectionable -- between the U.N. nuclear watchdog and the Iranian government that would allow Iran to play a role in some inspections of its facilities.\n\"We know he made secret deals with Iran. We've heard them dribbling out,\" Christie continued. \"What secret deals has he made with members of Congress to get their votes?\"\nChristie has previously accused Obama of \"lying\" to the American public in selling the deal, which is universally unpopular in the GOP presidential field.\nAnd on Wednesday, he said the consequences for the deal rest with Obama.\n\"I believe that the American people are going to look back on this and say this is the single worst thing this president has ever done and every death Iran causes is now on Barack Obama's head.\"\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-03T04:12:35.874+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}