{"organizations": ["Elise Foley Immigration & Politics"], "uuid": "8e884d170d7a812380716e71096f34e0068d1ef5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/56005d132000002600242ba2.jpeg?cache=kzUFJ9z0Po", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/jeb-bush-immigration-dreamers_56005c84e4b0fde8b0cf49bc", "country": "", "title": "Jeb Bush Prodded By Immigration Protesters, Touts Support For Dreamers", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Jeb Bush Prodded By Immigration Protesters, Touts Support For Dreamers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T23:56:00.000+03:00", "replies_count": 0, "uuid": "8e884d170d7a812380716e71096f34e0068d1ef5"}, "author": "", "url": "http://www.huffingtonpost.com/entry/jeb-bush-immigration-dreamers_56005c84e4b0fde8b0cf49bc", "ord_in_thread": 0, "title": "Jeb Bush Prodded By Immigration Protesters, Touts Support For Dreamers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush"], "text": "Email Jeb Bush Prodded By Immigration Protesters, Touts Support For Dreamers He says he'll stick to his stance \"irrespective of what the political ramifications of that are.\" Elise Foley Immigration & Politics Reporter, The Huffington Post Posted: 09/21/2015 04:39 PM EDT \nProtesters for immigration reform interrupted Republican presidential candidate Jeb Bush during a speech Monday, prompting him to vow that he will support a path to citizenship for certain undocumented immigrants regardless of the political implications. \n\"No hope without our vote,\" the protesters chanted as Bush began his speech at the U.S. Hispanic Chamber of Commerce conference in Houston. \nThe former Florida governor, who has drawn a tough line on immigration during his bid for the White House, paused to listen. Then he attempted to assure the crowd of his support for reform, particularly for undocumented immigrants who came to the U.S. as children. \n\"Here's what I believe: I believe we need immigration reform. I've been clear about this. I believe that Dream Act kids should have a path to citizenship,\" he said, referring to the never-passed bill that would have allowed some young undocumented immigrants to obtain U.S. citizenship. \n\"I've been consistently for the Dream Act kids to get a path to citizenship,\" Bush continued. \"I've been consistently for it, and I'll continue to be consistently for it irrespective of what the political ramifications of that are.\" \nThe protesters -- from FIEL, Mi Familia Vota, SEIU Texas and the Texas Organizing Project -- were told to leave, and Bush went on with his speech. \nIt was not the first time an interruption had led Bush to declare his support for immigration reform. He hadn't planned to mention the issue at all in his campaign announcement speech in June, but in response to protesters , he said that \"the next president of the United States will pass meaningful immigration reform so that that will be solved -- not by executive order.\" \nWhile Bush supports citizenship for so-called Dreamers, he has said undocumented immigrants in general should get a path to legal status. During the GOP primary, much of the discussion on immigration has revolved around enforcement, including Bush's own platform , which is largely focused on border security, deportation and ensuring that employers don't hire unauthorized immigrants. \nWendy Ramirez, one of the protesters, said they went to the conference out of frustration at what she and others see as Bush talking one way to majority-Latino audiences and a different way to others. They wanted to ask him what his real stance is. Ramirez, who is 24 and works with Mi Familia Vota in Houston, is a Dreamer who came to the U.S. when she was 8 years old. \n\"He said he supported reform for young people, but he completely ignored our families, he ignored our communities, and that's not acceptable,\" she said in a phone interview after the protest. \nThe U.S. Hispanic Chamber of Commerce put out a statement Monday afternoon that was critical of the protesters. \n\"The USHCC does not protest, especially against candidates that have demonstrated a lifelong commitment to the Hispanic community,\" the statement reads. \"While we do not see eye to eye on all issues with any of the presidential hopefuls, those who treat our community with respect deserve the same. We thank Governor Bush for addressing our members, and look forward to our other planned engagements with candidates from both parties.\" ", "external_links": [], "published": "2015-09-21T23:56:00.000+03:00", "crawled": "2015-09-21T23:56:33.857+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}