{"organizations": [], "uuid": "c61b7fe39f42531c991309f2a633aaf63ed9c16b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/biden-obama-clinton_082515getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/251898-obama-would-face-impossible-choice-between-biden-clinton", "country": "US", "title": "Obama would face impossible choice between Biden, Clinton", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama would face impossible choice between Biden, Clinton", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T19:57:00.000+03:00", "replies_count": 0, "uuid": "c61b7fe39f42531c991309f2a633aaf63ed9c16b"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/251898-obama-would-face-impossible-choice-between-biden-clinton", "ord_in_thread": 0, "title": "Obama would face impossible choice between Biden, Clinton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama would face impossible choice between Biden, Clinton Getty Images By Jordan Fabian - 08/25/15 12:57 PM EDT \nPresident Obama is extremely unlikely to offer an endorsement in a contested Democratic primary, despite comments opening the door to the possibility on Monday from a White House spokesman. \nFormer White House officials said it would be a shock for Obama to pick sides if Vice President Biden jumps into the race to challenge Hillary Clinton. ADVERTISEMENT “I don’t see how the president helps himself or his party by landing firmly in one camp or the other,” said Jared Bernstein, a former chief economist to Biden.\n“It’s awfully tough,” Bernstein said of Obama. “I know he is usually devoted to his vice president. But I am sure he feels similarly toward his secretary of State.” \nThe mere question about an endorsement highlights the tough spot Obama will be in if Biden challenges Clinton for the Democratic nomination. \nObama will be unable to avoid repeated questions about such a contest, which would provide an ongoing distraction for a White House seeking to build on the president’s accomplishments while ensuring a Democrat is elected to extend and safeguard his legacy. \nWhite House spokesman Josh Earnest caused a minor stir on Monday when he wouldn’t rule out an Obama endorsement. He also heaped praise on Biden during his Monday press briefing, reiterating that the president’s decision to make Biden his running mate “was the smartest decision that he'd ever made in politics.” \nWhile Earnest sought to strike a neutral note by also complimenting Clinton, his comments on Biden got heavy attention, especially with Obama and Biden meeting for lunch on Monday. \nMany in Obama’s orbit believe Clinton, who despite some stumbles is the clear front-runner for the Democratic nomination, has the best chance of becoming president. \n“People are looking to see who is the strongest candidate and who is the strongest nominee and who has the surest path,” said a former Obama campaign aide. “I think most folks think that Secretary Clinton has that path.\" \nWhile Biden’s off-the-cuff style and unabashed support for the president has made him a popular figure in the White House, there are serious doubts about whether he can mount a credible challenge to Clinton. \nThe former first lady has raised millions of dollars and assembled a robust campaign team, whereas Biden has not taken those steps. \nA number of top White House advisers have decamped to work on Clinton’s campaign. And earlier this year, the president said his former secretary of State would make an “excellent president.” \nBut it would be hard for Obama to back Clinton over Biden, one of the most loyal members of his circle. \nObama and Biden have developed a close personal friendship since they entered the White House together in 2009. The president delivered a moving eulogy in June for Biden’s son, Beau, who reportedly urged his father to run for president before passing away after a long battle with brain cancer. \nThe two meet weekly for lunch, when they discuss “everything from work to family,” according to Earnest. During their Monday meal, Obama gave Biden his blessing to launch a campaign if he chooses to do so, according to CNN . \nFormer Obama senior adviser Dan Pfeiffer said on CNN Monday he would be “surprised if the president put his foot on the scale” in favor of Clinton or Biden. \nAnd if Biden does jump in, Pfeiffer said “there are going to be a lot of people on Team Obama who would be willing to get back into the trenches for the vice president.” \nAs the Clinton email controversy drags on, it has damaged her poll numbers and raised doubts about her candidacy. Six in 10 voters in the states of Pennsylvania, Ohio and Florida say Clinton is not honest or trustworthy, according to a recent Quinnipiac University poll . \nThe same survey shows Biden running as well as or better than Clinton against top GOP contenders. \nBiden’s runs for president in 1988 and 2008 flamed out early. And White House officials have privately expressed concern a third failed run could tarnish Biden’s brand and further hamper Clinton , according to multiple media reports. \nEven though she broke with the president on Arctic drilling and trade, Clinton has been a vocal supporter of the president on healthcare, immigration and the nuclear deal with Iran — three top elements of his legacy. \nWhile there’s no doubt Biden is closer personally with Obama than Clinton is, she erased any lingering animosity from the 2008 campaign during her four years as secretary of State. \nThe former campaign official said choosing between Clinton and Biden is a conflict between the head and the heart. \n“It’s not like one person has loyalty and the other one doesn’t,” a the former campaign aide. “But there is a personal level of affection for the VP that will be tugging at people.” Tags:", "external_links": [], "published": "2015-08-25T19:57:00.000+03:00", "crawled": "2015-08-25T20:16:16.906+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}