{"organizations": [], "uuid": "fc5a9d6dcd5b6ebc5ce801e2b77e501e90b54e05", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamapope2_092315getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/regulation/administration/255047-death-penalty-foes-hope-for-obama-shift-after-francis-visit", "country": "", "title": "Death penalty opponents hope Francis moves Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Death penalty opponents hope Francis moves Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-27T13:46:00.000+03:00", "replies_count": 0, "uuid": "fc5a9d6dcd5b6ebc5ce801e2b77e501e90b54e05"}, "author": "", "url": "http://thehill.com/regulation/administration/255047-death-penalty-foes-hope-for-obama-shift-after-francis-visit", "ord_in_thread": 0, "title": "Death penalty opponents hope Francis moves Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francis", "Tim Devaney", "Obama"], "text": "Death penalty opponents hope Francis moves Obama Getty Images By Tim Devaney - 09/27/15 06:00 AM EDT \nAdvocates for abolishing the death penalty are hopeful that Pope Francis’s visit this week will give their cause a jolt of momentum. \nFollowing the pope’s historic address to Congress, the White House said President Obama — who supports the death penalty for the most “heinous” crimes — was “influenced” by Francis’s remarks about capital punishment, though his position has not changed. ADVERTISEMENT Opponents of capital punishment say they are optimistic that Obama could someday join their side.\n“The pope has added another powerful voice in support of the national trend away from the death penalty,” said Robert Dunham, executive director of the Death Penalty Information Center. \n“It’s not surprising that President Obama, who is committed to the same social agenda that the pope espouses, would be influenced by a message of hope, grace and forgiveness,” he added. \nFrancis has been a leading voice for criminal justice reform. While reiterating the Catholic Church’s opposition to the death penalty, he has also criticized life prison sentences and solitary confinement. \n“The Golden Rule also reminds us of our responsibility to protect and defend human life at every stage of its development,” Francis said during his address to Congress, drawing loud applause and a standing ovation from lawmakers. \n“This conviction has led me, from the beginning of my ministry, to advocate at different levels for the global abolition of the death penalty,” he added. \nThe pope emphasized the importance of rehabilitating prisoners, rather than executing them. \n“I am convinced that this way is the best, since every life is sacred, every human person is endowed with an inalienable dignity, and society can only benefit from the rehabilitation of those convicted of crimes,” he said. \nAfter the pope’s speech, the White House reiterated Obama’s longstanding concerns with “the way that the death penalty has been applied. “ \n“There is all kinds of data to indicate that there may be some racial disparities associated with the death penalty,” said White House press secretary Josh Earnest. \n“There are a variety of concerns that have been raised by some charitable organizations that have taken up the cause of those who have been on death row, who have mobilized enough evidence to actually have those individuals exonerated.” \n“So certainly those kinds of results are troubling.” \nObama ordered the Department of Justice (DOH) to review the death penalty in 2014 after the botched execution of convicted killer Clayton Lockett, who reportedly writhed in pain during his lethal injection and died of a heart attack. \nWhile DOJ expanded that review in May 2014 under former Attorney General Eric Holder, it has since fallen to the “back burner,\" according to Richard Dieter, senior program director at the Death Penalty Information Center. \nFollowing the pope’s call to abolish capital punishment, it would be “timely” for DOJ to complete the review, Dieter said, suggesting the agency should “make it a priority.\" \n“This could be the right time for the Obama administration to weigh in on the death penalty and recommend changes,” Dieter said. \n“I think President Obama has always been concerned about the death penalty,” he added. “He knows there are problems.\" \nMichele Jawando, vice president of the Center for American Progress, predicted the pope’s address will “reenergize” the death penalty report. \n“It’s a great way to restart the conversation,” said Jawando, who expects the Justice Department to release its report “sooner rather than later.” \n“The questions around the death penalty were already ripe,” she said. “When the pope entered the conversation about whether we have the moral authority to do that, it brought a new voice to the table.” \nThe Justice Department has imposed a moratorium on federal executions during the review, but most capital punishment is carried out by the states. \nBut though the Obama administration can do little to stop state executions, there’s one entity in Washington that can — the Supreme Court. \nWhile the court upheld the use of a lethal injection drug in a ruling this summer, the four liberal justices used their dissent to question whether the death penalty is constitutional. \nSome court-watchers say that dissent could ultimately lead to the abolishment of the death penalty, a view that conservative Justice Antonin Scalia echoed this week. \nScalia, a proponent of the death penalty, said he “wouldn’t be surprised” if the court eventually overturned it. \nBut while they wait for a ruling from on high, advocates are trying to win in the court of public opinion. \nThe Death Penalty Information Center says that since 1976, when the death penalty was reinstated, more than 1,400 inmates have been executed. However, more than 155 death row inmates have been released after they were later found to be innocent. \nCritics point to those statistics as a reason to abolish the death penalty. \n“It’s a broken system, and there is no way to prevent executing an innocent person,” said Karen Clifton, director of the Catholics Against Capital Punishment. \n“The only that’s holding it up in this country is vengeance,” Clifton said. ", "external_links": [], "published": "2015-09-27T13:46:00.000+03:00", "crawled": "2015-09-27T13:46:30.609+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}