{"organizations": [], "uuid": "bf195530f35343aa5c2542d4dab943af6cc9e2db", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obama_082415getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/homenews/administration/252214-obama-defends-rhetoric-in-iran-fight", "country": "", "title": "Obama defends rhetoric in Iran fight | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama defends rhetoric in Iran fight | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T00:05:00.000+03:00", "replies_count": 0, "uuid": "bf195530f35343aa5c2542d4dab943af6cc9e2db"}, "author": "", "url": "http://thehill.com/homenews/administration/252214-obama-defends-rhetoric-in-iran-fight", "ord_in_thread": 0, "title": "Obama defends rhetoric in Iran fight | TheHill", "locations": ["Jordan Fabian", "Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama defends rhetoric in Iran fight Getty Images By Jordan Fabian - 08/28/15 04:04 PM EDT \nPresident Obama on Friday defended the rhetoric he has used to sell the Iran nuclear deal, which has troubled some prominent American Jewish leaders. \nObama and his allies have repeatedly claimed critics of the accord prefer war with Iran, a charge that some leaders say has triggered a backlash against Jewish lawmakers who oppose the deal. ADVERTISEMENT “At no point have I ever suggested, for example, that somebody is a war monger meaning they want war,” Obama said during a webcast sponsored by major American Jewish groups. \nThe president said he has simply laid out the “logical conclusion” if Congress succeeds in killing the deal next month. \n“We really don’t have options … we’re kind of flying blind,” he said. “The logical conclusion then is that for any president, me or my successor, to make sure Iran isn’t getting a nuclear weapon, I’m going to have to resort to military action.” \nObama added he is not suggesting “opponents of this deal want war. What it is is a sober analysis of what options we have available to us.” \nFriday’s event was Obama latest attempt to convince Jewish Americans he has their interests in mind in carrying out the nuclear accord with Tehran, one of his biggest foreign policy priorities as president. \nObama spoke in a personal tone in acknowledging the deep skepticism many Jews have about cutting a deal with Iran, whose “unsavory” government is “anti-Semitic.” \n“I think as an African-American, I understand that history teaches us man can be pretty cruel to man,” Obama said. \nThe debate over the controversial agreement has opened a major rift among Jewish voters and prompted concerns over whether U.S.-Israel relations have been permanently damaged. \nJewish leaders have privately raised concerns with Obama about his rhetoric framing the debate as a choice between diplomacy and war. \nIt’s a claim he made most prominently in a speech at American University, when he warned lawmakers that defeating the agreement would chart the nation on a path toward war. Earlier Friday, spokesman Josh Earnest labeled an anti-deal rally sponsored by Donald Trump and Sen. Ted Cruz (R-Texa), who are both running for the GOP presidential nomination, a “big pro-war rally.” \nJewish opponents of the deal, including Sen. Charles Schumer (D-N.Y.), have faced accusations of dual loyalty, a charge that is historically linked with anti-Semitism. \nBut Obama argued the vitriol has been greater against Jews who have come out in favor of the deal , such as Rep. Jerrold Nadler (D-N.Y.) \nObama condemned the “appalling” attacks against Nadler, who has been likened to Jews who collaborated with Nazis during the Holocaust. \n“I would challenge a little bit there has been an equivalence on both sides of heated rhetoric,” Obama said. \nObama expressed confidence that the deal would not cause long-term damage to the U.S.’s relationship with Israel, saying ties would be “pretty quick” to improve once the deal goes into place. \nThe president said he hopes to hold talks with Israeli Prime Minister Benjamin Netanyahu, a fierce critic of the accord, about boosting American military and security aid to Israel. \nHe acknowledged differences with Israel can be difficult for American Jews but argued it’s important for best friends to be honest with one another. \n“It is important to remember in this debate we are all pro-Israel,” he said. “We are all family.” Tags: ", "external_links": [], "published": "2015-08-29T00:05:00.000+03:00", "crawled": "2015-08-29T00:05:33.837+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}