{"organizations": [], "uuid": "7b63cf428d13cc6487628fcf5eea3bf25dd7b976", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/090215_hn_kerry_640.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/09/03/obama-builds-senate-firewall-but-iran-debate-far-from-over/", "country": "US", "title": "Obama builds Senate firewall but Iran debate far from over", "performance_score": 1, "site": "foxnews.com", "participants_count": 3, "title_full": "Obama builds Senate firewall but Iran debate far from over | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 2, "uuid": "0ce39ab30e85bc09c343781170582e6dd29d655b"}, "author": "Chad Pergram", "url": "http://www.foxnews.com/politics/2015/09/03/obama-builds-senate-firewall-but-iran-debate-far-from-over/#post-0", "ord_in_thread": 0, "title": "Obama builds Senate firewall but Iran debate far from over", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Chad Pergram \nPublished September 03, 2015 FoxNews.com   livefyre Email Print \nPresident Obama would seem to have the necessary support to preserve his Iran nuclear deal in a congressional vote later this month, after securing the backing of a critical 34th senator Wednesday.\nBut the debate is far from over.\n\"Forcing a bad deal, over the objections of the American people and a majority in Congress, is no win for President Obama,\" said Cory Fritz, spokesman for House Speaker John Boehner. \"The White House may have convinced just enough Democrats to back an agreement that legitimizes Iran's nuclear program, trusts the regime to self-inspect and offers amnesty to terrorists, but this deal is far from being implemented.\"\nWhile the pledge by Sen. Barbara Mikulski, D-Md., to support the Iran deal makes her the 34th senator behind it and means the deal will go through Congress barring any other unforeseen circumstances, there are still several steps ahead in the near-term.\nPlus the deal will have to be implemented on an international level, ensuring Iran's compliance along the way.\nAnd some Republicans already are seeking to have the deal revisited in 2017 -- particularly if their party wins the White House next year. Senate Majority Leader Mitch McConnell, R-Ky., vowed a \"serious and consequential debate\" next week on the deal, and added, \"because this is not a treaty, it can and should be revisited by our new president.\"\nOn the House side, Majority Leader Kevin McCarthy, R-Calif., likewise released a statement saying their chamber would consider a resolution of disapproval on the deal next week. Passions could run high on the floors of Congress. Deal critics note that a majority in Congress is almost certain to oppose the agreement, despite Obama securing just enough support to keep it from being derailed.\nIn the coming days, lawmakers will have to figure out how they're going to vote. Mikulski's announcement liberates other senators and House members to vote as they wish or bow to local political pressures. Mikulski's vote effectively provides air cover, perhaps even for Sen. Ben Cardin, D-Md., her home-state colleague and the top Democrat on the Senate Foreign Relations Committee who has struggled with this deal.\nMeanwhile, the parliamentary steps ensure the issue drags on through late September if not early October.\nIt is typical in Major League Baseball for teams, eliminated from playoff contention, to \"play out the string.\" September call-ups just happened with new players arriving from baseball outposts like Omaha and Pawtucket. Infielders appear in starting lineups with uniform numbers in the high sixties. Everyone knows these teams are out of it. But they play out the string in September.\nThe same will happen this month on the Iran deal. The House and Senate will still debate the Iran deal (they have through Sept. 17 to vote to disapprove) and then send the deal to Obama for his signature or veto -- with a veto expected. And that is the gambit that the Obama administration was betting on all along. The White House knew there were certainly the votes in the House and Senate to \"disapprove\" of the package. And the congressional GOP leadership set up the debate and vote in a way that both bodies would vote to \"disapprove\" of the pact. Had they crafted legislation to \"approve\" of the deal, the measures would have failed and they would have never sent the plan to Obama for a veto. But arranging a resolution of disapproval (in other words, an aye vote means you disapprove), invites the expected veto message from the president. And the administration always thought there would never be the votes in the House and Senate (290 in the House, 67 in the Senate -- two-thirds of both houses) to override.\nBased on the clock that Congress agreed to, expect the veto sometime in mid-to-late-September and the override attempt by early October at the latest.\nAnd Congress and the administration, like the Reds and other teams mired in last place, will play out the string.\nImportantly, as McConnell noted, the administration is not handling the Iran deal as a conventional treaty. If it did, only the Senate would be a player and would be asked to ratify the treaty with a two-thirds supermajority. The only reason Congress is involved at all in this is because of bipartisan legislation crafted by Senate Foreign Relations Committee Chairman Bob Corker, R-Tenn., alongside Sen. Bob Menendez, D-N.J., and Cardin.\nMikulski's backing means there are the votes to sustain the veto. It's even possible (although not expected) that the House could vote successfully to override a veto, but all Obama needed was a one-chamber-of-Congress circuit breaker. And Mikulski's support guarantees that.\nThen, the hard work of implementing the deal begins.\nCapitol Attitude is a weekly column written by members of the Fox News Capitol Hill team. Their articles take you inside the halls of Congress, and cover the spectrum of policy issues being introduced, debated and voted on there.", "external_links": [], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-03T16:22:20.347+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}