{"organizations": ["Fox News After Iran", "Facebook", "Twitter"], "uuid": "e4ce4c9153f7d09d6baa7d9783e009240e2dde67", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/091315_anhq_turner_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/13/after-iran-deal-obama-struggles-to-gain-israel-trust/", "country": "", "title": "After Iran deal, Obama struggles to gain Israel's trust | Fox News", "performance_score": 7, "site": "foxnews.com", "participants_count": 0, "title_full": "After Iran deal, Obama struggles to gain Israel's trust | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T04:16:00.000+03:00", "replies_count": 0, "uuid": "e4ce4c9153f7d09d6baa7d9783e009240e2dde67"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/13/after-iran-deal-obama-struggles-to-gain-israel-trust/", "ord_in_thread": 0, "title": "After Iran deal, Obama struggles to gain Israel's trust | Fox News", "locations": ["Iran", "Israel"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "After Iran deal, Obama struggles to gain Israel's trust Published September 13, 2015 Facebook 0 Twitter 0 Email Print \nJERUSALEM – Seeking to sell his nuclear deal with Iran to a skeptical Israeli public, President Obama has repeatedly declared his deep affection for the Jewish state. But the feelings do not appear to be mutual. \nWide swaths of the Israeli public, particularly supporters of Prime Minister Benjamin Netanyahu, have little trust in the American leader, considering him naive and even hostile. One recent poll showed less than a tenth considered him \"pro-Israel.\" \nSuch misgivings bode poorly for Obama as he tries to repair ties with Israel in the final year of his presidency, and they would certainly complicate any renewed effort at brokering peace between Israel and its neighbors — once a major Obama ambition. \nThe tense personal relationship between Netanyahu and Obama are certainly a factor in the poor state of affairs, and Netanyahu has made a number of missteps that have contributed to the tensions. \nOn a trip to the White House in 2011, the Israeli leader appeared to lecture Obama on the pitfalls of Mideast peacemaking. Netanyahu has close ties to the billionaire Republican donor Sheldon Adelson, and during the 2012 presidential race, Netanyahu appeared to favor Obama's challenger, Mitt Romney. \nNetanyahu's U.S.-born ambassador to Washington, Ron Dermer, is a former Republican activist, and earlier this year, Netanyahu angered the White House by delivering a speech to Congress against the emerging Iran deal at the invitation of Republican leaders. Netanyahu has continued to lobby American lawmakers to oppose the Iran deal since it was finalized in July. \nBut Obama also bears responsibility for a number of policy decisions that have jolted Israelis' faith in him. \n\"The average Israeli probably thinks that he is a nice guy, but he is naive,\" said Alexander Yakobson, a historian at the Hebrew University in Jerusalem. In Israeli eyes, \"he doesn't get the Middle East, doesn't understand how the Mideast functions, and he doesn't therefore understand what dangers Israel has to face,\" he added. \nYakobson said the president's missteps went back to his earliest days in office, when he chose to deliver a landmark speech in Cairo seeking to repair American relations with the Arab world. \"That was never going to make him popular in Israel,\" he said. \nYakobson, who himself agrees with Obama's opposition to Israeli settlement construction in the West Bank, said the president had nonetheless mishandled disagreements with Netanyahu over the issue and peace efforts with the Palestinians that collapsed last year. Many Israelis, he said, believe the Palestinians also deserve some of the blame. \nBut the biggest issue has been the U.S.-led nuclear agreement with Iran. Politicians across the spectrum have come out against the deal, agreeing with Netanyahu's assessment that it does not have sufficient safeguards to prevent Iran from gaining the ability to make a nuclear bomb and that it will boost Iran's influence across the region. Iran is a key backer of Israel's toughest enemies, and Netanyahu has warned that the ending of sanctions against Iran will result in more money and arms flowing to groups like Hezbollah in Lebanon and Hamas in the Gaza Strip. \nRecent opinion polls reflect these sentiments. In one survey published Sunday in the Maariv daily, 77 percent of respondents said the deal endangers Israel, compared to 15 percent who said it didn't. The poll interviewed 500 people and had a margin of error of 4.3 percentage points. \nAn April survey of Jewish Israelis, carried out just after a preliminary nuclear deal with Iran was reached, had an equally harsh view of Obama. Just 9 percent of respondents described the White House as \"pro-Israeli,\" while 60 percent called it \"pro-Palestinian.\" More than 60 percent described Obama as the worst president for Israel in the past 30 years, far outdistancing runner-up Jimmy Carter at 16 percent. \nThat survey, conducted by the Panels Politics agency with the Jewish Journal, questioned 503 Jewish Israelis and had a margin of error of 4.6 percentage points. \nIn a survey of 40 countries, the Pew Research Center found the sharpest decline in Obama's image over the past year occurred in Israel, where confidence slipped from 71 percent to 49 percent. \nAt times, the anger toward Obama in Israel is palpable. On the streets and in online news forums, Israelis often refer to Obama by his middle name \"Hussein,\" a reference to his Muslim heritage on his father's side. Last year, after an anonymous White House official used a pejorative term to describe Netanyahu as cowardly, Cabinet Minister Naftali Bennett warned that Obama was \"throwing Israel under the bus.\" \nFor his part, Obama has acknowledged feeling hurt. In an address to American Jewish leaders last month, Obama underscored his deep commitment to Israel's security and likened the debate over the Iran deal to a dispute within the family. \n\"I would suggest that, in terms of the tone of this debate, everybody keep in mind that we're all pro-Israel,\" he said. \"And we have to make sure that we don't impugn people's motives.\" \nObama has said that with the Iran deal complete, he would like to begin working with Israel on ways to increase its security and allay fears about the deal. The Haaretz daily on Sunday said talks on providing Israel with additional U.S. weaponry have already quietly begun. Netanyahu's office declined comment. \nBut even if the two countries do manage to reach a new security deal, it seems unlikely that Obama will be able to repair the relationship with Netanyahu or restart Mideast peace efforts. The differences just run too deep. \nThe White House has said it is trying to set up a meeting between Obama and Netanyahu for November, which would be their first meeting since the Iran deal was finalized. \nYoram Ettinger, a former Israeli consul-general in Houston, said the issues here have little to do with personalities or alleged hostilities on the part of Obama. \"It's an issue of a gap between two very different world views,\" he said. \nHe said that in Israeli eyes, Obama is unrealistic, sending a message of weakness through his handling of the so-called Arab Spring over the past five years and by trusting an Iranian government with such a long record of defying the international community and supporting violent groups across the region. \n\"Are you rooted in reality or are you rooted in wishful thinking,\" he said. Advertisement ", "external_links": [], "published": "2015-09-14T04:16:00.000+03:00", "crawled": "2015-09-14T04:16:13.732+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}