{"organizations": [], "uuid": "300625b8961adb692d4ba41835ac7526d3ebdb62", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/03/politics/supreme-court-abortion-texas/index.html", "country": "", "title": "Supreme Court asked to review Texas abortion restrictions case - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Supreme Court asked to review Texas abortion restrictions case - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T19:32:00.000+03:00", "replies_count": 0, "uuid": "300625b8961adb692d4ba41835ac7526d3ebdb62"}, "author": "", "url": "http://www.cnn.com/2015/09/03/politics/supreme-court-abortion-texas/index.html", "ord_in_thread": 0, "title": "Supreme Court asked to review Texas abortion restrictions case - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Supreme Court asked to review Texas abortion ruling By Ariane de Vogue , CNN Supreme Court Reporter Updated 1724 GMT (0024 HKT) September 3, 2015 The early-morning sun rises behind the Supreme Court building. Story highlights Pro-abortion rights groups fear more clinics would close Texas Attorney General supports the controversial law (CNN) A coalition of women's health-care providers on Thursday asked the Supreme Court to review a federal appeals court decision that would shutter all but a handful of abortion clinics in Texas. At issue are provisions of a Texas law that abortion providers say represents a new trend of laws across the country aimed not at protecting women's health but at closing clinics. \"This would be the most devastating abortion restrictions allowed to go into effect since Roe v. Wade,\" said Nancy Northup, CEO for the Center for Reproductive Rights, during a conference call with reporters. She worried that if the Supreme Court declines to take up the case, other states will pass copycat laws. Prior to the enactment of the law -- HB2 -- there were more than 40 facilities providing abortions in Texas but that number has since gone down to 18. If the Supreme Court declines to take up the case and the law goes into effect, Northrup said the number would fall to 10. \"The Constitution protects every woman's right to make her own decisions about whether and when to end a pregnancy,\" she said. Last June, on a 5-4 vote, the Supreme Court agreed to put the lower court ruling on hold while it decided whether to take up the case. The Court will likely consider Thursday's petition sometime in the fall. The case concerns two provisions of a HB2: The so-called Ambulatory Surgical Center requirement that mandates abortion facilities must upgrade to hospital-like standards and the admitting privileges requirement that provides the physician performing the abortion must have privileges at a local hospital. In June, Texas Attorney General Ken Paxton urged the justices to allow the law to go into effect, saying it \"protects women's health.\" Paxton said the law \"ensures abortion clinics and doctors meet basic health standards if they choose to operate their businesses in Texas.\" Texas has yet to file its papers with the high court. More from Politics ", "external_links": [], "published": "2015-09-03T19:32:00.000+03:00", "crawled": "2015-09-03T19:32:24.429+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}