{"organizations": [], "uuid": "20d1b34bde2384285ce23b65c703e05e8bcf7c33", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/isis_video.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/national-security/252215-obama-names-new-hostage-point-man", "country": "", "title": "Obama names new hostage point man | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama names new hostage point man | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T23:53:00.000+03:00", "replies_count": 0, "uuid": "20d1b34bde2384285ce23b65c703e05e8bcf7c33"}, "author": "", "url": "http://thehill.com/policy/national-security/252215-obama-names-new-hostage-point-man", "ord_in_thread": 0, "title": "Obama names new hostage point man | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama", "Julian Hattem"], "text": "Obama names new hostage point man By Julian Hattem - 08/28/15 04:05 PM EDT \nThe White House on Friday appointed former diplomat James O’Brien to a new federal position overseeing the State Department's efforts to recover and protect U.S. hostages oversees. \nThe appointment of the first special presidential envoy for hostage affairs comes after increased scrutiny on federal hostage policies and as part of a shakeup the Obama administration announced in June to make it easier for families of hostages to pay ransoms to bring their loved ones home. ADVERTISEMENT Amid an uptick in hostages held by the Islamic State in Iraq and Syria (ISIS) and other militant groups, O'Brien will work with the rest of the government to protect Americans held hostage.\n“In his new position, Jim will be focused on one overriding goal: using diplomacy to secure the safe return of Americans held hostage overseas,” Secretary of State John Kerry said in a statement. \n\"To that end, he will be in close contact with the families of American hostages, meet with foreign leaders in support of our hostage recovery efforts, advise on options to enhance those efforts, participate in strategy meetings with other senior U.S. policymakers, and represent the United States internationally on hostage-related issues.” \nSome lawmakers, however, have pressed for more sweeping changes that would create a new independent hostage czar to oversee the entire government’s hostage efforts. Their concern is that the government's new arrangement will create too many bureaucratic blinders and separate the work of the State Department from the rest of the government. \nThe White House has so far declined to take that step. \nO’Brien comes to the role from the Albright Stonebridge Group, an advisory firm led by former Secretary of State Madeleine Albright. He previously worked as a senior adviser to Albright during her tenure at the State Department and also served as principal deputy director of policy planning and as the State Department’s point man on the Balkans during the late 1990s. \n“Jim O’Brien is a person of proven diplomatic skill with a strong commitment to the peaceful resolution of disputes and to justice,” Kerry said. “Jim is exactly the right person for a job that demands a high level of diplomatic experience and the ability to analyze and find effective remedies to complex problems.” \nThe Obama administration announced the change in course for its hostage rules earlier this summer, on the heels of brutal executions of Americans held by ISIS. \nWhile the government itself still bars paying ransoms to hostage-takers, new rules allow it to communicate with terrorist groups and otherwise serve as a conduit for people trying to free their loved ones. Family members have claimed that the government often stonewalled them from learning about a hostage’s fate and threatened criminal charges for paying ransoms to secure their release. \nIn addition to creating the new hostage position, President Obama also created a new office to coordinate response to hostages, which will work O'Brien and will be overseen by the FBI. \n“The appointment of Jim O’Brien is an important milestone in the president’s enhancements of the United States’ response to hostage events and to implement the findings and recommendations of the review ordered by the president.” White House homeland security adviser Lisa Monaco wrote in a blog post. ", "external_links": [], "published": "2015-08-28T23:53:00.000+03:00", "crawled": "2015-08-28T23:53:34.864+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}