{"organizations": [], "uuid": "8701cc05522cf98863af71d0f37740bdcc8eaf86", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaselfie.png", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/252576-obama-wields-selfie-stick-at-alaska-national-park", "country": "US", "title": "Obama wields selfie stick at Alaska national park", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama wields selfie stick at Alaska national park", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T23:11:00.000+03:00", "replies_count": 0, "uuid": "8701cc05522cf98863af71d0f37740bdcc8eaf86"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/252576-obama-wields-selfie-stick-at-alaska-national-park", "ord_in_thread": 0, "title": "Obama wields selfie stick at Alaska national park", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama wields selfie stick at Alaska national park By Devin Henry - 09/02/15 04:11 PM EDT Watch @POTUS go behind the camera in Alaska to talk about the impacts of climate change: http://t.co/eAVC9RjeMV https://t.co/5y0EZH9RKi — The White House (@WhiteHouse) September 2, 2015 President Obama has a new weapon in the fight against climate change: A selfie stick. Obama travelled to Alaska’s Kenai Fjords National Park on Tuesday and visited the Exit Glacier, which scientists say has begun quickly shrinking due to rising temperatures. ADVERTISEMENT Obama filmed a video of himself in front of the glacier, promising to “give you guys a little bit of a view of what it’s like out here.” “We’ve been able to spend the day out here just learning more about how the glaciers are receding,” he said. “It’s a signpost of what’s happening with a changing climate. … This is worth preserving.” Obama then panned his blue selfie stick around the valley to show viewers where he was. “This is just a little tongue sticking out from a massive block of ice that extends out for miles,” he said of the glacier. “There are a number of glaciers all across the park that you can see. … It is beautiful.\" White House officials had plugged Obama’s trip, his first lengthy visit to the state as president, as an opportunity for him to personally show Americans the impact of climate change on the region. Obama has manned the official White House Instagram page, posting pictures of mountains during his flight into Anchorage, images of his hike through the national park, and a selfie he took with TV host Bear Grylls. Obama travels to the town of Kotzebue on Wednesday, making him the first president to visit the Arctic Circle while in office. Tags:", "external_links": [], "published": "2015-09-02T23:11:00.000+03:00", "crawled": "2015-09-02T23:39:07.262+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}