{"organizations": ["Facebook", "Twitter"], "uuid": "447f5b21f752f3bab39356656045f9e26169c335", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/092115_anr_hall_1280.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/21/hill-republicans-move-fast-to-check-obama-plan-for-more-syrian-refugees/", "country": "", "title": "Hill Republicans move quickly to check Obama plan for more Syrian refugees | Fox News", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Hill Republicans move quickly to check Obama plan for more Syrian refugees | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T20:08:00.000+03:00", "replies_count": 0, "uuid": "447f5b21f752f3bab39356656045f9e26169c335"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/21/hill-republicans-move-fast-to-check-obama-plan-for-more-syrian-refugees/", "ord_in_thread": 0, "title": "Hill Republicans move quickly to check Obama plan for more Syrian refugees | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Hill Republicans move quickly to check Obama plan for more Syrian refugees Published September 21, 2015 Facebook 0 Twitter 0 livefyre Email Print \nCongressional Republicans are moving quickly to address the potential security risks associated with the Obama administration’s new plan to allow 10,000 Syrian refugees into the United States over the next year, as part of a broader plan to accept more refugees from around the world. \nThe plan, announced Sunday by Secretary of State John Kerry, calls for the U.S. to accept 85,000 refugees from around the world next year, up from 70,000, with that total increasing to 100,000 in 2017. This would include Syrian refugees, who are flooding into Europe to escape the country's bloody civil war. \nBut lawmakers cited deep concerns about the process for vetting applicants. The Republican head of the House Committee on Homeland Security has introduced a bill that would give Congress oversight on security and screening issues and a vote on the administration’s plan. \n“Many Americans are understandably concerned about the threat posed by inadequate security screening procedures,” Chairman Rep. Mike McCaul, R-Texas, said in a statement. \nRight now, Congress has no approval authority over the administration expanding the number of refugees. However, it does decide whether to appropriate money to pay to for the additional so-called “resettlement slots.” \nNot all the additional refugees would be Syrians escaping the four-year civil war. Others would come from strife-torn areas of Africa and elsewhere. \nHowever, intelligence officials, Republican lawmakers and others have for years expressed concern Islamic State militants, who have overtaken swaths of Syria and Iraq, could slip into the U.S. while posing as refugees. \n“ISIS themselves have stated their intention to take advantage of the crisis to infiltrate the West,” McCaul said. \nWithin hours of Kerry’s announcement in Germany, which is dealing with millions of refugees seeking a new home, the GOP leaders of the House and Senate Judiciary committees expressed similar concerns. \nVirginia Rep. Bob Goolatte and Iowa Sen. Chuck Grassley said in a joint statement that ISIS and other terrorist organizations have already “made it abundantly clear” that they will use the refugee crisis to try to enter the U.S. \n“Now the Obama administration wants to bring in an additional 10,000 Syrians without a concrete and foolproof plan to ensure that terrorists won't be able to enter the country,” they said. \"The administration has essentially given the American people a 'trust me.' That isn't good enough.\" \nThe State Department has not yet detailed the screening process and its costs. \nHowever, the process is detailed in report published earlier this year by the Congressional Research Service. \nThe 15-page report says the State Department is responsible for the overseas processing of refugees and “generally” arranges for a non-government organization, an international group or a U.S. embassy contractor to manage a Resettlement Support Center, which assists in the processing. \nThe center conducts pre-screening interviews for prospective refugees and prepares cases for submission to the Department of Homeland Security’s U.S. Citizenship and Immigration Services. \nAdmission is based on the 1952 Immigration and Naturalization Act, updated roughly 25 years ago to address the growing threat of terrorism. \nThe act has also been amended in recent years to “lower the threshold for how substantial, apparent and immediate an alien’s support for a terrorist activity or organization may be for the alien to be rendered inadmissible,” according to the congressional report. \nThe report says refugees generally are not allowed into the U.S. if they engaged in terrorist activity or if they gave any material support -- such as a safe house, transportation, communications or funds -- to a terrorist organization or any of its members or to a person engaged in terrorist activity. \nHowever, top administration officials “may exercise discretionary waiver authority over certain terrorism-related grounds of inadmissibility,” according to the report. \nThe secretaries of State and Homeland Security have in the past exercised that waiver, the report also states. \nScreening measures were significantly increased after the 9/11 attacks, after which the U.S. refugee program was temporarily suspended, then remained at historically low levels for the next few years. \nMcCaul’s bill would also require the administration to give priority to refugees from Iraq and Syria who are members of oppressed religious minorities. \nIn addition, the legislation calls for such agencies as the FBI, the office of the Director of National Intelligence and the Department of Homeland Security to provide “new security assurances” before admitting refugees and to conduct a “sweeping review” of security gaps in the refugee screening process. \nOn Sunday, former secretary of state and Democratic presidential front-runner Hillary Clinton called for immediately putting into place “the mechanisms for vetting the people we would take in.” \nStill, logistical and resource hurdles remain. For example, there is no suitable facility in Lebanon where Syrian refugees can be taken for interviews, so no interviews are occurring, according to the State Department. \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-09-21T20:08:00.000+03:00", "crawled": "2015-09-21T20:09:04.476+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}