{"organizations": ["National Medal of Arts and National Humanities Medal", "Francois Hollande en la Casa Blanca", "Dar Es Salaam", "Independencia de Estados Unidos", "Estados Unidos", "Waterkloof Air Force Base", "Navidad de la Casa Blanca", "Ohio Wesleyan Univesity", "NBC", "la Sala Azul de la Casa Blanca", "Casa Blanca", "Convención Nacional Demócrata", "South Lawn de la Casa Blanca", "Primera Dama de Tanzania", "Air Force", "Burrville Elementary School", "Whitney Young's Fight for Civil Rights\" en el Eisenhower Executive Office Building", "Para el Congressional Black Caucus Foundation Annual Phoenix Awards", "Barack Obama en la Casa Blanca", "Kennedy Center Honorees en la Casa Blanca"], "uuid": "75e727ea72b198b6898c47be643c25e933af23de", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3469168/images/o-CHINESE-PRESIDENT-MICHELLE-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/09/26/michelle-obama-se-roba-el-show_n_8200316.html", "country": "", "title": "Michelle Obama se roba el 'show' (FOTOS)", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Michelle Obama se roba el 'show' (FOTOS)", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T20:13:00.000+03:00", "replies_count": 0, "uuid": "75e727ea72b198b6898c47be643c25e933af23de"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/09/26/michelle-obama-se-roba-el-show_n_8200316.html", "ord_in_thread": 0, "title": "Michelle Obama se roba el 'show' (FOTOS)", "locations": ["Loudoun County Fairgrounds", "Dakar", "Washington", "N.C.", "Va.", "DC", "Hawaii", "Chicago", "Europe", "Hawai", "Florida", "Honolulu", "D.C.", "Chapel Hill", "Sudáfrica", "New York", "Senegal", "Leesburg", "Orlando International Airport", "Beijing", "Alemania", "Pretoria", "Berlín", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Johannesburgo", "Steve Harvey", "Cathy Waterman", "Barack Obama", "Thom Browne", "Joachim Sauer", "Merona", "Angela Merkel", "Zac Posen", "Marieme Faye Sall", "Demi Lovato", "Chris Mann", "Maria Cornejo", "Thobeka Madiba-Zuma", "Peng Liyuan", "Jacob Zuma", "Krakoff", "Salma Kikwete", "Laura Smalls", "Tracey Reese", "Macky Sall", "Kermit en Washington", "Ann Romney", "Michelle Obama", "Tracy Reese", "Narciso Rodríguez", "Alexander McQueen", "de Michael Kors", "Sasha", "Michael Kors"], "text": "21 de marzo junto a Peng Liyuan, esposa del presidente de China, en Beijing. 20 de marzo de 2014, llegando a Beijing, China. 12 de marzo de 2014 junto a la rana Kermit en Washington, DC. 9 de marzo de 2014 junto al presidente Barack Obama en la Casa Blanca. 11 de febrero de 2014. En la Casa Blanca para el banquete de estado en honor del presidente de Francia. 11 de febrero de 2014. En ceremonia de bienvenida al presidente de Francia, Francois Hollande en la Casa Blanca. 25 de diciembre de 2013. En una cena navideña en Hawai. 8 de diciembre de 2013. Para el evento Kennedy Center Honorees en la Casa Blanca. 31 de octubre de 2013. En un evento de Halloween en la Casa Blanca. 21 de septiembre de 2013. Para el Congressional Black Caucus Foundation Annual Phoenix Awards en Washington, DC. 11 de septiembre de 2013. Durante un evento del duodécimo aniversario de 11 de septiembre, en la Casa Blanca. 28 de agosto de 2013. Durante el evento de aniversario de Martin Luther King, Jr. en el Lincoln Memorial, Washington, DC. 27 de agosto de 2013. Proyección de \"The Powerbroker: Whitney Young's Fight for Civil Rights\" en el Eisenhower Executive Office Building en Washington, DC. 24 de agosto de 2013. La primera dama en el Arthur Ashe Kids Day dentro del Billie Jean King National Tennis Center en Queens, New York. 10 de agosto de 2013. El Presidente Barack Obama y la primera dama Michelle Obama llegando al Orlando International Airport, en Florida. 10 de julio de 2013. Michelle Obama y su esposo se dirigen a la ceremonia de las National Medal of Arts and National Humanities Medal. 4 de julio. Caminando en los jardines de la Casa Blanca, rumbo a la celebración del 237 aniversario de la Independencia de Estados Unidos. 2 de julio de 2013. Junto a la Primera Dama de Tanzania, Salma Kikwete, antes de partir en el Air Force One en el Julius Nyerere International Airport en Dar Es Salaam. 29 de junio de 2013. En un evento en el Sci-Bono Discovery Center en Johannesburgo. 29 de junio de 2013. Junto a su esposo y el presidente de Sudáfrica, Jacob Zuma y su esposa, Thobeka Madiba-Zuma, en Pretoria. 28 de junio. Llegando a la Waterkloof Air Force Base en Pretoria, Sudáfrica. 27 de junio de 2013. Con el presidente de Senegal, Macky Sall y su esposa Marieme Faye Sall, afuera del Palacio Presidencia en Dakar. 26 de junio de 2013. Michelle Obama junto a su hija Sasha antes de partir a Senegal. 19 de junio de 2013. En Alemania, junto a la canciller Angela Merkel y su esposo Joachim Sauer. 19 de junio. La primera dama llegando al Memorial to the Murdered Jews of Europe en Berlín, Alemania. 21 de enero. La primera dama Michelle Obama acompañó a su esposo en la ceremonia inaugural de su segundo periodo presidencial con un vestido azul marino de Thom Browne. La tela de su atuendo fue creada de forma similar a las corbatas de seda para caballeros. Su cinturón y guantes eran de J.Crew, y su collar fue diseñado por Cathy Waterman. Las botas eran de Reed Krakoff. 20 de enero. Para la recepción inaugural en el National Building Museum en Washington, D.C., la primera dama usó un vestido de lentejuelas negras de Michael Kors. Aquí el vestido completo. 20 de enero. Barack Obama hizo su juramentación por un segundo período presidencial en la Sala Azul de la Casa Blanca. Para la ocasión, su esposa, Michelle Obama, lució un vestido azul de Reed Krakoff. 19 de enero. Michelle Obama ayudó a pintar inmobiliario de la Burrville Elementary School durante el Day of Service. El top que luce aquí es de Tracy Reese. 19 de enero: La túnica que lució para el Children Gather For Kid's Inaugural Concert parece ser la misma Alexander McQueen que usó en otro evento de 2011, de acuerdo con el sitio Mrs. O. 17 de enero. El día de su cumpleaños, la primera dama estrenó fleco y lució un modelito de Zac Posen. 6 de enero de 2013. En un look muy relajado, la primera dama camina con su hija Sasha desde Marine One hacia la Casa Blanca. 5 de enero de 2013. El Presidente Barack Obama y la primera dama Michelle Obama, antes de abordar el Air Force One en Honolulu, luego de su vacaciones de fin de año. Este es un vestido Merona que se vende en Target. 25 de diciembre de 2012. Michelle Obama y el presidente de Estados Unidos visitan a los miembros del ejército y a sus familias, en la Marine Corp Base en Hawaii. Para la ocasión lució un modelito de Narciso Rodríguez. 22 de diciembre de 2012. Michelle Obama a su llegada a Honolulu, en donde pasaría unas vacaciones con su familia. 11 de diciembre de 2012. La primera dama llevó algunos regalos y juguetes al evento Toys for Tots, en Washington. 9 de diciembre de 2012. La primera dama de Estados Unidos, junto con su madre, Demi Lovato y Chris Mann, cantando el presentación navideña anual en Washington en el National Building Museum. 2 de diciembre. El Presidente Barack Obama y la primera dama en la recepción del Kennedy Center Honors, celebrada en Casa Blanca. Michelle Obama usó un espectacular vestido de Michael Kors, en tono metálico. 28 de noviembre. Para presentar la decoración navideña de la Casa Blanca, la primera dama usó un traje de seda dorada de Michael Kors. 23 de noviembre. Para recibir el árbol de Navidad de la Casa Blanca, Michelle Obama lució un cardigan negro con cinturón, una falda con estampado floral y unas botas altas de gamuza. 19 de noviembre. Aquí vemos a la primera dama con un diseño de Zero + Maria Cornejo, durante la ceremonia del President's Committee on the Arts and the Humanities, celebrada en la Casa Blanca. 7 de noviembre. Para abordar el Air Force One en Chicago, con rumbo a Washington, vimos a la primera dama con un atuendo muy chic de top y pantalón negro, al que añadió un abrigo multicolor de tweed y unos fabulosos guantes largos de piel. 3 de noviembre. En uno de los últimos actos de campaña de su esposo, Barack Obama, la primera dama lució un conjunto de pantalón negro y blusa con estampado florarl 1 de noviembre. Aquí la vemos con una interesante combinación otoñal: vestido tipo camisero de estampado floral en tonos morados, contrastando con unos tacones en verde seco. 22 de octubre. Para el último debate presidencial, Michelle Obama lució un vestido gris con una capa de encaje negro, también de cuello redondo y manga corta. La primera dama aderezó este diseño de Thom Browne con un prendedor plateado con negro en forma de lazo. 16 de octubre. Por una extraña coincidencia, tanto Michelle Obama como Ann Romney vistieron de rosa durante el segundo debate presidencial. El vestido y chaqueta rosa neón de Michelle Obama son de Michael Kors, y fueron aderezados con un delicado collar de perlas blancas. 16 de octubre. Lució un vestido estampado y sin manga durante su discurso en Chapel Hill, N.C. 15 de octubre. Durante un acto de campaña en la Ohio Wesleyan Univesity, lució un atuendo color mostaza, con suéter lleno de aplicaciones y bordados en blanco. 9 de octubre. Con un vestido estampado y botas altas asistió a un evento de campaña celebrado en el Loudoun County Fairgrounds, en Leesburg, Va. 3 de octubre. Durante el primer debate presidencial la primera dama usó una falda de cintura alta y un saco azul sobre una blusa estampada. 27 de septiembre. Completamente durante la grabación del programa de Steve Harvey en NBC. 28 de septiembre. Sobria y con una silueta muy estilizada, con pantalones negros de corte alto y un saco verde botella. 25 de septiembre. Aquí la vemos con un divertido atuendo que combinaba el fucsia con un abrigo morado. 24 de septiembre. Durante su visita al programa \"The View\", Michelle Obama lució un fantástico vestido verde de tirantes gruesos. 14 de septiembre. Este es otro diseño verde, pero en un tono más suave y fresco. Lo complementó con unos tacones en color mostaza. 13 de septiembre. Un bello vestido sin mangas y con cuello en V, estampado y muy colorido. 11 de septiembre. Durante el aniversario de los ataques del 11 de septiembre en el South Lawn de la Casa Blanca en Washington. 6 de septiembre. Para el cierre de la Convención Demócrata, Michelle Obama lució un vestido estampado color uva de la diseñadora Laura Smalls. 4 de septiembre. Durante su discurso en la Convención Demócrata, la primera dama de Estados Unidos lució un vestido rosa con azul grisáceo, confeccionado especialmente para ella por la creadora estadounidense, Tracey Reese. 3 de septiembre. Michelle Obama subió al escenario de la Convención Nacional Demócrata luciendo un bello vestido estampado, sin mangas y con cuello con pliegues, que combinó con unos tacones bicolor.  Compartir ", "external_links": [], "published": "2015-09-26T20:13:00.000+03:00", "crawled": "2015-09-26T20:14:26.248+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}