{"organizations": ["Senate", "GOP", "Selective Service", "CNN"], "uuid": "0854d668ecf8041c22ab82eecf1f5fe1c5a89d71", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150915140112-ronald-reagan-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_topstories.rss", "section_title": "CNN.com - Top Stories", "url": "http://edition.cnn.com/2015/09/16/us/oklahoma-richard-glossip-execution/index.html?eref=rss_topstories", "country": "US", "title": "GOP candidates collide with Reagan on immigration", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "GOP candidates collide with Reagan on immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T11:29:00.000+03:00", "replies_count": 0, "uuid": "0854d668ecf8041c22ab82eecf1f5fe1c5a89d71"}, "author": "", "url": "http://edition.cnn.com/2015/09/16/us/oklahoma-richard-glossip-execution/index.html?eref=rss_topstories", "ord_in_thread": 0, "title": "GOP candidates collide with Reagan on immigration", "locations": ["U.S.", "Mexico", "Virginia", "Houston", "El Salvador", "Guatemala", "Texas", "Wisconsin", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Reagan", "Marco Rubio", "Aristedes Parada", "Donald Trump", "Ronald Reagan", "Scott Walker", "Parada", "Edelmira Parada"], "text": "The rise of Ronald Reagan (CNN) In 1979, as civil war in El Salvador began to grip the country, a young man named Aristedes Parada faced a choice: Stay home and be recruited into the bloody fight, or flee for a chance to survive. \"There was no future there. I had to be hiding from the military, from the guerrillas,\" Parada told CNN of his youth in El Salvador. \"It was horrible.\" He boarded a bus heading north for a days-long journey that would take him across his native country, through Guatemala and Mexico, and finally, to the U.S. border, where he hired a coyote to guide him into Texas illegally. Without papers, Parada worked in construction in Houston, and eventually made his way to Virginia, where he married Edelmira Parada, a young Salvadoran woman also lived there unlawfully. They had two children, both born as U.S. citizens. Capturing Ronald Reagan during the golden age of TV News The Paradas were among many who poured across the U.S.-Mexico border around the time when Ronald Reagan began his presidency. He faced a situation that appears all-too-familiar to the 2016 presidential candidates, who are grappling with a similar problem three decades later. But Reagan's solution was very different: He eventually granted amnesty to millions. While Reagan is recognized among Republicans as the greatest president in modern times, most GOP presidential candidates are ignoring his approach to immigration. Much like the immigration discussion today, the influx of undocumented immigrants vexed lawmakers during the Reagan years, who struggled to with the question of how to balance border security and the rule of law with families who had put down roots in the country. The problem ballooned, and took center stage in the 1984 presidential election. GOP candidates battle to claim Ronald Reagan's mantle \"I believe in the idea of amnesty for those who have put down roots and lived here, even though sometime back they may have entered illegally,\" Reagan said at a presidential debate in 1984. In 1986, Reagan signed the Immigration Reform and Control Act, which granted amnesty to 2.7 million undocumented immigrants who had arrived in the U.S. before 1982, had a clean record and registered with the Selective Service. Critics of the law, however, have pointed out that it failed to crack down on future waves of illegal immigration. The Paradas applied, and also sought sponsorship from their employers just in case they were rejected. By 1995, they too were granted U.S. citizenship. Heading into the 2016 campaign, Donald Trump, the GOP's front-runner, is calling for the deportation of millions back to their countries of origin, proposed doing away with birthright citizenship and promised to build a wall along the entire border with Mexico. Others have condemned amnesty. As a presidential contender, Wisconsin Gov. Scott Walker reversed his position on providing a pathway to citizenship to undocumented immigrants. Even Florida Sen. Marco Rubio, who helped guide a comprehensive immigration bill through the Senate, has backed away from that legislation, even though he still supports the policies within it. Opinion: What Reagan knew about immigration Families like the Paradas have watched the rise of Trump and other Republican contenders closely. \"They speak so much of Ronald Reagan. But when it comes to immigration, they try to hide it somehow and don't talk about it,\" Parada, who has thrived in the U.S. in the construction business, said. \"A lot of people disagreed with his idea back then too, but he did it anyway.\" Reagan, Parada added, \"is a hero for a lot of people. He is for me.\"", "external_links": [], "published": "2015-09-16T11:29:00.000+03:00", "crawled": "2015-09-16T11:56:07.232+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}