{"organizations": [], "uuid": "633e978f6437666699ea2ebff5417d576ff9640c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_080515gn2.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/policy/national-security/250316-obama-draws-comparison-between-iraq-war-iran-vote", "country": "US", "title": "Obama draws comparison between Iraq war, Iran vote", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama draws comparison between Iraq war, Iran vote", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T19:31:00.000+03:00", "replies_count": 0, "uuid": "633e978f6437666699ea2ebff5417d576ff9640c"}, "author": "Jordan Fabian", "url": "http://thehill.com/policy/national-security/250316-obama-draws-comparison-between-iraq-war-iran-vote", "ord_in_thread": 0, "title": "Obama draws comparison between Iraq war, Iran vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama draws comparison between Iraq war, Iran vote Greg Nash By Jordan Fabian - 08/05/15 12:31 PM EDT \nPresident Obama on Wednesday made a forceful case for congressional approval of his nuclear deal with Iran, arguing a vote to kill the deal was the most consequential foreign policy decision for lawmakers since the Iraq War. \nObama, who ran for president in 2008 opposing the unpopular war, used a sweeping address to dismiss politicians who oppose the Iran agreement as the same people who authorized the conflict in Iraq. ADVERTISEMENT “Many of same people who argued for the war in Iraq are now making the case against the Iran nuclear deal,” Obama said from American University, a site designed by the White House to draw comparisons to President John F. Kennedy.\n“More than a decade later, we still live with the consequences of the decision to invade Iraq,” Obama said. \nThe president’s comparison to the 2002 decision to invade Iraq could help him drum up support from Democrats as they decide whether to endorse the accord. \nMany Democrats, including several top Obama administration officials, voted for the war but later came to regret their decision. \nFormer Secretary of State Hillary Clinton, the Democratic frontrunner for president in 2016, recently called her vote in favor of the war a “mistake.” Vice President Biden and Secretary John Kerry, the chief U.S. negotiator on the Iran deal, also voted for the war when they served in the Senate. \nObama drew parallels to the Kennedy’s famous 1963 speech from American University in which he called for negotiating with the Soviet Union in order to avoid war between two nuclear-armed powers. \nThe president said the Iran accord “builds on a tradition of strong principled diplomacy” that Kennedy used to head off the Cuban Missile Crisis. \nObama used the comparison to rebut critics who argue the U.S. should not negotiate with a fierce adversary, such as Iran. \nHe said it was “diplomacy, not saber rattling, not tough talk” that brought Iran to the table. \nThe president's speech is part of an intense lobbying campaign on both sides to sway lawmakers during the August recess. \nThe House and Senate are expected to vote on a resolution disapproving the deal in September. \nThe measure is expected to pass the House, but it is not clear whether it will survive a filibuster in the Senate. \nIf it does win 60 votes and clear the Senate, the question will be whether opponents can muster two-thirds majorities in each chamber to override a promised Obama veto.", "external_links": [], "published": "2015-08-05T19:31:00.000+03:00", "crawled": "2015-08-05T19:37:28.746+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}