{"organizations": [], "uuid": "c9b61db95256107939aff00a83c011c09ebf286e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c8ff751700006e00567185.jpeg", "site_section": "http://www.huffingtonpost.com/tag/elections-2016/feed", "section_title": "Elections 2016 on Huffington Post", "url": "http://www.huffingtonpost.com/entry/hillary-clinton-marco-rubio-abortion_55c8ff61e4b0f73b20ba441c?kvcommref=mostpopular", "country": "US", "title": "Hillary Clinton: Marco Rubio's Abortion Stance Is 'Offensive And Troubling'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Hillary Clinton: Marco Rubio's Abortion Stance Is 'Offensive And Troubling'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T20:01:00.000+03:00", "replies_count": 0, "uuid": "c9b61db95256107939aff00a83c011c09ebf286e"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/hillary-clinton-marco-rubio-abortion_55c8ff61e4b0f73b20ba441c?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Hillary Clinton: Marco Rubio's Abortion Stance Is 'Offensive And Troubling'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hillary Clinton: Marco Rubio's Abortion Stance Is 'Offensive And Troubling' And you thought Donald Trump was out to get women. Samantha Lachman Staff Reporter, The Huffington Post Posted: 08/10/2015 05:01 PM EDT | Edited: 14 minutes ago \nWASHINGTON -- Democratic presidential hopeful Hillary Clinton attacked Sen. Marco Rubio (R-Fla.) on Monday, saying his comments about abortion during last Thursday's Republican primary debate were just as offensive as businessman Donald Trump's comments about women. \nClinton pivoted to Rubio's comments on abortion after a reporter in New Hampshire questioned her regarding Trump's derogatory comments about Fox News' Megyn Kelly. Referring to Kelly, Trump said, \"There was blood coming out of her eyes, blood coming out of her wherever\" after she scrutinized his record during last week's debate. \nRubio's comment that he had never supported any exceptions to an abortion ban -- though his record would indicate otherwise -- should attract just as much attention as Trump's, Clinton said. \nIt was offensive. I said it was outrageous; I stand by that. I think more people should say the same; they should be going after him. The Republican party is going to have to deal with him ... all these women that I have fought for, worked for, stood up for, advocated for, and want to be a president for, who may not have the opportunity to defend themselves -- who may lose the right to exercise a personal choice if certain Republicans were to be successful -- I don't want that forgotten. So yes, I know it makes great TV, I think [Trump] went way overboard -- offensive, outrageous, pick your adjective. \nBut what Marco Rubio said has as much of an impact in terms of where the Republican Party is today as anybody else on that stage, and it is deeply troubling. And it should be to the press, not just to those of us who have been doing this work for so long. \nClinton added that Rubio's abortion position \"is as offensive and troubling a comment as you could hear\" from a Republican presidential candidate. \nPublic opinion about abortion appears to be on Clinton's side. Just 19 percent of Americans believe that abortion should be illegal in all circumstances, according to Gallup .", "external_links": [], "published": "2015-08-10T20:01:00.000+03:00", "crawled": "2015-08-11T00:20:56.124+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}