{"organizations": [], "uuid": "6ddbb5cd288d65c39bc48f3ed45747ac5fd7cf18", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55fc1aef1c00002d0075759a.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/bristol-palin-obama-ahmed-mohamed_55fc1a91e4b00310edf6a79e", "country": "", "title": "Bristol Palin Is Wrong: It's A Good Thing That Obama Invited Ahmed Mohamed To The White House", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Bristol Palin Is Wrong: It's A Good Thing That Obama Invited Ahmed Mohamed To The White House", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T20:11:00.000+03:00", "replies_count": 0, "uuid": "6ddbb5cd288d65c39bc48f3ed45747ac5fd7cf18"}, "author": "", "url": "http://www.huffingtonpost.com/entry/bristol-palin-obama-ahmed-mohamed_55fc1a91e4b00310edf6a79e", "ord_in_thread": 0, "title": "Bristol Palin Is Wrong: It's A Good Thing That Obama Invited Ahmed Mohamed To The White House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Palin", "Julia Craven"], "text": "2 Email Bristol Palin Is Wrong: It's A Good Thing That Obama Invited Ahmed Mohamed To The White House As usual, Palin misses the mark. Julia Craven Staff Reporter, The Huffington Post Posted: 09/18/2015 12:50 PM EDT | Edited: 19 minutes ago Todd Williamson/Invision/AP \nBristol Palin, former reality television star and daughter of former Alaska Gov. Sarah Palin (R), criticized President Barack Obama on Thursday for inviting a Muslim teenager to the White House. Fourteen-year-old Ahmed Mohamed , a 9th-grader at MacArthur High School in Irving, Texas, was arrested on Monday after showing a homemade clock to a teacher. He says he was asked whether he had \"tried to make a bomb.\" Later in the week, Obama tweeted to Ahmed and invited him to the White House: Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great. — President Obama (@POTUS) September 16, 2015 Palin argued in a post on her blog that Obama should \"STAY out\" (emphasis hers) of the situation with Ahmed. \n“ This encourages more racial strife that is already going on with the 'Black Lives Matter' crowd and encourages victimhood,” she wrote. The police, she acknowledged, \"clearly\" made a mistake by taking Ahmed to juvenile detention. \"But why put more people against [the police]?\" Palin asked. \"Why egg it on? Childish games like this from our president have divided our country… even more today than when he was elected.\" Palin has made off-base comments like this before , but what she never seems to have is useful context. Obama isn't \"egging on\" anti-police sentiment by inviting Ahmed to the White House. He's acknowledging a very real problem of racism and attempting to combat the harmful stereotypes that led to the boy's arrest. \nHis gesture is a small acknowledgment that maybe, just maybe, divisiveness in the country comes from those who automatically assume Muslims are terrorists and black people are thugs. \nPalin's post suggests that racism is not a big deal and that people should chill out and avoid exacerbating tensions. But for the people who encounter racism in their daily lives, it's not that simple. \nMuslims in America have faced a slew of racist and Islamophobic attacks since the 9/11 attacks , including a terrorism plot led by a reputed Klansman. They've been falsely accused of creating \" no-go zones \" where non-Muslims are unwelcome. And many of their fellow Americans keep speaking and acting as if only Muslim extremists commit terror attacks, even though that's clearly not true . \nIn 2001, at least 500 anti-Muslim hate crimes were recorded by the FBI's Uniform Crime Reporting Program. In the years since, the number of hate crimes against Muslims has remained roughly five times higher than before the Twin Towers fell. \n\"The problem is that, in America, we don't believe in considering an entire group guilty on the basis of an individual's actions, but that's essentially what's happened … and it hasn't really stopped,\" Simran Jeet Singh, a professor at Trinity University, told The Huffington Post earlier this month. \"It's become part of the shared experience for, essentially, anybody in this country with brown skin.\" \nA study released by the New America Foundation in June showed that at least 48 people have been killed by right-wing extremists in the U.S. since 9/11, almost double the number killed by self-identified jihadists in the same period. Most of these attacks were carried out by radical anti-government groups or white supremacists. \nBut hard facts seem to have less influence on the thinking of those like Palin than the anti-Muslim climate that has lingered amid a dozen years of U.S. warfare in and against various majority-Muslim countries. \n\"Combine that with a 24-hour news cycle that privileges simple narratives over nuance, and with policymakers who have too often shown a lack of knowledge about the history, politics, and cultures of the places where the US wages war and sees threats -- and you're looking at some entrenched, perpetually reinforced stereotypes about Muslims, Islam and terrorism,\" Timothy McGrath wrote for the GlobalPost . \nWhich brings us back to Palin’s attempt to link Ahmed's case to Black Lives Matter. Like Muslims, black people are easy to stereotype with broad strokes rather than to consider as individuals. And as Palin's post proves, it's also easy to ignore the problem by suggesting that advocating on behalf of either group stirs up racial tensions. Anyone who thinks Black Lives Matter is a root cause of “racial strife,” though, doesn't know anything about black history. The movement, like hip-hop before it, has often been blamed for the resentment black folks feel toward law enforcement. But this aggressive criticism of police is a response to mistreatment at the hands of police officers -- it's a symptom, not a cause. \nAnd it's that mistreatment, not Obama's outreach to Ahmed or protests against police brutality, that continues to fuel this so-called racial strife. Simply put, when a movement is countering the dominant narrative with truth -- especially unapologetic truth -- that movement is blamed for inciting violence. It’s an old, tired argument. Standing up for oppressed groups in a way that makes white people uncomfortable isn't causing \"racial strife\" -- the problem is the constant dismissal of what happens to black and brown people at the hands of those sworn to protect us. Obama’s invitation to Ahmed is important because it helps debunk the idea that all Muslims are terrorists while showing how ridiculous it is to condemn a child’s curiosity. The president's gesture indicates that even though the police may have made an isolated mistake, we need to stop seeing all these incidents as isolated mistakes, and start advocating on behalf of the victims instead. \nBut the real issue raised by Palin's blog post isn't that Obama invited Ahmed to the White House. Contrary to what she claims, that doesn't aggravate any tensions. More importantly, her knee-jerk unwillingness to sympathize with Ahmed indicates how, in this case and many others , black and brown people are all too quickly seen as criminals, aren’t afforded the benefit of the doubt and are held to incredibly high standards of personal responsibility that they'll never attain as long as their skin is not white . Ahmed's education was disrupted because a teacher thought he was a terrorist. Because of the same social ill, though, Christian Taylor and Mike Brown won't get educations at all. Palin misses the mark by claiming Obama is worsening racial tensions with his support for Ahmed. She should keep her tone-deaf comments to herself until she learns where racial strife actually comes from. ", "external_links": [], "published": "2015-09-18T20:11:00.000+03:00", "crawled": "2015-09-18T20:11:52.928+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}