{"organizations": [], "uuid": "e6e89b27d1b32d8176d9f8e53bf2e38e3726d761", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/getty-2015-09-23-pope-obama.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/254749-pope-and-obama-are-all-smiles-at-white-house", "country": "US", "title": "Pope and Obama are all smiles at White House", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Pope and Obama are all smiles at White House", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:45:00.000+03:00", "replies_count": 0, "uuid": "e6e89b27d1b32d8176d9f8e53bf2e38e3726d761"}, "author": "Niall Stanage", "url": "http://thehill.com/homenews/administration/254749-pope-and-obama-are-all-smiles-at-white-house", "ord_in_thread": 0, "title": "Pope and Obama are all smiles at White House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pope and Obama are all smiles at White House Getty Images By Niall Stanage - 09/23/15 08:45 PM EDT \nPope Francis brought his own brand of politics to Washington on Wednesday, insisting on the need for action on climate change and telegraphing his empathy for immigrants before a private session at the White House with President Obama. \nThe pope didn’t wait for his Thursday address to a joint session of Congress to offer specific — and potentially divisive — political comments. ADVERTISEMENT Wishing an estimated 11,000 guests on the South Lawn of the White House a good morning, he noted how “as the son of an immigrant family, I am happy to be a guest in this country, which was largely built by such families.”\nThe remark was met with applause by the thousands assembled in the September sunshine — and by a beaming Obama, who wore a broad smile throughout much of the ceremony. \nThere was also an admiring intake of breath from attendees when Francis invoked one of Martin Luther King Jr.’s famous phrases to call on mankind to take action on climate change. \n“To use a telling phrase of Reverend Martin Luther King, we can say that we have defaulted on a promissory note and now is the time to honor it,” said the pope, referencing King’s address at the 1963 March on Washington. \nThe pope moments before had declared Obama’s efforts to reduce pollution “encouraging,” insisting that “climate change is a problem which can no longer be left to a future generation.” \nFrancis had told reporters shortly before arriving in the United States that it would be “a mistake of interpretation” to see him as “leftish.” But his remarks at the White House spotlighted his areas of common ground with Obama and U.S. liberals, while he largely ignored topics on which he is aligned with conservatives. \nHe alluded approvingly to the resetting of U.S. relations with Cuba, for example, while making no direct references to his opposition to abortion and same-sex marriage. \nFrancis’s message seemed so politically favorable for Obama that, later in the day, White House press secretary Josh Earnest was obliged to push back at suggestions from reporters that there could have been an unusually high level of cooperation on the pope’s speech. \n“These are decisions made entirely by the pope and his team,” Earnest said at one point, referring to the content of the address. \nEarnest also emphasized that the president had a “deep admiration” for the pope and that the White House ceremony was “powerful.” \nThe visit had all the pomp and circumstance the White House can bring to bear for a foreign dignitary, barring a 21-gun salute. Earnest said that option was left aside because of the potential for “dissonance in welcoming a professed man of peace to the White House through the repeated firing of weapons.” \nMilitary bands played, however, before a crowd that also included Vice President Biden, Secretary of State John Kerry and Sen. Bernie Sanders (I-Vt.), the liberal Democratic presidential candidate. \nObama himself, speaking before the pope, linked the religious leader to his own agenda, thanking him for his encouragement on Cuba, praising his focus on “the least of these” and bringing up the same issues of immigration and climate change that the pope would address moments later. \n“You remind us that the Lord’s most powerful message is mercy,” Obama said. “And that means welcoming the stranger with empathy and a truly open heart — from the refugee who flees war-torn lands to the immigrant who leaves home in search of a better life.” \nThe pope traveled from the Vatican’s Apostolic Nunciature of the Holy See in Northwest Washington in a modest Fiat, which drove up to the White House. \nAfter the pope emerged to shake hands with the president and first lady Michelle Obama, bands played the anthem of the Vatican and “The Star-Spangled Banner.” \nRepublicans, for the most part, did not criticize the pope during the first full day of his six-day trip, despite the political notes he struck. Prominent GOP figures preferred to adopt a welcoming posture that largely avoided engaging on specific policies. Speaker John Boehner (R-Ohio), for example, on Wednesday afternoon tweeted links to his own website in which the observations of some young students from Washington’s Catholic schools were collated. \n“Jasmine, 8th grader at St. Anthony’s in #DC, thinks #PopeFrancis’ ‘visit will bring more positivity’ Me too,” Boehner tweeted. \nFollowing the White House ceremony, Francis conducted a parade in his popemobile to adoring crowds that thronged downtown Washington. Fears that the nation’s capital would suffer a traffic meltdown during the pontiff’s visit were not borne out, however; those streets that remained open were quieter than usual, suggesting many people had stayed home. \nLater, Francis spoke to around 300 bishops at the Cathedral of St. Matthew the Apostle before moving on again to celebrate mass at the Basilica of the National Shrine of the Immaculate Conception in Northeast Washington. \nThe pope will depart from Washington after his address to Congress on Thursday, visiting New York later that day and on Friday before going on to Philadelphia. \nHe will depart from the United States on Sunday evening, bringing his first-ever trip to the country to a close. Tags:", "external_links": [], "published": "2015-09-24T03:45:00.000+03:00", "crawled": "2015-09-24T10:07:25.882+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}