{"organizations": [], "uuid": "e6a995ec907080335b05422d510705a022eaa8be", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/Mexico%20Marijuana%20Girl.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/health/2015/09/08/8-year-old-grace-opens-way-to-using-medical-cannabis-legally-in-mexico/", "country": "", "title": "8-year-old girl opens way for Mexico to legalize medical marijuana | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "8-year-old girl opens way for Mexico to legalize medical marijuana | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T18:45:00.000+03:00", "replies_count": 0, "uuid": "e6a995ec907080335b05422d510705a022eaa8be"}, "author": "", "url": "http://latino.foxnews.com/latino/health/2015/09/08/8-year-old-grace-opens-way-to-using-medical-cannabis-legally-in-mexico/", "ord_in_thread": 0, "title": "8-year-old girl opens way for Mexico to legalize medical marijuana | Fox News Latino", "locations": ["Mexico"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "8-year-old girl opens way for Mexico to legalize medical marijuana Published September 08, 2015 EFE \nMexico – Grace is 8 years old with a rare disease that makes her suffer 400 epileptic convulsions every day. She doesn't know it, but her case is making history in Mexico following a judge's decision to allow the import of a cannabis derivative for her treatment \n\"Grace acts like a baby girl no more than 6 months old. She depends on all of us,\" the child's father, Raúl Elizalde, told EFE, and called the judge's decision \"very courageous.\" \nOn Aug. 17, Judge Martin Santos extended legal protection to authorities who permit Graciela Elizalde's parents to import a medicine containing cannabidiol, a substance banned by Mexico's General Law of Health. \nDuring the case, lawyers appealed several articles in this law on grounds that they are unconstitutional because they violate \"several human rights\" such as the right to live without pain, the family's attorney, Fabian Aguinaco, told EFE. \nGraciela suffers from Lennox-Gastaut Syndrome, characterized by powerful epileptic fits, even while she sleeps. \nMeanwhile her parents Raúl and Mayela, who live in Monterrey, capital of the northern state of Nuevo León, have tried everything, from anti-convulsive medications that are legal in Mexico to a corpus callosotomy in 2013, a surgical procedure that entails cutting the band of fibers connecting the hemispheres of the brain. \nAll to no avail for Graciela, the attorney said, which is why the parents decided to try cannabidiol, a substance that relaxes the muscles of the body. \nIn order to get the substance into the country, the parents will travel later this month to the United States, where specialists will prescribe the exact treatment for Grace, a condition imposed by the judge for bringing cannabidiol into Mexico. \nRaúl and Mayela are an example of dedication and love, feelings they seem to have passed along to Valentina, Grace's 2 1/2-year-old little sister. \n\"She loves her and takes great care of her, she does everything for her. She wipes away her little droolings with a napkin, she feeds her...Grace couldn't have a better sister,\" Mayela said. \n\"Grace's case shows the benefits of the plant,\" Fernando Belaunzaran, presidential candidate for the leftist PRD party, told EFE, adding that the current situation shows that \"the war on drugs is a complete failure\" and that Grace, at her 8 years of age, can be \"removing the first brick from the wall of prohibition\" of cannabis in Mexico. \nLike us on Facebook ", "external_links": [], "published": "2015-09-08T18:45:00.000+03:00", "crawled": "2015-09-08T18:45:17.606+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}