{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "872692fe73a52b211df824b8fad6402d73c08153", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/082515_an_herridge_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/08/25/exclusive-state-dept-released-clinton-email-had-classified-intel-from-3/", "country": "", "title": "Exclusive: State Dept.-released Clinton email had classified intel from 3 agencies, possibly violating Obama order | Fox News", "performance_score": 9, "site": "foxnews.com", "participants_count": 0, "title_full": "Exclusive: State Dept.-released Clinton email had classified intel from 3 agencies, possibly violating Obama order | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T01:01:00.000+03:00", "replies_count": 0, "uuid": "872692fe73a52b211df824b8fad6402d73c08153"}, "author": "", "url": "http://www.foxnews.com/politics/2015/08/25/exclusive-state-dept-released-clinton-email-had-classified-intel-from-3/", "ord_in_thread": 0, "title": "Exclusive: State Dept.-released Clinton email had classified intel from 3 agencies, possibly violating Obama order | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nOne of the emails that triggered the FBI probe into Hillary Clinton’s server contained classified intelligence from three different agencies, Fox News has learned – which could mean the State Department violated a President Obama-signed executive order by authorizing its release. \nThat 2009 order, EO 13526, lays out the rules for \"classifying, safeguarding and declassifying national security information.\" It states that the authority to declassify rests with the intelligence agency that originated the information. \n\"Information shall be declassified or downgraded by … the official who authorized the original classification ... [or] the originator's current successor,\" the order says. \nOne of the two emails that sparked the FBI probe was an April 2011 email from Clinton confidant Huma Abedin that, Fox News has learned, contained intelligence from the Defense Intelligence Agency (DIA), the National Security Agency (NSA), and the National Geospatial-Intelligence Agency (NGA), which oversees aerial imagery, including satellites. \nDespite this fact and despite the executive order, the State Department publicly released the email and its intelligence -- which was not theirs to declassify -- onto its website in May as part of the initial release of documents on the 2012 Benghazi attack. \nFox News is told that in late spring, all three agencies confirmed to the intelligence community inspector general that the intelligence was classified when it was sent four years ago by Abedin to Clinton's private account, and remains classified to this day. \nClinton’s campaign and the State Department have maintained that the email was not classified and have framed the issue as a difference of opinion. \n\"What you're seeing now is a disagreement between agencies saying, 'You know what, they should've.' And the other saying, 'No they shouldn't.' That has nothing to do with me,\" Clinton told reporters last week. \nThe State Department spokesman also said last Wednesday they are seeking a second opinion on the classification of some emails from the Office of the Director of National Intelligence, who leads the intelligence community. \n“I made clear that we’ve asked the Director of National Intelligence for another assessment of those two, the two that the ICIG had determined should have been classified – or at least portions of which should have been classified top secret. So we’ve asked the DNI to look at that and we’ll see what happens,” spokesman John Kirby said. \nBut a source close to the email investigation emphasized there is no such appeals process, and the finding that the intelligence was classified by the agencies who owned it is \"not negotiable.\" \nA spokesman for the Office of the Director of National Intelligence declined to comment and referred questions to the FBI. \nSeparately, Fox News has learned that a senior State Department official, Under Secretary Patrick Kennedy, who was deeply involved in the Benghazi controversy, is running interference on the classified email controversy on Capitol Hill. \nTwo sources confirmed that Kennedy went to Capitol Hill in early July and argued the 2011 Abedin email – which as Fox News first reported kick-started the FBI probe along with a second 2012 email from Clinton aide Jake Sullivan -- did not contain classified material. \nTo make his case, Kennedy cited a 2011 Irish Times newspaper report about the Libyan revolution, to claim the information was already out there. \nOne participant found it odd Kennedy insisted on having the discussion in a secure facility for classified information, known as a SCIF, though Kennedy said the Abedin email was unclassified, and the Irish Times story did not contain comparable details. \nAlso, to defend the State Department's decision to release the email without redactions, Kennedy said a contact at the CIA was in agreement, according to two sources with direct knowledge of the claims, though the intelligence did not come from the CIA. \nAn agency spokesman declined to comment. A State Department spokesman took Fox's questions and said they would respond. \nSince the initial tranche of 296 Benghazi emails was released in May, a government official said all of the intelligence agencies have reviewers at the State Department to identify emails that may contain classified material that came from them, in order to avoid a repeat of the Abedin situation. \n\n\nCatherine Herridge is an award-winning Chief Intelligence correspondent for FOX News Channel (FNC) based in Washington, D.C. She covers intelligence, the Justice Department and the Department of Homeland Security. Herridge joined FNC in 1996 as a London-based correspondent. Advertisement ", "external_links": [], "published": "2015-08-26T01:01:00.000+03:00", "crawled": "2015-08-26T01:01:18.335+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}