{"organizations": [], "uuid": "a5618034c633e1280465e42d6595ff5961725289", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/mcconnell_obama_boehner_092915gn.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/255378-boehner-mcconnell-obama-to-take-last-stab-at-budget-deal", "country": "", "title": "Boehner, McConnell, Obama to take last stab at budget deal | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Boehner, McConnell, Obama to take last stab at budget deal | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:23:00.000+03:00", "replies_count": 0, "uuid": "a5618034c633e1280465e42d6595ff5961725289"}, "author": "", "url": "http://thehill.com/policy/finance/255378-boehner-mcconnell-obama-to-take-last-stab-at-budget-deal", "ord_in_thread": 0, "title": "Boehner, McConnell, Obama to take last stab at budget deal | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alexander Bolton", "Boehner", "McConnell", "Obama"], "text": "Boehner, McConnell, Obama to take last stab at budget deal By Alexander Bolton - 09/29/15 08:14 PM EDT \nCongressional Republican leaders are launching budget talks with the White House. \nThe talks could give outgoing Speaker John Boehner (R-Ohio) a last chance at a big deal with President Obama. \nThey could also clear the decks of messy issues that could challenge Sen. Mitch McConnell’s bid to hold his Senate majority in next year’s elections. ADVERTISEMENT Boehner on Sunday signaled his interest in getting a deal done, saying he wanted to “clean up the barn a little bit before the next guy gets here.” \nYet the talks could be a real problem for House Majority Leader Kevin McCarthy (R-Calif.), who is running for Speaker and could find himself under pressure to object to any negotiations Boehner engages in with McConnell (R-Ky.), the White House and Democrats. \nNews of the budget talks is already unnerving the same House conservatives who pushed Boehner from power. \n“Why the president would look to John as being able to speak on behalf of the House is, I think, a legitimate question. The man just quit. I’m not sure how much weight he continues to carry in the body,” said Rep. Mick Mulvaney (R-S.C.), an influential member of the House Freedom Caucus. \n“Right now, he’s the least accountable that he’s ever been to anybody. And I don’t think it would be fair to take advantage of that circumstance to pass stuff that he wouldn’t have passed before his resignation.” \nOne of Boehner’s most strident critics, Rep. Thomas Massie (R-Ky.), said the Speaker’s entry into budget talks merely illustrated all the problems that conservatives had with leadership. \n“It was never appropriate for the Speaker to anoint himself Speaker of the United States, and then go have talks with the president and the Senate,” he said. \n“This thing’s been upside-down the whole time I’ve been here. He goes and cuts a deal with the Senate and the president, and comes down here and asks for my voting card,” added Massie, who said he saw no reason to believe the situation would change under a Speaker McCarthy. \nRep. Mike Simpson (R-Idaho), a longtime Boehner ally, said it was no surprise that the budget talks would upset the House’s right flank. \n“There’ll be some people that will be unhappy with it. But the reality is, we have to get a budget deal somehow,” he said, adding that “we’ve all known for six months, eight months” that negotiations would have to happen. \nSimpson said that he believes Boehner wants to get a broader budget deal before he departs at the end of October, to give lawmakers a chance to work out the details before December. \n“It’s one of the things he’s going to try to clear off the table for the next Speaker.” \nThe House and Senate are poised to vote Wednesday on a short-term measure to prevent a shutdown on Thursday and keep the government open through Dec. 11. \nEven that measure is controversial in the House, and might draw many “no” votes from Republicans. Most will be watching to see how McCarthy and other candidates for leadership positions cast their ballots. \nGOP leaders are seeking to strike a deal that would set top-line budget numbers for the next two years. Congress also faces pressure to raise the debt ceiling, and Boehner on Tuesday didn’t rule out taking care of that issue before the end of next month. \nMcConnell told reporters Tuesday that he and Boehner spoke to Obama last week and expect to sit down more formally with the administration “soon.” \n“We’d like to settle the top line for both years so that next year we could have a regular appropriations process. The president, Speaker Boehner and I spoke about getting started in the discussions last week and I would expect them to start very soon,” McConnell said. \nA White House official said McConnell and Boehner reached out to Obama on Sept. 17, the same day the president met with Democratic leaders Harry Reid (Nev.) and Nancy Pelosi (Calif.) at the White House to discuss strategy ahead of the fall negotiations. \nMcConnell and Boehner spoke to Obama again in a follow-up call last week, according to the White House official. \nA Democratic leadership aide contended that during a conversation with Obama and Boehner, McConnell sought to exclude Reid and Pelosi from the talks. Both the president and the Speaker rejected the suggestion, the aide said. \n“Obama pushed back and said they should include everybody. Boehner pushed back, too,” the source said, noting that Boehner will need Democratic votes to get a deal passed in the House. \nA White House official said Tuesday that Obama stressed to McConnell and Boehner that Reid and Pelosi should be included in the budget talks. \nDon Stewart, McConnell’s spokesman, disputed the claim that McConnell sought to shut out Democratic leaders, noting the Democratic leadership aide “was not on the call” and “we haven’t done any readouts of the call.” \nA spokesman for Boehner declined to provide a readout. \nDemocrats in the House and Senate would likely be needed to ensure passage of a measure through both chambers. \nMcConnell and Republicans believe they can get a better deal by negotiating bilaterally with Obama, however, pointing to the successful talks between Vice President Biden and McConnell in 2012 to make the Bush income tax rates permanent for people earning under $400,000. \nGetting a budget deal done is likely to be a tall order given the leadership races in the House. \nBoehner, who surprised Washington by announcing his resignation Friday, is set to leave his position and Congress at the end of October. It’s not clear when the elections on his replacement will be held. \nMcConnell said Tuesday he did not know how much could get done in the next month. \n“How much of that could come together before Speaker Boehner leaves, I have no earthly idea. But we have a number of different things that need to be addressed, and the deadline is December the 11th,” he said, referring to the expiration date of the stopgap measure Congress will pass this week. \nA source close to McConnell said he hopes to secure a deal to increase discretionary spending for defense and nondefense programs in exchange for reductions to mandatory spending. \nRepublican lawmakers say McConnell and Boehner are serious about getting a deal — and that Obama wants another accomplishment before leaving office. \n“The president is concerned about his legacy and has an interest in getting the budget process back on track. It’s chaos now,” said one senior Republican senator. \nJordan Fabian, Bernie Becker and Cristina Marcos contributed. \nUpdated at 8:14 p.m. ", "external_links": [], "published": "2015-09-30T03:23:00.000+03:00", "crawled": "2015-09-30T03:23:43.090+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}