{"organizations": [], "uuid": "6848102e235ca56857f3c50ec86fec04036566ec", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e8621a1400002e002e4d4e.jpeg?cache=aEP8ZqL5ZW", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-puppies-alaska_55e860e7e4b0aec9f356402b", "country": "", "title": "Obama Pauses In Alaska To Snuggle With Cute Puppies", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Pauses In Alaska To Snuggle With Cute Puppies", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T20:41:00.000+03:00", "replies_count": 0, "uuid": "6848102e235ca56857f3c50ec86fec04036566ec"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-puppies-alaska_55e860e7e4b0aec9f356402b", "ord_in_thread": 0, "title": "Obama Pauses In Alaska To Snuggle With Cute Puppies", "locations": ["Alaska"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sara Bondioli", "Barack Obama", "Mandel", "Obama"], "text": "Obama Pauses In Alaska To Snuggle With Cute Puppies The president also exchanged Eskimo kisses with local educators. Sara Bondioli Deputy Politics Editor, The Huffington Post Posted: 09/03/2015 12:25 PM EDT | Edited: 1 hour ago Credit: Mandel Ngan/AFP via Getty Images President Barack Obama cuddles with a puppy Wednesday. \nSometimes you just need a snuggle. \nPresident Barack Obama proved he isn't immune to that desire either, as he made an extra stop Wednesday in Kotzebue, Alaska, to see 2011 Iditarod champion John Baker and his dogs. \nObama was introduced to puppies Feather and Moose, after being given a Team Baker hat and jacket. \nThe president scooped up Feather in his arms and carried the dog around while posing for pictures and asking questions about the 1,000-mile dog sled race . \nUpping his \"awww\" factor for the day, Obama also exchanged Eskimo kisses with local educators, according to The Washington Post. \n\"It's our culture to welcome you with an Eskimo kiss, a practice in which two people rub noses,\" Sandy Shroyer-Beaver, the regional school board president, reportedly told Obama. \n\"Wow, it was cool. Let's do another,\" Obama said before repeating the show of affection. \nSee more photos of Obama cuddling with Feather below: MANDEL NGAN via Getty Images \nPresident Barack Obama holds a puppy while visiting musher John Baker and his family in Kotzebue, Alaska, on Wednesday. MANDEL NGAN via Getty Images \nObama reaches out to pick up a puppy belonging to musher John Baker (second from right) in Kotzebue, Alaska. MANDEL NGAN via Getty Images \nObama blazed a new trail as president on Wednesday, becoming the first to head above the Arctic Circle, urging U.S. citizens to take swift action against climate change. MANDEL NGAN via Getty Images \nObama snuggles with a puppy. MANDEL NGAN via Getty Images \nObama talks with 2011 Iditarod champion John Baker (right) and his family in Kotzebue, Alaska, on Wednesday. MANDEL NGAN via Getty Images \nObama holds a puppy while posing for a photo with musher John Baker (left) and a family member in Kotzebue, Alaska. ", "external_links": [], "published": "2015-09-03T20:41:00.000+03:00", "crawled": "2015-09-03T20:41:18.544+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}