{"organizations": ["Democratic House", "Obama White House", "Republican", "Treasury", "Congress", "House Democrats", "Congressional Democratic", "House Democratic Caucus", "Senate", "Department of Energy", "GOP", "Senate Foreign Relations Committee", "White House", "House", "Senate Democrats", "Democratic"], "uuid": "e17a57ffcf11a795f4d1341ba4ee8cb037b771fd", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/11/politics/obama-congress-democrats-iran-nuclear-deal/index.html", "country": "", "title": "How Obama kept Democrats from killing the Iran deal - CNNPolitics.com", "performance_score": 6, "site": "cnn.com", "participants_count": 0, "title_full": "How Obama kept Democrats from killing the Iran deal - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T13:35:00.000+03:00", "replies_count": 0, "uuid": "e17a57ffcf11a795f4d1341ba4ee8cb037b771fd"}, "author": "", "url": "http://www.cnn.com/2015/09/11/politics/obama-congress-democrats-iran-nuclear-deal/index.html", "ord_in_thread": 0, "title": "How Obama kept Democrats from killing the Iran deal - CNNPolitics.com", "locations": ["California", "North Dakota", "Oregon", "Iran", "New York", "Washington", "Tennessee", "Michigan", "Florida", "New Orleans", "Napa Valley", "Montana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Debbie Wasserman Schultz", "Moniz", "Hill", "Chuck Schumer", "Joe Biden", "Barack Obama", "Kerry", "Ernest Moniz", "Maria Cantwell", "Nancy Pelosi", "John Kerry", "Obama", "Martha", "Dick Durbin", "Bob Corker", "Pelosi", "Heidi Heiktamp", "Reid", "Gary Peters", "Jack Lew", "Harry Reid", "Jon Tester"], "text": "World leaders react to the Iran Nuclear deal Story highlights The effort was one of the most aggressive lobbying drives ever to take shape between Congressional Democratic leaders and the Obama White House. Democrats succeeded largely because the lobbying effort to back the deal was far more targeted and relentless than the campaigns aimed at scuttling it. Washington (CNN) It was late July and nerves at the White House were high. Sen. Chuck Schumer, the New York Democrat, was widely expected to announce his opposition to the Iran deal -- and dozens of other House and Senate Democrats were threatening to revolt against the nuclear agreement and deliver President Barack Obama a devastating blow on the international stage. But weeks before it would become public, the White House won a critical assurance that would dramatically change the outlook in Congress: Sen. Harry Reid would support it. In a private call, the Senate Democratic leader secretly assured Secretary of State John Kerry that he would back the deal, though he would keep quiet about it publicly, Democratic sources said. He promised to help deliver critical information about which Democrats to target -- but Reid himself needed to let about a dozen friends, supporters and donors who were sharply critical of the deal know why he was backing it before his position became public. What ensued was perhaps the most aggressive and coordinated lobbying drive ever to take shape between congressional Democratic leaders and the Obama White House -- which have frequently been at odds over strategy and tactics. It was a strategy that focused exclusively on House and Senate Democrats, ignoring Republicans altogether. And it underscored how sensitive the deal was to a number of Democrats, who feared a sharp backlash from pro-Israel voters and their Republican foes. The Democrats succeeded largely because the lobbying effort to back the deal was far more targeted and relentless than the public push and advertising campaigns aimed at scuttling it, according to lawmakers in both parties. For a president often criticized for being detached from Congress, Obama aggressively used his bully pulpit to win over his party, contacting 125 Democratic House members and senators since July, many of them repeatedly, according to Democratic sources. READ: Senate Democrats protect Obama on Iran vote Tennessee Sen. Bob Corker, the GOP chairman of the Senate Foreign Relations Committee and an opponent of the deal, said his Democratic friends reported to him that the White House was \"breaking arms and legs\" to prevent Congress from voting down the deal. And it worked, culminating in a Thursday victory where Senate Democrats filibustered a resolution to reject the deal and House Democrats secured enough support to sustain a veto, handing Obama the most far-reaching international achievement of his presidency. To quell a Democratic uprising, the White House, Reid and House Minority Leader Nancy Pelosi traded key intelligence about uneasy Democrats, dispatching powerful Cabinet officials to lock down support. Over the August recess, Pelosi gave the White House 57 names of House Democrats who were wobbly on the Iran pact; Obama called all of them, including 30 calls to Democratic lawmakers in between rounds of golf during his Martha's Vineyard vacation, according to Democratic sources. Senate Minority Whip Dick Durbin called almost everyone in his 46-member caucus, interrupting a family vacation in Oregon to lobby skittish Democrats. On a jaunt to Florida last week where he talked about his presidential ambitions, Vice President Joe Biden made a side trip to help woo and eventually win over Florida Rep. Debbie Wasserman Schultz, an influential Jewish Democrat who was facing fierce protests, including from some activists who charged that she should \"go to the oven,\" a reference to the Holocaust. Senior administration officials made 250 calls to House members and senators, sources said. That includes Jack Lew, the Treasury secretary and an Orthodox Jew, who was dispatched to help alleviate concerns of Jewish lawmakers, and Kerry, a former senator who relied on his longstanding Hill connections to push his party to back the deal. Yet it was Ernest Moniz, the Department of Energy secretary and a nuclear physicist, who became the most prolific and effective surrogate, lawmakers said. Moniz headed to the Detroit area to win over Michigan Sen. Gary Peters this summer. After pro-Israel forces were ratcheting up opposition in Montana, Moniz laid out his views to a local newspaper to help ensure Sen. Jon Tester didn't defect. And he called into a North Dakota radio show to help give political cover to Heidi Heiktamp, the state's centrist Democratic senator. Moniz was so influential that the final Democrat who announced her support -- Washington Sen. Maria Cantwell -- waited to return to Washington to meet with him to let him reassure her about the capability of inspectors to continue to detect nuclear activity in the country. He told them all that the deal cut off Iran's pathways to building a nuclear bomb. Reid later privately mused about the possibility of nominating Moniz for the Nobel Peace Prize, according to an aide familiar with the matter. Numbers in Obama's favor What helped Obama and supporters was the fact that the congressional review law only required the White House to prevent a veto-proof, two-thirds majority from forming in each chamber. With 46 Senate Democrats and 188 House Democrats, that meant limiting defections to fewer than 13 in the Senate and 42 in the House. On Thursday, just four Democrats voted to break a filibuster in the Senate on a motion to disapprove of the Iran deal, keeping the accord alive, with Pelosi's office announcing it had enough support to sustain a potential veto. Given the more progressive bent in the House Democratic Caucus, the White House always viewed the House as its firewall -- and spent ample resources and time to ensure that the dam didn't break. Soon after the deal was announced in July, Pelosi announced her backing and worked furiously with the White House to keep Democrats in line. Through August, aides said, Pelosi was on the phone during trips across the country, including in Napa Valley, California, and New Orleans at an event recognizing the 10-year anniversary of Hurricane Katrina, speaking to every member of her caucus -- including some repeatedly. JUST WATCHED ", "external_links": [], "published": "2015-09-11T13:35:00.000+03:00", "crawled": "2015-09-11T13:36:37.237+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}