{"organizations": [], "uuid": "d1fcc626dad94511743e352262e9d0b88c95d8f8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/092115_def3_china_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/09/21/obama-under-pressure-to-get-tough-with-china-but-holding-back-during-state/", "country": "US", "title": "Obama under pressure to get tough with China, but holding back during state visit", "performance_score": 1, "site": "foxnews.com", "participants_count": 11, "title_full": "Obama under pressure to get tough with China, but holding back during state visit | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 10, "uuid": "1593436952be31076dd012d4987fd9136c94c6e2"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/09/21/obama-under-pressure-to-get-tough-with-china-but-holding-back-during-state/#post-0", "ord_in_thread": 0, "title": "Obama under pressure to get tough with China, but holding back during state visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com livefyre Email Print\nPresident Obama is coming under increasing pressure to get tough with China over cybersecurity and other issues ahead of President Xi Jinping’s state visit, even as the administration signals it prefers a carrot-and-stick approach.\nThe administration reportedly has been preparing sanctions against Chinese companies engaged in economic cyberespionage -- but plans to hold off on imposing them while President Xi visits Washington, in hopes of reaching a resolution.\nThe New York Times also reported Sunday that the two countries are negotiating an unprecedented arms control agreement for cyberspace which could be rolled out during Xi’s visit. But the agreement may be generally worded and avoid addressing China’s alleged cyber-espionage and theft.\nGordon Chang, author of “The Coming Collapse of China,” told Fox News that the U.S. holds the leverage to make demands of China and questioned the approach being taken.\n“We should be tougher with China in all phases of our relationship with Beijing, and the last thing we should be doing is legitimizing their rule with this state visit,” he said.\nWith the state visit expected to go forward, though, Chang suggested the Obama administration at least be mindful that the Chinese government wants to use images from the visit to impress the Chinese people back home. “There should be no state dinner, no 21-gun salute,” Chang said.\nThe most immediate question is when and whether the administration might proceed with sanctions.\nOn Capitol Hill, Rep. Joe Wilson, R-S.C., introduced a resolution on Friday – backed by Rep. Randy Forbes, R-Va. -- urging Obama to “apply punitive economic sanctions to Chinese businesses and state-owned enterprises as a result of documented Chinese cyberattacks against United States entities in order to punish and deter such actions and strengthen the United States cybersecurity.”\nBut the Washington Post reported that the administration agreed during a visit by Xi’s special envoy to hold off on economic sanctions. (The package under development reportedly would target Chinese companies accused of cybertheft against U.S. corporations.)\nSpeaking last week before the Business Roundtable, Obama signaled he is willing to impose those sanctions if necessary.\nIn some of his most direct comments to date on the matter, the president said cybersecurity would “probably be one of the biggest topics that I discuss with President Xi,” adding: “We are preparing a number of measures that will indicate to the Chinese that this is not just a matter of us being mildly upset, but is something that will put significant strains on the bilateral relationship if not resolved, and that we are prepared to some countervailing actions in order to get their attention.”\nObama, though, drew a distinction between China’s different types of cyber-activities. He said the U.S. understands “traditional intelligence-gathering functions that all states, including us, engage in,” but that is “fundamentally different from your government or its proxies engaging directly in industrial espionage and stealing trade secrets, stealing proprietary information from companies.”\nThat, Obama said, “we consider an act of aggression that has to stop.”\nHe said his hope is that the dispute “gets resolved” short of any “countervailing actions.”\nThe administration issued another warning Monday, with National Security Adviser Susan Rice saying in Washington that China's cyberespionage is putting \"enormous strain\" on relations between the two countries.\nThe Obama administration still has not publicly blamed China for the massive hack of federal government personnel data. Even if the U.S. were to do so, the administration could try to argue that falls under the type of “traditional intelligence-gathering” Obama referenced last week.\nThose breaches nevertheless could have serious implications. A private industry IT security firm told Fox News last week that personal data stolen over the span of several high-profile U.S. cyber breaches is being indexed by China's intelligence service into a massive Facebook-like network.\nAccording to CrowdStrike founder Dmitri Alperovitch, Chinese hackers are using information gained from the breaches of the U.S. Office of Personnel Management, as well as intrusions into the Anthem and CareFirst BlueCross BlueShield health insurance networks, to build a profile of federal employees. This information could be used as leverage.", "external_links": ["https://www.washingtonpost.com/world/national-security/the-us-will-not-impose-sanctions-on-chinese-companies-before-state-visit-by-president-xi-jinping/2015/09/14/98a447e6-5b25-11e5-b38e-06883aacba64_story.html", "http://www.nytimes.com/2015/09/20/world/asia/us-and-china-seek-arms-deal-for-cyberspace.html?partner=rss&emc=rss&_r=1"], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-21T22:08:08.068+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}