{"organizations": [], "uuid": "2d587dcb35ac80bc01248c5ed4456f367220f781", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/090815_otr_bolton_640.jpg", "site_section": "http://www.foxnews.com/ontherecord/", "section_title": "On the Record with Greta Van Susteren | Fox News", "url": "http://www.foxnews.com/transcript/2015/09/08/migration-crisis-in-europe-rooted-in-obama-failures/", "country": "US", "title": "Migration crisis in Europe rooted in Obama failures?", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Migration crisis in Europe rooted in Obama failures? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "2d587dcb35ac80bc01248c5ed4456f367220f781"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/09/08/migration-crisis-in-europe-rooted-in-obama-failures/", "ord_in_thread": 0, "title": "Migration crisis in Europe rooted in Obama failures?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 08, 2015 FoxNews.com livefyre Email Print\nThis is a rush transcript from \"On the Record,\" September 8, 2015. This copy may not be in its final form and may be updated.\nGRETA VAN SUSTEREN, FOX NEWS HOST: Now, many of those refugees fleeing from regions taken over from brutal ISIS militants. Former U.S. Ambassador to the United Nations John Bolton says the refugee problem can be traced back to the failure of American leaders to destroy ISIS.\nAmbassador Bolton, American Enterprise Institute Senior Fellow, joins us. Ambassador, why?\nJOHN BOLTON, FORMER U.S. AMBASSADOR TO THE U.N.: Well, what is the cause of these refugee flows? It began with the civil war in Syria, which we have not addressed adequately these last five years, and now exacerbated, by ISIS setting up a caliphate and committing arguably religious genocide against Christians, other Muslim sects. So the pressure here is -- the question is if you want to stop refugee flows, you have to address the cause. The cause is ISIS and for the last year and a half although our declared objective is to degrade and ultimately destroy ISIS, we have done next to nothing to accomplish that.\nVAN SUSTEREN: All right, where does Iran and President Assad of Syria play into this?\nBOLTON: Well, they are responsible for the conflict as it has been carried out over the last four years. There are a lot of responsible people. Let's be clear. And this may sound harsh, the refugees don't have a right to be in Hungary or Austria or anywhere else. They can't say I think I will live in Aspen.\nVAN SUSTEREN: No, but I have been in the refugee camps and I have been in the refugee camp in Iraq. These people are really desperate.\nBOLTON: The obligation.\n(CROSSTALK)\nVAN SUSTEREN: They are stateless and they're hungry.\n(CROSSTALK)\nVAN SUSTEREN: Stateless if they -- towns bombed out in Syria.\nBOLTON: It's not like this is the first time that this has ever happened. There have been refugee conventions for you believers in international law watching about how to handle this. And the responsibility falls on the country of first asylum. In this case we are looking at Turkey which was providing camp. It's the responsibility of the rest of us to give assistance to Turkey through the U.N. high commissioner for refugees.\nVAN SUSTEREN: Let's go back to the beginning. You were saying refugees once you have refugees. You say look at the root cause. We have let ISIS it's a fertile breeding ground for ISIS in Syria and Iraq.\nBOLTON: That's right. If ISIS weren't setting up a caliphate and persecuting those it disagrees with, the refugee problem would be more containable. But let's also be clear. Refugee doctrine, since World War II is that the first preference is repatriation of the refugees from conditions permit. And resettlement elsewhere is the second solution. What's happened is because of Germany's agreement to take 800,000 refugees, 1 percent of Germany's population, it's like a soda straw pulling these people out of the refugee camps in Turkey, which Turkey is facilitating by getting them into the...\nVAN SUSTEREN: That's sort of at the end of the line. At the beginning of the line is the fact that these people left because they have got a situation where Iran and Assad and ISIS have made the conditions unbearable. I mean absolutely unbearable.\nBOLTON: That's exactly right.\nVAN SUSTEREN: And certainly -- look, if we are going to be the exceptional nation, maybe we ought to show some sort of leadership. We can't solve these ourselves. But we probably could have had more leadership in this.\nBOLTON: It's a question of peace and security in the region. It's obviously not for the United States alone. Turkey, United States, Saudi, Egypt and others, we could do something about this along with the Kurds. We have done nothing. Let's be clear, we have turned our eyes away from Syria and Iraq or what used to be Syria and Iraq. We are doing nothing to stop ISIS achieve its objectives.\nVAN SUSTEREN: Ambassador Bolton, thank you, sir.\nBOLTON: Thank you.\non-the-record On the Record , hosted by Greta Van Susteren, airs on Weekdays at 7PM ET on Fox News Channel.\nMore on this show", "external_links": [], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-10T22:32:56.564+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}