{"organizations": [], "uuid": "5d6fdc37e9b5960ae769984e1ca0a581297b167e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/world/2015/09/28/everybody-late-for-un-chief-lunch-obama-putin-and-even-secretary-general/", "country": "US", "title": "Everybody's late for UN chief's lunch _ Obama, Putin and even the secretary-general", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Everybody's late for UN chief's lunch _ Obama, Putin and even the secretary-general | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "5d6fdc37e9b5960ae769984e1ca0a581297b167e"}, "author": "Associated Press", "url": "http://www.foxnews.com/world/2015/09/28/everybody-late-for-un-chief-lunch-obama-putin-and-even-secretary-general/", "ord_in_thread": 0, "title": "Everybody's late for UN chief's lunch _ Obama, Putin and even the secretary-general", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print UNITED NATIONS –   U.S. President Barack Obama glided into the secretary-general's lunch for world leaders more than 20 minute late, glad-handing presidents and potentates as he made his way to the head table. President Vladimir Putin arrived even later, while the U.N. chief was getting ready to make his toast, so the Russian leader walked quickly to his seat — a chair away from Obama.\nAs he sat down, Putin reached across an empty chair, where Ban would sit, to shake Obama's hand.\nThe lunch that Ban Ki-moon throws on the first day of the annual ministerial meeting of the General Assembly is the only social event that VIPs from all 193 U.N. member states usually attend, though there were more than a dozen empty seats after the first course.\nSome leaders had good excuses. They were delayed because of very long addresses to the assembly by the early speakers on Monday. Obama was the worst offender, speaking for 43 minutes — nearly three times the 15 minutes allotted to every country. The carefully timed U.N. schedule was pushed so badly out of shape that Qatar's Emir Tamim bin Hamad Al Thani came racing in late to take his seat at the head table because his speech was badly delayed.\nThe secretary-general was late, too. His one-on-one meetings were delayed. Some leaders, however, arrived early and many wandered around chatting. Some sat eating their salad — a smoked trout and cucumber timbale with pickled celery and \"hearts of fire.\" Early arrivals got to watch U.N. chefs in white hats walk around with plastic bottles squeezing a mango mustard emulsion on top.\nThe lunch took place in the newly renovated Delegates Lounge, where floor-to-ceiling blue curtains blocked the view of the East River, a security measure. The room was decorated with the flags of all member states and for the first time at a ministerial meeting of the General Assembly, the flags of the two non-member observer states, the Holy See and Palestine, were at the end of the line in front of the windows.\nWhen the secretary-general finally spoke, the leaders burst into laughter when he said: \"Only at the United Nations can Pope Francis and Shakira appear on the same stage within minutes of each other! I didn't know whether I should pray or dance.\" And there was applause after he said football great David Beckham and Hollywood star Michael Douglas were also at the U.N. and \"could make a blockbuster movie with a brilliant soundtrack. But they were here to make peace.\"\nThe leaders also applauded when Ban said \"only at the United Nations can so many world leaders, from so many different traditions, with so many different views, break bread together like this today.\"\nBan toasted the United Nations \"which in its 70th year is as vital and necessary as ever.\"\nObama clinked his glass with the secretary-general and several other leaders at the head table while standing — and with Putin when he sat down.\nThen, well after 2 p.m., waiters were finally able to serve the main course — caramelized beef short ribs with baby beets, Swiss chard and butternut squash puree, morel mushrooms and sauce bordelaise. A spiced wild berry compote followed for dessert, accompanied by a chocolate-covered strawberry.", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-29T04:24:55.481+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}