{"organizations": [], "uuid": "a9c04bf765cd2825fca6e3c878388541c1b359b3", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/us/", "section_title": "U.S. Latest &amp; Breaking News Headlines | U.S. | Fox News", "url": "http://www.foxnews.com/us/2015/09/01/study-marijuana-supplants-cigarettes-as-daily-habit-among-us-college-students/", "country": "US", "title": "Study: Marijuana supplants cigarettes as a daily habit among US college students", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Study: Marijuana supplants cigarettes as a daily habit among US college students | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "a9c04bf765cd2825fca6e3c878388541c1b359b3"}, "author": "Associated Press", "url": "http://www.foxnews.com/us/2015/09/01/study-marijuana-supplants-cigarettes-as-daily-habit-among-us-college-students/", "ord_in_thread": 0, "title": "Study: Marijuana supplants cigarettes as a daily habit among US college students", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 01, 2015 Associated Press Facebook 0 Twitter 0 Email Print More U.S. university students are making a habit of using marijuana, which has supplanted cigarettes as the smoke-able substance of choice among undergraduates who light up regularly, a study released Tuesday found.\nJust under 6 percent of the full-time students surveyed by University of Michigan researchers for the annual \"Monitoring the Future\" study reported using pot either every day or at least 20 times in the previous 30 days.\nBy contrast, 5 percent of respondents identified themselves as heavy cigarette smokers, a steep decline from the 19 percent who said they smoked daily in 1999.\nThe findings suggest that teenagers and young adults have absorbed public health warnings about the dangers of cigarettes but increasingly regard marijuana as benign or carrying few risks, lead investigator Lloyd Johnston said.\n\"It's clear that for the past seven or eight years there has been an increase in marijuana use among the nation's college students,\" Johnston said. \"And this largely parallels an increase we have been seeing among high school seniors.\"\nThe University of Michigan's Institute for Social Research has surveyed a nationally representative sample of full-time college students about their drug and alcohol use every year since 1980.\nThe percentage of daily and near-daily pot users from the 2014 survey was the highest ever recorded and marked the first time that regular weed consumption outpaced habitual cigarette use, the study states.\nTwenty-one percent of the college students surveyed said they had used marijuana at least once during the previous month, and 34 percent said they had used it in the past year.\nThe survey also showed that fewer students are abusing alcohol. Just 5 percent of respondents said they had engaged in extreme binge drinking — defined by the researchers as having had 15 or more drinks in a row at least once in the previous two weeks.\nThe number of students reporting they had used cocaine in the previous year increased from 2.7 percent in 2013 to 4.4 percent in 2014. Johnston called the increase statistically significant, but said it was too soon to know if the drug was actually making a comeback on college campuses.\nParents sending their children to college this fall can take comfort in another of the survey's findings, Johnston said: Half of the survey respondents said they had not used any illicit drugs in the past year.", "external_links": ["http://www.ap.org/"], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-01T17:22:34.248+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}