{"organizations": [], "uuid": "bac2cd3e35669fe03ab94d7e7ac3a8a072ffc016", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/abortion05112015getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/healthcare/253289-senate-eyeing-vote-on-20-week-abortion-ban", "country": "US", "title": "Senate eyeing vote on 20-week abortion ban", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate eyeing vote on 20-week abortion ban", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T23:33:00.000+03:00", "replies_count": 0, "uuid": "bac2cd3e35669fe03ab94d7e7ac3a8a072ffc016"}, "author": "Peter Sullivan", "url": "http://thehill.com/policy/healthcare/253289-senate-eyeing-vote-on-20-week-abortion-ban", "ord_in_thread": 0, "title": "Senate eyeing vote on 20-week abortion ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate eyeing vote on 20-week abortion ban Getty Images By Peter Sullivan - 09/10/15 04:33 PM EDT The Senate could vote this month on a bill that would ban abortions after 20 weeks of pregnancy, amid a continued firestorm over Planned Parenthood funding. \"There's going to be a number of things,” Senate Majority Whip John Cornyn (R-Texas) told reporters Thursday. “Senator McConnell's already talked about some pro-life legislation he'll be filing for cloture on at the end of next week.\" ADVERTISEMENT Asked whether the 20-week abortion ban would be moved, Cornyn said, \"That's certainly one of them, but it's not limited to that.” \"There's a plan we're working on and it's in progress,” he added. Don Stewart, a spokesman for Senate Majority Leader Mitch McConnell (R-Ky.), said McConnell has called for the vote to come sometime this fall but hasn’t announced a schedule beyond that. A vote this month on the 20-week abortion ban billcould help divert anti-abortion energy away from a riskier government funding fight over Planned Parenthood. McConnell has vowed he will avoid a government shutdown and said the conservative push to defund Planned Parenthood must wait until 2017 when a new president occupies the White House. The 20-week abortion ban bill has already passed the House. It was introduced in the Senate in June by Sen. Lindsey Graham (R-S.C.), a presidential candidate. The bill is not expected to reach the 60-vote threshold needed to move forward. “How many votes will it get, I don’t know,” Graham said when he introduced the bill. “Here’s what I will predict: Over time, we will win.” — Alexander Bolton contributed.", "external_links": [], "published": "2015-09-10T23:33:00.000+03:00", "crawled": "2015-09-11T00:08:17.058+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}