{"organizations": [], "uuid": "7228c68b2e26a9c03364aa83eb2fbc45691d200e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obama-reid_081515getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/national-security/253309-obama-hails-dem-filibuster-on-iran", "country": "US", "title": "Obama hails Dem filibuster on Iran", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama hails Dem filibuster on Iran", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T00:43:00.000+03:00", "replies_count": 0, "uuid": "7228c68b2e26a9c03364aa83eb2fbc45691d200e"}, "author": "Jordan Fabian", "url": "http://thehill.com/policy/national-security/253309-obama-hails-dem-filibuster-on-iran", "ord_in_thread": 0, "title": "Obama hails Dem filibuster on Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama hails Dem filibuster on Iran Getty Images By Jordan Fabian - 09/10/15 05:43 PM EDT \nPresident Obama on Thursday hailed Senate Democrats for blocking a resolution disapproving of the Iran nuclear deal, a major victory for the White House. \n“This vote is a victory for diplomacy, for American national security, and for the safety and security of the world,” Obama said in a statement. ADVERTISEMENT Opponents of the deal failed to muster the 60 votes necessary to move forward with the measure in a 58-42 vote. If the measure had been approved, it would have forced Obama to veto the measure to save the nuclear deal.\n“I am heartened that so many senators judged this deal on the merits, and am gratified by the strong support of lawmakers and citizens alike,” Obama said. “Going forward, we will turn to the critical work of implementing and verifying this deal so that Iran cannot pursue a nuclear weapon, while pursuing a foreign policy that leaves our country — and the world — a safer place.” \nA filibuster of a disapproval measure hardly seemed possible just a few months ago, when deal opponents expressed confidence they could wrangle 67 votes to override a presidential veto. \nWhite House spokesman Eric Schultz took to Twitter to shame journalists who made doom and gloom predictions about the vote earlier this summer. \nRepublicans, who unanimously opposed the agreement, are not giving up the fight. \nSenate GOP leaders said they would force Democrats to hold a vote on the Iran deal next week. And House Republicans are attempting a separate legislative maneuver that could open the door to a lawsuit against the administration. \nLawmakers face a Sept. 17 deadline to vote on the agreement before Obama can begin taking steps to lift sanctions on Iran, contingent on Tehran abiding by limits on its nuclear program. \nObama and his allies say the agreement, which curbs Iran's nuclear capabilities for at least 15 years, represents the best way to prevent it from obtaining a nuclear weapon without starting another war in the Middle East. \nRepublicans and some Democrats argue it does not permanently cut off Iran's path to a bomb and worry that its government could use billions of dollars from sanctions relief to fill the coffers of terrorist groups, further destabilizing the region.", "external_links": [], "published": "2015-09-11T00:43:00.000+03:00", "crawled": "2015-09-11T00:59:03.186+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}