{"organizations": ["Obama Getty"], "uuid": "49ecb181a1c64fac5ed2e7b95af1caf370f1a597", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/getty-2012-12-01-union_protest-1.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/regulation/labor/252232-enraging-industry-labor-board-asserts-its-power-under-obama", "country": "", "title": "Enraging industry, labor board asserts its power under Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Enraging industry, labor board asserts its power under Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T23:21:00.000+03:00", "replies_count": 0, "uuid": "49ecb181a1c64fac5ed2e7b95af1caf370f1a597"}, "author": "", "url": "http://thehill.com/regulation/labor/252232-enraging-industry-labor-board-asserts-its-power-under-obama", "ord_in_thread": 0, "title": "Enraging industry, labor board asserts its power under Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tim Devaney", "Obama"], "text": "Enraging industry, labor board asserts its power under Obama Getty Images By Tim Devaney - 08/29/15 03:54 PM EDT \nThe National Labor Relations Board (NLRB) has become a lightning rod for controversy under President Obama, with its aggressive actions fueling sustained warfare between business and labor. \nFrom the labor board’s bitter fight with Boeing, to the creation of new union election rules, the NLRB has repeatedly moved to the forefront of political debate, drawing in Congress, the White House and even the Supreme Court. ADVERTISEMENT The NLRB’s latest bombshell was dropped on Thursday, when the board determined the waste management agency Browning-Ferris should be considered a “joint employer” of temporary workers.\nThe decision expands the definition of what it means to be an employer in the United States, and could put companies on the hook for labor violations committed by business partners and contractors. \nBusiness groups condemned the decision, portraying it as the latest example of the NLRB blatantly favoring unions during Obama’s tenure. \n“I’m pretty much amazed when unions say the Obama administration hasn’t done very much for them,” Michael Lotito, an employment and labor attorney. “There’s perhaps no labor board that has done more for organized labor than this one has.” \nBeth Milito, senior legal counsel at the National Federation of Independent Business, said the labor board has “really put the wind back in the sails of unions.\" \nLabor unions say the actions taken by the NLRB — an independent agency — are long overdue, and have cheered the board every step of the way. \nHere’s a look at five of the biggest controversies involving the NLRB during Obama’s presidency. \nBoeing plant fight \nThe labor board plunged into a politically charged battle against the aerospace giant Boeing in April 2011. \nThe NLRB’s top lawyer at the time, Lafe Solomon, accused Boeing of retaliating against union workers for strikes by building a new airplane manufacturing plant in another state. \nBoeing continued building planes at its original plant in Washington state, but sent additional work to a new $750 million state-of-the-art facility in South Carolina. \nThe International Association of Machinists and Aerospace Workers, which represents more than 30,000 Boeing workers in Washington state, argued to the NLRB that all production should have stayed where it was. \nThe NLRB ultimately dropped the case after the union struck a deal with Boeing for higher wages and more jobs — but only after a wave of denunciations from business groups and congressional Republicans. \n“Any notion of objectivity these guys may have had went bye bye a long time ago,” said Joe Trauger, vice president of human resources at the National Association of Manufacturers. \n“The Boeing complaint was a clear indication of exactly what direction the board was going to head,” Trauger said. “It was a turning point for a lot of folks in the business community to see exactly how radical the board was going to be.” \nUnion election rule \nAfter the Boeing scuffle, the NLRB wasted little time in turning to an equally controversial union election policy. \nThe labor board in June 2011 moved to speed up the process by which employees can organize by bringing up an election rule that was years in the making. \nCritics labeled it the “ambush election rule,” arguing it does not give companies enough time to prepare for union ballots. Labor unions said the rule was an important step toward preventing management from delaying union votes. \n“Too often, lengthy and unnecessary litigation over minor issues bogs down the election process and prevents workers from getting the vote they want,” AFL-CIO President Richard Trumka said in a statement when the rule was issued in December 2014. “We commend the NLRB’s efforts to streamline the process and reduce unnecessary delay.\" \nThe union election rule was overturned in federal court a year later — but the fight was far from over. \nThe NLRB retooled and reintroduced the rule in 2014. The second version of the rule has so far survived numerous legal challenges and repeal attempts from Congress. \nSpecialty healthcare \nThe NLRB paved the way for multiple “micro-unions\" to organize within a single workplace with its Specialty Healthcare decision in August 2011. \nSpecialty Healthcare and Rehabilitation Center is a nursing home company in Mobile, Ala. It had refused to recognize a small group of certified nursing assistants who tried to organize a union because they didn’t represent all of the company’s employees. \nThe labor board’s decision allowed different departments within a single company to organize their own unions. It has since been applied at other companies, including Macy’s. \nWorkplace posters \nThe NLRB also pushed a rule that would have required employers to hang posters in the workplace reminding employees of their right to organize a union. \nThe U.S. Chamber of Commerce, the National Association of Manufacturers and the National Federation of Independent Business challenged the rule in court as a violation of the First Amendment rights of employers. \nA federal appeals court struck down the rule in May 2013, and the NLRB decided not to appeal to the Supreme Court, leaving the rule on ice. \nRecess appointments \nPerhaps the biggest controversy involving the NLRB came when Obama installed three members on the labor board in January 2012 on the grounds that Congress was in recess. \nRepublicans had been holding informal, pro forma sessions to prevent recess appointments the NLRB, as the positions otherwise require Senate confirmation. \nSenate Republicans were outraged that President Obama bypassed them to shift the balance of power at the NLRB by appointing two more Democrats and a Republican. \nThe Supreme Court later found that President Obama’s recess appointments were unconstitutional because the Senate was not in recess at the time, as the White House had claimed. \nThe high court's ruling has forced the NLRB to reconsider hundreds of decisions it had issued with invalid board members. Tags: ", "external_links": [], "published": "2015-08-29T23:21:00.000+03:00", "crawled": "2015-08-29T23:21:31.536+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}