{"organizations": ["Democratic National Committee", "Facebook", "Twitter"], "uuid": "1958ec4ccbca8cba721dbf7c4c7703c146ce430b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/Obama_Cham(16)640360.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/28/obama-says-religious-freedom-no-reason-to-deny-gay-couples-right-to-marry/", "country": "", "title": "Obama says religious freedom no reason to deny gay couples right to marry | Fox News", "performance_score": 6, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama says religious freedom no reason to deny gay couples right to marry | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T07:12:00.000+03:00", "replies_count": 0, "uuid": "1958ec4ccbca8cba721dbf7c4c7703c146ce430b"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/28/obama-says-religious-freedom-no-reason-to-deny-gay-couples-right-to-marry/", "ord_in_thread": 0, "title": "Obama says religious freedom no reason to deny gay couples right to marry | Fox News", "locations": ["New York", "Gotham Hall"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Harnik", "Obama"], "text": "Obama says religious freedom no reason to deny gay couples right to marry Published September 28, 2015 Facebook 0 Twitter 0 Email Print Sept. 27, 2015: President Barack Obama greets members of the crowd after speaking at a Democratic National Committee LGBT fundraising gala at Gotham Hall in New York. (AP Photo/Andrew Harnik) \nNEW YORK – Freedom of religion isn't reason enough to deny any American their constitutional rights, President Barack Obama said Sunday as he addressed members of the LGBT community, one of his major sources of political and financial support. \nSpeaking at a Democratic Party fundraiser, Obama said it's important to recognize that some parts of the country remain uncomfortable with same-sex marriage and that it will take time for them to catch up to the majority of Americans who support such unions. \nBut while Americans hold dear the constitutional right to practice their religion free from government interference, he said that right can't be used to deny constitutional rights to others. \n\"We affirm that we cherish our religious freedom and are profoundly respectful of religious traditions,\" Obama said during remarks that were interrupted by repeated applause and cheers. \"But we also have to say clearly that our religious freedom doesn't grant us the freedom to deny our fellow Americans their constitutional rights.\" \nEarlier this month, Kentucky county clerk Kim Davis spent several days in jail for refusing to issue marriage licenses to gay couples despite a Supreme Court ruling that made same-sex unions legal nationwide. Davis said such marriages violate her Apostolic Christian faith. \nSince being released, the Rowan County clerk has allowed marriage licenses to be issued, but only without her name and title. She also announced that she has left the Democratic Party and become a Republican. \nJim Obergefell, the plaintiff in Obergefell v. Hodges, the legal case that led the Supreme Court in June to rule narrowly in favor of gay marriage, introduced Obama. \nThe president began by recalling for his supporters that \"seven years ago, we came together not just to elect a president, but to reaffirm our faith in that most American of ideals: the notion that people, no matter where they come from ... or who they love can change this country.\" \nHe noted that everyone in the U.S., regardless of sexual orientation, is protected by a federal hate crimes law he signed in his first year as president, and that federal contractors are barred from terminating employees for being gay. \nObama got some of his biggest cheers and loudest applause when he said \"we live in an America where 'don't ask, don't tell' is something that 'don't exist.'\" Obama lifted the Pentagon policy that barred gays and lesbians from serving openly in the military. \n\"And tonight, thanks to the unbending sense of justice passed down through generations of citizens who never gave up hope that we could bring this country closer to our founding ideals ... we now live in America where our marriages are equal as well,\" he said. Advertisement ", "external_links": [], "published": "2015-09-28T07:12:00.000+03:00", "crawled": "2015-09-28T07:13:05.410+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}