{"organizations": [], "uuid": "14cd1255ebdbf60e7da5589a6080497f703b2f8a", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/rubio-insta-obama-no-abstenerse-en-el-voto-sobre-el-embargo-cuba-en-onu/", "country": "", "title": "Rubio insta a Obama a no abstenerse en el voto sobre el embargo a Cuba en ONU | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Rubio insta a Obama a no abstenerse en el voto sobre el embargo a Cuba en ONU | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "14cd1255ebdbf60e7da5589a6080497f703b2f8a"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/rubio-insta-obama-no-abstenerse-en-el-voto-sobre-el-embargo-cuba-en-onu/", "ord_in_thread": 0, "title": "Rubio insta a Obama a no abstenerse en el voto sobre el embargo a Cuba en ONU | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Rubio insta a Obama a no abstenerse en el voto sobre el embargo a Cuba en ONU Published September 29, 2015 EFE \nWashington, 29 sep (EFEUSA).- El senador y precandidato republicano a la Presidencia Marco Rubio pidió hoy al presidente, Barack Obama, que vote en contra del fin del embargo económico a Cuba en la Asamblea General de Naciones Unidas. \nRubio, firme opositor al régimen castrista, envió una carta al mandatario ante los rumores vertidos en la prensa sobre la posibilidad de que Estados Unidos se abstenga por primera vez en dicha votación, en la que históricamente ha votado en contra, dado el restablecimiento de relaciones entre Washington y La Habana. \n\"Independientemente de sus creencias, el embargo de EEUU a Cuba está tipificado en la ley de Estados Unidos y las razones por las que se impuso, incluyendo el robo de miles de millones de dólares de la propiedad privada del Gobierno cubano, siguen sin ser resueltas por La Habana\", apunta el senador, de origen cubano, en su misiva. \nRubio, quien ha repuntado en las encuestas a las primarias del Partido Republicano para ser el candidato presidencial de los conservadores en 2016, insiste a Obama en que debe dejar a un lado la idea de abstenerse en la votación. \n\"Cualquier desacuerdo sobre esta ley, que regula las transacciones de estadounidenses, debe ser debatido en el Congreso de Estados Unidos, no en la Asamblea General de Naciones Unidas\", agregó el senador. \nRubio, que preside el Subcomité de Relaciones Exteriores del Senado para Latinoamérica, Crimen Trasnacional, Seguridad Civil, Democracia, Derechos Humanos y Asuntos Mundiales de la Mujer, es quien suele presidir las audiencias legislativas en la Cámara Alta que atañen a la isla. \nEn la carta, el senador consideró que sería \"un fracaso\" de la Administración estadounidense no defender las leyes vigentes durante la Asamblea General de la ONU y reitera que la abstención \"enviaría un mensaje peligroso a los tiranos de todo el mundo\". \nPrecisamente hoy, Obama se reunió en el marco de la Asamblea con su homólogo cubano, Raúl Castro, quien le instó a que utilice sus facultades ejecutivas para debilitar el embargo contra la isla si quiere seguir avanzando en el proceso de normalización de relaciones. \nAsí lo explicó el canciller cubano, Bruno Rodríguez, tras el encuentro que mantuvieron los dos presidentes en la sede de las Naciones Unidas, una cita en la que Castro dijo que los avances hacia la normalización dependerán de lo que ocurra con el embargo. \n\"No habrá normalización con bloqueo, y no habrá progreso sustancial en el proceso de normalización sin cambios sustanciales en la aplicación del bloqueo\", afirmó Rodríguez, quien destacó que las decisiones ejecutivas tomadas hasta ahora por Obama \"son de valor muy limitado\". \nEn la reunión general de la ONU del año pasado, 188 países miembros votaron a favor de retirar el embargo a la isla, por dos votos en contra, Estados Unidos e Israel. EFEUSA ", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T12:00:46.988+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}