{"organizations": [], "uuid": "3a601bd9f7f8c3d4400b1c6a1e4b43230a7ce374", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/jill_biden%20joe%20biden.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/253137-obama-teams-up-with-jill-biden-on-community-college-plan", "country": "US", "title": "Obama teams up with Jill Biden on community college plan", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama teams up with Jill Biden on community college plan", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T00:26:00.000+03:00", "replies_count": 0, "uuid": "3a601bd9f7f8c3d4400b1c6a1e4b43230a7ce374"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/253137-obama-teams-up-with-jill-biden-on-community-college-plan", "ord_in_thread": 0, "title": "Obama teams up with Jill Biden on community college plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama teams up with Jill Biden on community college plan By Jordan Fabian - 09/09/15 05:26 PM EDT President Obama joined forces with Dr. Jill Biden in Michigan on Wednesday to boost his free community college initiative, but the 2016 campaign also loomed large over the trip. The trip doubled as a chance for Biden to step back into the public eye as her husband, Vice President Joe Biden, considers jumping into the presidential race. Biden’s appearance with Obama was one of her first public appearances since the vice president has consulted with family, aides and allies about challenging Hillary Clinton for the Democratic presidential nomination. Biden, a community college professor, shared her teaching bonafides while warming up the crowd of 1,000 at Macomb Community College in Warren, Mich., telling students she was grading papers aboard Air Force One on the way there. But during her introduction, she flubbed the pronunciation of “Macomb” and had to be corrected members of the audience. “You’re correcting the teacher,” she joked. Obama heaped praise on Biden, and added that “her husband's not so bad either.” “He's OK. Love Joe Biden,” Obama said. Obama and Biden left presidential politics aside in their remarks, focusing on the administration’s effort to provide two free years of community college tuition. The president tapped Biden to lead a College Promise Advisory Board, which is tasked with pushing states and cities to provide high school students with a free community college education. “There is a movement going here, free community college for responsible students,” Obama said. “It’s an idea that makes sense.” The president dinged congressional Republicans for objecting to his $60 billion community college, which they say is too expensive. And he also touted a new $175 million effort on apprenticeships program to help grow a skilled workforce and expand the middle-class. “Companies making record profits aren’t sharing enough of those profits with the workers and that’s a problem,” Obama said. “But a big part of making sure the economy is working for regular folks is this issue of education.” “No kid should be priced out of a college education,” he added. Jill Biden has mostly stayed out of the spotlight as her husband has weighed a presidential run. Much of the speculation about Biden’s decision making process has centered around her and the Biden family. She is said to be hesitant about a presidential campaign, wary of the emotional toll it could take while the family grieves the loss of Biden’s son Beau to brain cancer in May. The vice president has not been shy about sharing those deliberations during his recent road trip. In a speech at an Atlanta synagogue last week, he spoke about the burden a campaign could place on his family. “The factor is, can I do it? Can my family undertake what is an arduous commitment that would be proud to undertake under ordinary circumstances. But the honest to God answer is I just don’t know,” said Bi", "external_links": [], "published": "2015-09-10T00:26:00.000+03:00", "crawled": "2015-09-10T00:34:28.875+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}