{"organizations": [], "uuid": "e9f1e76c41ad765e9a02bf3077145c064272f743", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/5605dd2b1900003000fde76a.jpeg", "site_section": "http://www.huffingtonpost.com/tag/style/feed", "section_title": "Style on Huffington Post", "url": "http://www.huffingtonpost.com/entry/obamas-xi-jinping-state-dinner_5605dc7ce4b0768126fdb1fd", "country": "US", "title": "Obamas Welcome Chinese President And His Wife At State Dinner", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obamas Welcome Chinese President And His Wife At State Dinner", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T22:52:00.000+03:00", "replies_count": 0, "uuid": "e9f1e76c41ad765e9a02bf3077145c064272f743"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/obamas-xi-jinping-state-dinner_5605dc7ce4b0768126fdb1fd", "ord_in_thread": 0, "title": "Obamas Welcome Chinese President And His Wife At State Dinner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obamas Welcome Chinese President And His Wife At State Dinner By Nancy Benac and Darlene Superville Posted: 09/25/2015 07:52 PM EDT | Edited: 2 minutes ago Chip Somodevilla via Getty Images \nWASHINGTON (AP) — A powerhouse lineup mixing Hollywood, diplomacy and corporate America streamed into the White House for President Barack Obama's lavish state dinner for Chinese President Xi Jinping. \nFrom \"Empire\" creator Lee Daniels to Disney CEO Bob Iger, from diplo-eminence Henry Kissinger to uber-philanthropist David Rubenstein, the attendees represented the Obamas' effort to bring together an A-team of luminaries for Xi at the culminating event of Friday's daylong state visit. \nOthers making the cut included ballerina Misty Copeland, Apple CEO Tim Cook and Facebook creator Mark Zuckerberg. \nFirst through the receiving line was former Labor Secretary Elaine Chao. Faced with the fashion-forward question \"What are you wearing?\" Chao seemed momentarily stumped. \"Oh my gosh,\" she stammered. \"It's something very inexpensive.\" \nFirst lady Michelle Obama wore a black, off-the-shoulder mermaid gown created by Chinese-American designer Vera Wang. Chip Somodevilla via Getty Images \nAsked whether the night was about business or fun, Katzenberg declared, \"Fun — I hope.\" \nAfter a tense day of meetings, there's nothing like unwinding over a good meal — even if it's for a black-tie cast of 200 or so. \nThat's what White House party planners had in mind for Obama and Xi: The decor for the big East Room spread included a 16-foot silk scroll depicting two roses that the White House says are meant to symbolize \"a complete meeting of the minds.\" \nThat may have been somewhat aspirational, given the sharp differences between the U.S. and China on a range of issues. \nFor guests lucky enough to be invited to such an opulent and exclusive East Room event, though, policy clashes may well be beside the point. They're there for fine food (Colorado lamb and Maine lobster), good entertainment (R&B singer Ne-Yo), and a chance to soak in the best the White House has to offer. \nCook, Iger, Rubenstein, Katzenberg and Zuckerberg were seated at the head table with Obama and Xi. \nDaniels brought his mom, Clara Daniels, as his date. \nHe'd been invited to past dinner but could never make it due to work, but he was determined to get here this time. He told ABC's \"The View\" earlier this week that his mom's \"done told the church. She's done told everybody. She's my date. So I cannot not go.\" Chip Somodevilla via Getty Images \nAsian influences permeated the dinner plans, down to the Meyer lemons in the kurd lychee sorbet. (The citrus fruit is thought to have originated in China.) \nGuest chef Anita Lo, owner of Annisa in New York and a past \"Top Chef\" competitor, is a first-generation Chinese-American from Birmingham, Michigan. The culinary team prepared a menu that highlights \"American cuisine with nuances of Chinese flavor,\" according to the White House. Guests will sup on wild mushroom soup, poached Maine lobster, grilled cannon of Colorado lamb and poppyseed bread and butter pudding. \nThe entertainment, too, had an Asian influence: Grammy Award-winning singer and actor Ne-Yo, who was born in Arkansas, says his father is part Chinese. \nThe dinner marked the midpoint of a daunting trifecta for the White House social team. Earlier in the week, it played host to Pope Francis and, next, the team pivots to events the Obamas will host next week in New York, where the president will attend the U.N. General Assembly. \nNew social secretary Deesha Dyer sent an afternoon note ticking off all the last-minute tasks that were keeping her team busy — from the seating chart to flower arrangements — and promised photos on the White House blog as the dinner plays out. \n\"Stay tuned (and wish us luck),\" she wrote. \nThe president's decision to give Xi the full-on pomp of a state dinner rankled some critics, including several GOP presidential candidates who said the Chinese were undeserving of such special treatment given recent behavior. \nBut Dan Kritenbrink, the National Security Council's senior director for Asian affairs, called it \"smart diplomacy\" for the U.S. to reciprocate the hospitality that the Chinese have shown to the Obamas.", "external_links": [], "published": "2015-09-25T22:52:00.000+03:00", "crawled": "2015-09-26T03:57:24.251+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}