{"organizations": [], "uuid": "d31b1b7239b79f2825777a461970739029d8b921", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/outdoors_canyon_park_041514thinkstock.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/252436-obama-asks-congress-to-mark-national-park-service-centennial", "country": "US", "title": "Obama asks Congress to mark National Park Service centennial", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama asks Congress to mark National Park Service centennial", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T22:05:00.000+03:00", "replies_count": 0, "uuid": "d31b1b7239b79f2825777a461970739029d8b921"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/252436-obama-asks-congress-to-mark-national-park-service-centennial", "ord_in_thread": 0, "title": "Obama asks Congress to mark National Park Service centennial", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama asks Congress to mark National Park Service centennial Thinkstock By Devin Henry - 09/01/15 03:05 PM EDT \nThe Obama administration is pushing Congress to pass a bill recognizing the 100th anniversary of the National Parks Service (NPS) next year. \nObama will ask Congress to fund infrastructure improvements at NPS facilities and establish an endowment fund for future upgrades and projects at the parks. ADVERTISEMENT The bill, which Obama will formally announce and send to Congress after he visits a national park in Alaska on Tuesday, would look to increase funding for an NPS volunteer program and expand eligibility for a fund that hires young workers. \nIt would also strengthen education programs at parks and allow the NPS to provide new services for visitors, such as lodging and dining, according to the Interior Department. \nThe National Parks Service will mark its centennial next August, and administration officials say Congress should pass legislation expanding and improving the NPS to mark the occasion. \n“This proposal acknowledges the important place our national parks have in the hearts and minds of all Americans,” Interior Secretary Sally Jewell said in a statement. \n“This administration and this Congress have the unique opportunity to shape the second century of the National Park Service as they preserve the legacy of some of our nation’s greatest treasures for generations to come.” \nA White House announcement about the bill said it would “ensure that our national parks, facilities, and educational programs are of the highest quality” as the NPS hits the 100-year mark next year. \n“If enacted, the ‘National Park Service Centennial Act’ would support these goals and establish, clarify, or expand a number of key authorities to enable NPS to better serve the American people,” the announcement said. \n“The act will also promote volunteerism and help connect the next generation to the outdoors.” \nObama is visiting Kenai Fjords National Park near Seward, Alaska, on Tuesday. He’ll take a boat tour of the park, according to the White House, after he hikes to a glacier in the area. \nThe Interior Department also announced a program Tuesday that will provide free admission to national parks, forests, monuments and wildlife refuges for every American fourth-grader and his or her family. \n“We want to make sure that every American has the opportunity to develop a lifelong connection to our nation’s land, water and wildlife,” Jewell said. Tags:", "external_links": [], "published": "2015-09-01T22:05:00.000+03:00", "crawled": "2015-09-01T22:54:13.493+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}