{"organizations": [], "uuid": "f53cafbb525b056191297c5df230f84719bc2a60", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150928132530-putin-unga-speech-sot-00010212-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_europe.rss", "section_title": "CNN.com - Europe", "url": "http://edition.cnn.com/2015/09/28/politics/obama-putin-meeting-syria-ukraine/index.html", "country": "US", "title": "Tension clouds Obama, Putin meeting - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Tension clouds Obama, Putin meeting - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T13:31:00.000+03:00", "replies_count": 0, "uuid": "f53cafbb525b056191297c5df230f84719bc2a60"}, "author": "Kevin Liptak", "url": "http://edition.cnn.com/2015/09/28/politics/obama-putin-meeting-syria-ukraine/index.html", "ord_in_thread": 0, "title": "Tension clouds Obama, Putin meeting - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Days ahead of their meeting, Obama and Putin's respective capitals were already exchanging barbs The face-to-face meeting is the first time the two leaders have met for substantive talks since Russia's incursion into Ukraine United Nations (CNN) Expecting to face calculated detachment and an unshakable attitude, U.S. President Barack Obama emerged from his highly anticipated meeting with Vladimir Putin Monday with new insight into the Russian president's thinking on Syria.\nThe two presidents huddled in a second floor conference room at United Nations headquarters for roughly 90 minutes, squaring off on the contentious issues of Ukraine and Syria and seeking to discern each others' strategies after a two-year freeze in face-to-face encounters.\nAhead of the meeting, Obama's aides had modest expectations for results, saying they were looking for a candid conversation on Ukraine and greater clarity on why Russia is ramping up its military presence in Ukraine.\nThose goals, U.S. officials said, appeared to have been reached.\n\"We have clarity on their objectives,\" one senior administration official said. \"Their objectives are to go after ISIL and to support the government.\"\nIt's Russia's support for Syria's government, run by President Bashar al-Assad, that divides Obama and Putin. Officials say while the two men agreed to maintain military-to-military communication to avoid conflicts in the region, they failed to agree on what a peaceful solution to Syria's civil war might look like.\nREAD: Obama hits Putin, Republicans in U.N. speech\n\"I think the Russians certainly understood the importance of there being a political resolution in Syria and there being a process that pursues a political resolution,\" an official said. \"We have a difference about what the outcome of that process would be.\"\nDuring a photo-op at the beginning of the session, the two men gripped each others' hands, smiling tightly as cameras clicked away, before quickly disappearing behind closed doors.\nAfter the meeting concluded, senior U.S. officials said half the meeting centered on Ukraine, while the remainder focused on Syria.\nOn neither crisis did the men come to an agreement, though few expected anything close to consensus on two areas where the U.S. and Russia are so deeply at odds.\nBut contrary to early projections of a testosterone-fueled bickering match, a senior administration official said the meeting was productive and focused.\n\"This was not a situation where either one of them was seeking to score points in a meeting,\" said the official, speaking anonymously to describe a private meeting. \"I think there was a shared desire to figure out a way in which we can address the situation in Syria.\"\nDays ahead of their arrival in New York for the major United Nations session, Obama and Putin's respective capitals were already exchanging barbs over the nature of the talks, their agenda and who had initially requested they happen.\nThe White House suggested last week that Putin was \"desperate\" for the ear of the American president and had been nudging the White House for a slot in Obama's schedule for weeks.\nObama to Putin: 'Cheers' Moscow, meanwhile, insisted the meeting came at the request of the Americans -- who they claimed provided a list of possible dates.\nSo, too, was the meeting's agenda under dispute. Obama's aides asserted the focal point was Ukraine, and the entrenched Russian fighters on the country's eastern border. A secondary topic, they said, was the recent buildup of Russian troops and equipment in Syria.\nThe Kremlin argued the opposite: Syria would lead the meeting, claimed a spokesman for Putin. A discussion on Ukraine -- where the U.S. claims Russia violated international law -- would come only \"if there is enough time.\"\nThe face-to-face meeting is the first time the two leaders have met since Russia's incursion into Ukraine aside from brief encounters on the sidelines of global summits in France and Australia. Obama, responding to the Ukraine crisis, has sought to isolate Putin, ousting him from the Group of Eight leading industrial nations and enlisting European countries to join in economic sanctions.\nBut even the White House admits the sanctions -- while exacting a significant toll on the Russian economy -- have done little to stop or reverse Putin's actions in Crimea, which he still controls.\nThe intractable situation left the Obama administration divided on whether engaging Putin after two years was a wise move. Secretary of State John Kerry was said to have pushed Obama to accept the meeting, arguing that skipping the talks could result in a missed opportunity.\n\"It would be irresponsible to not have a face-to-face encounter and to not directly address with President Putin our positions and concerns on these two issues,\" Ben Rhodes, Obama's deputy national security adviser, said last week.\nWhile U.S. officials say they entered the meeting with Putin open-minded, there was little optimism the session would produce anything remotely close to a breakthrough.\nMore likely, predicted White House press secretary Josh Earnest, would be another view of Putin's practiced disinterest when meeting with foreign leaders, citing his \"now familiar pose of less-than-perfect posture and unbuttoned jacket, and knees spread far apart, to convey a particular image.\"\nThat image was avoided Monday: with cameras present, there were no chairs for slouching down in sight.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150928153854-barack-obama-vladimir-putin-toast-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150928153854-barack-obama-vladimir-putin-toast-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150928153854-barack-obama-vladimir-putin-toast-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150928153854-barack-obama-vladimir-putin-toast-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150928153854-barack-obama-vladimir-putin-toast-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150928153854-barack-obama-vladimir-putin-toast-small-169.jpg", "https://twitter.com/CNNpolitics", "http://i2.cdn.turner.com/cnnnext/dam/assets/150928153854-barack-obama-vladimir-putin-toast-large-169.jpg"], "published": "2015-09-29T13:31:00.000+03:00", "crawled": "2015-09-29T09:45:59.919+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}