{"organizations": [], "uuid": "6cfa07ff667f33c32c5e26257dcf2fc2384d53ba", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/APTOPIX%20Obama%20Nevada_Cham64036009.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,0,00.rss", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/08/25/obama-renews-attack-on-fossil-fuels-koch-brothers-at-nevada-clean-energy-event/", "country": "US", "title": "Obama renews attack on fossil fuels, Koch brothers at Nevada clean energy event News", "performance_score": 4, "site": "foxnews.com", "participants_count": 7, "title_full": "Obama renews attack on fossil fuels, Koch brothers at Nevada clean energy event | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 6, "uuid": "fc38e9411528349be1f6a1854d674365201ab1c7"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/08/25/obama-renews-attack-on-fossil-fuels-koch-brothers-at-nevada-clean-energy-event/#post-0", "ord_in_thread": 0, "title": "Obama renews attack on fossil fuels, Koch brothers at Nevada clean energy event News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 25, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print Aug. 24, 2015: President Barack Obama, left, and Senate Minority Leader Sen. Harry Reid wave onstage at the National Clean Energy Summit in Las Vegas. (AP Photo/John Locher) \nPresident Obama accused critics of his energy policies of trying to restrict consumers from accessing solar power, wind power and other alternative energy sources at a green energy conference in Las Vegas Monday night.\nThe president specifically singled out billionaire brothers Charles and David Koch, who are major donors to Republican political candidates. He accused them, along with \"big fossil fuel interests\" and \"conservative think tanks\", of ideological inconsistency, saying that they champion free market solutions except when the free market boosts renewable energy.\n\"It's one thing if you're consistent in being free market,\" Obama said. \"It's another thing when you're free market until it's solar that's working and people want to buy and suddenly you're not for it anymore. That's a problem.\"\nThe annual energy conference was hosted by Senate Minority Leader Harry Reid, D-Nev., who  frequently targets the Koch brothers. Reid's speeches depict them as self-serving oil barons who pay huge sums to try to buy elections and advance their agenda of low taxes and less regulation at the expense of average Americans.\nObama used his appearance to announce new executive actions and other efforts aimed at making it easier for homeowners and businesses to invest in green energy.\nThe moves, which include expanding the use of energy improvement loans, are designed to build on the clean power plant rules that the president announced earlier this month to cut carbon dioxide emissions from coal-fired power plants by a third. They all feed into Obama's goal of cutting overall U.S. emissions by 26 percent to 28 percent over the next decade to combat climate change and encourage other countries to do likewise. Several states have already challenged the plan in federal court.\nAhead of Obama's remarks, Housing Secretary Julian Castro said the plan \"hits the sweet spot\" by making clean energy more affordable for people and protecting the environment. He said people too often have been \"priced out\" of clean-energy options.\nHowever, Utah Republican Rep. Rob Bishop, chair of the House Committee on Natural Resources, said Obama's policies were leveling \"increased costs and decreased choices on all Americans and especially the most disadvantaged communities.\"\nThe Heartland Institute, a conservative think tank funded in part by the Koch brothers, was among groups co-sponsoring a simultaneous \"affordable energy summit\" in Las Vegas as a counterpoint to Reid's gathering. The organization maintains that Obama's policies promote wind and solar power at the expense of conventional energy and \"will inevitably cause skyrocketing electricity prices while providing little if any net environmental benefits,\" according to the summit's website.\nThe Associated Press contributed to this report.", "external_links": [], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-25T10:13:35.608+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}