{"organizations": [], "uuid": "356bd03d5f6ae3bcfda2e1f1871dda0c52228ab8", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/09/21/jeb-bush-defends-comprehensive-immigration-reform/", "country": "IL", "title": "Jeb Bush defends comprehensive immigration reform", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Jeb Bush defends comprehensive immigration reform | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "356bd03d5f6ae3bcfda2e1f1871dda0c52228ab8"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2015/09/21/jeb-bush-defends-comprehensive-immigration-reform/", "ord_in_thread": 0, "title": "Jeb Bush defends comprehensive immigration reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  EFE Republican presidential hopeful Jeb Bush on Monday praised the contribution of Hispanics to the U.S. economy and set himself apart from his GOP rivals by coming out in favor of immigration reform that includes a path to citizenship.\n\"Here's what I believe. I believe we need immigration reform. I've been clear about this. I believe that DREAM Act kids should have a path to citizenship,\" the former Florida governor told pro-immigration reform protesters who interrupted him during his address before the U.S. Hispanic Chamber of Commerce conference in Houston.\n\"I'll continue to be consistently for it irrespective of what the political ramifications of that are,\" Bush said.\n\"Dreamers\" are those young people who were brought to the United States illegally by their parents at an early age and lack documents to normalize their immigration status.\nBush acknowledged that this vision \"apparently is somewhat out of the mainstream temporarily in my party, but it isn't, really. A great majority of Republicans believe in immigration reform.\"\nHe especially criticized the proposals of Donald Trump, who has urged the building of a wall along the U.S.-Mexican border to prevent the illegal northward flow of migrants and advocated deporting all the country's estimated 11 million undocumented immigrants.\n\"(W)e don't need to build a wall. We don't need to deport every person that's in this country. That would cost hundreds of billions of dollars, that's not a conservative plan. That won't solve the problems. Giving people a chance to earn legal status would be a far better approach,\" Bush said, receiving tremendous applause.\nAt one point in his speech, Bush began to be booed by a group of pro-immigrant activists who chanted the phrase \"Without our vote, you've got no hope\" of winning the presidency.\nAt the conference, the work of three businessmen of Hispanic origin was praised.\nBush has emphasized his own family's example - his wife is Mexican American and he describes his family as \"bi-cultural\" - and he has made it a central element of his campaign to reach out to Hispanic voters.\nBush, originally considered the favorite to land the 2016 GOP nomination, is currently far behind Trump, former Hewlett-Packard CEO Carly Fiorina, former neurosurgeon Ben Carson and Florida Sen. Marco Rubio in the polls. EFE", "external_links": [], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-22T05:24:30.369+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}