{"organizations": [], "uuid": "3f9ad2e772ed138b70f07222e5678c97039751df", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/putin_obama092615getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/international/255098-putin-says-obama-isnt-weak", "country": "", "title": "Putin says Obama isn’t weak | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Putin says Obama isn’t weak | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T09:04:00.000+03:00", "replies_count": 0, "uuid": "3f9ad2e772ed138b70f07222e5678c97039751df"}, "author": "", "url": "http://thehill.com/policy/international/255098-putin-says-obama-isnt-weak", "ord_in_thread": 0, "title": "Putin says Obama isn’t weak | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Bradford Richardson", "Obama"], "text": "Putin says Obama isn’t weak Getty By Bradford Richardson - 09/27/15 07:00 PM EDT \nRussian President Vladimir Putin said in an interview broadcast late Sunday that he does not view President Obama as weak. \n“I don’t think so at all,” the Russian leader said on CBS’s “60 Minutes,” chalking up notions that he disrespects Obama to politics. \n“You see, here’s the thing. In any country – and in the United States I believe this happens even more often than in any other country – foreign political factors are used for domestic political battles,” he said. “There is a presidential campaign coming up, so they’re playing either the Russian card or something else.” ADVERTISEMENT Several Republican primary candidates have criticized the president for a dovish foreign policy amid escalating global tensions.\nThe Russian president defended Russia’s military actions in Ukraine and Syria. \nHe said he annexed Crimea in order to reestablish legitimate government in the Slavic territory, where the pro-Russia president had been overthrown. \n“It is our closest neighbor,” Putin said of Ukraine. “We’ve always said that this is our sister country. It’s not only a Slavic people. We have common history, common culture, common religion, and many things in common.” \nPutin also said he believes the U.S. played a part in trying to overthrown former Ukraine President Viktor Yanukovych. \n“I know that for sure,” Putin said. \n“We have thousands of contacts with them [Ukraine],” he added. “We know who and where, when, who exactly met with someone and worked with those who ousted Yanukovych, how they were supported, how much they were paid, how they were trained, where, in which countries, and who those instructors were. We know everything.” \nPutin also said Russia would continue to prop up Syrian strongman Bashar al-Assad, but he denied Russia was involved in the conflict militarily. He called intelligence reports to the contrary “anti-Syrian propaganda.” \nHe said Russia was taking proactive steps in Syria in order to stop the violence before it can spread to Russia. \n“So instead of waiting for their return we are better off helping Assad fight them on Syrian territory,” Putin said. “So this is the most important thing which encourages us and pushes us to provide assistance to Assad. And in general we want the situation in the region to stabilize.” \nPutin and Obama are scheduled to meet on Monday at the United Nations in New York City. \nThe White House said Putin is “desperate” to sit down with Obama. \nRead more from The Hill: ", "external_links": [], "published": "2015-09-28T09:04:00.000+03:00", "crawled": "2015-09-28T09:04:32.494+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}