{"organizations": ["Home Care Association of America", "U.S. Court of Appeals", "The Home Care Association of America", "NELP", "D.C. Circuit", "Department of Labor", "Hill Court", "Labor Department", "FLSA", "National Employment Law Group", "Caring Across Generations", "Supreme Court"], "uuid": "db96ca5f4d44ef8dc8cbe701c60f35d1ebdef0e6", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Court-GoogleNews", "section_title": "COURT - Google News", "url": "http://thehill.com/regulation/court-battles/251649-labor-department-wins-dispute-over-wage-rights-for-home-health-aids", "country": "IL", "title": "Court backs Obama on minimum wage, overtime for home health aides - The Hill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Court backs Obama on minimum wage, overtime for home health aides - The Hill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T19:04:00.000+03:00", "replies_count": 0, "uuid": "db96ca5f4d44ef8dc8cbe701c60f35d1ebdef0e6"}, "author": "", "url": "http://thehill.com/regulation/court-battles/251649-labor-department-wins-dispute-over-wage-rights-for-home-health-aids", "ord_in_thread": 0, "title": "Court backs Obama on minimum wage, overtime for home health aides - The Hill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lydia Wheeler", "Leon", "Srinivasan", "Phil Bongiorno", "Sri Srinivasan", "Sarah Leberstein", "Richard Leon", "Obama"], "text": "Court backs Obama on minimum wage, overtime for home health aides By Lydia Wheeler - 08/21/15 11:30 AM EDT The U.S. Court of Appeals for the D.C. Circuit handed a victory to the Obama administration on Friday, ruling that the Department of Labor can make home-care providers eligible for the minimum wage and overtime pay. The three-judge panel on the federal court of appeals reversed the decision of a lower court, stating that the administration's move was within the powers of the Fair Labor Standard Act (FLSA). ADVERTISEMENT “The department’s decision to extend the FLSA’s protections to those employees is grounded in a reasonable interpretation of the statute and is neither arbitrary nor capricious,” Judge Sri Srinivasan wrote in the opinion of the court. The case centered on the Labor Department’s decision in 2013 to change the definition of “domestic service employment” and “companionship services.” The new definition stated that third-party employers must pay overtime if a domestic service employee is hired to provide companionship services to elderly and disabled individuals unable to care for themselves. Previously, the third-party employers had been exempt from those rules. The Home Care Association of America, one of the groups that challenged the DOL rule in court, argued that the agency had overstepped its authority. A lower court backed that challenge in January, with Judge Richard Leon ruling that the Labor Department does not have a \"blank check\" to define “companion services.” Leon's decision pushed the case to the powerful D.C. Circuit, which is just one step away from the Supreme Court. In the ruling Friday reversing the lower court, Srinivasan wrote that the Labor Department has the authority to “work out the details” of the companionship services and live-in worker exemptions, and the treatment of workers employed by a third party is one such detail. Unions and labor rights groups had been pushing the Obama administration to give home care workers what they called a “basic protection” to help lift them out of poverty. One advocacy group, Caring Across Generations, had said that home care workers are among the lowest-paid workers in the country, with median hourly wages of $9.61. When DOL issued the rule, which was set to take effect at the start of 2015, it said it was changing the definition because the industry had changed. Professionals employed by third-party agencies had increasingly become the ones providing residential care over workers hired directly by care recipients and their families. The National Employment Law Group (NELP) called Friday’s ruling a “tremendous victory.” “Paying workers less than the minimum wage for their work hours, and not paying an overtime premium after 40 hours a week, benefits no one,” Sarah Leberstein, NELP senior staff attorney, said in a news release. “Low pay leads to burnout and high turnover and compromises care, which in turn create economic strains on the home care system. Many states have already recognized the need to raise standards, and extending basic wage protections is a key element of that process.” Home Care Association of America said it’s disappointed with the court's ruling. “We don’t agree with it,” Phil Bongiorno, the group's executive director said. “We’re digesting what the court has said and weighing all our legal options.” — This story was updated at 1:42 p.m. Tags:", "external_links": [], "published": "2015-08-21T19:04:00.000+03:00", "crawled": "2015-08-22T01:12:21.636+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}