{"organizations": [], "uuid": "cb8054223a942ff2a72d8b92390be38a752e4550", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/obama-y-raul-castro-celebran-en-la-onu-su-segunda-reunion-bilateral/", "country": "", "title": "Obama y Raúl Castro celebran en la ONU su segunda reunión bilateral | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama y Raúl Castro celebran en la ONU su segunda reunión bilateral | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "cb8054223a942ff2a72d8b92390be38a752e4550"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/obama-y-raul-castro-celebran-en-la-onu-su-segunda-reunion-bilateral/", "ord_in_thread": 0, "title": "Obama y Raúl Castro celebran en la ONU su segunda reunión bilateral | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama y Raúl Castro celebran en la ONU su segunda reunión bilateral Published September 29, 2015 EFE \nNaciones Unidas, 29 sep (EFEUSA).- El presidente Barack Obama y su homólogo de Cuba, Raúl Castro, iniciaron hoy en la sede de la ONU su segunda reunión tras el anuncio de la normalización de las relaciones bilaterales entre los dos países. \nObama y Castro posaron brevemente ante los fotógrafos antes de la reunión, en la que también participan el secretario de Estado, John Kerry, y el canciller cubano, Bruno Rodríguez. \nDe pie, los dos líderes se dieron la mano e intercambiaron sonrisas, pero no respondieron a preguntas de los medios presentes. \nLa reunión de hoy sigue a la que ambos mantuvieron en Panamá en abril pasado en el marco de la Cumbre de las Américas y que fue el primer encuentro de dos gobernantes de Cuba y EEUU en más de cinco décadas. \nEste lunes, los dos mandatarios intervinieron ante la Asamblea General de Naciones Unidas y ambos abordaron el embargo económico que pesa sobre la isla y que solamente el Congreso de EEUU puede levantar por completo. \nEn su discurso, Obama se mostró convencido de que el cambio llegará a Cuba, al defender la política de acercamiento emprendida el pasado diciembre y que resultó en el restablecimiento de relaciones diplomáticas y la reapertura de embajadas en Washington y La Habana en julio. \n\"Estoy seguro de que el Congreso levantará inevitablemente un embargo que ya no debería estar ahí\", enfatizó. \nTambién admitió que aún tiene \"diferencias con el Gobierno cubano\" y que EEUU \"seguirá defendiendo los derechos humanos\" en la isla. \nPor su parte, Castro reiteró en su intervención que el \"largo proceso de normalización de las relaciones\" con EEUU culminará cuando, entre otras medidas, el país norteamericano devuelva la base de Guantánamo y pague compensaciones por el embargo. \nLa normalización de los vínculos con EEUU acabará cuando, entre otras medidas, \"se ponga fin al bloqueo económico, comercial y financiero contra Cuba\", destacó Castro. \nTambién \"cuando se devuelva a nuestro país el territorio ocupado ilegalmente por la Base Naval de Guantánamo, cesen las transmisiones radiales y televisivas y los programas de subversión y desestabilización contra Cuba y se compense a nuestro pueblo por los daños humanos y económicos que aún sufre\", agregó. \nComo cada año desde hace más de dos décadas, Cuba está impulsando en la Asamblea General de la ONU una resolución crítica con el embargo y que pide su fin, un texto que habitualmente obtiene un respaldo mayoritario y siempre el voto en contra de EEUU. \nEl Gobierno adelantó la semana pasada que aún no ha tomado una decisión sobre cómo votará en octubre ante ese documento, lo que ha alimentado las especulaciones acerca de que, por primera vez, podría optar por abstenerse. \nMientras, funcionarios de los dos países iniciaron ayer los primeros contactos, a puerta cerrada en La Habana, para normalizar el servicio aéreo. \nAdemás, representantes del \"lobby\" agrícola de los estados de Arkansas y Carolina del Norte se encuentran de visita en Cuba para explorar posibilidades de negocio y la secretaria de Comercio, Penny Pritzker, viajará a La Habana los días 6 y 7 de octubre. \nLa semana pasada entraron en vigor nuevas normas adoptadas por el Gobierno que amplían a los ciudadanos las facilidades para viajar, hacer negocios, enviar remesas y prestar servicios de telecomunicaciones en Cuba, aunque el turismo sigue prohibido. EFEUSA ", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T11:59:20.471+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}