{"organizations": [], "uuid": "42f57105f52b5d64538af8e0c29bf509316391ea", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/0829%20obama%20israel.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/08/29/obama-anticipates-better-us-israel-ties-after-iran-deal-in-place/", "country": "US", "title": "Obama anticipates better US-Israel ties after Iran deal in place", "performance_score": 7, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama anticipates better US-Israel ties after Iran deal in place | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "42f57105f52b5d64538af8e0c29bf509316391ea"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/08/29/obama-anticipates-better-us-israel-ties-after-iran-deal-in-place/", "ord_in_thread": 0, "title": "Obama anticipates better US-Israel ties after Iran deal in place", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published August 29, 2015 Associated Press Email Print Aug. 27, 2015: President Barack Obama pauses as he delivers remarks at an event commemorating the tenth anniversary of Hurricane Katrina in New Orleans. (AP)\nWASHINGTON – President Barack Obama on Friday compared tensions between the U.S. and Israel over the Iranian nuclear deal to a family feud and said he expects quick improvements in ties between the longtime allies once the accord is implemented.\n\"Like all families, sometimes there are going to be disagreements,\" Obama said in a webcast with Jewish Americans. \"And sometimes people get angrier about disagreements in families than with folks that aren't family.\"\nThe president's comments came as momentum for the nuclear accord grew on Capitol Hill, where lawmakers will vote next month on a resolution to disapprove of the deal. Sen. Tom Carper, D-Del., became the 30th senator to publicly back the agreement, saying Friday that it was a good deal for America and for allies like Israel.\nIf Senate Democrats can amass 41 votes in favor of the deal, they could block passage of the disapproval resolution. Obama has vowed to veto the resolution if it passes, and Democrats could hold off Republican efforts to override his veto if they get 34 votes — just four more than they have now.\nThe looming congressional confrontation has sparked a summer of intense debate between supporters and opponents of the nuclear accord. The deliberations have also divided Jewish Americans, with leaders of many organizations expressing concern about long-term damage to the community.\nThe president encouraged skeptics of the agreement to \"overcome the emotions\" that have infused the debate and evaluate the accord based on facts.\n\"I would suggest that in terms of the tone of this debate everybody keep in mind that we're all pro-Israel,\" he said. \"We have to make sure that we don't impugn people's motives.\"\nWhile Obama was measured in his remarks Friday, he has spoken passionately about the nuclear accord in the past, accusing those who oppose the deal of supporting war over diplomacy. Earlier Friday, his spokesman equated an anti-deal rally Republican presidential candidates Donald Trump and Sen. Ted Cruz plan to hold next month to a \"pro-war rally.\"\nObama also infuriated congressional Republicans earlier this month when he compared opponents of the agreement to Iranian hardliners who chant \"Death to America\" in the streets of Tehran.\nDon Stewart, a spokesman for Senate Majority Leader Mitch McConnell, R-Ky., said Friday that Republicans were still waiting for the president to retract that assertion.\nThe U.S. negotiated alongside Britain, France, Germany, Russia and China for nearly two years before finalizing a landmark accord to curb Iran's nuclear program in exchange for billions of dollars in sanctions relief.\nAs he has in previous speeches and interviews, Obama sought to refute criticism of the accord point by point. He disputed the notion that Iran would funnel the bulk of the money it receives from the sanctions relief into terrorism, saying Iranian leaders are more likely to try to bolster their weak economy. He also said the agreement wasn't built on trusting Iran's government, which frequently spouts anti-American and anti-Israeli rhetoric.\n\"It's precisely because we're not counting on the nature of the regime to change that it's so important for us to make sure they don't have a nuclear weapon,\" he said.\nFriday's webcast was hosted by the Conference of Presidents of Major American Jewish Organizations and The Jewish Federations of North America. Organizers said thousands of people participated and questions submitted online were selected by the moderators.\nIsrael Prime Minister Benjamin Netanyahu, one of the fiercest critics of the nuclear agreement, took part in a similar webcast hosted by the same organizations earlier this month. While Obama and Netanyahu have never had a warm relationship, the U.S. president's pursuit of diplomacy with Iran has deeply strained ties between the leaders.\nObama said once the nuclear accord is implemented, he expects \"pretty quick\" improvements in U.S.-Israeli relations. He called for resuming talks with Israel over ways to boost its security in a dangerous neighborhood.\nIn the weeks following completion of the nuclear deal, Israeli officials have resisted discussing increased security assistance with the U.S. because they say such talks would imply acceptance of the accord.", "external_links": ["http://www.ap.org/"], "published": "2015-08-29T03:00:00.000+03:00", "crawled": "2015-08-29T14:32:44.440+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}