{"organizations": ["New Hampshire Democratic Party", "New York Supreme Court", "Muslim", "Turnberry", "GOP", "Beverly Wilshire Hotel", "The New York Times", "CNN", "Democratic"], "uuid": "0ed7fbb10f0c0b31aa4c5585aaef97ede9eaf869", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150918064456-donald-trump-sept-17-town-hall-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition.rss", "section_title": "CNN.com - Top Stories", "url": "http://edition.cnn.com/2015/09/19/politics/donald-trump-obama-twitter/index.html?eref=edition", "country": "US", "title": "Trump hits back on Obama claim", "performance_score": 3, "site": "cnn.com", "participants_count": 0, "title_full": "Trump hits back on Obama claim", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T05:27:00.000+03:00", "replies_count": 0, "uuid": "0ed7fbb10f0c0b31aa4c5585aaef97ede9eaf869"}, "author": "", "url": "http://edition.cnn.com/2015/09/19/politics/donald-trump-obama-twitter/index.html?eref=edition", "ord_in_thread": 0, "title": "Trump hits back on Obama claim", "locations": ["Rochester", "United States", "Washington", "Dubuque", "Ladd-Peebles Stadium", "Earnest", "Cleveland", "Texas", "Iowa Faith", "Grand River Center", "Iowa", "Alabama", "New Hampshire", "California", "New York", "U.S.", "Mexico", "Iowa State Fair", "Laredo", "Turnberry", "Beverly Hills"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush", "Donald J. Trump", "McCain Trump", "Anderson Cooper", "Barack Obama", "Donald Trump", "Lewandowski", "Sunlen Serfaty", "Chris Moody", "Cassie Spodak", "Lindsey Graham", "Hillary Clinton", "Ted Cruz", "Donald Trump Trump", "Martin O'Malley", "Theodore Schleifer", "Rick Santorum", "Trump", "O'Malley", "Kristen Holmes", "Josh Earnest", "Corey Lewandowski", "Jindal", "Obama", "John McCain", "Clinton", "Jeremy Diamond", "Dana Bash", "Chris Christie", "McCain"], "text": "Story highlights Trump did not dispute the man's claims made at a town hall event this week \"Am I morally obligated to defend the president every time somebody says something bad or controversial about him? I don't think so!\" he tweeted Washington (CNN) Donald Trump on Saturday said it is not his job to correct supporters' claims about the President, defending his decision not to take issue with a man who disparaged Muslims and said President Barack Obama is not an American. Trump did not dispute the man's allegations made at a town hall event this week, and added that if someone criticized him to Obama, there would be \"no chance\" the President would come to his defense. \"Am I morally obligated to defend the president every time somebody says something bad or controversial about him? I don't think so!\" he tweeted Saturday morning. Am I morally obligated to defend the president every time somebody says something bad or controversial about him? I don't think so! — Donald J. Trump (@realDonaldTrump) September 19, 2015 Seven minutes later, Trump suggested, \"This is the first time in my life that I have caused controversy by NOT saying something.\" This is the first time in my life that I have caused controversy by NOT saying something. — Donald J. Trump (@realDonaldTrump) September 19, 2015 He then followed up by saying Obama would not have defended him in the roles were reversed. \"If someone made a nasty or controversial statement about me to the president, do you really think he would come to my rescue? No chance!\" If someone made a nasty or controversial statement about me to the president, do you really think he would come to my rescue? No chance! — Donald J. Trump (@realDonaldTrump) September 19, 2015 Trump then said that if he had challenged the man, the media would have accused him of infringing on the man's speech. \"If I would have challenged the man, the media would have accused me of interfering with that man's right of free speech. A no win situation!\" he tweeted. If I would have challenged the man, the media would have accused me of interfering with that man's right of free speech. A no win situation! — Donald J. Trump (@realDonaldTrump) September 19, 2015 He also slammed Obama for being \"horrible\" in protecting Christians' religious liberty. \"Christians need support in our country (and around the world), their religious liberty is at stake! Obama has been horrible, I will be great\" Christians need support in our country (and around the world), their religious liberty is at stake! Obama has been horrible, I will be great — Donald J. Trump (@realDonaldTrump) September 19, 2015 Speaking at the Iowa Faith and Freedom presidential forum Saturday night, Trump -- carrying a Bible to the podium -- acknowledged he had had \"quite a couple of days\" before reading his tweets from the morning and maintaining his position that he had done nothing wrong. Contrast to McCain Trump's response contrasts with John McCain's now-famous exchange during a town hall in 2008, when he took the microphone away from and corrected a woman who called Obama \"an Arab.\" \"No ma'am,\" McCain said. \"He's a decent family man citizen that I just happen to have disagreements with on fundamental issues.\" The White House pointed out that difference in a sharp response on Friday. RELATED: Trump's history of suggesting Obama is a Muslim \"Is anyone really surprised that this happened at a Donald Trump rally?\" White House spokesman Josh Earnest said during his daily briefing. \"The people who hold these offensive views are part of Mr. Trump's base. ... It is too bad that he wasn't able to summon the same kind of patriotism that we saw from Senator McCain, who responded much more effectively and directly when one of his supporters and one of his campaign events seven years ago raised the same kind of false claims.\" The White House on Saturday declined to add to Earnest's remarks. 14 photos: The many facial expressions of Donald Trump 14 photos: The many facial expressions of Donald Trump After the CNN Republican debate, many people on the Internet decided that GOP front-runner Donald Trump is the most expressive person running for President. Here's a look at his many facial expressions. Hide Caption 1 of 14 14 photos: The many facial expressions of Donald Trump Trump speaks about illegal immigration July 10 at the Beverly Wilshire Hotel in Beverly Hills, California. Hide Caption 2 of 14 14 photos: The many facial expressions of Donald Trump Trump speaks to guests gathered for a campaign event at the Grand River Center in Dubuque, Iowa, on August 25. Hide Caption 14 photos: The many facial expressions of Donald Trump Trump visits his Scottish golf course Turnberry on July 30. Hide Caption 14 photos: The many facial expressions of Donald Trump Trump speaks during a rally August 21 at Ladd-Peebles Stadium in Mobile, Alabama. Hide Caption 5 of 14 14 photos: The many facial expressions of Donald Trump Trump eats a pork chop on a stick while attending the Iowa State Fair on August 15. Hide Caption 6 of 14 14 photos: The many facial expressions of Donald Trump Trump flashes a thumbs-up as he arrives for the start of the first presidential debate August 6 in Cleveland. Hide Caption 14 photos: The many facial expressions of Donald Trump Trump participates in the Republican debate in Cleveland. Hide Caption 14 photos: The many facial expressions of Donald Trump Trump arrives for jury duty in New York on August 17. Hide Caption 14 photos: The many facial expressions of Donald Trump Trump walks his Turnberry golf course on July 30. Hide Caption 14 photos: The many facial expressions of Donald Trump Trump at Turnberry on July 30. Hide Caption 11 of 14 14 photos: The many facial expressions of Donald Trump Trump talks to the media in Laredo, Texas, during a trip to the Mexico border on July 23. Hide Caption 12 of 14 14 photos: The many facial expressions of Donald Trump Trump greets onlookers after taping an interview with Anderson Cooper at a Trump-owned building in New York on July 22. Hide Caption 14 photos: The many facial expressions of Donald Trump Trump exits New York Supreme Court after jury duty on August 17. Hide Caption 14 of 14 Asked about Trump's tweets Saturday morning, Democratic presidential contender Martin O'Malley said Trump did have an obligation to correct the questioner. \"I think any of us who are in the public arena, especially for the most important office of the presidency of the United States, have an obligation to correct errors and hateful things when people say them,\" O'Malley said at the New Hampshire Democratic Party convention. \"I mean, it certainly was a different reaction that Donald Trump gave than somebody like John McCain would give when a person wrongly maligns people of the Muslim faith or tries to mischaracterize the President's faith. But I'll leave that to Trump.\" Speaking to the New Hampshire convention Saturday, Democratic front-runner Hillary Clinton -- whose 2008 campaign was notably accused of insinuating that Obama was a Muslim, with Clinton herself saying the then-senator wasn't a Muslim \"as far as I know\" -- ripped Trump over the controversy. \"His latest outrage, the way he handled the question about President Obama, was shocking but not surprising,\" Clinton said. \"He has been trafficking in prejudice and paranoia throughout this campaign.\" 'When can we get rid of them?' The controversy arose on Thursday, when an unidentified man asked Trump when the U.S. can \"get rid\" of Muslims, asserting that Obama was not an American and was a Muslim himself. \"We have a problem in this country. It's called Muslims,\" the man said at a question-and-answer town hall event in Rochester, New Hampshire. \"You know our current president is one. You know he's not even an American.\" A seemingly bewildered Trump interrupted the man, chuckling, \"We need this question. This is the first question.\" \"Anyway, we have training camps growing where they want to kill us,\" the man, wearing a \"Trump\" T-shirt, continued. \"That's my question: When can we get rid of them?\" \"We're going to be looking at a lot of different things,\" Trump replied. \"You know, a lot of people are saying that and a lot of people are saying that bad things are happening. We're going to be looking at that and many other things.\" 6 photos: Donald Trump: His own words 6 photos: Donald Trump: His own words In his interview with CNN's Dana Bash, Donald Trump lashes out at a lawyer who had requested a break to pump breast milk in the middle of a deposition. Hide Caption 6 photos: Donald Trump: His own words Hide Caption 6 photos: Donald Trump: His own words Hide Caption 6 photos: Donald Trump: His own words Hide Caption 6 photos: Donald Trump: His own words Hide Caption 6 photos: Donald Trump: His own words Hide Caption 6 of 6 The real estate mogul did not correct the questioner about his claims about Obama before moving on to another audience member. Corey Lewandowski, Trump's campaign manager, said Thursday that the candidate did not hear the question about Obama being a Muslim. RELATED: GOP 2016 hopefuls split over Trump's Muslim controversy \"All he heard was a question about training camps, which he said we have to look into,\" Lewandowski said. \"The media want to make this an issue about Obama, but it's about him waging a war on Christianity.\" Trump reiterated that claim in an interview with The New York Times published Friday, saying, \"The bigger issue is that Obama is waging a war against Christians in this country.\" Republican presidential contenders have been split over the controversy. Rick Santorum and Ted Cruz refused to criticize Trump or say whether they believe Obama is a Christian, instead slamming reporters for asking about the incident. Jindal said it wasn't a candidate's \"role\" to correct a questioner -- but also said he would have pointed out the U.S.'s anti-discrimination values. But Chris Christie, Lindsey Graham and Jeb Bush emphatically said they believe Obama was born in the U.S. and criticized Trump for not standing up to the questioner. CNN's Jeremy Diamond, Cassie Spodak, Theodore Schleifer, Chris Moody, Kristen Holmes and Sunlen Serfaty contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-09-20T05:27:00.000+03:00", "crawled": "2015-09-20T05:49:59.916+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}