{"organizations": ["Reuters", "Fox News Facebook", "Twitter"], "uuid": "1247ffb43cffcf1a314e24ff6e731a5319bee18d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/09/03/immigration-anchor-babies-and-dangers-nativism/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1441287024516.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/09/03/immigration-anchor-babies-and-dangers-nativism.html", "country": "", "title": "Immigration: Anchor babies and the dangers of 'nativism' | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration: Anchor babies and the dangers of 'nativism' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "1247ffb43cffcf1a314e24ff6e731a5319bee18d"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/09/03/immigration-anchor-babies-and-dangers-nativism.html", "ord_in_thread": 0, "title": "Immigration: Anchor babies and the dangers of 'nativism' | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print (Reuters) \nThe tone of the debate over the nation's immigration laws has taken an ugly turn as some office-seekers offer solutions to problems that don't exist. \nThe natural rights of all persons consist of areas of human behavior for which we do not need and will not accept the need for a government permission slip. \nWe all expect that the government will leave us alone when we think, speak, publish, worship, defend ourselves, enter our homes, choose our mates or travel. The list of natural rights is endless. \nWe expect this not because we are Americans, but because we are persons and these rights are integral to our nature. We expect this in America because the Constitution was written to restrain the government from interfering with natural rights. \nWhen these first principles are violated to advance a political cause or to quell public fear, those whose rights are violated because of an immutable characteristic of birth, not because of personal culpability, become the victims of ugly public indifference or official government repression. The American history of government treatment of Africans and their offspring and the European history of government treatment of the Jewish people are poignant and terrible examples of this. \nToday, the potential victims of public indifference and government repression are Hispanics in America. Hispanics here without documentation are being demonized because of the politics of nativism. Nativism -- we are exceptional; we are better people than they are; we were here first -- is very dangerous and leads to ugly results. \nThe Declaration of Independence and the Constitution underscore the truism that all persons have the same natural rights, irrespective of where their mothers were when they delivered them. \nThe right to travel is a natural right, even though it was not until 1969 that the Supreme Court recognized it as such. The court protects natural rights by imposing a very high bar for the government to meet before it can interfere with them, absent due process. \nThe high bar is called strict scrutiny. It requires that the government demonstrate an articulated area of jurisdiction and a compelling state interest served by the least restrictive alternative before it can treat a person differently or uniquely because of his or her place of birth. A compelling state interest is one that is necessary to preserve life or the state's existence, and it must be addressed using the least force and causing the least interference with personal liberty possible. \nThis test was written so as to give the government wiggle room in a crisis and to make it intentionally difficult -- nearly impossible -- to write laws that apply only to discrete groups when membership in them is determined by birth. \nBut the Constitution itself -- from which all federal powers derive -- does not delegate to the federal government power over immigration, only over naturalization. \nThus, when the government's motivation for enacting immigration laws is to further genuine compelling foreign policy goals, the laws will be upheld. But when the government's motivation is nativism or fear or hatred or favoritism, strict scrutiny will operate to defeat those laws. \nShortly after the first federal immigration statute was enacted in the 1880s -- the Chinese Exclusion Act -- the Supreme Court ruled that aliens, whether here legally or illegally, are persons, and the Constitution protects all persons from governmental deprivation of life, liberty and property without due process. \nIn the same era, the court held that all babies born here of alien mothers are citizens. \nThe Fourteenth Amendment requires this, and its language is inclusive: \"All persons born or naturalized in the United States and subject to the jurisdiction thereof are citizens of the United States...\" Though written to protect former slaves, its language is not limited to them. \nSome well-intended folks have argued that the language \"all persons\" doesn't really mean \"all\" because it is modified by \"and subject to the jurisdiction (of the United States).\" But that language refers to the offspring of mothers who, though here, are still subject to a foreign government -- like foreign diplomats, agents or military. It does not refer to those fleeing foreign governments. It does not -- and cannot -- impose an intent requirement upon infants. \nMy guess is that nearly \"all persons\" reading this are beneficiaries of this clause because they -- you -- were born here. \nWhen the history of our times is written, it might relate that the majority repressed the rights of minorities by demonizing them using appeals to group prejudice -- by blaming entire ethnic groups for the criminal behavior of some few members of those groups. \nThat history might reflect that this was done for short-term political gain. \nIf that happens, it will have changed America far more radically and dangerously than any wave of undocumented immigrants did. \nAnd that would be profoundly and perhaps irreparably un-American. \nAndrew P. Napolitano, a former judge of the Superior Court of New Jersey, is the senior judicial analyst at Fox News Channel. ", "external_links": [], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-05T17:18:45.686+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}