{"organizations": [], "uuid": "3808f1b5d899be8c7857010788a234654959a473", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/560170131c00002500082c00.jpeg?cache=Fn4FnjDyNq", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/wendy-davis-nails-the-hypocrisy-of-some-anti-abortion-rhetoric_56016161e4b08820d91a17fc", "country": "", "title": "Wendy Davis Nails The Hypocrisy Of Some Anti-Abortion Rhetoric", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Wendy Davis Nails The Hypocrisy Of Some Anti-Abortion Rhetoric", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "3808f1b5d899be8c7857010788a234654959a473"}, "author": "", "url": "http://www.huffingtonpost.com/entry/wendy-davis-nails-the-hypocrisy-of-some-anti-abortion-rhetoric_56016161e4b08820d91a17fc", "ord_in_thread": 0, "title": "Wendy Davis Nails The Hypocrisy Of Some Anti-Abortion Rhetoric", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Emma Gray", "Wendy Davis"], "text": "Wendy Davis Nails The Hypocrisy Of Some Anti-Abortion Rhetoric \"We're literally forcing women into being childbearing vessels.\" Emma Gray Executive Women's Editor, The Huffington Post Posted: 09/22/2015 12:04 PM EDT \nWendy Davis lost her run for governor of Texas, but that doesn't mean she's going to stop speaking up about the political issues her candidacy was built on. \nIn a Monday night conversation with Mic Senior Editor Elizabeth Plank as part of Mic.com's Pass The Mic series, Davis discussed who she'll be voting for in the Democratic primary (Hillary Clinton), her thoughts on Carly Fiorina (\"Woman to woman, I respect her. But I'm not going to support someone simply because they are female.\") and what teen girls can do to support reproductive rights (\"Talk to your friends. Educate them.\"). A photo posted by HuffPost Women (@huffpostwomen) on Sep 21, 2015 at 4:03pm PDT \nShe had some strong words about the Republican rhetoric surrounding access to reproductive care and abortion and the current GOP push to defund Planned Parenthood . \n\"It is the law of the land,\" Davis said about abortion. \"It is a constitutionally-protected right, like the Second Amendment [the right to bear arms].\" \nShe also pointed out the holes in the prevailing \"pro-life\" logic of some politicians who would defund Planned Parenthood. She expressed concern specifically about those who oppose abortion on the grounds that we must \"protect life,\" but who also oppose social programs that often help the children born out of these pregnancies thrive. \n\"We're literally forcing women into being childbearing vessels,\" said Davis. \"[But] how are the children of the women who were forced to bear them going to be fed and educated?\" \nOn September 18th, the House voted to pull funding for Planned Parenthood for one year. President Obama has promised to veto the legislation if it were to get through the Senate and reach his desk. \n\"By eliminating Federal funding for a major provider of health care, H.R. 3134 would limit access to health care for men, women, and families across the Nation,\" said the White House . \nAlso on HuffPost: Myths About Abortion That Need To Be Busted of ", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-23T05:53:07.141+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}