{"organizations": [], "uuid": "016b397d0c438d5b52205c18d50e4155cc3649ec", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/us/crime/index.html", "section_title": "Crime &amp; Courts | U.S. | Fox News ", "url": "http://www.foxnews.com/us/2015/09/21/authorities-trap-explodes-near-marijuana-growing-operation-in-detroit-man/", "country": "US", "title": "Authorities: Trap explodes near marijuana growing operation in Detroit; man injured", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Authorities: Trap explodes near marijuana growing operation in Detroit; man injured | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "016b397d0c438d5b52205c18d50e4155cc3649ec"}, "author": "Associated Press", "url": "http://www.foxnews.com/us/2015/09/21/authorities-trap-explodes-near-marijuana-growing-operation-in-detroit-man/", "ord_in_thread": 0, "title": "Authorities: Trap explodes near marijuana growing operation in Detroit; man injured", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " livefyre Email Print DETROIT – A man who may have been trying to steal marijuana was injured when he stepped on and detonated one of several booby traps protecting a large drug growing operation outside of a Detroit home, authorities said.\nThe 28-year-old man apparently tripped the explosive Sunday morning while walking in a vacant field on the city's west side and had a cut on his foot from the blast, police said. Detroit Police Officer Dan Donakowski told The Detroit News the man \"heard some loud explosions and felt pain.\"\nA man who investigators believe planted the traps cooperated with authorities, Bureau of Alcohol, Tobacco, Firearms and Explosives spokesman Donald Dawkins told The Associated Press. He wasn't in custody Monday morning, Dawkins said, but he was expected to face federal explosives charges.\nDawkins said at least four explosive devices were found and that they were placed in an area where children or utility crews could have been injured.\n\"They were powerful enough to cause a substantial injury ... to anyone who came in contact with them,\" Dawkins said.\nThe man also told investigators that the marijuana was being grown for medicinal purposes and that he had state authorization to grow it, but Dawkins said that's irrelevant in this case because of the explosives. Firearms also were found in the home, Dawkins said.\nMichigan voters approved marijuana use for some chronic medical conditions in 2008. State law, however, conflicts with federal law about possession and use.\nThe man who was injured may have been trying to steal marijuana from the growing operation, Dawkins said. The investigation was ongoing.\nThe man was taken to a hospital for treatment, police said.", "external_links": ["http://www.ap.org/"], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-21T21:10:40.924+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}