{"organizations": [], "uuid": "35895dec62a92b1a8a20031003d6e2d2eccf0ee3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/antarctica_031414getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/defense/252403-obama-calls-for-increasing-icebreakers-in-arctic", "country": "US", "title": "Obama calls for more Arctic icebreakers to counter Russia", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama calls for more Arctic icebreakers to counter Russia", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T17:16:00.000+03:00", "replies_count": 0, "uuid": "35895dec62a92b1a8a20031003d6e2d2eccf0ee3"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/252403-obama-calls-for-increasing-icebreakers-in-arctic", "ord_in_thread": 0, "title": "Obama calls for more Arctic icebreakers to counter Russia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama calls for more Arctic icebreakers to counter Russia Getty Images By Kristina Wong - 09/01/15 10:16 AM EDT \nPresident Obama is calling for new Coast Guard icebreakers for the Arctic, citing the growing number of Russian ships in the area, as both powers make a play for the rapidly changing polar region. \nA White House fact sheet released on Tuesday morning pointed out that the number of icebreakers the U.S. has operated in the region has dramatically dropped since World War II, when the U.S. had as many as seven there. ADVERTISEMENT Today, the Coast Guard technically has three icebreakers in its fleet, but when age and reliability are taken into account, the fleet is down to only two fully functional icebreakers and only one heavy-duty icebreaker, it said.\n\"Russia, on the other hand, has forty icebreakers and another eleven planned or under construction,\" it said. \nThe melting of Arctic sea ice is expected to lead to a dramatic increase in sea traffic in the coming years, and global powers are moving to maintain access if not to control the new waterways. \n\"The growth of human activity in the Arctic region will require highly engaged stewardship to maintain the open seas necessary for global commerce and scientific research, allow for search and rescue activities, and provide for regional peace and stability,\" the White House said. \n\"That is why the Administration will propose to accelerate acquisition of a replacement heavy icebreaker to 2020 from 2022, begin planning for construction of additional icebreakers, and call on Congress to work with the Administration to provide sufficient resources to fund these critical investments.\" \n\"These heavy icebreakers will ensure that the United States can meet our national interests, protect and manage our natural resources, and strengthen our international, state, local, and tribal relationships,\" it added. \nU.S. concerns about Russia have been growing since Moscow's invasion of Ukraine last year, its annexation of the Crimean peninsula and its ongoing support for pro-Russian separatists in Eastern Ukraine. \nMilitary leaders say they now see Russia as a top threat to national security, and lawmakers and state officials have been expressing concern about a Russian build-up in the Arctic. \nGov. Bill Walker (I) of Alaska, who traveled to Anchorage with Obama on Air Force One on Monday, said he was concerned that Russia has been building up its military presence in the region, as the U.S. appeared to be drawing down. \n“It’s the biggest buildup of the Russian military since the Cold War,” Walker told The New York Times . “They’re reopening 10 bases and building four more, and they’re all in the Arctic, so here we are in the middle of the pond, feeling a little bit uncomfortable.” \nThis is in addition to large-scale Russian military exercises involving tens of thousands of troops, dozens of ships and submarines, and more than 100 aircraft in the region, according to a Fox News report . \nMoscow also submitted a claim to the United Nations on Aug. 5 for 463,000 square miles of the Arctic sea shelf — more than 350 nautical miles from the country's shore, according to the report. \nThe Arctic is believed to hold up to 25 percent of the world's untapped oil and gas supplies. Tags:", "external_links": [], "published": "2015-09-01T17:16:00.000+03:00", "crawled": "2015-09-01T21:45:48.515+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}