{"organizations": [], "uuid": "590dde0ff0f4189601abc893bf250e97b99a1fc3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaalaska_082715getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/252242-greens-obama-climate-legacy-at-risk-over-arctic-drilling", "country": "US", "title": "Greens: Obama climate legacy at risk over Arctic drilling", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Greens: Obama climate legacy at risk over Arctic drilling", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T21:30:00.000+03:00", "replies_count": 0, "uuid": "590dde0ff0f4189601abc893bf250e97b99a1fc3"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/252242-greens-obama-climate-legacy-at-risk-over-arctic-drilling", "ord_in_thread": 0, "title": "Greens: Obama climate legacy at risk over Arctic drilling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greens: Obama climate legacy at risk over Arctic drilling Getty Images By Devin Henry - 08/30/15 02:30 PM EDT \nPresident Obama will visit Alaska on Tuesday in the midst of a fight with environmental groups, who arguing he is putting his climate legacy is at risk by allowing Royal Dutch Shell to drill for oil in the Arctic waters off the state’s northern coast. \nObama is going to Alaska to inspect the effects of climate change on one of the nation’s most vulnerable ecosystems. ADVERTISEMENT In the final quarter of his presidency, Obama intends to use the dramatic backdrop to highlight his administration’s efforts to combat global warming — an issue he's looked to address through broad and controversial new regulations and international accords. \nIt’s a legacy Obama has done much to burnish in his second term, but one green groups argue will be jeopardized by the new Alaska drilling. \nOne group — Credo Action — has launched a website highlighting Obama’s trip, and warning it threatens to become his “Mission Accomplished” moment. \n“President Obama is heading on a trip to Alaska to talk about climate change,” the group says on its website. “There is no clearer symbol of the self-defeating hypocrisy of his policies on energy and climate.” \nEnvironmental groups hope to use Obama’s visit to pressure him over the drilling permit, something Obama himself moved to defend this weekend. \n“I know there are Americans who are concerned about oil companies drilling in environmentally sensitive waters. Some are also concerned with my administration’s decision to approve Shell’s application to drill a well off the Alaskan coast, using leases they purchased before I took office,” Obama said in his weekly address. \n“That’s precisely why my administration has worked to make sure that our oil exploration conducted under these leases is done at the highest standards possible, with requirements specifically tailored to the risks of drilling off Alaska.” \nGreens have dismissed those arguments. \nDrilling in the Arctic, they say, risks the potential for an oil spill where it would be difficult to clean up. They say that if climate change is to be avoided, the Arctic’s estimated 100 billion barrels of oil need to stay below ground. \n“I think it could be a real deal-breaker, for not only his climate legacy but for his progressive legacy. It really is a people-versus-corporation situation,” Greenpeace USA spokeswoman Cassady Sharp said. \nGreenpeace activists in the Pacific Northwest had led the charge against Shell’s plans, working to physically block key pieces of equipment from reaching the company’s drilling site in the Chukchi Sea. Sharp said Obama’s decision represents something of a betrayal to the green flank of his base. \n“He’s leading kind of a double life, quite honestly, on climate, and I think it’s really going to come back to haunt him if he doesn’t put an end to Shell’s lease now,” she said. \nGreen groups have often been aligned with Obama in his second term. \nHis Clean Power Plan regulations for power plants are designed to slash carbon emissions from the American electricity sector, and he’s won praise from environmentalists for instituting higher fuel efficiency standards for cars and trucks and proposing rules cracking down on methane emissions from natural gas drilling sites. \nBut a major environmental disaster remains a key moment in the Obama era. During his second year in the Oval Office, he had to confront the 3.19 million-barrel Deepwater Horizon oil spill in the Gulf, and greens warn a similar spill in the Arctic would be exceedingly difficult to clean up — and would land firmly in Obama’s lap if it were to happen now. \n“You could see where this president leaves office with a great environmental legacy that he’s earned, he’s done great things,” Athan Manuel, the director of lands protection at the Sierra Club, said. \n“But if there’s a catastrophic spill in the Arctic Ocean, by Shell, on a rig that they permitted, that could completely undercut what should be a great environmental legacy.” \nAs Obama has addressed his energy policy, his administration often takes pains to note the role oil and gas play in a transition from fossil fuels to renewable energy. \nSpeaking to a clean energy summit on Monday, Obama noted the growth in American oil and gas production, but he framed it a step toward breaking “our addiction to fossil fuels and foreign oil” that has “perennially threatened our planet and our national security.” \n“Now even as we accelerate this transition, our economy still has to rely on oil and gas,” Obama said in his weekly address. \n“As long as that’s the case, I believe we should rely more on domestic production than on foreign imports, and we should demand the highest safety standards in the industry — our own.” \nBut his decision to give a company the go-ahead to explore for oil in the Arctic won’t help combat climate change, greens warn. \n“You have to weigh what he’s doing on [regulations] with what he’s done on all-of-the-above and fracking and celebrating oil and gas exports,” Friends of the Earth President Erich Pica said. “What he’s done is historic compared to all these other presidents, but given the problem we’re facing, it could be viewed historically as a missed opportunity.” \nActivists have suggested ways out of the quandary for Obama. Shell’s drilling season ends in September, and the company will need to request a permit to explore again next summer. Manuel said Obama should deny that request. \nThey also hope Obama will override his own Interior Department and block new offshore drilling anywhere around the United States. Greens were incensed in January when the Interior Department proposed opening up swaths of the Arctic and Atlantic Ocean to offshore drilling. \nBut despite what happens next, “it’s still a head-scratcher that this summer, drilling is going to happen in the Arctic Ocean,” Manuel said. “We’re certainly hoping Shell is more competent than we think they are and they don’t have a problem.”", "external_links": [], "published": "2015-08-30T21:30:00.000+03:00", "crawled": "2015-08-30T22:29:04.701+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}