{"organizations": [], "uuid": "91e80b77fc62c07b7a1fc8bd7d42ff8a229b5f85", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/22/politics/congress-abortion-planned-parenthood/index.html", "country": "", "title": "Senate Dems block GOP abortion bill - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Senate Dems block GOP abortion bill - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T19:06:00.000+03:00", "replies_count": 0, "uuid": "91e80b77fc62c07b7a1fc8bd7d42ff8a229b5f85"}, "author": "", "url": "http://www.cnn.com/2015/09/22/politics/congress-abortion-planned-parenthood/index.html", "ord_in_thread": 0, "title": "Senate Dems block GOP abortion bill - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Senate Dems block GOP abortion bill Updated 1654 GMT (2354 HKT) September 22, 2015 JUST WATCHED Fact check: What do the Planned Parenthood videos show? 01:47 Story highlights Needing 60 votes to advance, the bill failed 54 to 42 The vote coincided with the arrival this week of the head of the Catholic Church, an entity that is a leading force against abortions Washington (CNN) Two days before Pope Francis delivers an historic speech to Congress, Senate Republican leaders Tuesday pressed for passage of a bill to ban abortions after 20 weeks of pregnancy but were blocked by Democrats, who strongly oppose the measure. Needing 60 votes to advance, the bill failed 54 to 42. The vote coincided with the arrival this week of the head of the Catholic Church, an entity that is a leading force against abortions. It also came amidst a broader debate on Capitol Hill about whether to strip federal funding for Planned Parenthood, something Republicans are anxious to do and Democrats are against. The failed motion on the Pain Capable Unborn Child Protection Act is seen as a signal to conservative Republicans that their abortion-related effort to strip funding for Planned Parenthood can't pass and therefore shouldn't be attached to a government funding measure because it could lead to a shutdown. The government runs out of money in eight days and GOP leaders in the House and Senate are working to find a way to pass a short-term bill to keep the government operating, but it's unclear if enough Republicans in the House will back it unless it excludes the money for Planned Parenthood. \"We in this chamber are never going to agree completely on the abortion question. But we should at least be able to agree that if an unborn child has reached the point where he or she can feel pain, that child's life deserves protection,\" Senate Majority Leader Mitch McConnell said. But Democrats blasted Republicans for scheduling votes they believe are politically motivated while there is not clear path forward on funding the government. \"By holding today's vote, Republican leaders are pandering to right-wing extremists in the party who are willing to take our government hostage to try to score\" political points, said Senate Democratic Leader Harry Reid. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics ", "external_links": [], "published": "2015-09-22T19:06:00.000+03:00", "crawled": "2015-09-22T19:07:29.446+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}