{"organizations": ["Fox News Clock", "Facebook", "Twitter"], "uuid": "3a9e308848e95f0cb109d4e606d477749e8c5738", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/694940094001_4501389420001_092215-hn-admed-1280.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/22/clock-controversy-may-cause-headache-for-obama-as-doubts-raised-about-story/", "country": "", "title": "Clock controversy risks backfiring for Obama as critics cast doubt on narrative | Fox News", "performance_score": 10, "site": "foxnews.com", "participants_count": 0, "title_full": "Clock controversy risks backfiring for Obama as critics cast doubt on narrative | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T00:12:00.000+03:00", "replies_count": 0, "uuid": "3a9e308848e95f0cb109d4e606d477749e8c5738"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/22/clock-controversy-may-cause-headache-for-obama-as-doubts-raised-about-story/", "ord_in_thread": 0, "title": "Clock controversy risks backfiring for Obama as critics cast doubt on narrative | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Clock controversy risks backfiring for Obama as critics cast doubt on narrative Published September 22, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama’s public backing of a Texas high school freshman, who got national headlines last week when his homemade clock was mistaken for a bomb by teachers, could be causing a headache for the White House and other supporters as questions are being raised about the motives in the case. \nFourteen-year-old Ahmed Mohamed’s father has said he now plans to withdraw the freshman from MacArthur High School, and said Monday that they intend to visit New York City where he says they will meet with dignitaries at the United Nations, before making a pilgrimage to Mecca and later visiting Obama at the White House, The Dallas Morning News reported. \nIt was not immediately clear which dignitaries had requested a meeting with Mohamed. \nMohamed had received praise and support from figures such as Obama and Facebook CEO Mark Zuckerberg in the wake of the incident, in which Mohamed was arrested on bomb hoax charges after bringing the device to school. Cool clock, Ahmed. Want to bring it to the White House? We should inspire more kids like you to like science. It's what makes America great. \n— President Obama (@POTUS) September 16, 2015 \nHowever, amid huge support online for the family, there also has been growing criticism and doubts about the motive behind the incident. \nEvolutionary biologist Richard Dawkins linked to a video posted to YouTube by electrical expert Thomas Talbot, which closely scrutinizes a photo of the controversial clock. Assembling clock from bought components is fine. Taking clock out of its case to make it look as if he built it is not fine. Which is true? \n— Richard Dawkins (@RichardDawkins) September 20, 2015 \nIn the video, Talbot argues the clock is actually a commercial alarm clock, removed from its casing. Features of the clock such as the printed circuit boards and ribbon cables are indicative of a manufactured product, he explained. \nDawkins asked, “If this is true, what was [Mohamed’s] motive?” \nMohamed’s father has a colorful history of his own. Mohamed Elhassan Mohamed announced in February that he planned to run for president of Sudan, as he also did in 2010, the North Dallas Gazette reported. In 2011, he defended the Koran when controversial pastor Rev. Terry Jones put the book “on trial.\" \nOn HBO’s “Real Time with Bill Maher,” Dallas Mavericks’ owner Mark Cuban also expressed concerns about the family’s involvement. While calling Ahmed a “super smart kid,” he said that when he spoke to Ahmed, \"his sister, over his shoulder, you could hear, listening to the question, giving him the answer.” \nMaher, a left-wing comedian, also expressed skepticism, saying “the people at the school thought it might be a bomb, perhaps because it looks exactly like a [expletive] bomb.” \nFox News senior judicial analyst Judge Napolitano said that if the whole thing was a fraud, and the family was involved, they could be open to legal charges. \n“It now appears as though this was a purposeful hoax,\" Napolitano told Fox News' Megyn Kelly Monday. “If the parents were involved now you have a fraud going on as you have funds going on for him right now,” he said, adding that the two funds to raise money for the family now amount to over $20,000. \nNapolitano added that this could turn out to be a politically difficult issue for Obama. \n\"If this was part of a purposeful stunt and if the parents were involved in this and if everybody from Mark Zuckerberg to President Obama fell for this, this is not good,\" Napolitano said. \nIf so, it wouldn’t be the first time Obama has stepped into hot water after jumping into a local debate. In 2009, Obama reacted to initial media reports that black professor Henry Louis Gates had been arrested by Sgt. James Crowley for trying to get back into his own house after being locked out. Obama said at a press conference “the police acted stupidly” and cited a “long history in this country of African Americans and Latinos being stopped by law enforcement disproportionately.” \nIt later turned out the arrest was much more complex than it initially appeared, with it being alleged that Gates made offensive comments about Crowley’s mother. Obama came under criticism and later held a “beer summit” with the two in the Rose Garden. \nFormer Alaska governor Sarah Palin blasted Obama over his involvement in the clock controversy on Saturday, saying in a Facebook post his remarks were \"about as presidential as a selfie stick.\" \n\"By the way, President Obama's practice of jumping in cases prematurely to interject himself as the cool savior, wanting so badly to attach himself to the issue-of-the-day, got old years ago,\" Palin wrote. Advertisement ", "external_links": [], "published": "2015-09-23T00:12:00.000+03:00", "crawled": "2015-09-23T00:11:36.927+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}