{"organizations": [], "uuid": "38e2f46c512472fb47fb3f3dae05d3a8db58b7dc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabrack_071415getty3.jpg", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/253082-obama-to-commemorate-9-11-anniversary-at-ft-meade", "country": "US", "title": "Obama to commemorate 9/11 anniversary at Ft. Meade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to commemorate 9/11 anniversary at Ft. Meade", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T20:58:00.000+03:00", "replies_count": 0, "uuid": "38e2f46c512472fb47fb3f3dae05d3a8db58b7dc"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/253082-obama-to-commemorate-9-11-anniversary-at-ft-meade", "ord_in_thread": 0, "title": "Obama to commemorate 9/11 anniversary at Ft. Meade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to commemorate 9/11 anniversary at Ft. Meade By Jordan Fabian - 09/09/15 01:58 PM EDT President Obama will travel to Fort Meade on Friday to mark the 14th anniversary of the Sept. 11 terrorist attacks. Obama will meet with military service members at the Maryland base, spokesman Eric Schultz told reporters on Air Force One. The president and first lady Michelle Obama will participate in a moment of silence with White House staff on the South Lawn. ADVERTISEMENT “The president looks forward to having conversations with patriotic men and women who work every day to keep America safe and to honor the sacrifices of troops and their families,” Schultz said. Fort Meade is home to several federal agencies, including the National Security Agency, which was embroiled in a controversy over a post-9/11 program allowing bulk collection of Americans’ phone records. Located 26 miles north of Washington, Fort Meade employs 52,000 people, making it the third-largest Army installation in the United States. Past: 1 day House GOP to postpone vote on Iran... House Republicans will now meet at 4 p.m. to discuss strategy. WATCH LIVE: Trump, Cruz rally... The GOP presidential rivals are headlining a rally at the Capitol. Trump calls on CNN to donate... He sent a letter to CNN president Jeff Zucker insisting that he share the... Trump on Black Lives Matter: 'I... Trump says activists with group are promoting \"hate.\" Trump storms Capitol for Iran... Trump, Cruz and others will rally in a show of force against the Iran... Climate change: Seven indisputable... President Obama last week visited Alaska to preach about the inevitable... Sanders to roll out criminal... Sanders called the current system \"broken.\" Software pioneer McAfee files... McAfee reportedly would be “founding a new party yet to be announced.” House GOP faces shutdown crisis Heritage Action claims at least 28 Republicans will demand end to Planned... Juan Williams: #BlackLivesMatter... OPINION | The movement is fast becoming its own worst enemy. Biden road-tests 2016 message The vice president insists he has not made up his mind on a run. Carson: It’s going to be hard to... Ben Carson tells The Hill that he's embracing the role of underdog. Feds: Highway funding will last... The update could give lawmakers more room to pass a temporary road funding... Is Trump proving that the Latino... His Latino support numbers also deserve closer, less culturally myopic... Supreme leader: Iran won't again... “We agreed to hold talks with America only on the nuclear issue,\" Khamenei. Murdoch: Biden 'very likely' wins... “Looks like Biden already running,” the media mogul tweeted. Bush on Colbert: 'Jeb!' logo... The GOP candidate said his brother didn't control spending while in office. Pelosi: GOP ‘out to get’ Planned... \"How dare they be so disregarding of women's health issues,” she says. Rubio: Trump 'should run as a... Rubio is blasting Trump's call for the wealthy and hedge funds to pay more...", "external_links": [], "published": "2015-09-09T20:58:00.000+03:00", "crawled": "2015-09-09T21:44:03.052+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}