{"organizations": ["Senate"], "uuid": "34bbc23ee036c26316a55f7e259ecfd6e6458255", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/amtrak_090315gn.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/transportation/253367-obama-rail-chief-gets-senate-confirmation-hearing", "country": "", "title": "Obama rail chief gets Senate confirmation hearing | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama rail chief gets Senate confirmation hearing | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T19:14:00.000+03:00", "replies_count": 0, "uuid": "34bbc23ee036c26316a55f7e259ecfd6e6458255"}, "author": "", "url": "http://thehill.com/policy/transportation/253367-obama-rail-chief-gets-senate-confirmation-hearing", "ord_in_thread": 0, "title": "Obama rail chief gets Senate confirmation hearing | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Keith Laing", "Obama"], "text": "Obama rail chief gets Senate confirmation hearing By Keith Laing - 09/11/15 11:13 AM EDT \nPresident Obama's choice to run the Federal Railroad Administration (FRA) will get a confirmation hearing in the Senate next week. \nThe Senate Commerce, Science and Transportation Committee announced on Friday it will hold a hearing on Feinberg, who has been leading the FRA since January, on Sept. 17. \nFeinberg, who is a former White House staffer and Facebook employee, has won plaudits for her leadership of the FRA during a tenure that included two high-profile Amtrak accidents in North Carolina and Philadelphia. ADVERTISEMENT She took over the helm of the railroad administration after its long-time chief Joseph Szabo resigned in 2014. Prior to assuming the role of FRA chief, Feinberg served as Transportation Secretary Anthony Foxx's chief of staff. \nHuckabee says Dred Scott still ‘... The infamous decision was overturned by the 14th Amendment. GOP in quagmire over refugees A political fight over the refugee crisis in Europe is spreading to the... Biden opens up on loss of his son... “I’d be lying if I said that I knew I was there,” he says. “I’m being... DNC chair closes door on more... “We’re not changing the process. We’re having six debates,” she said. Conservative lawmaker insists GOP... Rep. Jim Jordan says party needs to make its case in \"a compelling,... Climate change: Seven indisputable... The truth is there are more questions about climate change than there are... Trump’s 9/11 ‘haters and losers’... A spokesman for Trump said the tweet was from several years ago. Dems filibuster Iran vote GOP says it will force more votes on Iran next week. House panel votes to lift oil... The action is a significant step toward passing the legislation. Fiorina officially makes cut for... CNN revealed the 11 GOP presidential candidates that will make their prime... Donald Trump doesn't care And that's why he's leading in the polls, and leaving pundits... Bond actor donates $47,000 to... However, Sanders' campaign has asked the PAC to cease and desist. White House holds 9/11 moment of... Obama walked out at 8:46 a.m., the time when the first plane struck the... House votes to accuse Obama of... House Republicans want to see the side deals between Iran and the IAEA. Baltimore mayor won't seek... Stephanie Rawlings-Blakes is stepping aside after fallout over the Freddie... Study: All-male Marine units... Ground combat units with only men were faster, more lethal and less... Gingrich: Extra scrutiny puts... \"It's no longer funny,\" the ex-Speaker says of Trump's remarks. McConnell: We're voting again on... McConnell set up a procedural vote on a resolution of disapproval for next... House GOP to postpone vote on Iran... House Republicans will now meet at 4 p.m. to discuss strategy. Obama switching NY hotels amid... The iconic hotel was sold by Hilton International to a Chinese... The Hill’s Whip List: House Iran... Over a hundred House Democrats now back the Iran deal. Tanzania cannot be allowed to be... Neither Tanzania nor the West can afford to have Tanzania as the new... ", "external_links": [], "published": "2015-09-11T19:14:00.000+03:00", "crawled": "2015-09-11T19:14:42.567+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}