{"organizations": [], "uuid": "9880239f13f153fac72867d00e13899c06321844", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150913100238-ip-rubios-debate-playbook-00000814-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/22/politics/donald-trump-marco-rubio-foreign-policy-tweet/index.html", "country": "US", "title": "Donald Trump hits Marco Rubio on immigration", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Donald Trump hits Marco Rubio on immigration - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "9880239f13f153fac72867d00e13899c06321844"}, "author": "Theodore Schleifer", "url": "http://www.cnn.com/2015/09/22/politics/donald-trump-marco-rubio-foreign-policy-tweet/index.html", "ord_in_thread": 0, "title": "Donald Trump hits Marco Rubio on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights The Florida senator has tried to avoid antagonizing the brash Republican front-runner. \"Senator Marco \"amnesty\" Rubio, who has worst voting record in Senate, just hit me on national security-but I said don't go into Iraq. VISION,\" Trump tweeted Washington (CNN) Donald Trump appears to have a new target: Marco Rubio.\nThe Florida senator has tried to avoid antagonizing the brash Republican front-runner, but on Tuesday evening Rubio finally landed in Trump's crosshairs.\n\"Senator Marco 'amnesty' Rubio, who has worst voting record in Senate, just hit me on national security - but I said don't go into Iraq. VISION,\" Trump tweeted.\nSenator Marco \"amnesty\" Rubio, who has worst voting record in Senate, just hit me on national security-but I said don't go into Iraq. VISION\n— Donald J. Trump (@realDonaldTrump) September 23, 2015 Trump has a tendency to attack Republicans on the rise -- from GOP presidential rivals Jeb Bush to Carly Fiorina -- and the latest CNN/ORC poll shows an ascendent Rubio on the heels of his widely praised debate performance.\nEarlier on Tuesday, Rubio suggested in an interview on Fox News that Trump was not ready to serve as commander-in-chief given Trump's sparse foreign policy knowledge.\nBut Trump's tweet could indicate that the Florida senator has awoken the elbow-throwing Trump. Rubio has attempted to run an under-the-radar White House campaign that places little emphasis on winning the daily news cycle, and he has expressed exasperation with the media's fascination with Trump's every move. On the whole, however, Rubio has declined to tumble in the mud with Trump.\nIn return, Trump has largely avoided hitting Rubio on the stump, only chiding him for running against his mentor, former Florida Gov. Jeb Bush.\nBut the attacks that Trump now seems to have chosen are sharper: Rubio was confronted at CNN's Republican debate about his Senate attendance record, which has suffered since he launched his presidential bid.\nIt's also no surprise Trump -- who launched his campaign on a cry for tougher immigration policies -- took aim at Rubio on the issue. The Florida senator unsuccessfully lead an attempt to pass a bipartisan comprehensive immigration bill in 2013 that would have provided a path to citizenship for some undocumented immigrants, among other reforms.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics", "https://twitter.com/realDonaldTrump/status/646500785371652096"], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-23T06:20:37.568+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}