{"organizations": ["Christianity and Islam", "George Washington University", "NGO", "Chinese Ministry of State Security", "World Trade Organization", "CNN", "Office of Personnel Management", "OPM", "WTO", "White House", "Navy", "Department", "National Security Agency", "State Department"], "uuid": "839c9c8d7d268e4ff8e8488244b91b4bfdad8e64", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150922103132-obama-xi-2014-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/09/24/politics/president-obama-xi-jinping-china-awkward-topics/index.html?eref=rss_politics", "country": "US", "title": "6 awkward conversation topics for Obama, Xi", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "6 awkward conversation topics for Obama, Xi", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T02:31:00.000+03:00", "replies_count": 0, "uuid": "839c9c8d7d268e4ff8e8488244b91b4bfdad8e64"}, "author": "", "url": "http://edition.cnn.com/2015/09/24/politics/president-obama-xi-jinping-china-awkward-topics/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "6 awkward conversation topics for Obama, Xi", "locations": ["United States", "East China Sea", "Taiwan", "Washington", "America", "U.S.", "Tibet", "United States of America", "Beijing", "Asia", "China", "South China Sea", "Japan", "South Korea"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Xu Zhiyong", "Yang", "Rice", "Gao Yu", "Pu Zhiqiang", "Yang Jinjun", "Barack Obama", "Ilham Tohti", "Kuang Wanfang", "Josh Earnest", "Ben Rhodes", "John Kerry", "Obama", "Rhodes", "Jeremy Diamond", "Sandy Phan-Gillis", "Eric Bradner", "Susan Rice", "Liu Xiaobo"], "text": "The White House has threatened to sanction Chinese entities for allegedly rampant hacking Here are the six most potentially uncomfortable topics of conversation for Xi's visit Washington (CNN) Chinese President Xi Jinping arrives in Washington on Thursday for his first official state visit, and his interactions with President Barack Obama are sure to include some awkward conversations. Xi will be welcomed to the White House at two dinners -- a smaller dinner on Thursday and a state dinner on Friday -- as well as an Oval Office meeting and a press conference. Ahead of Xi's arrival, the White House has threatened to sanction Chinese entities over cyberhacking and on Wednesday released more information about the devastating hack of the Office of Personnel Management this spring that U.S. officials have blamed on the Chinese. And that's just the start of the U.S.'s tough talk leading up to the visit, which is also getting plenty of attention from 2016 presidential candidates stressing that the U.S. must be strong against China. Here are six potentially uncomfortable topics of conversation for Obama and Xi. 1. Hacking Perhaps no issue is getting more attention in the lead-up to Xi's visit than cybersecurity. The U.S. for years has accused Beijing of sponsoring and benefiting from hacking American businesses to steal valuable intellectual property -- but it starkly ramped up its harsh words as the visit drew near. The administration leaked late last month that the U.S. was preparing a slate of sanctions against Chinese individuals and entities that they allege engaged in or benefited from cybertheft of trade secrets -- a brand new sanctions power the administration created in April. Experts read the talk of possible sanctions as a signal to the Chinese to force them to address the topic while Xi is in Washington, though press secretary Josh Earnest has made clear that no sanctions are expected to come before Xi's tour. In a call with reporters Tuesday previewing the visit, Deputy National Security Adviser Ben Rhodes said that although the U.S. prefers diplomacy, cybersecurity will be \"an important\" topic of discussion, and that the U.S. will make clear that punishments are on the table. RELATED: Hackers stole 5.6 million government fingerprints -- more than estimated \"Sanctions remain the tool of the United States, and we would be prepared, if necessary, to pursue sanctions as a tool if we felt there was a case that merited that type of punitive actions,\" Rhodes said. The visit comes on the heels of the massive OPM hack announced in June -- which officials have blamed on the Chinese. On Wednesday, OPM said up to 5.6 million fingerprints were among the more than 21.5 million current, former and prospective federal employee records stolen in the hack. China has consistently denied the accusations and says it does not engage in cyberespionage. It has pointed the finger back at the United States over the National Security Agency's surveillance. In a preview of the U.S. approach to the meeting, National Security Adviser Susan Rice stressed Monday that cybersecurity was a top issue. She assured her audience at George Washington University that Obama would be raising the same issues in his private conversations. \"In his meetings with President Xi, President Obama has repeatedly made plain that state-sponsored, cyber-enabled economic espionage must stop,\" Rice said, per her prepared remarks. \"This isn't a mild irritation. It is an economic and national security concern to the United States. It puts enormous strain on our bilateral relationship, and it is a critical factor in determining the future trajectory of U.S.-China ties.\" 2. Economy China's rapid economic growth has been a source of strength for Beijing for years -- but the past month has brought tumult to the Chinese stock market and concerning economic indicators. On Wednesday, a measurement of China's essential manufacturing sector fell to a 78-month low , an indication to economists that the country's growth is running out of steam. The indicator follows major instability in the nation's and region's stock markets over concerns about China's growth, and the government has engaged in emergency measures to shore up the economy, including devaluing its currency, buying stocks and cutting interest rates. So far, the insecurity overseas has not dragged down the U.S. economy -- but there is concern that it could have a global effect. Meanwhile, Xi insisted in a speech on Tuesday that the Chinese government was operating normally and not in jeopardy. Since China's tremendous growth has been a major source of leverage for its position in the world, a tanking economy could change its position at the table. But since the U.S. could also lose out from a weakened Chinese economy, given how intertwined the counties' economies are, the Obama administration must tread carefully. 3. Naval conflict It's not just cyberspace and the economy where China and the West have clashed -- there is a danger of physical confrontation in the waters off China's shores. Beijing has taken an increasingly aggressive posture in the South China Sea and disputes over territories in the East China Sea continue to cause tension between Beijing and its neighbors. In the South China Sea, China is building a series of man-made, militarized islands 600 miles off its coastline and then claiming the surrounding air and sea rights. In the East China Sea, China has claimed sovereignty over islands -- some uninhabited -- Japan also claims. RELATED: A secret Navy flight over China's military buildup Rice addressed the conflicts Monday, saying the U.S. would not be bullied out of the waters. \"The United States takes no position on competing territorial claims, but we insist upon and will continue to underscore our fundamental national interest in preserving freedom of navigation and commerce through some of the world's busiest sea lanes,\" she said. \"The United States of America will sail, fly and operate anywhere that international law permits.\" She continued: \"We have an interest in preventing territorial disputes from growing into larger conflicts that destabilize the region. ... We call on all claimants to reciprocally halt land reclamation, construction of new facilitates and militarization of outposts on disputed areas.\" Altogether, China has sparred via words and military maneuvers with Japan, South Korea and Taiwan, strong American allies that look to the U.S. to keep China from going too far. China's aggressiveness in the region comes as the U.S. is slowly making its \"pivot to Asia\" -- a key plank of Obama's foreign policy that seeks to assert the U.S. role in Asia. 4. Human Rights Another area in which the U.S. has repeatedly and publicly chastised the Chinese government is human rights. U.S. officials have spoken out against the jailing of dissidents and the government's aggressive censorship within its borders. They have also criticized China for repressing ethnic minorities, including Muslim Uighurs and the population of Tibet. Rice made sure to raise that issue Monday, calling human rights an area of \"profound difference\" with China. \"We raise the cases of individuals like Liu Xiaobo, Xu Zhiyong, Gao Yu, Ilham Tohti, and Pu Zhiqiang, who are unjustly detained,\" she said. \"China's increasing restrictions on freedom of expression and assembly -- including their visa restrictions on American journalists -- are not only wrong; they are short-sighted. She also criticized the draft foreign NGO law that China is considering, which she said would threaten \"the very organizations that have promoted China's development and advanced the friendship between our peoples.\" And she said oppressing Tibetans and Uighurs and restricting the practice of religion, including Christianity and Islam, \"raise serious questions\" about China's commitment to human rights. On Wednesday, Secretary of State John Kerry met with a group of Chinese dissidents and relatives of dissidents at the State Department in an effort to underscore that the U.S. would not forget their cause even as it welcomed XI in a state visit. 5. Trade The U.S. has repeatedly clashed with China over its tight trade practices. Most significantly, there's the Trans-Pacific Partnership, the economic underpinning of Obama's Asian pivot. The 12-nation pact encompasses just about all of China's neighbors, including Japan. And Obama has made no secret of the fact that he sees the deal as an opportunity to assert U.S. economic influence in the region as a counter to Beijing. But the two countries are at odds in a host of other trade disputes, too -- some deep in the weeds but still important to American businesses. China for months has been an obstacle in negotiations over expanding the World Trade Organization's global agreement to drop tariffs on information technology and consumer electronics equipment. The country has also balked at a push from other WTO members, including the United States, to drop its agriculture subsidies -- putting the Geneva-based organization's reputation as a negotiating body at risk. That's just the tip of the iceberg. In recent years, the two countries have brawled over everything from rare earth minerals to tires. Rice said the U.S. wants China to put forward \"market reforms\" that would reduce barriers to foreign businesses and have it play by international rules. \"The competition must be fair,\" Rice said. \"When China's economic policies impede the free flow of commerce and worsen trade imbalances, it distorts the global economy.\" And she warned, \"When American businesses increasingly question whether the cost of doing business in China is worth it, that reduces trade and investment for everyone and undercuts the support for the U.S.-China relationship here at home.\" 6. Repatriation There's also the thorny issue of Beijing's quest to repatriate Chinese nationals to face charges in what the government characterizes as a fight against corruption. Some, though, have been concerned it's a way for Xi to eliminate opponents. The government has distributed a most-wanted list of Chinese citizens living abroad that they want brought back. Though the U.S. does not have a formal extradition treaty with China and has not publicly said it would work with China to collect its list of fugitives, several of whom are believed to be in America, it has in the past week made two high-profile repatriations. Last week, the U.S. returned a businessman on the most-wanted list, Yang Jinjun, who is suspected of corruption and bribery and had been in the United States since 2001. Then on Thursday, China announced the U.S. returned Kuang Wanfang, also in the U.S. since 2001 and accused of corruption and bribery. Yang's return last week was the first repatriation from the U.S. since the Chinese distributed their most-wanted list. Meanwhile, it was made public this week that the Chinese Ministry of State Security detained a U.S. citizen, Sandy Phan-Gillis, in China in March on accusations of spying. A state Department spokeswoman said this week that the U.S. consulate is monitoring her condition, and officials have visited her six times since her arrest, while senior officials raise concerns about the case with Beijing. CNN's Eric Bradner and Jeremy Diamond contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-09-25T02:31:00.000+03:00", "crawled": "2015-09-25T03:14:50.928+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}