{"organizations": [], "uuid": "09800192a90e4e03c56ada4ff4c02fcae581c8fd", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f6e172180000260061cf84.png?cache=61lA88i8wZ", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/news.xml", "section_title": "Latino Voices News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/trump-supporters-harass-immigration-protesters-in-iowa_55f6d6aae4b077ca094f891a", "country": "US", "title": "Trump Supporters Harass Immigration Protesters In Iowa", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Trump Supporters Harass Immigration Protesters In Iowa", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T19:47:00.000+03:00", "replies_count": 0, "uuid": "09800192a90e4e03c56ada4ff4c02fcae581c8fd"}, "author": "Tyler Kingkade", "url": "http://www.huffingtonpost.com/entry/trump-supporters-harass-immigration-protesters-in-iowa_55f6d6aae4b077ca094f891a", "ord_in_thread": 0, "title": "Trump Supporters Harass Immigration Protesters In Iowa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump Supporters Harass Immigration Protesters In Iowa Trump supporters shouted things like \"If it ain't white, it ain't right.\" Tyler Kingkade Senior Editor/Reporter, The Huffington Post Posted: 09/14/2015 12:47 PM EDT | Edited: 33 minutes ago \nA group of Donald Trump supporters erupted in cheers and shouted racist comments outside an Iowa college stadium on Saturday when a woman tore the sign an anti-Trump demonstrator was holding in half. \nA group calling themselves Students Against Bigotry staged a protest in the parking lot of Iowa State University's Jack Trice Stadium in Ames, Iowa, on Saturday during tailgating for the ISU-University of Iowa football game. Golf course aficionado and 2016 Republican presidential candidate Donald Trump was scheduled to campaign in the tailgate area, but instead made an appearance inside the stadium. \nThe ISU students were specifically protesting Trump's anti-immigrant comments , the Iowa State Daily reported. The poster that was destroyed, held by ISU senior Jovani Rubio, read, \"Our lives begin to end the day we become silent about the things that matter.\" \nThe woman who attacked the sign is from West Des Moines but is not an ISU student, according to the Iowa State Daily . She has since deleted her social media accounts. A moment before she rips the sign, she can be heard in a video saying that she's going to destroy the poster and \"vote for white supremacy.\" \nIn response to the poster being ripped, someone on camera shouts, \"Get 'em, girl!\" Others just cheer and shout, \"Yeah!\" \nCell phone videos of the incident were posted on YouTube and Twitter. I was right there when she did it. Never have I ever felt so humiliated and unsafe at this University. https://t.co/JmRafAtZXM — Michelle Ramos (@MichelleRamosav) September 12, 2015 \"If I vote for trump then am I a white supremacist?\" -trump supporter pic.twitter.com/mRXHx00m5n — Joi (@JumpforJoii) September 12, 2015 \nAnother sign that was not ripped read, \"I did not struggle for 16 years to be called an anchor baby by my future president,\" according to photos posted on Tumblr . \n\"I grew up watching a lot of the old civil rights videos and how they were treated, and I always thought, 'Wow, we've made a lot of progress.' But it was evident on Saturday that we really have not,\" Monica Reyes, a University of Northern Iowa senior and co-founder of DREAM Iowa , told The Huffington Post on Monday. \nReyes, who grew up in Iowa, said she heard people make comments that the Latino activists should \"learn to speak English.\" \n\"One of our protesters -- her face was grabbed by a caucasian woman, and that caucasian woman told her to go back from where she came from,\" Reyes said. \"One man actually said, 'If it ain't white, it ain't right.'\" \nAccording to a post on Tumblr from a woman who said she witnessed the protest, other people in the crowd shouted “Send the illegals back to where they came from!\" \"Excuse me immigrants,\" and \"Is that English or is that stupidity?\" toward a sign written in Spanish. Reyes said this description was accurate based on what she witnessed. \nThe Students Against Bigotry protesters, Reyes noted, were from multiple backgrounds and ethnicities. She said she largely blames Trump's comments about immigrants for inspiring his supporters to behave this way. \nTrump is currently polling in first place among GOP presidential contenders in Iowa and nationally. \n\"For us, it was really eye-opening to see this rhetoric,\" Reyes said. \"I've never felt this much hatred from people in Iowa. That is not something our communities are going to stand with. We don't want to feel unsafe in our own communities, but that is kind of what [Trump's] rhetoric is instigating.\" _", "external_links": [], "published": "2015-09-14T19:47:00.000+03:00", "crawled": "2015-09-14T20:32:03.742+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}