{"organizations": [], "uuid": "07d5fb81f9a55c3426440c1f41f8ef41e8a41fdd", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/09/29/castro-asks-obama-to-use-executive-power-to-ease-embargo/", "country": "IL", "title": "Castro asks Obama to use executive power to ease embargo", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Castro asks Obama to use executive power to ease embargo | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "07d5fb81f9a55c3426440c1f41f8ef41e8a41fdd"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2015/09/29/castro-asks-obama-to-use-executive-power-to-ease-embargo/", "ord_in_thread": 0, "title": "Castro asks Obama to use executive power to ease embargo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  EFE Cuba's Raul Castro asked U.S. President Barack Obama to use his executive power to ease the economic embargo on the island if he wants to continue making progress in normalizing relations.\nCuban Foreign Minister Bruno Rodriguez related the Cuban leader's comment after the two presidents met at United Nations headquarters.\n\"The pace of the process toward normalization of relations between Cuba and the United States will depend on the lifting of the blockade,\" Rodriguez said, adding that the executive decisions taken by Obama up to now \"have a very limited value, a very limited scope.\"\nThe U.S. president has executive powers that \"are very broad, and they deal with tens of areas,\" and they permit him to substantially modify many elements of the embargo, the foreign minister said.\nAccording to Rodriguez, Obama's actions in that regard have not yet made any significant change in the embargo against Cuba.\nSince the announcement last December of a process to normalize bilateral relations, Obama has asked without success that the Republican-controlled Congress eliminate the economic embargo imposed on Cuba in 1962.\nCastro, in his speech this Monday before the U.N. General Assembly, made it clear that the normalizing of ties will only be achieved, among other things, \"with the end of the economic, commercial and financial blockade\" against Cuba.\nIn Tuesday's meeting, the second that the two presidents have held since the normalization process got underway, the Cuban leader repeated Havana's \"willingness to work to build a new kind of relations between the two countries.\"\nThe meeting, the foreign minister said, was held in a \"respectful and constructive climate\" and served to exchange impressions about Pope Francis's visit to the two countries, cooperation in mutually beneficial areas, and dealing with problems that are still pending.\nRodriguez recalled that the two countries now have an ongoing dialogue on numerous matters such as the environment, the war on drugs, search and rescue operations for people lost at sea, terrorism and health.\nCuba also said it is ready to discuss the process of economic reparations to resolve the demands that the two countries are making against each other.\nThe foreign minister said, however, that Washington and Havana continue having major differences.\nAmong other things, Rodriguez recalled that his government considers the return of the territory occupied by the U.S. Navy base at Guantanamo to be a high-priority element in the normalization process.\nBut at the same time, he said there remains \"an opportunity of making significant advances in the normalization of bilateral relations during Obama's administration.\"\nRodriguez recalled that Castro considers Obama an \"honest man\" and that he admires \"his humble origins\" and said that the meetings between the two have always been \"cordial.\" EFE", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T07:32:00.435+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}