{"organizations": [], "uuid": "312da613d2b7da297ec5b5c0135fe97574c037a2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/trumpvictory.jpg", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/video/in-the-news/253743-lawmaker-president-trump-more-entertaining-than-obama", "country": "US", "title": "Lawmaker: President Trump ‘more entertaining’ than Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Lawmaker: President Trump ‘more entertaining’ than Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T00:38:00.000+03:00", "replies_count": 0, "uuid": "312da613d2b7da297ec5b5c0135fe97574c037a2"}, "author": "Molly K. Hooper", "url": "http://thehill.com/video/in-the-news/253743-lawmaker-president-trump-more-entertaining-than-obama", "ord_in_thread": 0, "title": "Lawmaker: President Trump ‘more entertaining’ than Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Past: 1 day Sanders goes on the attack against... The Vermont socialist links Ciinton to negative remarks by a super-PAC. Colbert presses Justice Breyer to... Breyer said oral arguments make up only about 5 percent of the decision... House conservatives warm to... Lawmakers discuss potential McCarthy-conservative coalition. Obama hits 'coddled' liberal... Obama said students don't have to be \"protected from different points of... New Planned Parenthood video... The videos have spurred calls to cut off Planned Parenthood funding. Dems block Iran bill for second... Sen. John Cornyn said that additional votes on Iran this week are \"still... Trump locks up Gary Busey... The eccentric actor starred alongside the candidate in two seasons of \"... Is Trump the beginning of the end... Trump is a notorious flip flopper with no clear beliefs, except in himself. Sanders speaks to Christian... “It is easy to go out and talk to people who agree with you,” says Sanders. Rubio talks football ... and... The GOP presidential candidate said Peyton Manning could be a good... McConnell threatens to bring... The GOP leader is warning Democrats not to block a resolution disapproving... Dick Morris: Is Biden inevitable? OPINION | The vice president may have to run in 2016 — ready or not. Trainwreck: Obama’s foreign policy... This Libya fiasco is not an isolated example of Obama’s foreign policy mis... Corker: Senate could override veto... The Tennessee Republican says an extension of a sanctions law would have... Oversight subpoenas unedited... House lawmakers want to see all the footage in the Center for Medical...", "external_links": [], "published": "2015-09-16T00:38:00.000+03:00", "crawled": "2015-09-16T03:10:16.393+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}