{"organizations": [], "uuid": "6ee3d8af6458ecdd2470f2691d46d955959d87a9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d69f5f170000b700568235.jpeg", "site_section": "http://www.huffingtonpost.com/tag/medical-marijuana/feed", "section_title": "Medical Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/entry/larry-harvey-famed-washington-medical-marijuana-patient-dies-from-cancer_55d69f1de4b0f593f7f6ec50?kvcommref=mostpopular", "country": "US", "title": "Larry Harvey, Famed Washington Medical Marijuana Patient, Dies From Cancer", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Larry Harvey, Famed Washington Medical Marijuana Patient, Dies From Cancer", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T10:31:00.000+03:00", "replies_count": 0, "uuid": "6ee3d8af6458ecdd2470f2691d46d955959d87a9"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/larry-harvey-famed-washington-medical-marijuana-patient-dies-from-cancer_55d69f1de4b0f593f7f6ec50?kvcommref=mostpopular", "ord_in_thread": 0, "title": "Larry Harvey, Famed Washington Medical Marijuana Patient, Dies From Cancer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Larry Harvey, Famed Washington Medical Marijuana Patient, Dies From Cancer \"He fearlessly confronted the federal government head on and beat the Department of Justice.\" Matt Ferner National Reporter, The Huffington Post Posted: 08/21/2015 07:31 AM EDT MCT via Getty Images \nLarry Harvey, a Washington state medical marijuana patient who had faced 10 years in prison in a high-profile federal pot case, died Thursday at age 71, a family spokeswoman said. \nHarvey succumbed to pancreatic cancer in Colville, Washington, Kari Boiter, a medical marijuana activist and spokeswoman for the family, told HuffPost. \nFederal prosecutors dropped all charges against Harvey six months ago in the medical marijuana case because of his terminal cancer diagnosis . The case also included three members of Harvey’s family and a family friend. All were certified medical marijuana patients who grew marijuana near their home for personal medical use. \nThe family issued this statement on Harvey's death: \nLarry will be remembered as a fighter until the bitter end. He fearlessly confronted the federal government head on and beat the Department of Justice, against all odds. In a so-called justice system where less than two-percent of defendants walk free, Larry was able to leave the federal courthouse with his head held high after the U.S. Attorney dropped all charges against him. Larry’s triumph was made all the more satisfying when the Feds were forced to return his beloved motorcycle, confiscated in the 2012 raid of Larry’s family home. \n\nThough cancer ultimately took Larry from us far too soon, his final months on Earth were spent creating cherished memories with loved ones near and far. With terms of federal probation fully lifted, Larry took full advantage of traveling freely once again. The weeks prior to his death were spent with family in Yakutat, Alaska, and earlier this summer, Larry was able to visit his mother in Sumas, Washington and go camping at Mudget Lake, one of his favorite spots. And he never missed the chance to take his motorcycle out for a spin. \n\nLarry will be greatly missed by all who were blessed to know him. Friends and family are finding solace in the remarkable legacy that he’s left behind. \nIf Harvey had been convicted, he wouldn't have lived long enough to see prison, let alone serve out his sentence. Three other defendants -- Harvey’s wife, son and daughter-in-law -- were found not guilty of seven marijuana-related charges, but were convicted of illegally growing fewer than 100 marijuana plants. \nThe family friend accepted a deal to plead guilty to conspiracy and was sentenced to 16 months in prison. Harvey’s family members still may face prison when they are sentenced in October. \nState authorities raided the Harvey home in 2012 and found more than 70 marijuana plants growing near the house. The defendants maintained that the marijuana patch complied with state law and the plants were for their own medical use. Washington state, which legalized medical marijuana in 1998 and recreational marijuana in 2012, allows for home growing of cannabis for personal use. \nIn court, a federal judge barred the defendants from arguing that their cannabis plants were legal under state law. Because marijuana is illegal under federal law, U.S. courts generally don't allow evidence that the drug may have been used for medical purposes. \nStill, the U.S. Justice Department has offered guidance to federal prosecutors urging them to refrain from targeting state-legal marijuana operations. To date, 23 states and the District of Columbia have legalized marijuana for medical purposes. Four states, as well as D.C., have legalized recreational marijuana. \nAdditionally, a federal spending bill signed by President Barack Obama in December prohibits the Justice Department from using funds to go after state-legal medical marijuana programs. Harvey's attorney argued in a motion to dismiss all charges that the provision protects patients from federal prosecution. But a judge ultimately rejected the argument . \nReps. Dana Rohrabacher (R-Calif.) and Sam Farr (D-Calif.), the congressmen behind the federal provision protecting state-legal medical marijuana operations, are seeking an investigation into the DOJ’s continued crackdown on medical marijuana patients and providers. \nIn a letter addressed to DOJ Inspector General Michael Horowitz, the lawmakers cite the continued federal pursuit of the Harvey family as a “direct violation” of what is now federal law. \nAlso On HuffPost: 27 Reasons Why U.S. Shouldn't Lead The War On Drugs of", "external_links": [], "published": "2015-08-21T10:31:00.000+03:00", "crawled": "2015-08-21T16:30:04.289+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}