{"organizations": [], "uuid": "82709c9819669812051153e58bb93b49108fa789", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f8bd2c20000026002423e6.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/entertainment/index.xml", "section_title": "Entertainment - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/joe-biden-donald-trump-immigration_55f8bc0ee4b0b48f670139b5", "country": "US", "title": "Joe Biden Slams Donald Trump For Selling 'Sick Message' On Immigration", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Joe Biden Slams Donald Trump For Selling 'Sick Message' On Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:52:00.000+03:00", "replies_count": 0, "uuid": "82709c9819669812051153e58bb93b49108fa789"}, "author": "Marina Fang", "url": "http://www.huffingtonpost.com/entry/joe-biden-donald-trump-immigration_55f8bc0ee4b0b48f670139b5", "ord_in_thread": 0, "title": "Joe Biden Slams Donald Trump For Selling 'Sick Message' On Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email Joe Biden Slams Donald Trump For Selling 'Sick Message' On Immigration \"There's one guy absolutely denigrating an entire group of people, appealing to the baser side of human nature, working on this notion of xenophobia in a way that hasn't occurred in a long time.\" By Roberta Rampton Posted: 09/15/2015 08:52 PM EDT \nWASHINGTON, Sept 15 (Reuters) - U.S. Vice President Joe Biden on Tuesday said Republican presidential contender Donald Trump was selling a \"sick message\" about immigrants in America based on xenophobia. \nBiden, considering a run for the 2016 Democratic presidential nomination, told a small group of Latinos gathered at his home that they should not lose heart watching Trump climb in the polls while taking a hard line on immigration. \nTrump, leading the pack of Republicans seeking their party's 2016 nomination, has accused Mexico of sending criminals and rapists to the United States. He has promised to build a wall on the U.S.-Mexico border to keep out illegal immigrants and deport the 11 million illegal immigrants already in the United States. \nBiden told his guests that he had seen Trump talking on television just before speaking to the poolside cocktail party, and decided to cast aside remarks his staff had prepared recognizing Hispanic Heritage Month. \n\"There's one guy absolutely denigrating an entire group of people, appealing to the baser side of human nature, working on this notion of xenophobia in a way that hasn't occurred in a long time,\" Biden told the group of about 75 people. \n\"This isn't about Democrat - Republican. It's about a sick message. This message has been tried on America many times before. We always, always, always, always overcome,\" he said. NICHOLAS KAMM via Getty Images \nBiden, who is Catholic, urged the group not to feel \"down\" about Trump's popularity, noting that Pope Francis was about to visit the United States and likely would have a very different message about welcoming immigrants. \n\"The American people are with us. I know it doesn't feel that way. But I'm telling you, the American people agree with us,\" Biden said. \nBiden, whose son Beau died recently, has said he is not sure he has the emotional capacity to make what would be his third run for president. \nHis poll numbers have climbed as he explores the possibility and as the Democratic frontrunner, Hillary Clinton, grapples with a controversy over her use of a private email server while secretary of state. \nAt the end of his remarks, a few people in the crowd shouted, \"Run Joe, run!\" \nBiden, making the sign of the cross as he hurried away from the podium, said \"Oh no, no, no, no, no\" as if to stave off the topic. \n(Editing by Will Dunham)", "external_links": [], "published": "2015-09-16T03:52:00.000+03:00", "crawled": "2015-09-16T04:18:12.380+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}