{"organizations": [], "uuid": "8baab31a2c86702ba6acab0eae7c74fa4e33f13c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/090315_hn_congress.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,0,00.rss", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/world/2015/09/03/iran-thumbs-nose-at-us-even-as-obama-rallies-support-for-nuke-deal/", "country": "US", "title": "Iran thumbs nose at US even as Obama rallies support for nuke deal", "performance_score": 10, "site": "foxnews.com", "participants_count": 28, "title_full": "Iran thumbs nose at US even as Obama rallies support for nuke deal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 30, "uuid": "6331e421e815b8dca9683730b11f79752e8d1e41"}, "author": "Paul Alster", "url": "http://www.foxnews.com/world/2015/09/03/iran-thumbs-nose-at-us-even-as-obama-rallies-support-for-nuke-deal/#post-0", "ord_in_thread": 0, "title": "Iran thumbs nose at US even as Obama rallies support for nuke deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Paul Alster \nPublished September 03, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print \nEven as President Obama was securing the Senate support necessary to assure passage of the nuclear deal with Iran, Tehran's top defense officials were scoffing at U.S. claims the pact will restrict the Islamic Republic's military ambitions.\nThe president has been twisting arms and Secretary of State John Kerry reassuring lawmakers that the deal between Iran and the P5 +1 - members of the UN Security Council plus Germany - will ensure international inspections and bar Iran from ever developing nuclear weapons. This week, Sen. Barbara Mikulski, D-Md., became the 34th member of the Senate to back the controversial and unpopular deal, meaning that if it is defeated in a vote as expected, Obama will have enough support to sustain his certain veto. But Iran's military brass has answered the U.S. nose-counting by thumbing their nose at America.\n“Iran does not plan to issue permission for the [International Atomic Energy Agency] to inspect every site,\" Iranian Defense Minister Brig. Gen. Hossein Dehqan told Al Mayadeen News Wednesday. \"U.S. officials make boastful remarks and imagine that they can impose anything on the Iranian nation because they lack a proper knowledge of the Iranian nation.”\n\"U.S. officials make boastful remarks and imagine that they can impose anything on the Iranian nation because they lack a proper knowledge of the Iranian nation.”\n- Iranian Defense Minister Brig. Gen. Hossein Dehqan\nIran’s official FARS news agency added that “Dehqan had earlier underlined that Tehran would not allow any foreigner to discover Iran's defensive and missile capabilities by inspecting the country's military sites.”  \nOn the same day, a top Iranian general told troops preparing for a massive military drill involving up to 250,000 men that “the U.S. and the Zionists should know that the Islamic Revolution will continue enhancing its preparedness until it overthrows Israel and liberates Palestine.”\n\nRelated Image Expand / Contract Iranian Defense Minister Hossein Dehqan vowed that international inspectors will not have access to key sites. (Reuters) \n\nThe bluster from Iran is in sharp contrast to the message Obama and Kerry conveyed to lawmakers to line up support for the deal, which lifts international sanctions and frees up $150 billion in Iranian funds frozen when the Islamic Republic took 52 Americans hostage for 444 days beginning in 1979. Over the following three decades, Iran has, according to U.S. officials, been the world's leading state sponsor of terrorism while constantly calling for war with Israel and America. In return, Iran agreed to allow international inspectors to monitor its facilities and ensure that it did not build nuclear weapons. But troubling conditions have emerged, including that Iran will not allow Americans to take part in the inspections and will conduct its own monitoring of the key Parchin military site and turn over findings to international inspectors.\nObama has gone to great lengths to assure skeptics that the deal assures genuine oversight of the Iranian nuclear program, and in an August 19 letter to Rep. Jerrold Nadler, D-N.Y., he said the deal is the best chance to keep Iran from getting nuclear weapons, which he acknowledged would pose a major threat to Israel.\n\"It is my steadfast conviction that a nuclear-armed Iran would present a profound security threat to us and to our partners, particularly Israel,” Obama wrote.\nCritics of the deal wonder why its supporters listen to Obama regarding Iran's intentions and ignore Iran.\n“Within the last 24 hours, Iran has said that the U.S. is the enemy of mankind,\" said Benjamin Weinthal, a research fellow at the Washington-based Foundation for Defense of Democracies. \"These highly jingoistic statements from Iran don’t bode well for the enforcement of the agreement.\n“There is all this euphoria about Obama securing congressional support for the Iran nuclear deal, but I think it’s worth pointing out that in context a little more than one-third of the Senate supports the deal,\" Weinthal added. \"Given that all the major attitude surveys in the U.S. show a majority of Americans oppose the deal, and a majority of the Senate and the House of Representatives oppose the deal, [Obama] is on very flimsy ground.”\nThe deal is deeply unpopular in Israel, which has been the target of Iranian threats for years, as well as attacks from the terrorist groups it funds. Israelis fear that the cash infusion to Iran, through unfreezing of funds and the lifting of economic sanctions, will result in new terror attack in the short term and a graver, nuclear threat in the future. \n“We are not against a deal,” a spokesman for Israel’s foreign ministry told FoxNews.com. “We are against this particular deal, because it does not cater to the real dangers represented by Iran. A stronger deal, which would encompass not only the nuclear aspect but also the terrorist activities of Iran, would have been much better.”\nOfficials in Jerusalem also note that a significant majority of the American public oppose the deal and sympathize with Israel’s predicament.\n“The American people get it,” an official Israeli source told today’s Jerusalem Post. “They understand the dangers to Israel. Iranian leaders openly say they will continue their terrorism and aggression, and they will now – with the sanctions relief – have enhanced resources to do, so because the deal will give them billions of dollars.”\n\nPaul Alster is an Israel-based journalist. Follow him on Twitter @paul_alster and visit his website: www.paulalster.com .", "external_links": [], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-04T00:40:02.161+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}