{"organizations": ["GOP", "Catholic Church", "CNN"], "uuid": "e5e9a48302a349b398903dff6f2a927c85512e2d", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150921173421-pope-u-s-politics-large-169.jpg", "site_section": "http://feeds.feedburner.com/google/AOpN", "section_title": "obama news - Google News", "url": "http://edition.cnn.com/2015/09/22/politics/pope-francis-obama-white-house-meeting/", "country": "IL", "title": "What the Pope and Obama will talk about - CNN", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "What the Pope and Obama will talk about - CNN", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T13:06:00.000+03:00", "replies_count": 0, "uuid": "e5e9a48302a349b398903dff6f2a927c85512e2d"}, "author": "", "url": "http://edition.cnn.com/2015/09/22/politics/pope-francis-obama-white-house-meeting/", "ord_in_thread": 0, "title": "What the Pope and Obama will talk about - CNN", "locations": ["Cuba", "Washington", "U.S.", "Israeli-Palestinian", "Syria", "Lebanon", "Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Castro", "Francis", "Raul Castro", "Obama"], "text": "MUST WATCH The man who became Pope Francis 02:39 He noted that the Pope has \"a deep interest\" in the Israeli-Palestinian conflict, events in Syria and Lebanon, and the potential persecution of Christians. Obama, for his part, told Francis, \"It is central to U.S. foreign policy that we protect the interests of religious minorities around the world.\" The Pope's trip to Washington, however, comes on the heels of his visit to Cuba, so the island nation is expected to be high on the list of international topics Obama and Francis discuss. The U.S. reestablished diplomatic relations with Cuba only this summer, with the Pope urging a reconciliation between the two governments. He met with the Castro brothers while on the island over the weekend. Another key issue in the news likely to feature in the Pope's White House visit is immigration, a subject that the two also addressed in their earlier meeting. \"He is very mindful of the plight of so many immigrants who are wonderful people, working hard, making contributions, many of their children are U.S. citizens, and yet they still live in the shadows, in many cases have been deported and are separated from families,\" Obama said of Francis' comments to him at the Vatican. READ: The Pope vs. the GOP The Pope has strongly urged Catholics throughout Europe to reach out to and even take in the massive numbers of Syrian refugees currently seeking refuge from their war-torn country. The Vatican itself is housing a Syrian family, and has asked churches to do the same. The U.S. has committed to taking in about 10,000 more Syrian refugees in the next fiscal year, with more expected after that, while some smaller nations have committed to take in tens of thousands. It's not clear how the Pope will address that discrepancy. But the pontiff seems to focus more on common ground in meetings with leaders, with stickier issues tending not to come up in a confrontational way. In Cuba, rather than harshly rebuking the Castro regime for its decades of restricting freedom for its people, President Raul Castro walked away telling reporters how the Pope makes him consider returning to the Catholic Church and praying again. As Obama described it last year, \"We actually didn't talk a whole lot about social schisms in my conversations with His Holiness. In fact, that really was not a topic of conversation.\" He added, \"I don't think that His Holiness envisions entering into a partnership or a coalition with any political figure on any issue. His job is a little more elevated. We're down on the ground dealing with the often profane, and he's dealing with higher powers.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> White House news", "external_links": [], "published": "2015-09-22T13:06:00.000+03:00", "crawled": "2015-09-22T16:09:39.838+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}