{"organizations": ["Treasury Department", "OPM", "Congress", "GOP", "The Washington Post", "White House"], "uuid": "158d5dfddae4f7e58234827b4a02e2c8d547d22b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/joewilson_cspan_itk.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/cybersecurity/254121-gop-resolution-presses-obama-to-sanction-china", "country": "", "title": "GOP presses Obama to sanction China for hacking | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "GOP presses Obama to sanction China for hacking | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T01:21:00.000+03:00", "replies_count": 0, "uuid": "158d5dfddae4f7e58234827b4a02e2c8d547d22b"}, "author": "", "url": "http://thehill.com/policy/cybersecurity/254121-gop-resolution-presses-obama-to-sanction-china", "ord_in_thread": 0, "title": "GOP presses Obama to sanction China for hacking | TheHill", "locations": ["United States", "Washington", "The Hill", "U.S.", "Beijing", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jinping", "Randy Forbes", "Joe Wilson", "Katie Bo Williams", "Forbes", "Obama", "Wilson"], "text": "GOP presses Obama to sanction China for hacking C-SPAN By Katie Bo Williams - 09/17/15 05:52 PM EDT Reps. Joe Wilson (R-S.C.) and Randy Forbes (R-Va.) on Friday will introduce a resolution urging President Obama to levy economic sanctions against Chinese businesses and state-backed entities that hack U.S. interests. The resolution, obtained by The Hill, comes just days after a senior White House official told The Washington Post that the U.S. will not impose sanctions before President Xi Jinping's state visit next week — but that such penalties are still on the table. ADVERTISEMENT “[I]t is the sense of Congress that the President should apply punitive economic sanctions to Chinese businesses and state-owned enterprises as a result of documented Chinese cyberattacks against United States entities in order to punish and deter such actions and strengthen the United States’ cybersecurity,” the measure reads. The president has been under increasing pressure to take a more offensive stance on cyber espionage where China is concerned, with rhetoric among lawmakers reaching a fever pitch in the wake of the Office of Personnel Management (OPM) hack that exposed millions of federal workers’ information. The breach has been widely attributed to Beijing. In early September, Wilson and Forbes called on Obama to move forward with sanctions, accusing the administration of an “incoherent deterrent strategy” when it comes to state-backed cyber espionage. “A clear and unwavering line needs to be drawn by your Administration in protecting the intellectual property and personal data of U.S. based companies, as well as government data and personnel information,” Wilson and Forbes wrote in a letter to the White House. Obama on Wednesday used some of his strongest language to date with regards to China’s behavior in cyberspace, hinting he would make use of an April executive order giving the Treasury Department the authority to sanction companies suspected of cyber espionage. \"We are preparing a number of measures that will indicate to the Chinese that this is not just a matter of us being mildly upset,” he said during a speech to the Business Roundtable in Washington. “We are prepared to take some countervailing actions to get their attention.” Unnamed senior White House officials said any sanctions would most likely be targeted at Chinese companies, not Beijing — and that the OPM hack would not be one of the actions subject to sanctions. Policy experts say this is because the administration draws a distinction between hacking for commercial gain and hacking for traditional intelligence purposes. Most reports indicate that the sanctions would address only the former. Forbes and Wilson’s resolution would put congressional opinion on the record when it comes to sanctioning China, but would not force any action by the White House. “The world must see that attacking American families, whether through conventional methods or emerging tactics, such as cyberattacks, should be exposed,\" Wilson said in a statement to The Hill. \"It is clear that there are Chinese businesses and state-owned enterprises that can be linked to cyberattacks against United States. I’m introducing a resolution tomorrow to urge the President to apply economic sanctions to send a clear message — this is dangerous to American families.\" Xi is scheduled to arrive Sept. 25. The White House has reported that the president will address China’s digital behavior as one of the top discussion topics of the meeting. Tags: ", "external_links": [], "published": "2015-09-18T01:21:00.000+03:00", "crawled": "2015-09-18T01:20:40.582+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}