{"organizations": [], "uuid": "76541c50e405d853795a3227948a7c45d548c2e8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e716171d0000d101146999.jpeg?cache=PNKepJTGWa", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/index.xml", "section_title": "Latino Voices - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/where-pope-francis-really-stands-on-issues_55e711cbe4b0b7a9633b0a22", "country": "US", "title": "Where Pope Francis Really Stands On Issues Like Abortion, Divorce, And Gay Marriage", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Where Pope Francis Really Stands On Issues Like Abortion, Divorce, And Gay Marriage", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T16:24:00.000+03:00", "replies_count": 0, "uuid": "76541c50e405d853795a3227948a7c45d548c2e8"}, "author": "Carol Kuruvilla", "url": "http://www.huffingtonpost.com/entry/where-pope-francis-really-stands-on-issues_55e711cbe4b0b7a9633b0a22", "ord_in_thread": 0, "title": "Where Pope Francis Really Stands On Issues Like Abortion, Divorce, And Gay Marriage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Where Pope Francis Really Stands On Issues Like Abortion, Divorce, And Gay Marriage Here's what you need to know. The Associated Press Posted: 09/03/2015 09:24 AM EDT \nVATICAN CITY (AP) — Pope Francis is expected to raise issues ranging from climate change to income inequality when he visits Cuba and the United States Sept. 19-27. Francis has launched an agenda of reform in the Vatican and in the global church, prioritizing different issues and counseling a more merciful message. Here's a primer on where the pope stands on key issues. ABORTION ANDREAS SOLARO via Getty Images \nFrancis has upheld church teaching opposing abortion and echoed his predecessors in saying human life is sacred and must be defended . But he has not emphasized the church's position to the extent that his predecessors did, saying by now the church's teaching on abortion is well-known. In an indication of his mercy-over-morals position, Francis says he is letting all priests in the church's upcoming Year of Mercy absolve Catholics who committed the \"sin of abortion\" if they seek forgiveness with a \"contrite heart.\" He says God's forgiveness cannot be denied to those who repent. CAPITALISM ALBERTO PIZZOLI via Getty Images \nFrancis has been accused by some U.S. conservative commentators of Marxist sympathies given his frequent denunciations of economic systems that \"idolize\" money over people and the failings of the trickle-down economic theory. He has said while globalization has saved many people from poverty \"it has condemned many others to die of hunger because it's a selective economic system.\" Francis has said he's not preaching communism but the Gospel. Pope Benedict XVI voiced the exact same concerns, and in 2009 denounced the profit-at-all-cost mentality blamed for bringing about the global financial meltdown and called for a new world financial order guided by ethics and the search for the common good. CELIBACY ANDREAS SOLARO via Getty Images \nFrancis said last year that celibacy for priests \"is a rule of life, which I highly esteem and I believe is a gift for the church.\" But he added, \"since it is not a dogma of faith, the door is always open\" to discussing the issue. In the book \" On Heaven and Earth ,\" the pope, when he was Cardinal Jorge Bergoglio, said he was in favor of maintaining celibacy \"for the moment,\" but noted the Eastern Rite Catholic church makes celibacy optional. CONTRACEPTION ALBERTO PIZZOLI via Getty Images \nFrancis has defended the church's opposition to artificial contraception, which is enshrined in the 1968 encyclical Humanae Vitae. At the same time, he has said Catholics need not breed \" like rabbits \" and should instead practice \"responsible parenthood\" through \"licit\" methods. The church endorses the Natural Family Planning method , which involves monitoring a woman's cycle to avoid intercourse when she is ovulating. He has also said, though, that any good priest in confession must dispense mercy and take into account the individual needs of couples. WOMEN ASSOCIATED PRESS \nFrancis has called for a greater role for women in the governance of the church, repeatedly praising the \"feminine genius\" and saying women simply look at the world differently and ask questions that \"we men just don't get.\" But he has reaffirmed the all-male priesthood and said a woman cannot head a major Vatican congregation, since that position is usually reserved for a cardinal. He has also elicited cringes with some tone-deaf comments, such as when he called new female members of the church's most prestigious theological commission \"strawberries on the cake.\" DEATH PENALTY ASSOCIATED PRESS \nFrancis has gone beyond his predecessors — and official Catholic Church teaching — in saying there is simply no justification for the death penalty today. He has said it is \"inadmissible regardless of how serious the crime.\" He has called life prison terms a \"hidden death penalty\" and solitary confinement a \" form of torture \" — and said both should be abolished. He famously washed the feet of female and Muslim inmates weeks after he was elected. The United States is in the Top 10 list of countries that still execute people, along with China, Iran, Iraq, Saudi Arabia, Somalia, Sudan and North Korea. LGBT PEOPLE ASSOCIATED PRESS \nFrancis famously uttered \" Who am I to judge ?\" when asked in 2013 about a Vatican monsignor who purportedly had a gay lover in his past. Many took the comment to be a sweeping new opening by the church toward gays, as Francis has urged the church to be less judgmental and more merciful in welcoming saints and sinners alike. Asked about his position on homosexuality later, Francis stressed that when he said \"Who am I to judge\" he was merely repeating church teaching, and he responded with a question of his own : \"When God looks at a gay person, does he endorse the existence of this person with love, or reject and condemn this person? We must always consider the person.\" But while he has met on several occasions with gays and even counseled a transgender couple , Francis hasn't changed official church teaching that while gays should be treated with dignity and respect, homosexual acts are \" intrinsically disordered.\" GAY MARRIAGE PABLO PORCIUNCULA via Getty Images \nAs archbishop of Buenos Aires before becoming pope, he opposed efforts to legalize same-sex marriage and proposed, unsuccessfully, that the country approve civil unions instead. As pope, Francis has upheld church teaching that marriage is a union between man and woman, said children deserve to grow up with a father and mother and praised the \" complementarity \" of the male and female bodies. He has denounced what he calls the \" ideological colonization \" of the developing world — a reference to how ideas about contraception and gay rights are often imposed on poor nations as a condition for development aid. DIVORCE ANDREAS SOLARO via Getty Images \nFrancis has divided the church by opening debate on whether divorced and civilly remarried Catholics can receive Communion. Church teaching holds that, without a church-issued annulment declaring the initial marriage invalid, these Catholics are committing adultery and thus cannot receive the sacrament. Francis has called for a more merciful approach, insisting that these Catholics are not excommunicated and must be welcomed into the church. DRUGS VINCENZO PINTO via Getty Images \nFrancis has called drug addiction \" evil \" and condemned the legalization of recreational drugs as a flawed and failed experiment. He has said the drug problem cannot be solved by liberalizing laws, as has been done in some U.S. states and many other countries, but by addressing the problem underlying addiction: social inequality and lack of opportunities for young people. Francis has years of personal experience ministering to addicts in the drug-laden slums of the Argentine capital. EMERITUS POPE BENEDICT XVI ASSOCIATED PRESS \nFrancis has said having Benedict in the Vatican is like having a \" wise grandfather \" living at home, part of his belief that the elderly have a wealth of experience to offer younger generations. Francis often pays a courtesy visit to Benedict's converted monastery on the other side of the Vatican gardens before leaving on a papal trip. Francis has coaxed Benedict out of the monastic retirement he envisaged for himself, urging him to take part in the public life of the church. Benedict has obliged, participating in events such as the joint canonizations of Sts. John Paul II and John XXIII. ENVIRONMENT NORBERTO DUARTE via Getty Images \nFrancis became the first pope ever to use scientific data in a major teaching document by calling global warming a largely man-made problem driven by overconsumption in his landmark encyclical \"Laudato Si\" (Praise Be). In the document, Francis denounced a \"structurally perverse\" world economic system and an unfettered pursuit of profit that exploits the poor and risks turning the Earth into an \"immense pile of filth.\" He is expected to speak about climate issues at the United Nations. While he has gotten a lot of attention for his encyclical, a long list of popes before him called for better care for God's creation, including Pope Benedict XVI who was dubbed the \"green pope\" for his environmental initiatives. IMMIGRATION ASSOCIATED PRESS \nFrancis has denounced the \" globalization of indifference \" that the world shows migrants and urged Europe and other countries to open their doors to refugees seeking better lives. \"We cannot allow the Mediterranean to become a vast cemetery!\" he has told European lawmakers. He has decried the \"inhuman\" conditions facing migrants crossing the U.S.-Mexico border and encouraged frontier communities to not judge people by stereotypes but rather welcome migrants and work to end discrimination. INDIGENOUS ASSOCIATED PRESS \nFrancis has apologized for the sins and \"crimes\" of the church against indigenous peoples during the colonial conquest of the Americas. But he has also held up as a model economic system the Jesuit-run missions in Paraguay that brought Christianity and European-style education and economic organization to the natives in the 17th and 18th centuries. Some American Indian and Native American groups have opposed Francis' plan to canonize the 18th-century missionary, Junipero Serra, during his U.S. trip. They accuse Serra of forced conversions, enslaving converts and helping wipe out indigenous populations. The church considers Serra a great evangelizer who established 21 missions across California. NUNS VINCENZO PINTO via Getty Images \nUnder Francis' tenure, two sweeping Vatican investigations into U.S. nuns that had elicited alarm among sisters and outrage among liberal Catholics ended amicably. The investigations were launched during Pope Benedict XVI's pontificate amid concern by conservative U.S. bishops and lay Catholics that the sisters, whose numbers have declined sharply in recent decades, had become too feminist and secular and weren't emphasizing church teaching on abortion and homosexuality enough. The first probe, into the quality of life of American sisters, ended up praising the nuns for their selfless work caring for the poor. The second one, into the main umbrella group of U.S. sisters, ended two years early with the Vatican declaring mission accomplished without any major changes. RESIGNATION PABLO PORCIUNCULA via Getty Images \nFrancis has said he expects his pontificate will be brief — maybe five years — and he has signaled he would follow in Pope Benedict's footsteps and resign if he found he didn't have the strength to carry on. He has praised Benedict for what he called his noble, humble and courageous gesture in retiring, and said the German pontiff set the precedent by \"opening the door to retired popes.\" SEX ABUSE ASSOCIATED PRESS \nFrancis was initially accused by victims' advocates of not \"getting it\" as far as clerical abuse was concerned. He has since created a commission of experts , including two survivors of abuse, to advise the Vatican on best practices and accepted the commission's recommendation to create a Vatican tribunal to prosecute bishops who failed to protect their flock from abusive priests. Francis has accepted the resignations of two U.S. bishops accused of cover-up, Archbishop John Nienstedt of Minneapolis and Bishop Robert Finn of Kansas City. However, even members of Francis' abuse commission objected publicly when he appointed a Chilean bishop accused of covering up for the country's most notorious pedophile. VATICAN REFORM ANDREAS SOLARO via Getty Images \nFrancis was elected on a mandate to restructure the outdated Vatican bureaucracy and reform the scandal-marred Vatican bank. He named nine cardinals from around the globe to advise him and created commissions of inquiry, involving outside experts and consultants, to propose a more efficient, transparent and accountable administration for the church and its assets. Two years on, the biggest change has been the creation of a new Secretariat for the Economy to put the Holy See's finances in order. \n﻿ ﻿Also On HuffPost:", "external_links": [], "published": "2015-09-03T16:24:00.000+03:00", "crawled": "2015-09-03T16:49:12.937+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}