{"organizations": ["CNN"], "uuid": "4a00310d716c93862a3bc8b4582f8a9cfbd81c7e", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/08/30/WE01235207/3675312/externalimagesmedia27998-3675312_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1267371", "country": "", "title": "Meeting Obama, 2012 - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Meeting Obama, 2012 - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "4a00310d716c93862a3bc8b4582f8a9cfbd81c7e"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1267371", "ord_in_thread": 0, "title": "Meeting Obama, 2012 - CNN iReport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "By rosehips What's Newsiest? The \"newsiest\" iReports are sorted in lists at the top of each section on the homepage and in other places around the site. Newsiest is a calculation that combines freshness, popularity, activity and ratings. The idea behind newsiest is that all the contributions the CNN iReport community of users make to the site - stories, comments, ratings, pageviews - and what CNN producers pick for their own stories could add up to tell us something new about what people think is newsworthy. What's Newsiest? The \"newsiest\" iReports are sorted in lists at the top of each section on the homepage and in other places around the site. Newsiest is a calculation that combines freshness, popularity, activity and ratings. The idea behind newsiest is that all the contributions the CNN iReport community of users make to the site - stories, comments, ratings, pageviews - and what CNN producers pick for their own stories could add up to tell us something new about what people think is newsworthy. Discretion Advised Sometimes a story that has news value can be hard to stomach. If you're posting material you think may be difficult for sensitive audiences, click the \"Discretion Advised\" checkbox and the iReport tools will add a warning to its page. Check the iReport community guidelines for more on what kind of content is welcome on the site. Follow this iReporter Followers on CNN iReport are like friends on other social networking sites. If this is someone whose work you admire or find interesting, click on this link to see their new contributions show up on your profile page next time you log in. What's a Superstar iReporter? The top members on CNN iReport are called Superstars. How do we decide who makes the cut? It's all in the math. The site tallies members' contributions, ratings, popularity and site activity, and gives the Superstar badge to the members whose scores are in the top 20 percent every week. Is this your story? If you'd like to attach it to your account, please use our claim form and include the following info: the story's URL, your screenname, and the cell phone number or e-mail address you used to send it. Meeting Obama, 2012 By unclaimed | Posted 21 hours ago ", "external_links": [], "published": "2015-08-30T03:00:00.000+03:00", "crawled": "2015-08-31T14:32:33.583+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}