{"organizations": ["Congress"], "uuid": "0613b9c2f5d0fe0d412a76b3d47530c43285e7df", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/56040902200000250024303c.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/pope-francis-speech-gay-marriage-abortion-congress_56040856e4b0fde8b0d16f99", "country": "", "title": "Pope Francis' Speech To Congress Didn't Mention Abortion, Gay Marriage By Name", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Pope Francis' Speech To Congress Didn't Mention Abortion, Gay Marriage By Name", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T19:58:00.000+03:00", "replies_count": 0, "uuid": "0613b9c2f5d0fe0d412a76b3d47530c43285e7df"}, "author": "", "url": "http://www.huffingtonpost.com/entry/pope-francis-speech-gay-marriage-abortion-congress_56040856e4b0fde8b0d16f99", "ord_in_thread": 0, "title": "Pope Francis' Speech To Congress Didn't Mention Abortion, Gay Marriage By Name", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francis", "PAUL J. RICHARDS", "Jaweed Kaleem"], "text": "Pope Francis' Speech To Congress Didn't Mention Abortion, Gay Marriage By Name In a 3,404-word address, he used only 75 words on the two topics. Jaweed Kaleem Senior Religion Reporter, The Huffington Post Posted: 09/24/2015 11:18 AM EDT | Edited: 1 hour ago PAUL J. RICHARDS via Getty Images Pope Francis touched on many topics in his speech to Congress, but conservatives may have expected him to say more about abortion and same-sex marriage. \nDuring his historic speech at a joint meeting of Congress on Thursday, Pope Francis hit upon a variety of issues that have defined the Catholic church: protecting the environment, helping the poor, addressing the plight of immigrants, abolishing the death penalty and taking a stand against the proliferation of the weapons trade, to name a few. \nYet, while the pope had strong words on many of these causes, he glossed over two other topics that American bishops have strongly lobbied against in recent years: abortion and same-sex marriage. In fact, he did not even mention them by name. \nIn his wide-ranging 3,404-word address praising the democratic mission of Congress and the spirit of the American people -- touching upon Martin Luther King Jr., Abraham Lincoln, Dorothy Day and Thomas Merton -- the pope called for action to protect refugees, eliminate capital punishment and stop war, yet used a mere 21 words to allude to abortion and only 54 to touch vaguely upon the fact that same-sex marriage is now legal across the United States. \nOn abortion, the pope’s comments were tucked into a larger discussion on the the Golden Rule, which “reminds us of our responsibility to protect and defend human life at every stage of its development.” But he did not say the word “abortion.” \nOn marriage, the pope had a few more words. “I cannot hide my concern for the family, which is threatened, perhaps as never before, from within and without. Fundamental relationships are being called into question, as is the very basis of marriage and the family. I can only reiterate the importance and, above all, the richness and the beauty of family life.” \nYet, Francis, who was notably the first pope to use the word “gay\" -- as he did during his famed “ Who I am to judge? ” interview -- and who has been praised and criticized by LGBT activists for his words on the spirituality of gay people, did not explicitly mention same-sex marriage. \nU.S. Catholic bishops, by comparison, have lobbied intensely in recent years against abortion, contraception and same-sex marriage, encouraging homilies and teach-ins on the issues on the parish level and hosting extensive policy pages about those topics on the U.S. Conference of Catholic Bishops website. Bishops have also lobbied against the death penalty, which the pope mentioned in his speech, and on behalf of immigrants and the poor. \nBy no means does Francis support abortion or gay marriage -- but his decision to largely skip over the topics during his speech to Congress is notable, and likely won’t gain him fans among conservative Catholics, who have already criticized the pope for his off-the-cuff remarks on social issues and for his views on climate change. \n\"Yesterday, Pope Francis said that promoting life and family were the major reason he came to America this week. Yet, disappointingly, the pope did not mention abortion by name in his address to Congress,\" said John-Henry Westen, the editor-in-chief of LifeSiteNews, a conservative Catholic website. \nFrancis has already indicated that his focus as pope is not on sexuality or culture war-related issues. In a landmark interview just six months after he became pope in 2013, he said the church was “obsessed” with abortion, contraception and gay marriage. \n“It is not necessary to talk about these issues all the time. The dogmatic and moral teachings of the church are not all equivalent. The church’s pastoral ministry cannot be obsessed with the transmission of a disjointed multitude of doctrines to be imposed insistently,” he said in the interview with Rev. Antonio Spadaro, who edits La Civiltà Cattolica, an Italian Jesuit publication. \n“We have to find a new balance,\" the pope said at the time. \"Otherwise, even the moral edifice of the church is likely to fall like a house of cards, losing the freshness and fragrance of the Gospel.” ", "external_links": [], "published": "2015-09-24T19:58:00.000+03:00", "crawled": "2015-09-24T19:58:45.246+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}