{"organizations": ["Fox News"], "uuid": "c0a55a7d98a16c1e13716e93af04cb49d77c2b1b", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/entertainment/0/0/aeropuerto%20pic.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/08/29/immigration-shift-shows-india-china-outpacing-mexico/", "country": "", "title": "Immigration shift shows India, China outpacing Mexico among newly arrived to U.S. | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration shift shows India, China outpacing Mexico among newly arrived to U.S. | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T00:12:00.000+03:00", "replies_count": 0, "uuid": "c0a55a7d98a16c1e13716e93af04cb49d77c2b1b"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/08/29/immigration-shift-shows-india-china-outpacing-mexico/", "ord_in_thread": 0, "title": "Immigration shift shows India, China outpacing Mexico among newly arrived to U.S. | Fox News Latino", "locations": ["U.S.", "Mexico", "China", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration shift shows India, China outpacing Mexico among newly arrived to U.S. Published August 29, 2015 Fox News Latino 2007 Getty Images \nDALLAS (AP) – Siddharth Jaganath wanted to return to India after earning his master's degree at Texas' Southern Methodist University. Instead, he built a new life in the U.S. over a decade, becoming a manager at a communications technology company and starting a family in the Dallas suburb of Plano. \n\"You start growing your roots and eventually end up staying here,\" the 37-year-old said. \nHis path is an increasingly common one: Immigrants from China and India, many with student or work visas, have overtaken Mexicans as the largest groups coming into the U.S., according to U.S. Census Bureau research released in May. The shift has been building for more than a decade and experts say it's bringing more highly skilled immigrants here. And some Republican presidential candidates have proposed a heavier focus on employment-based migration, which could accelerate traditionally slow changes to the country's ever-evolving face of immigration. \nMexicans still dominate the overall composition of immigrants in the U.S., accounting for more than a quarter of the foreign-born people. But of the 1.2 million newly arrived immigrants here legally and illegally counted in 2013 numbers, China led with 147,000, followed by India with 129,000 and Mexico with 125,000. It's a sharp contrast to the 2000 Census, when there were 402,000 from Mexico and no more than 84,000 each from India and China. Experts say part of the reason for the decrease in Mexican immigrants is a dramatic plunge in illegal immigration. \n\"We're not likely to see Asians overtake Latin Americans anytime soon (in overall immigrant population). But we are sort of at the leading edge of this transition where Asians will represent a larger and larger share of the U.S. foreign-born population,\" said Marc Rosenblum, deputy director of the U.S. Immigration Policy Program for the Washington-based Migration Policy Institute. \nThe national trend is evident even in Texas, where the number of Mexican immigrants coming to the border state each year has dropped by more than half since 2005, according to the Office of the State Demographer. In that time, the number of people from India coming to Texas has more than doubled and the number from China has increased more than fivefold, though both still comfortably trail Mexican immigrants. \nAsian immigrants have flocked to Texas' large urban and suburban areas, including the Dallas suburb of Collin County, the home to many major businesses. Laxmi Tummala, a real estate agent in the area and a U.S.-born child of Indian immigrants, has witnessed a buildup in Indian restaurants, grocery stores, clothing outlets and worship centers. \n\"All of that is extremely accessible now,\" Tummala said. \nWhile much of the discussion among Republican candidates this summer has centered on illegal immigration, they have also touched on immigrant skill levels. Donald Trump has proposed kicking out the estimated 11 million people who are in the U.S. illegally before allowing the \"good ones\" and \"talented\" ones back in. Jeb Bush and Marco Rubio both have said that the legal immigration process should focus more on letting in workers the country needs rather than reuniting families. \nIncreasing the flow of highly skilled immigrants would likely have a big impact on those coming from India and China. The majority of them who are 25 and older who arrived within three years of the 2013 numbers had a bachelor's degree or higher, according to the Migration Policy Institute. Mexican immigrants only had 15 percent, up from 6 percent in 2000. \nChina and India's growing economies have given immigrants access to travel and the ability to pay for an education abroad. Hua Bai came to the University of Texas at Dallas from China last year to work on a master's degree in marketing and information technology management. The 25-year-old said that given the right opportunity, she'd like to stay in the U.S. \n\"If I get sponsorship I'd consider living here and working here,\" she said. \"It all depends on the job opportunities.\" \nWithout revisions in immigration policy, experts say the change to the overall immigrant population will be slow. One reason is that the number of Mexicans who become legal permanent residents is about twice the number of Indian and Chinese people who do, according to Michael Fix, president of the Migration Policy Institute. \nBut a rising number of Chinese and Indians will become permanent residents, given the current rate of about half of people here on temporary work visas obtaining that status, Fix said. \nJaganath was among that group, inspired to come to the U.S. because the country is a leader in his career field. \n\"That was a following-the-dream type of thing for me,\" he said. \nLike us on Facebook ", "external_links": [], "published": "2015-08-30T00:12:00.000+03:00", "crawled": "2015-08-30T00:12:43.271+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}