{"organizations": [], "uuid": "b69cb7c90cc3af8336fc0ef25050aca643b908ac", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/1116/feed#", "section_title": "The Hill: Op-Ed", "url": "http://thehill.com/opinion/op-ed/255161-an-opportunity-for-courage-on-immigration", "country": "US", "title": "An opportunity for courage on immigration", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "An opportunity for courage on immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T21:00:00.000+03:00", "replies_count": 0, "uuid": "b69cb7c90cc3af8336fc0ef25050aca643b908ac"}, "author": "jpicard@thehill.com (Rev. Samuel Rodriguez)", "url": "http://thehill.com/opinion/op-ed/255161-an-opportunity-for-courage-on-immigration", "ord_in_thread": 0, "title": "An opportunity for courage on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An opportunity for courage on immigration By Rev. Samuel Rodriguez - 09/28/15 02:00 PM EDT \nOn Thursday, Pope Francis humbly exhorted a Joint Session of the U.S. Congress to view immigrants “as persons, seeing their faces and listening to their stories, trying to respond … in a way which is always humane, just and fraternal.” He challenged the Congress to apply Christ’s Golden Rule, to address the situation of refugees and other immigrants “with the same passion and compassion with which we want to be treated.” \nSitting behind him, visibly moved at various points, was Speaker of the House John Boehner (R-Ohio), a man shaped by his own Catholic faith, who has spoken repeatedly of his own convictions that a dysfunctional immigration system needed to be reformed, but who has not been able to achieve significant changes. As Boehner met with the pontiff just before his address, I wonder if Pope Francis pastorally but specifically challenged the Speaker to demonstrate courageous leadership in addressing immigration policy. I wonder if the Speaker confessed to the global leader of his Church what the rest of the nation learned this morning: that he will resign as Speaker of the House in just over a month. ADVERTISEMENT As an evangelical Christian, I both share many essential biblical beliefs with Pope Francis and have some important theological differences. As a conservative, my views often align with those of Speaker Boehner, but I’ve also occasionally been frustrated by his leadership.\nOne significant frustration with Boehner’s tenure has been the failure to move forward on immigration reform. In 2013, the Senate came together on a bipartisan basis to pass a broad immigration reform. The bill combined dramatic improvements to border security and interior enforcement with adjustments to a business-stifling visa system and an earned legalization process for those undocumented immigrants willing to come forward, pay a fine, and fully comply with a stringent set of requirements over a decade-long probationary period. Both sides made compromises, and no one was completely happy with the legislation, but it would have been an enormous improvement to the status quo. \nBoth the U.S. Conference of Catholic Bishops and a politically diverse coalition of evangelical leaders praised the effort, which we affirmed aligned with biblical values of respect for the rule of law, family unity, and compassion. Leaders from various other faith traditions voiced support as well, as did both the largest labor unions in the country and the business interests represented by the U.S. Chamber of Commerce. A Quinnipiac University poll at the time showed that, by a two-to-one margin, Americans supported the bipartisan Senate bill, including majorities of Republicans and Democrats, Catholics and evangelicals, and all ethnic groups surveyed. \nAfter the Senate bill passed, the nation waited. At various points over the next year, we heard that the House would act—maybe on the Senate bill, maybe on their own version of reform, with the various elements broken into separate bills. We prayed and pleaded for something , especially those of us who know personally the harm done by a long-neglected immigration system that is dividing families, stifling our economy, and eroding the rule of law. \nBehind the scenes, I and others who met with legislators found that a bill or bills similar to the Senate’s proposal had the support of almost all Democrats and of a larger than publicly reported minority of Republicans in the House. If legislators were telling us the truth behind the scenes—not necessarily a great presumption from politicians—there were almost certainly enough votes to pass legislation along the lines of the bipartisan Senate proposal in the House, had Boehner called a vote. He did not—likely, I presume, because he lacked the support of a majority of House Republicans, and if they were sufficiently upset by such a move, they could have threatened his speakership. \nHaving announced his resignation, I now wonder: what does the Speaker have to lose? Before you resign, Mr. Speaker, I hope and pray that you’ll call a vote on a bill (or, if you prefer, bills) that would address each of the major elements needed to reform our immigration system, consistent with the Senate’s approach. In a nod to Pope Francis and in light of the greatest refugee crisis our world has witnessed since World War II, I might add in some additional support to increase resettlement of refugees to our great nation, which still represents a beacon of hope for these divine-image-bearers yearning for freedom and safety. \nEven if broad immigration reform is, at this moment, a bridge too far, Republicans have an incredible opportunity to choose a conservative leader who understands that a better immigration process carries great potential for our nation and leads on immigration reform. \nIn a time when the rhetoric around immigration has become mean-spirited and vitriolic under the influence of the GOP’s current presidential frontrunner, we need a new conversation on immigrants and immigration in Washington: one that changes the tone and unites us, no matter where you were born. \nPope Francis’ visit has startled the status quo in Washington. Speaker Boehner’s announced resignation has upset the normal political currents. Now is a time for political courage for just and moral ends. May it be so. \nRodriguez is president of the National Hispanic Christian Leadership Conference (NHCLC)/CONEL.", "external_links": [], "published": "2015-09-28T21:00:00.000+03:00", "crawled": "2015-09-29T11:40:39.592+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}