{"organizations": [], "uuid": "80fc5c6bb4a7d7814cde9a96697a8138c2f702ad", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/560549551300008400ea7687.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-xi-jingping_560548eae4b0af3706dbd8dd", "country": "", "title": "President Obama Welcomes Chinese President Xi Jinping At The White House", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "President Obama Welcomes Chinese President Xi Jinping At The White House", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T16:24:00.000+03:00", "replies_count": 0, "uuid": "80fc5c6bb4a7d7814cde9a96697a8138c2f702ad"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-xi-jingping_560548eae4b0af3706dbd8dd", "ord_in_thread": 0, "title": "President Obama Welcomes Chinese President Xi Jinping At The White House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Spetalnick", "Michael Martina", "Obama"], "text": "President Obama Welcomes Chinese President Xi Jinping At The White House The visit comes amid major disagreement between the two countries. By Matt Spetalnick and Michael Martina Posted: 09/25/2015 09:20 AM EDT \nWASHINGTON, Sept 25 (Reuters) - President Barack Obama hosted Chinese President Xi Jinping for his first U.S. state visit on Friday but the pomp and ceremony was not likely to mask tensions over alleged Chinese cyber spying, Beijing's economic policies and territorial disputes with its neighbors. \nObama greeted Xi on arrival at the White House for an elaborate ceremony on the South Lawn, including a military honor guard, which will be followed by a formal summit and a lavish state dinner. \nU.S. and Chinese officials hope to cast the talks in a favorable light by showcasing at least one area of cooperation - the global fight against climate change - when the leaders announce a deal later Friday to build on a landmark emissions agreement struck last year. \nBut that achievement is all but certain to be overshadowed by major disagreements that underscore a growing rivalry between the world's two biggest economic powers.Despite the ceremonial honors, the Chinese Communist leader, coming to Washington on the heels of Pope Francis, can expect nothing like the wall-to-wall U.S. news coverage given the popular pontiff, who drew adoring crowds wherever he went. \nIn diplomatic terms as well, no major policy breakthroughs are expected on the big issues that divide the two countries. \nBut the summit will yield a significant announcement by Xi of a commitment by China, the world's biggest producer of greenhouse gases, to begin a national \"cap-and-trade\" program in 2017 to limit emissions, U.S. officials said. It is an effort to build momentum toward a global climate change pact in Paris later this year, something Obama sees as part of his legacy. \nHowever, the announcement is expected to be one of the summit's few tangible policy achievements. \nHigh on the agenda is cyber security, a growing source of strain after high-profile cyber attacks on U.S. business and government databases blamed on Chinese hackers. Washington is considering sanctions against Chinese companies and individuals.Visiting Seattle on the first leg of his trip, Xi denied involvement by the Chinese government and pledged to work with the United States to fight cyber crime. While Obama's aides say no formal agreement is likely, Chinese officials have suggested the possibility of a basic deal against cyber warfare. \nObama is also expected to press Xi to follow through on economic reforms and refrain from discrimination against U.S. companies operating in China. Some analysts believe Obama has more leverage due to China's slowing economic growth, which has destabilized global markets. \nAt the same time, the Obama administration is still at a loss about how to curb China's assertiveness in the South China Sea, where Beijing has continued to reclaim land for potential military use despite conflicting claims with its neighbors.The two leaders held a private 2-1/2-hour dinner on Thursday after Xi's arrival to begin grappling with their differences. \nCalls for Obama to take a harder line with China have echoed from Congress to the 2016 Republican presidential campaign. But his approach will be tempered because the world's two biggest economies are inextricably bound together.For his part, Xi, faced with nationalistic sentiment rising at home, can ill afford the appearance of making concessions. \nAlso on HuffPost: ", "external_links": [], "published": "2015-09-25T16:24:00.000+03:00", "crawled": "2015-09-25T16:24:14.394+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}