{"organizations": ["Elise Foley Immigration & Politics"], "uuid": "5769968844e338411ebea48effe81c4342b9d07f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f30969180000260061cd8f.jpeg?cache=traNVX0rdb", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/10000-syrians-congress-refugee-groups_55f2eb12e4b077ca094eb7df", "country": "", "title": "Lawmakers, Refugee Groups To Obama: Accepting 10,000 Syrians Is Not Enough", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Lawmakers, Refugee Groups To Obama: Accepting 10,000 Syrians Is Not Enough", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T21:26:00.000+03:00", "replies_count": 0, "uuid": "5769968844e338411ebea48effe81c4342b9d07f"}, "author": "", "url": "http://www.huffingtonpost.com/entry/10000-syrians-congress-refugee-groups_55f2eb12e4b077ca094eb7df", "ord_in_thread": 0, "title": "Lawmakers, Refugee Groups To Obama: Accepting 10,000 Syrians Is Not Enough", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Email Lawmakers, Refugee Groups To Obama: Accepting 10,000 Syrians Is Not Enough \"When we saw that we just said, 'Uh, did he forget a zero in his announcement?'\" Elise Foley Immigration & Politics Reporter, The Huffington Post Posted: 09/11/2015 02:05 PM EDT | Edited: 14 minutes ago \nWASHINGTON -- Sixty-nine House Democrats joined human rights groups on Friday in calling for the U.S. to admit 100,000 Syrian refugees next fiscal year, saying the White House's proposal to take in 10,000 of them is far from enough. \nThe members said the U.S. should accept 200,000 refugees total in the fiscal year that begins Oct. 1, echoing a number put forward by groups that help with and advocate for resettlement. \n\"We have always been a country that has demonstrated extraordinary leadership in responding to humanitarian crises around the world, and this is a crisis,\" Rep. David Cicilline (D-R.I.), who organized the letter, said in an interview. \"Ten thousand [refugees] is a step in the right direction but it does not, in my view, respond adequately to the magnitude of the crisis.\" \nWhite House officials say the most important response is a humanitarian one, noting the U.S. has already given about $4 billion to help Syrian refugees abroad. But the announcement Thursday that Obama aims to take in 10,000 Syrians next fiscal year indicates the administration is feeling pressure from lawmakers, outside groups and Americans who say resettlement needs to be a bigger part of the equation, particularly as shocking photos of the danger refugees go through while seeking safety dominate the news. Credit: Mohammed Abed/AFP/Getty Images Palestinian girls put flowers on a sand sculpture on a Gaza City beach depicting Syrian refugee Aylan Kurdi, a 3-year-old boy who drowned offshore from Turkey. \nThe administration isn't going to find a figure that will please everyone. On one side are those who say admitting 10,000 Syrians to a country of 320 million people is a pittance compared with countries like Germany, which has a population of 80 million and pledged to admit 800,000 refugees . On the other are those who say it's impossible to take in more people from the Middle East without risking American security -- an argument that could have salience even though Syrian refugees go through an 18- to 24-month screening process. \nThe full number of refugees to be admitted next fiscal year needs to be set by the end of the month. So far, the administration has said total refugee admissions will be higher than 70,000 -- the number set for this fiscal year -- and that the number of Syrians to be admitted will go from the 1,500 target this year to 10,000. \n\"When we saw that we just said, 'Uh, did he forget a zero in his announcement?' Because the 10,000 figure certainly doesn't even begin to seriously address the issue,\" said Erol Kekic, executive director of the immigration and refugee program at Church World Service. \nThe number was particularly disappointing because the administration had already said it would admit 8,000 Syrians next year, according to advocates. Upping the proposal by 2,000 people is \"cold comfort to the victims of the Syrian conflict,\" David Miliband, president and CEO of the International Rescue Committee, said in a statement Thursday. \nThe groups calling for 200,000 refugee admissions next fiscal year received support Thursday from Reps. John Conyers (Mich.) and Zoe Lofgren (Calif.), the top Democrats on the House Judiciary Committee and its immigration subcommittee, respectively. \n\"If the United States aims to continue as a global humanitarian leader, then it is our obligation to significantly increase the number of refugees we resettle,\" they said in a statement. \nWhite House press secretary Josh Earnest said Thursday that \"to scale up to a degree that some members of Congress may have in mind would have some significant fiscal consequences\" because the background check process requires considerable manpower and time. \n\"Congress would need to make a significant financial commitment to ramping up along those lines,\" he said. \nMembers of Congress pledged in their letter to Obama to \"do everything [they] can to ensure that, if steps are taken to accommodate additional refugees, there will be adequate additional resources for U.S. resettlement agencies, and for security checks, in order to meet the increased demand.\" \nGroups that support admitting more refugees said they will continue to push for that to happen, including by urging Congress to put more funding into the process so people can be screened more quickly. Kevin Appleby, who leads the Office of Migration Policy and Public Affairs at the U.S. Conference of Catholic Bishops, said he \"was surprised and disappointed\" by the 10,000 figure. But he said the group is hoping it will change. \n\"It's a business-as-usual response to a historic crisis,\" Appleby said. \"It's insufficient to the need, and hopefully the administration will increase that number in the days and months ahead.\" \nAlso on HuffPost: ", "external_links": [], "published": "2015-09-11T21:26:00.000+03:00", "crawled": "2015-09-11T21:26:27.991+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}