{"organizations": [], "uuid": "adc4d60f36c1e25b2c7f49d7ed58b82bd2941982", "thread": {"site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/1115/feed", "section_title": "The Hill: Letters", "url": "http://thehill.com/opinion/letters/253762-obama-should-embrace-taiwan-during-chinese-presidents-visit", "country": "US", "title": "Obama should embrace Taiwan during Chinese president’s visit", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama should embrace Taiwan during Chinese president’s visit", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T01:43:00.000+03:00", "replies_count": 0, "uuid": "adc4d60f36c1e25b2c7f49d7ed58b82bd2941982"}, "author": "rdickson@thehill.com (Kent Wang, research fellow at the Institute for Taiwan-America Studies)", "url": "http://thehill.com/opinion/letters/253762-obama-should-embrace-taiwan-during-chinese-presidents-visit", "ord_in_thread": 0, "title": "Obama should embrace Taiwan during Chinese president’s visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama should embrace Taiwan during Chinese president’s visit By Kent Wang, research fellow at the Institute for Taiwan-America Studies - 09/15/15 06:43 PM EDT \nChinese President Xi Jinping is about to embark on his first-ever state visit to Washington for talks with President Obama. Relations between the two powerhouses are alive but strained. On China’s agenda in particular is U.S. support for Taiwan and a push for a Fourth Joint Communique. Here are the key points of conversation that should be on Obama’s agenda. \nTaiwan has historically played an important role as an ally of the United States, and the relationship with Taiwan is a cornerstone of the foreign policy in the region. Although U.S. relations with Taiwan are stronger than ever, Taiwan faces a precarious situation as regards the imperious crisis of the maritime and territorial disputes in the South China Sea. ADVERTISEMENT The security of Taiwan and its democracy is of the utmost importance to the United States. Located in the “first island chain” between China and the Pacific Ocean, its position limits China’s access to the Central Pacific. The United States must stand with Taiwan to ensure it can defend itself and that its self-defense capabilities are never eroded.\nWashington should declare its absolute commitment to Taiwan’s security, and Obama should declare publicly that Taiwan is strategically important for all of Asia. There is also a need to remove many of the restrictions that are now placed on Taiwan-U.S. relations, including rules that prohibit the president visiting Washington and limits on senior U.S. government and military officials visiting Taiwan. \nThe U.S. should help Taiwan to advance arms sales and ensure that Taiwan is part of the Trans-Pacific Partnership. I strongly urge Obama, when he talks to Xi, to strengthen, vitalize and re-envision the U.S.-Taiwan strategic relationship as the stakes grow in the simmering standoff with China. \nFrom Kent Wang, research fellow at the Institute for Taiwan-America Studies, Washington, D.C. \nMinimum wage increases still not enough to keep up with costs \nIt’s nice to hear New York may become the first state in the nation to increase the minimum wage to $15 an hour (“Biden signals support for $15 minimum wage,” Sept. 10). Sadly, that increased amount, as well as all other state and/or local minimum wage increases, touts the false benefit of increasing the minimum wage. What the advocates of raising the minimum wage aren’t admitting is that the rapid rise in the cost of living each day greatly outpaces and more quickly negates any minimum wage increases. \nPrices for everyday things that we all need have increased and will always increase, including food, rent, utilities, transportation, healthcare, travel and vacation. And for those having, raising, clothing, feeding and educating any child, multiplied by however many times they choose to increase their family number, an ever higher, dizzying percentage of people live in deepening poverty, as well as those suffering from mental and physical health issues and those driven from rental to rental by rocket-fast gentrification. In truth, only a miraculous minuscule number of individuals and families are benefitting from any of these wage increases to date. \nGood for you New York; you’re the first state to put your citizens within $5 of a more realistic cost of living at $20 hourly. But how will you protect your local taxpayers and the poor from the deluge of outsiders who will rush to your state, increasing the number of those competing for what is only so many jobs? \nAs far as I and millions of other Americans think, our elected officials at all levels of government nationwide have collectively failed us. For most of us, the American dream last experienced in the early 1980s is a desert mirage. \nFrom A.J. Castilla, Boston", "external_links": [], "published": "2015-09-16T01:43:00.000+03:00", "crawled": "2015-09-16T07:03:08.528+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}