{"organizations": ["House", "Fox News Latino Fox News"], "uuid": "af5ebfce714801654b83ea9f220cc697408bbfd6", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/mccarthy_kevin_071911.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/28/immigration-activists-hope-boehner-possible-successor-rep-mccarthy-will-push/", "country": "", "title": "Immigration activists hope Boehner's possible successor, Kevin McCarthy, will push reform | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration activists hope Boehner's possible successor, Kevin McCarthy, will push reform | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "af5ebfce714801654b83ea9f220cc697408bbfd6"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/28/immigration-activists-hope-boehner-possible-successor-rep-mccarthy-will-push/", "ord_in_thread": 0, "title": "Immigration activists hope Boehner's possible successor, Kevin McCarthy, will push reform | Fox News Latino", "locations": ["Washington", "D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boehner", "Kevin McCarthy"], "text": "Fox News Latino FILE: UNDATED: House Majority Leader Kevin McCarthy, center, talks on Capitol Hill about the debt ceiling, Washington, D.C. AP \nA leading potential successor to House Speaker John Boehner comes from a district with a significant Latino constituency, raising hope among Latino activists that he may do more than the Ohio Republican did to push for comprehensive immigration reform. \nRep. Kevin McCarthy, a California Republican, represents a region that is 35 percent Latino and, as his website notes, is one of the nation’s largest agricultural districts. \nMcCarthy, who is 50 and the House majority leader since last year, has said that he supports giving undocumented immigrants a path to legal status, although not full-blown citizenship. \nMcCarthy said that his support for an opportunity to allow some undocumented immigrants to legalize their status was not tantamount to being in favor of amnesty, or rewarding people who break the law. \n“If you want to become a citizen, you'll have to go through the path,” he said. “There won't be amnesty inside it.” \nHe said to reporters last year that he backed giving those who qualify “legal status that will allow you to work and pay your taxes.” \nHe added that the path to legal status was “a decision that every Republican will have to make.” \nOn McCarthy's official website, however, in the section on his views on immigration, he makes no mention of a path to legal status, and speaks only about the need for tough enforcement. \n\"As a nation founded by immigrants, we should continue to embrace the individuals who wait in line and come to the United States legally to work hard and contribute to our society,\" McCarthy says on the website. \"However, we should not provide any amnesty that would benefit those who defy our laws and enter the United States illegally...we must secure our border by using both physical as well as electronic barriers.\" \nMany activists pushing for a path to legal status for the undocumented said they are glad to see Boehner step aside, faulting him for refusing to use his powerful position to advance a comprehensive immigration reform bill. \nIn 2013, the Senate passed a bipartisan bill to overhaul immigration. The bill called for tightening security at the border and providing ways for undocumented immigrants who meet a strict set of criteria to legalize their status, among other things. But the effort stalled in the House, where many conservatives vowed never to pass a measure that, in their words, rewarded those who had broken immigration laws. \nAngelica Salas, executive director of the Coalition for Humane Immigrant Rights of Los Angeles (CHIRLA), an immigrant rights organization, said he had hoped Boehner would rein in his party – but was unable to do so. \n“With Mr. Boehner out of the picture 2016 provides an opportunity to bring back civility to the GOP and an extremely divided Congress,\" she said in a written statement. “As to speculation that California's conservative Kevin McCarthy might be considered as the next Speaker, we would call on him to represent the richness of our state's diversity.\" \nIn a statement that followed Boehner’s unexpected announcement Friday that he was resigning the speaker post by the end of October, McCarthy said: “Now is the time for our conference to focus on healing and unifying to face the challenges ahead and always do what is best for the American people.” \nBoehner all but endorsed McCarthy on Friday. \n\"I'll tell Kevin, if he's the next speaker, that his number-one responsibility is to protect the institution. Nobody else around here has an obligation like that,\" Boehner told reporters. \"Secondly, I'd tell him the same thing I've just told you. You just do the right thing every day for the right reasons, the right things will happen.\" \nChris Pawelski, an upstate New York onion farmer who is a vocal advocate for immigration reform, particularly a more efficient guest worker program, expressed mixed feelings about the Boehner’s decision. \n“I’m saddened by Speaker Boehner’s resignation as Speaker and from the House,” Pawelski said in a statement to Fox News Latino. “I found him to be the voice of moderation and reason, dealing with a very difficult caucus and governing situation.” \nPawelski is somewhat encouraged by McCarthy’s support for immigration reform, but feels it may not be enough to bring about positive changes. \n“Though McCarthy’s district has a large number of Latinos and is heavily agricultural I find it hard to believe that the forces that drove Boehner out will allow any sort of immigration reform legislation to go to the House floor.” \nMcCarthy has many views that fall in line with GOP conservatives – he opposes President Obama's Affordable Care Act, gun control, and climate change measures. \nSome conservatives, however, are leery of McCarthy, accusing him of being more of an \"establishment Republican\" than not. On Friday, conservative talk radio host and best-selling author Mark Levin warned Republicans in Washington not to replace Boehner with McCarthy, who, he concluded, is not a \"principled conservative.\" \nSome Republicans say they prefer that immigration be dealt with in a piecemeal fashion, instead of one sweeping measure. \nSome groups expressed hope that as one of his last acts as speaker, Boehner would put comprehensive immigration reform on the House radar. \n“Speaker Boehner would do well to use his last month in office to heed the words of his church, the business community, and the great majority of Americans,” Rep. Bill Foster, an Illinois Democrat said, “to take bold and courageous action by bringing comprehensive immigration reform up for a vote.” \n“He has the opportunity to transform his legacy from one of constant partisan gamesmanship and gridlock, to one of cooperation and progress that benefits all Americans. If he chooses this path, he will find no shortage of bipartisan support and cooperation from Congressional Democrats.” \nIncludes reporting by The Associated Press. \nElizabeth Llorente can be reached at elizabeth.llorente@foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \nLike us on Facebook ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T17:26:03.522+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}