{"organizations": [], "uuid": "21b498efdcf1b20005bdd03f38adbe6f06cb3fa2", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/09/10/obama-orders-us-to-take-in-10000-syrian-refugees/", "country": "IL", "title": "Obama orders U.S. to take in 10,000 Syrian refugees", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama orders U.S. to take in 10,000 Syrian refugees | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "21b498efdcf1b20005bdd03f38adbe6f06cb3fa2"}, "author": "EFE", "url": "http://latino.foxnews.com/latino/politics/2015/09/10/obama-orders-us-to-take-in-10000-syrian-refugees/", "ord_in_thread": 0, "title": "Obama orders U.S. to take in 10,000 Syrian refugees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  EFE U.S. President Barack Obama ordered the government to begin preparations to accept at least 10,000 Syrian refugees during the new fiscal year beginning on Oct. 1, the White House announced Thursday.\nWhite House spokesman Josh Earnest made the announcement at his daily press conference one day after Secretary of State John Kerry said that the country is committed to taking in more Syrian refugees to respond to the immigration crisis that is affecting Europe.\nEarnest noted that, to be able to admit the 10,000 refugees during Fiscal 2016, it will be necessary to raise the annual quota of refugees that the United States may take in from the current annual figure of 70,000, which has been in place since 2013.\nSpecifically to get that accomplished, on Wednesday Kerry met with a group of lawmakers to establish the quota of refugees the United States may take in from all over the world in Fiscal 2016.\nKerry gave no figures to reporters after the meeting and said only that the United States is committed to receiving more Syrian refugees.\nOfficials present at that meeting told the media later that the government's proposal is to increase the total figure of refugees for Fiscal 2016 to at least 75,000 and Kerry mentioned the figure of 100,000.\nSince the start of the civil war in Syria more than four years ago, the United States has taken in just 1,500 refugees from that country, most of them in recent months, and another 300 are scheduled to arrive this month.\nThe specific commitments announced in recent days by countries such as Germany and France have increased the pressure on Washington to involve itself in the crisis created in Europe by the arrival of hundreds of thousands of refugees fleeing the conflicts in the Middle East, especially in Syria.\nThe United States is \"the biggest\" donor of aid to Syria and, since the outbreak of the conflict there, it has contributed more than $4 billion in humanitarian assistance, according to the White House.\nOf that aid, some $1.9 billion has gone directly to support Syrian refugees in countries bordering on Syria. EFE", "external_links": [], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T04:40:15.143+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}