{"organizations": [], "uuid": "06b23c564a2d9406916e67e262e14e1f82f19404", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/william-bradley/headshot.jpg", "site_section": "http://www.huffingtonpost.com/tag/alaska/feed", "section_title": "Alaska on Huffington Post", "url": "http://www.huffingtonpost.com/william-bradley/obama-jerry-brown-and-cli_b_8101312.html", "country": "US", "title": "William Bradley: Obama, Jerry Brown and Climate Change: From the Arctic to the Arabs and the Oil Empire at Home", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "William Bradley: Obama, Jerry Brown and Climate Change: From the Arctic to the Arabs and the Oil Empire at Home", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "06b23c564a2d9406916e67e262e14e1f82f19404"}, "author": "William Bradley", "url": "http://www.huffingtonpost.com/william-bradley/obama-jerry-brown-and-cli_b_8101312.html", "ord_in_thread": 0, "title": "William Bradley: Obama, Jerry Brown and Climate Change: From the Arctic to the Arabs and the Oil Empire at Home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"The trouble with this country is that you can't win an election without the oil bloc, and you can't govern with it.\" \nFranklin D. Roosevelt \nPresident Barack Obama and Governor Jerry Brown have both been pushing the envelope of efforts to bring climate change under control and running up against major ingrown opposition to their efforts. \nObama spent most of last week up near and in the Arctic Circle, shining his presidential spotlight on massive climate change there caused by our emission of greenhouse gases. But he ended the week making nice back in Washington with the new king of Saudi Arabia, which is doing its level best to keep us addicted to the oil which fuels its incredible wealth. \nFor his part, Brown is pushing both existing policies and his own new policies in California, presenting America's megastate on the Pacific as the exemplar among advanced industrial societies in transitioning away from the greenhouse era to a greener future. But the old oil empire at home has struck back, imperiling passage of key legislation in the state Assembly with a multi-million dollar campaign of public fear mongering and strategic influence peddling with moderate Democrats. \nPresident Barack Obama shined his spotlight on climate change at the top of the world, during a three-day trip to Alaska and the Arctic Circle. The rate of temperature increase in the region over the past half-century has been twice as great as that in the lower 48 states, a ratio that is expected to increase. \nBrown outlined three major climate moves in his fourth Inaugural Address this past January: Increasing California's renewable share of electric power to 50 percent, doubling California's energy efficiency, and cutting California's petroleum usage in vehicles by half. He can enact these measures by executive order, but he's also making sure with legislation which cannot be overturned by a future governor. \nEach piece of the new Brown plan has gotten opposition, but it is only the latter, cutting petroleum usage in transportation by half, that appears to be under any serious threat, thanks to a massive campaign by the oil industry of lobbying and advertising. The bill, pushed by state Senate leader Kevin de Leon, easily passed the Senate but is now before the state Assembly, which has been beset by a struggle over the speakership and in which corporate lobbyists have greater sway with more moderate Democrats. \nBrown and his allies have enlisted some high-profile lobbying of their own. Oscar-winning actress Halle Berry and a host of Catholic bishops have weighed in in the State Capitol. And enviro billionaire Tom Steyer -- who first got involved in politics in 2010 when he joined forces with then Governor Arnold Schwarzenegger to beat back an oil industry-funded initiative to overturn the state's climate change program -- is countering Big Oil's multi-million dollar ad campaign. \nGovernor Jerry Brown, introduced by the premier of Ontario as a major world leader in the fight against climate change, addressed July's Climate Summit of the Americas in Toronto, Canada. \nWhile Brown has been very open to further development of existing California oil resources so long as oil is a major factor, which only makes sense from a state revenue and GDP standpoint, clearly his move to dramatically slash petroleum use long term is a threat to the ancien regime and its old ways of providing energy. \nAs a result, the oil industry launched a massive advertising and lobbying campaign employing wild scare tactics to try to derail Brown's program. Big Oil claims that the state Air Resources Board will resort to gas rationing to meet the new standard. \nMost state legislators in the term limits era have little experience in high-level politics. The reality is that, well-intentioned as they may be, they are prone to falling prey to big money campaigns. \nLiberal Democrats tend to get big money from labor unions. Moderate Democrats get more from corporations. And the oil industry is calling on its longtime allies in the corporate community to try to hang on to their long-term massive perquisites and profit. \nOf course petroleum use in vehicles can be cut in half by 2030. \nThe reality is that we are are already well on the way to achieving that. \nFirst, we will get halfway there simply by following advancing federal fuel efficiency standards. When Obama came into office, motivated in part as he said as a candidate on Earth Day in Iowa in 2007 by California's example, he established regulations to double gas mileage standards for new vehicles to 54.5 miles per gallon by 2025. \nWe get the rest of the way there by doing the sorts of things we are already doing. \nMost of the reduction, says the Air Resources Board, will be accomplished by accelerating programs already underway. Increasing the numbers of zero-emission and low emission vehicles as well as the efficiency of more conventional vehicles will do much, as will further reducing carbon in transportation fuels, something already underway as a result of action by Schwarzenegger. Then there are increases in public transit and better urban planning. \nSo this controversy isn't really about the public good. It's about the old fossil fuel regime refusing to let go of its hold on our oil addiction. \nThe oil industry has launched a multi-million dollar scare campaign to derail California's efforts to fight climate change, including this ad falsely claiming that gas will be rationed in California as part of a plot to make life harder for average Californians. \nSlowly at first, then with gathering momentum after its 19th century in Pennsylvania, oil changed the world. \nVery cheap, readily available oil transformed America, turning it into a land of cars and sprawl. Then, after World War II, in which it was simply the essential strategic resource, oil transformed Europe and most of the rest of the world. \nAlong the way, things were abandoned. Things like LA's public rail system, bought up and shuttered by oil and auto companies. \n\"The center of gravity of the world of oil production is shifting from the Gulf-Caribbean areas to the Middle East, to the Persian Gulf area, and is likely to continue to shift until it is firmly established in that area.\" \n1943 assessment by oil geologist Everett de Golyer, special consultant to President Roosevelt, after a wartime Middle East mission. \nSome suspected that America would not always produce all the oil it would need. \nSo President Franklin D. Roosevelt, looking forward to the shape of the future post-war world while in the midst of the war, dispatched eminent oil geologist Everett de Golyer on a mission to the Middle East to gauge the region's potential. De Golyer reported back to FDR and his advisors that the Persian Gulf would become the pivot point of world energy. \nRoosevelt saw that Arab leaders would likely become very important. After he and Churchill and Stalin discussed the shape of the post-war world at their 1945 summit in Yalta, FDR paid a special visit to Saudi King Ibn Saud. Learning that the Saudis and their Gulf Arab allies were unhappy about plans to turn over Palestine for a Jewish state, Roosevelt agreed to consult with the Arabs before changing American policy to promote what would become Israel, issuing a presidential letter to that effect. But two months later, Roosevelt was dead and his unprepared successor Harry Truman, failing to understand the future importance of Arab oil, unilaterally changed the policy, infuriating the Arab world and setting up what would prove to be two antithetical US policies in the Middle East: Support for Israel and dependence on the Arabs. \nFast forward a bit to April 1973. Cheap and easily available oil was the order of the day. State Department oil expert James Akins published a controversial bombshell essay in Foreign Affairs, linked here . \nThe essay said we hadn't seen anything yet. From 1973 to 1985, Akins forecast, total world oil consumption would be greater than that in all history up to 1973. Oil prices would go up dramatically. And an Arab oil embargo could be a major political and economic weapon, given the West's fateful oil addiction and consequent vulnerability. \nDespite many denials, all that proved to be true. \nThe Arab oil embargo after American intervention to save a losing Israel in the Yom Kippur War of October 1973 prompted much talk of alternative energy, conservation, and energy independence. Emerging leaders like Jerry Brown, who would become governor of California a year later at age 36, began their crusades. \nBut once the shortage was over, consumption shot back up, even though the price of oil was much higher. Richard Nixon rolled back environmental standards in the quest for new fossil fuel energy. His successor, career auto industry advocate Gerald Ford of Michigan, slashed legislation for public transit. \nAnd money, power, and geopolitical focus shifted around the globe. \nAfter spending three days inspecting and discussing dramatic climate change in the vicinity of the North Pole, Obama returned to Washington to meet with King Salman of Saudi Arabia, the longtime world oil superpower. \nIn the late 1970s, Fred Dutton, the chief US lawyer for Saudi Arabia -- whom I came to know because he was on the University of California Board of Regents, which I was helping push to disinvest from apartheid South Africa -- told me that the transfer of wealth from the West to his clients and the other Persian Gulf states was the greatest sudden transfer of wealth in world history. Even greater, said the former Pat Brown executive secretary and Bobby Kennedy campaign manager, than that of the Spanish conquistadors and their fabled treasure ships, or of Britain after winning the Napoleonic Wars. \nToday, with the Saudis in the lead, the price of oil is down a stunning 60 percent since June 2014. Which very much benefits Saudi Arabia, given its production costs, vast reserves, and competitive positioning in oil markets. \nThis has caused a boost for the anemic US economy, while capping the potential of the revived yet higher-cost US oil industry. (It's largely squelched the potential of California fracking.) It has also led to a significant downdraft for historic Saudi bete noire Iran, and recession for petro-powerhouse Russia. \nObama has to like three of those four results. But it has also produced the exact wrong price signal with regard to greenhouse gas emissions. \nSelf-interest has always been paramount in the oil business. \nPartly in response to its new predicament, Vladimir Putin's Russia has moved aggressively to assert its interests in the Arctic, claiming another half-million square miles of territory in recent months. As the Arctic melts, a petroleum bonanza awaits beneath the formerly ice-locked surface. \nIf global negotiations on climate change continue to falter, the planet will likely be cooked even faster. \nEven Obama is getting in on the Arctic act. In addition to his protestations of concern during his big Alaska trip, he's recently approved a Royal Dutch Shell project in the Arctic. \nThe Saudis aren't happy with Obama's nuclear deal with Iran. But they've decided to live with the deal. Their position in the world is still quite positive, notwithstanding their protestations. And they can always buy a Bomb project if they need to. \nMeanwhile, they've got the Obama administration training rebel forces in the Syrian civil war. And the administration is keeping quiet about civilian deaths in the Saudis' little war in Yemen. \nThe past doesn't just end automatically, you know. \nFacebook comments are closed on this article. \nWilliam Bradley Archive More:", "external_links": [], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T07:35:42.573+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}