{"organizations": [], "uuid": "4a7e6bbe3708ca6e29d72aed6d259c367a3d24c2", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/091915_kelly_trump_640.jpg", "site_section": "http://www.foxnews.com/politics/", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/09/19/trump-break-silence-on-no-response-to-obama-muslim-comments-says-not-morally/", "country": "US", "title": "Trump break silence on no response to Obama Muslim comments, says not 'morally obligated'", "performance_score": 7, "site": "foxnews.com", "participants_count": 7, "title_full": "Trump break silence on no response to Obama Muslim comments, says not 'morally obligated' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T03:00:00.000+03:00", "replies_count": 6, "uuid": "a776af16225a1f68305bf9464dc81344b12ca7b1"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/09/19/trump-break-silence-on-no-response-to-obama-muslim-comments-says-not-morally/#post-0", "ord_in_thread": 0, "title": "Trump break silence on no response to Obama Muslim comments, says not 'morally obligated'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 19, 2015 FoxNews.com livefyre Email Print\nRepublican presidential candidate Donald Trump on Saturday defended his recent decision not to challenge a rally attendee's claim that President Obama is a Muslim and \"not even an American,\" suggesting that defending the president is not his moral obligation.\n\"Am I morally obligated to defend the president every time somebody says something bad or controversial about him? I don't think so!\" Trump said in series of tweets Saturday morning.\nTrump critics -- including fellow GOP White House candidate South Carolina Sen Lindsey Graham -- have tried to use the exchange at the New Hampshire event Thursday night to knock back the GOP presidential front-runner and billionaire businessman.\n\"I was appalled,” said front-running Democratic candidate Hillary Clinton.\nCritics also have suggested Trump backed out of an event Friday evening in early-voting state South Carolina to avoid the controversy. The Trump campaign has said Trump had to attend to a business deal that had been delayed.\nOn Saturday, the bombastic Trump also tweeted: \"This is the first time in my life that I have caused controversy by NOT saying something.\"\nHis next tweet was: \"If someone made a nasty or controversial statement about me to the president, do you really think he would come to my rescue? No chance!\"\nHe also argued the media would have accused him of interfering with the man's right of free speech, tweeting “a no win situation!\"\nThe exchange is also being compared to what 2008 GOP presidential nominee Arizona Sen. John McCain did when a woman at town hall meeting called Obama \"an Arab.\"\n\"No ma'am,\" McCain said. \"He's a decent family man citizen that I just happen to have disagreements with on fundamental issues.\"\nAt the town hall style event Thursday, the unidentified man said: \"We have a problem in this country. It's called Muslim. … You know our current president is one. You know he's not even an American.\"\nA seeming surprised Trump said: \"We need this question? This is the first question?\"\nCampaign manager Corey Lewandowski later said Trump only heard and responded to the later part of the man’s question about Muslim training camps in the United States.\nTrump, who in year’s past questioned whether Obama has a U.S. birth certificate, said in a New York Times interview published Friday that “the bigger issue is that Obama is waging a war against Christians in this country.\"", "external_links": [], "published": "2015-09-19T03:00:00.000+03:00", "crawled": "2015-09-19T19:48:15.126+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}