{"organizations": ["Goldman Sachs", "Senate Republican Policy Committee", "Republican", "Family Research Council", "NBC", "Senate Foreign Relations Committee", "American Enterprise Institute for Public Policy Research", "House", "U.S. Congress"], "uuid": "615c4b7c2831ddb660482d033ef4a3c902d1e9e1", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150801101457-marco-rubio-july-18-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/08/09/politics/marco-rubio-abortion-2016/index.html?eref=rss_politics", "country": "US", "title": "Rubio opposes abortions in all instances", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Rubio opposes abortions in all instances", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T17:11:00.000+03:00", "replies_count": 0, "uuid": "615c4b7c2831ddb660482d033ef4a3c902d1e9e1"}, "author": "", "url": "http://edition.cnn.com/2015/08/09/politics/marco-rubio-abortion-2016/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Rubio opposes abortions in all instances", "locations": ["Miami", "U.S.", "Washington", "Virginia", "Syria", "Venezuela", "Capitol Hill", "Doral", "Israeli", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Ron Johnson", "Rick Scott", "Benjamin Netanyahu", "Obama", "Lindsey Graham", "John McCain", "Marco Rubio", "Mike Lee", "Ron DeSantis", "Ken Cuccinelli", "Cory Booker", "Brad Snyder", "Robert Ford", "McCain", "Rubio", "Kristen Gillibrand"], "text": "Marco Rubio: Life begins at conception 04:22 Washington (CNN) Florida Sen. Marco Rubio says he opposes abortion in all instances -- but he'd support legislation that includes exceptions in cases such as rape, incest and when the life of the mother is threatened, and he has no problem with contraception. The Republican presidential contender was asked Sunday on NBC's \"Meet the Press\" about his comment in Thursday night's debate that \"all human life is worthy of protection, irrespective of the circumstances in which that human life was created.\" Rubio said Sunday that he will support \"any legislation that reduces the number of abortions.\" Moments from Marco Rubio's career 20 photos Moments from Marco Rubio's career 20 photos Florida Sen. Marco Rubio speaks in October 2013 at the Values Voter Summit, held by the Family Research Council in Washington. Hide Caption 1 of 20 Moments from Marco Rubio's career 20 photos Sen. Mike Lee, left, and Rubio talk before a news conference to introduce their proposal for an overhaul of the tax code in March. Hide Caption 2 of 20 Moments from Marco Rubio's career 20 photos Rubio, center, arrives in the House chamber ahead of Israeli Prime Minister Benjamin Netanyahu's address to a joint meeting of the U.S. Congress in March. Hide Caption 3 of 20 Moments from Marco Rubio's career 20 photos Rubio speaks with the media after delivering remarks during the graduation of small business owners from the Goldman Sachs 10,000 Small Businesses program held in Miami in February. Hide Caption 4 of 20 Moments from Marco Rubio's career 20 photos Rubio talks to aides in December before speaking on President Barack Obama's announcement about revising policies on U.S.-Cuba relations. Hide Caption 5 of 20 Moments from Marco Rubio's career 20 photos Rubio, left, talks to Sen. Lindsey Graham prior to a news conference on Capitol Hill in July. Hide Caption Moments from Marco Rubio's career 20 photos Rubio talks to reporters in June after a closed door briefing on Capitol Hill. Hide Caption 7 of 20 Moments from Marco Rubio's career 20 photos Rubio speaks to the media in front of a wall dedicated to the victims of the violence in Venezuela as he shows support for the Venezuelan community at a restaurant in Doral, Florida, in April 2014. Hide Caption Moments from Marco Rubio's career 20 photos Rubio speaks to the media at the Doral restaurant in April 2014. Hide Caption 9 of 20 Moments from Marco Rubio's career 20 photos Rubio checks his phone in March as he arrives for a Capitol Hill news conference to introduce a proposal for an overhaul of the tax code. Hide Caption Moments from Marco Rubio's career 20 photos Rubio, left, is greeted as he arrives at a restaurant in Doral in February 2014. Hide Caption 11 of 20 Moments from Marco Rubio's career 20 photos Rubio, left, and Florida Gov. Rick Scott speak to the media in Doral in February 2014. Hide Caption 12 of 20 Moments from Marco Rubio's career 20 photos From left, Sens. Cory Booker, Rubio, Kristen Gillibrand and John McCain wait for Obama to deliver the State of the Union address in January 2014. Hide Caption 13 of 20 Moments from Marco Rubio's career 20 photos Rubio addresses an event held by the American Enterprise Institute for Public Policy Research in January 2014. Hide Caption Moments from Marco Rubio's career 20 photos Paralympian Brad Snyder poses with Rubio during a Team USA Congressional visit in November 2013. Hide Caption 15 of 20 Moments from Marco Rubio's career 20 photos Rubio speaks in November 2013 during a campaign stop for Virginia Attorney General Ken Cuccinelli, the Republican candidate for governor of Virginia. Hide Caption 16 of 20 Moments from Marco Rubio's career 20 photos Rubio confers with McCain as U.S. Ambassador to Syria Robert Ford testifies before the Senate Foreign Relations Committee in October 2013. Hide Caption 17 of 20 Moments from Marco Rubio's career 20 photos Rubio, center, speaks to members of the media as Sen. Ron Johnson, left, and Rep. Ron DeSantis listen during a news conference on Capitol Hill in October 2013. Hide Caption 18 of 20 Moments from Marco Rubio's career 20 photos Rubio returns to the Capitol after meeting with Obama and other Republican leaders about the government shutdown in October 2013. Hide Caption 19 of 20 Moments from Marco Rubio's career 20 photos Rubio speaks to an aide on Capitol Hill as he arrives for the weekly Senate Republican Policy Committee luncheon in September 2013. Hide Caption 20 of 20 EXPAND GALLERY That, he said, includes a ban on abortions after 20 weeks -- even though \"that doesn't obviously cover the whole gamut.\" And, he said, it includes supporting abortion restrictions that include exceptions for rape, incest and when the life of the mother is threatened. \"A rape is an act of violence. It's a horrifying thing that happens. And fortunately, the number of abortions in this country that are due to rape are very small, less than 1% of the cases in the world. But they happen. And they're horrifying. And they're tragic. And I recognize that,\" Rubio said. \"I also recognize that because of the existence of over-the-counter morning after, not to mention medical treatment that's now available immediately after the assault, that should be widely available to victims, we can bring that number down to zero,\" he said. \"That being said, I personally and deeply believe that all human life is worthy of the protection of our laws. I do. And I believe that irrespective of the conditions by which that life was conceived or anything else.\" Rubio said he doesn't, though, support restrictions on access to morning-after pills or intrauterine devices that prevent pregnancies. \"I don't want to ban any contraceptive efforts,\" Rubio said. \"Obviously, my faith has a teaching that governs me in my personal life on these issues. But I think our laws on those issues are different.\" He also offered sympathy for girls and women who face difficult decisions about whether to have abortions. \"I don't say it's easy. Listen, you're 15 years old and you become pregnant and you're scared and you have your whole life ahead of you and you're facing this, that is a hard situation. I tell people all the time, 'Don't pretend this is easy.' This is a difficult question,\" Rubio said. \"But when asked to make a decision between two very hard circumstances,\" he said, \"I've personally reached the conclusion if I'm going to err, I'm going to err on the side of life, on the side of protecting a human being.\"", "external_links": [], "published": "2015-08-10T17:11:00.000+03:00", "crawled": "2015-08-10T17:19:19.871+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}