{"organizations": [], "uuid": "8d0bf270bd53d3aebff9dd5b35dec21e3e7b398a", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/obama-y-el-ministro-de-exteriores-irani-se-dieron-la-mano-en-nueva-york/", "country": "", "title": "Obama y el ministro de Exteriores iraní se dieron la mano en Nueva York | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama y el ministro de Exteriores iraní se dieron la mano en Nueva York | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "8d0bf270bd53d3aebff9dd5b35dec21e3e7b398a"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/obama-y-el-ministro-de-exteriores-irani-se-dieron-la-mano-en-nueva-york/", "ord_in_thread": 0, "title": "Obama y el ministro de Exteriores iraní se dieron la mano en Nueva York | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama y el ministro de Exteriores iraní se dieron la mano en Nueva York Published September 29, 2015 EFE \nNaciones Unidas, 29 sep (EFEUSA).- El presidente Barack Obama y el ministro de Exteriores iraní, Mohamed Yavad Zarif, se saludaron brevemente y se dieron la mano este lunes en la ONU, según dijo hoy un alto funcionario estadounidense. \nEl apretón de manos, que no estaba previsto y es el primero entre un presidente estadounidense y un jefe de la diplomacia iraní en más de tres décadas, se produjo el lunes durante el almuerzo ofrecido por el secretario general de la ONU, Ban Ki-moon a los líderes mundiales que asisten a la Asamblea General del organismo. \nSegún la fuente estadounidense, que habló bajo anonimato, el saludo entre Obama y Zarif fue muy breve y duró menos de un minuto. \nObama y el presidente iraní, Hasán Rohaní, coincidieron este lunes en la ONU durante los debates de la Asamblea General del organismo, pero no se reunieron. \nLa Casa Blanca ya había anticipado que Obama no preveía reunirse con Rohaní en la ONU. \nEn septiembre de 2013, mientras estaban en marcha las negociaciones sobre el programa nuclear iraní que desembocaron en el acuerdo alcanzado en julio pasado, Obama y Rohaní hablaron por teléfono y esa conversación fue la primera entre los máximos líderes de ambos países desde 1979. \nEEUU e Irán no tienen vínculos diplomáticos desde la crisis de los rehenes que siguió a la Revolución Islámica de 1979, pero las relaciones bilaterales han mejorado en el marco de las negociaciones nucleares y el posterior acuerdo sellado en julio. \nEn su discurso ante la Asamblea General de la ONU, Obama dijo este lunes que EEUU está preparado para trabajar con todos los países, incluido Irán, para tratar de buscar una solución al conflicto en Siria. \nDurante el fin de semana, Zarif y el secretario de Estado John Kerry, se reunieron en Nueva York para hablar de la implementación del acuerdo nuclear. EFEUSA ", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T11:59:24.312+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}