{"organizations": [], "uuid": "f7883a70f0b594498985ffee217115782403cf5d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_090315getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/253143-court-refuses-to-block-obama-climate-rule", "country": "US", "title": "Court refuses to block Obama climate rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Court refuses to block Obama climate rule", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T00:43:00.000+03:00", "replies_count": 0, "uuid": "f7883a70f0b594498985ffee217115782403cf5d"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/253143-court-refuses-to-block-obama-climate-rule", "ord_in_thread": 0, "title": "Court refuses to block Obama climate rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Court refuses to block Obama climate rule Getty By Timothy Cama - 09/09/15 05:43 PM EDT \nA federal appeals court declined requests Wednesday to block the Obama administration’s landmark climate rule for power plants. \nIn a short, two-paragraph order filed just after 5 p.m., the Court of Appeals for the District of Columbia Circuit ruled that West Virginia, more than a dozen other states and a coal-mining company do not qualify for a judicial stay that would stop the Environmental Protection Agency (EPA) from implementing the regulation until the litigation is complete. ADVERTISEMENT The three-judge panel ordered that the petitions be denied “because petitioners have not satisfied the stringent standards that apply to petitions for extraordinary writs that seek to stay agency action.\nIt’s the first major loss for the conservative states since President Obama announced the final version of the regulation in early August. It seeks a 32 percent slash in the power sector’s carbon emissions by 2030. \nThe ruling means the states will have to wait until the EPA publishes the final rule in the Federal Register, which it plans to do by the end of October, to file a lawsuit against it and ask for a judicial stay. \nWest Virginia led a similar group of states earlier this year in a challenge to the EPA’s climate rule before it was made final. The same judges of the D.C. Circuit Court ruled in the EPA’s favor, saying that proposed rules cannot be challenged in court. \nThe states filed for the judicial stay in August, only four days after Obama announced the new rule, and argued that the matter was so urgent that it demanded the court’s immediate attention before the EPA could publish the regulation. \nThe EPA said the challenge was premature. \n“Publication in the Federal Register, while shortly forthcoming, has not yet occurred,” lawyers wrote . “Thus, both the plain terms of the [Clean Air] Act and this Court’s binding precedent compel dismissal of these petitions.” Tags:", "external_links": [], "published": "2015-09-10T00:43:00.000+03:00", "crawled": "2015-09-10T01:43:02.036+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}