{"organizations": ["Congress", "House", "Ohio Republican"], "uuid": "0630f2cfb2e33cc2bb82bb4600b9a41ab3ccb03a", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/25/politics/president-obama-john-boehner-patriot/index.html", "country": "", "title": "Obama: John Boehner 'a patriot' - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama: John Boehner 'a patriot' - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "0630f2cfb2e33cc2bb82bb4600b9a41ab3ccb03a"}, "author": "", "url": "http://www.cnn.com/2015/09/25/politics/president-obama-john-boehner-patriot/index.html", "ord_in_thread": 0, "title": "Obama: John Boehner 'a patriot' - CNNPolitics.com", "locations": ["America", "Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boehner", "Barack Obama", "Xi Jinping", "John", "John Boehner", "Obama"], "text": "House Speaker John Boehner resigns 02:29 Washington (CNN) President Barack Obama said the news that House Speaker John Boehner is resigning from Congress was a \"surprise,\" and he called him \"a patriot.\" Obama said he got a chance to speak with Boehner directly about his decision before a joint press conference with Chinese President Xi Jinping, who is at the White House for a state visit. He told reporters gathered at that press conference that Boehner is an admirable man. \"I just heard the news as I was coming out of the meeting here so it took me by surprise, and I took the time prior to this press conference to call John directly,\" Obama said. \"John Boehner is a good man -- he is a patriot, he cares deeply about the House, an institution for which he has served for a long time, he cares about his constituency and he cares about America.\" The two leaders have found themselves on opposite sides of a number of fights during Obama's administration and Boehner's tenure, but Obama said despite the political disagreements, Boehner always conducted himself with \"courtesy\" and \"civility.\" \"He has kept his word when he has made a commitment to me, he is somebody who has been gracious and, I think, maybe most importantly, that he is somebody who understands that in government, in governance, you don't get 100% of what you want, but you have to work with people who you disagree with, sometimes strongly, in order to do the people's business.\" Lawmakers react to Boehner's announcement Obama said he would not get into who might replace Boehner, but would reach out as soon as that person is named. Boehner announced Friday he would be resigning in a move that surprised nearly everyone. He told reporters that he only made the decision Friday morning, though he had been prepared to announce he would resign at the end of the year. The Ohio Republican cited leadership \"turmoil\" -- a reference to the conservative wing of his party that had been fighting his leadership and challenging his speakership. Obama said he hopes that the next speaker will try to work across the aisle. \"The one thing I will say is that my hope is there's a recognition on the part of the next speaker -- something i think that John understood, but at times it was challenging to bring his caucus along -- that we can have significant differences on issues but that doesn't mean you shut down the government. ... There's no weakness is that. you don't get what you want 100% of the time.\" ", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-26T00:47:45.156+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}