{"organizations": [], "uuid": "40af47e03c374fd57ea9dd8e8c58b5f4c77ab1c9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e5e1951d00002f001467e1.jpeg?cache=lsMBl1S0N7", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/missouri-man-marijuana-prison_55e5e059e4b0b7a9633a6296", "country": "", "title": "Missouri Man Sentenced To Life In Prison Over Marijuana Is Set Free", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Missouri Man Sentenced To Life In Prison Over Marijuana Is Set Free", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T22:21:00.000+03:00", "replies_count": 0, "uuid": "40af47e03c374fd57ea9dd8e8c58b5f4c77ab1c9"}, "author": "", "url": "http://www.huffingtonpost.com/entry/missouri-man-marijuana-prison_55e5e059e4b0b7a9633a6296", "ord_in_thread": 0, "title": "Missouri Man Sentenced To Life In Prison Over Marijuana Is Set Free", "locations": ["Missouri"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Ferner", "Jeff Mizanskey", "Huffington"], "text": "Email Missouri Man Sentenced To Life In Prison Over Marijuana Is Set Free \"The Jeff Mizanskey case simply shows that the war on drugs has reached the pinnacle of absurdity.\" Matt Ferner National Reporter, The Huffington Post Posted: 09/01/2015 02:57 PM EDT | Edited: 18 minutes ago \nJeff Mizanskey, a 61-year-old man who was serving life in prison for nonviolent marijuana offenses, walked out of a Missouri prison a free man on Tuesday morning. \nMizanskey had already spent 21 years behind bars, but was notified by the Missouri Department of Corrections in August that his application for parole had been granted . \n\"The Jeff Mizanskey case simply shows that the war on drugs has reached the pinnacle of absurdity,\" Tony Papa, manager of media relations for the Drug Policy Alliance, told The Huffington Post. \"If there was ever a case that deserved drug war reparation, this is it. Pay the man in full for the time he has served for a nonviolent drug crime. He deserves it.\" \nEarlier this year, Mizanskey became eligible for parole when Missouri Gov. Jay Nixon (D) commuted his life sentence, while granting pardons to five other nonviolent offenders who had already completed their punishments. Parole was an option that Mizanskey did not have previously because he had been sentenced as a \" prior and persistent drug offender \" under Missouri's three strikes law, which was repealed last year . \nAll three of Mizanskey's offenses involved marijuana. He was given a life sentence after a conviction for attempting to sell about 6 pounds of pot in a 1993 police sting operation. \n\"He saw rapists, murderers and child molesters get out of prison while he was sentenced to die behind bars for something that should not be a crime to begin with,\" Mizanskey's attorney, Dan Viets, said upon his client's release, KOMU-TV reported . \nThe Free Jeff Mizanskey Facebook page has been posting photos of Mizanskey reunited with family since he was set free Tuesday morning: \nMarijuana offenses, mostly involving simple possession, account for roughly half of all drug-related crimes. According to a recent report from the American Civil Liberties Union, 88 percent of the more than 8 million marijuana arrests between 2001 and 2010 were for possession alone. \nA recent analysis of more than 75,000 federal criminal cases from 2014 by the United States Sentencing Commission found that drug-related offenses accounted for one-third of all of the year's cases -- the largest single category, followed closely by cases involving immigration. Of that third, about 25 percent involved marijuana. \nAnd at the local level, a study from the Vera Institute of Justice released earlier this year found that the majority of people incarcerated in local and county jails are locked up for minor offenses, about one-quarter of whom were accused or convicted of crimes related to drugs. \nThe U.S. is home to only about 5 percent of the world's population, but houses roughly a quarter of the world's prisoners . Harsh sentences for nonviolent drug possession and distribution crimes are part of the reason the nation's prison population has ballooned since the 1970s . \nAlso on HuffPost: 27 Reasons Why The U.S. Shouldn't Lead The War On Drugs of ", "external_links": [], "published": "2015-09-01T22:21:00.000+03:00", "crawled": "2015-09-01T22:21:10.733+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}