{"organizations": [], "uuid": "49d059501e344511a542877d71b8e284c01498e8", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/castro-vincula-mas-avances-fin-de-embargo-y-obama-pide-mas-reformas-en-cuba/", "country": "", "title": "Castro vincula más avances a fin de embargo y Obama pide más reformas en Cuba | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Castro vincula más avances a fin de embargo y Obama pide más reformas en Cuba | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "49d059501e344511a542877d71b8e284c01498e8"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/castro-vincula-mas-avances-fin-de-embargo-y-obama-pide-mas-reformas-en-cuba/", "ord_in_thread": 0, "title": "Castro vincula más avances a fin de embargo y Obama pide más reformas en Cuba | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Castro vincula más avances a fin de embargo y Obama pide más reformas en Cuba Published September 29, 2015 EFE \nMiriam Burgués y Mario Villar \nNaciones Unidas, 29 sep (EFEUSA).- El presidente de Cuba, Raúl Castro, vinculó hoy la consecución de nuevos avances hacia la normalización con EEUU a una actuación más contundente contra el embargo del presidente Barack Obama, quien a su vez pidió más reformas y respeto a los derechos humanos en la isla. \nCastro y Obama celebraron en la sede de la ONU su segunda reunión desde el anuncio, hace nueve meses, de un proceso de normalización de las relaciones bilaterales y la primera desde la reapertura de las embajadas en Washington y La Habana en julio pasado. \nLa lectura que hicieron los dos gobiernos al término del encuentro fue muy distinta, reflejo de las grandes diferencias que todavía persisten para lograr la normalización plena. \n\"No habrá normalización con bloqueo, y no habrá progreso sustancial en el proceso de normalización sin cambios sustanciales en la aplicación del bloqueo\", explicó en una conferencia de prensa el canciller cubano, Bruno Rodríguez. \nSegún Rodríguez, hasta ahora las acciones de Obama en ese ámbito \"no tocan ningún hecho significativo de la aplicación del bloqueo contra Cuba\" y su alcance y profundidad han sido \"limitadísimas\". \n\"El bloqueo impuesto a Cuba persiste en su totalidad, está en completa aplicación, no ha sido en absoluto modificado\", insistió el canciller, quien recordó, además, que para la isla la devolución de los territorios donde se encuentra la base estadounidense de Guantánamo es un \"elemento de alta prioridad\". \nPor su parte, la Casa Blanca emitió un comunicado en el que explicó que Obama dijo a Castro que las \"reformas continuas\" en Cuba \"aumentarían el impacto\" de los cambios adoptados por su Gobierno para relajar el embargo hacia la isla, cuya eliminación completa depende del Congreso estadounidense. \nEn ese sentido, Obama destacó ante Castro los recientes \"cambios normativos\" anunciados por su Gobierno y que \"permitirán a más estadounidenses viajar y hacer negocios con Cuba\", además de \"ayudar a mejorar las vidas del pueblo cubano\". \nLa semana pasada entraron en vigor nuevas normas adoptadas por el Gobierno que amplían a sus ciudadanos las facilidades para viajar, hacer negocios, enviar remesas y prestar servicios de telecomunicaciones en Cuba, aunque el turismo sigue prohibido. \nAdemás, el portavoz de la Casa Blanca, Josh Earnest, comentó a los periodistas en el avión de regreso a Washington que Obama \"reafirmó\" ante Castro su \"compromiso\" con lograr que el Gobierno cubano \"haga un mejor trabajo\" en la protección de los derechos humanos de sus ciudadanos. \nLa reunión de hoy siguió a la que Obama y Castro mantuvieron en Panamá en abril pasado en el marco de la Cumbre de las Américas y que fue el primer encuentro entre presidentes de Cuba y Estados Unidos en más de cinco décadas. \nEste lunes los dos mandatarios intervinieron ante la Asamblea General de Naciones Unidas y ambos hablaron del acercamiento bilateral y del embargo económico impuesto a Cuba por EEUU hace más de medio siglo. \n\"Estoy seguro de que el Congreso levantará inevitablemente un embargo que ya no debería estar ahí\", enfatizó Obama en su discurso, en el que también prometió que su país \"seguirá defendiendo los derechos humanos\" en Cuba. \nA su turno, Castro reiteró en su intervención que el \"largo proceso de normalización de las relaciones\" culminará cuando, entre otras medidas, el país norteamericano devuelva la base de Guantánamo y pague compensaciones por el embargo. \nComo cada año desde hace más de dos décadas, Cuba está impulsando en la Asamblea General de la ONU una resolución para pedir el fin del embargo, un texto que habitualmente obtiene un respaldo mayoritario y siempre el voto en contra de EEUU. \nEl Gobierno estadounidense adelantó esta semana que aún no ha tomado una decisión sobre cómo votará en octubre ante ese documento, lo que ha alimentado las especulaciones acerca de que, por primera vez, podría optar por abstenerse. \nMientras, funcionarios de los dos países iniciaron el lunes los primeros contactos a puerta cerrada, en La Habana, para normalizar el servicio aéreo entre Cuba y EEUU. \nAdemás, representantes del \"lobby\" agrícola de los estados de Arkansas y Carolina del Norte se encuentran de visita en Cuba para explorar posibilidades de negocio y la secretaria de Comercio estadounidense, Penny Pritzker, viajará a La Habana los días 6 y 7 de octubre. EFEUSA \nmb-mvs ", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T12:02:07.240+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}