{"organizations": [], "uuid": "6420528e4bcfb6f6190c782a507171d2f2863419", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55ddc7d817000043015689af.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/derek-jeter-obama-golf_55ddc1eae4b0a40aa3acd08c", "country": "", "title": "Derek Jeter Flawlessly Hustled President Obama In A Round Of Golf", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Derek Jeter Flawlessly Hustled President Obama In A Round Of Golf", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "6420528e4bcfb6f6190c782a507171d2f2863419"}, "author": "", "url": "http://www.huffingtonpost.com/entry/derek-jeter-obama-golf_55ddc1eae4b0a40aa3acd08c", "ord_in_thread": 0, "title": "Derek Jeter Flawlessly Hustled President Obama In A Round Of Golf", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Derek Jeter", "Justin Block", "Obama"], "text": "Derek Jeter Flawlessly Hustled President Obama In A Round Of Golf A retired ball player duped a sitting president. SMH. Justin Block Associate Sports Editor, The Huffington Post Posted: 08/26/2015 10:53 AM EDT | Edited: 4 hours ago ASSOCIATED PRESS \nStealing from the president feels like a thing that should be a crime, but when you're Derek Jeter, receiving a pardon is a laughing matter to President Barack Obama. \n\"Derek Jeter stole money from me,\" said Obama to laughter at a fundraising event for the Nevada Democratic Party on Monday night. “And it was clearly a set-up.” \nLast November, Obama played a round of golf with Jeter and Las Vegas Sun newspaper owner Brian Greenspun at Shadow Creek Golf Course in Las Vegas. Greenspun hosted Monday night's event for the Democrats, but back in November, he was on Jeter's side of the golf green. ASSOCIATED PRESS Derek Jeter practices his golf stroke at Fenway Park in 2006. \"I knew Derek, but I hadn’t played golf with him before, and as we got up to the practice range, he was shanking balls everywhere,\" said Obama. \n\"And I said, well, do you play golf, Derek? He said, 'I just started two weeks ago.'\" A photo posted by The Players' Tribune (@playerstribune) on Mar 13, 2015 at 3:55pm PDT \nObama, not realizing that this was, in every way, a classic hustler's setup, went ahead and gave Jeter a 30-stroke handicap and a cash bet on the final score. Failure -- and a lighter wallet -- instantly became an inevitability. \n\"And then on the first tee suddenly the ball just went straight and down the middle of the fairway,\" continued Obama, according to a transcript of his remarks provided by the White House. \"We had to take a picture of me handing Derek Jeter money at the end of it.\" \nIce cold. Tim Boyles via Getty Images \n", "external_links": [], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T22:38:45.873+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}