{"organizations": ["Bloomberg"], "uuid": "86c329018d73aabc7ecb8ef26ecda64ce02b956b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55f1b2d014000077002e54ff.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/boehner-suing-obama-iran_55f1a8c5e4b03784e2783aca", "country": "", "title": "Boehner Opens Door To Suing Obama Over Iran Deal", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Boehner Opens Door To Suing Obama Over Iran Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T20:16:00.000+03:00", "replies_count": 0, "uuid": "86c329018d73aabc7ecb8ef26ecda64ce02b956b"}, "author": "", "url": "http://www.huffingtonpost.com/entry/boehner-suing-obama-iran_55f1a8c5e4b03784e2783aca", "ord_in_thread": 0, "title": "Boehner Opens Door To Suing Obama Over Iran Deal", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boehner", "Laura Barron-Lopez"], "text": "Boehner Opens Door To Suing Obama Over Iran Deal Boehner said a lawsuit against the president is a \"very possible\" option. Laura Barron-Lopez Congressional Reporter, The Huffington Post Posted: 09/10/2015 12:54 PM EDT | Edited: 7 minutes ago Credit: Bloomberg via Getty Images \nWASHINGTON -- House Speaker John Boehner (R-Ohio) said Thursday that all options are on the table in the fight to stop the Iran nuclear deal from moving forward, including suing the president. \nBoehner said a lawsuit against President Barack Obama over the deal is \"an option that is very possible.” \nJust hours after returning from summer recess, Boehner found himself in the middle of a revolt mounted by conservative members of his caucus who want to delay a vote on a resolution of disapproval on the Iran deal, insisting the administration broke the law. \nAfter an afternoon meeting on Wednesday, Republicans emerged with a new strategy on how to handle votes on the deal, deciding to hold three instead of one. The first vote, which is expected Thursday, will be on a resolution stating Obama did not submit all the documents related to the Iran deal and therefore the 60-day congressional review period has yet to start. A possible lawsuit would be based on that premise. \nHouse Republicans argue the administration did not send over all of the documents, specifically ones from the International Atomic Energy Agency, or IAEA, on the deal, which aims to curb Iran's nuclear program in exchange for sanctions relief. \nThe documents in question are two confidential agreements between Iran and the IAEA relating to the agency's investigation into whether Iran pursued nuclear weapons development activity in the past. These agreements were reached at the same time as the broader agreement between Iran, the U.S. and five world powers, but are separate from the main nuclear accord. Because of confidentiality protocols, the IAEA will not share the text of these two agreements with other states, including the U.S. \n\"Clearly, our members do not believe the president has complied with the law,\" Boehner said. \nAt this point, the legislative debate over the accord is essentially symbolic. Supporters of the deal and the administration have started their victory lap, knowing the fate of the pact is assured with 42 senators backing it the upper chamber. \nA number of House Republicans, however, are now arguing that the two side agreements constitute part of the deal with Iran and must be provided to lawmakers under a law authored by Sens. Bob Corker (R-Tenn.) and Ben Cardin (D-Md.) earlier this year. The law requires the president to present Congress with the complete text of the nuclear accord. \n\"This debate is far from over,\" Boehner said Thursday, defending his decision to hold three votes to draw out the debate. \"It is just beginning. We will use every tool at our disposal to stop, slow and delay this agreement from being fully implemented.\" \nPressed on realistic options Republicans could use to stop the deal, Boehner said he is looking at everything. \n“We are pursuing a number of options and ideas that members have for what could happen in the weeks to come. We [will] continue to investigate those and look into them and see if they are viable or not,\" he said. \nAsked if Republicans would try to attach something on Iran to a continuing resolution to fund the government, which needs to be passed by Sept. 30 , Boehner said, \"All options are on the table.\" \nDespite Boehner's comments, Rep. Charlie Dent (R-Penn.) told reporters after the conference meeting on Wednesday that the lawsuit ida would not fly. \n\"I've talked to a number of attorneys, and all the folks I've talked to on that legal strategy [say] that we will not be successful in court,\" Dent said. \"I said in front of the conference this morning, 'If we do not vote on disapproval, if we do not vote on this, if the Congress were to do nothing, the Congress would look feckless, weak, ineffective, and President Obama would take his flag and plant it in the ground and declare victory. And say you know, 'See you in court. In 15 years, we'll have a decision.'\" \nDent added that if they were to sue Obama, it would \"take a hell of a long time to get a resolution.\" \nSenate Republican leaders have shown no indication they plan to follow the House's lead, arguing the 60-day review clock afforded to Congress is up on Sept. 17. \nJessica Schulberg contributed reporting. ", "external_links": [], "published": "2015-09-10T20:16:00.000+03:00", "crawled": "2015-09-10T20:16:20.112+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}