{"organizations": ["DPRK", "al-Nusra Front", "U.S. Army", "U.N.", "CIA", "CNN", "Bae", "Fowle", "FBI", "ISIS", "State", "StoneBridge Group", "White House", "The Washington Post", "Muslim Brotherhood", "U.S. Embassy", "State Department"], "uuid": "3bba4f49ec1b1ee4f13178a97543d555b5e2191a", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/28/politics/barack-obama-envoy-hostage-affairs/index.html", "country": "", "title": "Obama taps first hostage affairs envoy - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Obama taps first hostage affairs envoy - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T02:11:00.000+03:00", "replies_count": 0, "uuid": "3bba4f49ec1b1ee4f13178a97543d555b5e2191a"}, "author": "", "url": "http://www.cnn.com/2015/08/28/politics/barack-obama-envoy-hostage-affairs/index.html", "ord_in_thread": 0, "title": "Obama taps first hostage affairs envoy - CNNPolitics.com", "locations": ["Seoul", "United States", "Iran", "Cuba", "Washington", "Tehran", "Pakistan", "American", "North Korea", "New Mexico", "Afghanistan", "California", "Egypt", "Cairo", "Mexico", "U.S.", "Venezuela", "Soviet Union", "Balkans", "Palo Alto", "China", "Pyongyang"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robert King", "Yeganeh Salehi", "al Qaeda", "Esfandiari", "Kerry", "Bill Clinton", "Madeleine Albright", "Hugo Chavez", "John Kerry", "Junwas", "Warren Weinstein", "Matthew Todd Miller", "Shane Bauer", "Euna Lee", "Jim", "Nicolas Maduro", "Sarah Shourd", "Lisa Monaco", "Kim", "Jeffrey Edward Fowle", "Mohamed Soltan", "Allison Brennan", "Caitlin Coleman", "Timothy Tracy", "Joshua Boyle", "Bowe Bergdahl", "Will Ripley", "Eddie Yong", "Bergdahl", "Arthur Schneier", "Coleman", "Laura Ling", "Obama", "Abedini", "Bauer", "Fowle", "Haleh Esfandiari", "Robert Levinson", "Lyn Coleman", "James O'Brien", "Miller", "Robert Becker", "Kenneth Bae", "Park", "Barack Obama", "Hekmati", "Bill Richardson", "Josh Fattal", "Fattal", "Saeed Abedini", "Jeff Newman", "Jason Rezaian", "Yanira Maldonado", "Amir Hekmati", "Soltan", "Jimmy Carter", "Robert Park", "Peter Theo Curtis", "James Foley", "Merrill Newman", "Alan Gross", "Aijalon Gomes", "Levinson", "Gary", "Kim Jong Il", "Newman", "Shourd", "Linda Boyle", "O'Brien", "Tracy"], "text": "Obama: We should do everything to help hostages 01:50 Story highlights James O'Brien, a top adviser to former Secretary of State Madeleine Albright, will lead the diplomatic efforts to free American hostages Obama launched a full-scale review of U.S. hostage recovery efforts that concluded in June Washington (CNN) President Barack Obama will name a former State Department official who served as a top negotiator during the Bosnian War as the first special envoy for hostage affairs. James O'Brien, who also served as a senior adviser to Secretary of State Madeleine Albright, will lead the U.S.'s diplomatic efforts with foreign governments as it looks to secure the release of American hostages held abroad, the White House said in a press release Friday. Obama created the position in June as part of an effort to streamline the U.S.'s hostage recovery efforts after several American hostages held by terrorist groups were killed in the last year. More than 30 Americans were still held abroad when Obama announced the policy changes that month. The White House launched a review of its hostage recovery efforts after the families of several American hostages killed abroad complained of ineffective, tangled and, at times, uncaring efforts to free their loved ones. O'Brien is set to be the first person appointed to one of the newly created positions stemming from the hostage policy review, which concluded in June. Secretary of State John Kerry called O'Brien \"exactly the right person for a job that demands a high level of diplomatic experience\" and finding solutions to complex problems. Kerry said O'Brien will be \"in close contact with the families of American hostages,\" will meet with foreign leaders and U.S. policymakers to craft effective strategies to free American hostages. 23 photos: Americans detained abroad 23 photos: Americans detained abroad Jason Rezaian – Jason Rezaian, The Washington Post bureau chief in Tehran; his wife Yeganeh Salehi and two freelance journalists were detained on July 22, 2014, according to the newspaper. An Iranian official confirmed to CNN at the time that the group was being held by authorities but did not say what they were charged with. Hide Caption 1 of 23 23 photos: Americans detained abroad Saeed Abedini – A 33-year-old U.S. citizen of Iranian birth, Abedini was sentenced to eight years in prison in January 2013. He was accused of attempting to undermine the Iranian government and endangering national security by establishing home churches. He was detained in Iran on September 26, 2012, according to the American Center for Law and Justice. Hide Caption 2 of 23 23 photos: Americans detained abroad Robert Levinson – Retired FBI agent Robert Levinson has been missing since 2007 . His family says he was working as a private investigator in Iran when he disappeared, and multiple reports suggest Levinson may have been working for the CIA. His family told CNN in January that they have long known that Levinson worked for the CIA, and they said it's time for the government to lay out the facts about Levinson's case. U.S. officials have consistently denied publicly that Levinson was working for the government, but they have repeatedly insisted that finding him and bringing him home is a \"top\" priority. The FBI increased its reward for information on Levinson from $1 million to $5 million, it announced in March. Hide Caption 3 of 23 23 photos: Americans detained abroad Amir Hekmati – An Iranian court threw out a 2011 death sentence forAmir Hekmati, a former U.S. Marine charged with spying. But he was secretly retried in Iran and convicted of \"practical collaboration with the U.S. government,\" his sister told CNN on April 11. He was sentenced to 10 years in prison, she said. Hekmati was detained in August 2011 during a visit to see his grandmother. His family and the Obama administration deny accusations he was spying for the CIA. Hide Caption 4 of 23 23 photos: Americans detained abroad Joshua Boyle and Caitlin Coleman – Mothers Linda Boyle, left, and Lyn Coleman hold photo of their married children, Joshua Boyle and Caitlin Coleman, who were kidnapped by the Taliban in late 2012. Coleman was pregnant when she was kidnapped and is believed to have had a child in captivity. Hide Caption 5 of 23 23 photos: Americans detained abroad Mohamed Soltan – Jailed since 2013 and sentenced to life for supporting the Muslim Brotherhood in Egypt, Mohamed Soltan has been released , the U.S. Embassy in Cairo said on Saturday, May 30, 2015. Soltan's family denies he belonged to the Brotherhood. Soltan had been a dual U.S. and Egyptian citizen, but renounced his Egyptian citizenship as a condition of his release. Hide Caption 6 of 23 23 photos: Americans detained abroad U.S. officials revealed on April 23 that Warren Weinstein , a 73-year-old American aid worker that had been held hostage in Pakistan since August 2011, had been accidentally killed in a U.S. drone strike targeting al Qaeda. Hide Caption 7 of 23 23 photos: Americans detained abroad Jeffrey Edward Fowle – One of three Americans detained in North Korea, Fowle was released and sent home, a State Department official told CNN on Tuesday, October 21. Fowle was accused of leaving a Bible in a hotel where he was staying. North Korea announced Fowle's detention in June, saying he had violated the law by acting \"contrary to the purpose of tourism.\" Fowle told CNN: \"I've admitted my guilt to the government and signed a statement to that effect and requested forgiveness from the people and the government of the DPRK.\" Hide Caption 8 of 23 23 photos: Americans detained abroad Kenneth Bae – In May 2013, a North Korean court sentenced Bae, a U.S. citizen, to 15 years of hard labor for committing \"hostile acts\" against the state. North Korea claimed Bae was part of a Christian plot to overthrow the regime. In a short interview with CNN on Monday, September 1, Bae said he is working eight hours a day, six days a week at a labor camp. \"Right now what I can say to my friends and family is, continue to pray for me,\" he said. After months in detention, he and fellow American detainee Matthew Todd Miller were released in November 2014 . Hide Caption 9 of 23 23 photos: Americans detained abroad Matthew Todd Miller – Miller , the American sentenced to six years of hard labor in North Korea began serving his six-year sentence on September 25. He was one of three Americans detained in North Korea who spoke to CNN's Will Ripley in September 2014 and implored the U.S. government for help. The 24-year-old was accused of tearing up his tourist visa and seeking asylum upon entry. He and Kenneth Bae were released in November 2014. Hide Caption 10 of 23 23 photos: Americans detained abroad Peter Theo Curtis – American journalist Peter Theo Curtis was handed over to U.N. peacekeepers on August 24 after nearly two years in captivity. He is believed to have been captured in October 2012 and held by the al-Nusra Front, a Syrian rebel group with ties to al Qaeda. Hide Caption 11 of 23 23 photos: Americans detained abroad Alan Gross – Gross, at right with Rabbi Arthur Schneier was jailed while working as a subcontractor in Cuba in December 2009. Cuban authorities say Gross tried to set up illegal Internet connections on the island. Gross says he was just trying to help connect the Jewish community to the Internet. Former President Jimmy Carter and New Mexico Gov. Bill Richardson both traveled to Cuba on Gross' behalf. He was eventually released in December 2014 . Hide Caption 12 of 23 23 photos: Americans detained abroad Sgt. Bowe Bergdahl – This undated image provided by the U.S. Army shows Bergdahl, who had been held by insurgents in Afghanistan since 2009. The White House announced Bergdahl's release on May 31, 2014. Bergdahl was released in exchange for five senior Taliban members held by the U.S. military. In March the U.S. military charged Bergdahl with one count each of \"Desertion with Intent to Shirk Important or Hazardous Duty,\" and \"Misbehavior Before The Enemy by Endangering the Safety of a Command, Unit or Place.\" Hide Caption 13 of 23 23 photos: Americans detained abroad Merrill Newman – U.S. tourist and Korean War veteran Merrill Newman arrives at the Beijing airport on December 7, 2013, after being released by North Korea. Newman was detained in October 2013 by North Korean authorities just minutes before he was to depart the country after visiting through an organized tour. His son Jeff Newman said the Palo Alto, California, man had all the proper paperwork and set up his trip through a North Korean-approved travel agency. Hide Caption 14 of 23 23 photos: Americans detained abroad Yanira Maldonado – Mexican authorities arrested Yanira Maldonado, a U.S. citizen, right, in May 2013, for alleged drug possession. She and her husband, Gary, were traveling from Mexico back to the United States when their bus was stopped and searched. She was released a few days later and is now back in the United States. Hide Caption 15 of 23 23 photos: Americans detained abroad Laura Ling and Euna Lee – North Korea has arrested Americans before, only to release them after a visit by a prominent dignitary. Journalists Laura Ling, center, and Euna Lee, to her right, spent 140 days in captivity after being charged with illegal entry to conduct a smear campaign. They were freed in 2009 after a trip by former President Bill Clinton. Hide Caption 16 of 23 23 photos: Americans detained abroad Aijalon Gomes – Former President Jimmy Carter negotiated the release of Aijalon Gomes, who was detained in 2010 after crossing into North Korea illegally from China. Analysts say high-level visits give Pyongyang a propaganda boost and a way to save face when it releases a prisoner. Hide Caption 17 of 23 23 photos: Americans detained abroad Eddie Yong Su Jun – Detained in April 2011, Junwas released by North Korea a month afterward. His alleged crime was not provided to the media. The American delegation that secured his freedom included Robert King, the U.S. special envoy for North Korean human rights issues. Hide Caption 18 of 23 23 photos: Americans detained abroad Robert Park – Without any apparent U.S. intervention, Park was released by North Korea in 2010. The Christian missionary crossed into North Korea from China, carrying a letter asking Kim Jong Il to free political prisoners and resign. North Korea's state-run news agency said Park was released after an \"admission and sincere repentance of his wrongdoings.\" Here, Park holds a photo of Kim and a malnourished child during a protest in Seoul. Hide Caption 19 of 23 23 photos: Americans detained abroad Josh Fattal, Sarah Shourd and Shane Bauer – Josh Fattal, center, Sarah Shourd, left, and Shane Bauer were detained by Iran while hiking near the Iraq-Iran border in July 2009. Iran charged them with illegal entry and espionage. Shourd was released on bail for medical reasons in September 2010; she never returned to face her charges. Bauer and Fattal were convicted in August 2011, but the next month they were released on bail and had their sentences commuted. Hide Caption 20 of 23 23 photos: Americans detained abroad Haleh Esfandiari – Esfandiari, an Iranian-American scholar, was detained at Iran's Evin Prison, spending months in solitary confinement before Iran released her on bail in August 2007. Esfandiari was visiting her ailing mother in Tehran when she was arrested and charged with harming Iran's national security. Hide Caption 21 of 23 23 photos: Americans detained abroad Robert Becker – Sixteen Americans were among the dozens arrested in December 2011 when Egypt raided the offices of 10 nongovernmental organizations that it said received illegal foreign financing and were operating without a public license. Many of the employees posted bail and left the country after a travel ban was lifted a few months later. Robert Becker, right, chose to stay and stand trial. He spent two years in prison and has since returned to the U.S. Hide Caption 22 of 23 23 photos: Americans detained abroad Timothy Tracy – Filmmaker Timothy Tracy was arrested in Venezuela in April 2013 on allegations of funding opponents of newly elected President Nicolas Maduro, successor to the late Hugo Chavez. Tracy went to Venezuela to make a documentary about the political division gripping the country. He was released in June 2013. Hide Caption 23 of 23 Kerry added that O'Brien will work closely with the soon-to-formed interagency \"hostage recovery fusion cell,\" which will be the nucleus for the U.S. government's hostage release efforts and is also a result of the hostage policy review. \"That review recognized the need for fully coordinated action across U.S. agencies in responding to hostage situations and to the military, diplomatic, legal, and humanitarian issues that such situations generate,\" Kerry said. \"In his new position, Jim will be focused on one overriding goal: using diplomacy to secure the safe return of Americans held hostage overseas.\" A common complaint among the families of hostages is the lack of an emissary to coax foreign governments into assisting with locating and recovering American hostages. O'Brien will now be the first to officially lead those efforts, taking on the role after 14 years at the Albright StoneBridge Group, a consulting firm where he is currently a vice chairman leading the firm's \"client engagements in the consumer goods, heath, entertainment, environment, and financial sectors,\" according to his biography on the firm's page. As special presidential envoy for the Balkans in the 1990s, O'Brien engaged the parties in the conflict and negotiated weapons control agreements with the Soviet Union. Lisa Monaco, Obama's Homeland Security adviser who oversaw the hostage policy review, said the new role O'Brien is set to fill will \"enhance our focus on diplomatic efforts to ensure the safe return of American hostages to their families.\" The parents of journalist James Foley, who was murdered by ISIS last summer, said in a statement they were \"grateful\" O'Brien has taken on the responsibility. \"We are grateful for Mr. O'Brien's willingness to serve as the Presidential Special Envoy for American hostages and hopeful that under his leadership many of our American hostages will return home,\" they said. CNN's Allison Brennan contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics ", "external_links": [], "published": "2015-08-29T02:11:00.000+03:00", "crawled": "2015-08-29T02:12:08.626+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}