{"organizations": [], "uuid": "7e9a0da2f03f6f628d34b975c88af2ddbe4f32a9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/5601408f2000002600242c31.jpeg?cache=rH6u33rflk", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-ji-xinping-visit_5601386ce4b0fde8b0cfa317", "country": "", "title": "6 Issues Obama Will Grapple With As Xi Jinping Visits America", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "6 Issues Obama Will Grapple With As Xi Jinping Visits America", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T20:27:00.000+03:00", "replies_count": 0, "uuid": "7e9a0da2f03f6f628d34b975c88af2ddbe4f32a9"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-ji-xinping-visit_5601386ce4b0fde8b0cfa317", "ord_in_thread": 0, "title": "6 Issues Obama Will Grapple With As Xi Jinping Visits America", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matt Sheehan"], "text": "6 Issues Obama Will Grapple With As Xi Jinping Visits America Here's what's at stake as the Chinese president visits the White House this week. Matt Sheehan China Correspondent, The WorldPost Kate Sheppard Senior reporter/Environment and energy editor, The Huffington Post Akbar Shahid Ahmed Foreign Affairs Reporter, The Huffington Post Posted: 09/22/2015 12:43 PM EDT \nPresident Barack Obama will welcome President Xi Jinping of China to the White House this week. Well, welcome might be a bit of a strong word -- you’ll see the standard 21-gun salutes and friendly photo ops, but experts say tensions between the two governments have built to some of the highest levels in years . \nHere is a guide to the big issues Obama and Xi (pronounced “she”) will be grappling with this week. Charles Dharapak/Associated Press Press releases announcing charges of economic espionage and trade secret theft against five Chinese military officers, all hackers in an international cyber-espionage case, in May 2014. Cyber Warfare \nThe U.S. and China are on opposite ends of a new kind of warfare: the cyber realm. And thus far, China has presented some of Washington’s greatest threats -- threats that even the government's former top nerd says the country isn’t prepared to handle. In recent weeks, top intelligence officials have sounded the alarm on cybersecurity, warning that U.S. defenses are lacking, especially when stacked up against China’s ever-developing cyberattack force. \nThe topic of cybersecurity is expected to come up during Xi’s visit. But it’s unclear how much common ground he and the U.S. can find. \nAnd talks about cyber could get awkward, especially since the Chinese were outed as the source of Washington’s most devastating cyberattack, and perhaps one of the greatest compromises of federal employee information in recent memory: the massive data breach of the Office of Personnel Management, the federal office that holds the personal data of all government workers. Some 21 million federal employees’ information was reportedly affected by the breach -- which initially occurred early last year and was only revealed this May -- and the information included highly sensitive information on security-cleared federal workers and intelligence professionals. \nThe administration has also been discussing pushback against the Chinese for the theft of intellectual property and trade secrets . Obama had threatened in recent weeks that the U.S. would strike back at China for the cybertheft, and even floated the idea of levying sanctions against companies and individuals who have benefited from the thefts, but it appears he’s tabled that plan for the immediate future, perhaps in the hope that the two countries can agree on mutual rules for cyber snooping. Xinhua News Agency via Getty Images Xi Jinping inspects troops during a military parade in Beijing. Climate Change \nThe global effort to curb planet-warming emissions will surely be a topic of conversation for the leaders of the world's two biggest emitters . When Xi and Obama met in China last November, they emerged with a landmark pact that committed the U.S. to cut emissions up to 28 percent by 2025 and China to reach peak emissions by 2030 or sooner. That agreement was hailed as one of the most important global breakthroughs on climate change, one that \"shifted the debate nationally and internationally toward finding solutions,\" said Jennifer Morgan, global director of the climate program at the World Resources Institute. \nThat partnership has continued. Last week, negotiators from both countries met in Los Angeles , where they focused on local government plans for implementing climate goals. In June, China released more specific plans for reducing its carbon intensity (the amount of emissions per unit of gross domestic product) and increasing the amount of energy it draws from renewable sources to 20 percent by 2030. The U.S. unveiled its own final rules for cutting emissions from power plants in August, which are crucial to meeting the Obama administration's overall climate goals. \nClimate change is expected to be high on the list of priorities for Xi at this year's meeting, though it will be hard to top last year's announcement. Those following the issue are hopeful that both countries will announce intentions to raise their ambitions on emissions following this year's meeting -- either by improving on the targets they released last year or otherwise signaling collaboration ahead of December's major climate negotiations in Paris. Eugene Hoshiko/Associated Press China's currency, the renminbi, was devalued by 2 percent this summer. China's Economic Turmoil \nChina and the U.S. have never had more points of economic contact -- and friction -- than they do today. Gyrations in Shanghai stocks this summer sent tremors through U.S. markets. The Obama administration ended up with egg on its face after trying and failing to convince allies not to join a new Chinese development bank. A sudden 2 percent devaluation in the renminbi, China's currency, led Donald Trump to boast that he’d give Xi a McDonald’s Big Mac rather than a state dinner . \nDespite those tensions, economics is one area where China and the U.S. are broadly in agreement about long-term goals. China is pushing through a wrenching transition away from a high-polluting industrial- and export-based economy, and toward service- and consumption-led growth. In theory, that would benefit U.S. companies: Instead of being undercut by cheap Chinese exports, revered U.S. brands could sell to China’s rising middle class. \nThe question is whether American companies will have access to those customers. After decades of betting big on growth from China, many American CEOs are grumbling louder than ever about tight restrictions on foreign participation in key Chinese industries. Xi is looking to assuage some of those fears by meeting with CEOs in Seattle. The two presidents are also looking to advance and maybe complete negotiations on a bilateral investment treaty that could open new markets. But it’s unknown whether the two leaders will have anything to show by week’s end. Ng Han Guan/Associated Press Chinese soldiers march with flags during a parade commemorating the 70th anniversary of Japan's surrender during World War II held in front of Tiananmen Gate in Beijing on Sept. 3, 2015. Human Rights \nSince coming to power, Xi has put the kibosh on any hopes that he intends to open up Chinese society and governance to dissenting voices. Under Xi’s leadership, the Chinese Communist Party has done its best to uproot the green shoots of an emerging civil society movement: Rebellious newspapers have been brought to heel , feminist activists have been detained, prominent bloggers have been humiliated on national TV , and civil rights lawyers have been caught up in a wide sweep . \nIn response, human rights groups have called on Obama to rebuke Xi publicly, even to cancel the state visit altogether. Scholars and administration officials have lamented that while the U.S. government can raise its concerns , it has little real leverage when it comes to domestic Chinese affairs. The U.S. will likely make some gestures in this direction, but not place human rights at the center of the visit. Cliff Owen/Associated Press A photograph of an island that China is building on the Fiery Cross Reef in the South China Sea, presented during a Senate Armed Services Committee hearing on Sept. 17, 2015. Tension Over The South China Sea \nThe question of how to handle China's ambitions in the South China Sea -- like rapidly building artificial island outposts in a region that's home to multiple U.S. allies, trade routes worth billions and vast quantities of untapped oil and gas -- has confounded Washington for years. The U.S. wants to show Beijing it will not be allowed to use its strong-arm tactics to dominate smaller U.S.-friendly nations, such as the Philippines. \nOne response from the Obama administration is its steadfast support for a massive trade deal , the Trans-Pacific Partnership, with Southeast Asian partners, which would tie together the economies of those countries and the U.S. \nWith the TPP clearing the Hill in June and China declaring in August that its land reclamation efforts in the disputed waters were complete, tensions over the South China Sea seemed likely to finally simmer down this summer. But news of the past few weeks has shattered that rosy fantasy. The Pentagon said weeks after China's announcement that Beijing had actually reclaimed more land than prior estimates suggested and that it had not clearly paused. Then, just days before Xi's visit, the D.C.-based Center for Strategic and International Studies released satellite shots showing continued Chinese dredging . \nIt's unclear how strongly Obama plans to respond to Beijing's apparent deception. But it will certainly be on his agenda, as National Security Adviser Susan Rice indicated Monday when she told a George Washington University audience that the U.S. remains committed to free navigation, no further land reclamation and a code of conduct in the region -- one negotiated by all claimants, not one dictated by China. Ng Han Guan/Associated Press A military band conductor leads a band during the opening session of the National People's Congress at the Great Hall of the People in Beijing. The Hunt For Fugitive Officials \nPresident Xi has launched a blistering corruption crackdown at home, and now the hunt for Chinese fugitives has gone international. Dubbed “ Operation Fox Hunt ,” the search seeks to bring corrupt officials and businesspeople home, along with their ill-gotten gains. \nChina has singled out the United States as a top destination for fugitive officials, but the repatriation process is tangled. U.S. officials complain that the Chinese offer little in the way of concrete evidence of crimes, and even less in the way of guarantees of due process in China. Reports of Chinese agents operating covertly on U.S. soil have also irked the White House . China, meanwhile, complains that the U.S. intentionally drags its feet, particularly when it comes to fugitives that could provide high-value intelligence . \nBut cooperation has picked up: Last week the U.S. deported a batch that included one of China’s most-wanted fugitives . Further cooperation on this front could also make for good leverage if Obama were to press Xi about the ongoing crackdown on civil society. \nMatt Sheehan reported from Beijing. Kate Sheppard, Ali Watkins and Akbar Ahmed reported from Washington, D.C. \nMore on Xi Jinping's visit to the U.S. ", "external_links": [], "published": "2015-09-22T20:27:00.000+03:00", "crawled": "2015-09-22T20:27:04.503+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}