{"organizations": [], "uuid": "85b0c9b25e896681998adb18c19928f2bbe380ab", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/reidharry_080415getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/senate/251332-reid-makes-obama-wait-on-iran", "country": "US", "title": "Reid makes Obama wait on Iran", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Reid makes Obama wait on Iran", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T13:00:00.000+03:00", "replies_count": 0, "uuid": "85b0c9b25e896681998adb18c19928f2bbe380ab"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/senate/251332-reid-makes-obama-wait-on-iran", "ord_in_thread": 0, "title": "Reid makes Obama wait on Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reid makes Obama wait on Iran Getty Images By Alexander Bolton - 08/18/15 06:00 AM EDT \nSenate Minority Leader Harry Reid (Nev.) has yet to say whether he’ll support President Obama’s nuclear deal with Iran, angering liberal groups who want to see congressional Democrats rally around the agreement. \nEighteen Senate Democrats remain undecided on the deal, which is opposed by New York Sen. Charles Schumer, the retiring Reid’s hand-picked successor in the next Congress. ADVERTISEMENT In the House, Democratic Leader Nancy Pelosi (D-Calif.) is solidly in favor of it, underscoring to liberals the different tack taken by Reid.\n“It's mystifying why Leader Reid hasn't come out in support of the Iran Deal, when rejecting it would set us on a path to war,” said Charles Chamberlain, executive director of Democracy for America, which backs the deal. \n“As the Democrats' leader in the Senate, Reid should be leading the effort to ensure his colleagues aren't tricked into allowing yet another disastrous war of choice in the Middle East by many of the very same war-mongering neo-conservatives who pushed us into Iraq,” he added. \nWhen Congress returns to Washington, it will consider a GOP resolution disapproving the deal. If the resolution became law, it would kill the Iran deal. \nReid plans to wait until Congress returns from the August recess on Sept. 8 before announcing his decision. \nA senior Senate Democratic aide familiar with Reid’s thinking said he doesn’t want to put pressure on colleagues. \n“He may be waiting until his caucus all makes their decisions and want to give people space and time to do that. Being a good leader does not mean coming right out but being a good leader is giving his caucus space and time,” said the aide. \nJim Manley, a former senior aide to Reid, said this is in keeping with how his former boss often handles major decisions. \n“This is the way he usually approaches big decisions,” Manley said. “He usually likes to give his caucus the space they need to make a decision without feeling undue pressure from the leadership.” \nReid told Nevada political commentator Jon Ralston and other reporters last week that he is still studying the complex agreement. \n“I have some papers I need study. I finished reading the document, a hundred and some-odd pages. But the one thing I need to do – I have people I need to meet with. I need to meet with people who have been very good to me over the years,” he said. \n“You could probably figure out who some of them are. And I haven’t done that,” he added. \nMost expect Reid will back the deal, and offer a few reasons why he’s holding out. \nThey say that waiting gives Reid time to consult with heavy hitters in Nevada such as Brian Greenspun, the publisher and CEO of the Las Vegas Sun, and Sheldon Adelson, an opponent of the deal and major GOP donor who nevertheless has a good relationship with Reid. \n“I’m not sure that Harry’s not doing this for maximum leverage for whatever. That seems to be the classic Harry Reid play. I talked to only a couple of people who think there’s any chance he’ll go against the deal,” Ralston told The Hill Monday. \n“It’s clear to me that he wants to go and talk to people like Brian Greenspun and Sheldon Adelson and whatever other prominent Jewish leaders there are in Nevada to explain why he’s going to do what he’s going to do,” he added. “My guess is Sheldon Adelson thinks he can turn him on the deal. They have a much closer relationship than people think.” \nWaiting a few more weeks also gives some breathing room to Catherine Cortez Masto, a Democrat running for Reid’s seat, who has yet to take a position on the deal. \nShe issued a statement on July 14 pledging to review the deal and has remained largely silent since. \nThe White House has spared no effort to lobbying Democrats to support the deal. \nThey’d love to see the disapproval resolution get bottled up in the Senate, where a filibuster will require opponents to win 60 votes to send it to Obama’s desk. \nNo Republicans are expected to back the nuclear deal with Sen. Jeff Flake’s (R-Ariz.) Saturday announcement that he will oppose it. \nNew Jersey Sen. Bob Menendez (D-N.J.), the former chairman of the Senate Foreign Relations Committee, will announce his position in a speech Tuesday. He is expected to vote no even though he told The Hill Thursday that he remains open minded. \nIf the disapproval measure reaches the White House, Obama will veto it. Opponents will then need to win two-thirds majorities in both chambers to override the president, a high hurdle. \nObama will be at the University of Nevada, Las Vegas, on Aug. 24 to deliver the keynote address at the National Clean Energy Summit, which Reid has co-sponsored and is one of his top priorities. \nThe president will also appear at a fundraiser for Cortez Masto that day. \nEarlier this year, Obama helped ingratiate himself with Reid by declaring 700,000 acres of Nevada wilderness a national monument. \n“There’s no place in America that represents what I think is beauty more than this Basin and Range,” Reid told The Washington Post. \nBut Ralston notes that Reid likely thinks Obama still owes him after his herculean efforts to pass ObamaCare through the upper chamber in 2009 and 2010. \n“You can never do enough for Harry Reid. I doubt he thinks the ledger is clear,” he said. \nDan Hart, a Nevada-based Democratic consultant, said Reid is in a tough position of having to choose between longtime supporters who are staunchly pro-Israel and Obama, who views the deal as the centerpiece of his second-term foreign policy legacy. \n“I think there is a natural affinity between people who are concerned about Israel and Harry Reid and throughout his career he has proven that. But on the other hand he is a president whom he has supported him in very tough times asking him to get this thing passed,” Hart said.", "external_links": [], "published": "2015-08-18T13:00:00.000+03:00", "crawled": "2015-08-18T13:53:56.517+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}