{"organizations": ["Fox News Latino", "Fox News Latino California GOP", "Murrieta Border Patrol Station"], "uuid": "26590633abfc9d42a2f0b75707c67d89483d2d36", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Immigration%20protest%20lat.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/21/california-gop-softens-stance-on-immigration-hoping-to-appeal-to-latino-voters/", "country": "", "title": "California GOP softens stance on immigration hoping to appeal to Latino voters | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "California GOP softens stance on immigration hoping to appeal to Latino voters | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T23:30:00.000+03:00", "replies_count": 0, "uuid": "26590633abfc9d42a2f0b75707c67d89483d2d36"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/21/california-gop-softens-stance-on-immigration-hoping-to-appeal-to-latino-voters/", "ord_in_thread": 0, "title": "California GOP softens stance on immigration hoping to appeal to Latino voters | Fox News Latino", "locations": ["MURRIETA", "California", "Murrieta", "Texas", "CA", "Central America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David"], "text": "California GOP softens stance on immigration hoping to appeal to Latino voters Published September 21, 2015 Fox News Latino MURRIETA, CA - JULY 04: A protester who opposes arrivals of buses carrying largely women and children undocumented migrants for processing at the Murrieta Border Patrol Station and a counter-demonstrator (L) face off on July 4, 2014 in Murrieta, California. Earlier this week, protesters in the city turned away buses carrying about 140 immigrants that had been apprehended in Texas and flown to California for processing as Texas deals with an influx of immigrants. Federal officials estimate more than 50,000 minors, mostly from Central America, have been caught crossing the border since October 2013. (Photo by David McNew/Getty Images) 2014 Getty Images \nLOS ANGELES (AP) – The California Republican Party voted Sunday to soften its stance on immigration, seeking to appeal to the state's growing Latino population and distance itself from the harsh rhetoric of presidential candidate Donald Trump. \nThe changes approved Sunday say Republicans \"hold diverse views\" on \"what to do with the millions of people who are currently here illegally,\" the Los Angeles Times reported. \nAlthough the new language emphasizes opposition to \"amnesty,\" it removes the statement that \"allowing illegal immigrants to remain in California undermines respect for the law,\" according to the newspaper. \nThe changes were proposed by a Latino party official from Fresno, Marcelino Valdez, in reaction to what he called Trump's \"offensive\" comments about immigrants. \nIt's important to use \"language that is more appealing to California's diverse electorate,\" Valdez said. \nIn a statement after the vote, he called it \"an anti-Proposition 187 plank,\" referring to the controversial 1994 ballot measure that would have prevented immigrants in the country illegally from receiving public services. It was invalidated by federal courts, but not before it helped drive Latinos away from the Republican Party. \nLast month, Trump, who's leading many polls, outlined proposals to deny citizenship to U.S.-born babies of immigrants living in the United States illegally as part of an immigration plan. Emphasizing border security and millions of deportations, he also says he would build a wall along the U.S. southern border and force Mexico to pay for it. \nThose proposals, and his comments suggesting that Mexicans coming across the border are largely \"criminals and rapists,\" have angered a population group national Republicans see as critical to the party's success. \nLike us on Facebook ", "external_links": [], "published": "2015-09-21T23:30:00.000+03:00", "crawled": "2015-09-21T23:30:48.096+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}