{"organizations": [], "uuid": "2574f2d10f015cc6e504a32f60608630e6b4ea2f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabaracksolar09152015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/energy-environment/253779-obama-pledges-120m-toward-solar-power-clean-energy", "country": "", "title": "Obama pledges $120M toward solar power, clean energy | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama pledges $120M toward solar power, clean energy | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T13:18:00.000+03:00", "replies_count": 0, "uuid": "2574f2d10f015cc6e504a32f60608630e6b4ea2f"}, "author": "", "url": "http://thehill.com/policy/energy-environment/253779-obama-pledges-120m-toward-solar-power-clean-energy", "ord_in_thread": 0, "title": "Obama pledges $120M toward solar power, clean energy | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Timothy Cama", "Obama"], "text": "Obama pledges $120M toward solar power, clean energy Getty Images By Timothy Cama - 09/16/15 06:00 AM EDT \nThe Obama administration announced Wednesday morning a series of efforts worth more than $120 million aimed at boosting solar and other clean energy sources. \nThe initiatives focus on the Department of Energy, where the bulk of the funding will go to programs to develop solar power technology and get it into homes, businesses and other facilities. ADVERTISEMENT “President Obama and Vice President Biden are committed to promoting smart, simple, low-cost technologies to help America transition to cleaner and more distributed energy sources, help households save on their energy bills, and to address climate change,” the White House said in a fact sheet outlining the efforts.\n“All told, this funding will drive the development of affordable clean energy throughout the country,” it said. \nThe actions aim to help out solar power in 24 states, officials said. \nThe announcements come the same day Biden, currently considering a bid for president , is scheduled to speak at a major solar industry conference in California and at a climate change summit with U.S. and Chinese leaders later in the afternoon. \nSolar power has been a top priority and talking point for the Obama administration’s energy and environmental policy priorities as officials push for an increase in low- or zero-carbon electricity sources. \nThe industry has expanded greatly under Obama. The White House says that approximately 66,000 homes had solar panels when Obama took office, and 734,000 do now. \nBut solar still only represents a small sliver of the country’s power generation. Solar produced 0.4 percent of the United States’ electricity last year. Tags: ", "external_links": [], "published": "2015-09-16T13:18:00.000+03:00", "crawled": "2015-09-16T13:18:18.328+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}