{"organizations": [], "uuid": "6c7ab12e45a55ff9baca55e3c1c0fc3dbb57e60d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/fanning.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,0,00.rss", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/09/18/obama-nominates-first-openly-gay-military-service-chief/", "country": "US", "title": "Obama nominates first openly gay military service chief News", "performance_score": 5, "site": "foxnews.com", "participants_count": 18, "title_full": "Obama nominates first openly gay military service chief | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 18, "uuid": "ad8a5b876c9b7e46f85b7649b9793a33825ac4a0"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/09/18/obama-nominates-first-openly-gay-military-service-chief/#post-0", "ord_in_thread": 0, "title": "Obama nominates first openly gay military service chief News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 18, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print In this May 20, 2014 file photo, provided by the U.S. Air Force, Eric Fanning speaks at the 30th Space Symposium Corporate Partnership dinner in Colorado Springs, Colo.  (AP) \nPresident Barack Obama is nominating longtime Pentagon official Eric Fanning to be the Army's new secretary. If confirmed, Fanning, a civilian, would be the nation's first openly gay leader of a military service. \nThe nomination comes at a time when the Obama administration is working to eliminate barriers to military service based on sexuality or gender. The “don’t ask, don’t tell” policy that allowed homosexuals to serve in the military as long as they hid their sexuality was officially repealed during Obama’s first term. Gays are now allowed to openly serve. \nIn the meantime, women have been crossing traditional barriers in the military, as well. Two women competed for and earned their Army Ranger tabs this summer for the first time in history. On Friday, the Marines announced they would open armored units to women, but would seek to keep several front-line combat jobs – infantry and artillery -- closed, a senior military official told Fox News.That would buck the trend being followed by the other three military services. \nFanning, 47, became the Army's acting undersecretary in July. Before that, he served as Defense Secretary Ash Carter’s chief of staff, and the undersecretary and acting secretary of the Air Force. Obama said in a statement Friday that Fanning brings years of experience and leadership to the role, and that he's confident Fanning will lead U.S. soldiers with distinction.\nBefore joining the administration, Fanning served as Deputy Director of the Commission on the Prevention of Weapons of Mass Destruction Proliferation and Terrorism. He began his career in public service in 1996, serving in political affairs in the Clinton White House.\nFanning's nomination must be confirmed by the Senate. He would replace John McHugh, who has said he plans to step down no later than November 1. \nThe news of Fanning's appointment quickly spread on social media  such as Twitter, with many calling the move “historic.”\n“Proud of my friend Eric Fanning who will make history, again! Obama nominates 1st gay service secretary to lead Army,” tweeted USAID official Clay Doherty.\nLabor Secretary Tom Perez also chimed in: “Congrats to Eric Fanning on being nominated Secretary of the Army! I look forward to our continued work together.”\nThe Associated Press contributed to this report", "external_links": [], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-19T03:04:34.148+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}