{"organizations": [], "uuid": "5662eb0dbba982c55b7a0bf77625ab2f2c62b5c3", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/canciller-guatemalteco-le-pide-tps-obama-para-compatriotas-indocumentados/", "country": "", "title": "Canciller guatemalteco le pide TPS a Obama para compatriotas indocumentados | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Canciller guatemalteco le pide TPS a Obama para compatriotas indocumentados | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "5662eb0dbba982c55b7a0bf77625ab2f2c62b5c3"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/29/canciller-guatemalteco-le-pide-tps-obama-para-compatriotas-indocumentados/", "ord_in_thread": 0, "title": "Canciller guatemalteco le pide TPS a Obama para compatriotas indocumentados | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Canciller guatemalteco le pide TPS a Obama para compatriotas indocumentados Published September 29, 2015 EFE \nEl canciller guatemalteco, Carlos Raúl Morales Moscoso, le reiteró al presidente de Estados Unidos, Barack Obama, la solicitud de Estatus de Protección Temporal (TPS, por sus siglas en inglés) para sus compatriotas indocumentados en la nación norteamericana, informó hoy una fuente oficial. \nLa petición fue realizada el lunes en Nueva York durante un \"breve\" encuentro entre Morales Mosocoso y Obama, en el marco del 70 período de sesiones que celebra la Asamblea General de la Organización de Naciones Unidas (ONU), de acuerdo con una declaración del Ministerio de Relaciones Exteriores guatemalteco. \nMorales Moscoso asistió al encuentro en representación del presidente del país centroamericano, Alejandro Maldonado Aguirre, quien fue intervenido quirúrgicamente por una lesión en la rodilla el 17 de septiembre y tuvo que ausentarse de la cita continental. \nEl Estatus de Protección Temporal es una condición que Estados Unidos concede a aquellos migrantes que no puedan regresar a sus países de origen debido a conflictos civiles o desastres naturales. \nEl Salvador, Honduras y Nicaragua gozan del TPS, que se le ha negado a Guatemala pese a reiteradas solicitudes durante más de una década. \nEE.UU. otorgó el TPS a Nicaragua y Honduras en 1999, por el desastre causado por el huracán \"Mitch\", y a El Salvador tras dos terremotos que causaron graves daños al país en enero y febrero de 2001. \nEl Salvador, Honduras y Guatemala conforman el triángulo norte de Centroamérica, una región considerada por organismos internacionales como una de las más violentas del mundo. \nLa situación, sumada con ausencia de fuentes de empleo y escasos recursos económicos, obliga a miles de personas a emigrar al país norteamericano, de acuerdo a expertos en el tema. \nAlrededor de 1,8 millones de guatemaltecos radican en Estados Unidos, y aproximadamente el 60 por ciento de ellos lo hace de manera ilegal, según cálculos de la cancillería. \nDurante el encuentro de Morales Moscoso con el presidente norteamericano también estuvo presente la esposa de Obama, Michelle. \nEl canciller excusó al mandatario guatemalteco ante la pareja presidencial por no poder viajar a la cita mundial y les explicó los motivos de su ausencia. \nMaldonado Aguirre fue investido el pasado 3 de septiembre por el Congreso de Guatemala tras la renuncia de Otto Pérez Molina, envuelto en un millonario escándalo de corrupción que desde ese mismo día lo tiene en prisión preventiva. \nEl nuevo presidente del país centroamericano cumplirá el período de cuatro años establecido constitucionalmente para Pérez Molina, quien debía entregar su cargo el próximo 14 de enero. ACAN-EFE ", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T12:04:06.433+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}