{"organizations": [], "uuid": "dbab459d060dffa850afb14b0149a41250871ecf", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/JohnOliver5.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,0,00.rss", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/us/2015/09/14/us-immigration-policy-bars-8-year-old-wwii-vet-from-re-entering-country-for/", "country": "US", "title": "US immigration snafu keeping WWII vet, 89, from being with his son", "performance_score": 3, "site": "foxnews.com", "participants_count": 33, "title_full": "US immigration snafu keeping WWII vet, 89, from being with his son | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T03:00:00.000+03:00", "replies_count": 34, "uuid": "a5b5169cdbc7b69662481bfa35cb13e57091fa59"}, "author": "Cristina Corbin", "url": "http://www.foxnews.com/us/2015/09/14/us-immigration-policy-bars-8-year-old-wwii-vet-from-re-entering-country-for/#post-0", "ord_in_thread": 0, "title": "US immigration snafu keeping WWII vet, 89, from being with his son", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Cristina Corbin \nPublished September 14, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print John Oliver, 89, is pictured here in an undated family photo. \nJohn Oliver's last chance to live out his days with his son in New Jersey might have been to sneak across the U.S. border, but the ailing, 89-year-old World War II Royal Air Force veteran didn't want to break the law.\nInstead, Oliver -- who lives in the Bailiwick of Jersey, the largest of England's Channel Islands -- and his son, an American citizen, went about it the honest way, filing all the tedious paperwork and paying the required fees to secure him a green card.\nAll seemed to be going as it should until immigration officials determined Oliver must be barred from re-entering the U.S. for the next 10 years because he overstayed a 90-day visa issued in 2011, when his wife was dying and doctors recommended the couple remain under the care of their 61-year-old son in New Jersey.\n\"Our biggest mistake was being honest,\" his son, Robert Oliver, of Vernon, N.J., told FoxNews.com Wednesday. \"Lawyers told us we should have just kept him here illegally.\"\n\"It certainly is a little hard to watch this family get blanked even as the Obama administration waves in tens of thousands of new illegal arrivals from Central America to reunite with family and gives out work permits to hundreds of thousands of the illegal alien 'Dreamers.'\"\n- Jessica Vaughan, Center for Immigration Studies\n\"It's heartbreaking we can't provide anything for him unless we pack everything and leave the United States,\" he said.\nThe family's ordeal began in October 2011 when Robert Oliver flew to the Bailiwick of Jersey to bring his father and sickly mother stateside to New Jersey, where he lives with his fiancée, Mary Bradley.\n\nRelated Image Expand / Contract Robert Oliver, of Vernon, N.J., is pictured here with his fiancé, Mary Bradley. \n\nShortly after the family arrived, Oliver's mother, Betty, rapidly deteriorated, requiring 24-hour care. At the same time, Oliver and his fiancée were working tirelessly to secure green cards for the elderly couple.\nThe Olivers had planned to leave the U.S. at the end of their three month visa but doctors said Betty -- who was suffering from severe osteoporosis and liver problems -- was too sick to travel and would not survive the trip.\n\"All along, with speaking with immigration, they were assuring me that this was such an easy case. 'Not to worry, not to worry,'\" Mary Bradley said. \"I just followed the system and filled out the forms they asked for.\"\nWhen Betty Oliver suffered a stroke in June 2012, Robert Oliver and his fiancée notified immigration officials that the two had overstayed their visa and explained the circumstances.\n\"At no point did it even cross our mind that this man should leave the country and leave his wife,\" Bradley told FoxNews.com. \"She [Betty] was so dependent on him. They were married for nearly 70 years.\"\nIn November 2012, Betty Oliver died while in hospice care in New Jersey. At that point, Oliver and Bradley turned their efforts into securing a green card for John Oliver, whose health was also declining. They filed forms with the State Department, Homeland Security and its immigration enforcement arm, the U.S. Citizenship and Immigration Services, or USCIS. \nThe applications were denied, the couple said. \nThe rejections infuriated Oliver and Bradley, who wrote a message to President Obama through the White House website about the family's plight.\nBradley said she received a response in January 2014 from the president in the form of a generic-looking letter, with links to the administration's immigration policy as well as to websites for USCIS and ICE, United States Immigration and Customs Enforcement.\n\"Thank you for writing,\" Obama's letter began. \"America’s immigration system is badly broken, and I know many people are hurting because of it.\"\nThe elderly Oliver -- a World War II bomber navigator turned corporate accountant, who never committed a crime -- paid U.S. taxes on his English pension during his time in the States. He also spent $70,000 of his life savings to pay for his wife's medical expenses, which only increased the couple's anger.\n\nRelated Image Expand / Contract John Oliver \n\nRobert Oliver told FoxNews.com he was advised by immigration officials to travel to the U.S. Embassy in London with his father to address the issue in person.\nFather and son boarded a flight for their appointment on Oct. 25, 2013 -- which proved to be a mistake.\n\"At that point the rubber stamp went down and said he was barred from the U.S. for 10 years because he overstayed his visa – something that we had reported time and time again that he was still in the country,\" Bradley said. \"He never once tried to hide the fact that he overstayed his visa.\"\n\"They brought letters from John’s doctors saying he could not live on his own,\" added Bradley. \"They refused to consider the doctor's letters.\"\nThe couple said they have since contacted Senators Cory Booker and Bob Menendez as well as Congressman Scott Garrett.\n\"Our office is working with Mr. Oliver and his family to help sort out this heartbreaking situation,\" Booker's spokesman, Jeff Giertz, told FoxNews.com Wednesday. \"If a New Jerseyan needs a hand, Senator Booker and his staff do everything in our power to help.\"\nOliver said no U.S. attorneys will \"touch the case because my father is not on U.S. property.\"\n\"When we went to see one lawyer, he said, 'Your big mistake was doing anything,'\" Oliver told FoxNews.com. \"He [the lawyer] said, 'You get him back here and then we can talk about what can be done. He didn’t care if it was legal or not.\"\n\"Another lawyer suggested we bring him in through unmanned parts of the Canadian border,\" Oliver said. \"I asked my father about it and he said he wasn't interested – he wants to do it legally. He turned it down.\"\nJessica Vaughan, with the Center for Immigration Studies, said she has little sympathy for those who overstay visas, but noted the Oliver case is a sad one when compared to the \"tens of thousands of unqualified illegal aliens\" who have entered the country under a humanitarian provision, which Congress intended for exceptional cases.\n\"Sometimes it seems like our immigration laws come down hardest on the very people who are trying to follow them, even as all manner of scofflaw illegal aliens, criminals and fraudsters are able to abuse the system with impunity,\" Vaughan said. \"It certainly is a little hard to watch this family get blanked even as the Obama administration waves in tens of thousands of new illegal arrivals from Central America to reunite with family and gives out work permits to hundreds of thousands of the illegal alien 'Dreamers.'\"\n\nRelated Image Expand / Contract Robert Oliver is pictured here with his father, John, and mother, Betty, who died in 2012. \n\nFor Robert Oliver, the inability to care for his father is painful beyond measure.\n\"He's a very caring man,\" Oliver said, recalling the many trips his parents took to the U.S. to care for him when his late wife was diagnosed with multiple sclerosis years ago.\n\"They were the most caring parents anybody would ever want,\" he said. \"We just need someone with compassion to help us.\"\nCristina Corbin is a reporter for FoxNews.com. Follow her on Twitter @CristinaCorbin .", "external_links": [], "published": "2015-09-14T03:00:00.000+03:00", "crawled": "2015-09-14T08:25:57.176+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}