{"organizations": [], "uuid": "d5ad5c1662e7fa30949ac8c7398c6e0834e39218", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Cuba%20Pope_Garc.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/22/as-pope-arrives-in-us-house-dems-make-appeal-to-push-immigration-wage-raise/", "country": "", "title": "As pope arrives in U.S., Dems make appeal to push immigration, wage raise | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "As pope arrives in U.S., Dems make appeal to push immigration, wage raise | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "d5ad5c1662e7fa30949ac8c7398c6e0834e39218"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/09/22/as-pope-arrives-in-us-house-dems-make-appeal-to-push-immigration-wage-raise/", "ord_in_thread": 0, "title": "As pope arrives in U.S., Dems make appeal to push immigration, wage raise | Fox News Latino", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["pope"], "text": "As pope arrives in U.S., Dems make appeal to push immigration, wage raise Published September 22, 2015 Fox News Latino \nHouse Democrats are turning to a higher power in their quest to make headway on immigration reform. \nThey are turning to Pope Francis, urging him to push for a more humane U.S. immigration system that would, among other things, provide a path to legal status for many of the country’s estimated 11 million undocumented immigrants. \nThey also are appealing to the Holy See to speak about climate change and poverty. \nPope Francis, the first Latin American pontiff in the history of the church, is making his first trip to the United States on Tuesday. \nHe is scheduled to address a joint session of Congress on Wednesday, and the House Democrats clearly are hoping he advocates for support for topics such as comprehensive immigration reform, climate change and raising the minimum wage – all divisive issues between Democrats and Republicans, who control both chambers of Congress. \nMany Republicans oppose efforts to raise the minimum wage, saying that it would impose a burden upon small businesses. And efforts to reform immigration remain stalled in Congress two years after a Democrat-controlled Senate passed a bipartisan comprehensive bill that called for both security the border and enabling certain undocumented immigrants who meet strict criteria to legalize their status. \n“Pope Francis, your calls to reject violence and hate against immigrants in months past have been welcome words for us,” said U.S. Rep. Jose Serrano of New York in the video. “We ask our Republican colleagues to listen to your voice of compassion towards immigrants.” \nU.S. Rep. Loretta Sanchez, a California Democrat who is hoping to succeed retiring Barbara Boxer in the U.S. Senate, noted: “Comprehensive immigration reform would bring 11 million Americans out of the shadows.” \nRep. Charles Rangel, of New York, said: “Lack of opportunities traps too many hardworking families at the bottom. We need to pass an increase in the minimum wage in Congress to level the playing field.” \nThe pope is expected to address immigration during at least one of several speeches planned during his stay here. \nThat is expected to be a focus of his speech in Pennsylvania, where he will travel on Saturday. \nMeanwhile, on the other side of the political aisle, amid the controversy surrounding funding Planned Parenthood, many Republicans are hoping the pope will address abortion. \nLike us on Facebook ", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-23T05:32:13.862+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}