{"organizations": [], "uuid": "22069609fb1f87c50668ae5f81fff0f8ac95d4cb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/castroobama_092915getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/255262-obama-castro-meet-at-united-nations", "country": "US", "title": "Obama, Castro meet amid thawing relations between U.S. and Cuba", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama, Castro meet amid thawing relations between U.S. and Cuba", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T17:49:00.000+03:00", "replies_count": 0, "uuid": "22069609fb1f87c50668ae5f81fff0f8ac95d4cb"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/international/255262-obama-castro-meet-at-united-nations", "ord_in_thread": 0, "title": "Obama, Castro meet amid thawing relations between U.S. and Cuba", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama, Castro meet amid thawing relations between US and Cuba Getty Images By Jordan Fabian - 09/29/15 10:49 AM EDT \nPresident Obama met with Cuban President Raúl Castro on Tuesday, a move meant to symbolize improved ties between the two former Cold War adversaries. ADVERTISEMENT The meeting at the United Nations General Assembly in New York was their second this year.\nObama and Castro appeared jovial as they shook hands in front of reporters. Castro laughed as he looked up at the taller Obama, who did not answer shouted questions from the media. \n“The president welcomed the progress made in establishing diplomatic relations, and underscored that continued reforms in Cuba would increase the impact of U.S. regulatory changes” on trade and travel, the White House said in a statement. \nThe meeting comes as the U.S. and Cuba are working through the thorny process of normalizing relations after five decades of hostility. \nIn July, the two countries re-opened embassies in Washington and Havana that had been shuttered since 1961. \nThe Obama administration announced last week it would further ease business and travel restrictions with Cuba, which could boost trade ties with the island nation. Commerce Secretary Penny Pritzker is traveling to Cuba next week to discuss new rules to conduct financial and business transactions. \nBut many obstacles stand in the way of fully normalized ties. Obama and Castro have called on Congress to lift the 54-year-old trade embargo on Cuba. \nBut Republicans and some Democrats want the Cuban embargo to remain in place, arguing that lifting it would reward a government responsible for rampant human-rights abuses against its own citizens. \nThe Obama administration has also raised concerns with the Cuban government about crackdowns on free speech and arrests and beatings of political opponents. \n\"I’m confident that our Congress will inevitably lift an embargo that should not be in place anymore,” Obama said Monday in a speech to the U.N. General Assembly. “Change won’t come overnight to Cuba, but I’m confident that openness, not coercion, will support the reforms and better the life the Cuban people deserve.” \nCuba has also called on the U.S. to return the naval base at Guantánamo Bay, a move administration officials have said is not in the cards. \nObama and Castro spoke by phone earlier this month ahead of Pope Francis’s visit to both their countries. Francis played a pivotal role in helping broker the historic thaw between the U.S. and Cuba that was announced last December. \nThe two leaders held their first formal meeting this April at a regional summit in Panama. They met for the first time at Nelson Mandela’s funeral in South Africa in December 2013, shaking hands briefly. \n— This story was updated at 1:51 p.m. Tags:", "external_links": [], "published": "2015-09-29T17:49:00.000+03:00", "crawled": "2015-09-29T23:26:55.664+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}