{"organizations": ["Facebook", "Twitter"], "uuid": "e21195d4160da5885d561a8021d8cc4fd6862bee", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/us/2015/09/14/despite-obama-pledge-us-still-struggling-to-close-guantanamo-prison-amid/", "country": "", "title": "Despite Obama pledge, US still struggling to close Guantanamo prison amid bureaucratic hurdles | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Despite Obama pledge, US still struggling to close Guantanamo prison amid bureaucratic hurdles | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T12:03:00.000+03:00", "replies_count": 0, "uuid": "e21195d4160da5885d561a8021d8cc4fd6862bee"}, "author": "", "url": "http://www.foxnews.com/us/2015/09/14/despite-obama-pledge-us-still-struggling-to-close-guantanamo-prison-amid/", "ord_in_thread": 0, "title": "Despite Obama pledge, US still struggling to close Guantanamo prison amid bureaucratic hurdles | Fox News", "locations": ["US", "Guantanamo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Despite Obama pledge, US still struggling to close Guantanamo prison amid bureaucratic hurdles Published September 14, 2015 Facebook 0 Twitter 0 Email Print \nWASHINGTON – The Obama administration's struggling quest to close the U.S. detention center at Guantanamo Bay, Cuba, is mired in state and federal politics. \nFrustrated White House and Pentagon officials are blaming each other for the slow progress in releasing approved detainees and finding a new prison to house those still held. \nDefense Secretary Ash Carter is facing criticism from some administration officials who complain that he has not approved enough transfers, even though 52 Guantanamo detainees are eligible. Carter's predecessor, Chuck Hagel, was forced from the Pentagon job in part because the White House felt he was not moving quickly enough to send detainees to other countries. \nTwo officials said the White House is frustrated because President Barack Obama discussed the issue with Carter when he was hired this year to lead the Defense Department, and they believed Carter was on board with the White House's plans to act faster. \nOther U.S. officials note that Carter has approved some transfers and is pushing his staff to move quickly to get more to his desk. But many other proposed transfers are slogging through the bureaucracy, under review by a long list of defense, military, intelligence and other administration offices. The transfers cannot be approved unless officials believe the detainees will not return to terrorism or the battlefield upon release and that there is a host country willing to take them. \nDuring his two years as Pentagon chief, Hagel approved 44 detainee transfers. Carter, in his first seven months, has transferred six. \nPentagon press secretary Peter Cook issued a statement Saturday saying that Carter shares Obama's commitment to closing the detention facility responsibly and has been working \"deliberately and diligently\" on a comprehensive plan. \n\"Working with our interagency partners and Congress, his top priority has been and will continue to be the safety and security of the American people,\" Cook said. \nObama has promised to close the facility since he was a presidential candidate in 2008. He said it ran counter to American values to keep people in prison, many without criminal charges or due process. \nOpponents have argued the detainees are essentially prisoners of war. \nFrom a peak of 680 prisoners, 116 remain. Finding acceptable places for them has been an intractable problem. \n\"Finding a solution for these individuals involves complicated negotiations with international partners, extensive consultations with the leaders of the national security and legal organizations and final approval by me,\" Carter told reporters. \nA key player in the process is Gen. Martin Dempsey, chairman of the Joint Chiefs of Staff. Dempsey, who spent more than three years as a commander in Iraq, continues to be very cautious in his recommendations for transfers. His opinions carry a lot of weight. \nAccording to U.S. officials familiar with the process, Carter recently notified Congress of two transfers, and has four whose files are ready to go to Capitol Hill, likely later this month. Congress has 30 days to review the transfers before they are made public. \nA number of U.S. officials familiar with the ongoing discussions spoke on condition of anonymity because they were not authorized to talk about the subject publicly. \nThe movement of detainees is only part of the challenge. A greater hurdle will be finding a U.S.-based prison to house the 64 detainees considered too dangerous to be sent to another country. Congress has opposed any effort to bring detainees to America, so Obama's long-stated goal of closing Guantanamo before he leaves office in January 2017 is more likely to die on the steps of Capitol Hill. \nAware of those objections, the White House last month stalled Pentagon efforts to send a plan to Congress outlining several U.S. prisons that could be upgraded and used for the detainees. Early drafts of the plan included some rough estimates of the costs and the time needed for renovations. \nU.S. officials said the administration was worried that sending the plan to Congress could affect the crucial vote on the Iran nuclear deal by infuriating lawmakers who do not want the detainees moved to the U.S. or who adamantly oppose having them in a prison in their state or district. The resolution of disapproval of the Iran deal failed in the Senate, handing Obama a victory on that issue. \nThree to five civilian facilities are being eyed as potential sites, officials said. A Pentagon team has gone to military facilities in South Carolina and Kansas to develop better estimates of construction and other changes that would be needed to house the detainees as well as conduct military commission trials for those accused of war crimes. \nThe visits to the Navy Consolidated Brig in Charleston, South Carolina, and the United States Disciplinary Barracks at Fort Leavenworth in Kansas triggered immediate outrage from lawmakers and governors there. \nRepublican Govs. Nikki Haley of South Carolina and Sam Brownback of Kansas have threatened to sue the administration if detainees are brought to either state. \nBoth the House and Senate have pending legislation that would maintain prohibitions on transferring detainees to U.S. facilities. The Senate legislation allows the restrictions to be lifted if the White House submits a plan to close the facility and it's approved by Congress. \nGOP Sen. John McCain of Arizona, chairman of the Senate Armed Services Committee, has made it known he would consider a comprehensive plan to close Guantanamo, but said it must include answers to a number of tough legal and policy questions, including whether detainees held in the U.S. would have additional rights. \nSen. Lindsey Graham, R-S.C., has opposed using the Charleston brig because it is in a populated area. \nSen. Pat Roberts, R-Kan., has said flatly: \"Not on my watch will any terrorist be placed in Kansas.\" \nCarter has acknowledged the challenge of getting a U.S. facility approved by Congress, but has insisted that some lawmakers have indicated a willingness to consider a plan. \n\"This would be a good thing to do if — if we can all come together behind a plan to do it,\" Carter told reporters. \"Our responsibility is to provide them with a plan that they can consider that is a responsible one.\" \n___ \nAssociated Press writer Deb Riechmann contributed to this report. Advertisement ", "external_links": [], "published": "2015-09-14T12:03:00.000+03:00", "crawled": "2015-09-14T12:03:15.083+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}