{"organizations": [], "uuid": "4f9ebb849d33484f23e691d7cd8614151119bedd", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/rubiomarco_022715gn14.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/energy-environment/252526-rubio-looks-to-undo-obamas-energy-policies", "country": "", "title": "Rubio vows to undo Obama climate policies | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Rubio vows to undo Obama climate policies | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T21:05:00.000+03:00", "replies_count": 0, "uuid": "4f9ebb849d33484f23e691d7cd8614151119bedd"}, "author": "", "url": "http://thehill.com/policy/energy-environment/252526-rubio-looks-to-undo-obamas-energy-policies", "ord_in_thread": 0, "title": "Rubio vows to undo Obama climate policies | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Devin Henry", "Obama", "Rubio"], "text": "Rubio vows to undo Obama climate policies By Devin Henry - 09/02/15 11:25 AM EDT \nSen. Marco Rubio (R-Fla.) is pledging to reverse President Obama’s major energy and climate policies if he’s elected to the White House in 2016. \nRubio hit Obama and Democratic front-runner Hillary Clinton for pursuing climate regulations he says are hampering the American energy industry in an op-ed and excerpts from an energy speech he will deliver on Wednesday afternoon. \nRubio said he would block Obama’s newly announced climate rule for power plants if he wins the presidency. ADVERTISEMENT “I will stop the EPA’s Clean Power Plan, which, if enacted, would have a devastating impact on affordable energy in exchange for little to no environmental benefit,” he will say in a speech in Oklahoma City on Wednesday, according to early excerpts released by his campaign.\n“It would truly be one of the most expensive and costly regulations ever created. Yet Hillary Clinton has pledged to make defending and expanding it a ‘top priority.’ ” \nRubio vowed to lift the ban on exporting crude oil, something lawmakers are expected to vote on this fall, and strip away federal regulations on oil and gas development on federal lands. \n“State and local governments are far better equipped than Washington to oversee energy production and balance environmental concerns,” he’ll say in his speech. \nRubio knocked Obama for talking about climate change in Alaska this week rather than addressing energy issues. He said his policies pick “winners and losers through subsidies and higher taxes” and said the environmental concerns that have driven administration regulators to issue strong new rules on the energy industry are “overblown.” \n“I believe that the vast majority of Americans — both Democrats and Republicans — are very reasonable when it comes to balancing ecology with the economy,” he wrote in a National Review op-ed . \n“And I believe it is conservatives, not liberals, who ultimately have the more sustainable and forward-looking agenda.” \nRubio’s speech comes as the Obama administration has expanded its focus on climate change. \nObama is on the third of a three-day trip to Alaska on Wednesday to inspect the impacts of climate change in the state. The Clean Power Plan, which looks to slash greenhouse gas emissions from power plants, came out last month, and the administration is gearing up to push for a major climate deal at a United Nations conference this year. \nClinton, the leading Democratic presidential candidate, began rolling out her energy plan over the summer, pledging to protect Obama’s environmental regulations if elected and expand the use of renewable power. She has also said she opposes expanded off-shore oil drilling in the Arctic Ocean, something the Obama administration green-lit this year. Tags: ", "external_links": [], "published": "2015-09-02T21:05:00.000+03:00", "crawled": "2015-09-02T21:05:50.764+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}