{"organizations": [], "uuid": "f768dc41a3251f902fb7f63c45650d159dfacf6a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/castroraul_040415getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/254883-obama-expected-to-meet-with-castro-at-un", "country": "US", "title": "Obama expected to meet with Castro at UN", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama expected to meet with Castro at UN", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T01:26:00.000+03:00", "replies_count": 0, "uuid": "f768dc41a3251f902fb7f63c45650d159dfacf6a"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/254883-obama-expected-to-meet-with-castro-at-un", "ord_in_thread": 0, "title": "Obama expected to meet with Castro at UN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama expected to meet with Castro at UN Getty Images By Jordan Fabian - 09/24/15 06:26 PM EDT President Obama and Cuban President Raúl Castro will likely cross paths at the U.N. General Assembly in New York next week, the White House said Thursday. There is no formal meeting scheduled between the two leaders, but it’s expected they will have the chance to interact, according to deputy national security adviser Ben Rhodes. “I expect the president will have some opportunity to see President Castro,” he told reporters. Rhodes said it’s not clear how long the two leaders will have to meet, but added the encounter could occur Monday or Tuesday. “I don’t know they will have time for an extended [bilateral meeting],” he said. “I think they will have some opportunity to speak to each other and continue this process of normalization.” If they meet, it would be the first face-to-face discussion between Obama and Castro since the U.S. and Cuba formally restored diplomatic relations in July. The two leaders made history in April when they met at a regional summit in Panama, about four months after announcing they would end a half-century of hostilities and pursue closer ties. A number of obstacles stand in the way of fully normalizing relations with Cuba, though, including the U.S.’s 55-year-old trade embargo against the communist nation. Castro is expected to use his first-ever appearance at the General Assembly to call for the embargo to end. Obama supports lifting the embargo as well, but such a move requires an act of Congress. Most Republicans and some Democratic lawmakers oppose lifting the embargo, fearing it would strengthen Castro’s government, which continues to repress its citizens. Obama and Castro spoke by phone last week after the Obama acted unilaterally to chip away at the embargo by easing certain restrictions on business and travel. U.S. officials are reportedly weighing whether to accept a U.N. resolution condemning the embargo, a move that would be unprecedented. But no final decision has been made, according to The Associated Press. While Obama and Castro agree the embargo should be lifted, the U.S. has continued to express concern about Castro’s restrictions on free speech and assembly. Political opponents are frequently beaten and jailed. Rhodes said he expects Obama to convey those concerns to Castro. But the president will also make the case that his effort to pursue diplomacy with traditional adversaries such as Cuba and Iran is working. He called Castro’s presence at the U.N. “a symbol that things have changed, that the United States’ approach to Cuba has changed.” In addition to Castro, Obama is also scheduled to meet with Russian President Vladimir Putin to discuss the conflicts in Ukraine and Syria. The Soviet Union was Cuba’s longtime patron during the Cold War. But Obama is not expected to meet with Iranian President Hassan Rouhani, following the completion of their landmark nuclear deal this summer. Tags:", "external_links": [], "published": "2015-09-25T01:26:00.000+03:00", "crawled": "2015-09-25T01:46:48.547+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}