{"organizations": [], "uuid": "a06a3c67480d4b112bbbf893df3ddfca616f636f", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150910162611-barack-obama-sept-9-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/14/politics/obama-iowa-education-fafsa/index.html", "country": "US", "title": "Obama brings education message to hub of 2016 politics", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama brings education message to hub of 2016 politics - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "a06a3c67480d4b112bbbf893df3ddfca616f636f"}, "author": "Kevin Liptak", "url": "http://www.cnn.com/2015/09/14/politics/obama-iowa-education-fafsa/index.html", "ord_in_thread": 0, "title": "Obama brings education message to hub of 2016 politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Obama is returning to the site of the first-in-the-nation caucus to promote his higher education agenda He's eager to remain relevant in the current political conversation Des Moines, Iowa (CNN) These days, most politicians heading to Iowa are trying to become president. On Monday, though, the big-wig landing in the state already occupies the Oval Office.\nPresident Barack Obama is returning to the site of the first-in-the-nation caucuses to promote his higher education agenda, though the undercurrent of the state's full-swing campaign season isn't likely to go unmentioned during his short stop there.\nIn recent days, Obama has lambasted Republicans running for their party's nomination on topics like the economy and climate change, saying they'd take the country in the wrong direction if elected to the White House.\nHe's eager to remain relevant in the current political conversation, even as the race to replace him consumes more and more of the spotlight. And while he won't be stumping for any particular candidate in Des Moines, his message on making college more affordable fits squarely within the Democratic messaging that candidates like Bernie Sanders and Hillary Clinton have been extolling.\nThe White House claims the decision to travel to Iowa wasn't made with political motivations; instead, they say the Department of Education put a pin on the state while planning the back-to-school bus tour the Education Secretary Arne Duncan embarks upon yearly.\nBut there are plenty of places Obama could have traveled to to underscore his administration's efforts in reducing student debt. On Monday, he'll announce that students applying for federal financial aid will be able to submit the required form -- the FAFSA -- in October, rather than later in January.\nHe won't be the only high-profile Democrat in Iowa on Monday. Hillary Clinton, his former secretary of state, will be 125 miles away in Cedar Falls. They aren't likely to cross paths -- Obama, after all, hasn't said yet that he'll endorse her as his preferred successor.\nThat's because Vice President Joe Biden hasn't yet said whether he's running for president. Obama may endorse a candidate in the Democratic primary, the White House has said.\nBiden himself plans to travel to Southern California on Wednesday to promote the administration's climate change agenda -- just as the Republican presidential candidates convene for their second debate hosted by CNN at the Reagan Library in Simi Valley.\nLike Obama, Biden hasn't been shy in blasting Republicans for doing little to curb carbon emissions.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-09-14T03:00:00.000+03:00", "crawled": "2015-09-14T23:44:18.284+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}