{"organizations": [], "uuid": "2a3ce884ad392460eef9b783e3e1b6e3824e0ba6", "thread": {"site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150919084031-jeb-bush-sept-18-2015-south-carolina-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/09/21/politics/jeb-bush-immigration-election/index.html", "country": "US", "title": "Jeb Bush on immigration: My plan is 'dignified' - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Jeb Bush on immigration: My plan is 'dignified' - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "2a3ce884ad392460eef9b783e3e1b6e3824e0ba6"}, "author": "Ashley Killough", "url": "http://www.cnn.com/2015/09/21/politics/jeb-bush-immigration-election/index.html", "ord_in_thread": 0, "title": "Jeb Bush on immigration: My plan is 'dignified' - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Houston (CNN) Jeb Bush admitted Monday his views on immigration may not be \"mainstream\" in the Republican Party. But he praised the \"vitality\" of a multicultural society as other GOP presidential candidates find themselves in trouble over comments about minorities.\n\"If we embrace a set of shared values, then it shouldn't matter if you have a 'z' at the end of your name, or your accent might be different, 'cause guess what? There are people in this country, that have accents different from mine and mine's different from theirs. It doesn't matter,\" Bush said to a roomful of Hispanics.\nThe former Florida governor, who boasts proudly of the bicultural family that he started with his wife, who's from Mexico, was in his comfort zone when he addressed the U.S. Hispanic Chamber of Commerce in Houston.\nThough he was interrupted at the start of his remarks by pro-immigration protestors, Bush won applause from the audience when he re-asserted that he's in favor of earned citizenship for individuals who were brought to the country illegally as children, also known as DREAMers.\n\"And I'll continue to be consistently for it, irrespective of what the political ramifications of that are,\" he said, ending a tense moment with protesters who emerged from multiple corners in the ballroom.\nFluent in Spanish, Bush mentioned his Republican rival Donald Trump by name at one point, mocking the real estate titan for scoffing at Bush's use of his second language on the campaign trail.\nBush blasted ideas the Trump has heralded like building a wall and deporting those who are here illegally, citing those costs of taking such action and arguing that it's neither \"practical\" nor \"conservative.\"\nInstead, he laid out his plan to offer legal status to undocumented workers after they meet a long list of criteria like learning English, paying back taxes, and an additional fine.\n\"That is the dignified, American way,\" he said. \"The practical way of solving the problem of 12 million immigrants.\"\nHe staunchly defended his wife, Columba, saying it's \"laughable\" that some people don't consider her American, and he chided the \"louder voices\" in his party who don't have \"any sense of what the immigrant experience is about.\"\nHis comments come nearly a week after Bush confronted Trump in the CNN debate for invoking Columba on the immigration issue. The former governor urged Trump to apologize to his wife, who was sitting in the audience, but Trump refused, saying he didn't do anything wrong.\nOn Monday, Bush said his wife is \"American by choice\" and just like he, a converted Catholic, has become \"fierce\" about his faith, he argued that immigrants who come to the United States are also \"pretty fierce\" about the United States.\nBush has made his ties to Hispanic community a crucial part of his campaign. Last month he faced criticism for using the term \"anchor baby,\" but aside from Democratic attacks, the candidate has seen little fallout over using the term.\nJavier Palomarez, president and CEO of the Hispanic Chamber of Commerce, praised Bush for being \"a fine example of what is possible\" in terms of broadening the GOP base.\nMeanwhile, Trump has taken heat for inflammatory rhetoric about immigrants from the start of his campaign. And most recently, he's seen criticism for not denouncing a voter at a campaign rally who argued that President Barack Obama is a Muslim.\nPalomarez, who met with Trump in New York earlier this month, argued that he's disappointed in Trump's bombastic rhetoric, saying the GOP front-runner is using it to \"coalesce and galvanize his base\" in a \"very negative fashion.\"\nAnd while Trump is scheduled to appear before the Hispanic Chamber of Commerce at a public event on Oct. 8, Palomarez told CNN that may not happen anymore.\n\"He's going to have to take responsibility for that kind of negative, divisive narrative before we're going to sit down with him and have a Q&A session,\" he said.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-22T03:58:33.912+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}