{"organizations": ["GOP", "Fox News Latino FILE", "AP", "Fox News Latino Philadelphia"], "uuid": "d8f8a8d4669f14f592af46ee90a05eb588da5c0b", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/Chaput%20chivvies%20Trump%20Latino.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/09/02/philadelphia-archbishop-says-trump-immigration-talk-plays-on-our-worst-fears/", "country": "", "title": "Philadelphia archbishop says Trump's immigration talk 'plays on our worst fears' | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Philadelphia archbishop says Trump's immigration talk 'plays on our worst fears' | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "d8f8a8d4669f14f592af46ee90a05eb588da5c0b"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/09/02/philadelphia-archbishop-says-trump-immigration-talk-plays-on-our-worst-fears/", "ord_in_thread": 0, "title": "Philadelphia archbishop says Trump's immigration talk 'plays on our worst fears' | Fox News Latino", "locations": ["U.S.", "Philadelphia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Trump", "De Luca", "Donald Trumpâs", "Chaput", "Charles Joseph Chaput"], "text": "Philadelphia archbishop says Trump's immigration talk 'plays on our worst fears' Published September 02, 2015 Fox News Latino FILE- In this June 25, 2015, file photo, Philadelphia's Archbishop Charles Joseph Chaput attends a press conference at the Vatican. Chaput is criticizing GOP presidential candidate Donald Trumpâs call for an end to automatic citizenship for children born to immigrants in the U.S. illegally. Chaput said the proposal to end birthright citizenship is âa profoundly bad ideaâ and would undermine a pillar of Americaâs identity.(AP Photo/Riccardo De Luca, File) \nPHILADELPHIA (AP) – The leader of the Roman Catholic Archdiocese of Philadelphia on Tuesday attacked GOP presidential candidate Donald Trump's call for ending automatic citizenship for children born to immigrants living illegally in the U.S., saying the idea \"plays on our worst fears and resentments.\" \n\"Some in public life — notably, but not only, Donald Trump — have called for an end to birthright citizenship,\" Archbishop Charles Chaput said in remarks prepared for a church forum that was part of the run-up of activities to a visit by Pope Francis. \"This is a profoundly bad idea.\" \nThe archbishop said he hoped immigration would be a key part of the discussions during the Vatican-sponsored World Meeting of Families in Philadelphia and the pope's appearance during the closing weekend. \nThe pope has decried what he has called the \"inhuman\" conditions facing migrants crossing the U.S.-Mexico border, and encouraged frontier communities to not judge people by stereotypes but rather welcome migrants and work to end discrimination. \nWithout at first mentioning Trump by name, Chaput began his remarks by declaring: \"At least one of our presidential candidates has already made the national immigration debate ugly with a great deal of belligerent bombast.\" \nTrump has proposed the mass deportation of millions of immigrants living in the U.S. illegally, as well as their American-born children. \n\"They're illegal,\" he said of the children. \nU.S.-born children of all immigrants, including those living in the U.S. illegally, have been automatically considered American citizens since the adoption of the Constitution's 14th Amendment in 1868. Repeal of the citizenship clause would require the votes of two-thirds of both houses of Congress and support from three-fourths of the nation's state legislatures. Some conservatives, however, believe that the granting of citizenship in such cases could be changed without amending the Constitution. \nChaput, whose archdiocese has about 1.4 million parishioners, urged Congress to give those living in the U.S. illegally \"an honest, attainable chance at citizenship.\" \nHe also said the nation should stop detaining young mothers with children who are fleeing violence in Central America. \n\"These families pose no threat to anyone,\" he said. \"Detaining them is inhumane.\" \nBirthright citizenship is not only a constitutional right, it also ensures that children don't become stateless or part of a chronic underclass, he said. \nOf Trump's call to end it, he said: \"It plays on our worst fears and resentments. And it undermines one of the pillars of the American founding and national identity.\" \nHe also directed some criticism at the Democratic administration, noting the deportation rate had hit a record under President Barack Obama. \n\"This brutally affects immigrant families — especially those with children who are U.S. citizens,\" he said. \nCardinal Timothy Dolan, New York's archbishop, has also been openly critical of Trump. In an opinion piece in July, the onetime religious history professor wrote that if he were back in the classroom, he'd \"roll out my 'Trump' card'\" to show skeptical students that organized opposition to immigrants was still alive and well. \nLike us on Facebook ", "external_links": [], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T23:32:57.587+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}