{"organizations": [], "uuid": "81c60910901dd69f5fe320a38823ab205964803d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/coal_032514thinkstock.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/253212-house-panel-approves-bill-delaying-obama-coal-mining-rule", "country": "US", "title": "House panel votes to delay Obama coal mining rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House panel votes to delay Obama coal mining rule", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T18:22:00.000+03:00", "replies_count": 0, "uuid": "81c60910901dd69f5fe320a38823ab205964803d"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/253212-house-panel-approves-bill-delaying-obama-coal-mining-rule", "ord_in_thread": 0, "title": "House panel votes to delay Obama coal mining rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House panel votes to delay Obama coal mining rule Thinkstock By Devin Henry - 09/10/15 11:22 AM EDT \nA House panel approved a bill Thursday to delay a new Obama administration coal mining rule on environmental protection. \nRep. Alex Mooney’s (R-W.Va.) STREAM Act would prevent the Office of Surface Mining (OSM) from finalizing the rule until it goes through an external scientific review and the administration releases more of the information that went into crafting it. ADVERTISEMENT The OSM’s rule would update standards creating a buffer zone around streams where mining activities and waste are prohibited. \nThe administration has characterized the rule, more than six years in the making, as a way to protect coal country waterways against the controversial mountaintop removal mining process. But Republicans have called it a job-killing volley in President Obama’s “war on coal.” \n“In my state … the thought of losing thousands more jobs [is] unconscionable,” Mooney said at a House Natural Resources Committee hearing. \n“This newly proposed rule will not only impact coal fields in West Virginia and Appalachia, but also have widespread implications across the country.” \nRepublicans have slammed the rule, arguing OSM has not been transparent in its formulation and that federal officials didn’t take states’ input into consideration. Several states pulled out of the rule-writing process before officials released the proposal this July, saying the Interior Department had not asked for suggestions on the regulations. \n“The OSM’s rule, much like other Interior Department proposals, lacks available, transparent, current data or science to justify the rule,” Rep. Rob Bishop (R-Utah), the chairman of the Natural Resources Committee, said. \n“This runs counter to the administration’s pledge to be the ‘most transparent’ in history,\" he said. \nIndustry groups have long warned against any new regulations on mountaintop mining and said the proposed rule could put hundreds of thousands of jobs at risk. \nBut Democrats say those concerns are exaggerated, noting that the administration estimates the potential job losses are negligible. \nRep. Raul Grijalva (D-Ariz), the ranking Democrat on the Natural Resources Committee, said the rule is an important way to protect public health. \nHe tied Republicans’ efforts to block the rule to their aggressive criticism of a mine spill caused by the Environmental Protection Agency last month. \nI had hoped that the level of outrage expressed by the majority over the spill in the Animas River would extend to the people of Appalachia, but that doesn’t seem to be the case,” he said. \n“When EPA harms water quality, House Republicans issue press releases. When coal companies destroy water quality, House Republicans issue free passes.” \nThe Union of Concerned Scientists also criticized the bill in a Wednesday letter, saying its public disclosure requirements would lead to long delays for future mining regulations. \n“This proposal is just another example of what’s becoming an old and tired song: an attempt to cloak an effort to block common-sense regulation in the guise of transparency,” Andrew Rosenberg, the director of the group’s Center for Science and Democracy, wrote in a letter. \n“This bill risks the timely implementation of regulations and guidance documents that protect the public health and safety and our environment.” \nThe Natural Resources Committee approved the bill along with six others on Thursday, sending them to the House floor for consideration. Tags:", "external_links": [], "published": "2015-09-10T18:22:00.000+03:00", "crawled": "2015-09-10T18:56:19.804+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}