{"organizations": [], "uuid": "3ff2ce7c4b340a551c82570b9548c4219aad6b9e", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150721065245-marijuana-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_topstories.rss", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/08/13/news/ohio-marijuana/index.html", "country": "US", "title": "Ohio to vote on marijuana legalization", "performance_score": 0, "site": "cnn.com", "participants_count": 13, "title_full": "Ohio to vote on marijuana legalization - Aug. 13, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T16:38:00.000+03:00", "replies_count": 12, "uuid": "78713d9012f1050d0ddb8ff2955f090ba5ca06d7"}, "author": "Aaron Smith", "url": "http://money.cnn.com/2015/08/13/news/ohio-marijuana/index.html#post-0", "ord_in_thread": 0, "title": "Ohio to vote on marijuana legalization", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here are the next states to legalize pot Ohio will be the next state to vote on marijuana legalization. The legalization group ResponsibleOhio collected enough signatures to get it on the ballot for November 3, according to Ohio secretary of state Jon Husted.\nVoters will decide whether to legalize marijuana for medical and recreational use.\nResponsibleOhio collected 320,267 petition signatures, exceeding the ballot requirement by nearly 15,000, for the proposed amendment to the Ohio Constitution.\n\"By reforming marijuana laws in November, we'll provide compassionate care to sick Ohioans, bring money back to our local communities and establish a new industry with limitless economic development opportunities,\" said Ian James, executive director of ResponsibleOhio.\nIf the voters approve it, Ohio would be the fifth state to legalize marijuana for recreational use. People aged 21 or older would be allowed to possess up to an ounce. Growers would be required to get a license, and that would allow them four plants and eight ounces.\nRecreational pot is already legal in Colorado, Washington, Oregon and Alaska, as well as Washington, D.C. Medical marijuana is legal in 23 states and D.C., according to the Marijuana Policy Project.\nOhio's proposed amendment outlines a system where 10 different marijuana farms would be established in 10 different counties, including Hamilton, where Cincinnati is located. The proposal specifies the location and size of the plots.\nFacilities that make marijuana-infused products would be licensed and regulated by the state to control potency and to make sure \"that the products are not manufactured, packaged, or advertised in ways that create a substantial risk of attractiveness to children .\"\nRelated: Fire pot user vows: I will change the law\nA flat tax of 15% would be imposed on the farms and manufacturing facilities. A tax of 5% would be imposed on the gross revenue of marijuana stores.\nThe exact wording of the proposed amendment still needs get finalized by the Ohio Ballot Board, which meets on August 18.\nAdam Orens, managing director of the Marijuana Policy Group, said the 10-farm proposal would squelch fair and open competition. He said that such a system is unprecedented.\n\"I can't help but think the 10 cultivations, identified by specific location in the petition, are an amazing cash-grab by the proponents of the petition,\" Orens said. \"I would be surprised if the voters of Ohio don't see right through this.\"\nThe proposal allows for additional farm licenses if warranted, Orens said. \"But that would not occur for several years allowing those that get in the door first an unfair head start, seemingly without an open competition for the initial 10 cultivation licenses,\" he added.\nResponsibleOhio did not immediately respond to CNNMoney's request for comment.\nRelated: Watch the pot ad that got banned from TV\nOhio would be the first state to legalize recreational cannabis without a pre-existing medical marijuana program. This presents unique challenges in getting a retail program off the ground.\nColorado already had a well-established medical dispensary system when recreational marijuana was legalized, so the process of converting some of those dispensaries to recreational retail was relatively fluid.\nBut in Oregon, where recreational weed became legal last month , it will probably be a year before the state opens its first retail stores. This is because Oregon's system of medical dispensaries is less extensive than it was in Colorado.\nMarijuana is still illegal under federal law, and that creates problems even in states where it's legal. For instance, marijuana businesses face challenges with banking. Financial institutions, which are regulated by the federal government, tend to shun dispensaries.\nThere are also issues with advertising. Neos, a vaporizer company, got its TV ad blocked in Colorado because the federal government regulates the airwaves.\nRelated: United Nations says legalization is driving pot use in U.S.\nCNNMoney (New York) August 13, 2015: 8:38 AM ET", "external_links": ["http://i2.cdn.turner.com/money/dam/assets/150415120240-the-next-states-to-legalize-marijuana-00002320-1024x576.jpg", "http://www.sos.state.oh.us/sos/upload/ballotboard/2015/2015-03-13-petition.pdf"], "published": "2015-08-13T16:38:00.000+03:00", "crawled": "2015-08-14T02:17:50.396+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}