{"organizations": ["Paris Climate Conference Would Look Like Email Obama"], "uuid": "368e3a7497db0c241bc03cec84af1678816c3eaf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/5602dd911c00007300757bbc.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-paris-climate_5602dc70e4b0fde8b0d0d31a", "country": "", "title": "Obama Outlines What Success At Paris Climate Conference Would Look Like", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Outlines What Success At Paris Climate Conference Would Look Like", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T22:57:00.000+03:00", "replies_count": 0, "uuid": "368e3a7497db0c241bc03cec84af1678816c3eaf"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-paris-climate_5602dc70e4b0fde8b0d0d31a", "ord_in_thread": 0, "title": "Obama Outlines What Success At Paris Climate Conference Would Look Like", "locations": ["Paris"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kate Sheppard", "Obama"], "text": "Email Obama Outlines What Success At Paris Climate Conference Would Look Like \"If we get the structure right, then we can turn the dials as there's additional public education.\" Kate Sheppard Senior reporter/Environment and energy editor, The Huffington Post Posted: 09/23/2015 02:22 PM EDT ASSOCIATED PRESS \nPresident Barack Obama is \"cautiously optimistic\" about the prospect of a global climate agreement emerging from negotiations in Paris at the end of this year. \nHeading into the conference, he said in an interview with Rolling Stone's Jeff Goodell published Wednesday, \"we're now in a position for the first time to have all countries recognize their responsibilities to tackle the problem, and to have a meaningful set of targets as well as the financing required to help poor countries adapt.\" \nWorld leaders will meet in Paris in December to continue negotiations toward an international climate pact. More than 60 countries have already offered individual emission reduction targets as part of the United Nations Framework Convention on Climate Change, but the Paris summit is expected to be where countries will finalize and formalize a binding international agreement. \nObama said he recognizes the targets individual countries have offered so far aren't strong enough, but he believes they are a starting point. \n\"[T]he science keeps on telling us we're just not acting fast enough,\" he said. \"My attitude, though, is that if we get the structure right, then we can turn the dials as there's additional public education, not just in the United States but across the world, and people feel a greater urgency about it and there's more political will to act.\" \n\"[T]he key for Paris is just to make sure that everybody is locked in, saying, 'We're going to do this,'\" Obama continued. \"Once we get to that point, then we can turn the dials. But there will be a momentum that is built, and I'm confident that we will then be in a position to listen more carefully to the science -- partly because people, I think, will be not as fearful of the consequences or as cynical about what can be achieved. Hope builds on itself. Success breeds success.\" \nGoodell sat down with Obama during the president's trip to Alaska last month, which the writer describes as \"mostly a calculated and well-crafted presidential publicity stunt\" but one that the administration used to call attention to climate change, an issue it sees as imperative to Obama's legacy. \nObama described the 2009 Copenhagen climate talks , which had also been expected to yield an international climate accord, as \"a disorganized mess.\" After two weeks of negotiations, leaders still had not come to any agreement. \n\"I still remember flying in that last day, and nothing was happening, and I literally had to rescue the entire enterprise by crashing a meeting of the BRIC countries [Brazil, Russia, India and China] and strong-arming them into coming up with at least a document that could build some consensus going into the future,\" Obama said. \nSix years later, there's more hope that leaders will finally reach a formal agreement. Obama said much has changed since then, citing bilateral work with China , India and Brazil . Obama is meeting with Chinese President Xi Jinping again later this week, and climate change is expected to be a top topic for the leaders of the world's two biggest emitters. \nIn the wide-ranging interview, Obama also touches on the failures of cap-and-trade, why his administration approved Arctic drilling, and his outlook on the prospects of stopping catastrophic climate change. ", "external_links": [], "published": "2015-09-23T22:57:00.000+03:00", "crawled": "2015-09-23T22:58:58.401+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}