{"organizations": ["AP Photo/The Brownsville Herald"], "uuid": "6fa803bbfcd50f65f25a0e3a142768614784a3a6", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/08/12/why-this-libertarian-and-others-love-immigration/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1439409608406.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/08/12/why-this-libertarian-and-others-love-immigration.html", "country": "", "title": "Why this libertarian (and others) love immigration | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Why this libertarian (and others) love immigration | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "6fa803bbfcd50f65f25a0e3a142768614784a3a6"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/08/12/why-this-libertarian-and-others-love-immigration.html", "ord_in_thread": 0, "title": "Why this libertarian (and others) love immigration | Fox News", "locations": ["Brownsville", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Yvette Vela", "Obama"], "text": "March 19, 2015: Over a hundred protesters stand outside of the federal courthouse in Brownsville, Texas to protest a federal judge's hold on President Obama's executive action on immigration. (AP Photo/The Brownsville Herald, Yvette Vela) \nYikes, you really hate me! \nMany of you, anyway, based on Twitter and Facebook comments posted after I argued immigration with Ann Coulter on my TV show. \n“Move into an illegal-heavy neighborhood and get back to us!” \n“Another libertarian who believes illegal invaders are good for our country. Madness.” \nMadness? \nClearly, lots of Americans are mad about immigration. But we libertarians believe that people trapped in horrible countries deserve a chance at a better life and that free trade in labor, not just products, is a good thing. \nWhy would I think that when my Facebook “fans” tell me things like: “Most immigrants, legal & illegal, get food stamps & welfare”? \nBecause that’s not true. \n“Almost all welfare programs in the U.S. are limited to legal immigrants living here at least five years,” points out Cato Institute policy analyst Alex Nowrasteh. \nOf course, some immigrants cheat, many hospitals lose money treating undocumented people and immigrants’ kids get free public schooling. On average, the lifetime fiscal impact of the average immigrant is negative $3,000, says the National Research Council. \nBut the NRC goes on to say that descendants of the immigrant make a positive fiscal contribution of $83,000. \nThat’s a big win for America. \nEven illegal immigration helps delay the bankruptcy of Social Security and Medicare. Young illegal workers pay into the system -- but most don’t collect. “Medicare and Social Security -- the biggest welfare programs,” says Nowrasteh. “Immigrants subsidize those programs massively.” \nHealth policy journal Health Affairs says in 2009 immigrants contributed $13.8 billion more to the Medicare Trust Fund than they collected in benefits. In the same year, native-born Americans took out $30.9 billion more than they paid in. \nBeyond the financial arguments, let’s not forget that immigrants bring us new ideas. They invent more things than native-born Americans. Immigrants gave us Google, YouTube, blenders, ATMs, basketball, shopping malls, blue jeans, hot dogs and more. \nAnn Coulter told me, “that was then, those were European immigrants.” But now we admit “brown people” who are turning America into “a Third World hellhole.” \nCoulter says that the new immigrants don’t assimilate the way Europeans did. Maybe that’s true, but I pointed out that immigrants from Nigeria, Jamaica and Ghana are more likely to be employed than native-born Americans and twice as likely to get a college degree. “I don’t believe it,” answered Coulter. \nShe also argues that America admits too many immigrants, but how many is too many? Thirteen percent of America’s population is now foreign born (down from 15 percent in 1915). Immigrants make up 27 percent of the population in Switzerland and Australia. \nOf course, it would be good if all immigrants came here legally. But America makes that difficult. \nThe government awards 50,000 green cards by lottery, but in 2014, 11 million people applied, so the vast majority never get them. \nForbes says a computer programmer from India who wants to work in America legally must wait an average of 35 years. A Mexican teenager would have to wait 131 years. No wonder people give up on the legal approach and sneak in. \nDonald Trump calls immigrants “criminals,” and some are. We don’t know how many because America doesn’t know how many illegals are here. But a count of prisoners shows that more Americans are jailed than immigrants. Social Science Quarterl y found “cities with greater growth in immigrant ... populations ... have steeper decreases in homicide and robbery rates.” \nHard-core libertarians dominated my studio audience that day, and some booed Coulter (gently). \nOn Twitter, MissJitter responded: “White guilt is apparently alive & well in his audience.” \nBetty Orvis complained that I invited “a stacked audience of open border supporters. Real fair … not! … The elites in this country do not care one bit about the dire effects of illegal immigration. … I guess facts are ‘racist.’” \nBut libertarian support for immigration is not about “elites” or “guilt.” The facts show that immigration is mostly good. \nJohn Stossel is the host of \"Stossel\" (Thursdays at 9 PM/ET) , a weekly program highlighting current consumer issues with a libertarian viewpoint. Stossel also appears regularly on Fox News Channel (FNC) providing signature analysis. Click here for more information on John Stossel . ", "external_links": [], "published": "2015-08-13T03:00:00.000+03:00", "crawled": "2015-08-14T04:15:35.605+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}