{"organizations": [], "uuid": "b14ef9aec9260bac4c5f4cce38985abe421b90bf", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/09/15/opinions/noorani-reagan-immigration/index.html", "country": "", "title": "What Ronald Reagan knew about immigration - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "What Ronald Reagan knew about immigration - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "b14ef9aec9260bac4c5f4cce38985abe421b90bf"}, "author": "", "url": "http://www.cnn.com/2015/09/15/opinions/noorani-reagan-immigration/index.html", "ord_in_thread": 0, "title": "What Ronald Reagan knew about immigration - CNN.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> What Reagan knew about immigration By Ali Noorani Updated 2019 GMT (0319 HKT) September 15, 2015 11 photos: Ronald Reagan's life and career Ronald Reagan, the 40th president of the United States, first became famous as an actor. Here, he sits with American actress Margaret Lindsay in the Warner Brothers Studio commissary in 1935. Hide Caption 1 of 11 11 photos: Ronald Reagan's life and career Reagan and his wife, Nancy Reagan, gaze at one another across a table in about 1952, the year they were married. Hide Caption 11 photos: Ronald Reagan's life and career Reagan wears a T-shirt and stands next to a black horse in a 1935 portrait. Hide Caption 3 of 11 11 photos: Ronald Reagan's life and career In a 1919 photo, future U.S. President Ronald Reagan (second row, left) stands with his classmates in a third-grade class portrait in Tampico, Illinois. Hide Caption 4 of 11 11 photos: Ronald Reagan's life and career Reagan appears with Patricia Neal on November 20, 1948, at the Royal Command Film Performance of \"Scott of the Antarctic\" at the Empire Theatre, London. Hide Caption 11 photos: Ronald Reagan's life and career Reagan smiles as he speaks during his presidential campaign in 1979. Hide Caption 6 of 11 11 photos: Ronald Reagan's life and career Reagan makes a speech during the Republican presidential primary in New York in March 1980. Behind him are campaign posters with one of his most famous slogans: \"Let's make America great again.\" Hide Caption 11 photos: Ronald Reagan's life and career A 1980 campaign button features Reagan and his running mate, George H. W. Bush. Hide Caption 8 of 11 11 photos: Ronald Reagan's life and career Outgoing President Jimmy Carter, left, sits with president-elect Ronald Reagan in the back of a limousine en route to Reagan's inauguration on January 20, 1981. Hide Caption 11 photos: Ronald Reagan's life and career Reagan addresses the Republican National Convention in 1984. Hide Caption 10 of 11 11 photos: Ronald Reagan's life and career Reagan and first lady Nancy Reagan take a horseback ride at their Rancho del Cielo vacation home in Santa Barbara, California, circa 1982. Hide Caption 11 of 11 Story highlights Ali Noorani's parents came to U.S. in 1971, were supporters of Reagan, who empathized with their concerns, priorities, dreams He says Reagan spoke of \"shining city upon a hill\" with doors \"open to anyone with the will and the heart to get here\" Trump, Cruz, Walker, others speak of changing Constitution to keep immigrants out; Americans know better, he says Ali Noorani is the executive director of the National Immigration Forum Action Fund , an organization based in Washington that advocates for the value of immigrants. This commentary coincides with a major ad buy the organization is undertaking on CNN and other outlets ahead of the CNN Debate. Follow Ali Noorani on Twitter @anoorani. The opinions expressed in this commentary are solely those of the author. (CNN) I remember the first time my mom took me to the voting booth. The drive to the local high school in the family station wagon. The smell of the cafeteria turned into a polling station. The feeling of the heavy blue curtains. And, finally, the imposing contraption my mother used to mark her vote for president of the United States: Ronald W. Reagan. Ali Noorani My parents immigrated to the United States in 1971. They came, like millions of immigrants before and after them, for a better life. And in 1978, they were proud to become U.S. citizens. My parents voted and followed the news, but I didn't grow up in a political family. We were like practically every other American family, navigating the daily cycle of school, work -- life. While I may not have completely understood the politics of the moment, I remember it was an unsettling time. The economy was struggling, the threat of nuclear war never seemed far off, and there was always a subtle tension to what you saw and heard on television in the evening. In Reagan, my mother helped elect a Republican who connected with people; who empathized with their dreams, fears and aspirations; who inspired all of us to be our better selves. When he spoke of a \"shining city upon a hill,\" he painted a picture of an America that welcomed everyone. How times have changed. The front-runner for the Republican nomination, Donald Trump, has brought out a dark side to America's immigration debate that for decades has been buried far below the mainstream. \"When Mexico sends its people, they're not sending their best,\" Trump said in June, in announcing his run for president. (Think about that.) 6 photos: Donald Trump: His own words In his interview with CNN's Dana Bash, Donald Trump lashes out at a lawyer who had requested a break to pump breast milk in the middle of a deposition. Hide Caption 6 photos: Donald Trump: His own words Hide Caption 6 photos: Donald Trump: His own words Hide Caption 6 photos: Donald Trump: His own words Hide Caption 6 photos: Donald Trump: His own words Hide Caption 6 photos: Donald Trump: His own words Hide Caption 6 of 6 \"They're sending people that have lots of problems, and they're bringing those problems with us,\" he continued. \"They're bringing drugs. They're bringing crime. They're rapists.\" Fast forward to August 24 : \"If I'm elected, they're going to be out of there Day One. We're going to get them the hell out of our country.\" And Trump only outdid himself in a September 10 conference call with Alabama Republican activists, during which he claimed he would be able to deport 11 million undocumented immigrants in \"18 months to two years, if properly handled.\" Trump may be egregious, but he isn't alone. \"We should end granting automatic birthright citizenship to the children of those who are here illegally,\" Sen. Ted Cruz of Texas said August 19, echoing calls to turn away from nothing less than the 14th Amendment to the Constitution. \"Yeah, absolutely,\" Gov. Scott Walker replied to a reporter's question August 17 regarding birthright citizenship. He later changed course, as he did again when reporters questioned his calling a border wall with Canada a \"legitimate issue for us to look at.\" JUST WATCHED ", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T03:30:25.705+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}