{"organizations": [], "uuid": "668850c7228a9fa635430de79fa2a85355e496b9", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/08/24/politics/joe-biden-obama-blessing-2016/index.html", "country": "", "title": "Obama gives Joe Biden 'blessing' for 2016 bid - CNNPolitics.com", "performance_score": 10, "site": "cnn.com", "participants_count": 0, "title_full": "Obama gives Joe Biden 'blessing' for 2016 bid - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T02:17:00.000+03:00", "replies_count": 0, "uuid": "668850c7228a9fa635430de79fa2a85355e496b9"}, "author": "", "url": "http://www.cnn.com/2015/08/24/politics/joe-biden-obama-blessing-2016/index.html", "ord_in_thread": 0, "title": "Obama gives Joe Biden 'blessing' for 2016 bid - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama gives Joe Biden 'blessing' for 2016 bid By Jeff Zeleny and Peter Morris, CNN Updated 0007 GMT (0707 HKT) August 25, 2015 14 photos: Photos: Vice President Joe Biden U.S. Vice President Joe Biden began his career in politics in 1972, winning election to the Senate at the age of 29 (he was 30 when he took office). The Delaware Democrat was reelected to the Senate six times, including 2008, before becoming the 47th vice president of the United States. Hide Caption 1 of 14 14 photos: Photos: Vice President Joe Biden Biden is sworn in for his second term as vice president by Supreme Court Justice Sonia Sotomayor, with his wife, Jill, and son, Beau, by his side, on January 21, 2013, in Washington. Hide Caption 2 of 14 14 photos: Photos: Vice President Joe Biden Biden presides over a ceremony in Baghdad to formally mark the end of the U.S. combat mission in Iraq on September 1, 2010. Hide Caption 3 of 14 14 photos: Photos: Vice President Joe Biden Biden and President-elect Barack Obama wave to the crowd at their election night party at Grant Park in Chicago on November 4, 2008. Hide Caption 4 of 14 14 photos: Photos: Vice President Joe Biden Biden speaks after being introduced as Obama's running mate while campaigning together after the Democratic National Convention in 2008. Hide Caption 5 of 14 14 photos: Photos: Vice President Joe Biden From left, former Sen. John Edwards, Biden, Obama and Sen. Hillary Clinton at a debate of Democratic presidential candidates on April 26, 2007, in Orangeburg, South Carolina. Hide Caption 14 photos: Photos: Vice President Joe Biden Biden releases his memoir, \"Promises to Keep: On Life and Politics,\" in 2007. Hide Caption 7 of 14 14 photos: Photos: Vice President Joe Biden As a ranking member of the Senate Foreign Relations Committee, Biden is interviewed on NBC's \"Meet the Press,\" concerning the war in Iraq on August 14, 2005. Hide Caption 8 of 14 14 photos: Photos: Vice President Joe Biden While chairman of the Senate Foreign Relations Committee, Biden meets Afghan students during a visit to Kabul in 2002. Hide Caption 14 photos: Photos: Vice President Joe Biden Biden is welcomed back after undergoing surgery for an aneurysm in 1988. Hide Caption 10 of 14 14 photos: Photos: Vice President Joe Biden Biden announces his candidacy for the Democratic presidential nomination in 1988. After three months he drops out, following reports of plagiarism and false claims about his academic record. Hide Caption 11 of 14 14 photos: Photos: Vice President Joe Biden While on the Senate Judiciary Committee, Biden meets with Sen. Frank Church, center, and Egyptian President Anwar Sadat after the signing of the Egyptian-Israeli Peace Treaty in 1979. Hide Caption 12 of 14 14 photos: Photos: Vice President Joe Biden President Jimmy Carter and Biden attend a reception for the Delaware Democratic Party in 1978. Biden was the first senator to endorse Carter's presidential candidacy two years earlier. Hide Caption 13 of 14 14 photos: Photos: Vice President Joe Biden At a convention in 1972, Biden and his first wife, Neilia, and his two sons take a photo with Delaware Gov.-elect Sherman W. Tribbitt and his wife Jeanne. Neilia Biden died in a car accident a few months later, after his first election to the Senate, along with their infant daughter, Naomi. Hide Caption ", "external_links": [], "published": "2015-08-25T02:17:00.000+03:00", "crawled": "2015-08-25T02:17:11.337+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}