{"organizations": [], "uuid": "6e598e0e33776f077734de2068213b97a013f104", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150910162611-barack-obama-sept-9-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/09/14/politics/obama-iowa-education-fafsa/index.html?eref=rss_politics", "country": "US", "title": "Obama brings education message to hub of 2016 politics", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama brings education message to hub of 2016 politics", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T23:44:00.000+03:00", "replies_count": 0, "uuid": "6e598e0e33776f077734de2068213b97a013f104"}, "author": "", "url": "http://edition.cnn.com/2015/09/14/politics/obama-iowa-education-fafsa/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Obama brings education message to hub of 2016 politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama brings education message to hub of 2016 politics By Kevin Liptak , CNN White House Producer Updated 1952 GMT (0252 HKT) September 14, 2015 13 photos: Then-Senator Barack Obama's trip to Kenya Fourteen years after traveling to Kenya for the first time, Barack Obama received a warm welcome when he and his family visited in August 2006. Hide Caption 1 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Arriving on East African Express Airlines, Obama stepped off to far less fanfare than when he will later descend the steps of Air Force One. Hide Caption 2 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya A safari in the Maasai Mara National Reserve was one of the side trips on Obama's 17-day, six-nation tour of Africa in 2006. Hide Caption 3 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya On the lookout for wild game, Obama and his family set off across the Maasai Mara. A lion kill was the day's highlight. Hide Caption 4 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Artwork sprouted up across Kenya celebrating the ancestral roots of Obama, including this mural in Nairobi. Hide Caption 5 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Michelle Obama and the couple's two daughters, Sasha and Malia, joined a school dedication during the 2006 trip. Hide Caption 13 photos: Then-Senator Barack Obama's trip to Kenya Obama and Malia, who he playfully called \"Cool Breeze,\" enjoyed the scenery in rural Kenya. Hide Caption 7 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Peace Corps volunteers from the United States were pleased to run into Obama in Kisumu, Kenya. Hide Caption 8 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya The Obama brand was popular across Africa, too, with these admirers holding up shirts as they watched Obama pass. Hide Caption 9 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Sarah Obama, the matriarch of the family, welcomed Obama to her home in Kogelo. She was the stepmother of his father, Barack Obama Sr. Hide Caption 10 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Large crowds gathered across Kenya to welcome Obama, who received too many gifts to bring home to the United States. Hide Caption 11 of 13 13 photos: Then-Senator Barack Obama's trip to Kenya Five months before announcing his presidential bid, Obama sat in a Nairobi school and discussed the hopes and dreams of students. Hide Caption 13 photos: Then-Senator Barack Obama's trip to Kenya The Nation, the premiere newspaper in Nairobi, treated the freshman senator's visit as major news. Hide Caption 13 of 13 Story highlights Obama is returning to the site of the first-in-the-nation caucus to promote his higher education agenda He's eager to remain relevant in the current political conversation Des Moines, Iowa (CNN) These days, most politicians heading to Iowa are trying to become president. On Monday, though, the big-wig landing in the state already occupies the Oval Office. President Barack Obama is returning to the site of the first-in-the-nation caucuses to promote his higher education agenda, though the undercurrent of the state's full-swing campaign season isn't likely to go unmentioned during his short stop there. In recent days, Obama has lambasted Republicans running for their party's nomination on topics like the economy and climate change, saying they'd take the country in the wrong direction if elected to the White House. He's eager to remain relevant in the current political conversation, even as the race to replace him consumes more and more of the spotlight. And while he won't be stumping for any particular candidate in Des Moines, his message on making college more affordable fits squarely within the Democratic messaging that candidates like Bernie Sanders and Hillary Clinton have been extolling. The White House claims the decision to travel to Iowa wasn't made with political motivations; instead, they say the Department of Education put a pin on the state while planning the back-to-school bus tour the Education Secretary Arne Duncan embarks upon yearly. But there are plenty of places Obama could have traveled to to underscore his administration's efforts in reducing student debt. On Monday, he'll announce that students applying for federal financial aid will be able to submit the required form -- the FAFSA -- in October, rather than later in January. He won't be the only high-profile Democrat in Iowa on Monday. Hillary Clinton, his former secretary of state, will be 125 miles away in Cedar Falls. They aren't likely to cross paths -- Obama, after all, hasn't said yet that he'll endorse her as his preferred successor. That's because Vice President Joe Biden hasn't yet said whether he's running for president. Obama may endorse a candidate in the Democratic primary, the White House has said. Biden himself plans to travel to Southern California on Wednesday to promote the administration's climate change agenda -- just as the Republican presidential candidates convene for their second debate hosted by CNN at the Reagan Library in Simi Valley. Like Obama, Biden hasn't been shy in blasting Republicans for doing little to curb carbon emissions. Race to the White House More from Politics", "external_links": [], "published": "2015-09-14T23:44:00.000+03:00", "crawled": "2015-09-15T00:29:27.926+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}