{"organizations": [], "uuid": "80d45538eb94f76f36a23c46ec55fee2b34940bf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e64f501400002e002e4ac3.jpeg", "site_section": "http://www.huffingtonpost.com/tag/alaska/feed", "section_title": "Alaska on Huffington Post", "url": "http://www.huffingtonpost.com/entry/barack-obama-climate-change_55e64dfce4b0c818f619b2e9", "country": "US", "title": "Obama Points To Disappearing Alaskan Glacier As Powerful Sign Of Climate Change", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Points To Disappearing Alaskan Glacier As Powerful Sign Of Climate Change", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T00:25:00.000+03:00", "replies_count": 0, "uuid": "80d45538eb94f76f36a23c46ec55fee2b34940bf"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/entry/barack-obama-climate-change_55e64dfce4b0c818f619b2e9", "ord_in_thread": 0, "title": "Obama Points To Disappearing Alaskan Glacier As Powerful Sign Of Climate Change", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Points To Disappearing Alaskan Glacier As Powerful Sign Of Climate Change \"We want to make sure that our own grandkids can see this.\" By Roberta Rampton Posted: 09/01/2015 09:25 PM EDT ASSOCIATED PRESS \nSEWARD, Alaska (Reuters) - President Barack Obama walked down a winding wooded path past a small brown post marked \"1926,\" past a glacial stream trickling over gravel that eons of ice have scraped off mountain peaks. \nHe reached another post reading \"1951\" - a marker for the edge of Alaska's Exit Glacier that year - and gazed up toward where the rock-rutted ice mass has since receded, a quarter-mile away. \n\"This is as good a signpost of what we're dealing with on climate change as just about anything,\" Obama told reporters waiting at the base of the glacier. MANDEL NGAN via Getty Images \nIt was the signature moment of Obama's trek to Alaska, aimed at making the world pay heed to how much damage rising seas have already caused, and demand their leaders reach a deal in Paris in December to curb climate-changing carbon emissions. \nLast year alone, the Exit Glacier melted and retreated 187 feet (57 meters) toward the Harding ice field, which itself has lost 10 percent of its mass since 1950, mainly due to climate change. \n\"It's spectacular,\" Obama said, casting a glance over his shoulder and pausing, as the cameras clicked. \"We want to make sure that our own grandkids can see this.\" ASSOCIATED PRESS \nObama has announced a few new initiatives during his trip. He renamed North American's highest peak, Mount McKinley, as Denali in a nod to the wishes of native Alaskans, and said he would press forward on building badly needed ice breakers. \nBut the White House rolled out Obama's biggest climate initiative months ago - tough new rules to curb carbon emissions from power plants. \nThe main purpose of the Alaska journey is to create powerful images the White House will use to engage Americans on the issue. \nObama on Tuesday taped an episode of NBC survival television show \"Running Wild with Bear Grylls,\" set to air later this year. MANDEL NGAN via Getty Images \nHis three-day visit seemed to delight Alaskans, who lined streets for his motorcade and packed into local coffee shops where he stopped to shake hands. \n\"We get to showcase our piece of paradise to the president of the United States, and that means a lot to us as it would any town,\" said Jean Bardarson, mayor of Seward, near Exit Glacier. \nObama was to complete his tour on Wednesday with a stop in the salmon fishing center of Dillingham and then fly north of the Arctic Circle to the small town of Kotzebue. \n(Additional reporting by Steve Quinn in Juneau, Alaska; Editing by Andrew Hay and Lisa Shumaker)", "external_links": [], "published": "2015-09-02T00:25:00.000+03:00", "crawled": "2015-09-02T04:48:45.339+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}