{"organizations": ["Fox News"], "uuid": "ff45a1eefbb6691fc8a8bacbbc7355a32f060265", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/oreilly_clinton_092815.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/09/29/hillary-steps-on-slippery-slope-with-late-term-abortion/", "country": "", "title": "Hillary steps on slippery slope with late-term abortion | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Hillary steps on slippery slope with late-term abortion | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "ff45a1eefbb6691fc8a8bacbbc7355a32f060265"}, "author": "", "url": "http://www.foxnews.com/politics/2015/09/29/hillary-steps-on-slippery-slope-with-late-term-abortion/", "ord_in_thread": 0, "title": "Hillary steps on slippery slope with late-term abortion | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary"], "text": "\n**Want FOX News First in your inbox every day? Sign up here. ** Buzz Cut: • Hillary steps on slippery slope with late-term abortion • Price looks right for majority leader • But not ‘low,’ right?: Jeb rolls out energy plan • Cruz snags former Ron Paul supporters • ‘The monkey is just smarter sometimes’ HILLARY STEPS ON SLIPPERY SLOPE WITH LATE-TERM ABORTION Why have Democrats long resisted any limitations on elective abortions? After all it’s not like supporting anything called ‘partial-birth abortion’ is a political winner. The answer is the same as why Republicans resist new gun control laws of any kind, even those that have popular support. Any restriction on abortion that is tied to the humanness of an unborn child is the ultimate in slippery-slopes for the pro-choice crowd. As Cecile Richards , the head of Planned Parenthood, arrives on Capitol Hill to testify about a series of shocking videos that depict the business of harvesting and selling the body parts of aborted babies, she and the 60-year-old pro-choice movement are at a crossroads. In some ways, things have never been better. A WSJ/NBC News poll shows 61 percent of respondents opposed ending the half-billion-dollar subsidy Planned Parenthood gets from federal taxpayers, which Republicans are trying to do. And for the first time since 2008, the pro-choice position has a clear lead on the pro-life point of view in Gallup’s polling . [ Nerd alert: A pro-choice majority or plurality was the norm for decades until pro-lifers moved into the lead, or parity. This may be a little misleading, however, since “pro-life” and “pro-choice” are fungible terms. More significant is what restrictions, if any, do voters want to see on elective abortions? There things are pretty stable, which is the plurality position remains that abortion should be “legal in only a few circumstances.” This mirrors the political position shorthanded as “pro-life, with exceptions.” ]Despite the national furor over the videos from the Center for Medical Progress Republican efforts to cut off the funding seem not only doomed to fail, but Richards & Co. promise to make the GOP pay a steep political price next year for a “relentless assault” on reproductive healthcare. Sen. Ted Cruz , R-Texas, got booed by his colleagues Monday night for a stunt aimed at naming and shaming his fellow Republicans who refused to back his plan to defund Planned Parenthood. Cruz, and some others, want to make the defunding a condition of an emergency provision to keep the government fully operational for 10 weeks beyond Thursday’s fiscal cliff. The boo birds were squawking because they don’t want to be on the record supporting a stop gap spending plan that Cruz and his allies will say “funds Planned Parenthood,” or in favor of a measure that Planned Parenthood would say “defunds Planned Parenthood.” So you can see why pro-choice activists are feeling optimistic. They have seemingly survived the video scandals, their Republican detractors are tied in knots, and Democrats are solidly on board. But wait. Hillary Clinton told NBC News that she was “open” to restrictions on late term abortion. That’s not exactly uncharted territory for Clinton, who at times has voiced support for very limited restrictions. However, Clinton’s voting record in the Senate reflects an aggressively pro-choice stance, including opposing a ban on partial-birth abortion. Now remember, what Clinton means by “late-term” is quite different then it’s commonly understood. She’s talking about “the very end of the third trimester.” It’s not a profile in political courage for a Democrat to say they are okay with limited restrictions on elective abortions in the ninth month of pregnancy, but it has meaning in this political moment. Pro-choicers have tormented Democrats to take yucky stances on abortion because they know that an acknowledgment of the humanity of an unborn child leads to disaster for their movement. If Clinton would forbid the abortion of a pregnancy in the ninth month why not the eighth, or the seventh, or the sixth… That’s what Carly Fiorina knows. And that’s why she is absolutely cudgeling Democrats over the videos. Any acknowledgement of immorality or even moral unpleasantness in the work of America’s largest abortion provider is a gateway to ruin for Planned Parenthood. PRICE LOOKS RIGHT FOR MAJORITY LEADER National Journal: “Majority Whip Steve Scalise became the House’s third-ranking Republican by touting Southern pride and conservative bona fides. But just more than one year into his tenure, both attributes come with major downsides in his attempt to become the next House Majority Leader. His shaky first year on the job, mixed reviews from the conservative base he pledged to represent, and persistent news reports that he may have spoken at a white supremacist rally when he was a state legislator in 2002 could hamper the Louisianan’s continued rapid rise, according to several Republican members and aides...That leaves an opening for [Rep. Tom Price ], who Monday was endorsed by Ways and Means Committee Chairman Paul Ryan and Financial Services Committee Chairman Jeb Hensarling – both good friends and influential conservatives. It is still very early in the race, but Price, by virtue of his committee leadership and close loss to [ Cathy McMorris Rodgers ] for the conference chairmanship in 2014, is already perceived as a stronger candidate than Rep. Marlin Stutzman …” [Fox News’ Senior Capitol Hill Producer Chad Pergram has learned Rep. Trey Gowdy , R-S.C., would be willing to serve as an acting Majority Leader if members can’t reach an accord when they meet tonight to discuss the way forward.] WITH YOUR SECOND CUP OF COFFEE… What if you were given a peephole into another world? That’s something like what happened to a New York woman whose iPhone was stolen while she was on a Hamptons debauch. The Atlantic shares the story of a upwardly mobile American woman who was given the unexpected gift of a “one-way mirror” into the poverty, conflict, and abyss that is Yemen. Got a TIP from the RIGH T or the LEFT ? Email FoxNewsFirst@FOXNEWS.COM POLL CHECK Obama Job Approval: Approve – 45.4 percent//Disapprove – 50.0 percent Directions of Country: Right Direction – 26.8 percent//Wrong Track – 63.0 percent BUT NOT ‘LOW,’ RIGHT?: JEB ROLLS OUT ENERGY PLAN TODAY Reuters: “In details of his plan released by his campaign, Bush will call for lifting a U.S. ban on crude oil exports and lift restrictions on natural gas exports …Bush will vow to fight Obama’s plan, released last month, that would force U.S. power plants to reduce carbon emissions as part of an effort to attack climate change…Bush will also vow to approve the Keystone Xl pipeline…” Rubio plans precision counterattacks on Trump - David Drucker reports: “Rubio hopes to distinguish himself in the Trump wars that have ensnared some Republicans by punching and pivoting — strike clean, precision blows and then immediately pivot back to his agenda and his view of what the race should be about. \"He doesn’t play Trump’s game the way many of the candidates have,” said Rick Wilson , a Republican media consultant from Florida who has been critical of Trump and his supporters.” “I’m not interested in the back and forth to be a member or part of his freak show.” – Sen. Marco Rubio , R-Fla., to NPR. Trump builds out on Rubio, Jeb tax plans - Donald Trump released his first detailed policy stance Monday concerning taxes. Bloomberg’s Paula Dwyer gives her take on Trump’s position: “It was a surprise to some analysts that Donald Trump ’s tax plan hewed more to Republican dogma and less to his wilder, populist side. Dylan Matthews at vox.com called it ‘an orthodox supply-side conservative tax plan in a middle-class tax cut’s clothing’…Trump, Bush and Rubio seem to be trying to one-up the other in providing tax relief to lower-income households to address income inequality. Bush says his plan would lower rates so much that 15 million people would no longer have any tax liability. Trump goes further by claiming his lower rates would knock 31 million households off the tax rolls.” Cruz snags former Ron Paul supporters - WaPo: “On Tuesday, [ Ted Cruz ] released a video showing eight former Ron Paul liberty movement supporters -- a number of them from Iowa -- who are now backing Cruz. The campaign announced that former Congressman Bob Barr will chair a Liberty Leaders for Cruz coalition comprised of libertarian-leaning Republicans.” SOUND OFF: READERS RESPOND TO 2016 GOP POWER INDEX “You may think [Ted Cruz] is the greatest thing since sliced bread, but down here in SC there are a whole lot of us who cannot stand the snake. He was NOT a gentleman about John Boehner ’s resignation. And we don’t like that one bit. Cannot stand his whine through his nose or his sneaky eyes either. Ever noticed that he doesn’t look at one but looks sideways? Untrustworthy.” – Jennifer Wellborn “As of today, my favorite candidates would be Carly Fiorina for POTUS and Rubio for [Vice President]. This would eliminate the Dems War on Women. Fiorina has the guts to do hard things; she had the best foreign policy ideas in the debate. Rubio is bright, ethnic and energetic. But he is young and would have time to succeed.” – Libby Hassler “Your GOP power index is totally missing the mark and sounds biased. Trump has more power with the middle class. [My] daughter and I switched to the Republican party because of him.” – Anita Schlesinger Reader Joe Mitchell ranked the candidates explaining his reasoning in part, “While I have supported Trump (and still do), I made [that] choice because I see us needing another LBJ type. Carly is my second choice. She can handle the job and the DC politics and bureaucracy…The only real threat is Rubio, with Cruz a distant second.” Here is Mitchell’s order:1) Trump 2) Fiorina 3) Rubio 4) Cruz 5) Carson 6) Bush ‘THE MONKEY IS JUST SMARTER SOMETIMES’ WESH: “To say some Sanford residents had a wild morning might be a bit of an understatement. A pet monkey escaped from its home Monday, and instead of hiding out in a tree, it took to the streets. Sanford police were called to investigate a report of a monkey eating mail from a mailbox in the Hidden Lakes Subdivision around 8 a.m…Before it was all over, the monkey, named Zeke , jumped onto several other cars, tore off some trim from an unmarked police cruiser and gave a street sign a good shake. A neighbor who hears the monkey regularly said she would not have wanted to face it…Police were able to capture the monkey by offering it a bottle of water. Its owner arrived to retrieve the animal a short time later…‘The monkey got out through no fault of the owner per se. He had the proper caging. The monkey is just smarter sometimes,’ said Steve McDaniel .” Chris Stirewalt is digital politics editor for Fox News. Want FOX News First in your inbox every day? Sign up here. \nChris Stirewalt joined Fox News Channel (FNC) in July of 2010 and serves as digital politics editor based in Washington, D.C. Additionally, he authors the daily \"Fox News First” political news note and hosts “Power Play,” a feature video series, on FoxNews.com. Stirewalt makes frequent appearances on the network, including \"The Kelly File,\" \"Special Report with Bret Baier,\" and \"Fox News Sunday with Chris Wallace.” He also provides expert political analysis for Fox News coverage of state, congressional and presidential elections. Advertisement ", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T11:01:17.205+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}