{"organizations": [], "uuid": "7205bce119c5118484091dfeba4e009532af7644", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/09/04/obama-to-meet-with-saudi-king-in-dc-offer-assurances-on-iran/", "country": "US", "title": "Obama to meet with Saudi king in DC, offer assurances on Iran", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama to meet with Saudi king in DC, offer assurances on Iran | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "7205bce119c5118484091dfeba4e009532af7644"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/09/04/obama-to-meet-with-saudi-king-in-dc-offer-assurances-on-iran/", "ord_in_thread": 0, "title": "Obama to meet with Saudi king in DC, offer assurances on Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print The Obama administration is greeting King Salman of Saudi Arabia with assurances that a nuclear deal with Iran also comes with the necessary resources to help check its regional ambitions. \nThe king is making his first visit to the White House since ascending the throne in January. The visit on Friday comes at an important moment. Congress will soon take up a resolution of disapproval of the nuclear agreement, though Democrats are expected to provide Obama with enough votes to sustain his expected veto. \nSaudi officials have voiced support for the deal, but they are also worried about the international community's ability to enforce it. The visit is pushing the administration to publicly address those concerns before Congress votes. \nTo that end, Secretary of State John Kerry said the U.S is working with allies in the Middle East to develop a ballistic missile defense system, special operations training and will team up on large-scale military exercises. \n\"We are determined that our Gulf friends will have the political and military support that they need,\" Kerry said during a speech delivered in Philadelphia, which was also broadcast in Iran. \nSome suspect that the administration's promises of support are aimed more toward easing the concerns of Congress and the American public than of the king. \n\"Obama only has about a year left so promises about American foreign policy are going to have a very short life,\" said Elliott Abrams, who served as deputy national security adviser to President George W. Bush. \"... I don't know if he's really interested in the president's promises at this point.\" \nRather that exchanging promises, the leaders of the U.S. and Saudi Arabia are focused on delivering a message, Abrams said. \n\"I think he wants to tell the president that Iran is a great danger and an enemy,\" Abrams said of the king. \"The Saudis think we view Iran as a possible partner. They don't.\" \nMeanwhile, the president will want to assure the king he's well aware of the dangers Iran poses. \nOne of Saudi Arabia's greatest concerns is what Iran will do as relief from sanctions and access to frozen assets boosts its economy. The White House now estimates that Iran will be able to access $56 billion once it completes key steps in the agreement. \nBen Rhodes, a deputy national security adviser, said Iran is in such a deep economic hole that its government is likely to use the money to boost the country's economy, but there are no strings attached to the sanctions relief. He also said that the defense budget of U.S. allies in the Gulf is eight times that of Iran and no amount of sanctions relief could close that gap. Some have expressed concern that Iran will use the newly freed money to fund Lebanon-based Hezbollah terror activities, bolster Syrian President Bashar Assad or continue to help destabilize Yemen through the Houthi rebels. \n\"We also acknowledge the fact that we need to ensure that we're doing everything we can to counter Iran's destabilizing activities in the region,\" Rhodes said. \nRhodes said the meeting between Obama and Salman on Friday would likely not lead to any announcements on the sale of new major weapons systems to Saudi Arabia. Rather, the focus is on \"more nimble 21st-century capabilities in areas like cyber and maritime and special forces.\" \nOfficials said the administration would also express concerns during meetings with the Saudis about civilian casualties that have occurred in Yemen, where the Saudis are conducting airstrikes to support the government in a civil war against the Houthis. The United Nations says 2,100 civilians have died as a result of the conflict in Yemen. \nJeff Prescott, a senior director in the president's National Security Council, said the U.S. is asking all sides to allow for unfettered humanitarian access to all parts of Yemen and to avoid damage to infrastructure required to deliver assistance. \n\"I expect the president will express the concerns that we have about the urgent need to find a resolution to this crisis,\" Prescott said during a conference call with reporters previewing the king's visit.", "external_links": [], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-04T16:25:15.052+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}