{"organizations": [], "uuid": "7fc2e057a7a3208c12812d665a21774487f11a87", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/28/obama-y-putin-certifican-en-la-onu-sus-profundas-diferencias-sobre-siria/", "country": "", "title": "Obama y Putin certifican en la ONU sus profundas diferencias sobre Siria | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama y Putin certifican en la ONU sus profundas diferencias sobre Siria | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "7fc2e057a7a3208c12812d665a21774487f11a87"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/09/28/obama-y-putin-certifican-en-la-onu-sus-profundas-diferencias-sobre-siria/", "ord_in_thread": 0, "title": "Obama y Putin certifican en la ONU sus profundas diferencias sobre Siria | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama y Putin certifican en la ONU sus profundas diferencias sobre Siria Published September 28, 2015 EFE \nMiriam Burgués \nNaciones Unidas, 28 sep (EFEUSA).- Barack Obama y el presidente ruso, Vladímir Putin, tuvieron hoy su primera reunión formal en más de dos años, que sirvió para reafirmar lo que ya habían dicho ante la Asamblea General de la ONU y certificar sus diferencias sobre el rol del régimen de Bachar Al Asad en el futuro de Siria. \nLa esperada reunión, celebrada en la sala de consultas del Consejo de Seguridad de la ONU, duró 95 minutos, más de lo previsto, pero no sirvió para llegar a ningún acercamiento entre EEUU y Rusia sobre cómo resolver la crisis que desangra a Siria desde hace más de cuatro años. \nSegún un alto funcionario estadounidense, Obama y Putin coincidieron en la necesidad de buscar una \"solución política\" al conflicto en Siria, pero están fundamentalmente en desacuerdo sobre algo crucial como el papel que debe jugar el presidente Asad. \nPara EEUU, Asad tiene que irse y así lo ha mantenido desde que empezó la crisis, mientras Rusia defiende su legitimidad. \n\"Creo que los rusos sin duda entendieron la importancia de que haya una solución política en Siria y un proceso que persiga esa solución\", pero \"tenemos diferencias en lo que sería el resultado de ese proceso\", en particular en lo relativo a Asad, relató la fuente bajo anonimato. \nPor su parte, Putin habló con los medios rusos tras el encuentro con Obama, del que dijo que fue \"sorpresivamente franco y constructivo\". \nSegún la televisión rusa Russia Today (RT), Putin negó que Moscú tenga o vaya a tener tropas en Siria, aunque el Kremlin ha aumentado recientemente su apoyo militar al régimen de Asad. \nSobre los bombardeos contra posiciones del Estado Islámico (EI) en Siria de la coalición internacional que lidera EEUU, Putin dijo que nadie sabe si están siendo efectivos y no excluyó la posibilidad de que Rusia pueda sumarse a esos ataques, aunque recordó que actualmente no son \"legales\" porque no están bajo el paraguas de la ONU. \nTanto Putin como Obama hablaron durante la mañana ante la Asamblea General de la ONU y allí expusieron muy claramente sus posturas sobre Siria. \nEn su discurso ante la Asamblea, Obama insistió en que Asad debe renunciar para impulsar una \"transición\" que permita poner fin al conflicto, mientras que Putin, en su intervención, pidió el apoyo de la comunidad internacional al \"Gobierno legítimo\" de Damasco. \n\"Estados Unidos está preparado para trabajar con todos los países, incluidos Rusia e Irán, para resolver el conflicto\", pero \"después de tanto derramamiento de sangre no podemos volver al 'statu quo' en Siria\", señaló Obama. \nHoy mismo, su Gobierno intensificó los contactos con los países europeos y árabes que coinciden en que Asad debe abandonar el poder para alcanzar la paz en Siria, a través de una reunión del secretario de Estado, John Kerry, con los ministros de Exteriores de Reino Unido, Francia, Alemania, Arabia Saudí, Jordania y Turquía. \nA su turno ante la Asamblea General, Putin expresó su pleno respaldo al régimen de Asad porque, según dijo, sus fuerzas militares y las milicias kurdas son las únicas \"que verdaderamente están luchando contra las organizaciones terroristas en Siria\". \nEl líder del Kremlin adelantó, además, que quiere proponer la posibilidad de aprobar en el Consejo de Seguridad de la ONU una resolución que busca \"coordinar acciones de todas las fuerzas que se enfrentan al Estado Islámico y otras organizaciones terroristas\". \nHasta hoy, la última reunión formal entre Obama y Putin había tenido lugar a mediados de 2013. \nUnos meses después, a comienzos de 2014, comenzó la crisis ucraniana con la anexión rusa de Crimea, un asunto que ambos trataron también hoy tanto en la ONU como en su encuentro bilateral. \nEn su intervención ante la Asamblea, Obama defendió las sanciones impuestas a Rusia tras la anexión de Crimea porque, según dijo, EEUU no puede quedarse callado \"cuando la soberanía y la integridad territorial de una nación se violan flagrantemente\". \nPor su parte, Putin denunció a su turno el uso de \"sanciones unilaterales\" para servir a \"intereses políticos\" y, al mismo tiempo, \"eliminar competidores\" económicos. \nDurante su reunión, Obama reiteró a Putin el apoyo de EEUU a la \"soberanía e integridad territorial\" de Ucrania, al igual que el compromiso con la \"implementación de los Acuerdos de Minsk\", según el alto funcionario estadounidense. EFEUSA \nmb/ag ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-30T11:57:53.348+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}