{"organizations": [], "uuid": "737e794a78a6329b596fdcbf1e122371eede26a0", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/feeds/Associated%20Press/2015/09/11/0/0/Congress%20Iran%20Nuclear%20Opposition-1.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/us/2015/09/11/house-votes-against-iran-nuclear-deal-even-though-senate-already-has-handed/", "country": "US", "title": "House votes against Iran nuclear deal, even though Senate already has handed Obama a victory", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "House votes against Iran nuclear deal, even though Senate already has handed Obama a victory | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "737e794a78a6329b596fdcbf1e122371eede26a0"}, "author": "Associated Press", "url": "http://www.foxnews.com/us/2015/09/11/house-votes-against-iran-nuclear-deal-even-though-senate-already-has-handed/", "ord_in_thread": 0, "title": "House votes against Iran nuclear deal, even though Senate already has handed Obama a victory", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Associated Press   Email Print In this Sept. 9, 2015, photo, Speaker of the House John Boehner of Ohio, pauses while speaking about his opposition to the Iran deal during a news conference with members of the House Republican leadership on Capitol Hill in Washington. Even though opponents of the Iran nuclear deal can’t win in Congress, they aren’t going to go quietly. \"This debate is far from over, and frankly, it's just beginning,\" Boehner said on Sept. 10. (AP Photo/Jacquelyn Martin)  (The Associated Press) \nSenate Minority Leader Harry Reid of Nev., left, shakes hands with Senate Minority Whip Richard Durbin of Ill.,, right, after speaking with reporters following the Senate vote on the Iran nuclear agreement on Capitol Hill in Washington, Thursday, Sept. 10, 2015. The House is continuing to flex its muscles on the Iran nuclear deal even though the Senate has already sealed its fate in Congress. Senate Democrats voted to uphold the hard-fought nuclear accord with Iran on Thursday, overcoming ferocious GOP opposition and delivering President Barack Obama a legacy-making victory on his top foreign policy priority. (AP Photo/Pablo Martinez Monsivais)  (The Associated Press) \nPrevious Next WASHINGTON –   The Republican-led House went on record Friday against the Iran nuclear deal, but the symbolic vote will not stop President Barack Obama from implementing the agreement.\nAfter three hours of hot-tempered debate, the House voted 269 to 162 to reject the deal. Some two dozen Democrats broke with Obama to register their disapproval.\nThe fate of the agreement on Capitol Hill, however, was sealed on Thursday when Senate Democrats voted to uphold the accord with Iran, overcoming heavy GOP opposition to hand Obama a victory on his top foreign policy priority.\nThe Senate action guaranteed that any legislation disapproving of the accord will never reach Obama's desk. Moreover, House Democrats late Thursday announced there are now 146 members of the House who have publicly voiced their support of the agreement — enough to uphold a presidential veto even if any GOP legislation against the deal could get through.\nThe House was to vote later on a measure to suspend until Jan. 21, 2017 — a day after a new president is sworn into office — Obama's authority to waive, suspend or reduce sanctions on Iran. That measure was expected to pass the House.\nDemocrats argued that the agreement would stabilize the Mideast, stop Iran from rushing to develop a nuclear bomb and offer a chance to end the standoff with Iran diplomatically, while retaining a U.S. threat of military action. They accused House Republicans of using their opposition to the nuclear deal to take a partisan shot at the president.\nRepublicans countered that the agreement's inspection regime against Iran, a state sponsor of terrorism, is weak and repeatedly recalled how Islamic extremists attacked America on Sept. 11, 2001. They said the deal will allow Iran to eventually possess a nuclear weapon and that the billions it will receive through sanctions relief will end up in the hands of terrorist groups that Tehran supports.\n\"This deal is far worse than anything I could have imagined,\" said House Speaker John Boehner, R-Ohio.\n\"This is such a bad deal the ayatollah won't even have to cheat to be steps away from a nuclear weapon.\"\nBoehner criticized the deal, saying that it does not have a rigorous enough inspection regime, will allow Iran to keep thousands of centrifuges spinning and will leave the nation with a chance to become a nuclear-armed state in about a decade.\n\"Never in our history has something with so many consequences for our national security been rammed through with such little support,\" Boehner said. \"Today is Sept. 11 ... Our fight to stop this bad deal is just beginning. We will not let the American people down.\"\nHouse Minority Leader Nancy Pelosi, D-Calif., said that if the Iranians cheat, inspectors using advanced technology will know it. She noted that Iran is already on the threshold of being a nuclear-armed state and that the agreement delays this from becoming a reality for at least a decade.\n\"We mustn't judge agreements for what they don't do. ... Today we will not be just making history ... we will be making progress for the peace in the world,\" Pelosi said.\nRep. Paul Ryan, R-Wis., spoke vehemently against the deal but acknowledged that the vote will not stop the president from implementing the agreement.\nThe House measures could come up in the Senate next week, but would face a filibuster by Senate Democrats and Sept. 17 — the date slated for the close of congressional review of the deal — is less than a week away.\n\"I know the president may have already lined up enough support to save his deal. But with this vote, we need to send a message to both Iran and the world,\" Ryan said.\n\"The regime may have bamboozled this administration, but the American people know that this is a rotten deal.\"\nRep. Peter Roskam, R-Ill., who has been leading opposition to the accord in the House, however, said the Republicans' fight against the deal is not over.\n\"Is this just a bad idea? ... I think it wins the worse idea ever award,\" Roskam said, hinting that House Republicans might take Obama to court over the deal.\n\"The notion that this is all done and it's a settled case. It is not,\" Roskam said.\nWhite House spokesman Josh Earnest dismissed Boehner's warning that he might sue Obama over the Iran deal, saying \"We obviously feel quite confident in our ability to move forward with the rest of the international community.\"\n\"Congress was given an opportunity to set the rules here and this was the outcome that occurred as a result of that process,\" Earnest said of the Senate vote on the resolution of disapproval.\nAs part of the last-ditch effort to snarl the deal, the House on Thursday adopted a resolution on a vote of 245-186 saying that Obama had not complied with the Iran Nuclear Agreement Review Act.\nSupporters of the resolution claimed the act required the president to supply Congress with all documents relevant to the deal, but that the administration did not give lawmakers texts of two agreements that the U.N. nuclear inspection agency negotiated separately with Tehran.\nThe administration says it doesn't have the bilateral agreements and the nuclear inspection agency says confidentiality provisions prevent it from releasing them.", "external_links": [], "published": "2015-09-11T03:00:00.000+03:00", "crawled": "2015-09-11T21:22:35.141+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}