{"organizations": [], "uuid": "232841e4f4020eb556a2590755f8c96b0eec1e75", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/religion/index.xml", "section_title": "Religion - The Huffington Post", "url": "http://www.huffingtonpost.com/stan-chu-ilo/on-abortion-pope-francis-_b_8085330.html", "country": "US", "title": "On Abortion: Pope Francis Opens the Doors of Mercy for Women", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "On Abortion: Pope Francis Opens the Doors of Mercy for Women", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T01:13:00.000+03:00", "replies_count": 0, "uuid": "232841e4f4020eb556a2590755f8c96b0eec1e75"}, "author": "Stan Chu Ilo", "url": "http://www.huffingtonpost.com/stan-chu-ilo/on-abortion-pope-francis-_b_8085330.html", "ord_in_thread": 0, "title": "On Abortion: Pope Francis Opens the Doors of Mercy for Women", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nShe was crying from the depths of her heart. She was a broken young girl probably in her late teens. She had an abortion some three months ago and came to me after Mass desiring to receive the sacrament of reconciliation. This was about fourteen years ago when I was a student priest in Rome and helping out at one of the parishes. She told me that she had not been to Mass in the last three months. She was so filled with the burden of conscience that she was depressed thinking about the painful journey she undertook in terminating her pregnancy. I spoke with her for an hour or so, assured her of God's love and encouraged her to move beyond her past to an appreciation of God's love for her. However, I reminded her that abortion was a 'reserved sin' and that I could not offer her the sacramental forgiveness of the church. I advised her to see the pastor of the parish. Reserved sins in the Catholic Church are those moral offenses which are adjudged by the church to be so serious and grave that it carries immediate censure including in some cases excommunication from the church. Excommunication usually implies deprivation of the sacraments to a Catholic and exclusion from the benefits of the church's prayers. \nIt was on 12 October, 1869 that Pope Pius IX through the bull, Apostolicae Sedis updated and codified the censures of certain offenses in the church including the affirmation of excommunication for those who procured abortion, and 'reserving' the sacramental absolution of such Catholics to local bishops and other designated clergy. This young lady left me a very broken woman. I wasn't sure what she did after our conversation but I never saw her in church after that encounter. Catholic women always bear the burden of abortion. In opening up the possibility of granting reprieve to the burdened consciences and hearts of many Catholic women like this young lady, Pope Francis is helping to bring healing to many Catholic women who are living in the darkness and pain surrounding procured abortion. \nThe brokenness of abortion is so real especially for the woman who more than the man has to bear the physical, moral and emotional pain after the fact. This goes beyond the debates of pro-choice and pro-life advocates within the church and within the state. It is even worse in many poor countries in Africa where abortion, just like pregnancy itself is often a death sentence because of poor healthcare facilities and various unorthodox means used to procure abortion in secret. \nEvery act of abortion is by its very nature a source of brokenness for a woman and for creation. This is because it is by its nature a rupture in one's body, mind, spirit and soul as well as in many cases a rupture in the relationship between the mother and the father of the aborted child. This could happen especially where a Catholic woman exercises her right to abort a baby against the objection of the father of the baby or against the teaching of the church or cultural traditions which are opposed to abortion. \nHowever, the most challenging rupture which abortion brings from my own experience working with women in parishes is the feeling of guilt, of being unworthy before God and of being rejected, judged and excommunicated by the church. In many dioceses, especially in the Global South, women who procured abortion must seek forgiveness from the local bishops or his designate. \nIn the West, this gesture may not be as significant as in the Global South. This is because already here in the West there are pastoral frameworks for the sacramental forgiveness of abortion. Priests in Canada and the U.S. already offer the forgiveness of God to women who sought abortion. But in places like Africa, the woman who procures abortion is still a public sinner, who goes through all kinds of humiliation. The most painful being the fact that women have to go through this rigorous process of going to the bishop's designate sometimes traveling long distances from the rural areas to the cities where the bishops or their designates reside in search of mercy and liberation from the burden of guilt. When I was working in a very rural parish in Eastern Nigeria, I had to send these women to the Deans of deaneries in the cities to receive forgiveness. In most cases, these poor women spend maybe a week's wage in transportation cost in addition to the emotional toll and shame they bear knowing that most people who will see them at the rectory of the Dean know why they had come. \nThis is why Pope Francis' extension of the faculty to forgive the sin of abortion in the Jubilee year to priests is a huge gesture to women especially in the Global South. It is a particularly positive move to support the healing process of many women who having sought abortion are contrite in their hearts and seek communion in the Catholic Church. In the Global South, the reservation of the right to forgive those who sought abortion is still strictly enforced and in some instances involves many penitential practices similar to the ones which were prevalent in the casuistic penitentiaries of Medieval Europe. \nThere are of course many Catholics who think that Pope Francis has not been strong and clear when it comes to contested moral issues like abortion, same-sex marriage and on denial of Holy Communion to divorced and remarried Catholics. \nHowever, beyond these debates, I wish to highlight three points which I think are significant in Francis' gesture. The first is that the mercy of God is given to the whole church and is not an exclusive 'right' given and apportioned to some pope, bishop or church official to the exclusion of others. It is God who gives divine mercy and grace to everyone out of the abundance of God's love. The church should be a willing and open instrument of God's mercy, readily serving the need for healing and restoration of the brokenness in individual and communal life. The second is about the suffering and excommunication of those women who have had abortions. There are two painful realities which I notice in the divisive debates on abortion both in the church and in the state, both of which do not help many women who are silently carrying the brokenness of the scar of abortion. \nFirst is that most states have reduced the abortion discourse today to debates about the right of women without addressing the wider context of why people seek abortion in the first place, and what happens to women after they have exercised this right in terms of the mental, moral, spiritual and emotional healing which need to take place after the fact. \nThe second relates to the church which sometimes neglects the integral healing of those who have sought abortion. On the contrary, there is often in the discourse about abortion in the church greater emphasis on the doctrinal and canonical aspects with regard to the sinfulness of abortion on the one hand, while greater accent is placed in some quarters on the censures and penalties which are imposed or which are to be removed on those who have procured abortion. In this short letter Pope Francis adopts a pastoral approach. He does not minimize the seriousness of abortion nor is he bugged down by the divisive right of women argument. What he does is to propose suitable ways and means to accompany those women who 'with contrite heart, seek forgiveness' for abortion. It is the individual who suffers who needs healing. We are called as a community to become healers and guardians of one another. \nThe third point flows from the last which is that Pope Francis wishes to identify with women who bear the burden of abortion. In most cases, it is the woman who is burdened by 'an unwanted pregnancy' who normally seeks abortion as an escape route. It is the woman who will make the decision and ultimately live with the consequences. In places like Africa, and Asia it is the women who will travel the perilous path to abortion and the painful road to seeking forgiveness from the few priests and bishops who are allowed to meet their need for mercy and healing. In opening this door of mercy, Pope Francis is also reminding many people in the church today that abortion remains a serious and complex moral issue which challenges both the church and the state to deal both with the the root causes of abortion and the wounds which it leaves on many women who seek abortion. This is so important for many Catholic women who are faced daily with the moral dilemma of procuring an abortion in the first place, and how to deal with the consequences of that decision within the context of their faith commitments to the Roman Church. \nFollow Stan Chu Ilo on Twitter: www.twitter.com/Stanchuilo More:", "external_links": [], "published": "2015-09-04T01:13:00.000+03:00", "crawled": "2015-09-04T01:26:19.509+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}