{"organizations": [], "uuid": "25c723316e127be03f85b69f40db51fe9c509044", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/scalefit_1200_noupscale/55ff273b2000002500242a17.jpeg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/john-kasich-ohio-abortion_55ff266be4b08820d919154b", "country": "", "title": "John Kasich Supports Ohio Bill That Would Ban Abortions For Down Syndrome", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "John Kasich Supports Ohio Bill That Would Ban Abortions For Down Syndrome", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T01:49:00.000+03:00", "replies_count": 0, "uuid": "25c723316e127be03f85b69f40db51fe9c509044"}, "author": "", "url": "http://www.huffingtonpost.com/entry/john-kasich-ohio-abortion_55ff266be4b08820d919154b", "ord_in_thread": 0, "title": "John Kasich Supports Ohio Bill That Would Ban Abortions For Down Syndrome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Kasich"], "text": "John Kasich Supports Ohio Bill That Would Ban Abortions For Down Syndrome \"I'm more than glad to say that of course I would sign that.\" Marina Fang Associate Politics Editor, The Huffington Post Posted: 09/20/2015 06:11 PM EDT \nWASHINGTON -- Ohio Gov. John Kasich (R) will sign a state bill banning abortions for Down syndrome if it reaches his desk for approval. \n\"I would sign it, yes,\" Kasich said Sunday on CNN’s “State of the Union.” \"Look, I'm a governor. I'm a CEO. I have to have a hand steady on the wheel. But in this case, I'm more than glad to say that of course I would sign that.\" \nThis was Kasich’s first official comment on the bill , which would bar women from getting abortions solely because they do not wish to have a baby with Down syndrome. The state legislature is still weighing the bill but is expected to pass it sometime this fall, as a majority of its members support more restrictions on abortion. \nThe Republican presidential candidate has authorized prior measures that have restricted abortion access, and he opposes abortion except in cases of rape, incest or to preserve the life of the mother. Kayana Szymczak via Getty Images \nEarlier this month , 2008 GOP vice presidential nominee and former Alaska Gov. Sarah Palin urged Kasich to sign the bill. Palin, who has a son with Down syndrome, said that society has pressured women into choosing abortions. \n\"Culture has told these women ... you're not capable of being able to handle and nurture and love and raise a child with special needs,\" she said. \nAccording to a 2012 review of studies conducted between 1995 and 2011, between 50 and 85 percent of women who discover through prenatal testing that their baby might have Down syndrome have chosen an abortion. But that number has declined over the years when compared ﻿ to studies conducted earlier in the 1990s, the review noted. \nSupporters of Ohio's bill claim that it is meant to reduce discrimination against babies with Down syndrome. However, critics argue it would likely violate the Supreme Court’s Roe v. Wade ruling, which declared that women can choose to get an abortion at any point until the fetus is viable . The ruling also determined that the choice to get an abortion should be a private matter between the patient and her doctor and not determined by the government. \nIf Ohio implements the bill, it will join North Dakota, which passed legislation in 2013 that goes even further, banning all abortions for any “genetic abnormalities.” ", "external_links": [], "published": "2015-09-21T01:49:00.000+03:00", "crawled": "2015-09-21T01:49:13.512+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}