{"organizations": [], "uuid": "af7e3687fb1adeef2123d6a5e17527af9b98a209", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/09/22/senate-dems-likely-to-block-gop-bill-curbing-late-abortions/", "country": "US", "title": "Senate Dems likely to block GOP bill curbing late abortions", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Senate Dems likely to block GOP bill curbing late abortions | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "af7e3687fb1adeef2123d6a5e17527af9b98a209"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/09/22/senate-dems-likely-to-block-gop-bill-curbing-late-abortions/", "ord_in_thread": 0, "title": "Senate Dems likely to block GOP bill curbing late abortions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 22, 2015 Associated Press   Email Print Democrats seem certain to block Republican legislation banning most late-term abortions in a Senate showdown with plenty of political significance but little suspense. \nThough the GOP controls the Senate, Democrats appeared certain to prevent them from getting the 60 votes needed Tuesday to move ahead on the bill. It would be the second time since this summer's release of videos involving Planned Parenthood that Senate Democrats have scuttled a Republican effort to curb the organization and abortions. \nThe Republican bill would set criminal penalties of up to five years in prison for doctors who perform most abortions 20 weeks or more into pregnancy. The House approved the legislation in May. \n\"I'm asking colleagues to open their hearts and help defend the defenseless,\" Senate Majority Leader Mitch McConnell, R-Ky., said Monday. \nSen. Lindsey Graham, R-S.C., a presidential candidate and sponsor of the legislation, said the U.S. is one of just seven countries allowing abortions after 20 weeks and said: \"America needs to get out of this club.\" \nTuesday's vote was coming two days before an unprecedented address to Congress by Pope Francis, who leads a Catholic church that shuns abortion. \nSenate Minority Leader Harry Reid, D-Nev., said the measure would fail and called it \"a way for Senator McConnell to pander to extremists in his party who are once again holding government hostage so they can attack the health of women.\" \nRepublicans hoped that simply allowing a vote on the bill -- which Democrats would not when they controlled the Senate -- would appeal to socially conservative voters and create campaign problems for Democratic senators from GOP-leaning states. By opposing the legislation and casting the battle as one over access to women's health care, Democrats saw an opportunity to woo female and younger voters. \nTuesday's vote came with Republicans trying to halt the $450 million in federal funding that goes yearly to Planned Parenthood, about a third of its overall budget. Senate Democrats blocked a GOP bill last month that would have cut off Planned Parenthood's federal dollars, and McConnell has said the effort won't succeed unless President Barack Obama is replaced by a Republican president in next year's elections. \nLawmakers' focus on abortion intensified thanks to clandestinely recorded videos showing Planned Parenthood officials describing how they sometimes send fetal tissue to medical researchers. Some conservatives want the Planned Parenthood cutoff included in legislation financing government agencies, which would all but guarantee an Obama veto and a partial government shutdown on Oct. 1. \nAbortion foes say the videos show Planned Parenthood has violated federal prohibitions against profiting from fetal tissue sales or changing some abortion procedures to maximize the harvesting of fetuses' organs. Planned Parenthood says it's broken no laws and says the videos were dishonestly manipulated to distort the recorded conversations. \nRepublicans named their bill the Pain Capable Unborn Child Protection Act and say there is evidence that fetuses of 20 weeks can feel pain. Democrats noted that the American Congress of Obstetricians and Gynecologists has said fetal pain is unlikely until several weeks later in a pregnancy's third trimester. \nLate abortions would be allowed for pregnant women whose lives are endangered or who are victims of rapes for which they've received counseling or medical treatment. Minors made pregnant by rape or incest would be exempted if they'd reported the assault to government authorities. \nDoctors performing a permissible late-term abortion would have to try saving the fetus' life if possible, including having a neonatal specialist present and hospitalizing the newborn. Democrats say such requirements are designed to intimidate doctors from performing abortions. \nForty-three states have barred abortions after specific stages of pregnancy, including 22 that do so after at least 20 weeks, according to the Guttmacher Institute, an abortion-rights research group. \nOnly about 1 percent of reported abortions involve pregnancies of 20 weeks or more, according to the federal Centers for Disease Control and Prevention.", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-22T16:32:54.519+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}