{"organizations": [], "uuid": "7dc9a612013ec4ae02ecb2bcbbe503a887ef61e8", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/08/27/el-presidente-estadounidense-destac-la-capacidad-de-la-gente-de-nueva-orleans-para-sobrepasar-los-obstculos-tras-el-paso-del-huracn-katrina.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/08/27/katrina-de-un-desastre-natural-a-uno-hecho-por-el-hombre-obama", "country": "", "title": "‘Katrina’, de un desastre natural a uno hecho por el hombre: Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "‘Katrina’, de un desastre natural a uno hecho por el hombre: Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T01:34:00.000+03:00", "replies_count": 0, "uuid": "7dc9a612013ec4ae02ecb2bcbbe503a887ef61e8"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/08/27/katrina-de-un-desastre-natural-a-uno-hecho-por-el-hombre-obama", "ord_in_thread": 0, "title": "‘Katrina’, de un desastre natural a uno hecho por el hombre: Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía ‘Katrina’, de un desastre natural a uno hecho por el hombre: Obama El presidente de EU dice que conmemorar la tragedia en Nueva Orleans no es para vivir en el pasado, sino para movernos hacia adelante Por Kevin Liptak Jueves, 27 de agosto de 2015 a las 17:34 Obama destacó la capacidad de la gente de Nueva Orleans para sobrepasar los obstáculos tras el paso de 'Katrina' (Reuters). Lo más importante El mandatario regresó a Nueva Orleans para marcar los grandes pasos 10 años después del huracán 'Katrina' Temas relacionados Obama presenta un plan contra el cambio climático \n(CNN) — El huracán Katrina “empezó como un desastre natural”, pero “se convirtió en uno hecho por el hombre, una falla del gobierno al no proteger a sus propios ciudadanos”, dijo el presidente estadounidense, Barack Obama, en Nueva Orleans, Louisiana, este jueves, al conmemorar 10 años de la devastación provocada por aquella tormenta que dejó un saldo de más de 1,800 muertos. \nLee: A 5 años de 'Katrina', Obama promete prevención \n“Nueva Orleans había estado plagada desde tiempo atrás por una inequidad estructural que dejó a demasiada gente, especialmente la gente pobre de color, sin buenos trabajos o asistencia médica asequible o viviendas decentes. Demasiados niños crecieron rodeados de crimen violento”. \n“Reconocemos esta pérdida, este dolor, no para insistir en lo que sucedió, sino para conmemorarlo”, dijo. “No lo hacemos para vivir en el pasado, sino para poder movernos hacia adelante”. \n“Nuestro trabajo aquí no termina si casi el 40% de los niños todavía vive en pobreza en esta ciudad; hacer que nuestras comunidades sean más fuertes será muy importante porque veremos más eventos climáticos extremos”, expresó el presidente estadounidense. \n\"We’ve delivered resources to help Louisiana, Mississippi, Alabama, and Florida rebuild schools & hospitals.\" — @POTUS pic.twitter.com/K5o5qwq9hK — The White House (@WhiteHouse) agosto 27, 2015 \n\"We’re providing housing assistance to more families today than before the storm.\" — @POTUS pic.twitter.com/okKKGmTWQg — The White House (@WhiteHouse) agosto 27, 2015 \nObama regresó a un aparentemente próspero Nueva Orleans este jueves para marcar los grandes pasos 10 años después del huracán Katrina . \nPero debajo de la visible recuperación persisten desigualdades económicas y raciales que no se han desvanecido a una década de la tormenta. \nDecenas de miles de afroamericanos huyeron de Nueva Orleans después de Katrina , y nunca volvieron o regresaron a una ciudad devastada por el paso del fenómeno natural. \nLa tasa de pobreza de la ciudad se mantiene cercana al 30%. Y de acuerdo a un análisis, los hogares afroamericanos en la ciudad ganan hasta 50% menos que sus contrapartes blancos, muy por encima del promedio nacional. \nEn 2010, cuando Obama conmemoró el quinto aniversario de Katrina en su segundo año de presidencia, apenas mencionó los problemas de inequidad racial que plagaban a la ciudad, tanto antes como después de la tormenta, a pesar de hablar en la históricamente negra Universidad Xavier en Gert Town. Encuentra este artículo con: mundo, barack obama, nueva orleans, huracan katrina, presidente estados unidos, desastre natural, conmemoracion, devastacion Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"643f325c55c140b48acd919f32323489\", \"time\": \"2015-08-27T22:34:35.039Z\" } Video ", "external_links": [], "published": "2015-08-28T01:34:00.000+03:00", "crawled": "2015-08-28T01:34:44.766+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}