{"organizations": [], "uuid": "a1a6d7cffa956b2e12ffeae3a403626cf5a500ac", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55e46f8a1400002e002e46ae.jpeg?cache=0mcrC99QdF", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/entry/obama-wants-his-alaska-trip-to-be-the-punctuation-mark-on-his-climate-legacy_55e46f5ce4b0c818f6187092", "country": "", "title": "Obama Wants His Alaska Trip To Be The 'Punctuation Mark' On His Climate Legacy", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Wants His Alaska Trip To Be The 'Punctuation Mark' On His Climate Legacy", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T18:56:00.000+03:00", "replies_count": 0, "uuid": "a1a6d7cffa956b2e12ffeae3a403626cf5a500ac"}, "author": "", "url": "http://www.huffingtonpost.com/entry/obama-wants-his-alaska-trip-to-be-the-punctuation-mark-on-his-climate-legacy_55e46f5ce4b0c818f6187092", "ord_in_thread": 0, "title": "Obama Wants His Alaska Trip To Be The 'Punctuation Mark' On His Climate Legacy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Roberta Rampton", "Obama"], "text": "Obama Wants His Alaska Trip To Be The 'Punctuation Mark' On His Climate Legacy By Roberta Rampton Posted: 08/31/2015 11:17 AM EDT \nWASHINGTON (Reuters) - President Barack Obama sets off for a three-day tour of Alaska on Monday, aiming to shine a spotlight on how the United States is being affected by warming temperatures and rising oceans. \nWith 16 months left in office, Obama is trying to build support for tough new rules on carbon emissions from power plants ahead of a hoped-for international climate deal later this year that could cement his legacy on the issue. \nThe White House has said Obama will announce new policies to help communities adapt to climate change and deploy renewable energy. But the main purpose of his trip is to use the media attention on his tour - amplified by an aggressive social media campaign - to convince Americans to take action. \n\"It's a really important punctuation mark on what he's saying is a top priority for him,\" said Sharon Burke, a former Pentagon official who worked on energy issues for Obama. \n\"It's the ultimate legacy issue because it is something that's going to affect so many generations of Americans,\" said Burke, now a senior adviser at the New America think tank. PAUL J. RICHARDS via Getty Images \nThe hype for the tour began on Sunday with an announcement that Obama would rename North America's tallest mountain as Denali, restoring the traditional Alaska native name to what maps and tourists currently call Mount McKinley. \nWhen Obama lands in Anchorage, he will meet with a group of native leaders and elected officials before addressing an international conference on climate change in the Arctic. \nEnvironmental groups hope he will announce new reforms or restrictions for resource extraction while he is on the trip. \n\"It's an historic event for America and it comes at a critical time for the Arctic, which is warming at twice the rate of the rest of the world,\" said Nicole Whittington-Evans, Alaska regional director of The Wilderness Society. \nDuring the past year, Obama took steps to seal off parts of the oil-rich state from new drilling, although environmental groups are howling about a recent decision to allow Royal Dutch Shell to drill in the Chukchi Sea. \nAlaska's economy is based on oil and gas and the state has pushed to allow expanding the industry. \nObama plans to hike the receding Exit Glacier in Sewell on Tuesday. On Wednesday, he will fly to the salmon fishing mecca of Dillingham and then north of the Arctic Circle to the small town of Kotzebue. \n(Additional reporting by Steve Quinn in Juneau, Alaska; Editing by Dan Grebler) \nAlso on HuffPost: Sasha, Malia, Michelle & Barack Obama of ", "external_links": [], "published": "2015-08-31T18:56:00.000+03:00", "crawled": "2015-08-31T18:56:08.238+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}