{"organizations": [], "uuid": "305e947d28172fb6c0c5ab4d64d8234d171466dc", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/09/10/president-obama-was-hillary-clintons-boss-so-why-isnt-defending-her/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1441904916846.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/politics/", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/opinion/2015/09/10/president-obama-was-hillary-clintons-boss-so-why-isnt-defending-her.html", "country": "US", "title": "President Obama was Hillary Clinton's boss, so why isn't he defending her?", "performance_score": 0, "site": "foxnews.com", "participants_count": 19, "title_full": "President Obama was Hillary Clinton's boss, so why isn't he defending her? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 21, "uuid": "f65a0d1d5304a65bcb524bf1b7ec103575e03005"}, "author": "Paul Goldman", "url": "http://www.foxnews.com/opinion/2015/09/10/president-obama-was-hillary-clintons-boss-so-why-isnt-defending-her.html#post-0", "ord_in_thread": 0, "title": "President Obama was Hillary Clinton's boss, so why isn't he defending her?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Paul Goldman\nPublished September 10, 2015 FoxNews.com livefyre Email Print FILE -- Feb. 23, 2011: President Obama, left, with Secretary of State Hillary Rodham Clinton, right, walks away from the podium after delivering a statement on Libya in the Grand Foyer of the White House in Washington. (AP)\nDid Hillary Clinton have the right to use a private server and email account for all official State Department correspondence, including those containing classified – indeed, top secret – information?\n“Everything I did was permitted” the former Secretary of State told CNN in July .\n“What I did was allowed,” she said Monday. “The State Department has confirmed that.”\nThen on Tuesday, she told ABC news “[e]verybody in the government I communicated with, and that was a lot of people, knew I was using a personal email.” This included people at the “White House” and “across the government.”\nThe front-runner for the Democratic presidential nomination appears to be sending a clear political message as her political fortunes come under increasing attack: the White House knows I am right, as do key officials then serving in the Obama administration. -- They all had ample opportunity, directly or indirectly, to suggest my doing government business on a private email account violated administration policy or worse, might compromise any classified information.\nWhy has the president of the United States remained mute for months on whether or not his former secretary of state is right in claiming she had permission to use a private server and email for all official government correspondence?\nNone did.\nAccording to the Constitution, the president is solely responsible for conducting foreign policy. The State Department is the primary governmental entity for exercising this responsibility, often relying on sensitive, indeed highly classified information provided by the nation’s intelligence and military organizations.\nPresidential executive orders, along with other governmental regulations, have been issued and are constantly updated to ensure this information is properly handled and accounted for.\nThe scope of these orders and regulations is carefully explained to all top State Department officials and their key aides.\nYet the clamor created by former Secretary of State Clinton’s email practices seems, oddly, to be missing the most important voice of all: The president of the United States. He has remained mute for months as to whether his former secretary of state did have the right she is claiming.\nDid she, or didn’t she? This a straightforward question. A basic Yes or No will suffice.\nThe White House seems to be claiming the president’s silence is due to the existence of an ongoing investigation into whether the emails in question contained classified information.\nAdmittedly, the content of a particular email may raise issues pertaining to its handling, identification, protection or redistribution. These touch on legal issues that may be under investigation.\nI get that.\nBut Clinton’s claim, like my question, addresses a different matter entirely. It is separate and apart from her wisdom in using a private system.\nThe fact that someone has a right to do something doesn’t make it the right thing to do. This decision, however, is a matter of judgment. Questioning the wisdom of her choice, therefore, becomes germane only if the right itself exists.\nMrs. Clinton’s assertion also doesn’t address her actions regarding storage and handling of official correspondence in her possession after she left office. It is limited to her tenure working for President Obama.\nDid the rules operative during the first term of the Obama administration give her the right she claims?\nThis isn’t a difficult question to answer. It doesn’t ask the president to address the qualitative content of any email currently under review or likely to be in the future. Clinton says she never sent or received an email marked as containing classified information.\nThis is a carefully nuanced position due in part to the laws and regulations addressing what is, and what isn’t, classified at any given point in time.\nBut these legitimate matters of inquiry are not germane to the simple question at hand.\nAmerican history is replete with controversies involving actions taken by top cabinet members. I am not aware of any time a president or former president failed to support a former cabinet member claiming to have been following administration policy – unless, of course, it was not true.\nMr. President, with all due respect from someone who voted for you two times, I believe you are being unfair to former Secretary Clinton, not to mention the American people.\nIf she did not have the right she claims, then you need to address this breach in your government’s policy publicly.\nHowever, if she had the right – and the weight of the evidence suggests she did – then she deserves, like any worker, public support from her former boss. It is the necessary and honorable action.\nYou might favor Vice President Joe Biden for the Democratic nomination. He’d make a great Democratic president. But as a long-standing supporter of worker's rights, Mr. Biden would surely agree with my position.\nYes or No, Mr. President. Your view of your administration’s policy is the only one that matters, since the former secretary of state worked for you.\nPaul Goldman is a political strategist and a former chairman of Virginia's Democratic Party. He served as senior adviser to former Virginia Governors Doug Wilder and Mark Warner.\n+ Follow FoxNewsOpinion on Facebook", "external_links": ["http://www.washingtonpost.com/blogs/fact-checker/wp/2015/07/09/hillary-clintons-claim-that-everything-i-did-on-emails-was-permitted/", "https://www.facebook.com/FoxNewsOpinion"], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T04:58:06.952+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}