{"organizations": [], "uuid": "314bc5e9160cf25383faceb86a16b765fdab40de", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com//media/2015/07/14/obama-dijo-que-el-acuerdo-con-irn-es-un-paso-hacia-la-direccin-correcta-para-estados-unidos.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/09/19/obama-es-musulman-la-nueva-polemica-en-la-contienda-por-la-casa-blanca?hootPostID=306d2195fb58715abb8c13d71141142f", "country": "", "title": "¿Obama es musulmán? La nueva polémica en la contienda por la Casa Blanca", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "¿Obama es musulmán? La nueva polémica en la contienda por la Casa Blanca", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T10:15:00.000+03:00", "replies_count": 0, "uuid": "314bc5e9160cf25383faceb86a16b765fdab40de"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/09/19/obama-es-musulman-la-nueva-polemica-en-la-contienda-por-la-casa-blanca?hootPostID=306d2195fb58715abb8c13d71141142f", "ord_in_thread": 0, "title": "¿Obama es musulmán? La nueva polémica en la contienda por la Casa Blanca", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía ¿Obama es musulmán? La nueva polémica en la contienda por la Casa Blanca El aspirante presidencial Donald Trump está de nuevo en el ojo del huracán por una declaración; Clinton y Christie se sumaron a la polémica Sábado, 19 de septiembre de 2015 a las 14:28 Obama fue el centro de atención en una polémica más que se desata en la campaña presidencial de EU. Archivo (Reuters). Lo más importante Donald Trump dijo que no está moralmente obligado a defender al presidente Un ciudadano en un evento de Trump afirmó que Obama es mulsulmán Temas relacionados Equipo de Trump, en contradicho por grabaciones \n(AFP) — El precandidato presidencial republicano Donald Trump, a la cabeza en los sondeos, dijo este sábado que no estaba moralmente obligado a defender al presidente estadounidense, Barack Obama, después de dejar pasar una afirmación de un simpatizante que dijo que el presidente era musulmán. \nEn una rápida serie de tuits, el magnate respondió a una lluvia de críticas de los demócratas y de un compañero republicano, el gobernador de Nueva Jersey (noreste), Chris Christie, sobre su forma de manejar el incidente. \n\"¿Estoy moralmente obligado a defender al presidente cada vez que alguien dice algo malo o polémico sobre él? ¡No creo!\", dijo Trump. \nEl magnate, que en 2011 contribuyó a avivar un movimiento para pedir a Obama que probara que no había nacido en Kenia, pareció animar a un simpatizante que, en un evento de campaña el pasado jueves en New Hampshire (noreste), hizo una afirmación incorrecta sobre la fe del presidente. \n\"Tenemos un problema en este país, y son los musulmanes. Sabemos que nuestro actual presidente es uno de ellos, vosotros sabéis que no es ni estadounidense\", dijo el simpatizante no identificado. \nTrump se rió entre dientes y le interrumpió para decir: \"¿Tenemos necesidad de esa pregunta? Esta es la primera pregunta\". \nPoniéndose en los zapatos de Trump, Christie dijo que él habría corregido al hombre y que le hubiera dicho: \"No, el presidente es un cristiano y ha nacido en este país\". \nHillary Clinton, la precandidata que encabeza los sondeos entre los demócratas, calificó la forma en que Trumpo manejó el incidente de \"alarmante y sencillamente equivocada\", mientras el portavoz de la Casa Blanca, Josh Earnest, dijo que no estaba sorprendido porque \"la gente que tiene esos puntos de vista son parte de la base de Trump\". \nPero el millonario no se echó para atrás, afirmando este sábado que era la primera vez en su vida que causaba una polémica \"por NO decir algo\". \n\"Si alguien hace un comentario desagradable o polémico sobre mí al presidente, ¿pensáis realmente que acudiría en mi rescate? ¡Para nada!\", dijo en su bombardeo de Twitter. \n\"Si hubiera desafiado a ese hombre, los medios me habrían acusado de interferir con su derecho a hablar libremente ¡Una situación sin salida!\". \nLa creencia de que Obama es musulmán no es poco habitual, especialmente entre los republicanos. Según una reciente encuesta de la CNN/ORC, el 29% de los estadounidenses lo cree así, así como el 43% de los republicanos. \nEncuentra este artículo con: trump, musulmán, obama, presidente, aspirante, polémica Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n ", "external_links": [], "published": "2015-09-21T10:15:00.000+03:00", "crawled": "2015-09-21T10:14:51.567+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}