{"organizations": [], "uuid": "f2ed54e3f40980f5b47835e385e751890affe9dc", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/091715_otr_rove.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/us/2015/09/29/new-anti-abortion-video-released-titled-carly-fiorina-was-right/", "country": "US", "title": "New anti-abortion video declares 'Carly Fiorina was right'", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "New anti-abortion video declares 'Carly Fiorina was right' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "f2ed54e3f40980f5b47835e385e751890affe9dc"}, "author": "Cody Derespina", "url": "http://www.foxnews.com/us/2015/09/29/new-anti-abortion-video-released-titled-carly-fiorina-was-right/", "ord_in_thread": 0, "title": "New anti-abortion video declares 'Carly Fiorina was right'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Cody Derespina \n  FoxNews.com   livefyre Email Print \nA baby kicks and squirms moments after it slides from the birth canal in an extremely graphic video released by a pro-life group Tuesday that reportedly shows the abortion of an intact fetus. It’s titled “Carly Fiorina was right.”\nThe Center for Bio-Ethical Reform posted the 13-minute video to YouTube, a full version of a clip which Fiorina spoke about during the second Republican presidential debate. The former Hewlett-Packard CEO has been pressed in subsequent interviews about her description of the anti-abortion video, with some members of the media questioning the veracity of the clip and others questioning whether the clip even existed.\n“The video speaks for itself and that’s what’s so powerful about it,” CBR executive director Gregg Cunningham told FoxNews.com. “I don’t have to defend it. No one has to take our characterization for granted. Even a lay person can take a look at it and tell what’s going on.”\nAs the video begins, the top of the fetus’ head is exposed. The abortionist then uses two liquids to dilate the cervix, at which point the fetus begins sliding out of the birth canal, nearly falling out until it’s caught by a gloved hand. The abortionist then cuts the umbilical cord as the baby’s head, unable to support its own weight, flops around in the abortionist’s palm. The camera then pans to show the fetus in a metal bowl as forceps are used to poke, prod and position the baby for the camera. CBR said the fetus was 17 &frac12; weeks at the time of the abortion.\n“We have incontestably laid to rest the question of whether this is an authentic abortion because we show the abortion,” Cunningham said.\n“Watch a fully-formed fetus on the table, its heart beating, its legs kicking, while someone says ‘We have to keep it alive to harvest its brain.’ This is about the character of our nation\"\n- Carly Fiorina\nCunningham would not confirm whether the abortion occurred at a Planned Parenthood facility or who filmed the procedure. However, he did say “the overwhelming majority of the content that we have, our photographers videotaped on site.”\n\nRelated Image Expand / Contract Gregg Cunningham is the executive director of the Center for Bio-Ethical Reform, an anti-abortion group that released video Tuesday purporting to show an intact fetus being aborted.  (Center for Bio-Ethical Reform) \n\nThe anti-abortion movement received a boost in July, when the Center for Medical Progress released the first in a series of undercover videos documenting what they claimed to be the sale of fetal body parts to researchers by Planned Parenthood executives. Planned Parenthood has denied breaking any laws and said payments discussed in the videos relate to reimbursement costs for procuring the tissue – which is legal. But the videos have thrust the abortion issue back in the spotlight, leading to a fight by some Republicans in Congress to defund Planned Parenthood. Group President Cecile Richards also defended her organization in a Capitol Hill hearing on Tuesday. \nThe controversy has also become a focal point in the Republican race for the White House, with Fiorina executing one of her stronger debate moments while railing against Planned Parenthood, citing the work of CMP.\n“Anyone who has watched this videotape, I dare Hillary Clinton, Barack Obama to watch these tapes,” Fiorina said. “Watch a fully-formed fetus on the table, its heart beating, its legs kicking, while someone says ‘We have to keep it alive to harvest its brain.’ This is about the character of our nation. And if we will not stand up and force President Obama to veto this bill, shame on us.\"\n\nRelated Image Expand / Contract Sept. 29, 2015: Planned Parenthood Federation of America President Cecile Richards testifies on Capitol Hill in Washington D.C.  (AP) \n\nThe scene Fiorina talks about is from CMP’s “Human Capital” documentary web series. It does not feature the widely circulated undercover footage, but rather a first-person interview with a former procurement technician, Holly O’Donnell, who worked for a tissue harvesting company that worked with Planned Parenthood. At one point, a short clip of a baby in a metal pan is shown while O’Donnell continues talking. That clip came from CBR’s library, and, following Fiorina’s debate statement, Cunningham began a search to track down the full video of the procedure.\n“We had an obligation to get all the information out there so people could judge for themselves whether her characterization was defensible,” he said. “We were confident that a reasonable person looking at the evidence would say it was.”\nThe Fiorina campaign declined to comment on the release of the full video, referring instead to Fiorina's original remarks.", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T22:08:02.240+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}