{"organizations": [], "uuid": "165fd74b097c5ea87f59980244ef020aefa8fdb1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2962368/images/o-FERGUSON-POLICE-LINE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/hpsn/index.xml", "section_title": "HPSN - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/18/the-morning-email_n_7304552.html?utm_hp_ref=hpsn&ir=HPSN", "country": "US", "title": "Monday's Morning Email: Obama Moves To Demilitarize Police", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Monday's Morning Email: Obama Moves To Demilitarize Police", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-18T14:12:00.000+03:00", "replies_count": 0, "uuid": "165fd74b097c5ea87f59980244ef020aefa8fdb1"}, "author": "Lauren Weber", "url": "http://www.huffingtonpost.com/2015/05/18/the-morning-email_n_7304552.html?utm_hp_ref=hpsn&ir=HPSN", "ord_in_thread": 0, "title": "Monday's Morning Email: Obama Moves To Demilitarize Police", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Monday's Morning Email: Obama Moves To Demilitarize Police Posted: \nTOP STORIES \nTo get The Morning Email, HuffPost's daily roundup of the news, in your inbox, sign up here. \nOBAMA TO STEM SUPPLY OF MILITARY GEAR TO U.S. POLICE FORCES \"President Obama on Monday will ban the federal provision of some types of military-style equipment to local police departments and sharply restrict the availability of others, administration officials said, as he intensifies his push to ease tensions between law enforcement and minority communities in reaction to the crises in Baltimore; Ferguson, Mo.; and other cities.\" [ NYT ] NINE DEAD IN BIKER GANG SHOOTOUT IN TEXAS Over 100 bikers from rival gangs are thought to have been involved in the melee, which took place in the parking lot of a restaurant in Waco, Texas. Law enforcement has warned the area to be on the lookout for more biker violence . And take a look at how the Bandidos \"became one of the world's most feared biker gangs. \" [ Andy Campbell, HuffPost ] \nISIS TAKES RAMADI IN CRUSHING LOSS FOR IRAQI FORCES \"Iraq's Shiite militias have vowed to dislodge Islamic State extremists from Ramadi, a day after the militant group seized the Anbar provincial capital in major loss to the Iraqi troops.\" While fighting raged in Iraq, U.S. special forces killed a top ISIS commander in Syria in a raid, seizing a \"digital trove\" in the process. [ AP ] \nKERRY: U.S. CONSIDERING FURTHER NORTH KOREA SANCTIONS The Secretary of State said the country had \"not even come close\" to curtailing its nuclear program. [ Reuters ] \nAMTRAK BETWEEN PHILADELPHIA AND NEW YORK RESUMES Train service resumed between Philadelphia and New York for the first time since the deadly crash last Tuesday that killed eight. And the lead investigator into the tragedy doesn't believe the train was shot at, but is exploring the possibility it was struck with some sort of object moments before its derailment. [ AP ] \nFEDS: HACKER TOOK CONTROL OF PLANE \"A security researcher kicked off a United Airlines flight last month after tweeting about security vulnerabilities in its system had previously taken control of an airplane and caused it to briefly fly sideways, according to an application for a search warrant filed by an FBI agent.\" [ Wired ] \nSAY GOODBYE TO TRANS FAT The FDA is expected to ban trans fat as soon as next week. [ Politico ] \nONE MARINE DEAD, 21 INJURED IN HAWAII MILITARY AIRCRAFT CRASH During a military exercise in Waimanalo, Hawaii, a MV-22 Osprey experienced a \"hard-landing mishap'\" that resulted in the deadly crash. [ Andy Campbell and Caria Herreria, HuffPost ] \nTRAIL TO THE CHIEF: 2016 GAFFE EDITION From Jeb on Iraq to Hillary's \"dead broke,\" all the candidate slip-ups so far in the cycle. [ Howard Fineman, Jason Linkins and Lauren Weber, HuffPost ] \nWHAT’S BREWING HITS AND MISSES AT THE BILLBOARD MUSIC AWARDS The \"Empire\" cast reunited for a song , J. Lo continued to age backward on the red carpet , and Taylor Swift and Calvin Harris made it official-official . Oh, and here's who won . [ HuffPost ] \nTAYLOR SWIFT DEBUTS 'BAD BLOOD' VIDEO She continues the Katy Perry feud in a video packed with over two dozen of her celebrity friends. And Lena Dunham smokes a cigar. [ HuffPost ] \nTHE SHAM PAKISTANI COMPANY REAPING MILLIONS From sham university degrees. [ NYT ] \nNFL TO CHANGE BALL HANDLING RULES You are allowed to laugh at that headline. [ AP ] \nMAD MEN FINALE AIRS Goodbye, Don Draper. And here's why the better the show, the harder it is to live up to finale expectations . [ AP ] \nCHA-CHING: 'PITCH PERFECT 2' RAKES IN THE MONEY The a capella sequel blew past \"Mad Max: Fury Road\" to a $70.3 million debut. The first \"Pitch Perfect\" only grossed $65 million in theaters. [ HuffPost ] \nTIM COOK'S COMMENCEMENT ADDRESS \"We believe that a company that has values and acts on them can really change the world. And an individual can too. That can be you. That must be you. Graduates, your values matter. They are your North Star. Otherwise it’s just a job -- and life is too short for that. ... You don’t have to choose between doing good and doing well. It’s a false choice, today more than ever.\" [ HuffPost ] \nTHE FOODS THAT MAKE YOU HAPPIER Dark chocolate made the list, so we're eating that for dinner. [ HuffPost ] \nWHAT'S WORKING \nSCIENTISTS FIND NEW TRIGGER WARNING FOR VOLCANO ERUPTIONS \"An international team of researchers has discovered a previously unknown trigger of volcanic eruptions -- a finding that could give scientists a leg up on predicting blow-ups and saving lives.\" [ HuffPost ] \nON THE BLOG \nDON'T TAKE PHOTOS ON A PLANE Unless you want to get kicked off a flight. [ HuffPost ] \nBEFORE YOU GO", "external_links": [], "published": "2015-05-18T14:12:00.000+03:00", "crawled": "2015-05-18T22:27:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}