{"organizations": [], "uuid": "b1263a0fd922c153e12458788334174fbb0513c7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/warrenelizabethobamabarack_042215getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/pundits-blog/finance/241829-why-obama-is-absolutely-wrong-on-tpp-and-warren-is-right", "country": "", "title": "Why Obama is 'absolutely wrong' on TPP and Warren is right | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Why Obama is 'absolutely wrong' on TPP and Warren is right | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "b1263a0fd922c153e12458788334174fbb0513c7"}, "author": "", "url": "http://thehill.com/blogs/pundits-blog/finance/241829-why-obama-is-absolutely-wrong-on-tpp-and-warren-is-right", "ord_in_thread": 0, "title": "Why Obama is 'absolutely wrong' on TPP and Warren is right | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 13, 2015 - 07:00 AM EDT Why Obama is 'absolutely wrong' on TPP and Warren is right \nGetty Images Tweet Share More \nPresident Obama recently commented on the hypothetical concerns of Sen. Elizabeth Warren's (D-Mass.) opposition to the Trans-Pacific Partnership (TPP) trade deal and stated she was \"absolutely wrong\": \"Think about the logic of that. The notion that I had this massive fight with Wall Street to make sure that we don't repeat what happened in 2007 and 2008,\" Obama said. \"And then I sign a provision that would unravel it? I'd have to be pretty stupid. And it doesn't make any sense.\" \nFirst, the president already chose to \"unravel\" Dodd-Frank with his 2014 omnibus bill . Warren labeled Obama's spending bill a \" giveaway \" that \" Citigroup lobbyists literally wrote .\" ADVERTISEMENT According to the Massachusetts senator , the president's spending bill \"would let derivatives traders on Wall Street gamble with taxpayer money and get bailed out by the government when their risky bets threaten to blow up our financial system.\" So, in terms of the logic used to criticize Warren, Obama has already acted contrary to his own stated goals of preventing Wall Street from creating another derivatives-fueled implosion of the U.S. economy. Like his acquiescence to Citigroup and other banks, Obama continues to unravel banking regulations with the TPP deal.\nObama is once again going against his stated policy objectives by advocating a trade deal that \" would hurt American workers \" according to Sen. Bernie Sanders (I-Vt.). Like Sanders, former Gov. Martin O'Malley (D-Md.) also called it a \" bad trade deal ,\" while former Sen. Jim Webb (D-Va.) has serious concerns about negotiations surrounding TPP and is against the fast-track option. In addition to Warren, Sanders, O'Malley and Webb, the AFL-CIO is \" going all out to oppose it \" and The Nation has referred to TPP as \"NAFTA on steroids.\" \nIn contrast, Hillary Clinton once called TPP \"the gold standard in trade agreements.\" \nAs for Warren's various \"hypothetical\" concerns derided by Obama, it seems that our commander in chief has conveniently forgotten the utility in debating a controversial trade deal negotiated in what Tim Robertson, director of the California Fair Trade Coalition, calls \" near total secrecy .\" A recent press release by Warren explains why she and other senators wrote a letter to U.S. Trade Representative (USTR) Michael Froman highlighting serious concerns regarding TPP: The senators specifically highlighted concerns about provisions related to the investor-state dispute settlement process, market access rules, and capital controls. The senators wrote, \"Including such provisions in the TPP could expose American taxpayers to billions of dollars in losses and dissuade the government from establishing or enforcing financial rules that impact foreign banks. The consequence would be to strip our regulators of the tools they need to prevent the next crisis.\" \nSince the Government Accountability Office found that 2008's financial collapse cost the U.S. economy $22 trillion , worrying about \"hypothetical\" concerns in this case seems not only rational, but also a moral imperative. In addition, according to the Levy Economics Institute, the financial collapse resulted in \"a Federal Reserve bailout commitment in excess of $29 trillion.\" If TPP weakens already lax banking regulations, we could be in for another economic meltdown in the future. \nTherefore, Mr. President, \"hypothetical\" concerns in this case should be taken seriously by everyone. \nAs for the secrecy of these trade talks, a Politico article explains why the words \"fast track\" and \"secrecy\" must never be part of the same sentence: \"The access to information is totally at the whim of Ambassador Froman,\" said Rep. Lloyd Doggett (D-Texas), who's a hard no on fast track but says he'd like to see other ways of promoting international trade. \"He likes to make available information that he thinks helps his case, and if it conflicts, then he doesn't make the information available,\" Doggett said. \"We know when we're being suckered,\" said Rep. Alan Grayson (D-Fla.), who said he believes that the USTR quotes percentages instead of absolute values on trade statistics that give an overly positive impression. \"It's not only condescending, it's misleading.\" \"He's indignant when we say it's secret,\" said Rep. Keith Ellison (D-Minn.). \"Maybe there's some definition of secrecy he knows that I don't know.\" \nTrue, Congress can see the text, but only the parts that the Obama administration is willing to disclose, and certainly not the sections that \"conflict\" with a fast track of TPP. \nFurthermore, when Doctors Without Borders says TPP is a \"Bad Deal for Medicine\" and the Communication Workers of America publishes \"10 Ways The TPP Would Hurt U.S. Working Families,\" it's safe to say that Warren is right to voice concerns about the controversial trade agreement. In terms of its environmental impact, Greenpeace states that it's a \"multinational corporate tool for undermining environmental law\" and the Sierra Club says it's a \"Threat to Forests, Wildlife and Fish.\" So, not only could TPP hurt working families and bypass banking regulations, but it might potentially circumvent environment regulations. \nWhen so many organizations, senators, and protesters in over 20 towns in New Zealand are against TPP, perhaps Obama should slow down and address everyone's concerns. Free trade is often good for an economy, but reckless free-trade agreements that cater to corporate interest at the expense of American taxpayers and workers could easily lead to another, even larger financial catastrophe. Americans deserve better after only seven years removed from an economic collapse that former Federal Reserve Chairman Ben Bernanke described as \"the worst financial crisis in global history\" and one that resulted in 2.6 million jobs lost . \nFinally, Sen. Warren has also publicized the \"Investor-State Dispute Settlement\" (ISDS) aspect of TPP. She believes it's one of the many flawed aspects of the deal and states that \"ISDS would allow foreign companies to challenge U.S. laws — and potentially to pick up huge payouts from taxpayers — without ever stepping foot in a U.S. court.\" Since U.S. taxpayers already bailed out American banks in 2008, it would be a shame for citizens to bear the same responsibility for foreign banks, simply because President Obama wanted to fast-track a trade deal without much-needed debate. \nGoodman is an author and a journalist. SHARE ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T02:07:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}