{"organizations": [], "uuid": "d4399154cd7b8cd075f3816699b147be2f6b6380", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obama_051915getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/242501-obama-signs-bill-creating-national-police-protection-alert", "country": "", "title": "Obama signs bill creating Blue Alert system | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama signs bill creating Blue Alert system | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "d4399154cd7b8cd075f3816699b147be2f6b6380"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/242501-obama-signs-bill-creating-national-police-protection-alert", "ord_in_thread": 0, "title": "Obama signs bill creating Blue Alert system | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 19, 2015, 12:08 pm Obama signs bill creating Blue Alert system By Jordan Fabian Getty Images \nPresident Obama on Tuesday signed a bill that would create a national alert system to help authorities find people who kill, injure or make imminent threats against police. \nThe bipartisan measure is named after Wenjian Liu and Rafael Ramos, two New York Police Department officers who were shot and killed in their squad car in December. \n\"It's important for us not only to honor their memory, it's also important for us to make sure that we do everything we can to help ensure the safety of our police officers when they're in the line of duty,” Obama said while flanked by family members of Liu and Ramos at an Oval Office signing ceremony. \nThe president said the new law would alert police to active and credible threats and ensure that “appropriate checks can be taken as quickly as possible.\" \nVice President Biden and several sponsors of the bill, Sen. Ben Cardin (D-Md.) and Reps. Bill Pascrell (D-N.J.) and Dave Reichert (R-Wash.), also attended the signing. \nObama signed the bill as he grapples with how to address tensions between law enforcement and minority communities. A series of officer-involved deaths of young black men in Baltimore, Ferguson, Mo., and North Charleston, S.C., among other cities, has cast a light on the issue. \nOn Friday, Obama extended an olive branch to police when he spoke at the National Peace Officers’ Memorial Service to honor law enforcement officers who were killed in the line of duty. \nOn Monday, the White House announced new limits on federal programs that supply local police with military-style equipment. ", "external_links": [], "published": "2015-05-19T03:00:00.000+03:00", "crawled": "2015-05-19T22:22:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}