{"organizations": [], "uuid": "297b7594a113b1e06d19dc030a80f96f656cae01", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/36/feed#", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/blogs/floor-action/senate/242583-reid-obama-loves-the-export-import-bank", "country": "US", "title": "Reid: Obama 'loves' the Export-Import bank", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Reid: Obama 'loves' the Export-Import bank", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-20T01:04:00.000+03:00", "replies_count": 0, "uuid": "297b7594a113b1e06d19dc030a80f96f656cae01"}, "author": "dweaver@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/senate/242583-reid-obama-loves-the-export-import-bank", "ord_in_thread": 0, "title": "Reid: Obama 'loves' the Export-Import bank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 19, 2015, 06:04 pm Reid: Obama 'loves' the Export-Import bank By Jordain Carney \nSenate Minority Leader Harry Reid on Tuesday urged the Senate to pass a long-term reauthorization of the Export-Import Bank, arguing it would be an acceptable addition to trade legislation because President Obama \"loves the bank.\" Reid suggested Republicans are only shying away from the bank, which helps provide financing for American exports, because of pressure from conservative groups that are fighting to kill it. ADVERTISEMENT \"We've been trying to get this done, but now the Republicans have said no thanks because their guiding light, the Koch Brothers, don't like it because it's a government program,\" the Nevada Democrat said. Reid's comments come after Senate Majority Leader Mitch McConnell (R-Ky.) told reporters that he would allow a vote on extending the charter of the Export-Import bank, but that it wouldn't be part of the \"fast-track\" trade legislation currently being debated by the Senate. \"I think they're entitled to a vote, and we'll be working with supports of the Ex-Im Bank to make sure they have an opportunity to see where the votes are in the Senate,\" he said. McConnell has said he is personally opposed to renewing Ex-Im's charter.Reid slammed McConnell's offer, calling it \"meaningless\" because the legislation would likely have to start in the House. \"The majority leader doesn't have a path forward,\" he said. \"The best, he said, we'll give you a vote on it. Giving a vote on it is meaningless.\"Reid pushed for an amendment from Sen. Maria Cantwell (D-Wash.) that would include an extension of the bank in the fast-track legislation, which would allow President Obama to get his trade deals approved by a majority vote in Congress. \"Let's pass a long-term extension of the Export-Import bank. On this bill, the trade bill, if it became part of the trade bill, it would be signed into law,\" he said.", "external_links": [], "published": "2015-05-20T01:04:00.000+03:00", "crawled": "2015-05-20T03:00:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}