{"organizations": [], "uuid": "62be347c14683f1e79e7642b248e545f72d96b17", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/04/hillary-is-moving-left-but-isnt-divorcing-bill-politically-speaking/", "country": "US", "title": "Obama launches foundation to help minority young men", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama launches foundation to help minority young men", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-04T23:14:00.000+03:00", "replies_count": 0, "uuid": "701ba61d938f3a6f51eb997d7d0b4a29edb76b11"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/04/obama-launches-foundation-to-help-minority-young-men/", "ord_in_thread": 0, "title": "Obama launches foundation to help minority young men", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama launches foundation to help minority young men Published May 04, 2015 Facebook 0 Twitter 0 Email Print \nActing in the aftermath of Baltimore's unrest, President Barack Obama helped launch a foundation Monday to take up his campaign to help minority young men by improving education, training and job placement in poor communities across the country. \nSpeaking at Lehman College in the Bronx with young men who credited their mentors for overcoming obstacles, Obama praised their success in the face of barriers. \n\"The future will be in good hands as long as we are giving them the love and the support that they need,\" Obama said. \nThe new organization, My Brother's Keeper Alliance, is an outgrowth of Obama's year-old My Brother's Keeper initiative, which has focused on federal government policies and grants designed to increase access to education and jobs. \nWhile the effort predates the tensions in Baltimore that erupted after the death of Freddie Gray while in police custody, the significance of the new private-sector alliance has been magnified by the spotlight riots in the city placed on low-income neighborhoods. \nOver the past year, Obama has been called on to respond to what he last week referred to as the \"slow-rolling crisis\" of police relations with minority communities. The friction has been highlighted by Gray's death last month and Michael Brown's death last summer in Ferguson, Missouri. Gray died after sustaining a spinal cord injury while in the custody of Baltimore police. Six police officers were charged last week in connection with his death. \nWith its high-profile names and ambitious focus, the alliance is a possible building block for Obama's post-presidential pursuits. With less than two years left in Obama's presidency, the new institution would likely sustain its work well after he leaves the White House. But White House spokesman Josh Earnest said the new alliance wouldn't necessarily be the vehicle for what Obama chooses to do. \nEarnest said decisions about who could give to the group and the reporting of donations would be made by the board of directors. He was responding to a question about whether the group's financing might spark some of the same controversies surrounding Bill and Hillary Clinton's family foundation. \n\"The White House will not be involved in determining what their fundraising policies should be,\" Earnest said. He said that the board would be \"well aware of the priorities the president has placed on transparency.\" \nEarnest said the group would follow a familiar model of businesses supporting some of the president's other priorities, noting as an example Michelle Obama's \"Let's Move\" initiative to fight childhood obesity. \nThe new alliance will be led by Joe Echevarria, the former chief executive of Deloitte, the giant accounting and consulting firm. The alliance already has obtained financial and in-kind commitments of more than $80 million from such companies as American Express, Deloittte, Discovery Networks, Fox News parent company News Corp., BET, Sprint and PepsiCo, the White House said. \nThe alliance board is a who's who of the sport, corporate and entertainment world. Singer songwriter John Legend is the alliance's honorary chairman; former Miami Heat star Alonzo Mourning, BET CEO Debra Lee and Sam's Club CEO Rosalind Brewer are among the members of the board. The alliance's advisory council will include former Secretary of State Colin Powell, former Attorney General Eric Holder and Sen. Cory Booker, a New Jersey Democrat, the mayors of Indianapolis, Sacramento and Philadelphia, as well as former NFL player Jerome Bettis and former basketball standout Shaquille O'Neal. \nThe group aims to mobilize the private sector to help young minority men, distribute grants and work with local communities to assist young people in communities that lack educational and employment advantages. \nBroderick Johnson, who chairs Obama's My Brother's Keeper task force at the White House, described the creation of the new alliance as \"deeply personal.\" \n\"As a proud son of Baltimore, this week's announcement comes at a time of unique and special resonance for me,\" Johnson said in an email to supporters. \"As the country reflects on our shared responsibility to ensure that opportunity reaches every young person, I urge everyone to look at their own capacity to make a difference.\" \nWhile in New York, Obama was also taping an appearance on The Late show with David Letterman and attending two Democratic Party fundraisers. Advertisement", "external_links": [], "published": "2015-05-04T23:14:00.000+03:00", "crawled": "2015-05-05T01:16:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}