{"organizations": [], "uuid": "d0fd26a48da0f20c75dc8b2fed6951f48f458d71", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/georgianne-nienaber/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/georgianne-nienaber/an-obama-policy-of-dising_b_7460362.html", "country": "US", "title": "An Obama Policy of Disingenuousness in Rwanda | Georgianne Nienaber", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "An Obama Policy of Disingenuousness in Rwanda | Georgianne Nienaber", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-28T23:26:00.000+03:00", "replies_count": 0, "uuid": "d0fd26a48da0f20c75dc8b2fed6951f48f458d71"}, "author": "Georgianne Nienaber", "url": "http://www.huffingtonpost.com/georgianne-nienaber/an-obama-policy-of-dising_b_7460362.html", "ord_in_thread": 0, "title": "An Obama Policy of Disingenuousness in Rwanda | Georgianne Nienaber", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is a lawyer and 2000 graduate of Princeton, whose undergraduate thesis, \"Building Peace and Establishing the Rule of Law: The International Criminal Tribunal for Rwanda,\" qualified to give brutal testimony against the government of Rwanda in a Congressional hearing this week? Does eleven months spent in Rwanda from July 2000 to June 2001 with the International Rescue Committee as a type of community organizer give this individual the moral authority to pass judgment on a country still recovering from the slaughter of up to one million of its people in 1994?\nSteven Feldstein's State Department bio is classic boilerplate. The only thing that is clear is his title and job description--Deputy Assistant Secretary of State in the Bureau of Democracy, Human Rights and Labor (DRL). According to DOS, he is \"responsible for DRL's work in Africa, international labor affairs, and international religious freedom.\nHis accomplishments are listed on his resume , but read with a critical eye. Feldstein taught photography to street children, wrote reports, and managed projects for USAID while in Rwanda.\nLook deeper in to his background and find an article in the Princeton News that says Feldstein \"spent a year in Rwanda assessing orphanages and documenting the lives of street children as part of his work for a humanitarian relief organization.\" Does this qualify Feldstein to give expert testimony that damns Rwanda?\nThere is more. An organization called DC 40 under 40 names Feldstein as one of its wunderkinds. 40 Under 40 says, \"Feldstein played an active role in Rwanda's post-conflict reconstruction through the International Rescue Committee.\"\nHow can less than a year of organizing street children and writing reams of reports qualify as \"an active role in Rwanda's post conflict resolution?\"\nSomeone has to ask questions about the inexperience that is running rampant in the State Department, shaping a disastrous foreign policy there, and reducing Africa to serfdom. Political and economic realities are extremely complicated in this part of the world. My feeling is that Obama's DOS, for no discernible reason, is persecuting the only stable government in Central Africa and coddling a brutal dictator in Congo. Obama is doing so by sending the equivalent of school children to do the work of policy experts. Ask yourself how Feldstein can be an \"expert\" on both Sudan and Rwanda, and responsible for international religious freedom on top of it all??\nYou can read Feldstein's passive-aggressive testimony about Rwanda here but do so with a critical eye towards his age, experience and background.\nThese faces tell a story\nLike a jilted lover, Feldstein begins with a statement about his love for the country and then proceeds to slam the Government of Rwanda with innuendo, rumor, and completely unproven accusations of human rights abuses and heinous crimes. I won't delineate his comments here. To do so would elevate them.\nIn my opinion, Feldstein must have been promoting a hidden agenda for DOS. There is no other explanation, and his comments are in lockstep with what I consider the Obama administration's systematic persecution of Rwanda over the last seven years.\nRwanda is the safest country in central Africa, perhaps on the continent. I was there for two weeks in March and have visited many times over the last eleven years. Progress and reconstruction have been steady and visible. I can think of no other country in Africa I have visited, including South Africa, where I can roam the streets at midnight with my camera and feel as safe as I do on the beaches of Sanibel Island, Florida.\nExploring the streets of Kigali alone with camera, March 2015\nContrary to Feldstein's claims of persecution of the press and free speech, I have been able to return many times with absolutely no harassment, even when I had written criticism of the government there. This was especially true after articles written in 2007-2008-- articles I now consider period pieces. Some of them deserve a rewrite, given the current turmoil in Congo. As a writer, I have experienced the same feeling politicians have when they say, \"given what I know now, I would vote or act differently.\" I would certainly write differently.\nWhich brings up Congo.\nWhy the Obama administration is giving a free pass to Joseph Kabila's reign of terror in Congo is beyond me. I have seen it firsthand; I have experienced psychological torture at the hands of Kabila's secret police, witnessed the despair of Congolese refugees in neighboring countries, and the empathized with the agony of displaced persons in the IDP camps near Goma. I have met with rebel leaders and understand their frustration with Congo's lack of political will to eliminate the FDLR harbingers of genocide against the Tutsi.\nBut back to Rwanda.\nReality is in complete contrast to Feldstein's list of Rwandan horrors.\nConsider that Rwanda is only 21 years removed from the genocide of 1994. Research demonstrates it can take over six decades to recover from armed conflict.\nResort complex on Lake Kivu\nRwanda is a remarkable mecca of tourism, 98 percent of the population is fully medically insured, and according to former British Prime Minister Tony Blair's Africa Governance Initiative, the last five years in Rwanda have resulted in one million people lifted out of poverty. The region's largest solar array will provide power to over 15,000 Rwandan households and add almost 6 per cent to the country's total energy supply. Streetlights line the main road from Kigali to Musenze and villagers can walk the roads unmolested at any hour.\nI am not alone in wondering about the agenda of the State Department and its elevation of Steven Feldstein as policy expert.\nSudan expert, Huffington Post blogger and Smith College professor Eric Reeves writes in \"Democratization and Sudan: An Obama policy of disingenuousness,\" that \"Feldstein's testimony on Sudan warrants serious scrutiny.\"\n\"[Feldstein] reiterated U.S. support for an inclusive and comprehensive National Dialogue to resolve Sudan's conflicts\" (State Department media note, 28 February 2015). This preposterous optimism about the nature and prospects of true national political dialogue in Sudan under the current regime is of a piece with Obama administration policies and statements over the past six years, and signals in advance of the elections that the \"victory\" that will be represented by President Omar al-Bashir's \"re-election\" will be accepted, thereby providing the \"legitimacy\" that members of the regime see as the real goal of this electoral charade--boycotted by a growing number of important political constituencies and simply unable to be conducted in many parts of the country wracked by violence.\nWho knows what is really going on in the labyrinthine maze connecting the DOS and the CIA in Africa?\nWhat I do know is what I have witnessed in Rwanda.\nWanting to conduct a reality check on myself, I called Professor Reeves. Let's just say we had a good and productive conversation.\nI think I will appropriate and modify Reeves' descriptor and title this opinion piece \"An Obama Policy of Disingenuousness in Rwanda.\"\nAll photos by Nienaber March 2015\nFollow Georgianne Nienaber on Twitter: www.twitter.com/nienaber\nMore: Sudan Rwanda Congo US State Department Foreign Policy Foreign Policy Africa This Blogger's Books and Other Items from... Horse Sense\nby Georgianne Nienaber Gorilla Dreams: The Legacy of Dian Fossey\nby Georgianne Nienaber", "external_links": [], "published": "2015-05-28T23:26:00.000+03:00", "crawled": "2015-05-29T03:03:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}