{"organizations": [], "uuid": "f78e1fb5fc661597c4fe819a9bbcf448603a88f9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/sheldon-filger/islamic-state--aka-isis-i_b_7437920.html", "country": "US", "title": "Islamic State -- aka ISIS, ISIL -- Is Winning Its War as President Obama Stumbles | Sheldon Filger", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Islamic State -- aka ISIS, ISIL -- Is Winning Its War as President Obama Stumbles | Sheldon Filger", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-26T00:40:00.000+03:00", "replies_count": 0, "uuid": "f78e1fb5fc661597c4fe819a9bbcf448603a88f9"}, "author": "Sheldon Filger", "url": "http://www.huffingtonpost.com/sheldon-filger/islamic-state--aka-isis-i_b_7437920.html", "ord_in_thread": 0, "title": "Islamic State -- aka ISIS, ISIL -- Is Winning Its War as President Obama Stumbles | Sheldon Filger", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Amid the flurry of Obama administration official statements promulgated by its various presidential and departmental spokespersons, reality is setting in. Despite the happy talk from Washington about ISIL (the Obama administration's preferred acronym for describing the Islamic State), military facts on the ground cannot be eradicated by press briefings and political spin. The recent and significant victories by the armies of the Islamic State in Palmyra, Syria and Ramadi, Iraq are a clear testament to the undiminished military efficacy and capability of the nascent caliphate.\nLast October I penned a piece in the Huffington Post blog, \"President Obama Wages War on the Islamic State: Anatomy of a Disaster in the Making\", in which I predicted failure for President Obama in his role of Commander-in-Chief in the evolving military confrontation with the Islamic State and its appointed Caliph, Abu Bakr al-Baghdadi. I specifically highlighted four areas I saw as flaws in the President's approach towards the struggle with the caliphate: 1. Propensity to underestimate the enemy and his capabilities; 2.Overreliance on insufficient means, primarily airpower; 3.Lack of a grand strategic vision, essential for prevailing in the conflict; 4. Intellectually myopic in recognizing the full dimensions of the threat posed to America by the Islamic State.\nRegrettably, all the deficiencies I outlined seven months ago remain intact, as evidenced by the recent strategic victories gained by the Islamic State's military forces in Syria and Iraq. It should be pointed out that the distance between Palmyra in Syria and Ramadi in Iraq is more than 600 kilometers, or nearly 400 miles. The fact that the Islamic State could simultaneously deploy major forces and prevail in those two widely separated battle arenas is concrete evidence to knowledgeable military experts of a highly competent military staff, and a mastery of the operational art of war. The choice of where the Islamic State advances or withdraws also pinpoints the highly strategic nature of the Islamic State's military operations, which appear geared towards dominance of road networks, essential for controlling the large areas of Syria and Iraq currently claimed by the caliphate.\nWhen America first began its confrontation with militant Islam in the form of al Qaeda post 9/11, the jihadists were characterized and described as non-state actors. This description is no longer tenable in comprehending the challenge of the Islamic State. This entity may not follow the pattern of a traditional nation-state that participates in the international arena. However, in terms of its structure and the threat it poses, the Islamic State is in fact what it declares itself to be -- a state, and one with an army with a skilled general staff, effective logistics and disciplined and highly motivated foot soldiers, able to employ combined arms, including armor and artillery support. Far from the \"jayvee team\" Barack Obama suggested as a metaphor for the Islamic State in January 2014, this entity has morphed into a most serious and capable military threat, transcending the conventional description of such Islamist phenomena as terrorist non-state actors.\nWhile confusion and disarray reign within the circles of power in Washington, clarity seems to be the defining characteristic of the Islamic State. Despite attempts by U.S. policymakers with no comprehension of the history of Islam to downplay and distort its Islamic credentials, Abu Bakr al-Baghdadi and the Islamic State's leadership circles are firmly welded to their historical narrative, which they fully comprehend. Their model is the Prophet Mohammed, who first brought his religious revelation to the Arabian peninsula through the sword. In the century after the Prophet's death, his companions conquered the largest empire in history up to that time through an unparalleled application of religious fanaticism, combined with innovative military tactics. They were harsh and uncompromising towards the unbelievers, and it is that identical religious zeal that underpins the fierceness and tenacity of the soldiers of the Islamic State.\nAs the Obama administration gropes for answers to the challenge of the Islamic State, it appears that their new stratagem is to place their hopes in Shiite-dominated Iran, a theocracy that hates America as much as the Islamic State, and which itself is despised by the Sunni Muslim community al-Baghdadi and his caliphate represent. On top of the already monumental mistakes and strategic miscalculations President Obama has been the architect of in addressing the Islamic State, it seems that an even more dangerous error is in the process of being engineered -- supporting the anti-American ayatollahs in Tehran as the protector of the Middle East from the Islamic State. I can think of no other policy decision by the Obama administration that would serve the highest hopes and aspirations of the Islamic State so well.\nIn the ongoing battle between the 21st and 7th centuries, it must be unfortunately concluded that the seventh century is in ascendance.\nFollow Sheldon Filger on Twitter: www.twitter.com/EconomicCrisis\nMore: Islamic State Islamic State ISIS Barack Obama Barack Obama Islam Iran Syria Iraq Abu Bakr Al Baghdadi This Blogger's Books and Other Items from... King of Bombs:A Novel About Nuclear Terrorism\nby Sheldon Filger Hillary Clinton Nude: Naked Ambition, Hillary Clinton And America's Demise\nby Sheldon Filger", "external_links": [], "published": "2015-05-26T00:40:00.000+03:00", "crawled": "2015-05-26T02:04:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}