{"organizations": [], "uuid": "65acf5e8988b589b8e7fb09647ab572c7db14707", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_immigrationgetty_1.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/240625-obama-program-would-give-e-books-to-poor", "country": "US", "title": "Obama program would give e-books to poor", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama program would give e-books to poor", "spam_score": 0.0, "site_type": "blogs", "published": "2015-04-30T17:38:00.000+03:00", "replies_count": 0, "uuid": "65acf5e8988b589b8e7fb09647ab572c7db14707"}, "author": "mhensch@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/news/240625-obama-program-would-give-e-books-to-poor", "ord_in_thread": 0, "title": "Obama program would give e-books to poor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "April 30, 2015, 10:38 am Obama program would give e-books to poor By Mark Hensch \nPresident Obama on Thursday will announce a strategy for providing 10,000 free e-books to children lacking financial resources. \nObama will announce the initiative from the Anacostia Library in Southeast Washington, D.C., according to Reuters . It will feature $250 million in e-books committed by multiple publishers for the program. ADVERTISEMENT “If we’re serious about living up to what our country is about, then we have to consider what we can do to provide opportunities in every community, not just when they’re on the front page, but everyday,” said Jeff Zients, Obama’s top economic adviser, Reuters reported.\nA White House statement said Macmillan, Simon & Schuster, Penguin Random House, HarperCollins and Hachette were some of the major publishing houses involved with the plan. \nThey would provide students with immediate access to age-appropriate titles in their e-book catalogs, it added. \nObama will additionally announce that the New York Public Library is developing an e-reader app for delivering available works to participating youths. \nVolunteers from the Digital Public Library of America will curate the titles for appropriate audiences, the White House statement concluded. \nZients told Reuters that the new program builds on pre-existing initiatives upgrading Internet services in libraries and schools. Those service improvements were implemented via private sector grants, he added. \n“It’s very different than from our generation,” said Cecilia Muñoz, Obama’s domestic policy adviser, according to Reuters. \n“More and more, you’re going to be seeing kids using devices, and what we’re doing is making sure that there’s more books available on those devices,” she added. \nThe president will also urge community libraries to plot new campaigns for enrolling local students. \nThe White House said this was a critical part of the program, given participating students need access to computers or e-reader devices to read available titles. Tags: Thousands of new Lerner emails... Congressional committees say an inspector general found roughly 6,400... Baltimore mom praised for smacking... \"I don't want him to be a Freddie Gray,\" Toya Graham said. Faith leaders demand that liberal... Scott Lively slammed Justices Kagan and Ginsburg for officiating same-sex... Brent Budowsky: Holy war against... OPINION | Republicans lead a party that looks like little more than an... Internet up in arms over '... An activist was seemingly plucked off the streets in full view of news... Dems hammer Japanese prime... Honda said Abe's \"refusal to squarely face history\" is an insult to so-... GOP unveils budget deal that seeks... The deal would approve more than $5 trillion in spending cuts over a... Baltimore teen disciplined by mom... \"I understand how much my mama really cares about me,” Michael Singleton... Sanders to launch presidential bid The independent senator will enter the Democratic fray Thursday to... Obama accidentally crashes WH... The president walked in on some of the journalists who cover him having... Young voters want a Democrat in... A poll of millennials shows a Democrat has wide support among 18-29-year-... Senators clash over Iran votes Democrats are warning that all bets are off if controversial amendments... Justice Kennedy doesn't reveal... The Supreme Court's most frequent swing vote sent mixed messages Tuesday. Dem to bring Korean 'comfort woman... Rep. Mike Honda (D-Calif.) has the Japan government of failing to own up... Senators vote to block EPA’s use... A Senate committee voted Tuesday to prohibit the Environmental Protection... Reid: 'Journalism doesn't exist' Reid hailed a man who peddled a false story about the minority leader... How Jeb Bush will win in 2016 Bush will find only one path to victory in 2016: through his brother,... Paul blames 'breakdown in the... '16 GOP hopeful says there are \"root, cultural causes\" for violence but \"... Carson slams rioters: 'It makes no... “Reacting out of anger seldom leads to anything helpful,” the possible... Sanders: ‘I am running for... The Vermont Independent told the AP he was all-in for 2016 on Wednesday.", "external_links": [], "published": "2015-04-30T17:38:00.000+03:00", "crawled": "2015-05-01T04:02:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}