{"organizations": [], "uuid": "28570588a49b4ad12e0079b01e4315bd375c5f4d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/1147/feed", "section_title": "Technology", "url": "http://thehill.com/blogs/congress-blog/technology/240685-technology-can-help-solve-immigration-identity-fraud", "country": "US", "title": "Technology can help solve immigration identity fraud", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Technology can help solve immigration identity fraud", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T16:00:00.000+03:00", "replies_count": 0, "uuid": "28570588a49b4ad12e0079b01e4315bd375c5f4d"}, "author": "jpicard@thehill.com (David Aguilar)", "url": "http://thehill.com/blogs/congress-blog/technology/240685-technology-can-help-solve-immigration-identity-fraud", "ord_in_thread": 0, "title": "Technology can help solve immigration identity fraud", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 01, 2015, 09:00 am Technology can help solve immigration identity fraud By David Aguilar \nOn November 20, 2014, President Obama acknowledged the U.S. immigration system as “broken” and announced a series of executive actions designed to make it “more fair and just.” There are many points of disagreement among lawmakers when it comes to immigration reform, but there is little debate that we need to do a much better job of preventing fraud in our immigration system. \nOur imperfect immigration system has empowered a culture of fraud. As just one example, current law relies on employers to attest to their employees’ eligibility for employment. This has resulted in a cottage industry centered on the creation and sale of forged documents to support employment authorization, often for illegal aliens. T he Social Security Administration estimates that 75 percent of unauthorized immigrants are actually on formal payrolls, either using fraudulent Social Security numbers or Social Security numbers of the deceased. ADVERTISEMENT It is an identity crisis of a different sort: we can’t always be certain that immigrants are who they say they are and paper-based documents are too easily forged. A “fair and just” immigration system requires we do everything possible to eliminate identify fraud from the immigration process.\nTechnology can be part of the solution. The capabilities exist today within the private sector to reduce the risk of fraud while protecting individual privacy. Banks, financial institutions, credit reporting agencies, insurance companies and other commercial enterprises where fraud prevention is a high priority are using innovative technology solutions to combat fraud. One readily available commercial service compares mobile device location information with device ownership identity records to confirm identity in seconds, using advanced analytics and available data to stay ahead of fraudsters. Services such as this can complement and improve processes used immigrant entry, processing, and exit. \nA well designed fraud detection program will holistically strengthen our nation’s immigration system, empowering our visa issuing officers, our Customs and Border Protection Officers at our ports of entry, our Border Patrol Agents, Investigators and Citizenship and Immigration Officers to detect and prevent immigration fraud and safeguard U.S. citizens against those that would do us harm. It will bring higher measures of safety and allow us to efficiently and effectively support an immigration system that is truly fair and just. \nThe technology is available. Let’s use it to extend our legacy as a nation forged in a melting pot of nationalities and races that welcomes and protects all citizens. \nAguilar is a former national chief of the U.S. Border Patrol and former acting commissioner of U.S. Customs and Border Protection.", "external_links": [], "published": "2015-05-01T16:00:00.000+03:00", "crawled": "2015-05-01T17:16:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}