{"organizations": [], "uuid": "6427af54c070802dd4ec3deb84dc95f0817aef0b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/warrenelizabethobamabarack_042215getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/241820-democratic-senator-sees-sexism-in-obama-remarks-on-warren", "country": "US", "title": "Democratic senator sees sexism in Obama remarks on Warren", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Democratic senator sees sexism in Obama remarks on Warren", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T00:34:00.000+03:00", "replies_count": 0, "uuid": "6427af54c070802dd4ec3deb84dc95f0817aef0b"}, "author": "iswanson@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/blog-briefing-room/news/241820-democratic-senator-sees-sexism-in-obama-remarks-on-warren", "ord_in_thread": 0, "title": "Democratic senator sees sexism in Obama remarks on Warren", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 12, 2015, 05:34 pm Democratic senator sees sexism in Obama remarks on Warren Getty Images \nSen. Sherrod Brown (D-Ohio) on Tuesday suggested that some of President Obama’s remarks criticizing Sen. Elizabeth Warren (D-Mass.) were sexist. \nObama and Warren have been in a public fight over the president’s trade agenda, which Warren opposes. ADVERTISEMENT Brown said Obama had spoken disrespectfully of Warren and suggested the president wouldn’t have made the same comments about a male senator.\nHe specifically criticized Obama for publicly referring to Warren as “Elizabeth” when responding to her comments. “I think the president was disrespectful to her by the way he did that,” Brown told reporters, according to Politico . “I think that the president has made this more personal than he needed to. \n“I know he disagrees. When he said that a number of us — not just Sen. Warren — but don’t know what we’re talking about, we’re fighting the last war, a number of those phrases he used, I assume he wished he hadn’t said them because he shouldn’t have said them,\" Brown added, according to the newspaper . “I’m not going to get into more details. I think referring to her as first name, when he might not have done that for a male senator, perhaps? I’ve said enough,” Brown said. \nIn an interview with Yahoo News published over the weekend, Obama took a sharp tone, saying that Warren was “absolutely wrong” about his proposed trade deals. \nHe also suggested that Warren was opposing his trade agenda because she is seeking to build her own political brand. \n“The truth of the matter is that Elizabeth is, you know, a politician like everybody else. And you know, she’s got a voice that she wants to get out there. And I understand that,” Obama told Yahoo. \nObama suffered a defeat on the Senate floor Tuesday when the chamber voted against taking up fast-track trade legislation. Tags:", "external_links": [], "published": "2015-05-13T00:34:00.000+03:00", "crawled": "2015-05-13T08:08:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}