{"organizations": [], "uuid": "a86b5e22123694a146680fdb808eccc3c662b192", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/walkerscott_041815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/presidential-races/242326-walker-hillary-obama-foreign-policy-a-mess", "country": "US", "title": "Walker: Hillary, Obama foreign policy 'a mess'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Walker: Hillary, Obama foreign policy 'a mess'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-17T18:22:00.000+03:00", "replies_count": 0, "uuid": "a86b5e22123694a146680fdb808eccc3c662b192"}, "author": "kballuck@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/242326-walker-hillary-obama-foreign-policy-a-mess", "ord_in_thread": 0, "title": "Walker: Hillary, Obama foreign policy 'a mess'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 17, 2015, 11:22 am Walker: Hillary, Obama foreign policy 'a mess' By Mark Hensch Getty Images \nGov. Scott Walker (R-Wis.) on Sunday criticized President Obama and his former secretary of State, Hillary Clinton, saying they left the globe in worse shape than they found it. ADVERTISEMENT “Just about everywhere that Hillary Clinton has played a role with this president, under President Obama, that part of the world is largely a failure, a mess, because of what we’ve seen from Obama and Clinton,” Walker told host Bob Schieffer on CBS’s “Face the Nation.”\nWalker said that Clinton and Obama’s failures stemmed from a lack of leadership ability. \n“Well, I think as a governor, it’s really ultimately about leadership,” Walker, a possible 2016 GOP presidential candidate, said. \n“To me, in my lifetime, one of the best presidents when it comes to foreign policy was a governor from California,” Walker said of former President Reagan. \n“In my lifetime, one of the worst presidents when it comes to foreign policy was a freshman senator from Illinois,” he added of Obama. \nWalker additionally said that should he seek the White House next year, his take on foreign policy would set him apart from Clinton, a Democratic candidate. \n“If I choose to get in this race, it’s something I’m going to lay out a very clear path for what we should do going forward, and how we should address the issues we face here in America and the issues we face around the world,” he said. \n“And I do think that if foreign policy plays an important role, the contrast would be clear,” Walker added. \nWalker cited the 2003 invasion of Iraq and its aftermath as proof of how he viewed global affairs differently than Clinton and Obama. \n“And we have a place that’s destabilized now because of their quick move in the last few years to get out of Iraq,” he said of Obama’s efforts to end a troop surge there. \n“That’s something we need to learn from going forward,” Walker added. “We have a very destabilized region, and we need to have a strong presence there.” \nWalker also criticized Obama for treating Iran softly during ongoing nuclear energy negotiations between the two countries. \n“Well, I think if we’re going to have negotiations, we should have them on our terms, not on theirs,” Walker said. \n“To me, we need to dismantle the illicit nuclear infrastructure they have,” he added. Tags:", "external_links": [], "published": "2015-05-17T18:22:00.000+03:00", "crawled": "2015-05-17T21:19:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}