{"organizations": [], "uuid": "8c70106592578de804217019a69d1b122864ab40", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_immigrationgetty_1.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/241816-after-losing-trade-vote-obama-seeks-to-rally-supporters", "country": "US", "title": "After losing trade vote, Obama seeks to rally supporters", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "After losing trade vote, Obama seeks to rally supporters", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T00:22:00.000+03:00", "replies_count": 0, "uuid": "8c70106592578de804217019a69d1b122864ab40"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/finance/241816-after-losing-trade-vote-obama-seeks-to-rally-supporters", "ord_in_thread": 0, "title": "After losing trade vote, Obama seeks to rally supporters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After losing trade vote, Obama seeks to rally supporters Getty Images By Jordan Fabian - 05/12/15 05:22 PM EDT \nPresident Obama sought to rally his supporters around his trade agenda less than an hour after Senate Democrats blocked the chamber from debating fast-track legislation. \nIn a message to members of Organizing for Action (OFA), Obama said his trade push is \"personal\" and urged them to back a sweeping new trade agreement among 12 Asia-Pacific nations. ADVERTISEMENT “I understand the skepticism about this, or any, trade deal,” the president wrote in an email sent by OFA, the group that grew out of his 2012 campaign to back his policy agenda. “I’ve met folks across the country who still feel burned by agreements of the past. Those are the people I came to Washington to fight for. That's what this is about for me. \n“This is our chance to do better, to get it right.” \nThe president and his staff have made an aggressive lobbying push to convince Democrats to vote for a trade promotion authority bill that would allow the administration to have a free hand in negotiating the trade pact with other nations without amendments from Congress. \nLed by Sen. Elizabeth Warren (D-Mass.), liberal Democrats and labor unions are fighting hard against the legislation out of concern that the trade deals could ship American jobs overseas. \nDemocrats handed Obama a stinging defeat Tuesday afternoon when a motion to proceed to the trade bill failed to get the 60 votes necessary to pass. Just one Democrat, Sen. Tom Carper (Del.), voted for it. \nWhite House press secretary Josh Earnest downplayed the vote as a “procedural snafu” and said the administration would continue to push for the legislation. \nEarnest dismissed the notion that the vote is a sign the president's aggressive sales pitch to Democrats on trade fell flat. \n“I would urge you to withhold judgment about the president’s persuasion ability ... until we’ve had a chance to advance this legislation,” Earnest said. Tags:", "external_links": [], "published": "2015-05-13T00:22:00.000+03:00", "crawled": "2015-05-13T13:14:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}