{"organizations": [], "uuid": "dd4f0dc6ada0b298df15806c98c3a8fd011fb4b7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/bahrainking05132015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/241987-bahrains-king-also-skips-obama-summit", "country": "", "title": "Bahrain's king also skips Obama summit | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Bahrain's king also skips Obama summit | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "dd4f0dc6ada0b298df15806c98c3a8fd011fb4b7"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/241987-bahrains-king-also-skips-obama-summit", "ord_in_thread": 0, "title": "Bahrain's king also skips Obama summit | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 13, 2015, 05:14 pm Bahrain's king also skips Obama summit By Mark Hensch Getty Images \nBahrain’s King Hamad bin Issa al-Khalifa is skipping a Gulf nations summit with President Obama and attending a horse show with Britain’s queen instead. \n“His majesty the king and Queen Elizabeth II will hold a meeting to review the longstanding mutual ties between both royal families in addition to the progress and development of bilateral relations and cooperation in various fields,” a Bahrain royal court statement said, according to Reuters . \nBahraini Foreign Minister Sheikh Khaled bin Ahmed al-Khalifa said on Wednesday Hamad’s absence in Washington was “due to a longstanding prior engagement of his majesty the king in the United Kingdom.” ADVERTISEMENT Hamad is the second Arab monarch to rebuff Obama during Wednesday and Thursday’s Gulf Cooperation Council (GCC).\nSaudi Arabia’s new leader, King Salman, announced on Monday he would not visit Obama during meetings at the White House Wednesday and at Camp David Thursday. \nBoth rulers are instead sending their respective crown princes to represent their kingdoms in Washington, D.C. \nThe two royals reportedly dislike the Obama administration’s negotiations with Iran over its nuclear arms research. Iran, a Shiite Muslim nation, is often at odds with its Sunni neighbors in the Middle East. \nObama announced a tentative deal with Tehran on April 2. He called it a “historic” moment in diplomacy between the two nations in remarks made that same day. \nThe Obama administration has promised it will lift economic sanctions on Iran in exchange for greater restrictions on its atomic energy capabilities. In return, Iranian leadership has vowed it will allow more frequent nuclear inspections and caps on its centrifuge and uranium supplies. \nA final accord between the two nations is due by a self-imposed June 30 deadline. \nObama has long argued diplomacy is the best method for preventing Iranian nuclear weapons. \nSome Gulf Arab nations — and many congressional Republicans — have countered that Ayatollah Ali Khamenei, Iran’s Supreme Leader, has not proven trustworthy during similar agreements in the past. ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T02:05:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}