{"organizations": [], "uuid": "386695f339305ebb6f873fa237bd6d69781e87ef", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/paul-bland/obama-administration-implements-major-advance-for-civil-rights_b_7452536.html", "country": "US", "title": "Obama Administration Implements Major Advance for Civil Rights | Paul Bland", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Implements Major Advance for Civil Rights | Paul Bland", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-27T20:25:00.000+03:00", "replies_count": 0, "uuid": "386695f339305ebb6f873fa237bd6d69781e87ef"}, "author": "Paul Bland", "url": "http://www.huffingtonpost.com/paul-bland/obama-administration-implements-major-advance-for-civil-rights_b_7452536.html", "ord_in_thread": 0, "title": "Obama Administration Implements Major Advance for Civil Rights | Paul Bland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Now we know why the corporate lobby's favorite lawmakers filibustered the nomination of our fantastic Labor Secretary, Tom Perez, for so long. He's actually committed to sticking up for workers.\nEarlier today, the Department of Labor, along with federal procurement agencies, announced guidance and regulations that will give huge and important new protections to those who work with corporations that contract with the federal government. That's 26 million people who will be positively impacted if the proposed regulations are approved.\nThe proposed new rules would do two really significant things:\n• First, they would bar corporations from getting federal contracts if they have repeatedly subjected workers to safety risks, or if they have repeatedly engaged in wage theft.\n• Second, and of incredible importance (even if less obvious to most Americans), regulations from the General Services Administration would bar federal contractors from using fine print contracts to force their workers out of court and into rigged arbitration.\nThe first part, limiting federal contracts to corporations with a decent record of integrity and business ethics toward their workers, may sound like an obvious thing to do. Why should corporations who regularly endanger or cheat their workers get repeat federal contracts? How could this even be this controversial?\nIf you asked that, you might be the kind of person who also wonders why it would be controversial to encourage more people to vote or get health insurance. As it turns out, of course, even that kind of common-sensical idea is controversial in a world where too many politicians will basically say or do anything to advance the agenda of the 0.1 percent and huge corporations.\nIn fact, today's new regulations are Exhibit A as to why elections matter. Just a few months ago, House Republicans held a hearing where three out of four witnesses suggested it would be incredibly unfair if repeat offenders of worker safety and wage theft laws couldn't just keep getting government contracts. Reading the testimony of these corporate lobbyist witnesses, you might get the impression that we would suddenly turn into North Korea if corporations couldn't get enormous federal contracts, despite regularly endangering and cheating their employees.\nIs it any wonder corporate America is fighting so hard? According to the Department of Labor, nearly two-thirds of the 50 largest wage and hour violations, and almost 40 percent of the 50 largest worker safety violations occurred at companies that later received federal contracts.\nThe second part -- limiting the use of forced arbitration by federal contractors -- goes to an issue that is less visible to most people, but still incredibly important if you're a worker.\nIn a growing, and disturbing, trend, tens of millions of American workers have been told by their employers that if they want to get, or keep, a job, they must sign away their rights to go to court if the employer breaks the law. Instead, they have to go to forced arbitration, a system that is biased in favor of employers in a whole bunch of ways.\nForced arbitration generally bans workers from joining together in a class action, for example. That, in turn, makes it incredibly hard to enforce pay equity laws. In a class action, a group of women can come forward with evidence that a corporation pays the women in its work force much less, on average, than it pays men; in an individual case, it is dramatically harder to gather that kind of evidence.\nIf you meet a politician who tells you, \"I really care about pay equity; women should get paid as much as men for the same work,\" but then side with corporate America in forcing people into arbitration (are you paying attention, Senator Feinstein?), they might as well be telling you, \"I am concerned about climate change, but we just need to study it until we've burned all the fossil fuel in the ground.\"\nLauren Weber at the Wall Street Journal wrote a terrific piece about forced arbitration in employment a couple of months ago. Among other things, she cited evidence showing that arbitrators (who are picked by private arbitration companies that are, in turn, picked by the employers) strongly tend to rule in favor of those employers. Weber noted that, \"arbitrations favor employers more often than litigation does, and result in lower awards for employees.\"\nForced arbitration has been picking up steam as a result of a series of U.S. Supreme Court decisions over the last 20 years. By the usual party-line vote, the Supreme Court held in 2013 that forced arbitration clauses must be enforced even where it is absolutely clear that this would mean federal statutes couldn't be enforced in a given case. In another case , also on a typical 5-4 vote, the Supreme Court held that corporations could have arbitrators (not courts) decide whether arbitration clauses are too unfair to enforce, a classic \"chickens guarding the hen house\" kind of ruling.\nCorporate types like to say that the spread of forced arbitration is a natural outgrowth of a 1925 statute by Congress, but the scholarly evidence overwhelmingly establishes that Congress never intended for that statute to cover workers. The federal law encouraging forced arbitration in employment is entirely an activist creation of the Supreme Court's conservative majority.\nIn today's regulations, the Department of Labor puts an end to these unfair Supreme Court decisions, including forced arbitration for millions of employees of federal contractors. It's a huge step towards strengthening the civil rights laws. There's also a nice symmetry to this: There hasn't been such a significant improvement in civil rights laws for workers since the 1991 Civil Rights Restoration Act, which was also a step that reversed a series of harmful U.S. Supreme Court decisions.\nIt also promises to make our government more efficient, something politicians love to say they support. A mountain of empirical evidence shows that unsafe workplaces, and those where basic civil rights laws are violated, tend to be far less efficient than workplaces that follow the law. President Obama's critics like to attack his Executive Orders as supposedly being lawless. But today's regulations are rooted in basic procurement statutes that have been on the books for years -- the laws allow procurement agencies to take steps to improve efficiency for government contractor workplaces, and the new regulations do just that.\nToday's regulations follow from an Executive Order that President Obama issued last July, called the Fair Pair and Safe Workplaces Order. It got very little attention (except for one great piece from Emily Bazelon, in Slate ).\nHopefully, a lot more people will notice today's huge step forward. For the next 60 days, the public has an opportunity to comment on the proposed regulations, before they go into effect. It's imperative that as many of us as possible do so, and weigh in about why these rules matter.\nIt's not often these days that the legal climate gets dramatically better for American workers. President Obama and Labor Secretary Tom Perez deserve a lot of credit for this landmark achievement.\nFollow Paul Bland on Twitter: www.twitter.com/FPBland\nMore: Tom Perez Forced Arbitration Fair Pay and Safe Workplace Executive Order Barack Obama Federal Contractors", "external_links": [], "published": "2015-05-27T20:25:00.000+03:00", "crawled": "2015-05-27T21:14:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}