{"organizations": [], "uuid": "c04fa58dd86b1b89b3fdf9e2cd783f0a23c24ee3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051815getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/news/242457-obama-pressed-to-appoint-poverty-czar", "country": "US", "title": "Obama pressed to appoint poverty czar", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama pressed to appoint poverty czar", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-19T13:00:00.000+03:00", "replies_count": 0, "uuid": "c04fa58dd86b1b89b3fdf9e2cd783f0a23c24ee3"}, "author": "Jesse Byrnes", "url": "http://thehill.com/homenews/news/242457-obama-pressed-to-appoint-poverty-czar", "ord_in_thread": 0, "title": "Obama pressed to appoint poverty czar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama pressed to appoint poverty czar By Jesse Byrnes - 05/19/15 06:00 AM EDT The White House is being pressed to appoint a poverty czar in the wake of President Obama’s recent remarks on income inequality. Those advocating for the White House to place a stronger emphasis on tackling poverty in the United States are also eyeing support among 2016 presidential hopefuls. ADVERTISEMENT Proponents hope appointing someone to fill the role, which was proposed a number of years ago before Barack Obama was first elected president but has so far failed to take root, could come to fruition in the near future. Long advocated by the family of Martin Luther King Jr., the interagency poverty chief could be much like those appointed to handle issues such as climate change, AIDS, the auto industry or, more recently, Ebola. “As my father often said, ‘The time is always right to do what is right,’ ” Martin Luther King III, the son of the civil rights leader, said in a statement shared with The Hill on Monday. “There is no more important time to appoint a poverty czar than now,” King said. King, along with others, pushed the idea during the 2008 presidential race. At the time, around of the 40th anniversary of his father’s assassination, he called on those running for president to commit to establishing the position. Hillary Clinton, then a senator from New York, announced during her White House campaign that as president she would create the senior spot, adding, “No more excuses, no more whining, but instead a concerted effort.” “Hillary did it, Obama refused,” a person familiar with conversations surrounding the pledge told The Hill. Since Obama took office, he has appointed a record number of czars, but none for poverty, the source noted, adding the president “seems unwilling to do anything with audacity.” The White House pushed back on that assertion. “President Obama’s deep and firm commitment to tackling the complex issue of poverty has been evident through the policies he has championed consistently over the past six years,” a White House official said. The official pointed to policies implemented by Obama and his aides on economic security, education and healthcare, which “helped keep between 3.9 million and 5.7 million Americans per year out of poverty during the recovery.” In addition to Clinton, whose campaign did not return a request for comment for this report, advocates for a poverty czar are turning to GOP hopefuls for support. Former Florida Gov. Jeb Bush, Sen. Marco Rubio (Fla.) and Sen. Rand Paul (Ky.), among others, have all spoken on the issue of poverty in favorable terms. Others don’t put much stock in the need for creating the post. “The only job that is guaranteed from appointing a ‘poverty czar’ is the position of poverty czar,” said Deana Bass, a spokeswoman for Ben Carson, a former neurosurgeon and Tea Party activist running to become the GOP presidential nominee. More than 45 million Americans lived below the poverty line last year, the third consecutive year around that level, according to the U.S. Census Bureau. Obama discussed at length the topic of poverty during a panel discussion at Georgetown University last week, in which he acknowledged “class segregation” forcing negative views of the rich and poor, the latter being painted as “sponges, leaches.” “I think we can all stipulate that the best antipoverty program is a job,” Obama said, adding that a job “confers not just income, but structure and dignity and a sense of connection to community.” “I think it is a mistake for us to suggest that somehow every effort we make has failed and we are powerless to address poverty. That’s just not true,” Obama said. “Just in absolute terms, the poverty rate when you take into account tax and transfer programs, has been reduced about 40 percent since 1967,” he said. Robert Doar, who studies poverty at the American Enterprise Institute, agreed that greater attention should be given to the topic, pointing out a steady rise in the poverty rate since 2000 amid a fall in median household incomes. “Hopefully the [czar] would be willing to consider ideas which have shown to reduce poverty, such as work requirements for people receiving assistance, work supports that make work pay, and a greater emphasis on the need for two active and involved parents in every child’s life,” Doar wrote in an email, referring to a potential poverty czar. Obama similarly maintained during a speech in Camden, N.J., on Monday that focused on police relations that intact households, jobs and investments in minority areas are integral to communities not being “isolated and segregated.” “There is more work to do and the president remains steadfast in his efforts to expand opportunity for low-income Americans and their children,” the White House official told The Hill. Such a position could also have some support in Congress. “Appointing a senior level official solely devoted to addressing and ending poverty in America is major and exciting step forward and gives me hope that ending poverty is becoming a national priority,” Rep. Barbara Lee (D-Calif.) said in a statement to The Hill. Lee, who chairs a House leadership task force focused on poverty and works with another within the Congressional Black Caucus, indicated she supported developing a “coordinated national strategy to build pathways into the middle class” for the poor. “When the auto industry needed a bail-out we had an auto czar. When just one person in America contracted Ebola, we got an Ebola czar,” former Rep. Andrew Young (D-Ga.), who served as the U.S. ambassador to the United Nations and has urged the creation of the position, said in a statement. “It is time for the tens of millions of Americans who struggle to afford housing and basic necessities to know that the president has empowered a senior official to be wholly devoted to implementing solutions to poverty.”", "external_links": [], "published": "2015-05-19T13:00:00.000+03:00", "crawled": "2015-05-19T13:24:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}