{"organizations": [], "uuid": "4971a84a47ed0fe6e9144e61998e32d9c39fd960", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2903402/images/o-VISITING-AUSTRALIA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/blog.xml", "section_title": "Women Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/gabrielle-dunkley/21-things-i-did-in-australia-that-i-didnt-tell-immigration_b_7159632.html", "country": "US", "title": "21 Things I Did in Australia That I Didn't Tell Immigration | Gabrielle Dunkley", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 4, "title_full": "21 Things I Did in Australia That I Didn't Tell Immigration | Gabrielle Dunkley", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T22:24:00.000+03:00", "replies_count": 3, "uuid": "a8923acd352b78f7c810c5da4f741fc1cbbc0504"}, "author": "Gabrielle Dunkley", "url": "http://www.huffingtonpost.com/gabrielle-dunkley/21-things-i-did-in-australia-that-i-didnt-tell-immigration_b_7159632.html#post-0", "ord_in_thread": 0, "title": "21 Things I Did in Australia That I Didn't Tell Immigration | Gabrielle Dunkley", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Upon arriving at Adelaide Airport on a dreary Monday morning, three immigration officers pulled me aside for 45 minutes, asking me why I'd bother visiting South Australia's capital.\nIt wasn't a surprise. I'm black, I'm perplexingly cheerful, I'm a woman, and I was traveling to Adelaide alone without any discernible reason. After searching my luggage twice, skimming my notepads, checking my hotel reservations, and even going so far as to Google me, they ultimately seemed disappointed to discover that I was normal.\nWhen I returned to America two weeks later, a U.S. customs officer delivered a similar line of questioning, asking why I would travel to opposite ends of the earth.\nAs a Washington, DC resident and recovering workaholic, I wouldn't consider a spontaneous trip to Australia normal, either. Much like unicorns and delay-free Red Line metro rides, extended time off is pretty much considered make-believe in this town. But one day, I asked myself, \"Self, why not?\"\nI arrived in Oz, determined to have an adventure. Here is how it unfolded:\n1. For my 29-hour flight -- both ways -- I chose Air New Zealand, just as any Lord of the Rings fan would.\nNot only was the Air New Zealand flight exceptionally wonderful, the Middle Earth-themed safety video made me swoon.\n2. I went on an exploration of Adelaide's stunning botanic gardens with Andre, an Australian law student.\nThis is Andre.\n3. We had the honor and privilege of meeting whip Tom Kenyon (South Australia's version of House of Cards ' Frank Underwood) and we toured South Australia's Parliament House.\nKenyon is much nicer than Frank Underwood.\n4. We went on a wine tour with Segway Sensations South Australia and witnessed sweeping views of lush greenery at Seppeltsfield Wine Estate.\n5. We wined and dined and at world famous Fino.\n6. We hung out with alpacas.\nI got photobombed by an alpaca, what are you doing with your life?\n7. We took home a complimentary bottle of wine after staying at peaceful and secluded Whistler Farm.\n8. We climbed rocks at Victor Harbor.\n9. We had a beachside lunch at Flying Fish.\n10. I went on a spooky ghost tour in Adelaide.\n11. We flew to Sydney.\n12. We visited the Anzac Memorial.\n13. We had a bewilderingly delicious seafood feast at Blue Fish.\n14. We indulged in gigantic prawns as big as your fists at The Sydney Cove Oyster Bar right on the harbor.\nWe ate all of the seafood on the harbor. All of it.\n15. We went to Coogee and came to the conclusion that life was a beach.\n16. We took selfies with sharks, or shark-fies at the Sea Life Sydney Aquarium.\n17. We marveled at the architectural majesty of this oddly shaped white building. You might have heard of it.\n18. We found Spiderman at the Museum of Contemporary Modern Art Australia.\n19. I said goodbye (for now) to all of my new friends.\n20. It was one remarkable adventure. If immigration asked me again why I came to visit South Australia, I know the reason I would give them...\n21. ...I would tell them it was for the alpacas. Andre is okay, too. But it was mostly for the alpacas.\nFollow Gabrielle Dunkley on Twitter: www.twitter.com/lgabriellel\nMore: Adelaide Australia Travel Adelaide South Australia Australia Dining Coogee Beach", "external_links": ["http://www.environment.sa.gov.au/botanicgardens/home", "http://www.twitter.com/lgabriellel", "http://www.cnn.com/2014/10/22/travel/air-new-zealand-safety-video/"], "published": "2015-05-01T22:24:00.000+03:00", "crawled": "2015-05-03T01:08:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}