{"organizations": [], "uuid": "6b68987b299aaa182d26bad3b91bebc587e198ae", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/hope.png", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/blogs/blog-briefing-room/news/243360-hope-designer-shepard-fairey-obama-didnt-live-up-to-iconic", "country": "US", "title": "'Hope' designer Shepard Fairey: Obama didn't live up to iconic poster", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "'Hope' designer Shepard Fairey: Obama didn't live up to iconic poster", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-28T22:42:00.000+03:00", "replies_count": 0, "uuid": "6b68987b299aaa182d26bad3b91bebc587e198ae"}, "author": "nzimmerman@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/blog-briefing-room/news/243360-hope-designer-shepard-fairey-obama-didnt-live-up-to-iconic", "ord_in_thread": 0, "title": "'Hope' designer Shepard Fairey: Obama didn't live up to iconic poster", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 28, 2015, 03:42 pm 'Hope' designer Shepard Fairey: Obama didn't live up to iconic poster By Jesse Byrnes YouTube \nThe designer of the iconic \"Hope\" poster that came to define Barack Obama's first presidential campaign in 2008 said in a new interview that the president hasn't lived up to his expectations. \n\"Not even close,\" Shepard Fairey said when asked in an Esquire interview published Thursday if Obama had lived up to the promise of his famous portrait. \n\"Obama has had a really tough time, but there have been a lot of things that he's compromised on that I never would have expected,\" Fairey said. \nHe explained that the Obama administration's reliance on drones overseas and domestic surveillance were issues where the president has let him down. \n\"[D]rones and domestic spying are the last things I would have thought [he'd support],\" Fairey said. \nThe graphic designer suggested Obama should be \"more courageous\" but acknowledged some of the president's actions were out of his control. \nFairey's iconic \"Hope\" poster with hues of red, white and blue incorporated Obama's typographic \"O\" logo, itself emblematic of an American flag. \nObama's reelection campaign in 2012 dropped the hope and change mantras on stylized posters but kept the American flag \"O\" logo to push \"Forward.\" \nStill, Fairey's original poster became emblematic of Obama's presidency, with vice presidential candidate Rep. Paul Ryan (Wis.) invoking it in his remarks at the 2012 Republican National Convention. \n\"College graduates should not have to live out their 20s in their childhood bedrooms, staring up at fading Obama posters and wondering when they can move out and get going with life,\" Ryan said. \nAsked who he would support in 2016, Fairey told Esquire he agrees with Democratic front-runner Hillary Clinton \"on most issues\" but denounced the structure of campaigns that benefit wealthier candidates and special interests.", "external_links": [], "published": "2015-05-28T22:42:00.000+03:00", "crawled": "2015-05-29T04:50:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}