{"organizations": [], "uuid": "e02a2601cac31705e506e4a76f09af3b1e03a4de", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/arts/blog.xml", "section_title": "Arts Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/stephen-tanenbaum/art-digest-online-art-buy_b_7236774.html", "country": "US", "title": "Art Digest: Online Art Buying Rises, Obama Cracks Down on Wealthy Art Investors and FLOTUS Calls for More Minority-Friendly Museums | Stephen Tanenbaum", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Art Digest: Online Art Buying Rises, Obama Cracks Down on Wealthy Art Investors and FLOTUS Calls for More Minority-Friendly Museums | Stephen Tanenbaum", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-08T20:11:00.000+03:00", "replies_count": 0, "uuid": "e02a2601cac31705e506e4a76f09af3b1e03a4de"}, "author": "Stephen Tanenbaum", "url": "http://www.huffingtonpost.com/stephen-tanenbaum/art-digest-online-art-buy_b_7236774.html", "ord_in_thread": 0, "title": "Art Digest: Online Art Buying Rises, Obama Cracks Down on Wealthy Art Investors and FLOTUS Calls for More Minority-Friendly Museums | Stephen Tanenbaum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What a month in the art world: industry projections, tax loopholes and museum openings galore! We'll unpack what went down, in case you happened to get sidetracked by the hoopla of the Met Gala's red carpet .\nA Look Back at the 2014 Online Art Market\nGood news abounds in the latest Hiscox Online Art Trade Report .\nGlobal online art sales took a big leap forward last year as the market reached $2.6 billion, up from $1.6 billion in 2013. At this pace, the online art market will reach $6.3 billion in 2019. Not a small number, considering how many people balked at the notion of buying fine art sight unseen a mere few years ago. Figures indicate that online art buying accounts for 4.8 percent of the estimated $55 billion global art market.\nOnline art platforms, such as UGallery.com and Artsy , have changed the game. For the first time ever, less than half of buyers, 48 percent, prefer to purchase art in a brick-and-mortar gallery.\nWith 84 percent of online art sales happening under the $15,000 price point, there is lots of activity taking place outside of the Sotheby's auction headlines .\nQuick! Upgrade Your Diebenkorns for Rothkos Tax-Free While You Still Can\nAs more and more collectors view art as an investment, it is only natural that it is being used -- and exploited -- as one. At least for now.\nIn his 2016 budget, Obama proposes to eliminate a popular tax break that allows wealthy art collectors to avoid capital gains taxes on profitable art sales, according to the New York Times .\nThe law was originally introduced in the 1920s to ease the tax burden of farmers who wanted to swap property. Now known as a like-kind exchange, the Times writes that \"the tactic has become vogue for a new niche of investors: buyers of high-end art who want to put off -- and sometimes completely avoid -- federal taxes when upgrading their Diebenkorns for Rothkos.\"\nThe Obama administration estimates that eliminating the exemption could bring in as much as $19.5 billion in deferred or avoided taxes over the coming decade.\nCan art museums be intimidating or unwelcoming to racial minorities?\nIn the wake of racial tension and turmoil that has prompted protests throughout the country, this question became a hot topic during Michelle Obama's dedication ceremony at the extravagant new Whitney museum in New York. Here is what FLOTUS had to say:\nYou see, there are so many kids in this country who look at places like museums and concert halls and other cultural centers and they think to themselves, well, that's not a place for me, for someone who looks like me, for someone who comes from my neighborhood,\" she said. \"In fact, I guarantee you that right now, there are kids living less than a mile from here who would never in a million years dream that they would be welcome in this museum. And growing up on the South Side of Chicago, I was one of those kids myself.\nThere is a large socio-economic gap in the United States, especially in urban environments where museums are most common. Sociologists say there is a phenomenon of \"threshold fear\" taking place, whereby price or comfort barriers are preventing people from going inside. Here is one fix museums could install to help make the experience more welcoming: free admission. In Europe, for example, most museums are free, attracting a completely diverse audience: locals, travelers, penniless students, professors and the average bloke taking a long lunch break.\n*Insider Tip: In New York City, museums such as the Natural History Museum, the MET and Brooklyn Museum are all technically free as they ask for a suggested donation.\nFollow Stephen Tanenbaum on Twitter: www.twitter.com/sltbaum\nMore: Hiscox Art Report Online Art Market Ugallery Artsy Fine Art Art Tax Break Like Kind Exchange New York Times Arts Whitney Museum Opening Michelle Obama Racial Minorities Museum Free Admission", "external_links": ["http://ugallery.com", "http://www.vogue.com/tag/event/met-gala/", "http://artsbeat.blogs.nytimes.com/2015/04/20/online-art-buying-rises-in-new-market-report/?_r=1", "http://www.nytimes.com/2015/04/27/arts/design/tax-break-used-by-investors-in-flipping-art-faces-scrutiny.html?_r=0", "http://www.bloomberg.com/news/articles/2015-02-10/richter-s-abstract-fetches-record-46-million-at-sotheby-s-sale", "http://www.twitter.com/sltbaum", "http://artsy.net"], "published": "2015-05-08T20:11:00.000+03:00", "crawled": "2015-05-08T23:20:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}