{"organizations": [], "uuid": "1074372488cd763c00ff22d5a06b6b6ff0196fcb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamahurricane.jpg", "site_section": "http://thehill.com/blogs/e2-wire?format=feed&type=rss", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/243319-forecasters-tell-obama-to-expect-below-normal-hurricane-season", "country": "US", "title": "Forecasters tell Obama to expect ‘below-normal’ hurricane season", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Forecasters tell Obama to expect ‘below-normal’ hurricane season", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-28T19:31:00.000+03:00", "replies_count": 0, "uuid": "1074372488cd763c00ff22d5a06b6b6ff0196fcb"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/243319-forecasters-tell-obama-to-expect-below-normal-hurricane-season", "ord_in_thread": 0, "title": "Forecasters tell Obama to expect ‘below-normal’ hurricane season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Forecasters tell Obama to expect ‘below-normal’ hurricane season Getty Images By Timothy Cama - 05/28/15 12:31 PM EDT \nThe Atlantic Ocean is most likely to see a “below-normal” hurricane season, but some major storms are still possible, federal forecasters predict. \nPresident Obama received a briefing Thursday on the hurricane forecast from the National Oceanic and Atmospheric Administration’s (NOAA) National Hurricane Center at the office’s headquarters in Miami. ADVERTISEMENT Obama receives the briefing every year, but he decided to go to Miami to hear it in person as part of an effort to highlight what he is doing to fight climate change and protect vulnerable communities like Miami Beach from the rising sea levels and severe weather that are expected to accompany a changing globe.\n“The Miami Beach business district has been plagued by high-tide flooding due to rising sea levels in the face of climate change,” the White House wrote in a post on blogging platform Medium. \n“But, they are proactively working to protect their neighborhoods from high tide floods by elevating roads, installing pumping stations and adjusting building codes.” \nThe hurricane season, which stretches from June 1 to Sept. 30, will probably have three to six hurricanes form in the Atlantic, of which up to two will be major, with winds of 111 mph or higher, NOAA said. \n“A below-normal season doesn’t mean we’re off the hook. As we’ve seen before, below-normal seasons can still produce catastrophic impacts to communities,” NOAA Administrator Kathryn Sullivan said in a statement, referring to 1992’s Hurricane Andrew. \nThe El Niño warm water phenomenon in the Pacific Ocean, which impacts the world’s weather, is the main reason for the below-normal prediction, NOAA said. \nObama is touring the Hurricane Center as part of his visit and giving a speech on severe weather and climate change. Tags:", "external_links": [], "published": "2015-05-28T19:31:00.000+03:00", "crawled": "2015-05-28T21:28:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}