{"organizations": [], "uuid": "96b232321dd096014ca6c0804b1d98d05f12bb33", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/241924-obama-praises-us-saudi-relationship", "country": "US", "title": "Obama praises US-Saudi relationship", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama praises US-Saudi relationship", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T19:27:00.000+03:00", "replies_count": 0, "uuid": "96b232321dd096014ca6c0804b1d98d05f12bb33"}, "author": "bkamisar@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/blog-briefing-room/news/241924-obama-praises-us-saudi-relationship", "ord_in_thread": 0, "title": "Obama praises US-Saudi relationship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 13, 2015, 12:27 pm Obama praises US-Saudi relationship By Ben Kamisar \nPresident Obama praised America’s relationship with Saudi Arabia during an Oval Office meeting with the Saudi Crown prince—a sit-down that came after Saudi King Salman decided not to travel to Washington for a meeting. \nObama said the two would discuss “bilateral issues,” including a ceasefire in Yemen, where Saudi Arabia is part of a proxy war against rebels supported by Iran. He added that the Gulf nation is “a critical part of our coalition in the fight against the” Islamic State in Iraq and Syria, and said that the pair will also discuss the ongoing situation in Syria. ADVERTISEMENT Prince Mohammad bin Nayef gave Obama the king’s wishes and called for stability.\n“We look forward, god willing, to working with you to overcome the challenges and bring about calm and stability to the region,” he said in Arabic. \nWhite House deputy press secretary had confirmed a visit by King Salman as recently as Friday, when he said the two leaders would meet individually this Wednesday when he attended a meeting with world leaders that made up the Gulf Cooperation Council. \nBut Salman pulled out of the trip on Monday in a move that some have called a snub because of American negotiations with Iran, Saudi Arabia’s main rival in the Middle East. \nThe White House has repeatedly pushed back against the assertion of a snub, with White House press secretary Josh Earnest telling reporters on Monday that the change in plans was “completely unrelated” to the president’s meeting with the Gulf Cooperation Council at Camp David this week. \n“There had been some speculation that this change in travel plans was an attempt to send a message to the United States,” he said. \n“If so, that message was not received, because all the feedback that we have received from the Saudis has been positive.”", "external_links": [], "published": "2015-05-13T19:27:00.000+03:00", "crawled": "2015-05-13T20:23:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}