{"organizations": [], "uuid": "042f98d6c2cbda40640ca23ee5d7dd970417f7c1", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/carsonben_050715getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/ballot-box/presidential-races/241450-ben-carson-obama-can-tell-a-lie-to-your-face", "country": "US", "title": "Ben Carson: Obama can 'tell a lie to your face'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Ben Carson: Obama can 'tell a lie to your face'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-08T19:17:00.000+03:00", "replies_count": 0, "uuid": "042f98d6c2cbda40640ca23ee5d7dd970417f7c1"}, "author": "Mark Hensch", "url": "http://thehill.com/blogs/ballot-box/presidential-races/241450-ben-carson-obama-can-tell-a-lie-to-your-face", "ord_in_thread": 0, "title": "Ben Carson: Obama can 'tell a lie to your face'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 08, 2015, 12:17 pm Ben Carson: Obama can 'tell a lie to your face' By Mark Hensch Getty Images \nRepublican White House candidate Ben Carson on Friday stood by his remark that President Obama is a “psychopath,” saying he displays the associated personality traits. \n“I said he reminds you of a psychopath, because they tend to be extremely smooth, charming people who can tell a lie to your face,” Carson told host John Harwood on CNBC’s “Speakeasy.” \n“It looks like sincerity, even though they know it’s a lie,” he said. ADVERTISEMENT Carson accused Obama of particular insincerity on unemployment rates, which on Friday fell to the lowest level in seven years. \n“He knows full well that the unemployment rate is not 5.5 percent,” the 2016 hopeful said. “He knows that.” \n“He knows that you can manipulate that number, and he knows that people who are not well-informed will swallow it hook, line and sinker — even though they are sitting there in the city and can’t find a job.” \n“He plays fast and loose with the facts.” \nCarson’s remarks were in response to Harwood’s question about whether he still believes Obama is a “psychopath.” \nThe retired neurosurgeon first used the label while describing Obama in a GQ profile published last month. \n“Like most psychopaths, that’s why they’re successful,” Carson reportedly said of Obama’s appearance during his State of the Union address last year. \n“That’s the way they look,” he argued. “They all look great.” \nCarson launched his White House run on Monday from his hometown of Detroit. \n“I got to tell you something: I’m not politically correct, and I’m probably never going to be politically correct because I’m not a politician and I don’t want to be a politician,” he said during his campaign announcement. \n“Politicians do what is politically expedient, and I want to do what’s right,” he added. \nCarson joined a crowded 2016 GOP field containing Sens. Ted Cruz (Texas), Rand Paul (Ky.) and Marco Rubio (Fla.) after declaring his Oval Office bid. \nFormer Hewlett-Packard CEO Carly Fiorina stole some of Carson’s thunder by announcing her own 2016 bid the same afternoon \nFormer Gov. Mike Huckabee (Ark.) additionally joined next year’s race on Tuesday from his hometown of Hope, Ark.", "external_links": [], "published": "2015-05-08T19:17:00.000+03:00", "crawled": "2015-05-08T19:23:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}