{"organizations": [], "uuid": "de636d791256e0829e3a58bf7bc318921a6e5b02", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/walkerscott_051915getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/blogs/ballot-box/presidential-races/243086-walker-rips-obama-over-iran-negotiations", "country": "US", "title": "Walker rips Obama over Iran negotiations", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Walker rips Obama over Iran negotiations", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-26T18:56:00.000+03:00", "replies_count": 0, "uuid": "de636d791256e0829e3a58bf7bc318921a6e5b02"}, "author": "bgoad@thehill.com (Jonathan Easley)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/243086-walker-rips-obama-over-iran-negotiations", "ord_in_thread": 0, "title": "Walker rips Obama over Iran negotiations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 26, 2015, 11:56 am Walker rips Obama over Iran negotiations Getty Images \nWisconsin Gov. Scott Walker (R) on Tuesday accused the Obama administration of endangering Israel by negotiating with Iran over its nuclear program.The likely presidential candidate wrote in a blog post that a five-day swing through Israel that has just concluded cemented his beliefs that the talks were threatening the U.S. ally . \n“I wish it were not the case, but this trip only confirmed my belief that the current administration is not giving Israel the support it needs,” Walker wrote on Medium . “Instead of standing with our ally, the president is making bad deals with a country that wishes to wipe Israel off the map.” ADVERTISEMENT “As the Israelis rightly recognize, such a bad deal would not only give Iran a pathway to a nuclear bomb, it would empower their broader, destructive agenda,” he continued. “We don’t have to guess that Iran might do with billions of dollars in sanctions relief to funnel to terrorist proxies and an intact nuclear infrastructure. They have said so themselves. They seek the destruction of Israel and — ultimately — of the United States.”\nWalker is expected to enter the race for the Republican presidential nomination early this summer, and traveling to Israel is a symbolic gesture members of both parties make to show support for a longtime U.S. ally and to burnish their foreign policy bona fides before launching White House bids. \nWalker said he met with Israeli Prime Minister Benjamin Netanyahu, as well as other political and business leaders from the Middle East. Upon returning, he met with lawmakers on Capitol Hill, where he discussed his takeaways from the trip, and sought to highlight his expertise on foreign affairs in other areas of the world. \nMany believe that while governors have an advantage over other presidential candidates by bringing executive experience and expertise on domestic issues to the table, they generally lack the foreign policy expertise of U.S. senators, who are regularly briefed on intelligence matters. \nWalker has long been critical of the Obama administration’s negotiations with Iran. Earlier this year, in a radio interview on \"The Hugh Hewitt Show,\" Walker said that if he were elected president, on his first day in office he’d reject any deal the White House strikes with Iran over its nuclear program if it continues to allow the country to enrich uranium. \n“My goal in visiting Israel was to listen to its leaders and its citizens in order to better understand their perspective,” Walker wrote on Medium. “It is very clear to me that now is not the time to dismiss or downplay the threats to their country or ours. Nor is it a time to dismiss the rise of anti-Semitism around the world and an increasing effort in places like Western Europe to delegitimize Israel. Now is the time to work together and restore the ruptured bonds between our two countries.”", "external_links": [], "published": "2015-05-26T18:56:00.000+03:00", "crawled": "2015-05-26T23:02:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}