{"organizations": [], "uuid": "a69ba067512238d39dfd0bdaba2803ce7114dbba", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed#", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/defense/242554-obama-turns-the-middle-east-into-the-wild-west", "country": "US", "title": "Obama turns the Middle East into the Wild West", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama turns the Middle East into the Wild West", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-20T13:30:00.000+03:00", "replies_count": 0, "uuid": "a69ba067512238d39dfd0bdaba2803ce7114dbba"}, "author": "naomi.friedman.asheville@gmail.com (Naomi Friedman, contributor)", "url": "http://thehill.com/blogs/pundits-blog/defense/242554-obama-turns-the-middle-east-into-the-wild-west", "ord_in_thread": 0, "title": "Obama turns the Middle East into the Wild West", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 20, 2015, 06:30 am Obama turns the Middle East into the Wild West By Naomi Friedman, contributor \nYou've got a problem — a security problem? Don't sweat it. President Obama has an answer. He'll arm you. \nYou say the Islamic State in Iraq and Syria (ISIS) is attacking the Iraqi city of Ramadi? Stay calm. We've got it covered. Vice President Biden assured the Iraqi prime minister last Friday that the U.S. is fast-tracking AT-4 shoulder-held rockets and other heavy weaponry to Iraqi government troops — and their Iranian-backed militia allies. Of course, on Saturday, Ramadi fell to ISIS — which seized every opportunity to grab the U.S.-supplied arms left behind by the Iraqi army. ADVERTISEMENT You say the Syrian government is dropping chlorine gas bombs on its own civilians again ? Well, what are you complaining about? Obama already sent the Free Syrian Army 3,000 tons of M16A assault rifles from Croatia, M79 anti-tank rockets from Saudi Arabia and most recently BGM-71 TOW armor-piercing anti-tank systems . The problem is ... those weapons that were sent to the moderate Syrian rebels, the Free Syrian Amy, somehow wound up in the hands of the al Qaeda affiliate al Nusra Front and ISIS .\nNow, you say Iranian-backed Shiite rebels in Yemen are lobbing rockets and mortars into Saudi cities? Keep your hat — I mean crown — on, King Salman. Obama is setting up \"a dedicated Foreign Military Sales procurement office to process GCC [Gulf Cooperation Council]-wide sales, streamlining third-party transfers, and exploring ways the United States could accelerate the acquisition and fielding of key capabilities,\" or so says the White House press statement. \nThe problem is ... the day after Obama promised military aid to Saudi Arabia and other Gulf states in return for their supporting negotiations toward the \"Iran deal,\" the Iranian Supreme Leader Ayatollah Ali Khamenei announced that \"Yemen, Bahrain and Palestine are oppressed, and we protect oppressed people as much as we can.\" Yes, you heard right: Bahrain. \nBahrain, a member of the GCC, is a small island state to the east of Saudi Arabia and to the west of Iran. The country is indeed home to an Iranian-backed Shiite group, Saraya al-Mukhtar, that has participated in rallies, protests, bombings and attacks on police stations controlled by the minority Sunni regime. \nIn making the statement, Khamenei now threatens to activate the Shiite rebel group Saraya al-Mukhtar and destabilize Bahrain. Since Bahrain is also home to the U.S. Fifth Naval Fleet, destabilizing Bahrain is probably not in the best interests of the United States. \nSo, the day after Obama met with GCC leaders to convince them to drop their opposition to the Iran deal in exchange for lots of things that explode, Khamenei signaled that Iran is escalating the Shiite-Sunni regional war to include Bahrain. \nUp until now, Iran has primarily focused its efforts on maintaining control of (1) Syria through Syrian President Bashar Assad; (2) Lebanon through the Hezbollah, (3) Yemen through the Houthi rebels; and (4) Iraq through its ties with the Shiite-dominated government and Shiite rebels. Now, it will expand into (5) Bahrain. \nNow, last month when Iranian ships sailed toward Yemen with advanced weapons for the rebels, the mere entrance of the USS Theodore Roosevelt into Yemeni waters sent the Iranian ships scuttling back home. \nCommentators in Israel and the Arab world hoped that Obama would realize what flexing a bit of military muscle can do in the Middle East — that the president might embrace a strategy known as \"deterrence.\" The president didn't. Instead, the president focused on partisan battles within the U.S. and tried to convince the GCC to embrace his Iran deal at the Camp David conference. The king of Bahrain, for his part, opted out of the conference, choosing instead to accompany the Queen of England to a horse race. \nIt is high time Obama reassessed his strategy. There is only one military superpower in the world today. There is only one sheriff in town. And that sheriff better put on his badge. \nThat sheriff can use deterrence to prevent Iran from delivering military supplies to the Houthi rebels in Yemen, Saraya al-Mukhtar in Bahrain, the Syrian Army and the Hezbollah through naval and aerial threats. That sheriff can rally the U.N. and Western allies to put a stop to the Yemini war — and get a peacekeeping force on the ground. That sheriff can also monitor the Iranian Revolutionary Guard Corps activities in Iraq with hopes that Iraq doesn't fall to Iran. \nUnderstand, our pro-Western Sunni allies are fighting two major wars: one against Iran-supported Shiite radicals (in Yemen, Syria, Lebanon, Iraq and now Bahrain) and one against ISIS. They need our support to win first the one and then the other. \nAnd remember, the U.S. does possess the military capability necessary to stand up to Iran. The U.S. can unite our allies behind such a move. And, of course, President Obama should prevent Iran from destabilizing the Middle East and from obtaining a nuclear bomb on — or off — his watch. \nFriedman is an American-Israeli writer and editor in the fields of political science, history, and information technology. Tags:", "external_links": [], "published": "2015-05-20T13:30:00.000+03:00", "crawled": "2015-05-21T00:51:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}