{"organizations": [], "uuid": "810ead4a63e913409f94a92be7ba27e122f9a537", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/huckabeemike_041815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1625/feed", "section_title": "Presidential races", "url": "http://thehill.com/blogs/ballot-box/presidential-races/241235-huckabee-hillary-absolutely-wrong-on-immigration", "country": "US", "title": "Huckabee: Hillary 'absolutely' wrong on immigration", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Huckabee: Hillary 'absolutely' wrong on immigration", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-06T22:30:00.000+03:00", "replies_count": 0, "uuid": "810ead4a63e913409f94a92be7ba27e122f9a537"}, "author": "dweaver@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/241235-huckabee-hillary-absolutely-wrong-on-immigration", "ord_in_thread": 0, "title": "Huckabee: Hillary 'absolutely' wrong on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Past: 1 day NASA: Humanity closer to reaching... \"It is my firm belief that we are closer to getting there today,\" Charles... Perry criticizes Texas governor... A conspiracy theory claims the military is using a training exercise to... Bill Press: Sanders a serious... OPINION | The long-shot candidate will have a profound, positive impact on... Why isn’t Huckabee getting more... In many ways, Mike Huckabee is the Rodney Dangerfield of the 2016 election. Hillary to GOP: You get 1 shot on... Clinton's attorney says there is no \"logic\" to the panel's request. Juan Williams: Republicans and... OPINION: Southern white male dominance in the GOP has prompted alarm. Republicans pass a budget, flexing... The 51-48 vote capped weeks of work by Republican leaders in the House and... Clinton takes hit in new poll Her unfavorable ratings are up 6 percentage points, but she still tops... Bill would bar lawmakers from... Members of Congress are seeking to ensure taxpayers don't pay for luxury... NASA plan could lead to ‘... In the next decade, NASA wants to rope in and \"redirect\" an asteroid. CDC: Hispanics in US living longer... Much of the disparity can be attributed to the lower smoking rates among... Immigration battle moves to the... The fight underscores the GOP’s difficulty in wrestling with Obama’s DACA... Obama hints at post-presidential... Commander in chief getting more serious about his future endeavors. Team Hillary prepares 'Clinton... John Podesta said the campaign will not let attacks \"go unchallenged.\" Feds to require climate change... The new FEMA policy is sparking Republican criticism. Winners, losers in $612B defense... Rep. Martha McSally (R-Ariz.) and the F-35 are among the winners. Court hears challenge to Obama's... Judges questioned Arizona Sheriff Joseph Arpaio's legal standing in the... Lupus is not arthritis Lupus is an unpredictable, mysterious and misunderstood autoimmune disease... Buffett: I'm going to vote for... “I think that she is the most likely person to be president,\" the... House VA chief's patience wears... The head of the House Veterans’ Affairs Committee is running out of...", "external_links": [], "published": "2015-05-06T22:30:00.000+03:00", "crawled": "2015-05-06T23:31:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}