{"organizations": [], "uuid": "8d66e885545f37f27fd9d8f0c4a0d6fe35e77ebd", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/mikehuckabee.png", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/policy/transportation/241190-huckabee-obama-incredibly-unbalanced-on-national-security", "country": "US", "title": "Huckabee: Obama 'incredibly unbalanced' on national security", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Huckabee: Obama 'incredibly unbalanced' on national security", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-06T18:30:00.000+03:00", "replies_count": 0, "uuid": "8d66e885545f37f27fd9d8f0c4a0d6fe35e77ebd"}, "author": "klaing@thehill.com (Keith Laing)", "url": "http://thehill.com/policy/transportation/241190-huckabee-obama-incredibly-unbalanced-on-national-security", "ord_in_thread": 0, "title": "Huckabee: Obama 'incredibly unbalanced' on national security", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Huckabee: Obama 'incredibly unbalanced' on national security By Keith Laing - 05/06/15 11:30 AM EDT \nA day after announcing he's running for president, Mike Huckabee criticized the Obama administration for being “incredibly unbalanced” on national security issues, citing X-ray searches that are conducted by the Transportation Security Administration (TSA). \nHuckabee said during a Wednesday interview on “Fox and Friends” that the White House has backed the TSA, but was slow to respond when a pair of gunmen, possibly inspired by the Islamic State of Iraq and Syria (ISIS), opened fire outside of a cartoon contest that featured controversial drawings of Muslim Prophet Mohammed in Garland, Texas. \n“The biggest mistake is he will not identify this enemy as Islamic jihadism,” Huckabee said. “And we need to recognize — I hear their semantic games. Is it ISIS? Well, it doesn't matter. It's all basically rooted from Islamic jihadism. So whether it's Hamas, Hezbollah, whether it's ISIS, they're all leaves from the same tree.” ADVERTISEMENT Huckabee said he specifically took issue with the TSA’s use of X-ray machines at airport security checkpoints. \n“And what we're seeing now in U.S. soil, what happened in Garland, Texas, thank God, for an off-duty traffic cop who, with a Glock, took down two people, unbelievable,” he said. “But I think it's a reminder, we're not safe anymore in our own country because we haven't had control of our security situations. \n“We're stripping elderly grandmothers electronically naked in the TSA process, and this guy is out there tweeting he's about to attack somebody and we don't catch that,” Huckabee continued. “Something is incredibly unbalanced about our approach to security.” \nHuckabee announced his campaign for 2016 Republican presidential nomination on Monday, saying he is running because \"we’ve lost our way morally.\" \nThe TSA has come under fire often for its airport security techniques, including X-ray scanners and “pat-down” hand searches that critics have said violate passengers’ privacy. \nRepublicans, in particular, have been critical of the agency, calling for it to be disbanded and pushing for airport security to privatized. Tags:", "external_links": [], "published": "2015-05-06T18:30:00.000+03:00", "crawled": "2015-05-07T01:18:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}