{"organizations": [], "uuid": "a7beff6b82d10e395d51c0603a64325a3bf86a95", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/santorumrick_042515getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/243415-santorum-obama-not-fighting-a-real-war-with-isis", "country": "US", "title": "Santorum: Obama 'not fighting a real war' with ISIS", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Santorum: Obama 'not fighting a real war' with ISIS", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-29T15:50:00.000+03:00", "replies_count": 0, "uuid": "a7beff6b82d10e395d51c0603a64325a3bf86a95"}, "author": "tlejeune@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/blog-briefing-room/243415-santorum-obama-not-fighting-a-real-war-with-isis", "ord_in_thread": 0, "title": "Santorum: Obama 'not fighting a real war' with ISIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 29, 2015, 08:50 am Santorum: Obama 'not fighting a real war' with ISIS Getty Images \nGOP presidential candidate Rick Santorum on Friday bashed President Obama’s strategy against the Islamic State in Iraq and Syria (ISIS) as feckless and called to “double or triple” American boots on the ground fighting the terrorist group. \n“This is a public relations war that the president is fighting, he’s not fighting a real war,” Santorum said on MSNBC’s “Morning Joe,” asserting that the majority of coalition pilots return from missions without dropping their bombs. \n“We aren’t doing any kind of substantial damage in the air against ISIS; we have to step up the bombing campaign and you can’t do that unless you have more boots on the ground.\" ADVERTISEMENT The former Pennsylvania senator said that more ground troops are necessary in order to help coordinate existing forces and properly target the enemy. He added on CNN’s “New Day” that “ISIS is winning this war, regardless of what this administration says.”\n“I’m not talking about a massive invasionary force, but many of the generals who have commented on this have suggested that we have to double or triple the 3,000 we have there on the ground right now to provide effective support for those that are fighting,” he said on MSNBC. \n“If we don’t start winning the war against ISIS, my fear is that we are going to see casualties here in the United States.” \nSantorum, who came in second during the 2012 GOP presidential nomination battle, jumped into 2016 as a significant underdog despite serving two terms in each the House and Senate, representing Pennsylvania. He rose to chair the Senate Republican Conference. \nHe’s currently polling toward the back of the pack and needs to up his support in order to make it into the top 10 and qualify for the first round of debates in August. But Santorum touted his national security chops as an advantage for him over the field that largely includes governors or single-term senators. \n“We have a very different message than anyone else that’s in this Republican field,” he said on CNN. \n“We have experience that nobody has on national security. That’s something critically important — I think going up against a former secretary of State with a candidate with no national [security] experience is a prescription for disaster for a Republican Party when national security issues are going to be very, very important.”", "external_links": [], "published": "2015-05-29T15:50:00.000+03:00", "crawled": "2015-05-29T21:57:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}