{"organizations": [], "uuid": "e36273f708bb59fb56bae58634256aca53cb7174", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/getty-2014-05-05-obama_michelle-1.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/241553-michelle-obama-speaks-of-emotional-toll-of-being-first-black", "country": "US", "title": "Michelle Obama speaks of emotional toll of being first black first lady", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Michelle Obama speaks of emotional toll of being first black first lady", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-10T01:25:00.000+03:00", "replies_count": 0, "uuid": "e36273f708bb59fb56bae58634256aca53cb7174"}, "author": "Elise Viebeck", "url": "http://thehill.com/blogs/blog-briefing-room/news/241553-michelle-obama-speaks-of-emotional-toll-of-being-first-black", "ord_in_thread": 0, "title": "Michelle Obama speaks of emotional toll of being first black first lady", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 09, 2015, 06:25 pm Michelle Obama speaks of emotional toll of being first black first lady Getty Images Michelle Obama gave a candid view Saturday of the challenges and emotional toll of being the country’s first black first lady. Obama, speaking to graduates at Tuskegee University in Alabama, described insensitive media questions and derogatory remarks from political pundits that she said have kept her up at night. “You might remember the on-stage celebratory fist bump between me and my husband after a primary win that was referred to as a ‘terrorist fist jab,’ ” she said. ADVERTISEMENT “And over the years, folks have used plenty of interesting words to describe me. One said I exhibited ‘a little bit of uppity-ism.’ Another noted that I was one of my husband’s ‘cronies of color.’ Cable news once charmingly referred to me as ‘Obama’s Baby Mama.’ ” Obama said she was subjected to a different set of expectations on the campaign trail in 2008 compared with other candidates’ wives. “ ‘What kind of First Lady would I be? What kinds of issues would I take on?’ … The truth is, those same questions would have been posed to any candidate’s spouse,” she said. “But, as potentially the first African-American First Lady, I was also the focus of another set of questions and speculations; conversations sometimes rooted in the fears and misperceptions of others. Was I too loud, or too angry, or too emasculating? Or was I too soft, too much of a mom, not enough of a career woman?” In the end, she said, she realized all the negativity was just “noise.” Obama encouraged the graduates of Tuskegee, a historically black university, to overcome adversity and discrimination by staying “true to the most real, most sincere, most authentic parts of yourselves.” People “will make assumptions about who they think you are based on their limited notion of the world,” she said. “My husband and I know how frustrating that experience can be. We’ve both felt the sting of those daily slights throughout our entire lives. … And all of that is going to be a heavy burden to carry.” “But,” she said, “those feelings are not an excuse to just throw up our hands and give up. They are not an excuse to lose hope. To succumb to feelings of despair and anger only means that in the end, we lose.” Tags:", "external_links": [], "published": "2015-05-10T01:25:00.000+03:00", "crawled": "2015-05-10T01:40:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}