{"organizations": [], "uuid": "0afa6ee4788da0f70e2e9c9953e401f8dc9c6907", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/newtgingrich_getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/243032-gingrich-obama-learning-to-work-with-gop", "country": "", "title": "Gingrich: Obama 'learning' to work with GOP | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Gingrich: Obama 'learning' to work with GOP | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-24T14:18:00.000+03:00", "replies_count": 0, "uuid": "0afa6ee4788da0f70e2e9c9953e401f8dc9c6907"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/243032-gingrich-obama-learning-to-work-with-gop", "ord_in_thread": 0, "title": "Gingrich: Obama 'learning' to work with GOP | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 24, 2015, 07:00 am Gingrich: Obama 'learning' to work with GOP By Jordan Fabian Getty Images \nFormer House Speaker Newt Gingrich (R-Ga.) is offering rare — though measured — praise for President Obama, saying he is figuring out how to work with a Republican Congress. \n“I think he’s learning,” Gingrich said during a radio interview with John Catsimatidis that will air Sunday. “All of a sudden, you’re seeing an outreach to [Senate Majority Leader] Mitch McConnell. You’re seeing a whole range of things happen that you and I would not have expected.” ADVERTISEMENT Gingrich’s praise comes after the Senate passed a bipartisan trade package that’s at the top of Obama’s second-term agenda.\nThe White House and McConnell (R-Ky.) worked closely to pass the measure, which is also a priority for congressional Republican leaders but was opposed by Senate Minority Leader Harry Reid (D-Nev.) and most Democrats. \n“Now that the Republicans have the Senate, and he has no place to hide, he doesn’t have Harry Reid, the Senate Democratic leader, to hide behind,” Gingrich said. \"And maybe to some extent, the president is learning the reality of what he’s dealing with.” \nAfter years of open hostility, Obama and McConnell have even said nice things about one another in recent weeks, raising hopes for future cooperation on must-pass issues. \nGingrich suggested his own collaboration with then-President Bill Clinton, on issues such as welfare reform and a balanced budget, could serve as a model for Obama and McConnell. \n“Bill Clinton and I found a way to work for the country,” Gingrich said. “Both of us recognized that the country was more important than we were … We had an obligation to absolutely find a way to work for the country.” \nGingrich, who ran a failed bid for president in 2012, has been deeply critical of Obama in the past. Ahead of the campaign, Gingrich said the president’s actions could only be understood as “Kenyan, anti-colonial behavior.” \nWhile he looks fondly upon his relationship with Bill Clinton, he recently said Hillary Clinton would be a worse president than Obama. \n“I think in the end, while Obama is a radical, and I obviously think he is very dangerous on foreign policy because he is so incompetent, he is not venal and he doesn’t corrupt the entire system,” Gingrich had said in an interview with T he New York Times . \n“Having the Clintons back in the White House would be like having a very bad mayor running a very corrupt city,\" Gingrich added. Tags: ", "external_links": [], "published": "2015-05-24T14:18:00.000+03:00", "crawled": "2015-05-24T14:18:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}