{"organizations": [], "uuid": "a9f9ae22c0eaa841b95ce7dea87f0a7acda33bd2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2252406/images/o-MOTHERHOOD-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/kristine-holmgren/no-more-angry-mothers-emb_b_7215318.html", "country": "US", "title": "No More Angry Mothers; Embracing Accessible Abortion and Affordable Contracpeiton | Kristine Holmgren", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "No More Angry Mothers; Embracing Accessible Abortion and Affordable Contracpeiton | Kristine Holmgren", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-06T23:17:00.000+03:00", "replies_count": 0, "uuid": "a9f9ae22c0eaa841b95ce7dea87f0a7acda33bd2"}, "author": "Kristine Holmgren", "url": "http://www.huffingtonpost.com/kristine-holmgren/no-more-angry-mothers-emb_b_7215318.html", "ord_in_thread": 0, "title": "No More Angry Mothers; Embracing Accessible Abortion and Affordable Contracpeiton | Kristine Holmgren", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Arlene (not her real name) was thirteen-years-old, pregnant and morose when her mother Betty (not her name either) dragged her to church for the first time.\nThe girl was out of control, Betty said. Sure - nobody expects a perfect child. Especially when she gets into the slutty teen years.\nBut Arlene was off the chart.\nSneaking out of the trailer court in the middle of the night, smoking dope and skipping school. Hell -- even her own grandmother hated being around her.\nAnd we know that's not normal.\nThe baby was fathered by some married thirty-something man. He'd been sniffing around Arlene for over a year.\nThank god the bum agreed to dump his no-good wife, step up and \"do the right thing.\"\nProblem was, Arlene wanted none of it.\n\"Will you pound some sense in her?\" Betty asked. \"Remind her she's a sinner. She's lucky he'll have her. Tell her to strike while the iron's hot.\"\nI had another plan.\nI advised an abortion for Arlene and psychiatric help for her mother.\n\"Abortion is murder!\" Betty shrieked. \"You pile sin on sin and call yourself a pastor?\"\nAnd so it came to pass that an unwanted child brought an unwanted baby to a cold, cold world.\nAnd another angry mother was spawned.\nThe roots of anger.\nI think of Arlene every Mothers Day; the Sunday set-aside to glorify the virtues of rightous motherhood.\nI wince when the clergy read aloud the words from Proverbs, and remind us all that good women have children \"who rise up and call her blessed.\"\nI say a prayer for Arlene.\nAnd I remember -- angry mothers are everywhere.\nIf you were born before women had access to safe, affordable, accessible abortion, chances are your mother was an angry mother.\nI was raised by one. Sure -- my mom loved me; but she was over 40 when I was born - and I was the youngest of four children.\nMy oldest brother was twenty-years-old. My nearest was only thirteen months.\nSo -- I wasn't (how shall I say this?) -- planned.\nSometimes my mom called me her \"baby.\" Most of the time she called me, \"her final mistake.\"\nThere were no illusions of \"righteous\" womanhood in my childhood home. In my family, we knew the truth. Raising kids was no picnic.\n\"Don't you grow up and have babies for me,\" my mom said. \"You're a smart girl. And you got bigger fish to fry.\"\nMy mother might have been angry, but she raised me to be educated, employed and free.\nAnd I wasn't alone.\nWas anyone paying attention?\nMy generation was nurtured by women alert to the limits imposed on them. Our mothers trained us to insist on equal pay for equal work and autonomy over our futures.\nThat's why today is such a mystery to so many of us.\nI belong to a gang of women who fought for legal, accessible abortion, affordable contraception and the requisite education necessary to make solid, responsible decisions regarding the future.\nAnd sometimes I wonder if anyone was paying attention.\nIn spite of the hard-earned lessons we learned from our frustrated, angry mothers, American women are still vulnerable to poverty and the burden of unwanted childrearing.\nAccording to U.S. Census Bureau statistics, in 2014 approximately 12 million single-parent families were headed by single mothers, struggling to support them.\nOne in 4 of America's children under the age of 18, a total of about 17.4 million boys and girls, live with single mothers.\nAmong those children, over half (52%) live in poverty. One in five are supported through the federal food stamp program.\nAnd I don't understand what's going on.\nAbortion is not a dirty word.\nCould it be an entire generation is hell-bent on ignoring history?\nMy problem is this; I can't forget.\nI remember when every sexual encounter was a dance with destiny and every erotic experience a flirtation with the status of \"skank.\"\nIn those days, we often felt like prey. Every invitation to dinner held an unspoken threat of blatant seduction and the potential ruin of reputations and futures.\nBut - that was a long time ago, for crying out loud.\nThis is now.\nI thought we changed all that. Didn't we?\nIn 1960, with the introduction of the near-perfect oral contraceptive, I thought American women gained a glimpse into a world where every child was a wanted child. Every mother a happy mother.\nI thought we gained the ability to do away with angry motherhood forever.\nThe ability to control our reproduction - the ability to choose - to be free. And when our national abortion laws changed, we saw a future open and wide as the lightyear stars.\nBut hey - I might have been wrong.\nWomen's liberties are like teeth; ignore them and they go away.\nSomewhere along the line, American women learned to call feminists \"feminazis.\" We heard \"abortion is murder\" and didn't bother to correct the lie. We watched young vulnerable girls turn away from the morning after pill, shun the opportunity to abort their unwanted children.\nAnd we said nothing. We stood by while our little sisters stumbled into irretrievable poverty.\nToday, the average woman's access to abortion is limited and shrinking.\nContraception is demonized in our public schools through manipulated interpretations of clinical statistics. The morning after pill is erroneously linked to female death.\nBut - the truth is still out there. Abortion is not murder. The birth control pill is not toxic, dangerous or destructive.\nDetermining our own destinies, planning for our futures, intending and taking responsibility for our children are still the best tactics to build happy, productive lives.\nNo more angry mothers.\nThis Mothers Day, I challenge American women to renew their commitment to responsible, thoughtful motherhood.\nLet's protect our liberties, reclaim safe, accessible abortion and contraception as our birthright.\nThis year - let us commit to a new future and a new promise.\nNo more angry mothers.\nFollow Kristine Holmgren on Twitter: www.twitter.com/KrisHolmgren\nMore: Abortion Civil Rights Feminism Men and Women Mother's Day Freedom Liberty Kristine Holmgren", "external_links": ["https://www.biblegateway.com/passage/?search=Proverbs+31%3A10-31&version=KJV", "http://www.twitter.com/KrisHolmgren", "http://www.tldm.org/News9/ContraceptionDeathOfEmbryo.htm", "http://www.feminist.com/resources/ourbodies/abortion.html", "http://www.census.gov/hhes/families/data/cps2014FG.html", "http://www.census.gov/newsroom/press-releases/2015/cb15-16.html"], "published": "2015-05-06T23:17:00.000+03:00", "crawled": "2015-05-07T01:23:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}