{"organizations": [], "uuid": "204623a1433bbba5761d96186aabd02ea79257c4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2975728/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com//feeds/verticals/green/index.xml", "section_title": "Green - The Huffington Post", "url": "http://www.huffingtonpost.com/noah-greenwald/with-friends-like-the-oba_b_7339268.html?utm_hp_ref=green&ir=Green", "country": "US", "title": "With Friends Like the Obama Administration, Endangered Species Don't Need Enemies", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "With Friends Like the Obama Administration, Endangered Species Don't Need Enemies", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-21T00:11:00.000+03:00", "replies_count": 0, "uuid": "204623a1433bbba5761d96186aabd02ea79257c4"}, "author": "Noah Greenwald", "url": "http://www.huffingtonpost.com/noah-greenwald/with-friends-like-the-oba_b_7339268.html?utm_hp_ref=green&ir=Green", "ord_in_thread": 0, "title": "With Friends Like the Obama Administration, Endangered Species Don't Need Enemies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nFrom gray wolves to Cheat Mountain salamanders, the more than 1,500 endangered species in the U.S. face threats like never before. In addition to the ever-present threat of habitat loss caused by our growing footprint on the planet, species now face growing threats from climate change, invasive species, over-exploitation and pollution. \nGiven the growing magnitude of threat to endangered species, one would think the Obama administration would pull out all the stops to save our precious wildlife heritage. Instead, the administration and its U.S. Fish and Wildlife Service have quietly been rolling out a series of regulatory changes that threaten to cripple the Endangered Species Act, dramatic changes that would never have flown under the Bush administration. \nHere's a breakdown of those policies and why they matter: \nIn July 2014, the administration finalized a policy first conceived under the Bush administration that severely limits when species qualify for endangered species protection. Under the Act, a species qualifies as endangered if it is \"in danger of extinction in all or a significant of portion of its range,\" meaning that a species need not be at risk everywhere it occurs to receive protection. \nThe new policy, however, sets a much higher bar by requiring not only that a species be endangered in a portion of its range, but also that the loss of that one portion threatens the survival of the species as a whole. The policy also specifies that historic portions of a species' range can never be considered significant. \nIf this policy had been in place when the Act was first passed, the bald eagle would never have been protected because although it had been wiped out across much of the lower 48 states, the Pacific Northwest and Alaska had strong populations that were not at risk of extinction. \nMany other species that have similarly been wiped out or are at risk across large parts of the U.S. are sure to be denied protection because of this disastrous policy. Indeed, several already have, including the cactus ferruginous pygmy-owl and American wolverine . \nThe second regulatory change forwarded by the administration severely undermines protections for endangered species' critical habitat. The Endangered Species Act requires protection of critical habitat for all endangered species. The designation of \"critical habitat\" has proven to be an essential tool with species that have designated habitat being twice as likely to be recovering as those without it. \nCritical habitat protects species by prohibiting federal agencies from \"adversely modifying\" -- that is, hurting -- critical habitat for endangered species in actions they fund, permit or carry out. The Obama administration's policy could enable more habitat destruction by redefining \"adverse modification\" as only those actions considered to potentially harm the entirety of a species' designated critical habitat, a change that will give a green light to the many federal actions that destroy small portions of critical habitat. If enacted, the new proposal could allow the proliferation of projects that harm a species' habitat without assurance that the cumulative effects will be taken into account -- a particularly problematic development because the Fish and Wildlife Service already has a dismal record of tracking and limiting cumulative impacts on wildlife. \nThe third regulatory change proposed by the administration earlier this month lets federal agencies, such as the U.S. Forest Service or Bureau of Land Management, off the hook from quantifying or limiting the amount of harm to endangered species allowed under overarching management plans, including regional forest plans, plans for individual national forests, plans for BLM resource areas and many others. \nThis will all but ensure that cumulative impacts from individual timber sales, development projects, oil and gas drilling operations or other projects will never be considered or curbed, increasing the risk that species will be driven to extinction from a death by a thousand cuts. \nThe most recent proposal by the Obama administration limiting the scope of the Endangered Species Act was issued just this week. It would place crippling burdens on citizens filing petitions to protect species as threatened or endangered under the Endangered Species Act, ultimately making it more difficult for imperiled species to get lifesaving protections. \nThe proposed regulations bar petitions seeking protection for more than one species and require petitioners to provide advance notice of the petition to all states in the range of the species; to append any information from states to the petition itself; and to certify that all relevant information has been provided in the petition. \nThis disastrous proposal will not only make it less likely species will get the life-saving protections they need, but it's fundamentally undemocratic, cutting the public out of endangered species management. Many environmental and other statutes allow citizens to petition the federal government for action. This proposal marks the first time that an administration has placed obstacles to citizens filing petitions for federal intervention and thus has the potential to set a very concerning precedent. \nThe Endangered Species Act was passed precisely because states were not doing enough to protect wildlife. In many cases, states remain opposed to protection of species. Forcing citizens to go through these very same states in seeking protection of species runs directly counter to the purpose of the Act. \nIn combination, these policies represent a rollback of endangered species protections that Tea Party Republicans in Congress couldn't hope for in their wildest dreams, yet they're being forwarded by the Obama administration perhaps as an attempt to appease critics of the Act. \nIf this is indeed the intent, it will fail because criticisms from states, industry and others do not come from a desire to see the Act work better but rather from a desire to see protections for endangered species watered down. \nAnd if these changes are implemented, they'll get their wish, effectively undermining the conservation law that has saved not only bald eagles and brown pelicans, but gray wolves, grizzly bears, humpback whales and many more. \nFollow Noah Greenwald on Twitter: www.twitter.com/Noah_Ark_757 More:", "external_links": [], "published": "2015-05-21T00:11:00.000+03:00", "crawled": "2015-05-21T00:43:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}