{"organizations": [], "uuid": "ae5b40a9b8079dbbf387546b42b3021eef8f6519", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/overnights/241823-overnight-finance-obama-dealt-blow-on-trade", "country": "US", "title": "OVERNIGHT FINANCE: Obama dealt blow on trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT FINANCE: Obama dealt blow on trade", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T00:51:00.000+03:00", "replies_count": 0, "uuid": "ae5b40a9b8079dbbf387546b42b3021eef8f6519"}, "author": "mmali@thehill.com (Kevin Cirilli)", "url": "http://thehill.com/policy/finance/overnights/241823-overnight-finance-obama-dealt-blow-on-trade", "ord_in_thread": 0, "title": "OVERNIGHT FINANCE: Obama dealt blow on trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT FINANCE: Obama dealt blow on trade By Kevin Cirilli - 05/12/15 05:51 PM EDT \nWe've got every inch covered of Sen. Shelby's proposal... Keep reading... \nTOMORROW STARTS TONIGHT: SENATE DEMS REVOLT AGAINST OBAMA ON TRADE. Alexander Bolton for The Hill: \"Senate Democrats on Tuesday delivered a stinging blow to President Obama's trade agenda by voting to prevent the chamber from picking up fast-track legislation.\" \n1.) WHAT HAPPENED, via Bolton: \"A motion to cut off a filibuster and proceed to the trade bill fell short of a 60-vote hurdle, 52-45. Sen. Tom Carper (Del.) was the only Democrat to back it. Senate GOP Leader Mitch McConnell (Ky.) switched his vote from yes to no to reserve his ability to return to the measure at a later date... It could return in the next two weeks but Tuesday's setback means it will be very difficult to pass trade legislation before the Memorial Day recess.\" ADVERTISEMENT 2.) WARREN-WING VICTORY... FOR NOW, via Bolton: \"Fast-track is a top legislative priority for the White House, but it has run into significant Senate opposition that has been led by Sen. Elizabeth Warren (D-Mass.). It faces even more opposition from Democrats in the House, and the surprise Senate failure will raise doubts about whether the legislation will make its way through Congress. Labor unions and other left-leaning groups have declared war on the fast-track bill, which they argue would ship jobs overseas.\"\n3.) WHITE HOUSE: WE LOST THE TRADE BATTLE -- NOT THE WAR , via White House press secretary Josh Earnest: \"It is not unprecedented for the U.S. Senate to encounter procedural snafus... We're going to continue to work through these challenges... I would urge you to withhold judgment about the president's persuasion ability ... until we've had a chance to advance this legislation.\" Bolton's story: http://bit.ly/1L0fx9o \n-- Meanwhile... Sen. Sherrod Brown (D-Ohio) suggested it was sexist that Obama criticized Warren to Yahoo News by using her first name, \"Elizabeth.\" Story, via Jesse Byrnes: http://bit.ly/1JFP3Je \nTHIS IS OVERNIGHT FINANCE, and wow -- what a day. Make it count. Tomorrow is Wednesday. Tweet: @kevcirilli ; email: kcirilli@thehill.com ; and subscribe: http://thehill.com/signup/48 Back to work... \nSHELBY PROPOSES SWEEPING FINANCIAL OVERHAUL -- BIGGEST BILL SINCE DODD-FRANK. My latest: Senate Banking Committee Chairman Richard Shelby (R-Ala.) unveiled a sweeping plan Tuesday to restructure financial regulations in what would be the biggest overhaul of banking rules since the 2010 Dodd-Frank Wall Street Reform law. Liberals like Sen. Sherrod Brown (D-Ohio), the top Democrat on the committee, are panning it as a Dodd-Frank rollback that benefits Wall Street. My quick hit: http://bit.ly/1Hc9pJL \nQuick Qs... \n1.) What's in the bill? The centerpiece of the 216-page proposal would change how the Financial Stability Oversight Council designates an institution as a systemically important financial institution (SIFI), thus subjecting them to more federal supervision. The bill would increase the SIFI-designation threshold from $50 billion in assets to $500 billion, though the bill would give regulators leeway to designate exceptions. Bill summary: http://1.usa.gov/1cto60c Bill text: http://1.usa.gov/1HeXtd0 \n-- BIZ COMMUNITY: WE LIKE IT. \"[It] appropriately addresses the repercussions of the 'one-size-fits-all' framework implemented by [Dodd-Frank],\" said Richard Hunt, president and CEO of the Community Banker's Association. Tom Quaadman, vice president of the U.S. Chamber of Commerce's Center for Capital Markets Competitiveness, dubbed it \"an important step forward in addressing the unforeseen consequences of Dodd-Frank.\" \n2.) Can Shelby get a vote? Nobody knows yet. He's going to need at least six Democrats in the Senate to clear the 60-vote procedural hurdle that can get him a vote. GOP committee aides tell me that they're trying to get a vote before August and the markup is scheduled for next week. So it all comes down to moderate Democrats like Sens. Heidi Heitkamp (N.D.), Joe Donnelly (Ind.), Jon Tester (Mont.) and Mark Warner (Va.). \n-- QUOTABLE, HEITKAMP: \"This bill was drafted without any input from Democratic Senators on the committee, including ones like myself who have long pushed for policies that would provide needed relief for community banks and small financial institutions. I'm still reviewing the bill, but I hope we can actually work together to negotiate strong, bipartisan policies that best support community banks and credit unions.\" \n-- QUOTABLE, WARNER spokeswoman Rachel Cohen: \"After having an opportunity to review the text for the first time today, Senator Warner says it appears at first glance to be a significant overreach. Senator Warner thinks that is a shame, because there are a number of commonsense, bipartisan fixes that Democrats and Republicans alike want to enact.\" \n3.) What about the Fed? Shelby's bill signals that lawmakers are not at all satisfied with the lack of transparency at the Federal Reserve. Surprisingly, this section of the nearly 216-page bill is the least controversial. He wants to make Fed policymakers submit quarterly -- instead of semiannual -- reports to Congress. He wants the Fed Board to have to vote on any settlement of an enforcement action of more than $1 million. And -- here's a kicker -- it's in this portion that Shelby even throws a political crumb to Warren by adding a provision that she championed during a recent hearing: the bill would only let Fed governors hire a maximum of four staffers. Many have raised concerns about Wall Street flooding the Fed with junior and senior level staffers. He'd also establish a panel to investigate the Fed and make the New York Fed president a presidential appointee, thus subject to Senate confirmation. That's an idea championed by Sen. Jack Reed (D-R.I.). \n-- WHAT SHELBY DIDN'T DO: His provisions are hardly as controversial as Sen. Rand Paul's (R-Ky.) \"Audit the Fed\" proposal, which is a longshot at best for becoming law. Shelby also didn't include any \"mechanical rules\" (i.e. The Taylor Rule) that would require Fed officials to use certain formulas when crafting monetary policy. Several conservative thought-circles advocate for this approach, but Democrats oppose it. \n-- IN HIS OWN WORDS , via Shelby: \"Our goal is to provide some relief from Dodd-Frank.\" Shelby gave the big interview to Bloomberg. Watch the video : http://bloom.bg/1EyFisJ \nNeed air... DAYS UNTIL EX-IM SHUTS DOWN: 47. My latest: House Majority Leader Kevin McCarthy (R-Calif.) said he and Speaker John Boehner (R-Ohio) disagree over the Export-Import Bank. McCarthy wants to kill the bank, while Boehner argues it should be extended beyond June 30. \"This is a place the speaker and I disagree upon,\" McCarthy told The Daily Signal, which is funded by Heritage Foundation. \"I think this is an opportunity to wind down the bank because I think private sector can fill that void.\" http://bit.ly/1cPRTkK ELIZABETH WARREN IN HARRY POTTER? Annie Linskey for The Boston Globe : \"British author JK Rowling name-checked Elizabeth Warren on Monday morning, setting Twitter ablaze with theories that the Harry Potter author was dipping into politics on this side of the pond. Responding to a reader inquiry on Twitter, the author of the Harry Potter series revealed the full name of a minor character heretofore known only as 'Moaning Myrtle' to be 'Myrtle Elizabeth Warren.' \n-- ROWLING DENIES PLAYING POTTER POLITICS: \"Nothing to do with the United States Elizabeth Warren I hasten to add! 'Elizabeth' is just one of those classic British middle names,\" Rowling tweeted. Read the Tweet : http://bit.ly/1IzurDM \n-- WARREN DECLINES COMMENT ON POTTER-GATE, via Linskey: \"A spokeswoman for the real Elizabeth Warren didn't respond ... to our cheeky request for comment. Perhaps she was in the loo.\" Story, via The Globe : http://bit.ly/1G42iEx \nNOTABLE, via Shelby's Facebook: \"Today marked the 1,943rd county visit of my career as I completed my annual statewide tour of Alabama's 67 counties. It was a pleasure to hear from my constituents and to learn more about the issues that are most important to the people of Alabama.\" http://on.fb.me/1IzvlA7 \nLet's drink... \nSHOT , via Chris Cillizza for the Washington Post : \"Welcome to day 29 of the Hillary Clinton 2016 presidential campaign! In those 29 days -- including April 12, the day she announced, and today -- Clinton has taken a total of eight questions from the press. That breaks out to roughly one question every 3.6 days.\" http://wapo.st/1PeyA5B \nCHASER , via Republican presidential candidate Carly Fiorina's campaign in a memo to reporters: \"The results are in: Carly has actually answered 322 questions since her announcement on Monday... This is in stark contrast to many other candidates – and most especially to Hillary Clinton.\" \n2016 WATCH - - CHRISTIE: CUT TAXES, via Bernie Becker: \"Gov. Chris Christie of New Jersey pushed Tuesday to broadly overhaul the tax code, laying out details in what's likely to be a key part of the 2016 presidential campaign.\" http://bit.ly/1Hfo8q3 \nBANKS BRACE FOR BERNIE, via me: Wall Street is worried that Sen. Bernie Sanders's vigorous calls for banking industry reform will pull Hillary Clinton to the left, as the two presidential candidates battle for the 2016 Democratic nomination. Sanders (I-Vt.) last week unveiled new legislation designed to break up the nation's largest banks, declaring that \"if an institution is too big to fail, it is too big to exist.\" Though it stands virtually no chance of passage in the GOP-controlled Congress, the bill has industry leaders fretting. \n-- BIZ COMMUNITY: \"The prospects of it becoming law are nil,\" said one banking lobbyist, who described Sanders's legislations as \"shrill, bombastic and misaligned... But we care about whether this impacts Hillary and whether she'll try to pander to the far left.\" Business and banking groups, and their lobbying forces on K Street, are quickly lining up against the legislation. \n-- REP. BRAD SHERMAN (D-Calif.), who is sponsoring similar legislation in the House, said: \"This isn't about an election cycle... I am much more interested in what Hillary Clinton does as president in office than in a campaign. Campaigns are fun but governing is what matters... I'm hoping that some time in the next few years we will have 'too big to fail is too big to exist' policy either by using existing laws or by passing new statutes.\" Story: http://bit.ly/1PEtOt7 \nONLY IN WONK-WORLD: Donald Trump Tweeted on Tom Brady: \"They had no definitive proof against Tom Brady or #patriots. If Hillary doesn't have to produce Emails, why should Tom? Very unfair!\" \n-- WH pressures Brady, via Jordan Fabian: White House press secretary Josh Earnest said he expects New England Patriots quarterback Tom Brady to be aware of his role-model status as he deals with the fallout from 'Deflategate.' 'As he confronts this particular situation, he will be mindful of the way he serves as a role model' for children, Earnest told reporters on Tuesday. Earnest noted that 'people around the world,' especially boys, look up to Brady as a positive example on and off the football field.\" http://bit.ly/1RAWd76", "external_links": [], "published": "2015-05-13T00:51:00.000+03:00", "crawled": "2015-05-13T13:14:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}