{"organizations": [], "uuid": "15aba7e00e8e3a1859de7543694b93afddf97676", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/dave-johnson/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/blog.xml", "section_title": "Business Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/dave-johnson/obama-to-visit-nike-to-pr_b_7233118.html", "country": "US", "title": "Obama To Visit Nike To Promote TPP. Wait, NIKE? Really? | Dave Johnson", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama To Visit Nike To Promote TPP. Wait, NIKE? Really? | Dave Johnson", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-07T19:25:00.000+03:00", "replies_count": 0, "uuid": "15aba7e00e8e3a1859de7543694b93afddf97676"}, "author": "Dave Johnson", "url": "http://www.huffingtonpost.com/dave-johnson/obama-to-visit-nike-to-pr_b_7233118.html", "ord_in_thread": 0, "title": "Obama To Visit Nike To Promote TPP. Wait, NIKE? Really? | Dave Johnson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama is scheduled to visit Nike's Oregon headquarters on Friday to promote the Trans-Pacific Partnership (TPP). Yes, Nike - a company that grew to billions by outsourcing jobs to overseas sweatshops, a company that sets up P.O.-box subsidiaries in tax havens to avoid paying U.S. taxes, a company that uses threats to extort tax breaks from its \"home\" state.\nPhil Knight, head of Nike, is now worth $23 billion because America's trade policies encourage companies like Nike to create and move jobs outside of the U.S. The 23rd-richest American is one more symbol of the kind of inequality that results from outsourcing enabled and encouraged by these trade policies. Workers here lose (or never get) jobs; workers there are paid squat; a few people become vastly, unimaginably wealthy.\nMeanwhile Massachusetts-based New Balance struggles to manufacture its athletic footwear in the U.S. TPP will remove tariffs on imported Vietnamese and Malaysian shoes, benefiting Nike and wiping out New Balance's efforts to maintain its manufacturing here.\nThere will be an anti-fast track/TPP rally outside of Nike's headquarters in Beaverton, Ore., on Friday. (See below for details.)\nNike? Really?\nNike is famous for using cheap (even sweatshop) labor outside of the U.S. to gain an advantage over companies that want to manufacture inside the U.S. They bring their product back here to sell at a high price, and then use various tax haven schemes to avoid paying taxes on its high U.S. profits.\nThe Wall Street Journal took a look at Nike last year, in \" Inside Nike's Struggle to Balance Cost and Worker Safety in Bangladesh ,\" finding that \"its effort to clean up its act in the developing world, which began about 20 years ago, remains a work in progress.\" Nike was a pioneer in contracting \"cheap labor\" from outside the U.S.:\nNike was founded in 1964, in part on the premise that it could produce quality footwear at lower costs by using cheap labor at overseas factories--an idea founder Phil Knight came up with while attending Stanford Business School. At the time, only 4 percent of U.S. footwear was imported. Today, the figure is 98 percent.\nNike became known for the terrible wages and working conditions \"globalization\" was providing for non-U.S. labor, while forcing U.S. wages and benefits down.\nBy the 1990s, conditions at the foreign factories making Nike gear had become an issue, making the company a target of protests about the perils of globalization. Mr. Knight and other top executives initially took the position that because it didn't own the factories, it wasn't responsible for safety problems or labor conditions, according to current and former executives.\n... The issue came to a head in 1996, when Life magazine published a story titled \"Six Cents an Hour,\" with a photo of a boy sewing Nike soccer balls. Mr. Knight groused privately that the scene was staged because soccer balls are stitched and shipped deflated and the balls on the cover were inflated, former Nike executives say.\nWith protests making noise over the exploitation of Nike's offshore cheap labor, \"brand erosion\" was starting to cost money.\nAt one point, a manufacturing executive wrote a multimillion-dollar figure on a piece of paper and told Mr. Knight that was how much Nike stood to lose through brand erosion, according to people at the meeting. The Nike spokeswoman says Mr. Knight disputes that such a meeting took place.\nTwo years later, the CEO vowed in a speech in Washington to root out child labor.\nThe Wall Street Journal story is about Nike working to clean up their act to keep their brand from further erosion while other companies they have to compete with went ahead and used the most exploitative, cheapest contractors they could find. What a great, uplifting story about \"globalization.\"\nIs this really the sort of company Obama wants to use as the face of what the TPP will bring? Nike?\nHere are a few facts and figures:\nNike earned $27.8 billion in revenue in 2014. Nike's Phil Knight is the 23rd-richest American , with $23 billion he made from cheap non-U.S. labor making high-priced shoes. His 1962 Stanford Business School thesis was on the profitability of offshore low-wage production of goods to be sold in the U.S., a trend that has gutted millions of good-paying American jobs. Nike \"employs\" (mostly through contractors ) more than 1 million workers. Fewer than one percent are U.S. employees. All Nike shoes are produced outside of the U.S. In 2013, Nike had contracts with 68 factories in the U.S., none making shoes. Those U.S.-based factories employed 13,922 employees. Nike cut one-third of its U.S. production contracts and now has 8,400 U.S. workers contracted for production. What About New Balance?\nWhile the President visits Nike, New Balance is struggling to be able to keep some of its manufacturing in the U.S. Currently New Balance makes shoes in five factories in the U.S. Their executives say if TPP passes, lower tariffs on shoes made in places like Vietnam will force them to close their U.S. factories.\nNike is, of course, lobbying heavily for this. Marc Belisle, in \" Brave New World Trade: Pfizer, Nike vs. Labor in TPP Fight, Lobbying Records Suggest \" at Reverb Press, writes:\nNike's interest in this is pretty brutally obvious. The company hilariously suggested that it wants to reduce trade barriers so that it can invest more in \"innovation.\" You mean like putting air pumps and lights on sneakers? Give us a break, Nike! The TPP would give Nike unfettered access to the rapidly expanding footwear sweatshops in Vietnam and Malaysia, and would allow them to sell those shoes in the U.S. without tariffs. In Vietnam, the minimum wage is 56 cents an hour, according to Sen. Bernie Sanders (I-Vt.).\nIf the President gets his way and TPP passes, the tariff on non-U.S.-made (Vietnam) shoes will end and New Balance - like so many other companies struggling to manufacture inside the U.S. - will have no choice but to end its U.S. manufacturing operations. Meanwhile Nike, already manufacturing in Vietnam and Malaysia and currently selling shoes that cost $10 to make for over $100, will gain even more of an advantage, which obviously will not be passed on to consumers. If you are able to get a certain price for a product, why reduce it?\nThe Bangor Daily News has the New Balance story, in \" New Balance: 'It's literally us against every other athletic shoe manufacturer in the world' \":\nThe 100-year-old company is the only athletic footwear manufacturer that still produces some of its shoes (about 25 percent) in the United States. But that homegrown story is threatened by a free trade deal the Obama administration is negotiating with Vietnam and other Pacific countries ... At issue are tariffs the United States imposes on imported athletic shoes from Vietnam. New Balance depends on as many 10 long-standing tariffs on certain footwear products to remain competitive, according to LeBretton.\nVietnam, along with New Balance competitors such as Nike, which manufactures all its shoes overseas, want the tariffs removed as part of the free trade agreement, which is known as the Trans-Pacific Partnership.\nNew Balance claims if those tariffs are removed, the company no longer would be competitive.\nThis is just one example of how even more American workers would lose their jobs if TPP passes. But TPP would not require Nike to pay its workers in Vietnam more and it does not mean Vietnamese workers will be able to buy more U.S. goods. These workers are not even paid enough to buy the shoes they make, much less buy other U.S. exported goods.\nThe Obama administration says there are special \"progressive\" labor rights provisions for Vietnam, in recognition of its bad labor conditions. The administration did the same thing for Colombia, and in the three years that those special rules have been in place, more than 100 union organizers have been assassinated and another 1,000 more have been threatened with violence.\nTax Schemes\nNike engages in various tax-haven schemes to avoid paying U.S. taxes. Citizens for Tax Justice, in \" Nike's Tax Haven Subsidiaries Are Named After Its Shoe Brands \" (2013) explains one tax-haven scheme:\nNike reports that its cache of \"permanently reinvested offshore profits\" ballooned from $5.5 billion to $6.7 billion in the past year -- meaning that the company moved $1.2 billion of its profits offshore. Nike also discloses that if it were to pay U.S. taxes on its offshore stash, its federal tax bill would be $2.2 billion, a tax rate of just under 33 percent. Since the federal income tax is 35 percent minus any taxes corporations have paid to foreign jurisdictions, it's easy to deduce that Nike has paid virtually no tax on its offshore profit hoard.\nNike's long list of offshore subsidiaries includes twelve shell companies in Bermuda alone, ten of which are named after one of Nike's own shoes! To wit: Air Max Limited, Nike Cortez, Nike Flight, Nike Force, Nike Huarache, Nike Jump Ltd., Nike Lavadome, Nike Pegasus, Nike Tailwind and Nike Waffle!\nWhy does Nike want to pretend that its product names live in Bermuda? To avoid paying taxes, of course.\nBusted! So CTJ looked again in 2014 :\n... some of the biggest offshore tax avoiders have discreetly scaled back their disclosure of tax haven subsidiaries in recent years. Unfortunately, a loose accounting rule allows companies to get away with only disclosing subsidiaries that are \"significant.\" So it was no big surprise that when Nike released its 2014 financial report late last Friday, fully half of the Bermuda subsidiaries they company reported owning last year had disappeared from their subsidiary list.\nSo what happened to the missing Nike subsidiaries? It's possible that they were sold. But it's also possible that the company simply hopes it can get away with not disclosing this potentially embarrassing information going forward.\nBut that's just one kind of tax scheme. The United Kingdom's Sunday Times found another, which they reported in 2014's \" Nike's tax trail: Sports giant's ploy sidesteps Revenue \":\nNike has been funneling millions of pounds generated from sales of Manchester United kit through its Dutch division, helping the sportswear giant sidestep the British taxman.\nThe American company, which sponsors the England football team and tennis stars such as Maria Sharapova, last year siphoned £8.3m from Britain to a sister company in Hilversum, Holland.\nThe royalty payment slashed the reported profits at Manchester United Merchandising Limited, a Nike subsidiary that handles sales of Red Devils-branded goods in Britain.\nHere is how this sort of tax scheme works. A Nike \"subsidiary\" in the Netherlands \"owns\" the rights to \"license\" something to Nike in other countries. They charge a bunch for the right to use the \"license.\" This way much of the profit from a sale is funneled to Holland, so the profits are not taxed where they are really made. You get the idea.\nNike also uses extortion to force its home state Oregon to give tax breaks. Next City has the story, in \" Nike Made $25 Billion Last Year, Still Got a Tax Break from Oregon \":\nAmerica has a subsidies problem . We've looked at the rising amount of money poured into megadeals and railed against Apple and Google , companies so flush with cash they shouldn't be considered for a tax break in the first place. But no American company ( non-sports-franchise division ) is fleecing taxpayers worse than Nike.\nThe global shoe brand -- which made $25.3 billion in revenue during fiscal year 2013 -- threatened to leave Oregon , where it has deep roots in the community, without tax breaks. This past December the state passed a bill that will only tax Nike on a portion of its sales over the next 30 years. The deal, which should total $2 billion by Good Jobs First's calculations, is contingent on Nike investing $150 million in a project that will produce 500 jobs. That's $4 million per job.\n... \"Nike put an economic gun to the governor's head and said you either guarantee the law won't change or we'll go elsewhere,\" Chuck Sheketoff, executive director of the Oregon Center for Public Policy, told the Wall Street Journal in December. \"As it is Nike is paying 90 percent less than its fair-share in taxes.\"\nSome argue that whatever Americans companies do overseas is good for the U.S. They say it makes \"us\" richer so \"we all\" benefit. But if the company avoids U.S. taxes, how is it good for the U.S.? If one person ends up with $23 billion, how is that good for the rest of us? A few already-wealthy people get richer; the rest of us get poorer when they outsource the jobs or threaten to outsource to force wage and benefit cuts. They don't pay taxes, so we lose our schools, our infrastructure is not maintained, our streets are less safe.\nQuestions For Obama\nGaius Publius, writing at Down With Tyranny, in \" Obama Using Nike to Sell TPP; Does Nike Have Access to TPP Drafts? \" has a couple of questions for Obama's Nike appearance.\nTwo Questions for Mr. Obama When He Speaks at Nike\nSo if anyone has a press seat at Obama's Nike speech, I suggest asking two simple questions: Do Nike's lobbyists or other representatives have access to TPP draft text? If so, why can't the American people see it before Fast Track is voted on? I'd love to see the answers. So would Elizabeth Warren , I'm sure.\nDoes Phil Knight, 23rd richest American, who got rich from manufacturing outside the U.S., who is pushing hard for TPP because it will reduce tariffs on the shoes they already import (and wipe out New Balance's American manufacturing), whose company uses tax havens and schemes to avoid paying U.S. taxes and extorts tax breaks from its home state, have access to advance copies of TPP? Because the rest of us sure don't. Yet the president wants Congress to vote on fast track now , pre-approving TPP before any of We the People can find out what is in it. That just isn't right .\nYou can be for \"trade\" without being for the Trans-Pacific Partnership and the job-destroying, \"NAFTA-model,\" corporate-dominated process that is used to pass these trade deals.\nIn Nike President Obama may well have found the perfect company to visit to promote yet another job-destroying, billionaire-enriching trade deal.\nRally Outside Nike's Headquarters\nThere will be a rally Friday at 9 a.m. Pacific outside of the Nike headquarters in Beaverton. The following is from the Oregon Fair Trade Campaign :\nFast Track for the TPP? Just Don't Do It!\nRALLY FOR OREGON JOBS\nOutside President Obama's Trade Speech\nNike Headquarters • Beaverton, OR\nFriday, May 8 • 9:00 a.m.\nPresident Obama is visiting Oregon to push Fast Track for the job-killing Trans-Pacific Partnership (TPP) Free Trade Agreement. On Friday, he'll be at Nike headquarters to give the biggest trade speech of his presidency. With less than 1 percent of its more than 1 million production jobs located in the United States, Nike perfectly depicts America's lost-jobs and low-wage future under the TPP. Join us to tell the President, No to Fast Track and the TPP!\nAction: Fast Track and TPP protest at Nike during the President's trade speech\nTransportation: Portlanders should meet in the Westminster Church parking lot, 1624 NE Hancock at 8:00 a.m. A bus will take us to Nike headquarters in Beaverton for our demonstration.\nOn the way back we'll stop by Rep. [Suzanne] Bonamici's Beaverton office to tell her: \"Don't Walk Away From Jobs & the Environment!\" If you can, bring a pair of old shoes to leave at her office as a reminder! We'll be back by 11:30 a.m.\nFor more information visit OregonFairTrade.org/fair-trade-events/\nQuestions? Contact robyn@oregonfairtrade.org\n----\nThis post originally appeared at Campaign for America's Future (CAF) at their Blog for OurFuture . I am a Fellow with CAF. Sign up here for the CAF daily summary and/or for the Progress Breakfast . Click to follow me on Twitter. --- Click to follow CAF on Twitter.\nFollow Dave Johnson on Twitter: www.twitter.com/dcjohnson\nMore: Trans Pacific Partnership TPP Trade Barack Obama Nike", "external_links": ["http://www.forbes.com/profile/phil-knight/", "http://www.ctj.org/taxjusticedigest/archive/2013/07/nikes_tax_haven_subsidiaries_a.php", "http://www.taxjusticeblog.org/archive/2014/07/nikes_disappearing_tax-haven_s.php", "http://bangordailynews.com/2013/07/30/business/new-balance-its-literally-us-against-every-other-athletic-shoe-manufacturer-in-the-world/", "http://www.ourfuture.org/", "http://ourfuture.org/progressivebreakfast", "http://nextcity.org/equityfactor/entry/a-neighborhood-level-contrast-to-field-of-dreams-development", "http://nextcity.org/equityfactor/entry/the-escalating-cost-of-megadeals", "http://www.wsj.com/news/articles/SB10001424127887323463704578497290099032374", "http://downwithtyranny.blogspot.com/2015/04/warren-tells-obama-to-put-up-or-shut-up.html", "http://ourfuture.org/20150428/how-tpp-increases-corporate-power-vs-government-and-us", "http://www.bizjournals.com/boston/print-edition/2013/10/11/new-balance-sneaker-made-in-america.html?page=all", "http://nextcity.org/equityfactor/entry/america-has-a-subsidies-problem", "http://downwithtyranny.blogspot.com/2015/05/obama-using-nike-to-sell-tpp-does-nike.html", "http://online.wsj.com/article/SB10001424127887324296604578177771076945076.html", "http://www.globalexchange.org/sweatfree/nike/faq", "http://ourfuture.org/20150420/a-look-at-the-fast-track-bill-shows-its-the-wrong-thing-to-do", "http://manufacturingmap.nikeinc.com/", "http://nextcity.org/equityfactor/entry/cities-keep-giving-out-money-for-server-farms-see-few-jobs-in-return", "http://www.oregonlive.com/politics/index.ssf/2012/12/kitzhaber_signs_30-year_tax_de.html", "http://reverbpress.com/world/brave-new-world-trade-pfizer-nike-vs-labor-tpp-fight-lobbying-records-suggest/", "http://www.twitter.com/ourfuture", "http://nikeinc.com/earnings/news/nike-inc-reports-fy2013-q4-and-full-year-results", "http://nextcity.org/daily/entry/nike-had-25-billion-last-year-still-got-a-tax-break-from-oregon", "http://www.thesundaytimes.co.uk/sto/business/Companies/article1430734.ece", "http://www.twitter.com/dcjohnson", "http://www.wsj.com/articles/SB10001424052702303873604579493502231397942", "http://OregonFairTrade.org", "http://www.goodjobsfirst.org/subsidy-tracker/or-nike", "http://www.ourfuture.org/blog", "http://www.citizenstrade.org/ctc/oregon/fair-trade-events/"], "published": "2015-05-07T19:25:00.000+03:00", "crawled": "2015-05-07T22:16:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}