{"organizations": [], "uuid": "7e3f524f005135b123dcba737322ff97466558cf", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/brooksmo_032013gn.jpg", "site_section": "http://thehill.com/taxonomy/term/1752/feed", "section_title": "House", "url": "http://thehill.com/policy/defense/242041-house-panel-sends-defense-bill-to-the-floor-setting-up-immigration-fight", "country": "US", "title": "House panel sends defense bill to the floor, setting up immigration fight", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House panel sends defense bill to the floor, setting up immigration fight", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-14T05:42:00.000+03:00", "replies_count": 0, "uuid": "7e3f524f005135b123dcba737322ff97466558cf"}, "author": "mmatishak@thehill.com (Martin Matishak)", "url": "http://thehill.com/policy/defense/242041-house-panel-sends-defense-bill-to-the-floor-setting-up-immigration-fight", "ord_in_thread": 0, "title": "House panel sends defense bill to the floor, setting up immigration fight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House panel sends defense bill to the floor, setting up immigration fight By Martin Matishak - 05/13/15 10:42 PM EDT The House Rules Committee voted late Wednesday night to move the chamber’s version of the annual defense bill to the floor, setting up a potentially bruising debate on immigration. In a party-line 8-3 vote, the panel allowed 135 amendments to the 2016 National Defense Authorization Act (NDAA). One amendment, by Rep. Mo Brooks (R-Ala.), would eliminate language establishing a sense of Congress calling for the Secretary of Defense to consider allowing recipients of President Obama’s Deferred Action for Childhood Arrivals (DACA) program to serve in the military. ADVERTISEMENT However, the GOP-controlled panel rejected a request made last week by Brooks and 24 other GOP members for the text to be stricken before the massive $612 billion measure reached the House floor. Speaking before the panel in favor of his amendment, Brooks said the House Armed Services Committee approved the immigration language during the “early morning sleep-depraved portion” of the panel’s 18-hour bill markup. He argued the text, which was approved 33-30 and attracted six Republican supporters, “betrays” Americans and legal immigrants by giving opportunities to illegal immigrants. Several GOP lawmakers testified in favor of the Brooks amendment, most notably from Rep. Steve King (R-Iowa), an immigration hard-liner. He argued that the amendment — introduced by Rep. Ruben Gallego (D-Ariz.) — should be taken out of the defense bill, as immigration issues fall under the Judiciary Committee’s purview. King also said any floor debate “could impact” a court case underway in Texas that is examining the legality of the DACA effort. Rep. Jim McGovern (D-Mass.) argued that “unlike a lot of issues,” Gallego’s amendment went through “regular order” in the Armed Services Committee. Rules Committee Republicans said several times they did not believe a hot-button issue like immigration should be included in the debate over the defense bill, which was passed Congress for 53 consecutive years. “There is nothing about the Gallego amendment that helps the military,” Rep. Michael Burgess (R-Texas) said. “This debate does not belong superimposed on the NDAA.” Rep. Bradley Byrne (R-Ala.), who also sits on the Armed Services panel, remarked that Gallego’s measure came up late in the markup process. \"I remember the debate being pretty darn short,” he said, adding he was “surprised it passed.” Byrne said he supported Brooks’ proposal making its way to the floor but warned, “I don’t know what the outcome’s going to be.” The full House will take up the NDAA on Thursday, with a vote on final passage expected some time Friday. The Rules panel did not approve an amendment filed by Rep. Paul Gosar (R-Ariz.) to strike a provision that would direct the Defense Department to evaluate how DACA recipients could expand the pool of recruits and impact military readiness. Meanwhile, Rep. Jeff Denham (R-Calif.) didn’t appear before the committee to defend his amendment, which would allow young illegal immigrants to serve in the military in exchange for legal status. Denham, who chairs the Transportation and Infrastructure Railroad subcommittee, didn’t testify because “he was traveling to the Amtrak crash site in Philadelphia,” a spokeswoman said. Denham’s proposal was not included in the final Rules package and won't get a floor vote.", "external_links": [], "published": "2015-05-14T05:42:00.000+03:00", "crawled": "2015-05-14T13:40:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}