{"organizations": [], "uuid": "8f23e263bfcc20238f0d4edeb1a10c481f69e0be", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/2013-05-16-gn-king_steve-4.jpg", "site_section": "http://thehill.com/taxonomy/term/1752/feed", "section_title": "House", "url": "http://thehill.com/blogs/floor-action/house/241101-gop-lawmaker-plots-stripping-immigration-out-of-defense-bill", "country": "US", "title": "GOP lawmaker plots to strip immigration from defense bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP lawmaker plots to strip immigration from defense bill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-05T22:39:00.000+03:00", "replies_count": 0, "uuid": "8f23e263bfcc20238f0d4edeb1a10c481f69e0be"}, "author": "cmarcos@thehill.com (Cristina Marcos)", "url": "http://thehill.com/blogs/floor-action/house/241101-gop-lawmaker-plots-stripping-immigration-out-of-defense-bill", "ord_in_thread": 0, "title": "GOP lawmaker plots to strip immigration from defense bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 05, 2015, 03:39 pm GOP lawmaker plots to strip immigration from defense bill Greg Nash \nRep. Steve King (R-Iowa), one of the most ardent GOP opponents of illegal immigration, plans to strip out provisions in the defense authorization slated for the House floor next week that edge toward allowing illegal immigrants to serve in the military. \nThe annual national defense authorization contains provisions that encourage the Secretary of Defense to study allowing illegal immigrants who came to the U.S. as children and are shielded from deportation through President Obama's executive actions to serve in the military. \nKing's move sets up a potentially divisive floor fight when the House returns from recess next week. \nIn a phone interview from Iowa, King said that he's currently in the process of drafting an amendment to eliminate a proposal he describes as a slippery slope. ADVERTISEMENT \"There are a lot of members angered by this,\" King told The Hill. \nKing warned that even policies that merely suggest allowing illegal immigrants to enlist in the military could encourage the Obama administration to pursue more unilateral moves beyond the executive actions in 2012 and 2014. \n\"We've seen the administration take huge license when it didn't have the authority at all,\" King said. \nA federal appeals court is still weighing the 2014 executive actions that expanded work permits for qualified immigrants who came to the country as children, known as the Deferred Action for Childhood Arrivals (DACA) program. \nBut King indicated he might not be the one to eliminate the controversial provisions in the defense authorization. He suggested that House Judiciary Committee Chairman Bob Goodlatte (R-Va.) could potentially assert his jurisdiction over immigration policy and call for it to be considered outside the massive defense bill. \nThe provisions could also be removed from the bill next week when it goes before the House Rules Committee, which decides how bills are considered on the floor. \nSenate Armed Services Committee Chairman John McCain (R-Ariz.) also shut the door hard on including any immigration measures on Tuesday. \n\"We're not doing anything on immigration,\" he said of the defense bill. \nHeritage Action, an influential conservative group, has also warned that the DACA-related parts of the defense authorization could \"jeopardize the bill's status as must-pass.\" \nMeanwhile, Rep. Jeff Denham (R-Calif.), a top Democratic target who represents a large Hispanic population, plans to offer a competing amendment next week that would outright allow illegal immigrants to serve in the military in exchange for legal status. \nHouse GOP leaders prevented Denham's proposal from getting a vote during consideration of last year's defense authorization. \nThe House Rules Committee is expected to announce next week which amendments are eligible for floor votes. GOP leadership will have to decide whether to let the DACA-related provisions stay in the bill or face backlash from conservatives. \n\"In any case, it's not going to be a peaceful discussion,\" King said. \nMartin Matishak contributed.", "external_links": [], "published": "2015-05-05T22:39:00.000+03:00", "crawled": "2015-05-05T23:45:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}