{"organizations": [], "uuid": "77c131c472ed8d2b125e2782f786b4bf833bd980", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2260474/images/o-NEW-YORK-CITY-MARIJUANA-POLICE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/denver/blog.xml", "section_title": "Denver Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/tony-newman/the-journey-to-legalize-marijuana_b_7233412.html", "country": "US", "title": "Lessons Learned: The Journey to Legalize Marijuana and End the Drug War | Tony Newman", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 15, "title_full": "Lessons Learned: The Journey to Legalize Marijuana and End the Drug War | Tony Newman", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-07T20:11:00.000+03:00", "replies_count": 26, "uuid": "e590f4332140de44348c676b47d343cfea208801"}, "author": "Tony Newman", "url": "http://www.huffingtonpost.com/tony-newman/the-journey-to-legalize-marijuana_b_7233412.html#post-0", "ord_in_thread": 0, "title": "Lessons Learned: The Journey to Legalize Marijuana and End the Drug War | Tony Newman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For the last 15 years I've dedicated my life to ending our country's disastrous war on drugs. It has been an incredible journey, and I am happy to say that seeds that were planted a long time ago are finally bearing some fruit.\nWhen I started my job at the Drug Policy Alliance in 2000, only 36% of Americans supported legalizing marijuana. Fifteen years later, the majority of voters support the idea, and four states and Washington D.C. have actually legalized it . In 2000, President \"I didn't inhale\" Clinton was overseeing an exploding increase in mass incarceration and practically bragging about his \"tough on crime\" policies and image. Fifteen years later, President Obama and Attorney General Holder are speaking out forcefully against mass incarceration, most presidential candidates from Hillary Clinton to Rand Paul are calling for reforms, and both Red and Blue states are looking to cut their prison numbers.\nWhen I talk to family, friends and even strangers and tell them about my work, they often say that things seem to be changing and congratulate us on our progress.\nHere are some reflections and lessons that I have taken from the struggle to end our country's sick, inhumane war on drugs.\n#1) Even as Underdogs, I Would Rather Have Our Hand than Theirs\nThere is no doubt that the Drug Policy Alliance and our sister organizations are a small David up against a 50 billion dollar a year drug war Goliath. There are probably between 200 and 300 or so paid staff in our movement going up against a massive drug war and prison industrial complex that has access to hundreds of millions of dollars in advertising alone. But even in the dark years, I always preferred to have our cards than theirs. We have science, compassion, common sense, and justice on our side. They spew insane rhetoric, promote impossible goals like a \"drug-free world,\" reject science, claim there is no benefits to medical marijuana, and try to justify locking people in cages just for using drugs.\n#2) Taking Advantage of Drug War Hypocrisy\nThe war on drugs is so damn hypocritical. You can't watch TV without seeing ads for legal drugs like alcohol and pills while we are arresting 700,000 people a year for marijuana possession. We have political leaders across the spectrum (Obama, Bush, Clinton, Gore, Palin, Gingrich, Bloomberg, to name a few) who have admitted to using drugs, and yet we have others rotting behind bars for doing the very same thing. White and black people use drugs as similar rates but Blacks go to prison 10 times the rate of Whites. The public hates hypocrisy, the media loves to cover it, and the reform movement has used it to our advantage.\n#3) Organizing Across the Political Spectrum : #NoMoreDrugWar\nI got into this work as a progressive who wanted to get people out of prison. Before I started working at the Drug Policy Alliance, I did not know much about libertarians. But I quickly learned that they are a passionate voice against our oppressive drug war. Our movement is truly made up of folks from across the political spectrum. We don't agree on much, but there is commitment and unity in our fight against the war on drugs. The two leading Senators in the country on this issue are New Jersey Democrat Cory Booker and Kentucky Republican Rand Paul. A couple of weeks ago in D.C., a powerful bipartisan summit was held, called #cut50, dedicated to cutting the number of people behind bars by 50% in the next ten years. I haven't seen any other issue in our country that brings together such a diverse group of people.\n#4) Bringing Five Fingers into a Fist\nOne of the longest, hardest battles we fought was to reform New York's draconian Rockefeller Drug Laws. For decades these laws locked up people, disproportionately people of color, for low-level drug offenses for 15 years to life. There was a diverse coalition of treatment providers, lawyers, families of those incarcerated, advocates, and celebrities that came together for years and were finally able to reform these laws. This was a big team effort and bringing together all of voices and expertise was crucial. It is hard to bring together the five fingers into a fist. But it is necessary and when it happens it can change laws and lives and bring people home from prison.\n#5 Ending the War is a Racial Justice Issue\nWhen Richard Nixon launched the modern day \"war on drugs\" 40 years ago he told his chief advisor that they had to figure out how to blame the Blacks without looking like they were blaming the Blacks. The drug war was launched. Forty years later, we are a society swimming in drugs. While everyone uses drugs, our enforcement focuses on mostly Black and Latino communities. 90 percent of those who served time under the draconian Rockefeller Drug Laws were Black and Latino despite equal rates of use and sales . Blacks are arrested 3 to 10 times more often than Whites for marijuana despite similar rates of use and sales.\nThe drug policy reform movement shines a light on these racial disparities. Bestselling author Michelle Alexander wrote a groundbreaking book, \"The New Jim Crow,\" that documented the racist drug war and criminal justice system and changed the conversation in churches and communities around the country. When Washington, D.C., legalized marijuana in November 2014, the driving force of the campaign was to stop the arrests and harassment of African Americans.\nThe tragic death of Michael Brown has called attention to communities around the country where African Americans face the brunt of all interactions with the police, not only over drugs, but for tickets and other small items that ensnarl them into the criminal justice system. More and more civil rights organizations, elected officials and the press are talking about the disparities in enforcement and the need to reform our country's laws because of it.\n#6) Winning at the Ballot Box and Passing Legislation (Another World is Possible)\nIt is one thing to rail against the failed drug war, but we also needed to show people that another world is possible. In 1996, California became the first state in the country to legalize access to marijuana for medical purposes. Since then, 22 other states plus D.C. and Guam have adopted medical marijuana laws, and almost half the country now has legal access to medical marijuana. In 2012, Colorado and Washington became the first two states to pass marijuana legalization laws. Alaska, Oregon, and D.C. also followed suit in 2014. These victories have shown that not only does the sky not fall when we change our drug laws, but that, in fact, the sun shines. Tens of thousands fewer people being arrested for marijuana. Tens of millions of dollars are being raised in tax revenue. In 2014, California again made history when they voted to eliminate felony charges for simple drug possession -- a victory that's keeping thousands out of prison and jail.\nThe wisdom and success from voters has made it clear that alternatives work in the real world. It has also allowed our elected officials to evolve on these issues. If the people lead, the leaders will follow.\n#7) The Wisdom and Voices of Those Impacted\nPeople formerly incarcerated and their families were instrumental in reforming the Rockefeller Drug Laws. Families who have lost loved ones to a drug overdose have shared their stories and helped pass laws to prevent these tragic deaths. Patients have changed hearts and minds by showing the world the medical benefits of marijuana. Courageous folks who have felt the brunt and horror of the drug war have fought back and won many victories that have freed people, saved lives, made medicine available to those who need it, and reunited families.\n#8) Have a Vision and Connect the Dots\nThe drug war has devastating consequences on so many levels. There are amazing groups who tackle individual aspects. The Marijuana Policy Project, Americans for Safe Access, and NORML have done great work to reform our marijuana laws. Groups like the Harm Reduction Coalition have helped reduce overdose deaths and HIV rates by increasing access to naloxone and sterile syringes. Our allies at Families Against Mandatory Minimums and the Sentencing Project have helped reduce the number of people behind bars. These are just a sample of issues and organizations working to end the drug war.\nThe Drug Policy Alliance tries to connect the dots and show how all of these issues make up the insane drug war. We want to weave these issues and advocates together to show how we are all working to create a vision of how society can reduce the harms of both drugs and drug prohibition - while also recognizing that drug use in certain circumstances can have benefits, too.\n#9) You Can't Rest After a Victory\nIt has been frustrating and tiring to have to defend every victory. After decades of fighting to reform the Rockefeller Drug Laws, prosecutors and district attorneys fought tooth-and-nail to impede the implementation of the new law. It took us years to lift the federal ban on states using their HIV prevention money for syringe access programs. In 2011, we finally won and got the ban lifted - and then the GOP took over the Senate in 2012 and reinstated the ban.\nWe spend years fighting for commonsense, life-saving initiatives, but when we win, it doesn't mean the battle is over. We have to be vigilant against opponents who are determined to undo our progress.\n#10) Not Afraid to Spank or Thank\nElected officials from both parties have championed our disastrous drug war. We have not been able to count on our elected officials when it comes to much of our progress over the last 15 years. But we will embrace elected officials when they do the right thing. We want them to evolve on this issue. We thank President Obama for not interfering or blocking states that have legalized marijuana. We applaud Mayor de Blasio when he tells the NYPD to stop making arrests for marijuana possession in New York City. And we thank Senator Paul for teaming up with Senator Booker and working on major criminal justice reform.\nYet we push back and attack these leaders when they do the wrong thing. For example, we slammed President Obama for not using his pardon power to free those who had spent years behind bars unjustly. He recently granted pardons to 22 people with drug sentences, but he has still used his power to pardon less than almost every other president in recent memory.\n#11) Create and Build Momentum\nWe constantly try to build momentum and energy to first win victories, and then use that momentum for further progress. Whenever we are working to change a law, we use media attention and new allies to create enough momentum to help us cross the finish line. Whether we are trying to pass legislation to reduce overdose deaths or stop marijuana arrests, we have multiple waves of actions, press conferences, reports, mobilizations, and voices of support to get us there.\nWe use victories to secure other victories. Colorado and Washington became the first two states to legalize marijuana in 2012. We highlighted the successes of those initiatives: the reduction of marijuana arrests, the decrease in crime, and the increase in tax revenue to help show the voters of Oregon, Alaska, and D.C. the wisdom of legalizing during the 2014 elections. We also use the momentum around legalizing marijuana to advance our other agenda like reducing the number of people behind bars for simple drug possession.\n#12 Despite Progress, the Drug War Grinds On\nFor all of the progress over the last 15 years, the war on drugs is still vicious. The worst drug war policies remain entrenched, as close to three-quarters of a million people are still arrested for marijuana possession every year, and half a million people are still behind bars today for nothing more than a drug law violation. The bloodbath in Mexico has taken 100,000 lives in the last eight years. And overdose fatalities have doubled in the last decade.\nWe are at a paradoxical moment in our country. We are clearly moving in the right direction, toward a more rational drug policy based on science, compassion, health and human rights. But we need to step up our efforts, grow our numbers, and continue to win hearts and minds, because the casualties from the war continue to mount every day.\nTony Newman is the director of media relations at the Drug Policy Alliance ( www.drugpolicy.org )\nFollow Tony Newman on Twitter: www.twitter.com/TonyNewmanDPA\nMore: Marijuana Marijuana Medical Marijuana Marijuana Weed Drug Policy Drug Legalization Marijuana Prohibition", "external_links": ["http://www.15yearstolife.com/", "https://www.aclu.org/feature/war-marijuana-black-and-white", "http://www.washingtonpost.com/blogs/wonkblog/wp/2014/11/05/its-official-marijuana-has-gone-mainstream/", "http://www.twitter.com/TonyNewmanDPA", "http://www.drugpolicy.org/", "http://sanfrancisco.cbslocal.com/2014/11/04/proposition-47-non-violent-crime-penalty-results/", "http://www.bipartisansummit.org/", "http://www.ted.com/talks/ethan_nadelmann_why_we_need_to_end_the_war_on_drugs", "http://newjimcrow.com/"], "published": "2015-05-07T20:11:00.000+03:00", "crawled": "2015-05-07T23:36:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}