{"organizations": [], "uuid": "4c6d4daa87700b1b57a0f30da005bed9bce4179a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://new.thehill.com/taxonomy/term/28/feed", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/overnights/241676-overnight-energy-obama-clears-arctic-drilling", "country": "US", "title": "OVERNIGHT ENERGY: Obama clears Arctic drilling", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT ENERGY: Obama clears Arctic drilling", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-12T01:08:00.000+03:00", "replies_count": 0, "uuid": "4c6d4daa87700b1b57a0f30da005bed9bce4179a"}, "author": "dhenry@thehill.com (Timothy Cama and Devin Henry)", "url": "http://thehill.com/policy/energy-environment/overnights/241676-overnight-energy-obama-clears-arctic-drilling", "ord_in_thread": 0, "title": "OVERNIGHT ENERGY: Obama clears Arctic drilling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT ENERGY: Obama clears Arctic drilling By Timothy Cama and Devin Henry - 05/11/15 06:08 PM EDT \nDRILL, BABY, DRILL: The Obama administration gave Royal Dutch Shell the go-ahead Monday on the company’s controversial plan to drill for oil and natural gas in the Arctic Ocean. \nThe drilling plan approval from the Interior Department’s Bureau of Ocean Energy Management came with five pages of conditions, and Shell still has to obtain various permits before its planned exploratory drilling this summer. ADVERTISEMENT But it nonetheless represented a victory for oil and gas interests and a defeat for environmentalists, who maintain that the Arctic is far too risky a place for drilling.\nBOEM Director Abigail Ross Hopper said the approval follows a “thoughtful” process and recognizes “the significant environmental, social and ecological resources in the region and establishing high standards for the protection of this critical ecosystem, our Arctic communities, and the subsistence needs and cultural traditions of Alaska Natives.” \nSen. Lisa Murkowski (R-Alaska) welcomed the news, but said the government has to follow through with Shell’s remaining hurdles. \nEnvironmentalists were furious. \n“Once again, our government has rushed to approve risky and ill-conceived exploration in one of the most remote and important places on Earth,” Susan Murray, deputy vice president for the Pacific at Ocean, said in a statement. \nRead more here . \nON TAP TUESDAY I: The Senate Energy and Natural Resources Committee will hold a hearing on the American Mineral Security Act, sponsored by Sen. Lisa Murkowski (R-Alaska), the panel’s chairwoman. The bill aims to increase mining of critical minerals, which excludes fossil fuels. \nLawmakers will hear from acting United States Geological Survey Director Suzette Kimball and various stakeholders and experts. \nON TAP TUESDAY II: The House could vote as soon as Tuesday on the Regulatory Integrity Protection Act, which would repeal the Environmental Protection Agency’s (EPA) proposed “waters of the United States” rule. Rep. Bill Shuster (R-Pa.), chairman of the House Transportation and Infrastructure Committee, sponsored the bill, which would stop the EPA’s attempt to redefine the waters under its jurisdiction for the Clean Water Act. \n“It’s important for the House to stand up for and recognize the concerns and rights of state and local governments, business owners and farmers, and landowners and private citizens,” Shuster said in a statement with Rep. Bob Gibbs (R-Ohio), another sponsor. \nThe White House threatened last month to veto the bill if it passes both chambers. \nRest of Tuesday’s agenda … \nEnvironmental Protection Agency Administrator Gina McCarthy will join other cabinet secretaries to discuss their accomplishments at the White House Summit on Asian-Americans and Pacific Islanders. \nThe Alliance to Save Energy will kick off its Energy Efficiency Global Forum. Speakers will include Sen. Jeanne Shaheen (D-N.H.) and Federal Energy Regulatory Commission member Cheryl LaFleur. \nThe Senate Foreign Relations Committee will hold a hearing on the civil nuclear agreement with China. Thomas Countryman, the assistant secretary of the State Department’s Bureau of International Security and Nonproliferation, and Frank Klotz, the under secretary for nuclear security at the Department of Energy, will testify. \nNEWS BITE: Sen. Shelley Moore Capito (R-W.V.) will introduce a bill to combat the Obama administration’s climate rule for power plants this week. \nIn a Charleston Daily Mail op-ed published Monday, Capito said she is planning a bill that would \"preserve the proper balance of state and federal authority, help ensure reliable and affordable electricity, and protect jobs and our economy.\" \nThe Environmental Protection Agency’s Clean Power Plan, which sets greenhouse gas reduction targets for states, is controversial in West Virginia, which produces the second-most coal in the country. The state’s Attorney General, Patrick Morrisey, has sued over the plan, and he detailed the legal argument he may wield against it at a committee hearing last week . \nCapito chaired that hearing, where she first teased this week’s bill. Details are scarce for now, but in her op-ed, Capito said, “The need for action both legally and legislatively is clear.” \n“The devastating impacts of these misguided regulations are great, and the time to act is now,” she wrote. \nAROUND THE WEB: \nUnited Kingdom environmentalists might not hate the new Tory Energy and Climate Change Secretary, Amber Rudd, whom the Guardian calls “really green and no-nonsense.” \nA new Indiana law to reduce energy usage may not be good enough to save consumers money or meet federal emissions standards, the Associated Press reports . \nApple wants to use renewable energy to power its entire supply chain. CEO Tim Cook tells the Wall Street Journal : “It will take years—but it’s important work that has to happen.” \nIN CASE YOU MISSED IT: \nCheck out Monday’s stories … \n- Huckabee : Lift oil export ban, use renewables-Feds greenlight Arctic drilling-Defense bill could determine the fate of the lesser prairie chicken-OPEC: Oil prices will stay below $100 for a decade-Court: BP can appeal some Gulf spill claims-NY Dem takes aim at nuclear plant after oil spill-Yucca project could bring economic incentives to Nevada \nPlease send tips and comments to Timothy Cama, tcama@thehill.com ; and Devin Henry, dhenry@thehill.com . Follow us on Twitter: @Timothy_Cama , @dhenry , @thehill Tags:", "external_links": [], "published": "2015-05-12T01:08:00.000+03:00", "crawled": "2015-05-12T01:52:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}