{"organizations": [], "uuid": "fd23daca7ca050eca2910adb5c2f239ef9c06384", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/energy-environment/241830-obama-administration-must-uphold-commitment-to", "country": "US", "title": "Obama administration must uphold commitment to biodiesel", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama administration must uphold commitment to biodiesel", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T21:00:00.000+03:00", "replies_count": 0, "uuid": "fd23daca7ca050eca2910adb5c2f239ef9c06384"}, "author": "Anne Steckel", "url": "http://thehill.com/blogs/congress-blog/energy-environment/241830-obama-administration-must-uphold-commitment-to", "ord_in_thread": 0, "title": "Obama administration must uphold commitment to biodiesel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 13, 2015, 02:00 pm Obama administration must uphold commitment to biodiesel By Anne Steckel \nJust last week, six senators held a press conference in the U.S. Capitol urging the EPA and the White House to ensure that America produces increasing quantities of biodiesel in the coming years. \nThe senators – who represent states across the nation – came together because we are at a crossroads in our energy policy, particularly when it comes to transportation fuels. For reasons that remain unknown, the Obama administration has failed for the last two years to issue annual standards determining how much biodiesel and other renewable fuels are blended into the American fuel supply. ADVERTISEMENT EPA’s inability to enforce the law in a timely manner has wreaked havoc on the biodiesel industry – causing dozens of production plants to close or idle. But the Obama administration has the opportunity to get back on course with its pending proposal set to be released by June 1.\nIt’s important to remember where renewable fuels like biodiesel got their start. Over the last decade, the domestic biodiesel industry was spurred to action in response to a variety of economic and national security threats facing the United States as a result of our dependence on oil. Specifically, the Energy Independence and Security Act was passed by an overwhelming bipartisan majority in Congress and signed into law by President George W. Bush because they all understood that our addiction to oil was not just bad for consumers and the economy, but it was helping to fund terrorist groups and hostile nations that sought to do us harm. The law created the Renewable Fuel Standard, or RFS, because Republicans and Democrats realized that the key to breaking our addiction to oil was to spur the growth of renewables like biodiesel, that aren’t made from petroleum. \nThis legislation, like the domestic biodiesel industry, has been a huge success. It has helped biodiesel grow from a niche fuel to a commercial-scale industry with biorefineries in almost every state in the U.S. Before the current policy delays, the industry produced a record of more than 1.8 billion gallons in 2013 – or nearly 5 percent of the diesel used in cars and trucks in the United States. \nThe industry did this using a diverse mix of raw materials, including recycled cooking oil, plant oils such as soybean oil, and animal fats. According to the EPA, biodiesel emits 57 percent to 86 percent fewer greenhouse gas emissions than petroleum diesel. And the industry is supporting more than 62,000 jobs across the United States. \nIn other words, biodiesel is creating jobs at home, reducing the amount of pollution we put into the air we breathe, and reducing our dependence on foreign sources of energy. \nThe setbacks resulting from the Obama administration’s severe policy delays are very real. The National Biodiesel Board estimates that 54 biodiesel plants in 30 states have either closed or idled because of the policy uncertainty. \nAt the press conference on Capitol Hill last week, Sen. Heidi Heitkamp (D-N.D.) stated: “No job in this country should hang in the balance simply because a federal agency is dragging its feet or failing to live up to its legal responsibility to promote confidence and growth.” \nThe administration now faces a choice as it prepares to issue the long-awaited proposal in the coming weeks. A strong, forward-looking policy will get U.S. production plants and their employees back online, and we can continue to grow the renewable content of the fuels we burn in our cars and trucks. We will create more energy jobs at home, reduce greenhouse gas emissions and ease our dependence on foreign sources of oil. \nA weak or status quo proposal will mean that more of our energy dollars are sent overseas. The result will be that foreign nations with large supplies of oil will be better funded and have more influence over our security and economic stability. We will see continued job losses and an unnecessary increase in greenhouse gas emissions and other pollution. \nAs a representative for thousands of workers in the U.S. biodiesel industry, I strongly urge the White House to listen to the senators who spoke out recently and stand by American producers of clean, renewable biodiesel by issuing robust standards. \nSteckel is the vice president of Federal Affairs for the National Biodiesel Board, an association that represents the U.S. biodiesel industry.", "external_links": [], "published": "2015-05-13T21:00:00.000+03:00", "crawled": "2015-05-13T21:28:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}