{"organizations": [], "uuid": "f0d6a2bffa5685a920bfffc47ee6e1519a8938df", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/kingsalman_012615getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/241582-saudi-arabian-king-to-skip-meetings-with-obama", "country": "US", "title": "Saudi king to skip meetings with Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Saudi king to skip meetings with Obama", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-11T14:50:00.000+03:00", "replies_count": 0, "uuid": "f0d6a2bffa5685a920bfffc47ee6e1519a8938df"}, "author": "kballuck@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/policy/international/241582-saudi-arabian-king-to-skip-meetings-with-obama", "ord_in_thread": 0, "title": "Saudi king to skip meetings with Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Saudi king to skip meetings with Obama Getty Images By Jesse Byrnes - 05/11/15 07:50 AM EDT \nSaudi Arabia's new leader, King Salman, won't attend meetings with President Obama this week, its state-run news agency announced, amid continued U.S. overtures toward Iran, a regional adversary. ADVERTISEMENT Obama was scheduled to host Salman and leaders of the Gulf Cooperation Council (GCC), including Saudi Arabia, Bahrain, Kuwait, Oman, Qatar and the United Arab Emirates, at the White House on Wednesday, as well as Thursday at Camp David.\nWhite House deputy press secretary Eric Schultz said as recently as Friday that the Saudi Arabian monarch and Obama would meet \"to build on their close consultations on a wide range of regional and bilateral issues.\" \nOn Sunday, the state-run Saudi Press Agency announced that the king would instead be sending Crown Prince Mohammed bin Nayef, the Saudi interior minister, and Deputy Crown Prince Mohammed bin Salman, the defense minister, according to The New York Times . \nThe Saudi Press Agency said the summit overlaps with a five-day cease-fire in Yemen intended for delivery of humanitarian aid. Saudi Arabia and Iran are seen as fighting a proxy war in Yemen, with Iran helping supply the Houthi rebels there. \nThe White House tried to downplay any notion that the Saudis were sending a message about the Iran nuclear talks by dispatching the king's deputies to meet with Obama. \nPress secretary Josh Earnest told reporters Monday that the White House does not view King Salman's absence as a snub. \n\"All the feedback we have received from the Saudis has been positive,\" he said. \nSalman had previously confirmed his attendance, Earnest said, but his sudden absence is \"unrelated to the agenda that is planned for Camp David.” \nEarnest expressed confidence \"the right people will be attending\" the summit to discuss greater security cooperation between the U.S. and its Gulf allies. \nHe said Obama could speak with King Salman ahead of the summit, as soon as today. \nSalman is expected to call Obama on Monday to discuss the decision to not attend the meetings, a senior administration official told the Times , adding there was \"no expression of disappointment\" from the Saudis. \nThe development comes as the U.S. continues to move with five other world leaders to secure a deal with Tehran over its nuclear program by June 30. \nSecretary of State John Kerry met Friday in Paris with counterparts from the Arab allies invited to the summit, and said, \"we are fleshing out a series of new commitments that will create, between the United States and the GCC, a new security understanding, a new set of security initiatives, that will take us beyond anything that we have had before in ways that will ask our partners to work with us, and they will contribute and we will contribute.\" \n\"It is not a one-way street. It is a two-way street with mutual interests and mutual needs that need to be addressed,\" Kerry added. \nSalman assumed power earlier this year following the death of King Abdullah. Obama traveled to Saudi Arabia earlier this year to pay respects. \nJordan Fabian contributed. \nThis story was updated at 1:21 p.m. Tags:", "external_links": [], "published": "2015-05-11T14:50:00.000+03:00", "crawled": "2015-05-12T06:01:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}