{"organizations": [], "uuid": "4d24b9ed705aa2d67d2185531bef6471c4aed146", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/jailprison_051115getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/floor-action/senate/241627-dems-press-obama-to-ban-the-box", "country": "", "title": "Dems press Obama to 'ban the box' | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Dems press Obama to 'ban the box' | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "4d24b9ed705aa2d67d2185531bef6471c4aed146"}, "author": "", "url": "http://thehill.com/blogs/floor-action/senate/241627-dems-press-obama-to-ban-the-box", "ord_in_thread": 0, "title": "Dems press Obama to 'ban the box' | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 11, 2015, 02:08 pm Dems press Obama to 'ban the box' By Jordain Carney Getty Images Twenty-seven senators want President Obama to block federal agencies and contractors from asking job applicants about prior criminal convictions. The senators, including 26 Democrats and presidential hopeful Bernie Sanders (I-Vt.), want Obama to take executive action to \"ban the box,\" referring to a question on job applications that asks if an applicant has any convictions. ADVERTISEMENT \"We ask you to require federal contractors and agencies to refrain from asking job applicants about prior convictions until later in the hiring process,\" they said in a letter to Obama on Monday. \"This policy would eliminate unnecessary barriers to employment for all job seekers and would give individuals re-entering the workforce the opportunity to apply for work based on their current merits rather than past wrong-doings.\" In addition to Sanders, the letter was signed by Democratic Sens. Cory Booker (N.J.), Sherrod Brown (Ohio), Sheldon Whitehouse (R.I.), Chris Murphy (Conn.), Chris Coons (Del.), Dick Durbin (Ill.), Al Franken (Minn.), Ed Markey (Mass.), Tim Kaine (Va.), Jeff Merkley (Ore.), Patrick Leahy (Vt.), Mazie Hirono (Hawaii), Tammy Baldwin (Wis.), Ron Wyden (Ore.), Mark Warner (Va.), Kirsten Gillibrand (N.Y.), Richard Blumenthal (Conn.), Elizabeth Warren (Mass.), Patty Murray (Wash.), Tom Udall (N.M.), Tom Carper (Del.), Ben Cardin (Md.), Jack Reed (R.I.), Joe Manchin (W.Va.), Amy Klobuchar (Minn.) and Brian Schatz (Hawaii). They note that federal employers would still be able to ask about past convictions or conduct a background check before making a final employment decision. The senators said that actions by Obama would \"restore hope and opportunity to those with criminal records who face substantial obstacles in their quest to be productive members of their communities.\" The letter to Obama comes amid a larger push for criminal justice reform in the Senate. Cardin has introduced legislation that would restore voting rights for formerly incarcerated individuals. Meanwhile, Sen. Tim Scott (S.C.) said earlier this month on ABC's \"This Week\" that he and other Republicans have \"been working for the last several months on different proposals\" addressing criminal justice reform. Past: 1 day Report: Obama lied about bin Laden... Seymour Hersh accuses Obama of rushing to take credit for the al Qaeda... Michelle Obama speaks of emotional... She discussed facing comments \"rooted in the fears and misperceptions of... DHS secretary: Lone wolf attackers... “We’re very definitely in a new environment,\" Jeh Johnson said. Two years later, IRS probes drag on GOP lawmakers fuming about the status of the IRS investigation. Is Matt Drudge the second most... On TV, in newspapers and on the Internet, you often see the guiding hand... GOP 2016: The top 10 contenders Where the White House hopefuls stand with three months until the first... Karl Rove surrenders to ObamaCare He correctly tells Republicans that their pledge to repeal ObamaCare is a... 'Jade Helm' war game sparks fears... A Pentagon training exercise has sparked conspiracy theories about martial... Immigration debate roils GOP A group of dissident Republicans in the House are clashing with their... Carson: 'Poor people have pride... “There’s real-life experiences and then there’s politics,” he said. Attorney: Spy chief had 'forgotten... “We all make mistakes,” the attorney said of Jim Clapper's controversial... Iran letter divides Democrats Some liberal groups are accusing the holdouts of siding with a “rush to... Obama goes after Warren: ‘She’s... The president said Warren was seeking to bolster her political brand. Sanders: I'm 'most progressive'... “Billionaires should not be able to buy elections,” he said on a Sunday... Brent Budowsky: The ‘Clinton Cash... OPINION | The Clinton Cash con will soon be forgotten, as it should be. Graham: GOP 'getting creamed with... The likely presidential contender said the GOP will lose in 2016 without... Clinton calls for paid family... Clinton also called her own mother her “guiding light.\" Bolton: Terrorists may attack... He said the president is encouraging terrorism and aggression toward the U... Former NYPD commissioner blasts... Howard Safir said Holder spent more time investigating police departments... Santorum: Bomb ISIS 'back to the... The former senator had strong words at the South Carolina Freedom Summit. Transportation chief: ‘We ought to... Anthony Foxx said lawmakers should be ashamed of highway funding patches. Carter cuts short trip over health... The former president was in Guyana ahead of Monday's presidential election. Walker goes strong on foreign... The Wisconsin governor pledged to \"take the fight to\" ISIS and other... ", "external_links": [], "published": "2015-05-12T03:00:00.000+03:00", "crawled": "2015-05-12T14:59:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}