{"organizations": [], "uuid": "83e2f99d441283948ccb7f7c6b3dde47f8f1e072", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/rubiomarco_042515getty.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/gop-primaries/240806-rubio-there-is-no-right-to-illegally-immigrate", "country": "US", "title": "Rubio: 'There is no right to illegally immigrate'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Rubio: 'There is no right to illegally immigrate'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T21:59:00.000+03:00", "replies_count": 0, "uuid": "83e2f99d441283948ccb7f7c6b3dde47f8f1e072"}, "author": "esmilowitz@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/ballot-box/gop-primaries/240806-rubio-there-is-no-right-to-illegally-immigrate", "ord_in_thread": 0, "title": "Rubio: 'There is no right to illegally immigrate'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 01, 2015, 02:59 pm Rubio: 'There is no right to illegally immigrate' By Mark Hensch Getty Images Sen. Marco Rubio (R-Fla.) said Friday immigrants were only entitled to enter America if they did so legally. “You don’t have a right to illegally immigrate here,” Rubio said at National Review’s NRI Ideas Summit in Washington, D.C. “One of the problems I have with the groups out there that are advocating for immigration reform, some of them, is they approach this debate with the argument that they have the right to be here,” he said. ADVERTISEMENT “It’s not a right,” the 2016 GOP presidential candidate added. “There is no right to illegally immigrate anywhere in the world.” Rubio argued the current immigration system needed updating so it attracted the best possible immigrants legally. He said the goal should be recruiting new Americans from available talent pools overseas. “In the 21st century, it has to be based on merit and the ability to contribute economically,” Rubio said of how the U.S. immigration system should work. “Our country is rich when we attract the brightest people and the people with the most money to invest here,” he said. “If you’re the best pitcher on the planet, you’re going to play in Major League Baseball,” he said. “Why wouldn’t we do that in science, technology and math?” The Florida lawmaker proposed immigration restrictions “as strict as possible” for those with criminal backgrounds. He said the immigration system should incentivize people to become happy, productive citizens. “I don’t want people to just live in America,” he said. “I want people to become Americans.” Rubio’s remarks come as he embarks on the 2016 presidential campaign trail. The son of Cuban immigrants, he has made immigration and the American dream a central part of his message to voters. Tags:", "external_links": [], "published": "2015-05-01T21:59:00.000+03:00", "crawled": "2015-05-02T04:08:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}