{"organizations": [], "uuid": "3711813c8cb2f942cb2ceea59b724adcda47bffa", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_24.jpg", "site_section": "http://thehill.com/taxonomy/term/27/feed", "section_title": "The Hill: Technology Policy", "url": "http://thehill.com/policy/technology/243013-anti-obama-trolls-fuel-questions-about-online-hate", "country": "US", "title": "Anti-Obama trolls fuel questions about online hate, racism", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Anti-Obama trolls fuel questions about online hate, racism", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-24T00:10:00.000+03:00", "replies_count": 0, "uuid": "3711813c8cb2f942cb2ceea59b724adcda47bffa"}, "author": "nstanage@thehill.com (David McCabe)", "url": "http://thehill.com/policy/technology/243013-anti-obama-trolls-fuel-questions-about-online-hate", "ord_in_thread": 0, "title": "Anti-Obama trolls fuel questions about online hate, racism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Anti-Obama trolls fuel questions about online hate, racism Getty Images By David McCabe - 05/23/15 05:10 PM EDT Two high-profile examples of racism directed at President Obama online in the past week are shining a spotlight on the broader issue of online harassment. \nBut it's a problem even the biggest companies in the tech world are struggling to find the right response to — one that would mute hateful trolling and threats while respecting the freedom of speech. ADVERTISEMENT Early this week, it was revealed that if users searched Google Maps for “n house,” it showed them the White House. And when Obama launched a personal Twitter account, it attracted attacks virulent enough to warrant an article from The New York Times and, reportedly, a visit from the Secret Service to at least one user.\nThe president has faced racist attacks since long before he got to the White House. More generally, online environments have been hotbeds of harassment since the inception of the Web. But this week underscored how technology can amplify deeply personal slurs, even against the leader of the free world. \nGoogle said on Thursday night that the issues with Maps had been caused not by a malicious person — perhaps working with Google’s Map Maker editing tool, as some had speculated — but by flaws in the company's algorithm. \nIn a blog post, an executive said Maps had a feature allowing it to match what people were saying on the Internet with places. \n“Certain offensive search terms were triggering unexpected maps results, typically because people had used the offensive term in online discussions of the place,” said Jen Fitzpatrick, a vice president of engineering and product management. “This surfaced inappropriate results that users likely weren’t looking for.” \nAt Twitter, the attacks involved users directing racist or threatening messages toward the president’s new account, @POTUS. One user, as noted in the Times story on the tweets, posted a photo of the president in a noose, made to look like the famous “Hope” poster from Obama’s 2008 campaign. \nTwitter threats are not new territory for the Secret Service. In 2013, a man was sentenced to six months in prison after threatening the president on the platform. \nA Secret Service spokesman said that the agency tracks statements on Twitter along with comments that come in from other intelligence sources. \n“People have the right to free speech,” the spokesman said. “We also have the right and an obligation to determine a person’s intent when they say something.” \nThe Twitter attacks against the president differ from the flaw in Google’s algorithm. The problem with the algorithm, as Google described it, was engineering gone awry. The issue on Twitter lies with human users. The latter is more representative of the kind of digital harassment tech companies are under pressure to curb. \nSocial networks have been urged to help stop harassment that occurs when users single out someone on a platform for hate or abuse. \n“The kind of harassment we are worried about happens when Internet users attract the attention of the wrong group or individual, and find themselves enduring extreme levels of targeted hostility, often accompanied by the exposure of their private lives,” the Electronic Frontier Foundation, a major privacy group, said in a statement. “And such online harassment can escalate to offline stalking, physical assault, and more.” \nWhereas Obama has the protection of the Secret Service and other law enforcement agencies, a member of the general public is more reliant on the people who run social networks to deal with threatening messages. But that hasn’t always delivered results, as some leading executives acknowledge. \n“We suck at dealing with abuse and trolls on the platform and we've sucked at it for years,” Twitter CEO Dick Costolo said this year in an internal memo obtained by The Verge. \nBut the social network has clearly been making an effort to deal with harassment, and threats in particular. \n“Like all of our technology industry peers, we do not proactively monitor content. Individual users and law enforcement authorities — including the U.S. Secret Service — report content to us and we review their reports against our rules, which prohibit violent threats and targeted abuse,” said a spokesman. “In cases involving immediate physical danger, law enforcement can submit emergency information requests to us 24/7 via a form available on our site.” The platform said it received 1,622 requests for information from the U.S. government in the second half of 2014 and that 220 of those were emergency requests. \nTwitter also worked with the nonprofit group Women, Action, and the Media to collect data last year about how women were being harassed on the site and help the women take action. \nIn three weeks, the group said it received close to 700 reports, more than 100 of which received “action from Twitter along the way.” Tags:", "external_links": [], "published": "2015-05-24T00:10:00.000+03:00", "crawled": "2015-05-24T09:06:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}