{"organizations": [], "uuid": "b6cfcd8248331d30191a6c7ca7766f4ec62b4d17", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/17/feed#", "section_title": "The Hill: Congress Blog", "url": "http://thehill.com/blogs/congress-blog/energy-environment/242262-if-hindsight-is-20-20-why-doesnt-obama-nix-shells", "country": "US", "title": "If hindsight is 20/20, why doesn’t Obama nix Shell’s Arctic drilling?", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "If hindsight is 20/20, why doesn’t Obama nix Shell’s Arctic drilling?", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-16T19:00:00.000+03:00", "replies_count": 0, "uuid": "b6cfcd8248331d30191a6c7ca7766f4ec62b4d17"}, "author": "jpicard@thehill.com (Cindy Shogan)", "url": "http://thehill.com/blogs/congress-blog/energy-environment/242262-if-hindsight-is-20-20-why-doesnt-obama-nix-shells", "ord_in_thread": 0, "title": "If hindsight is 20/20, why doesn’t Obama nix Shell’s Arctic drilling?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 16, 2015, 12:00 pm If hindsight is 20/20, why doesn’t Obama nix Shell’s Arctic drilling? By Cindy Shogan \nLast week, the Interior Department greenlighted Shell’s risky and dangerous plans to drill in America’s Arctic Ocean. The old saying is that hindsight is 20/20. So why isn’t the Obama administration pulling the plug on Shell’s reckless plans for the Arctic? \nThere is plenty of evidence that Shell should not return to America’s Arctic Ocean this year. By the Interior Department’s own admission, there is a 75 percent chance of a major oil spill if full field development occurs in the Chukchi Sea. What’s more, former Interior Secretary Ken Salazar said in 2012 that “Shell screwed up” and promised to hold Shell’s “feet to the fire,” which is reflective of the battering that Shell’s reputation took when it made its last go at Arctic drilling in 2012. It is also reflective of the tone of the administration and the seriousness of Shell’s infractions at the time. ADVERTISEMENT As a reminder, Shell’s drilling rig, the Kulluk, ended 2012 by running aground by Sitkalidak Island. Earlier in the season its oil-containment dome was “crushed like a beer can” during sea trials in the much calmer waters of Washington state. It’s been just a little over a year since the U.S. Coast Guard released its report on the grounding of the Kulluk, where Rear Admiral Joseph A. Servidio wrote that he was “most troubled by the significant number and nature of the potential violations of law and regulations.”\nYet, the Obama administration seems to forget the report’s contents. The report reveals how truly incompetent Shell is. Shell gets everything wrong – from which weight-bearing clasps to tow the Kulluk to crewmembers completely disregarding alarm after alarm after alarm that warned of serious problems onboard right before the Kulluk crashed. \nBut Shell’s list of mishaps doesn’t end in 2012. Shell’s other drilling rig, the Noble Discoverer, has already failed an inspection this year from the U.S. Coast Guard. This is the same ship for which its operator went to court and was found guilty of eight felony offenses and ended up having to pay $12.2 million in fines from its last trip with Shell in 2012. \nIt’s obvious that the Obama administration should not trust Shell. But even without their incompetence, the bottom line is that it is risky and reckless to allow drilling to move forward in the Arctic. \nYet, Obama defended this action saying that we still need to use fossil fuels as a bridge to cleaner energy solutions when it can be done safely. Safe and Shell should not be used in the same sentence. \nWe also know this “extreme oil” can’t be burned if we’re to leave our kids a climate-safe world. Obama still has the chance to make the right decision – one that would stop Big Oil from plundering our special places and wrecking our climate. Some places are too special, too risky and too irresponsible to drill – America’s Arctic Ocean is one of those places. \nObama and his administration have dealt with the lasting impacts and the devastation that was caused by Deepwater Horizon. The administration has also been faced with Shell’s incompetence in 2012. Call it hindsight given Shell’s history or call it foreshadowing with what we know about other tragic oil spills: oil spills cannot be effectively cleaned up – once the oil spills the battle has already been lost. We know how this story ends; let’s not let it begin. It’s time for Obama to act on the evidence and pull the plug on Shell’s plans and say no to risky and reckless Arctic drilling. \nShogan is the executive director of Alaska Wilderness League.", "external_links": [], "published": "2015-05-16T19:00:00.000+03:00", "crawled": "2015-05-16T20:54:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}