{"organizations": [], "uuid": "cf6ded876b7c0ffda6243ee11f1e42b8af52b69f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/13/jeb-sides-with-brother-on-invading-iraq-was-ducking-question/", "country": "US", "title": "Obama holds White House talks with leaders from Saudi Arabia", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama holds White House talks with leaders from Saudi Arabia", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T19:12:00.000+03:00", "replies_count": 0, "uuid": "a277c6d1c0bbb411985dd87af2951c6c1c14488f"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/13/obama-holds-white-house-talks-with-leaders-from-saudi-arabia/", "ord_in_thread": 0, "title": "Obama holds White House talks with leaders from Saudi Arabia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama holds White House talks with leaders from Saudi Arabia Published May 13, 2015 Facebook 0 Twitter 0 Email Print \nPresident Barack Obama welcomed Saudi Arabian leaders to the White House Wednesday amid strains with the kingdom over his pursuit of a nuclear deal with Iran. \nAs he opened their Oval Office meeting, Obama said the U.S. and Saudi Arabia were building their relationship \"during a very challenging time.\" Beyond the Gulf nation's worries about Iran, Saudi Arabia and other countries are deeply concerned about the rise of the Islamic State and instability in Yemen. \nObama made no mention of the nuclear negotiations, which will be at the forefront of discussions with regional leaders at Camp David on Thursday. \nThe president also was hosting a dinner Wednesday for representatives from Saudi Arabia, Qatar, the United Arab Emirates, Kuwait, Oman and Bahrain. \nBut Obama's separate meeting with the Saudis underscores the desert kingdom's critical role. Saudi Arabia has been among the strongest critics of the president's Iran overtures and worries not only about Tehran's nuclear ambitions, but also its meddling throughout the region. \nObama had planned to meet one on one Wednesday with Saudi King Salman. But the kingdom abruptly announced over the weekend that the king would no longer travel to Washington. \nBoth the White House and Saudi officials insisted Salman was not snubbing Obama. Still, his decision to skip a visit to the White House and a rare summit at Obama's presidential retreat raised questions about the effectiveness of the meetings. \nThe White House is expected to offer the Gulf nations more military assistance, including increased joint exercises and coordination on ballistic missile systems. The package of assistance would be aimed at reassuring the region that the U.S. will guard its security against potential Iranian aggression. \nSome Gulf nations wanted Obama to commit to a formal defense treaty, but U.S. officials have told leaders the president will not agree to such a measure. Advertisement", "external_links": [], "published": "2015-05-13T19:12:00.000+03:00", "crawled": "2015-05-13T19:54:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}