{"organizations": [], "uuid": "877a1cfacfafde7b010ebeccfeae00a462b9b02a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/mcconnellmitch_050515gn_0.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/floor-action/senate/242056-mcconnell-praises-obama-on-trade", "country": "", "title": "McConnell praises Obama on trade | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "McConnell praises Obama on trade | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "877a1cfacfafde7b010ebeccfeae00a462b9b02a"}, "author": "", "url": "http://thehill.com/blogs/floor-action/senate/242056-mcconnell-praises-obama-on-trade", "ord_in_thread": 0, "title": "McConnell praises Obama on trade | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 14, 2015, 10:21 am McConnell praises Obama on trade By Jordain Carney Greg Nash \nSenate Majority Leader Mitch McConnell (R-Ky.) praised President Obama on the “fast-track” trade bill, saying the Democratic commander in chief has \"done his country a service.\" “I’d like to thank the President, too. No, you’re not hearing things. President Obama has done his country a service by taking on his base and pushing back on some of the more ridiculous rhetoric we’ve heard,\" the Republican leader said. “He was right to remind everyone that ‘you don’t make change through slogans’ or ‘ignoring realities.’ ” McConnell added that Obama “should be recognized” for his role in the trade fight. His remarks are the latest example of the unusual political divisions created by the fast-track bill, which will allow the president to get trade deals approved by Congress with a simple majority vote and will prevent the deals from being amended. Obama and congressional Republicans back fast-track, but most Democrats oppose it, and Senate Democrats voted against the White House earlier this week. Republicans have used the division to criticize their Democratic colleagues over the trade bill. On Wednesday, Sen. John Barrasso (R-Wyo.) said the trade legislation “isn’t the normal story of Democrats versus Republicans.” “This isn’t a normal story of Democrats versus Republicans or Sen. Reid versus Sen. McConnell,” he said. “Oh, no, this is a story about Sen. Reid versus President Obama.” Senate leadership struck a deal Wednesday on moving forward on the trade legislation, with senators expected to take a procedural vote on proceeding to the \"fast-track\" trade bill on Thursday afternoon. Tags: ", "external_links": [], "published": "2015-05-15T03:00:00.000+03:00", "crawled": "2015-05-15T15:45:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}