{"organizations": [], "uuid": "93e1505a58df1842678597943544fadb25853248", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_042115getty.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed#", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/campaign/240544-obama-should-stand-behind-his-words-on-political-spending", "country": "US", "title": "Now's the time for Obama to stand behind words on political spending", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Now's the time for Obama to stand behind words on political spending", "spam_score": 0.0, "site_type": "blogs", "published": "2015-04-30T13:00:00.000+03:00", "replies_count": 0, "uuid": "93e1505a58df1842678597943544fadb25853248"}, "author": "lgilbert@citizen.org (Lisa Gilbert, contributor)", "url": "http://thehill.com/blogs/pundits-blog/campaign/240544-obama-should-stand-behind-his-words-on-political-spending", "ord_in_thread": 0, "title": "Now's the time for Obama to stand behind words on political spending", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "April 30, 2015, 06:00 am Now's the time for Obama to stand behind words on political spending By Lisa Gilbert, contributor \nIn his speech to the White House Correspondents' Association on Saturday night, President Obama spoke about the Koch brothers and the massive amounts of money they intend to spend on the 2016 election. He compared the so-called \"Koch brothers primary\" to the TV show \"The Bachelor,\" saying, \"Marco Rubio, Rand Paul, Ted Cruz, Jeb Bush, Scott Walker — who will finally get that red rose?\" ADVERTISEMENT Later, he mentioned the \"non-stop focus on billionaire donors.\" These are just the latest in a series of comments the president has made on the need to deal with the problem of excessive money in politics, and in particular, \"dark money,\" in the system.\nIn this year's State of the Union address, he said \"a better politics is one where we spend less time drowning in dark money for ads that pull us into the gutter, and spend more time lifting young people up, with a sense of purpose and possibility, and asking them to join in the great mission of building America.\" \nAnd this year, on the fifth anniversary of the overreaching Citizens United v. Federal Election Commission Supreme Court decision, he again spoke out, saying, \"[w]ith each new campaign season, this dark money floods our airwaves with more and more political ads that pull our politics into the gutter. It's time to reverse this trend. Rather than bolster the power of lobbyists and special interests, Washington should lift up the voices of ordinary Americans and protect their democratic right to determine the direction of the country that we love.\" \nThe president has been clear and compelling (and in the case of the Correspondents' dinner, also funny) about what he believes is hindering our democracy, and we applaud his commentary. Now, we're looking to him to stand behind his words and take action. \nBut what can he do without Congress? \nObama should start by issuing an executive order requiring government contractors to disclose their political donations. This is important both for enhancing transparency in the political process and for dealing with the appearance of corruption in the contractor process. \nNumerous organizations and businesses are calling loudly for this reform, and on the April 2 anniversary of McCutcheon v. Federal Election Commission (the Supreme Court case that empowered the out-of-control billionaire spending the president referenced at the dinner), groups announced that 550,000 petitions had been gathered in support of an executive order in one month. Sixty other rallies and events took place in 30 states, calling for reform. \nThis executive order would have a significant effect. In a new study released this week , Public Citizen reviewed government contracts that were held by the 100 largest companies in the United States — as ranked by Fortune magazine for 2014 — and found that 70 of the Fortune 100 companies had federal contracts totaling $100,000 or more this past year. \nUnder our current system, we have no idea if these major federal contractors are spending money in our political process, but we do know that the idea that they might be is an unsavory one. Secret contractor spending implies a pay-to-play culture in which the public cannot discern whether awards are going to those best able to play the political money game or to those offering the most efficient and high-quality product or service. \nThe government issues billions of dollars of contracts each year, ranging from buying office supplies to purchasing planes for the army, to repairing our bridges, to paying to clean up polluted waterways. These contracts always should go to those best-suited to do the job, not to the companies willing to write the biggest check for dark money groups to support candidates. \nWe pay taxes with the understanding that our dollars will be used for important public services and needs. In return, we deserve straightforward disclosure of political expenditures from any company that has done business with the government. \nThe president has spoken — and joked — about the need to clean up our system. Now, he needs to make change in this arena a reality, to spare us from our electoral version of the reality show \"The Bachelor.\" \nGilbert is the director of Public Citizen's Congress Watch division. Tags:", "external_links": [], "published": "2015-04-30T13:00:00.000+03:00", "crawled": "2015-05-01T03:15:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}