{"organizations": [], "uuid": "08b35d240b3d256fbcf6af07cbe9333a7fbb23c9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/abortion05112015getty.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/241632-bill-banning-late-term-abortion-keeps-controversial-incest-rule", "country": "US", "title": "Late-term abortion ban keeps controversial incest rule", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Late-term abortion ban keeps controversial incest rule", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-11T21:36:00.000+03:00", "replies_count": 0, "uuid": "08b35d240b3d256fbcf6af07cbe9333a7fbb23c9"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/241632-bill-banning-late-term-abortion-keeps-controversial-incest-rule", "ord_in_thread": 0, "title": "Late-term abortion ban keeps controversial incest rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Late-term abortion ban keeps controversial incest rule Getty Images By Sarah Ferris - 05/11/15 02:36 PM EDT Newly unveiled language in the House’s late-term abortion bill shows that GOP leaders did not meet all of the demands from members of their party who had opposed an earlier version, keeping in limits on incest-related abortion. House Republicans, led by Majority Leader Kevin McCarthy (Calif.), eliminated a controversial rule that would have required rape victims to report their crimes to the police before undergoing the procedure. ADVERTISEMENT But the bill did not change a provision that allows victims of incest to receive an abortion only if they are under 18 years old, according to text released Monday.\nThe language could spell trouble for GOP leaders, who plan to make a second attempt at passing the legislation Wednesday. The bill, which would ban abortions after 20 weeks of pregnancy, was yanked from the House floor in January after a group of centrists and GOP women led by Rep. Renee Ellmers (R-N.C.) voiced concerns about rape and incest victims. Blair Ellis, a spokeswoman for Ellmers, declined to say whether the congresswoman supports the bill, though he said the office plans to release a statement following the vote on Wednesday. \"Incest is incest. There can't really be a cutoff age,\" Ellmers told National Journal last month. The new version of the House bill also includes a two-day waiting period for rape victims. Doctors must also ensure that victims have received medical treatment or counseling during that time. The bill will head to the House Rules Committee for discussion Tuesday afternoon. Destiny Decker, a spokeswoman for the bill’s lead sponsor, Rep. Trent Franks (R-Ariz.), confirmed that the incest provision is staying in place. Past: 1 day Report: Obama lied about bin Laden... Seymour Hersh accuses Obama of rushing to take credit for the al Qaeda... Michelle Obama speaks of emotional... She discussed facing comments \"rooted in the fears and misperceptions of... DHS secretary: Lone wolf attackers... “We’re very definitely in a new environment,\" Jeh Johnson said. Two years later, IRS probes drag on GOP lawmakers fuming about the status of the IRS investigation. Is Matt Drudge the second most... On TV, in newspapers and on the Internet, you often see the guiding hand... GOP 2016: The top 10 contenders Where the White House hopefuls stand with three months until the first... Karl Rove surrenders to ObamaCare He correctly tells Republicans that their pledge to repeal ObamaCare is a... 'Jade Helm' war game sparks fears... A Pentagon training exercise has sparked conspiracy theories about martial... Immigration debate roils GOP A group of dissident Republicans in the House are clashing with their... Carson: 'Poor people have pride... “There’s real-life experiences and then there’s politics,” he said. Attorney: Spy chief had 'forgotten... “We all make mistakes,” the attorney said of Jim Clapper's controversial... Iran letter divides Democrats Some liberal groups are accusing the holdouts of siding with a “rush to... Obama goes after Warren: ‘She’s... The president said Warren was seeking to bolster her political brand. Sanders: I'm 'most progressive'... “Billionaires should not be able to buy elections,” he said on a Sunday... Brent Budowsky: The ‘Clinton Cash... OPINION | The Clinton Cash con will soon be forgotten, as it should be. Graham: GOP 'getting creamed with... The likely presidential contender said the GOP will lose in 2016 without... Clinton calls for paid family... Clinton also called her own mother her “guiding light.\" Bolton: Terrorists may attack... He said the president is encouraging terrorism and aggression toward the U... Former NYPD commissioner blasts... Howard Safir said Holder spent more time investigating police departments... Santorum: Bomb ISIS 'back to the... The former senator had strong words at the South Carolina Freedom Summit. Transportation chief: ‘We ought to... Anthony Foxx said lawmakers should be ashamed of highway funding patches. Carter cuts short trip over health... The former president was in Guyana ahead of Monday's presidential election. Walker goes strong on foreign... The Wisconsin governor pledged to \"take the fight to\" ISIS and other...", "external_links": [], "published": "2015-05-11T21:36:00.000+03:00", "crawled": "2015-05-11T23:00:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}