{"organizations": [], "uuid": "9de37734799bc3ae69034b555abd40460f1413c7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamaphiladelphia_051815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/242420-obama-touts-new-limits-on-what-military-gear-police-can", "country": "US", "title": "Obama touts new limits on what military gear police can purchase", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama touts new limits on what military gear police can purchase", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-18T23:34:00.000+03:00", "replies_count": 0, "uuid": "9de37734799bc3ae69034b555abd40460f1413c7"}, "author": "iswanson@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/blog-briefing-room/news/242420-obama-touts-new-limits-on-what-military-gear-police-can", "ord_in_thread": 0, "title": "Obama touts new limits on what military gear police can purchase", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 18, 2015, 04:34 pm Obama touts new limits on what military gear police can purchase Getty Images \nPresident Obama touted new limits on the flow of military-style equipment to local law enforcement during a speech Monday in Camden, N.J., on police and minority communities. \nObama chose Camden as the site of the speech because the Philadelphia suburb’s crime rate has dropped since it adopted reforms for its police force. ADVERTISEMENT “Just a few years ago this city was written off as dangerous beyond redemption, a city trapped in a downward spiral,” Obama said, rattling off statistics depicting a drop in violent crime, murder and open-air drug markets. The president also praised the improved response time for 911 calls in the area.\nThe White House earlier on Monday announced changes that will bar police departments from buying grenade launchers, or guns and ammunition of .50 millimeters or higher. \nHe suggested the reforms were necessary to engender trust between police forces and the communities that they serve. \n“We've seen how militarized gear can sometimes give people the feeling like there's an occupying force as opposed to a force that's part of the community that's protecting them and serving them,” Obama said. “We're going to prohibit some equipment made for the battlefield that is not appropriate for local police departments.” \nThe speech comes amid a national debate on police and minority communities triggered by a series of killings. Most recently, the death of a 25-year-old black man, Freddie Gray, in police custody that set off rioting in Baltimore. \nMuch of Obama’s address on Monday centered on the need to provide opportunities for young people growing up in such tough communities as Camden. \n“The kids that grow up here, they're America's children. Just like children every place else, they've got hopes and they've got dreams and they've got potential,” Obama said. \n“They shouldn't have to go through superhuman efforts just to be able to stay in school and go to college and achieve their promise,” Obama said, gesturing to youth in the audience. “That should be the norm. It should be standard.” \nObama has hinted that after he leaves office, he may make combating racial and economic inequalities a central part of his life. \n“If communities are being isolated and segregated, without opportunity and without investment and without jobs, if we politicians are simply ramping up long sentences for non-violent drug crimes that end up devastating communities, we can't then ask the police to be the ones to solve the problem when there are no able-bodied men in the community, or kids are growing up without intact households,” he said Monday. Tags:", "external_links": [], "published": "2015-05-18T23:34:00.000+03:00", "crawled": "2015-05-19T04:11:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}