{"organizations": [], "uuid": "46ac0979db4fd95c6fc15caeebeb42b530841f59", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_immigrationgetty_1.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/240909-obama-to-launch-non-profit-aimed-at-young-minority-men", "country": "US", "title": "Obama to help launch nonprofit aimed at young minority men", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to help launch nonprofit aimed at young minority men", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-04T13:00:00.000+03:00", "replies_count": 0, "uuid": "46ac0979db4fd95c6fc15caeebeb42b530841f59"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/240909-obama-to-launch-non-profit-aimed-at-young-minority-men", "ord_in_thread": 0, "title": "Obama to help launch nonprofit aimed at young minority men", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 04, 2015, 06:00 am Obama to help launch nonprofit aimed at young minority men By Jordan Fabian Getty Images \nPresident Obama on Monday will announce the creation of a nonprofit group dedicated to helping young men and boys of color. \nThe organization, titled the My Brother's Keeper Alliance, will launch at an event at Lehman College in the Bronx, N.Y., where the president will speak and hold a roundtable with young men, the White House said. ADVERTISEMENT The new organization is related to My Brother's Keeper, a White House initiative aimed at aiding young minority males.\nThe kickoff event comes in the wake of riots and protests in Baltimore following the funeral of Freddie Gray, a 25-year-old black man who died last month while in police custody. \nThe White House has billed the organizations as a reaction to the social ills that have raised tensions between police and minority communities. \n\"As a proud son of Baltimore, this week's announcement comes at a time of unique and special resonance for me,\" Cabinet Secretary Broderick Johnson, the chairman of My Brother's Keeper, wrote to the White House's email list. \"The president's My Brother's Keeper Initiative is about recognizing that our young people are not the problem, but rather the solution.\" \nThe new nonprofit group has received $80 million in financial commitments from large corporations and consulting firms, including American Express, BET Networks and News Corp. \nThe money will fund grants to local communities and programs to promote reading, high school and college preparation, and violence prevention. \nJoe Echevarria, former chief executive of Deloitte LLP, will serve as chairman and CEO of the My Brother's Keeper Alliance. Business leaders and celebrities, such as former NBA star Alonzo Mourning and singer John Legend, will serve on the board. \nFormer Secretary of State Colin Powell, Sen. Cory Booker (D-N.J.), former NFL star Jerome Bettis and former NBA all-star Shaquille O'Neal will serve on the advisory board. \nSeparately, Johnson announced the White House initiative has secured $500 million in private fundraising commitments to benefit its programs. \nThe mission of the White House program and the nonprofit are similar, but the new organization could allow its work to continue after Obama leaves office. \nDuring an event with students at the Anacostia Library in Washington, D.C., Thursday, the president hinted at a return to his past community organizing work once he leaves office. \n“I’ll be done being president in a couple of years, and I’ll still be a pretty young man,” he said. “And so, I’ll go back to doing the kinds of work I was doing before, just trying to find ways to help people.” Tags:", "external_links": [], "published": "2015-05-04T13:00:00.000+03:00", "crawled": "2015-05-04T23:14:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}