{"organizations": [], "uuid": "a250bb947650a5d51d19cecd0f245b671709f56a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/castroraul_obamabarack_121013getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/blogs/blog-briefing-room/news/242857-obama-wants-to-visit-cuba-spokesman-says", "country": "US", "title": "Obama wants to visit Cuba, spokesman says", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama wants to visit Cuba, spokesman says", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-21T22:39:00.000+03:00", "replies_count": 0, "uuid": "a250bb947650a5d51d19cecd0f245b671709f56a"}, "author": "jbyrnes@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/blogs/blog-briefing-room/news/242857-obama-wants-to-visit-cuba-spokesman-says", "ord_in_thread": 0, "title": "Obama wants to visit Cuba, spokesman says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 21, 2015, 03:39 pm Obama wants to visit Cuba, spokesman says Getty Images \nPresident Obama would like to visit Cuba before he leaves office, his spokesman said Thursday. \n“I know there's one person in particular who hopes President Obama will be in Havana at some point in the relatively [near] future, and that's President Obama himself,” White House press secretary Josh Earnest said. ADVERTISEMENT “I know that he would relish the opportunity to visit the island of Cuba, and Havana in particular,” Earnest added when asked by a Cuban TV reporter at the end of the daily briefing if Obama would visit before 2017.\nEarnest had previously said after sweeping changes were announced to normalize relations with Cuba in December that he “wouldn't rule out” Obama visiting Cuba. \nU.S. and Cuban negotiators met Thursday in Washington for their fourth round of talks on re-establishing diplomatic relations between the two countries and reopening embassies. \nEarnest said both sides were still ironing out details on the rules governing movement of U.S. diplomatic personnel in Cuba. \nThe president made the decision to remove Cuba from the list of state sponsors of terrorism following a historic meeting with Cuban leader Raúl Castro last month in Panama. \nThe White House submitted a report to lawmakers certifying Cuba had not supported terrorist activities in the previous six months and received assurances it wouldn't in the future. \nThe State Department is expected to remove the country from the list next week, when Congress's 45-day review period ends. \nEarnest said Thursday that the White House continues to have concerns about Cuba's human rights record. \n“We continue to have significant concerns about the way the Cuban government all too often fails to respect the basic human rights that we hold so dear in this country,” Earnest said, referring to jailed Cuban activists and journalists. Tags:", "external_links": [], "published": "2015-05-21T22:39:00.000+03:00", "crawled": "2015-05-22T03:29:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}