{"organizations": [], "uuid": "dfbabde3838e3a70089d6117c2cbfbee12cd2329", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2938286/images/o-OBAMA-TRADE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/david-paul/obama-scolding-elizabeth-warren_b_7259664.html", "country": "US", "title": "Obama Scolding Elizabeth Warren Should Not Deflect Need for Real Debate Over Trade Pact | David Paul", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Scolding Elizabeth Warren Should Not Deflect Need for Real Debate Over Trade Pact | David Paul", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-12T00:39:00.000+03:00", "replies_count": 0, "uuid": "dfbabde3838e3a70089d6117c2cbfbee12cd2329"}, "author": "David Paul", "url": "http://www.huffingtonpost.com/david-paul/obama-scolding-elizabeth-warren_b_7259664.html", "ord_in_thread": 0, "title": "Obama Scolding Elizabeth Warren Should Not Deflect Need for Real Debate Over Trade Pact | David Paul", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama is fed up. At long last, he has found an issue where he can move forward in common cause with Republicans in Congress and his own Democrat compatriots won't stand for it. Massachusetts Senator Elizabeth Warren first set the president off by comments claiming that the proposed trade deal would exacerbate income inequality and erode national regulatory sovereignty. \"The idea that we can shut down globalization, reduce trade ... is wrong-headed,\" the president responded . \"That horse has left the barn.\" And then it got personal. Warren and her allies were being dishonest, spreading lies about the deal, he suggested. They are, the president inferred, behaving like Republicans.\nIt is hard for the rest of us to debate the merits of the TPP because the actual terms have not yet been disclosed to the public. And this was the essence of Warren's response. The president is trying to have it both ways: he criticizes opponents for misrepresenting the deal -- even as he deliberately mischaracterizes their stance as being anti-trade -- but won't allow the public a peak at the text or engage in a direct public debate of the issues that Warren and others have raised. Speaking this week , he amped up the rhetoric as he derided his erstwhile Democrat allies for wanting to \"pull up the drawbridge and build a moat around ourselves.\"\nIt is good to see robust opposition forming to the TPP. The alliance of Tea Party critics on the right with the Warren Democrat camp on the left is heartwarming, and in another era or in another political system might have constituted a political force in defense of the broader public interest. The American middle class has not been treated well by our political system over the past several decades -- in terms of incomes and job security, and the sharing of growing economic wealth -- and both the substance and politics of the TPP tell the story why.\nGlobalization and technology have combined to turn the American economy into part of a globalized system of production and consumption. International trade theory, as famously set forth by British economist David Ricardo two hundred years ago, suggests that the world as a whole benefits through systems of free trade that lead each nation to produce those goods and services where they have a comparative advantage. Combine our modern capitalist world and the World Wide Web with Ricardo's theory, and the world effectively shrinks, accelerating the migration of investment and jobs.\nWe all know the story that has unfolded over the post-World War II era, when first Japan, then the Asian Tigers, and finally China became the beneficiaries of increasingly free trade. And Ricardo's theory has been proven right. Free trade has lifted hundreds of millions, if not billions, of people around the world out of destitute poverty, as the share of the world population living in extreme poverty declined by fifty percent -- from 43 percent in 1990 to 21 percent in 2010.\nThe American middle class paid the price of opening our markets and shipping millions of jobs overseas to the benefit of other nations. During the past forty-five years -- going back to 1969 -- median U.S. income has been flat in real terms, after having increased by 50 percent over the prior fifteen years. Since 1973, wages and salaries have declined steadily as a share of U.S. GDP, from 54 to 45 percent, even as corporate profits have reached record highs. Globalization has created an economy in which the economic benefits of growing productivity and global wage competition have inured to the benefit of corporate management and investors even as it has depressed family incomes. As a result -- the president's snarky riposte notwithstanding -- from the perspective of the average American family that may not appreciate the nuances of David Riccardo's economic theory, building a moat around ourselves might seem like a good idea.\nNo doubt, the American middle class should be applauded for the sacrifices that it has made for the rest of the world. But our politics are not about sacrificing for the greater good. Political money spent to buy the support of members of Congress or occupants of the White House has grown dramatically, and those who spend that money rarely do it for charitable purposes. And so it is with trade agreements. One purpose of the TPP no doubt is to align the world in the manner envisioned by David Ricardo, to boost aggregate global incomes to the ultimate benefit of all nations. But the TPP is also about private interests, and as such it addresses both traditional issues such as intellectual property and patent rights, but also apparently adds new corporate protections such as the right to seek damages for lost profits deriving from a participating nation's sovereign action, such as raising the minimum wage, implementing environmental regulations or putting warning labels on cigarettes. Apparently, Americans can parse the difference between the public and private benefits of free trade agreements. A Pew Research Center poll in 2010 , Americans indicated overwhelming support for free trade while showing significant skepticism for free trade agreements .\nSupporters of free trade agreements have consistently suggested two strategies to protect workers from the impact of opening up domestic markets to global competition. The first is trade adjustment assistance and job retraining programs, which may be useful for those who lose their jobs but does little or nothing for those who keep their jobs but whose incomes are undermined by global wage competition. The second is education, claimed by many to be the silver bullet that will prepare American workers for new careers in the new economy of the future.\nEducational attainment is directly linked to family income and employment security. In the wake of the Great Recession this linkage has become increasingly stark. Three years after the 2008 collapse -- when the recession was officially over -- the unemployment rate for those with a college degree was half the rate for those with a high school degree, while the unemployment rate for those with a professional degree was half again the rate for those with a college degree. In a free trade world, higher education has become as essential for Americans as a high school degree was a half-century ago.\nBut even significant increases in the educational attainment of U.S. workers have failed to offset the impacts of globalization on middle class incomes. From 1980 to 2009, college participation rates--the percentage of high school graduates who enroll in two and four year colleges--rose steadily from 49.3 to 70.1 percent, yet over that same thirty-year period median per capita income remained stagnant in real terms. That is to say, increasing educational attainment may have led to increased job security for Americans that pursued higher education but it did not translate into real growth in median incomes, as global wage competition allowed companies to retain the economic benefits of significant increases in labor productivity.\nSince 2009, faced with cuts in federal Pell grants, significant tuition increases at state colleges and universities, and Congressionally-mandated increases in student loan costs, fewer high school graduates continued on to college. By 2013, the national college participation rate declined to 65.9 percent, with the decline most pronounced among low-income students, from a peak of 58.4 percent in 2007 to 45.5 percent in 2013. With the trend of reduced public funding of higher education unlikely to be reversed, it is reasonable to expect that the struggles of the middle class will only be exacerbated by the new proposed trade deal.\nAgainst that backdrop, the idea of building a moat around the country might look like an attractive path forward to many Americans. Considering a half-century of flat real wages that are at least in part attributable to the impacts of globalization, why should anyone be mocked by the president for advocating a position that might benefit those individual U.S. workers whose jobs will be put at risk? With armies of paid lobbyists fighting tooth and nail to have the interests of their corporate clients addressed in the TPP, why should workers and their families in Indiana or Ohio be asked to quietly accept the inevitability of one more trade deal so that others might prosper?\nPresident Obama's stance on TPP is that Americans should trust him. But even for those who fundamentally support free trade, the experience of the last half-century is hard to square with the president's conviction. The president can talk about the benefits of global trade to middle income Americans -- they have heard it all before -- but he ignores the fact that supporters of free trade have consistently declined to support measures that might assure that all Americans have affordable access to the higher education that is essential to their ability to prosper in a free trade world or to provide for a sharing of the economic benefits of globalization and productivity growth beyond senior management and investors.\nMr. Spock's utopian mantra on Star Trek that \"the needs of the many outweigh the needs of the few\" does not apply to our politics, where increasingly the loudest voices heard are those of the few. President Obama must know that this is not a debate about free trade--which Americans overwhelmingly support --but part of a larger, continuing debate about how we make the rules and who benefits in our economy and society. With corporate America and the Republican Party lined up four square behind the President, it seems unlikely that in this proposed trade deal the interests of the few are going to be set aside for the interests of the many, and it is understandable why the President's erstwhile allies are having a hard time taking him at his word.\nMore: Barack Obama Elizabeth Warren Trans Pacific Partnership Agreement American Middle Class Free Trade Tea Party Globalization David Ricardo", "external_links": ["http://buchanan.org/blog/obamas-republican-collaborators-15909", "http://www.nytimes.com/2015/05/09/business/nike-to-create-jobs-if-trans-pacific-partnership-is-approved.html?_r=0", "http://www.zerohedge.com/news/2015-05-09/multinational-trojan-horse-trans-pacific-partnership", "http://www.pewresearch.org/2010/11/09/americans-are-of-two-minds-on-trade/", "http://tradebenefitsamerica.org/resources/pew-research-poll-majority-americans-support-free-trade-agreements"], "published": "2015-05-12T00:39:00.000+03:00", "crawled": "2015-05-12T00:34:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}