{"organizations": [], "uuid": "fd4241b5d78d52059f79befe5340ef8e0e9ab79a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2921366/images/o-ELTON-JOHN-SENATE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/health-news/index.xml", "section_title": "Health News - The Huffington Post", "url": "http://www.huffingtonpost.com/elton-john/pepfar-funding-testimony_b_7226582.html?utm_hp_ref=health-news&ir=Health+News", "country": "US", "title": "Why I Met With President Obama and Testified Before the U.S. Congress", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Why I Met With President Obama and Testified Before the U.S. Congress", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-07T00:06:00.000+03:00", "replies_count": 0, "uuid": "fd4241b5d78d52059f79befe5340ef8e0e9ab79a"}, "author": "Elton John", "url": "http://www.huffingtonpost.com/elton-john/pepfar-funding-testimony_b_7226582.html?utm_hp_ref=health-news&ir=Health+News", "ord_in_thread": 0, "title": "Why I Met With President Obama and Testified Before the U.S. Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nToday, I had the great honor of meeting with President Obama along with my husband and the Chairman of the Elton John AIDS Foundation, David Furnish. And I had the honor of testifying before the Senate Appropriations Committee to urge Congress to continue critical funding for PEPFAR, the President's Plan for Emergency AIDS Relief. \nPEPFAR continues to be crucial in the fight against HIV/AIDS because it addresses the global need for access to life-saving HIV/AIDS treatment and prevention medications. It's my hope that Congress holds steady in its commitment to PEPFAR, and ending this disease once and for all. Our work is not done. \nBelow is what I told Congress earlier today. \n*** \nIn 2003, at the invitation of Senator Ted Kennedy, I had the honor of speaking before the Senate HELP Committee in my capacity as the founder of the Elton John AIDS Foundation. \nI created the Foundation in 1992 to address the dire need to provide basic services and support to those dying from AIDS. Over the past 23 years, we have raised over $321 million to fund organizations that provide direct treatment and prevention efforts in dozens of countries around the globe. \nThe first time I testified before Congress twelve years ago almost no one had access to antiretroviral medicine in sub-Saharan Africa, where the epidemic was most acute. People were being infected and dying by the millions even though we very literally had the drugs that could save their lives in our hands. At that point, 12 million children in sub-Saharan Africa had been orphaned by AIDS. African leaders had declared AIDS to be a \"state of emergency.\" Worldwide, more than 30 million people were HIV-positive. \nThe disease left nothing but despair, ruin and fear in its wake. I saw it with my own eyes, as I traveled to the hardest hit regions on behalf of my Foundation and our grantees. Without the funds needed to make lifesaving drugs available in Africa, my Foundation invested in dramatically expanding palliative care and a hospice network. Across South Africa, Uganda and Kenya, we helped give a dignified death to more than 800,000 men, women and children. Then, we provided food, shelter and basic education to over three million orphans left in their wake. It was a compassionate response but it didn't solve the problem. \nIn those years, the epidemic was only escalating, until -- in a time of great need and urgency -- a Republican president and a bipartisan majority in the United States Congress created PEPFAR -- the President's Emergency Plan for AIDS Relief. Compassionate leaders from both sides of the aisle said to the international community: America can, and America will, lead the world in the global fight against AIDS. \nToday, thanks to the unprecedented actions of Congress, an HIV-positive mother in South Africa can give birth to a healthy, HIV-free baby who she can live to raise. \nToday, thanks to the generosity of the American people, 9.4 million men, women and children have access to life-saving antiretroviral treatment. \nWhere there was once despair, ruin and fear -- there is now hope, life, laughter and love. \nPEPFAR has done more than just save lives -- it has provided basic infrastructure and trained more than 100,000 health care workers to prevent future outbreaks in countries like Botswana, Tanzania, Kenya, and Uganda. \nCongress' strong support for the Global Fund for AIDS, TB & Malaria has enabled it to generate investments from governments and corporations worldwide and leverage $2 for every $1 invested by the U.S., thereby expanding its reach and its impact. I am grateful this has included up to 1 billion pounds from the United Kingdom over the past 3 years. \nFor my Foundation too, Congress' leadership has been transformational. \nWhat we once invested in hospice to care for the dying, has been repurposed to treat the living. My Foundation has tested over 3 million people for HIV in Africa and linked more than 400,000 patients to lifesaving treatment on the continent since 2012. \nCombined with efforts funded by the U.S. -- we've contributed to the 48 percent global reduction in mother-to-child transmission of HIV. \nIn short, we are no longer bailing out a sinking ship, we are helping steer it into safe harbor. \nMr. Chairman, because of the actions of this Congress, the course of the AIDS epidemic was altered for all of humanity. Because the American people had the optimism, the ingenuity, and the will to make a difference, the lives of millions of people half way around the world have been saved. \nBut I'm here today with a simple message: The AIDS epidemic is not over. And America's continued leadership is critical. \nThere is a window of opportunity before us -- a window through which we can very clearly see the end of AIDS -- within my lifetime . \nWe cannot afford to let that window close. If our efforts flag, drug resistance will surface, transmission rates will rise, and this disease, which knows no boundaries, will once again become a ruthless pandemic with disastrous and far-reaching consequences. I have stood at too many bedsides -- in America, in England and across Africa, helplessly watching people die in pain, to bear the thought that we might go back to those dark days. \nOn the other hand, if we continue the historic work of PEPFAR and the Global Fund... if we honor the 40 million lives lost over the past three decades... then we can and will see the day when AIDS is no longer a horrifying global killer, but a contained and controlled chronic illness. \nMr. Chairman, this is the most powerful legislative body in the world. And this Congress indeed has the power to end AIDS. You have the power to maintain America's historic commitment to leading the global campaign against this disease. \nI am here to ask you to use that power. To seize this window of opportunity. To change the course of history. \nAnd one day soon, I hope to extend my thanks -- to you, to this Congress, to the United States of America--not only for fighting this disease, but for ending it -- once and for all. \nSir Elton John is the Founder of the Elton John AIDS Foundation, www.ejaf.org More:", "external_links": [], "published": "2015-05-07T00:06:00.000+03:00", "crawled": "2015-05-07T00:26:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}