{"organizations": [], "uuid": "24e7753f43dc563e9da42175089b29fb20316e6b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/texasflood_053015getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/243524-obama-declares-texas-flooding-a-major-disaster", "country": "US", "title": "Obama declares Texas flooding a ‘major disaster'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama declares Texas flooding a ‘major disaster'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-30T16:48:00.000+03:00", "replies_count": 0, "uuid": "24e7753f43dc563e9da42175089b29fb20316e6b"}, "author": "Mark Hensch", "url": "http://thehill.com/blogs/blog-briefing-room/news/243524-obama-declares-texas-flooding-a-major-disaster", "ord_in_thread": 0, "title": "Obama declares Texas flooding a ‘major disaster'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 30, 2015, 09:48 am Obama declares Texas flooding a ‘major disaster' By Mark Hensch Getty Images President Obama declared flooding in Texas a significant natural disaster late Friday evening as rainfall continued drenching the Southwest. “A major disaster exists in the state of Texas,” Obama said, according to CNN . Massive storms have soaked Oklahoma and Texas all week, saturating ground there badly and leaving runoff with few places to go. ADVERTISEMENT CNN reported 28 people have died across both states as of Saturday morning, with 22 of them in Texas. CNN added that additional precipitation was predicted for Saturday, prompting fears that even more flooding could occur. The National Weather Service (NWS) released a map early Saturday showing flood warnings extending from the Texas Gulf Coast to Missouri. Most alerts last until late Saturday morning, the agency added, but particularly hard-hit areas like Dallas may see warnings in effect until Sunday. The NWS also cautioned area residents against driving in weekend downpours Saturday, noting that many flood victims become trapped in their cars and drown. It also blamed a cold front colliding with Gulf moisture for causing the crisis, producing as much as three inches of rain in some areas by late Friday evening. Texas A&M climatologists on Wednesday said May’s precipitation in the Lonestar State had produced its wettest month on record. Obama pledged federal assistance Tuesday to help Texas recover from the deadly weather pattern. “I assured Gov. Abbott that he could count on the help of the federal government,” Obama told reporters in the Oval Office that evening, citing talks with Texas Gov. Greg Abbott (R) earlier in the day. “I will anticipate that there will be some significant requests made to Washington,” he said. “My pledge to him is that we will expedite those requests.” Obama added that the Federal Emergency Management Agency had already sent personnel to aid recovery efforts on the ground. CNN said that Abbott, for his part, had declared a state of disaster in 70 Texas counties as of Saturday morning. That status allows the use of state resources for storm recovery responses, it said. The publication added that the crisis has also hit residents south of the border.", "external_links": [], "published": "2015-05-30T16:48:00.000+03:00", "crawled": "2015-05-30T17:03:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}