{"organizations": [], "uuid": "c9c08205cf714b0099f22ce19da9054b77493338", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150428175511-barack-obama-april-28-large-169.jpg", "site_section": "http://feedproxy.google.com/pacific/", "section_title": "pacific - Google News", "url": "http://edition.cnn.com/2015/05/12/politics/free-trade-fast-track-vote/", "country": "IL", "title": "Senate Dems block key Obama priority - CNN", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Senate Dems block key Obama priority - CNN", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T06:38:00.000+03:00", "replies_count": 0, "uuid": "c9c08205cf714b0099f22ce19da9054b77493338"}, "author": "", "url": "http://edition.cnn.com/2015/05/12/politics/free-trade-fast-track-vote/", "ord_in_thread": 0, "title": "Senate Dems block key Obama priority - CNN", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Senate Dems block key Obama priority By Dana Bash , Ted Barrett, Alexandra Jaffe and Eric Bradner , CNN Updated 2313 GMT (0613 HKT) May 12, 2015 JUST WATCHED Here's why the TPP is such a big deal 03:24 Washington (CNN) President Barack Obama is privately working with Senate Democrats to find a way forward for his free trade initiative. After Democrats banded together to rebuke their own party's President on a key trade bill Tuesday afternoon, Obama huddled with some of those senators -- including several who have publicly expressed support for the bill, called trade promotion authority -- to \"discuss a path forward for this legislation,\" an administration official said. Obama is scrambling to save his biggest legislative priority in his remaining years in the White House. The bill, trade negotiators say, is necessary before the 11 other countries participating in the talks will agree to finalize the Trans-Pacific Partnership. \"The President reiterated his view, which he has shared in numerous similar conversations with members over the past several weeks, that passing TPA is an important step toward finalizing the Trans-Pacific Partnership -- the most progressive trade agreement in our history, which levels the playing field for American workers and puts in place new, high-standards environmental, labor, and human rights protections,\" the administration official said. It became clear that Obama would suffer a major setback Tuesday afternoon when roughly 14 pro-trade Democrats emerged from a meeting with other Senate Democrats saying they wouldn't vote to take up the trade bill -- which then failed on a 52-45 vote. The Democrats complained that Senate Majority Leader Mitch McConnell was refusing to add a package of pro-worker provisions to the bill that many in the GOP see as unrelated and too costly. \"What we just saw here is pretty shocking,\" McConnell said on the Senate floor after the vote. JUST WATCHED W.H.: False criticism unnecessary on trade deal 01:35 PLAY VIDEO Trade highlights Democrats' divorce from Obama \"What we've just witnessed here is the Democratic Senate shut down the opportunity to debate the top economic priority of the Democratic President of the United States,\" he said. Other Republicans lashed out, too, saying they were furious to see Democrats stand in the way of a rare agreement with the White House. \"We had this pretty well agreed to until, all of a sudden, we had this mess on our hands,\" said Senate Finance Committee Chairman Orrin Hatch, the Utah Republican who sponsored the measure. His Democratic co-sponsor, Sen. Ron Wyden of Oregon, was among the pro-trade Democrats who voted against the bill, saying it needs enforcement provisions included in a broader trade package. JUST WATCHED Obama calls out Elizabeth Warren 04:04 PLAY VIDEO Opposition to the measure, which would allow for quick approval of the 12-country free-trade agreement known as the Trans-Pacific Partnership, has been building among progressive Democrats for some time. But there was still hope at the White House that aggressive lobbying from Obama would be enough to cobble together votes needed to at least allow the Senate to debate the bill. Obama's cars claim in trade deal running on empty? The tricky politics of trade have created unusual partnerships heading into the vote. Sen. Elizabeth Warren, a liberal darling, and Sen. Rand Paul, a conservative running for the 2016 GOP presidential nomination, both oppose the measure. \"While Sen. Paul has always been a strong advocate of free trade, he is hesitant to give blanket authority on a trade agreement that has yet to be seen,\" a Paul aide said. Warren and her fellow progressives have long been an outspoken opponent of the bill for the same reason -- that it largely removes Congress' ability to weigh in on the deal until after it's been negotiated, a process that critics say has been done in secret and in close cooperation with lobbyists and special interests. Warren reiterated those complaints in an interview with NPR Tuesday morning. \"The way I see this, that's a tilted process, and a tilted process yields a tilted result,\" she said. More broadly, progressives are wary of a new free-trade deal because they believe it would draw jobs overseas and hurt American workers. During a speech at the National Press Club on Tuesday, Warren gave voice to those concerns, warning that \"this country is in real trouble.\" \"We cannot continue to run this country for the top 10%. We can't keep pushing through trade deals that benefit multi-national companies at the expense of workers,\" she said. \"Government cannot continue to be the captive of the rich and the powerful. Working people cannot be forced to give up more and more as they get squeezed harder and harder.\"", "external_links": [], "published": "2015-05-13T06:38:00.000+03:00", "crawled": "2015-05-14T03:01:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}