{"organizations": [], "uuid": "9b11c1f01024e5c5e105c0618373761b17bd419c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/bushjeb_041715fr.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/240726-bush-defiant-on-immigration-im-right-about-this", "country": "US", "title": "Bush defiant on immigration: ‘I’m right about this’", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Bush defiant on immigration: ‘I’m right about this’", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T01:13:00.000+03:00", "replies_count": 0, "uuid": "9b11c1f01024e5c5e105c0618373761b17bd419c"}, "author": "jtaylor@thehill.com (Jonathan Easley)", "url": "http://thehill.com/blogs/ballot-box/240726-bush-defiant-on-immigration-im-right-about-this", "ord_in_thread": 0, "title": "Bush defiant on immigration: ‘I’m right about this’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "April 30, 2015, 06:13 pm Bush defiant on immigration: ‘I’m right about this’ By Jonathan Easley \nA feisty Jeb Bush gave a full-throated defense of his immigration stance in front of a Washington audience on Thursday, laying out the economic case that reforms he champions could return the nation to prosperity. \nBush took a swipe at Wisconsin Gov. Scott Walker, a likely opponent against Bush for the Republican presidential nomination next year, for saying that he favors limiting legal immigration to the U.S. as a means of preserving jobs in the nation for current citizens. ADVERTISEMENT “I don’t think it’s a zero-sum game,” the former Florida goveror said in a question-and-answer session at the National Review Ideas Summit. “I think if we start thinking it’s a zero-sum game, we’ll start playing the game President Obama plays, and it’s just the wrong approach.\"\nBush argued that immigration reform could bring about an influx of new talent that would keep the U.S. in position to compete with foreign nations that have made gains in technology and other sectors. \nHe warned that failure to reform the immigration system could put the U.S. in the same position as Japan and some European countries with declining populations. \n“If you want to grow at 4 percent per year instead of 2 percent per year, you need younger, more dynamic people inside of our economy that are productive,” he said. “You can’t do it by a declining population or this pathetic productivity growth.” \n“America is at our best when we’re young, inspirational and dynamic, and so maybe I’m stubborn,” Bush continued. “I’m willing to listen to other views on this ... but I think I’m right about this. If we’re going to grow economically, we need to figure out how to get this fixed.” \nLike many Republicans, Bush favors increased border security. He also argues that the nation should increase the number of immigrants who seek to come to the country for economic reasons, while limiting those who are merely seeking to come to reunite with family. \nBush argued that Republicans are playing into the hands of Democrats by failing to act on immigration reform, saying that President Obama will continue to use it as a wedge issue. He believes the GOP will continue to be stung by those in the party who chase away minority groups that would otherwise be open to their message. \n“We have to be more inspirational in our message and our tone has to be more inclusive as well,” Bush said. \nBush was pressed on immigration reform at length by Rich Lowry, the editor of the conservative National Review magazine, which has been critical of Bush on the issue. \n“I just think you’re wrong on immigration, to be honest with you, and you think I’m wrong,” Bush said in one exchange. “I just honestly believe that if we fix the legal part that’s not working, we could grow our economy much faster. We’d be younger and more dynamic.” \nBush’s fierce defense won him support from the crowd of conservatives, who cheered some of his more impassioned responses on the matter. \nAlong with Common Core, immigration is one of the biggest hurdles for Bush in the GOP primaries. \nThe former Florida governor faces hostility from conservative activists that deride any pathway to citizenship for those in the country illegally as “amnesty.” He has said he won’t bend on his views even if it costs him politically as he seeks the GOP nomination for president. \nBut it could also be an opportunity for Bush, particularly if he makes it to the general election. \nHe has focused heavily in recent days on courting Hispanic voters. At the National Hispanic Christian Leadership Conference in Houston on Wednesday, Bush spoke in English and Spanish as he argued immigration reform represents an economic opportunity for the U.S. \nHe also made a moral argument for immigration reform, saying it would bring 11 million people “out from the shadows” so they could have an opportunity to “receive earned legal status.\" \nAnd on Tuesday, Bush was in Puerto Rico, where he endorsed statehood for the small island U.S. territory. Puerto Ricans can vote in the primaries, and make up one of the fastest-growing voter blocks in Bush’s home state of Florida.", "external_links": [], "published": "2015-05-01T01:13:00.000+03:00", "crawled": "2015-05-01T04:12:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}