{"organizations": [], "uuid": "8a95d32de2d5724e850bcea6e146bebd1da16962", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/25397/feed", "section_title": "Overnight Defense", "url": "http://thehill.com/policy/defense/overnights/241145-overnight-defense-immigration-push-in-defense-bill-hits-brick-wall", "country": "US", "title": "OVERNIGHT DEFENSE: Immigration push in defense bill hits brick wall", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT DEFENSE: Immigration push in defense bill hits brick wall", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-06T01:54:00.000+03:00", "replies_count": 0, "uuid": "8a95d32de2d5724e850bcea6e146bebd1da16962"}, "author": "mmali@thehill.com (Martin Matishak and Kristina Wong)", "url": "http://thehill.com/policy/defense/overnights/241145-overnight-defense-immigration-push-in-defense-bill-hits-brick-wall", "ord_in_thread": 0, "title": "OVERNIGHT DEFENSE: Immigration push in defense bill hits brick wall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT DEFENSE: Immigration push in defense bill hits brick wall By Martin Matishak and Kristina Wong - 05/05/15 06:54 PM EDT \nTHE TOPLINE. A renewed push to place illegal immigrants who serve in the U.S. armed forces on a path to citizenship could be headed for defeat. \nTwo amendments to the House draft of the fiscal 2016 national defense authorization (NDAA) bill could lead to the Defense Department allowing young illegal immigrants shielded from deportation by President Obama's executive actions to serve in the armed forces. \nBut, the language, which received bipartisan support when the House Armed Services Committee marked up its version of the defense policy bill, faces an uncertain future. ADVERTISEMENT \"We're not doing anything on immigration on the NDAA,\" Senate Armed Services Committee Chairman John McCain (R-Ariz.) told The Hill on Tuesday.\nMcCain said he would not risk including text in his version of the legislation because the more right-leaning House could kill the must-pass bill. \n\"It would not be accepted by the House. I've got to have a House agreement; they would never agree to putting that on the NDAA,\" he said. \"If I put it on the defense bill, what happens in the House? The whole bill crashes. The defense bill is for defense, not for Dreamers.\" \nMeanwhile, Rep. Steve King (R-Iowa), one of the biggest GOP opponents of illegal immigration, said he plans to strip out those provisions when the defense authorization measure hits the House floor next week. \nIn a phone interview from Iowa, King said he's in the process of drafting an amendment to eliminate the language. \n\"There are a lot of members angered by this,\" King told The Hill. \nThe House Rules Committee is expected to announce next week which amendments are eligible for floor votes. GOP leadership will have to decide whether to let the immigration-related provisions stay in the bill or face backlash from conservatives. \n\"In any case, it's not going to be a peaceful discussion,\" King vowed. \nOBAMA NAMES NEW JOINT CHIEFS CHAIRMAN. From The Hill's Jordan Fabian: President Obama on Tuesday announced Marine Gen. Joseph Dunford Jr. as his pick to become chairman of the Joint Chiefs of Staff, praising him as \"one of the most admired officers in our military.\" \nDuring a Rose Garden ceremony, the president noted Dunford's combat experience and his reputation for being candid. \"I know Joe. I trust him,\" he said. \"He's already proven his ability to give me his unvarnished military advice based on his experience on the ground.\" If confirmed by the Senate, Dunford will replace Army Gen. Martin Dempsey, who has served as the president's top military adviser since 2011. Dunford is currently commandant of the Marine Corps. \nFrom 2013 to 2014, Dunford led coalition forces in Afghanistan; he also led a Marine unit during the 2003 invasion of Iraq. \nWhile Dunford's pick signals the administration's continued focus on battling Islamic extremists in the Middle East, Obama said Dunford will also be charged with overseeing the U.S.'s \"pivot\" to Asia and combating cybersecurity threats. \nThe combat-tested general is widely respected in Congress, paving the way for a smooth confirmation process. \nObama also named Air Force Gen. Paul Selva, commander of the U.S. Transportation Command, as vice chairman of the Joint Chiefs of Staff. \nGOP SENATORS PLEDGE TO SAVE A-10: Republicans on the Senate Armed Services Committee vowed Tuesday to reject the Pentagon's plans to retire the A-10 \"Warthog\" attack jet in their 2016 defense policy bill. \n\"We plan to ensure the A-10 is preserved so our men and women on the ground have the very best close air support capability because they deserve it,\" said Sen. Kelly Ayotte (R-N.H.), a panel member and vocal supporter of the aircraft. Ayotte hosted a press conference Tuesday morning with five fellow Republican committee members, including Chairman John McCain (R-Ariz.), to speak in support of the plane, which provides support for ground troops in battle. The committee plans to vote on the 2016 National Defense Authorization Act (NDAA) next week, which authorizes Pentagon spending and activities, and could prohibit the Air Force from taking any steps to retire the aircraft. The plane has become the subject of heated debate between supporters on Capitol Hill and the Pentagon. The A-10 played a large role in protecting ground troops in combat in Iraq and Afghanistan, but the Air Force says the plane needs to be retired to shift money and resources to newer aircraft like the F-35 Joint Strike Fighter. Air Force officials say retiring the plane would save $4 billion over five years, and that the close air support mission could be performed by other aircraft. However, supporters argue that the envisioned replacement, the F-35 Joint Strike Fighter, would not be ready in time, and that no other aircraft performs the mission as well. \"If we send them less than the best...we put Americans at risk and that is unacceptable,\" said Ayotte, whose husband is a former A-10 pilot. McCain called the Air Force's plan to retire the aircraft \"bewildering.\" He said flying the A-10 was more economical than the F-35 \"whose price continues to escalate\" and the \"astronomical\" cost of flying the B-1 bomber. \"We will be working with the House Armed Services Committee... to preserve the A-10,\" he added. The House panel voted last week to prohibit the Air Force from taking any actions to retire the aircraft. \nCLINTON 'HAS A LOT TO ANSWER FOR' ON BENGHAZI. Sen. Ron Johnson (R-Wis.) said former Secretary of State Hillary Clinton \"has an awful lot to explain\" about her reaction to the deadly attack in Benghazi, Libya. \nJohnson raised a number of questions about Clinton's handling of the incident, including why she didn't immediately call survivors of the 2012 attack on the U.S. compound and why security wasn't raised prior to the attack. \n\"You could have told the American people the truth,\" Johnson said Tuesday during an interview on MSNBC's \"Morning Joe.\" \"And bottom line is, now is the time for Secretary Clinton to tell ... the truth.\" \nJohnson, a top Democratic target in 2016, said that the State Department failed to respond to multiple requests to increase security at the compound. \n\"Those requests went -- not only went unanswered, they actually ramped down security basically to comply with their narrative that all was well, that their strategy was working. Nothing could be further from the truth,\" he said. \nOn Monday, Clinton agreed to testify to the House panel investigating the Benghazi attack and could appear later this month. But she refused a request to testify a second time. \n  Perry criticizes Texas governor for sending state guard to monitor US military \n- Corker expects 'overwhelming vote' on Iran bill Thursday \n- ISIS claims responsibility for Texas attack \n- WH: Texas shooting an 'attempted terrorist attack' \n- Senate barreling toward surveillance standoff", "external_links": [], "published": "2015-05-06T01:54:00.000+03:00", "crawled": "2015-05-06T05:32:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}