{"organizations": [], "uuid": "74eb07ad8995b61d1cc3734651e710e600107f02", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/clintonhillary_042015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/blogs/blog-briefing-room/news/240745-clinton-slams-republicans-on-abortion-bill", "country": "US", "title": "Clinton slams Republicans on abortion bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Clinton slams Republicans on abortion bill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T04:56:00.000+03:00", "replies_count": 0, "uuid": "74eb07ad8995b61d1cc3734651e710e600107f02"}, "author": "esmilowitz@thehill.com (Elliot Smilowitz)", "url": "http://thehill.com/blogs/blog-briefing-room/news/240745-clinton-slams-republicans-on-abortion-bill", "ord_in_thread": 0, "title": "Clinton slams Republicans on abortion bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "April 30, 2015, 09:56 pm Clinton slams Republicans on abortion bill By Elliot Smilowitz Hillary Clinton, through a spokeswoman, ripped congressional Republicans’ push to block a Washington, D.C., law on abortion and pledged to “fight to make it easier” for women and families. A representative for Clinton, a 2016 presidential candidate, said the GOP was trying to “overrule the Democratic process” in a statement released to CNN on Thursday night, shortly before the House vote on the measure. ADVERTISEMENT Washington’s law banned city employers from discriminating against employees for using abortion services. Congress has the power to void any measures passed by the city’s council. \"Hillary Clinton has fought for women and families and their right to access the full range of reproductive health care without interference from politicians or employers,\" Clinton campaign communications director Jennifer Palmieri said in the statement. \"Hillary will fight to make it easier, not more difficult, for women and families to get ahead and ensure that women are not discriminated against for personal medical decisions.\" Tags: Thousands of new Lerner emails... Congressional committees say an inspector general found roughly 6,400... Baltimore mom praised for smacking... \"I don't want him to be a Freddie Gray,\" Toya Graham said. Faith leaders demand that liberal... Scott Lively slammed Justices Kagan and Ginsburg for officiating same-sex... Brent Budowsky: Holy war against... OPINION | Republicans lead a party that looks like little more than an... Internet up in arms over '... An activist was seemingly plucked off the streets in full view of news... Dems hammer Japanese prime... Honda said Abe's \"refusal to squarely face history\" is an insult to so-... GOP unveils budget deal that seeks... The deal would approve more than $5 trillion in spending cuts over a... Baltimore teen disciplined by mom... \"I understand how much my mama really cares about me,” Michael Singleton... Sanders to launch presidential bid The independent senator will enter the Democratic fray Thursday to... Obama accidentally crashes WH... The president walked in on some of the journalists who cover him having... Young voters want a Democrat in... A poll of millennials shows a Democrat has wide support among 18-29-year-... Senators clash over Iran votes Democrats are warning that all bets are off if controversial amendments... Justice Kennedy doesn't reveal... The Supreme Court's most frequent swing vote sent mixed messages Tuesday. Dem to bring Korean 'comfort woman... Rep. Mike Honda (D-Calif.) has the Japan government of failing to own up... Senators vote to block EPA’s use... A Senate committee voted Tuesday to prohibit the Environmental Protection... Reid: 'Journalism doesn't exist' Reid hailed a man who peddled a false story about the minority leader... How Jeb Bush will win in 2016 Bush will find only one path to victory in 2016: through his brother,... Paul blames 'breakdown in the... '16 GOP hopeful says there are \"root, cultural causes\" for violence but \"... Carson slams rioters: 'It makes no... “Reacting out of anger seldom leads to anything helpful,” the possible... Sanders: ‘I am running for... The Vermont Independent told the AP he was all-in for 2016 on Wednesday.", "external_links": [], "published": "2015-05-01T04:56:00.000+03:00", "crawled": "2015-05-01T05:50:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}