{"organizations": [], "uuid": "32badf61575786c072e0829182c3c13cc553229d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news-legislation-trade-and-agriculture/242598-obama-promises-strong-customs", "country": "US", "title": "Obama promises strong customs bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama promises strong customs bill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-20T01:47:00.000+03:00", "replies_count": 0, "uuid": "32badf61575786c072e0829182c3c13cc553229d"}, "author": "nstanage@thehill.com (Vicki Needham)", "url": "http://thehill.com/blogs/blog-briefing-room/news-legislation-trade-and-agriculture/242598-obama-promises-strong-customs", "ord_in_thread": 0, "title": "Obama promises strong customs bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 19, 2015, 06:47 pm Obama promises strong customs bill By Vicki Needham \nPresident Obama said Tuesday he is ready to work with Congress to get the strongest possible customs enforcement bill to his desk by the end of June. \n“I look forward to working with both chambers to improve certain provisions and to ensure swift, strong and effective enforcement,” the president said in a statement. \n“These critical enforcement tools are complementary to new trade agreements.” ADVERTISEMENT On Monday, House and Senate leaders agreed to conference a customs enforcement bill and move quickly to enact it.\nSenate Finance Committee Chairman Orrin Hatch (R-Utah), House Ways and Means Committee Chairman Paul Ryan (R-Wis.) and Senate Finance Committee ranking member Ron Wyden (D-Ore.) said they would go to conference immediately after the House passes its enforcement bill, which is expected sometime in early June. \nThe vow to send the bill to Obama is expected to alleviate the concerns of some Senate Democrats worried that trade promotion authority, or fast-track, legislation would take precedence and leave other trade bills behind. \nThe move comes as Republican and centrist Democratic lawmakers are trying to gather up enough support to pass the fast-track authority that Obama says he needs to complete the Trans-Pacific Partnership (TPP) and a trade deal with the European Union. \nFast-track power would limit Congress to an up-or-down vote on trade deals negotiated by the White House. \nThe customs bil l includes tools to address unfair currency practices and strengthen the U.S. ability to improve the enforcement of trade rules. It also repeals a long-standing exemption that allows products to enter the United States if they are made by child and forced labor but aren't available here in sufficient quantities to meet demand. \n\"I have made rigorous trade enforcement a central pillar of U.S. trade policy, and we have moved aggressively to protect American workers and to improve labor laws and working conditions with trading partners across the globe,\" the president said. \nThe Senate easily passed its customs measure last week on a 78-20 vote. \nBut it includes a controversial amendment by Sen. Charles Schumer (D-N.Y.) cracking down on currency manipulation by trading partners. \nThe Schumer amendment isn’t expected to survive a conference because it is opposed by the White House. \nSome Democrats wanted all of the trade bills wrapped into a package. But an agreement reached last week moved up the customs bill and a trade preferences measure for nations in sub-Saharan Africa ahead of consideration of the combined fast-track and Trade Adjustment Assistance legislation, which started Tuesday. Tags:", "external_links": [], "published": "2015-05-20T01:47:00.000+03:00", "crawled": "2015-05-20T19:46:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}