{"organizations": [], "uuid": "21582f5ac17ffce83c112a69febe02161f5e4ff0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2952614/images/o-ALASKAN-ARCTIC-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/travis-nichols/obama-to-arctic-drop-dead_b_7275590.html", "country": "US", "title": "Obama to Arctic: \"Drop Dead\" | Travis Nichols", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama to Arctic: \"Drop Dead\" | Travis Nichols", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-15T00:11:00.000+03:00", "replies_count": 0, "uuid": "21582f5ac17ffce83c112a69febe02161f5e4ff0"}, "author": "Travis Nichols", "url": "http://www.huffingtonpost.com/travis-nichols/obama-to-arctic-drop-dead_b_7275590.html", "ord_in_thread": 0, "title": "Obama to Arctic: \"Drop Dead\" | Travis Nichols", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On Monday, President Obama gave Royal Dutch Shell permission to drill in the Alaskan Arctic this summer. It was the President's last, best chance to leave an historic environmental legacy that started at the top of the world. Now, while Obama is the first U.S. president to acknowledge climate change in his speeches , America's 21st century climate legacy will happen despite his actions in the Arctic, not because of them.\nClimate activist Bill McKibben even went so far as to say approving Arctic drilling was climate denial of the most insidious sort. The President has always prided himself as the ultimate \"reasonable man\" in difficult policy discussions, railing against false choices and outdated paradigms, so it has to sting to get lumped in with Good Space Guy Steve and Jim Inhofe. But there he is. Even oil industry leaders are saying Shell's plan \"does not make any sense\" and is \"too complicated is too expensive and too risky.\"\nIf, as the President has said, we must change the way we use energy to keep the worst effects of climate change from destroying the planet, then we can't let extreme fossil fuel projects like Arctic drilling go forward. It's that simple.\nObama's own experts agree there is a 75% chance of a major spill if Shell gets what it wants out of the Arctic. But even if everything breaks right for Shell -- even if there are no grounded rigs, exploding equipment, or crushed domes like last time -- it's still a global disaster. The scientific journal Nature has said definitively Arctic oil must stay in the ground if we're going to have a chance against climate change. We're all living with droughts, heat waves, and super storms boosted by global warming. Arctic drilling is going to make all of that worse .\nThat's why what's happening in Seattle is so inspiring. Despite all the \"reasonable men\" who argue that Arctic drilling is inevitable, that fossil fuels are a necessary evil, that anyone who says a word against Big Oil is a hypocrite, people from around the city and the region have stood up and said no to Arctic drilling and yes to saving the planet. It hasn't been easy, but it has shown courage and leadership. And while it's gravely disappointing that the President of the United States can't show the same courage as the Raging Grannies , I'm thrilled the grannies are here to show him the way.\nBut it's not just the grannies or the greenies in Seattle, it's people from every walk of life who have the vision of a world powered by clean energy. The mayor, the city council, and even the Port of Seattle have all said Shell has no place in the Arctic, and its Arctic destroyers have no place in Seattle. The movement to save the Arctic is a once in a generation opportunity. Obama couldn't see that, but Seattle does. And people around the world are joining the nearly 7 million people in the movement already. This is the kind of change that will last if we can make it happen. If the culture changes, the politicians will fall in line. They always do.\nFollow Travis Nichols on Twitter: www.twitter.com/travisjnichols\nMore: Barack Obama Arctic Climate Change Gas & Oil Bill McKibben Greenpeace Alaska Seattle This Blogger's Books and Other Items from... See Me Improving (Lannan Literary Selections)\nby Travis Nichols The More You Ignore Me\nby Travis Nichols", "external_links": [], "published": "2015-05-15T00:11:00.000+03:00", "crawled": "2015-05-15T02:22:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}