{"organizations": [], "uuid": "a0974c8deda22551318c745b8a08d8189373a3c1", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/boxerbarbara_032714gn.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/floor-action/senate/241975-senate-dems-blast-house-abortion-bill", "country": "", "title": "Senate Dems blast House abortion bill | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Senate Dems blast House abortion bill | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-14T00:22:00.000+03:00", "replies_count": 0, "uuid": "a0974c8deda22551318c745b8a08d8189373a3c1"}, "author": "", "url": "http://thehill.com/blogs/floor-action/senate/241975-senate-dems-blast-house-abortion-bill", "ord_in_thread": 0, "title": "Senate Dems blast House abortion bill | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 13, 2015, 04:43 pm Senate Dems blast House abortion bill By Jordain Carney Greg Nash Senate Democrats are slamming House Republicans over legislation that would ban most abortions 20 weeks after conception, shortly before an expected vote on the proposal. \nSens. Patty Murray (D-Wash.), Tammy Baldwin (D-Wis.), Barbara Boxer (D-Calif.) and Richard Blumenthal (D-Conn.) took to Twitter on Wednesday to lambast the legislation hours ahead of an expected vote in the House on the abortion bill. Boxer called the legislation insulting \"to women everywhere.\" This GOP abortion ban is an insult to rape and incest survivors, to pregnant women facing a health crisis and to women everywhere. — Sen. Barbara Boxer (@SenatorBoxer) May 13, 2015 ADVERTISEMENT The California Democrat said separately that the legislation assumes victims of rape or incest \"are lying and creating unconscionable barriers to care.\" The bill is expected to pass the House, though it's unlikely to see a vote in the Senate. Either way, the White House has also threatened to veto the legislation if it reaches President Obama's desk. Murray said the abortion restrictions are \"extreme, dangerous, and unconstitutional.\" GOP bill #HR36 would mean an extreme, dangerous, and unconstitutional restriction on women’s reproductive rights. #StopTheBan — Senator Patty Murray (@PattyMurray) May 13, 2015 Baldwin added that supporters of the legislation \"think they know better than women & doctors. The fact is: they don’t.\" \nThe House originally intended to vote on the abortion legislation in January, but cancelled a vote after some Republicans voiced concerns about a requirement that rape victims report to the police before they have the procedure. Meanwhile, Blumenthal tied the abortion legislation to a need to bolster infrsastructure, calling the vote a \"show of misplaced priorities.\" In a show of misplaced priorities, the House is choosing to vote to further restrict abortion rights instead of addressing infrastructure. — Richard Blumenthal (@SenBlumenthal) May 13, 2015 Tags: ", "external_links": [], "published": "2015-05-14T00:22:00.000+03:00", "crawled": "2015-05-14T00:22:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}