{"organizations": [], "uuid": "06599b243585c3775a361b1cf6deb07abb60b8db", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/brownsherrod_041523gn.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/241942-brown-passes-on-apologizing-for-suggesting-obama-is-sexist", "country": "", "title": "Brown brushes off suggestions he apologize for suggesting Obama is sexist | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Brown brushes off suggestions he apologize for suggesting Obama is sexist | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "06599b243585c3775a361b1cf6deb07abb60b8db"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/241942-brown-passes-on-apologizing-for-suggesting-obama-is-sexist", "ord_in_thread": 0, "title": "Brown brushes off suggestions he apologize for suggesting Obama is sexist | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 13, 2015, 01:57 pm Brown brushes off suggestions he apologize for suggesting Obama is sexist By Ben Kamisar \nSen. Sherrod Brown (D-Ohio) brushed aside a suggestion from the White House that he should apologize to President Obama for implying that Obama’s criticism of Sen. Elizabeth Warren (D-Mass.) was sexist. \nBrown was asked on MSNBC’s “Andrea Mitchell Reports” to respond to White House press secretary Josh Earnest, who said he was “ confident” the Ohio Democrat would apologize . ADVERTISEMENT “Do you have any apologies to offer to the president about [those] comments,” Andrea Mitchell, the show’s host, asked Brown.\n“I don’t want this to be personal either way,” he said. \n“This, to me, is about how we put people to work, and how our workers are retrained, and how we enforce trade rules and take care of those workers that inevitably lose their jobs from wrong-headed trade agreements.” \nBrown bashed Obama on Tuesday for referring to Warren by her first name in response to her criticism of his push for a trade deal. The National Organization for Women echoed Brown's comments. \n“I’m not going to get into more details. I think referring to her as first name, when he might not have done that for a male senator, perhaps?” the senator said. \nBut Earnest, Obama’s spokesman, pushed back at that assertion Wednesday on MSNBC’s “Morning Joe,” where he noted that the president has a “personal relationship with Sen. Warren” and calls many senators by their first names. \nHe added later during the daily White House briefing that he doesn’t “necessarily expect a public apology” from Brown. Tags: ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T02:06:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}