{"organizations": [], "uuid": "0474ec2e916e180185730014f3e0f11ae802ce90", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/veteransaffairsva_032615getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/242841-senate-panel-advances-funding-bill-that-would-let-va-doctors-recommend-medical", "country": "US", "title": "Senate panel votes to end VA ban on medical marijuana", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate panel votes to end VA ban on medical marijuana", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-21T21:42:00.000+03:00", "replies_count": 0, "uuid": "0474ec2e916e180185730014f3e0f11ae802ce90"}, "author": "rshabad@thehill.com (Rebecca Shabad)", "url": "http://thehill.com/policy/finance/242841-senate-panel-advances-funding-bill-that-would-let-va-doctors-recommend-medical", "ord_in_thread": 0, "title": "Senate panel votes to end VA ban on medical marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate panel votes to end VA ban on medical marijuana Getty Images By Rebecca Shabad - 05/21/15 02:42 PM EDT \nThe Senate Appropriations Committee on Thursday advanced a $77.6 billion funding bill for military construction and veterans benefits that includes an amendment allowing Veterans Affairs doctors to recommend the use of medical marijuana. \nThe amendment from Sens. Jeff Merkley (D-Ore.) and Steve Daines (R-Mont.) won approval in an 18-12 vote. \nSen. Mark Kirk (R-Ill.), the chairman of the subcommittee that oversees the funding bill and a veteran of the Navy Reserve, urged his colleagues to vote against the amendment. ADVERTISEMENT A 2011 directive by the Veterans Health Administration prohibits agency doctors from consulting patients about medical marijuana use.\n“It’s an enormous inconvenience to our veterans,” said Merkley, who explained that current law forces veterans to seek a medical appointment outside of the VA. \nHouse Democrats attempted to add a similar amendment to the lower chamber’s version of the bill, but failed to win enough votes. \nOverall, the bill is $5.5 billion above the current funding level, but $1.2 billion less than President Obama’s request. The House passed its version of the bill late last month, about $1 billion less than the Senate’s. \nMilitary construction projects would receive $8.1 billion, $1.5 billion above the 2015 level. The bill would provide the Department of Veterans Affairs with $69.2 billion. \nThe bill funds missile defense programs, military family housing, military medical facilities and the Defense Department’s educational facilities. It also funds VA medical services, the agency’s electronic health records, efforts to reduce the disability claims backlog and construction. \nSen. Barbara Mikulski (D-Md.) said the Veterans’ Benefits Administration would be fully funded at $2.69 billion in the bill. \nUnlike the House bill, the Senate’s version does not use Pentagon war funding. \nA bipartisan group of lawmakers in the House attempted to strip provisions that contain $532 million in overseas contingency operations (OCO) funding for military construction projects. That amount, however, is only a miniscule amount of the $96 billion Republicans want to use for defense and foreign operations. \nThe difference, however, could split Republicans over using the war fund to circumvent budget ceilings. \nThe committee also advanced a $35.4 billion bill funding energy and water programs Thursday.", "external_links": [], "published": "2015-05-21T21:42:00.000+03:00", "crawled": "2015-05-22T02:20:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}