{"organizations": [], "uuid": "eaf902caac3d2419a05f418b7a11046e8e87decd", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/042315_dcl_yemen_640.jpg", "site_section": "http://www.ClashNews.com/feed", "section_title": "ClashNews", "url": "http://www.foxnews.com/politics/2015/05/02/obama-administration-worries-increase-over-saudi-campaign-in-yemen/", "country": "US", "title": "Obama administration worries increase over Saudi campaign in Yemen", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Obama administration worries increase over Saudi campaign in Yemen", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-02T12:51:00.000+03:00", "replies_count": 0, "uuid": "eaf902caac3d2419a05f418b7a11046e8e87decd"}, "author": "ClashNews", "url": "http://www.foxnews.com/politics/2015/05/02/obama-administration-worries-increase-over-saudi-campaign-in-yemen/", "ord_in_thread": 0, "title": "Obama administration worries increase over Saudi campaign in Yemen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama administration worries increase over Saudi campaign in Yemen Published May 02, 2015 Facebook 0 Twitter 0 Email Print \nThe Obama administration is growing increasingly wary about the Saudi-led military intervention in Yemen and how to restore peace to a country wracked by sectarian divisions, endemic poverty and the Al Qaeda offshoot posing the greatest threat to the American homeland. \nAmid rising concerns about the civilian death toll from the month-long bombing campaign, which the U.S. initially backed, new fears have arisen that arms supplied to pro-government forces by the Saudis and their coalition partners may fall into the hands of terrorists. \nU.S. officials said Friday that Secretary of State John Kerry may visit Saudi Arabia next week to discuss the issues and explore new strategies to end the violence and jumpstart mediation efforts between Iran-backed Houthi rebels and the internationally recognized government of exiled President Abed Rabbo Mansour Hadi. \nKerry had planned to extend his current trip to Sri Lanka and Africa with a stop in Israel, if Prime Minister Benjamin Netanyahu's government was formed in time, but will likely re-route to Riyadh instead, the officials said. The visit to Israel would have come at a time of tension between the two longtime allies over negotiations with Iran on its nuclear program. \nThe Arab bombing campaign began a month ago after the Iran-backed Houthis took over the capital of Sanaa and then chased the Western- and Saudi-backed Hadi into exile. The Shiite rebels and their allies made major advances this week in Aden, Yemen's second largest city, casting doubts on the effectiveness of the Saudi-led mission. \nIn addition to the battlefield situation, the White House is deeply concerned about the growing number of civilian deaths and Saudi weapons deliveries to inadequately vetted local fighters. The officials weren't authorized to speak publicly on the matter and demanded anonymity. \nYemen's exiled government earlier this week put the civilian death toll for the past month at 1,000. That is nearly double the number U.N. agencies have announced. From its tally, UNICEF said at least 64 children were killed by airstrikes. The Saudis insist they've taken great pains to minimize civilian casualties. \nThe Saudi government also acknowledges providing military support to pro-government forces battling against the Houthis and fighters loyal to Yemen's former autocrat, Ali Abdullah Saleh. The U.S. has provided intelligence and logistical support to the Saudi bombing campaign. \nAsked about vetting local fighters, Saudi Ambassador Adel al-Jubeir told a Washington news conference last week that his government was doing \"as best as we can.\" Al-Jubeir was appointed this week as the new Saudi foreign minister. \nPublicly, the Obama administration has given the Saudi-led intervention its full support. \nBut U.S. officials have described top aides of President Barack Obama as increasingly concerned that arms may end up with individuals and groups that have questionable motives or affiliations — as occurred with the flood of weapons that reached Libya and Syria after civil wars erupted there in 2011. \nIn Libya, weapons and a NATO-led bombing campaign helped militant groups oust dictator Moammar Gadhafi's government. But the country has been wracked by instability ever since. And one of the armed groups that gained prominence in the fighting was accused of leading the attack on the U.S. diplomatic post in Benghazi only a year later that killed Ambassador Chris Stevens and three other Americans. \nIn Syria, military supplies from several Arab governments aided the rebellion against President Bashar Assad's government. However, the lack of coordination and control, especially in the conflict's early days, led to the growth of Al Qaeda-linked affiliates and the militants who became the Islamic State and seized a third of Syria and neighboring Iraq. \nThe threat is obvious in Yemen, where Al Qaeda in the Arabian Peninsula, the group's most lethal offshoot, has seized on years of instability to expand its footprint and plan several audacious terror attacks. It is blamed for trying to bring down a U.S.-bound airliner with an explosive hidden in a bomber's underwear in 2009 and a plot a year later to send bombs hidden in toner cartridges on planes headed to the United States. \nThe chaos in Yemen prompted the U.S. to pull out its special operations forces in March, complicating the effort to counter AQAP. Gen. Joseph Votel, the top commander of U.S. special operations forces, said Friday in Washington that the loss of a U.S. troop presence in Yemen is \"a very great concern,\" and said he is looking for ways to work around it. \n\"Our people are innovative and they find ways,\" Votel said. \nBeyond AQAP, intelligence officials are closely watching to see if the Islamic State gains a foothold in Yemen. The group claimed responsibility for two mosque bombings in Sanaa in March that killed more than 130 people. \nAsked about the Saudi level of vetting, State Department spokeswoman Marie Harf said this week that the U.S. is calling on all sides involved in fighting to comply with international humanitarian law. She called that \"a part of what goes into vetting ... because it includes the obligation to distinguish between military objectives and civilian objectives, to take all feasible precaution to minimize harm to civilians.\" Advertisement", "external_links": [], "published": "2015-05-02T12:51:00.000+03:00", "crawled": "2015-05-02T13:24:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}