{"organizations": [], "uuid": "95b40b677ab984e0568ff8fa440541435bf2f975", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051815getty.jpg", "site_section": "http://thehill.com/taxonomy/term/43/feed#", "section_title": "The Hill: International Policy", "url": "http://thehill.com/policy/international/242824-obama-has-personal-interest-in-preventing-iran-nuke", "country": "US", "title": "Obama has 'personal interest' in preventing nuclear Iran", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama has 'personal interest' in preventing nuclear Iran", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-21T20:27:00.000+03:00", "replies_count": 0, "uuid": "95b40b677ab984e0568ff8fa440541435bf2f975"}, "author": "kballuck@thehill.com (Jesse Byrnes)", "url": "http://thehill.com/policy/international/242824-obama-has-personal-interest-in-preventing-iran-nuke", "ord_in_thread": 0, "title": "Obama has 'personal interest' in preventing nuclear Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama has 'personal interest' in preventing nuclear Iran By Jesse Byrnes - 05/21/15 01:27 PM EDT \nPresident Obama, in an interview published Thursday, says he has a \"personal interest\" in making sure Iran does not acquire a nuclear weapon. ADVERTISEMENT “Look, 20 years from now, I’m still going to be around, God willing. If Iran has a nuclear weapon, it’s my name on this,” Obama told The Atlantic , referring to the pending nuclear deal between Tehran, Washington and five other Western powers.\n\"I think it’s fair to say that in addition to our profound national security interests, I have a personal interest in locking this down,\" Obama added. \nThe U.S., along with the rest of the permanent members of the United Nations Security Council — France, Great Britain, Russia and China — plus Germany, unveiled a framework deal in early April to limit Tehran’s nuclear program in exchange for sanctions relief. Negotiators hope to secure a final pact by June 30, despite strong international reservations. \nObama acknowledged in The Atlantic that Iran’s neighbors may still pursue their own nuclear ambitions after an agreement in response to Tehran’s capabilities, even though they have expressed satisfaction with inspection standards. \n\"Their covert—presumably—pursuit of a nuclear program would greatly strain the relationship they’ve got with the United States,\" emphasized Obama, who attempted to quell concerns from Arab nations during meetings last week at the White House and Camp David. \nObama also downplayed concerns in the new interview that the Iranian government might acquire billions of dollars from sanctions relief, stating, \"It is not a mathematical formula whereby [Iranian leaders] get a certain amount of sanctions relief and automatically they’re causing more problems in the neighborhood.\" \nThe interview touched on regional concerns on Iran, especially from Israeli Prime Minister Benjamin Netanyahu, an avowed opponent of a nuclear accord who addressed Congress on March 3, warning against a deal. \nAsked about the rationality of some Iranian hard-liners, Obama maintained the U.S. \"will continue to ratchet up the costs, not simply for their [Iran's] anti-Semitism, but also for whatever expansionist ambitions they may have.\" \nObama described Ayatollah Ali Khamenei, Iran's supreme leader who has been a staunch critic of the U.S., as \"anti-Semitic,\" but added that it \"doesn't preclude you\" from basic human concerns and economic interests. \n“Well, the fact that you are anti-Semitic, or racist, doesn’t preclude you from being interested in survival. It doesn’t preclude you from being rational about the need to keep your economy afloat; it doesn’t preclude you from making strategic decisions about how you stay in power,\" Obama said. \n\"And so the fact that the supreme leader is anti-Semitic doesn’t mean that this overrides all of his other considerations,\" he added. \nObama also touched on the relationship with Netanyahu, whom the White House chastised for his comments on the eve of his reelection that there would be no Palestinian state on his watch. \n\"When I am then required to come to Israel’s defense internationally, when there is anti-Semitism out there, when there is anti-Israeli policy that is based not on the particulars of the Palestinian cause but [is] based simply on hostility, I have to make sure that I am entirely credible in speaking out against those things, and that requires me then to also be honest with friends about how I view these issues,” Obama said. “Now that makes, understandably, folks both in Israel and here in the United States uncomfortable.\" Tags:", "external_links": [], "published": "2015-05-21T20:27:00.000+03:00", "crawled": "2015-05-22T07:06:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}