{"organizations": [], "uuid": "979eb18f076462521ee8fccdd10e05d7a20e0650", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/matthew-hoh/camp-david-president-obam_b_7309094.html", "country": "US", "title": "Camp David, President Obama, and the Refusal to Acknowledge History and Reality | Matthew Hoh", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Camp David, President Obama, and the Refusal to Acknowledge History and Reality | Matthew Hoh", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-20T01:24:00.000+03:00", "replies_count": 0, "uuid": "979eb18f076462521ee8fccdd10e05d7a20e0650"}, "author": "Matthew Hoh", "url": "http://www.huffingtonpost.com/matthew-hoh/camp-david-president-obam_b_7309094.html", "ord_in_thread": 0, "title": "Camp David, President Obama, and the Refusal to Acknowledge History and Reality | Matthew Hoh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This past week , the White House attempted to repair the damage done by neglecting its Gulf Arab allies as Syria flew apart at the seams. King Salman of Saudi Arabia rebuffed President Obama's invitation to join a group of Sunni Arab leaders at Camp David, as did the King of Bahrain -- even as Washington reasserted its security guarantees and announced new military sales to both countries. If your allies don't show up even when you are doing something for them, it's a good bet you've lost your appeal.\nYet courting Arab leaders precisely as they undermine U.S. objectives gets it almost exactly backward. America's failures, under both Barack Obama and George W. Bush, stem from its unwillingness to break with allies taking actions that will result in disaster -- and, perhaps just as destructively, its unwillingness to cooperate openly with adversaries taking actions that will benefit us.\nThe great irony is that it is America's own Arab allies that have created the Islamic State, and its adversary Iran that now fights it.\nFor all its support of Hezbollah, and its hostile rhetoric, Iran is at least a state. The Islamic State is simply a terrorist group. What reason do we have to doubt that with their military training, their battlefield experience, and their hatred of the United States, the Islamic State's minions will not one day do to us what al-Qaeda did on September 11th?\nFor months now, while the Obama administration and Congress have bickered over the terms of a deal that would relax economic sanctions on the Iranians in exchange for concessions on their nuclear program, U.S. air strikes have supported Iranian-led Iraqi offensives against the Islamic State and their Sunni allies. Yet even after the Islamic State has beheaded several American hostages for the whole world to see, the White House is hosting some of the very Gulf leaders whose support -- whether direct or indirect -- keeps it funded.\nThis strange pattern, in which Washington's words and deeds seem perpetually unmatched, has its roots in events that occurred, by American standards, an eternity ago.\nIn the 1990s, during the aftermath of the Soviet withdrawal from Afghanistan, it was two U.S. allies -- Pakistan and Saudi Arabia -- that gave us the Taliban. Yet after the September 11 attacks, the United States found itself in the peculiar position of fighting a group supported by its nominal allies in a war supported by its historical adversaries: Iran, India, Russia, and the Central Asian states of the former Soviet Union.\nBy now, few Americans remember that the United States turned its back on the retreating Soviets when then-foreign minister Eduard Shevardnadze asked Washington to participate in negotiations to create a coalition government in Afghanistan. That might have prevented the civil war in which the Taliban came to power. Yet rather than find a way to preserve an imperfect but sovereign government, Washington decided to humiliate the Soviets in their defeat -- and as a result, handed the country to a band of bloodthirsty rebels who proved accountable to no one.\nIn Afghanistan in the 1980s, Washington begged its allies to support the militants. In Syria now -- even with the September 11th attacks in hindsight -- Washington's indifference has effectively compelled them to do the same.\nHaving supported only the \"nice\" groups attempting to unseat Bashar al-Assad, and then shrugging as a bloody stalemate emerged, the United States induced its Arab allies to arm more effective but deeply nasty militants. As the Islamic State spread in Iraq, it committed horrendous human rights abuses, enslaving and butchering minority groups like the Yazidis, destroying priceless historical artifacts, and further destabilizing a region already embroiled in conflict.\nBy now, it seems clear that the region would have been better off if Bashar al-Assad's government had simply remained in power throughout Syria. By any measure -- human rights, regional stability, American national interests -- it would be hard to argue otherwise. The failure to predict as much stems from the persistent delusion that overthrowing unpleasant regimes necessarily brings about better ones.\nBut it also stems from Washington's deeper failure to judge states by their actions, rather than their words. It is the Saudis, the Qataris, the Emiratis, and America's other Gulf Arab allies who fund and arm the Islamic State and its fellow travelers ; and it is the supposedly perfidious Iranians who fight them.\nPrivately snubbing the Sunni states, as they struggled to overthrow Assad's regime in Syria and roll back growing Iranian influence across the region, has clearly done Washington no favors. But publicly embracing the Gulf States as they fund militants that make al-Qaeda look like a charity will prove even worse.\nMore: Frankenstein Islamic State Islamic State ISIS Barack Obama Saudi Arabia Camp David Bahrain UAE Iraq Syria Bashar Al Assad Al Qaeda Pakistan Hezbollah Iran September 11 George W Bush King Salman Soviet Union Taliban", "external_links": [], "published": "2015-05-20T01:24:00.000+03:00", "crawled": "2015-05-20T02:21:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}