{"organizations": [], "uuid": "bb121253e56b03cc82ec070a9d7926b89f1e8e97", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/bushjeb_041015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1625/feed", "section_title": "Presidential races", "url": "http://thehill.com/blogs/ballot-box/presidential-races/241515-jeb-bush-obama-administration-small-minded-and-intolerant", "country": "US", "title": "Jeb Bush: Obama administration 'small-minded and intolerant' to religious faith", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Jeb Bush: Obama administration 'small-minded and intolerant' to religious faith", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-09T01:16:00.000+03:00", "replies_count": 0, "uuid": "bb121253e56b03cc82ec070a9d7926b89f1e8e97"}, "author": "mmali@thehill.com (Jonathan Easley)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/241515-jeb-bush-obama-administration-small-minded-and-intolerant", "ord_in_thread": 0, "title": "Jeb Bush: Obama administration 'small-minded and intolerant' to religious faith", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 08, 2015, 06:16 pm Jeb Bush: Obama administration 'small-minded and intolerant' to religious faith By Jonathan Easley \nJeb Bush will blast the Obama administration as “small-minded and intolerant” to religious freedom in a commencement address Saturday at Liberty University, the nation’s largest Christian college. “As usual, the present administration is supporting the use of coercive federal power,” Bush will say, according to prepared remarks provided by his political team. “What should be easy calls in favor of religious freedom have instead become an aggressive stance against it. “Somebody here is being small-minded and intolerant, and it sure isn’t the nuns, ministers, and laymen and women who ask only to live and practice their faith,” Bush will continue. “Federal authorities are demanding obedience in complete disregard of religious conscience – and in a free society, the answer is 'No.'” ADVERTISEMENT The issue of religious freedom has been a hot-button political issue since Indiana Gov. Mike Pence (R) signed a controversial law earlier this year that critics argued would allow businesses to refuse service to gay people. Republicans, including Bush, came to Pence’s defense, arguing that the Religious Freedom Restoration Act protects the rights of those seeking to freely exercise their religious beliefs. In his remarks, Bush also appears to be allude to ObamaCare’s birth-control mandate. Earlier this year, the Supreme Court struck down a previous ruling in favor of the mandate. The former Florida governor will make the case on Saturday that “Christian conscience in action” is a greater force for good than government programs designed to help the needy. “Every day in the life of this nation, uncounted people are comforting the lonely, aiding the ill and discouraged, serving the weak and innocent, giving hope to the prisoner, and in every way they know, loving mercy and living with integrity,” Bush will say. “And all of that doesn’t happen by chance either, or because anyone has ordered it, or because there’s a federal program for it,” he will continue. “The endless work of Christian charity in America is what free people do when they have good news to share. It’s how free people live when they have a living faith.” Bush’s speech is a direct appeal to the social conservatives and evangelical Christian voters that make up a big slice of Republican primary and caucus voters. Bush has struggled mightily with the right flank of the party, and he’ll need to rally Christian voters if he’s going to have a shot in Iowa, the first-in-the-nation caucus state, that is typically kind to social conservatives. According to a Quinnipiac University poll released earlier this week, Bush is buried in seventh place in the Hawkeye State, taking just 5 percent support. Bush will be competing with a packed GOP field of candidates that may be a more natural fit for many evangelical Christian voters. Sen. Ted Cruz (R-Texas) launched his campaign from Liberty University earlier this year, and former Arkansas Gov. Mike Huckabee joined the presidential race this week decrying the nation’s moral decay. Dr. Ben Carson will also be looking to pull from that base of grassroots Republican conservatives. Tags:", "external_links": [], "published": "2015-05-09T01:16:00.000+03:00", "crawled": "2015-05-09T02:20:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}