{"organizations": [], "uuid": "d023b3898884c5b3b5ffc9b5c577a8df71518ff9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/speier1.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/floor-action/house/241944-house-dem-to-gop-stop-playing-doctor-with-abortion-bills", "country": "", "title": "House Dem to GOP: 'Stop playing doctor' with abortion bills | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "House Dem to GOP: 'Stop playing doctor' with abortion bills | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "d023b3898884c5b3b5ffc9b5c577a8df71518ff9"}, "author": "", "url": "http://thehill.com/blogs/floor-action/house/241944-house-dem-to-gop-stop-playing-doctor-with-abortion-bills", "ord_in_thread": 0, "title": "House Dem to GOP: 'Stop playing doctor' with abortion bills | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 13, 2015, 02:03 pm House Dem to GOP: 'Stop playing doctor' with abortion bills By Cristina Marcos \nRep. Jackie Speier (D-Calif.) donned a white lab coat on the House floor Wednesday while accusing House Republicans of federal overreach into women's healthcare choices. \nSpeier wore a doctor's uniform over her outfit to underscore her argument that lawmakers should stay out of women's personal decicsions to have abortions. The speech came during debate on a bill that would ban abortions after 20 weeks. \n\"I am just so perplexed by our willingness every time an abortion issue is brought up that we don the equivalent of a white coat. We believe that we are doctors in this august body. That we should be making decisions on behalf of women who are pregnant and their spouses and their physicians. That we know better than everyone else,\" Speier said in a floor speech. ADVERTISEMENT The California Democrat noted women have abortions for personal and physical health reasons with consultation from their doctors.\n\"What in the heck are we doing putting our noses in their lives? It is constitutional, members. It is legal in this country to have an abortion,\" Speier said. \nSpeier shared her experience of having had two abortions. One was at the tenth week of pregnancy when the fetus \"no longer had a heartbeat.\" The other was at 17 weeks. \n\"It was an extraordinarily painful experience,\" Speier said. \n\"Women who go through these experiences go through them with so much pain and anguish, and here we are as members of this body, trying to don another white coat. I think we should put this speculums down. I think we should stop playing doctor,\" Speier concluded. \nThe House will vote on the legislation later Wednesday afternoon. It was previously yanked from the floor in January when GOP women and centrists objected to language that only allowed exemptions for rape if the crime was reported to police. That provision is no longer in the revised bill. \nInstead, under the legislation negotiated by House GOP leaders over the last four months, doctors must ensure that women seeking abortions have received medical treatment or counseling at least 48 hours before the procedure. \nWednesday's floor vote is timed to coincide with the two-year anniversary of Kermit Gosnell's murder conviction for killing infants born alive during abortion procedures. Tags: ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T02:05:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}