{"organizations": [], "uuid": "86723f715b30fcb0efff12eac47a7b755573f40c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/marchforlife_012215gn7.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/241848-gop-ramps-up-abortion-fight", "country": "US", "title": "GOP ramps up abortion fight", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "GOP ramps up abortion fight", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T13:00:00.000+03:00", "replies_count": 0, "uuid": "86723f715b30fcb0efff12eac47a7b755573f40c"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/241848-gop-ramps-up-abortion-fight", "ord_in_thread": 0, "title": "GOP ramps up abortion fight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP ramps up abortion fight By Sarah Ferris - 05/13/15 06:00 AM EDT \nRepublicans are ramping up their attack on Roe v. Wade with a House vote Wednesday on a bill banning late-term abortions. \nWhile it’s unlikely to pass the Senate and reach President Obama’s desk, Republicans say they are playing a long game. ADVERTISEMENT They hope that, over time, support for prohibiting most abortions after 20 weeks of pregnancy will become widespread.\nAnti-abortion groups compare the issue to the fight over legislation halting partial-birth abortions, which was a victory for conservatives. \nAfter being initially rejected by President Clinton, the legislation was ultimately signed by President George W. Bush and upheld by the Supreme Court in 2003. \n“It will happen, no question. It will happen at some point,” Marjorie Dannenfelser, president of the anti-abortion Susan B. Anthony List, said about banning abortions at 20 weeks. \nRepublicans note that the Partial-Birth Abortion Ban Act survived court challenges, and they think the 20-week legislation will do so too — even though the bill appears to violate the Supreme Court’s landmark Roe v. Wade decision from 1973. \n“I think this is likely to get a challenge in the court, and I think it’s likely to prevail,” Rep. Chris Smith (R-N.J.), co-chairman of the Pro-Life Caucus, said in an interview. \nLegislation banning abortions after 20 weeks has already been blocked by the Supreme Court in three states, but similar laws remain on the books in 11 others. \nRepublicans are also laying down a marker for the 2016 elections, when they hope to win control of Congress and the White House. \n“I think there’s an awakening happening,” Smith added. “All the Republican candidates have signaled support on this.” \nSusan B. Anthony List launched a campaign earlier this year to make the 20-week ban into a litmus test for Republican hopefuls. By March, they said they’d achieved “complete unity” on the issue, which has also been prominent in recent polling. \nStill, the challenges in making abortion an issue in electoral politics are highlighted by the circuitous route the bill has taken to the House floor. \nThe legislation was abruptly pulled from the floor in January because of an intraparty dispute. \nBoasting more than 100 co-sponsors, the bill had been expected to easily clear the chamber. But the vote was canceled after some moderates and GOP women, led by Reps. Renee Ellmers (N.C.) and Jackie Walorski (Ind.), raised concerns about a provision requiring rape victims to report their crimes to the police. \nThe GOP centrists argued the bill could be political poison for a party seeking to win over young voters and women, and who had seen Senate candidates stumble over questions surrounding abortion and rape. \nRepublicans have spent months working with House Majority Leader Kevin McCarthy (R-Calif.) to tweak the bill. \nThe new version unveiled Monday eliminates the language on rape victims, though it does not change a provision that allows victims of incest to receive an abortion only if they are under 18 years old. \nAnti-abortion advocates say their push for new legislation is also a chance to force the court to consider years of new research about the viability of unborn babies — the lack of which was cited as a factor in the 1973 ruling. \nA dozen states have passed laws banning abortions after certain time periods. All but one law remains on the books because they have not been challenged. \nAnti-abortion advocates have accused Planned Parenthood and its allies of not challenging the 20-week bans because of the conservative-leaning courts in those states. \n“There has been a conscientious strategy on the part of the left not to challenge states with 20-week limits as part of their law in order to avoid what they call a ‘circuit split,’ ” said Ovide Lamontagne, the general counsel for Americans United for Life. \nIf courts take opposing sides on the ban, the Supreme Court would have to weigh in. \nBut abortion-rights advocates dispute that claim, arguing that there are fewer opportunities to find plaintiffs because fewer than 1 percent of women terminate their pregnancies after 20 weeks. \n“The reality is that abortion later in pregnancy is very rare, and in some states, these laws have taken effect because there are no providers of abortion after 20 weeks,” Helene Krasnoff, an attorney for Planned Parenthood, said. \nRepublicans have scheduled Wednesday’s vote to coincide with the two-year anniversary of Kermit Gosnell’s conviction on three murder counts for killing infants born alive during abortion procedures.", "external_links": [], "published": "2015-05-13T13:00:00.000+03:00", "crawled": "2015-05-13T17:06:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}