{"organizations": [], "uuid": "5735c716a9d9324d78d51a3888e7e12afecd7677", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2899880/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com//feeds/verticals/celebrity/index.xml", "section_title": "Celebrity - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/04/30/best-dressed-list_n_7183162.html?utm_hp_ref=celebrity&ir=Celebrity", "country": "US", "title": "Michelle Obama Is On Fire To Make This Week's Best Dressed List", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Michelle Obama Is On Fire To Make This Week's Best Dressed List", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T14:00:00.000+03:00", "replies_count": 0, "uuid": "5735c716a9d9324d78d51a3888e7e12afecd7677"}, "author": "Michelle Persad", "url": "http://www.huffingtonpost.com/2015/04/30/best-dressed-list_n_7183162.html?utm_hp_ref=celebrity&ir=Celebrity", "ord_in_thread": 0, "title": "Michelle Obama Is On Fire To Make This Week's Best Dressed List", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Our Favorite Looks Of 2015 of   Chris Hemsworth in Calvin Klein: An azure suit is one way to keep people on their toes. We'll admit, it's much harder to experiment with menswear, but Hemsworth did a terrific job at \"The Avengers: Age Of Ultron\" European premiere. The rest of his look is simple, making the color of his jacket and pants the focal point. Chris Evans in Gucci: Even if you're wearing a neutral outfit, opt for a pair of bright socks. Evans looks dapper in his traditional suit, but his socks show some personality. Xi Meng Yao: Wearing an LBD is always a safe option, but playing with shape and silhouette is an easy way to spice it up. Model Xi Meng Yao shows us that an architectural, one-shouldered neckline can take a dress from expected to extraordinary. Claire Danes in Narciso Rodriguez : A jumpsuit at a gala is always a bold move, but Danes achieved the right proportions for a standout look. Her neckline may be low, but it's well-balanced with her wide-leg pants, ensuring her ensemble doesn't skew too sexy. Laverne Cox in Marc Bouwer: That color though! Not only does it make her pop in a sea of black outfits, but the silhouette hugs her every curve and ensured she was the center of attention at the TIME 100 Gala. Kiernan Shipka in Valentino: Shipka has friends in fashionable places, like her pal Harper's Bazaar executive editor Laura Brown, pictured here. And clearly she's learned a thing or two from them. Her red dress is quite bright, but since it has a short hemline and short sleeves, it isn't too much. Freida Pinto in Monique Lhuillier: A suit does not need to look corporate; it can actually be great for nighttime. Pinto looks both fashion-forward and sophisticated at the \"Women In The World\" summit. Her low-cut black shirt and short 'do make her red carpet-appropriate. For someone who usually sticks to neutral colors, we were surprised to see Mrs. Kardashian West wearing a red jumpsuit on the somber occasion of visiting a memorial commemorating the 1915 mass killing of Armenians in the Ottoman Empire. There is no denying how beautiful she looks in this bold hue, and we wish she would break out the color more often. Red and pink is one of our favorite color combinations, and Snow's managed to make it look both fun and sophisticated. The color-blocked dress fits her body like a glove, and her gold accessories and sleek hair keep things simple to ensure that she's wearing the outfit -- not the other way around. Normally Coachella outfits annoy us, but here Bosworth is just the right amount of boho. All of these pieces work for daily life -- something you don't often see at the music festival. Leave it to Hemingway to wear all of spring's biggest trends at once -- and completely knock it out of the park. The model's high-waisted flared denim, white peasant blouse and brown leather purse work together in perfect harmony. She looks cool and casual for the dinner she is attending. It seems like the fashion world is currently obsessed with the '70s, but the '60s deserve a little attention, too. The actor's mod minidress looks sweet and sexy at the same time, which is perfect for the MTV Movie Awards. The honeycomb pattern (which is actually a very popular porcelain floor tile) adds visual interest, and we love how her bright pumps amp up the entire ensemble. Mary-Kate and Ashley who? The younger Olsen sister is bringing the heat in this outstanding ensemble. Though it looks like she's wearing a simple white T-shirt, this is in fact a gown. The top half of her dress is casual, but balanced out nicely by the dramatic, high-slit skirt. This will be an easy outfit to re-create come summer. That is one low neckline, but somehow this gown isn't too revealing. Maybe it has something to do with the long hemline, or the thicker straps, but the English actor's dress is the picture of sultry red carpet dressing. Blondes look great in black, and this is only further proof. Though Johansson's dress could have fallen into boring LBD territory, the mullet hemline and strapless neckline save it. Oh, and her killer 'do juxtaposed against her sweet dress is icing on the cake. She totally stole the show at the \"Avengers: Age Of Ultron\" premiere. In case you didn't already know, Lezark is a true fashion girl -- which is why you see her front row at every single runway show. And clearly the DJ has picked up a few tips from her time at Fashion Week: her dress is stylish because of the bib neck and crochet overlay, but still classic in its neutral hue. Every time we see Clooney out and about, she looks even better than before. Her outfit is very classic, but that python print collar makes it fashion-forward and secures her spot on the best-dressed list. Louis-Dreyfus' dress is a study in less is more. The actress' dress is very simple, but it fits her like a glove. The hunter green hue is a nice change on the red carpet and the band around her waist emphasizes her most narrow part. A dress with a galactic print could quickly skew overly kitschy, but the cut of this mod frock makes it just kitschy enough. Her blonde hair is a nice contrast to her navy dress and the short length ensures it isn't print overload. Is there anything better than culottes and a crisp white button-up? We think not. Not only does this outfit look insanely comfortable, but it's also a great way to look pulled together without having to wear a dress. You know it's officially spring when the citron yellow dresses come out. When picking a yellow dress, the shade is crucial and this one really pops against her fair complexion. The lace overlay and neutral shoes put this look over the top. It's no surprise that these two princesses have impeccable style, just look at their mother. Their Easter outfits are both age-appropriate and adorable. We are all for a tuxedo dress -- especially in a bright, bold color like this. The subtle nod to menswear with these extremely cool shoes is making Lake the Bell of the ball. Here's VB making yet another case for the turtleneck. While the high neck and the midi-length offers a lot of fabric, the bare arms and cut-outs on the side show just the right amount of skin. This look is a monochromatic dream. Clean, simple, chic: the trifecta of sophistication. Rihanna always knows how to wear just the right amount of kitsch. This outfit could work on a 7-year-old girl and an 80-year-old grandma... and Rihanna. The pastel color palette is very sweet, but her high shoes, sleek ponytail and sophisticated makeup ensure that she looks age-appropriate. Sometimes it's nice to see a best-dressed look that isn't a red carpet ensemble. This pulled-together outfit would be perfect for a day at the office. While it is workplace appropriate, it's also fashion-forward. We love how she mixed black and navy and went for a patterned skirt to add a little bit of texture. It's rare that we see Woodley in such a sexy dress, but this is a nice surprise. Though a black dress could easily skew boring, this one has a lot of extra elements to keep things exciting. From the plunging neckline to the sky-high slit, this is an all-around win. We admit it, not everyone could pull off this short, fun number, but Dunn wears it well. The color-blocked, fringe dress is a nod to her cheeky side and showcases those amazing legs. If the frock were longer, it would have been too much; the short hemline is key. This is how you wear two different patterns at once. Yes, Stone is rocking stripes and polka dots. It's not too much on the eyes because both her top and skirt are in the same, neutral color palette. The actress is giving off a fashion-forward, yet fun vibe. Okay, seriously, what has America Ferrera been doing lately because she is on a sartorial roll. The silhouette of her dress gives her hourglass figure a beautiful shape and her dark hair really pops against her sequined dress. We know, we know, those shoes (and those bare legs) aren't exactly February-friendly, but she looks so good. Her statement shoes and patterned skirt are a great complement to her simple blouse -- and don't even get us started on that oversized winter coat. Moore is on fire this week! We love her in color, but this LBD is equally as great. The halter neckline and faint pattern on her dress keeps things interesting, while her bold lipstick makes her stand out from the crowd. Slate looks so sophisticated in this fit-and-flare dress. Not only does the comedian look like a serious fashion girl in this ensemble, but it still plays to her whimsical personality. Redheads look ravishing in red and just about everyone looks good in a peplum, so it's a no-brainer that Moore made our best-dressed list this week. It's so nice to see the actress in a bright hue. We hope this becomes a new trend for her. Ladies and gentleman, get a pen and paper because you're going to want to take notes -- this is the perfect red carpet outfit. There is nothing that we love more than a woman in menswear and here Stone managed to make her tuxedo-inspired dress look very feminine by adding a long sheer train. Her pulled back hair, bold red lipstick and strappy shoes further cement her sartorial prowess. Between the curve-hugging silhouette, the lace and the crystal embellishments, this outfit is home run. Wait, Ms. Lawrence is not wearing Dior? What a treat! This soft pink, pleated gown makes it look like she is floating along the red carpet and the plunging neckline ensures that the dress isn't too mature for the young star. This gown is stunning on Jones. The blush hue is so pretty against her pale complexion and the crisscross, off-the-shoulder neckline makes it special. Reese is on a roll! The one-shouldered gown creates beautiful lines making her look long and lean. Her sophisticated ponytail is such a welcome departure from her typical wavy strands. We love everything about this look. From the bare legs, to the leather accents on the dress, to the texture from her patent clutch and boots, it's a fashion home run. A jumpsuit has never looked sexier. The plunging neckline, tapered trousers and killer pumps make this one look to remember. This beaded dress could have skewed very 1920's flapper, but Kurkova's modern 'do, bright lipstick and killer shoes ensured that her outfit was appropriate for 2015. While Rossum's outfit is quite simple, she opted for pieces that fit her perfectly, which landed her on the best-dressed list. Her black turtleneck is snug without being too tight and her lace pencil skirt adds the perfect amount of visual interest. And those nude heels are making her legs look about two miles long. FLOTUS shocked the house at the State of the Union address by wearing a skirt suit. While we love the rich grey color, our favorite part of her outfit was that she was twinning with Alicia Florrick from \"The Good Wife.\" King is one to watch. The burgeoning actress is an up-and-coming style star and this simple white dress showcases her fashion prowess. Not only does it fit her perfectly, but it looks so nice against her complexion. And those metallic heels really seal the deal. Sleek and sexy is the name of the game with this dress. While it may look simple from the front, the exposed back makes for one exciting look. And the sparkle only works to further how much we love this gown. More primary hues on the best-dressed list and we're not complaining. Not only does the shape of this dress flatter the actress' every curve, but her red lips and matching shoes make this a monochromatic dream. Sienna Miller is on fire lately! Not only are the bright colors stunning with her blonde bob, but the pleated knit dress is such an interesting texture, we just can't look away. This outfit just got added to our spring wish lists. There are so many shocking things about this look. First, Aniston is wearing her hair up (she almost always wears it down), she is wearing white (she almost always wears black) and she is taking a fashion risk with that cut-out and jacquard floral skirt (she usually plays it safe). Slow clap for Jenn, we think 2015 is going to be her year. The outfits at the \"Girls\" premiere were disappointing to say the least, but Williams' look saved the night, it was that good. Not only is navy and black our favorite color combination, but this silhouette is so pretty on the actress. The tight fitting bandeau top paired with the sparkly skirt is as fashion-forward as it is elegant. Lately Witherspoon has completely changed up her fashion game, opting for more avant-garde pieces, and this dress is no exception. The pearl-embroidered dress is still true to her feminine style sensibilities, but the split sleeves and added texture add some excitement. It looks like the \"Modern Family\" star is starting 2015 off on a good foot. While she often wears outfits that are too young or too old for her, this is right on the money. The muted color, paired with the embellishments and flattering neckline make for one stand-out ensemble. Blunt clearly knows how to dress her figure. This tight-fitting white dress could have skewed boring, but with the asymmetrical hemline and metallic embellishments, the British star looked fresh and sophisticated. This outfit is a fashion girl's dream. Not only is the skirt so cool -- the fabric along with the stripes make for an edgy piece -- but the simple white blouse is the perfect canvas for her busy skirt. And those chunky shoes (which were a bit of a risk) only further our obsession with Moretz. That color! It is breathtaking and perfectly complements Davis' complexion. The shape of the gown is modern, while her delicate accessories don't steal focus from the vibrant gown. There are few things we love more than high-waisted pants and a turtleneck. Fanning is giving us serious '70s vibes in this cool ensemble -- clearly she knows how to put together an outfit.  Share", "external_links": [], "published": "2015-05-01T14:00:00.000+03:00", "crawled": "2015-05-01T14:26:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}