{"organizations": [], "uuid": "8ef4628c9b2ff3f7573262327120bfd0e3f9b990", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/judicial/243394-senate-appropriators-should-fund-the-immigration-courts", "country": "US", "title": "Senate appropriators should fund the immigration courts", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate appropriators should fund the immigration courts", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-29T22:30:00.000+03:00", "replies_count": 0, "uuid": "8ef4628c9b2ff3f7573262327120bfd0e3f9b990"}, "author": "Eleanor Acer", "url": "http://thehill.com/blogs/congress-blog/judicial/243394-senate-appropriators-should-fund-the-immigration-courts", "ord_in_thread": 0, "title": "Senate appropriators should fund the immigration courts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 29, 2015, 03:30 pm Senate appropriators should fund the immigration courts By Eleanor Acer \nA massive backlog in our immigration courts is undermining both justice and enforcement. The number of pending cases hit a new all-time high in April, with 445,607 cases. People often wait years for a court date, let alone the resolution of their cases. \nThe cause is obvious: a huge increase in funding for enforcement without a proportional increase for our courts. As the Bipartisan Policy Center (BPC) points out , “The backlog of pending cases in immigration courts has grown 160 percent since 2006, but the number of immigration judges has grown by just 15 percent.” According to the U.S. Conference of Catholic Bishops , the immigration courts receive only one-sixtieth of the funding of enforcement agencies. ADVERTISEMENT House appropriators sought to address the problem, coming out in favor of adding 55 immigration judge teams. Chair of the Commerce-Justice-Science Appropriations Subcommittee Rep. John Culberson (R-Texas), whose state has the second highest number of pending cases, said it’s “holding up our courts and compromising the rule of law.” \nBut the Senate appropriations committee has not yet released its version of the bill, and Commerce-Justice-Science Appropriations Subcommittee Chairman Richard C. Shelby (R-Ala.) expressed reservations about increasing funding for immigration judges at a hearing on May 7. As Senators consider the bill, they should note that increasing funding for immigration judge teams enjoys strong support among faith communities, experts, and the general public. \nOn May 20 the BPC advised that reducing the immigration court backlogs would help “address important concerns for both sides of the aisle,” by allowing “the enforcement system to function more efficiently and help[ing] migrants receive a fairer hearing.” \nIn an op-ed for the Houston Chronicle, Julie Myers Wood—who was assistant secretary of Immigration and Customs Enforcement under President George W. Bush—noted that the backlog undermines the integrity of the entire system. “People who have no legitimate claim for relief languish in the system—and in the country—at taxpayer expense,” she wrote. “At the same time, people with strong claims—including those fleeing persecution—now often wait years for their day in court.” In a recent interview , she said, “You can't have a secure border if you don't have a functioning immigration court system.\" \nThe public supports this position as well. A recent poll conducted for Human Rights First by Public Opinion Strategies found that more than three-quarters of voters in 25 of the most closely watched congressional districts believe that Congress should increase the number of judges to help ensure fair and timely immigration hearings. Editorials in the Houston Chronicle , the Dallas Morning News , and the New York Times have all called on Congress to address the backlog. \nA group of faith-based and refugee assistance groups as well as the Association of Pro bono Counsel (the pro bono leaders at many of the nation’s leading law firms) have called for significant increases in immigration court judges and support staff. The court delays make it difficult to recruit pro bono lawyers, prolong the separation of refugee families, and leave refugee children stranded in dangerous and difficult locations abroad. \nTo handle the incoming removal caseload and reduce the backlog, Human Rights First recommends adding an additional 275 to 300 immigration judge teams. Besides the 55 teams requested by the Department of Justice for Fiscal Year 2016 that House appropriators support, another 75 immigration judge teams should be added each year for three fiscal years, for a total of 225 additional teams. \nIf Chairman Shelby and his fellow appropriators come out in favor of increasing funding for immigration judge teams, they’ll be in good company. And by doing so, they would begin to eliminate the backlog and make the immigration system more fair and efficient. \nAcer is Human Rights First’s senior director of refugee protection.", "external_links": [], "published": "2015-05-29T22:30:00.000+03:00", "crawled": "2015-05-29T22:52:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}