{"organizations": [], "uuid": "d44b5c6b017fd51dfbec48abea44885ff7df0483", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://new.thehill.com/taxonomy/term/28/feed", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/242739-overnight-energy-obama-says-climate-skeptics-risk-national-security", "country": "US", "title": "OVERNIGHT ENERGY: Obama says climate skeptics risk national security", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT ENERGY: Obama says climate skeptics risk national security", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-21T01:14:00.000+03:00", "replies_count": 0, "uuid": "d44b5c6b017fd51dfbec48abea44885ff7df0483"}, "author": "tcama@thehill.com (Timothy Cama and Devin Henry)", "url": "http://thehill.com/policy/energy-environment/242739-overnight-energy-obama-says-climate-skeptics-risk-national-security", "ord_in_thread": 0, "title": "OVERNIGHT ENERGY: Obama says climate skeptics risk national security", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT ENERGY: Obama says climate skeptics risk national security By Timothy Cama and Devin Henry - 05/20/15 06:14 PM EDT \nIT’S YOUR FAULT: President Obama went off on climate change deniers Wednesday, saying that they’re risking the security of the United States and the world. \nIt was part of Obama’s attempt to paint climate change — and the fight against it — as a national security issue that deserves at least as much attention as terrorism. ADVERTISEMENT “Climate change constitutes a serious threat to global security, an immediate risk to our national security, and, make no mistake, it will impact how our military defends our country,” Obama said at the Coast Guard Academy’s graduation ceremony. “And so we need to act — and we need to act now.”\nHe said Republicans have blocked efforts to fight climate change because “some folks back in Washington” do not believe it exists. \n“Denying it, or refusing to deal with it, endangers our national security and undermines the readiness of our forces,” he said. \nRead more here . \nINTERIOR SAYS 'NO THANKS' TO NEW PIPELINE POWERS: Lawmakers want to give the Interior Department the power to approve natural gas pipelines on National Park Service (NPS) land, but Interior has said that it doesn’t want it. \nHouse lawmakers heard testimony Wednesday on a bill that would take the NPS pipeline approval process away from Congress, which has had to sign off on new projects since the 1980s. The bill would give the Interior Secretary the right to authorize those projects, but a department representative said that they don’t want to change the law. \n“We have supported legislation authorizing rights of way for oil and gas pipelines on a park-by-park basis when it has been appropriate to do so,” Spisak told the Natural Resources Committee’s energy and mineral resources subcommittee. “The Department has a proven record of responsible siting of oil and gas pipelines.” \nRepublicans say the bill would help the booming natural gas industry move more of their product and help it get to consumers faster. \n“It ends this willy-nilly, haphazard approach of approving one pipeline at a time through an act of Congress,” Rep. Tom MacArthur (R-N.J.), the bill’s sponsor, said. \nHouse Natural Resources Committee leadership hopes to include the bill in an energy overhaul bill later this session. \nRead more here . \nON TAP THURSDAY I: The Senate Appropriations Committee will vote on its $35.4 billion 2016 energy and water development funding bill . Unlike the House version, it leaves out funding for a nuclear waste repository at Nevada’s Yucca Mountain, but a Senate floor fight on the issue could be brewing. \nON TAP THURSDAY II: Secretary of State John Kerry will host a reception Thursday for Robert Papp, who is leading the United States’ chairmanship for the next two years of the Arctic Council. Kerry’s speech will be streamed on www.state.gov . \nRest of Thursday’s agenda … \nThe United States Energy Association holds a briefing on its 2015 energy outlook , which projects energy supply, demand and prices through 2040. \nNEWS BITE: NextGen Climate is out with a new television advertisement Wednesday against TransCanada Corp.’s attempt to use eminent domain to take land for the Keystone XL oil pipeline. \nThe ad , running in the Washington, D.C., area, refers to the eminent domain use as a “land grab.” \n“It’s no benefit to me, it’s no benefit to my neighbors,” Paul, a landowner in South Dakota in the pipeline’s path, says in the ad. “It’s a foreign company that wants to ship their oil across my land.” \nTransCanada can use eminent domain under a South Dakota law passes specifically for Keystone. \nThe company maintains that the vast majority of landowners along the route have voluntarily sold the rights to their land. It blames paid activists for the opposition in some areas. \nKeystone proponents have accused billionaire activist Tom Steyer, NextGen’s founder, of opposing the project because he would profit if it is blocked, a claim PolitiFact has rated “mostly false.” \nAROUND THE WEB: \nAs of Wednesday afternoon, a pair of oil slicks off California’s coast from a pipeline breach had extended to 9 miles long, the Los Angeles Times reports. \nThe renewable energy sector employs 7.7 million people, according to an industry group. Forbes has an infographic of where those jobs are. \nOklahoma is on track to overturn a law that allows local bans on oil and gas drilling operations, Reuters reports. \nIN CASE YOU MISSED IT: \nCheck out Wednesday’s stories … \n- Federal study : BP oil spill cause record dolphin deaths- Senators push funding increase for energy research- ‘Teddy bear’ headed off threatened species list- Lawmakers look to take Congress out of pipeline approval process- Obama: Climate change deniers endangering national security- Senate GOP: EPA driven by politics , not science- White House argues trade will help environment- Pipeline rupture causes oil spill on Calif coast- Canada considering how to tackle oil production emissions- Obama: Climate change ‘serious threat to global security’- Groups jockeying to shape EPA water rule \nPlease send tips and comments to Timothy Cama, tcama@thehill.com ; and Devin Henry, dhenry@thehill.com . Follow us on Twitter: @Timothy_Cama , @dhenry , @thehill Tags:", "external_links": [], "published": "2015-05-21T01:14:00.000+03:00", "crawled": "2015-05-21T01:35:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}