{"organizations": [], "uuid": "ed1b3b8fdb513701f8708e3b5b24c411a67e153c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2929908/images/o-ABORTION-SUPREME-COURT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/health-news/blog.xml", "section_title": "Health News Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/jennifer-dalven/abortion-public-opinion-questions_b_7243448.html", "country": "US", "title": "Why Are We Still Asking if a Dying Woman Should Be Able to Get an Abortion to Save Her Life? | Jennifer Dalven", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 134, "title_full": "Why Are We Still Asking if a Dying Woman Should Be Able to Get an Abortion to Save Her Life? | Jennifer Dalven", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-08T21:45:00.000+03:00", "replies_count": 355, "uuid": "8be0118c37277d3fcbf5ba600be3f3d88f72491f"}, "author": "Jennifer Dalven", "url": "http://www.huffingtonpost.com/jennifer-dalven/abortion-public-opinion-questions_b_7243448.html#post-0", "ord_in_thread": 0, "title": "Why Are We Still Asking if a Dying Woman Should Be Able to Get an Abortion to Save Her Life? | Jennifer Dalven", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A recent analysis of abortion attitudes by the New York Times came to the right conclusion: The divide on how Americans feel about abortion is much smaller than partisan politics would have us believe.\nBut there's a bigger idea that the piece in the Times -- and the poll it relies on -- missed: All too often, we're still asking the wrong questions when it comes to gauging public opinion on abortion. We're too focused on questions at the margins -- death versus abortion, rape, and incest or abortion under all circumstances or no circumstances. These questions do little to illuminate the reality of most women's lives and the range of feelings people have about abortions that happen in the real world.\nMuch of the piece centers on how Americans feel about two questions. The first is whether a woman who needs an abortion to save her life should be able to get one. Why are we still asking this? Is whether a woman should be forced to die rather than have an abortion really still up for debate when it comes to public opinion? I don't think so.\nThe other question examined at length concerns a woman who wants an abortion because of the sex of the baby. To set the record straight, that's a largely imagined scenario, designed in part by abortion opponents to communicate the stigmatizing idea that a woman who has decided to have an abortion is doing so for a frivolous reason. Not to mention that it's racist , relying on ugly stereotypes about women of color. Asking this question doesn't get at any kind of truth on abortion attitudes.\nI'm thrilled that the analysis in the Times' got the real answer. But it's still not asking the right questions.\nWomen have abortions for complex reasons -- to better take care of the children they already have, to pursue an education or career and improve their life circumstances, or simply because they know they are not in a position to be the best parent they can be.\nFor many years, it's been clear that when you ask people about how abortion impacts real women's lives -- instead of party-line questions about abortion under all circumstances or no circumstances -- you get surprising answers and high levels of agreement.\nVox recently took this wholly different approach. Instead of asking the standard questions, the poll asked questions like:\n\"Which comes closer to your view: The law says a woman has a right to an abortion. As long as this is the law, women should have access to safe and affordable abortion care. Or even though there is a right to abortion, we should work to reduce abortions by making it harder for women to access care.\"\nAnd:\n\"Think about a woman who has decided to have an abortion. How would you want that experience to be for her?\"\nAnd even:\n\"If a close family member or friend told you she decided to have an abortion, would you give her a lot of support?\"\nWhen you ask these types of questions, a much deeper, more nuanced, and more accurate picture of attitudes on abortion appears. In that picture, it's clear that Americans are in overwhelming agreement that a woman who has decided to get an abortion should be able to get one without additional hurdles. They're in overwhelming agreement that we shouldn't be passing laws that make a woman who has decided to get an abortion feel ashamed about her decision.\nAnd Americans agree that lawmakers who are determined to restrict access to abortion are moving our country in the wrong direction.\nBuried in the Times piece, even with it's strange focus on scenarios that have little connection to most abortions, is one clear truth: \"Focusing on the exact details of abortion decisions may reveal more about when Americans agree on this difficult issue than when they disagree.\"\nMore: Abortion Civil Rights Public Opinion Polls Abortion Abortion Exceptions", "external_links": ["https://www.aclu.org/news/civil-rights-groups-challenge-arizona-law-targeting-women-color", "http://www.biomedcentral.com/content/pdf/1472-6874-13-29.pdf", "http://www.nytimes.com/2015/05/06/upshot/candidates-disagree-on-abortion-but-public-is-in-surprising-harmony.html?smprod=nytcore-ipad&smid=nytcore-ipad-share&_r=1&abt=0002&abg=1", "http://www.vox.com/a/abortion-decision-statistics-opinions", "http://www.nytimes.com/2015/05/09/us/politics/state-legislatures-put-up-flurry-of-roadblocks-to-abortion.html?src=twr"], "published": "2015-05-08T21:45:00.000+03:00", "crawled": "2015-05-09T10:05:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}