{"organizations": [], "uuid": "541ff4ebca11d5c458c5017dd91713fb38da1e31", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/military_army_040914getty_1.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/240721-president-obama-holds-off-support-for-military-retirement-and-health-care", "country": "US", "title": "President Obama holds off support for military retirement and healthcare reform", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "President Obama holds off support for military retirement and healthcare reform", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T00:48:00.000+03:00", "replies_count": 0, "uuid": "541ff4ebca11d5c458c5017dd91713fb38da1e31"}, "author": "kwong@thehill.com (Kristina Wong)", "url": "http://thehill.com/policy/defense/240721-president-obama-holds-off-support-for-military-retirement-and-health-care", "ord_in_thread": 0, "title": "President Obama holds off support for military retirement and healthcare reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama holds off support for military retirement and healthcare reform Getty Images By Kristina Wong - 04/30/15 05:48 PM EDT President Obama is holding off on endorsing controversial recommendations by a blue-ribbon panel to reform the military retirement and healthcare systems. \"I believe there is merit in all of these recommendations and that they deserve careful consideration and study. I will ensure that the Congress is kept apprised of this ongoing work,\" the president said Thursday in a letter to Congress. The president said a recommendation to reform the retirement system needed more study, given its complexity. ADVERTISEMENT The panel recommended moving from a system that only pays retirement benefits to troops serving at least 20 years to a blended system that would also allow troops serving at least two years to invest in a 401(k)-type plan. Some veteran groups oppose the recommendation, because it could reduce the overall retirement payments of those who serve 20 years and affect the retention of troops. It would also require financial advising for troops. The president's statement, however, comes just hours after the House Armed Services Committee passed its annual defense policy bill adopting the recommendation. It is unclear whether it will be stripped from a final bill, which will receive a vote from the full House and be combined with the Senate's version later this year. The president also held off on endorsing another recommendation to reform the military healthcare system, known as Tricare. The panel recommended moving troops' families onto commercial plans and giving them allowances for healthcare. The president said he agreed with the commission of the need to continue to improve the military healthcare system, but endorsed his own proposals included in his 2016 budget request. \"The health care reforms proposed in my Fiscal Year 2016 Budget are a good first step and offer service members, retirees, and their families more control and choice over their health care decisions,\" he said. However, he said reforming healthcare \"remains a critical issue,\" and that he would work with the commission and members of Congress to consider the recommendation for the 2017 budget. The recommendations were made by a congressionally appointed panel, named the Military Compensation and Retirement Modernization Commission, after 18 months of study. The panel was created to look at the controversial issue of reforming military benefits for troops and their families, in order to reduce what Pentagon leaders said were out-of-control personnel costs. The White House said it would also hold off on endorsing other four other recommendations, including consolidating the duty statuses of reservists, combining the base grocery and retail stores, and reforming support for dependents with special needs. However, the president did endorse 10 of the commission's 15 less controversial recommendations. \"In some instances, the Defense Department is already taking steps to implement these first 10 recommendations, but in areas that will require legislative changes to do so, we will work quickly to submit proposed legislative language to Congress as soon as possible,\" said Defense Secretary Ashton Carter in a statement. \"The choices we face about military compensation are both vexing and critically important,\" he said. \"DoD will continue to work closely with the Congress and the commission to achieve the goals we share: ensuring the long-term strength and vitality of our all-volunteer force, and honoring all our service members — past, present, and future,\" he said. Tags:", "external_links": [], "published": "2015-05-01T00:48:00.000+03:00", "crawled": "2015-05-01T03:20:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}