{"organizations": [], "uuid": "6f8173d7645e3f6e42fa84d2951eba1c4ff8153b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/latino-voices/blog.xml", "section_title": "Latino Voices Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/ryan-campbell/dapa-gop-immigration-poli_b_7452372.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "country": "US", "title": "DAPA, GOP & Immigration Politics", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "DAPA, GOP & Immigration Politics", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-28T16:51:00.000+03:00", "replies_count": 0, "uuid": "6f8173d7645e3f6e42fa84d2951eba1c4ff8153b"}, "author": "Ryan Campbell", "url": "http://www.huffingtonpost.com/ryan-campbell/dapa-gop-immigration-poli_b_7452372.html?utm_hp_ref=latino-voices&ir=Latino+Voices", "ord_in_thread": 0, "title": "DAPA, GOP & Immigration Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nDeferred Action for Parental Accountability (DAPA), much like Deferred Action for Childhood Arrivals (DACA), is a patchwork program created as a Band Aid to help alleviate some of the problems of our broken immigration system. This includes putting heads of families into corporately-owned prisons until deportation over a traffic ticket, subsequently placing their US Citizen children into foster care. This is the sort of thing that organizers will remember well into 2016, and has the GOP's fingerprints all over it. \nRecently, the 5th Circuit Appeals court ruled against a stay lifting the preliminary injunction pressed by Governors in 26 states, all but two Republicans. The states sued to overturn DAPA, which was announced by the President back in November, requesting a preliminary injunction on the program. A preliminary injunction is a temporary measure issued to prevent a party from doing something that would cause an irreparable harm. \nThe Plaintiff states argued that, once the program was implemented, it would be impossible to un-implement because they would not be able to strip millions of people of immigration status. The court found this convincing and issued the injunction, preventing the program from granting temporary status. This was then appealed by the Administration, which asked for a stay of the preliminary injunction to allow DAPA to be implemented. Unfortunately, the appeal failed, and the injunction remains. The circuit court that ruled on the stay found \"Because the government is unlikely to succeed on the merits of its appeal of the injunction, we deny the motion for stay and request to narrow the scope of the injunction,\" voting 2-1. \nAlthough this is a huge setback for the immigrant rights community, it was a very foreseeable one: the Governors who pressed the lawsuit looked all over the country for not only the most plaintiff-friendly judge to bring the case to, but also a district court that would appeal to an appeals court like the relatively conservative 5th Circuit. This is known as \"forum shopping\" and, with 26 states bringing the suit, they had over half of the country to bring choose from. \nAlthough the reaction has been much stronger with 26 states suing, the content of DAPA and expanding DACA is not that drastically different from the original DACA program, just on a much larger scale. Last time, although the GOP made a lot of noise about how this was not the right way to do it, they mostly went along. This was during the 2012 campaign of \"self-deportation;\" surprisingly, things have only gotten worse. \nCasting a broader net will inevitably find a few more rotten apples that will doubtlessly be featured over and over again as typical examples by Fox News, but the criteria is still a pretty sympathetic demographic: the parents of US Citizens and legal permanent residents. This would allow families that have already been quietly living and working within the United States to do so without the constant fear of deportation breaking them all up. \nThere is always someone willing to try to end birthright citizenship, but it never happens, and my money would be put on it never happening within any of our lifetimes. With our system so thoroughly broken, there are millions of US Citizens who have spent their entire lives in the US that could still have their parents put in prison and then deported if they got caught in a random road stop by the wrong police officer. Their experience up until then is much the same as any other first generation immigrant. \nConsidering our politics are bad enough that far-right Republicans defeated a measure to allow those already in the country with status, DACA recipients, from being able to serve in the military, I don't think our immigration system is changing any time soon legislatively: that was literally the least they could do and they could have done it entirely for the military without considering immigration, especially since military leadership supported it. This was still a step too far in the direction of \"amnesty\" for a GOP caucus inexplicably led by Steve King (R-IA), perhaps the country's least-respected member of Congress. \nThese issues aren't going anywhere: Speaker John Boehner (R-OH) still does not have the courage to watch his party potentially have a meltdown over immigration if it were ever put to a vote in the House, so I don't expect a solution from Congress any time soon. For the near future, all we're looking at is temporary fixes from the Executive Branch in the form of agency rules for ICE and the Border Patrol, as well as executive orders: that's where the ugly fights will be, and this is what advocates will look to when judging who to support for 2016. \nFollow Ryan Campbell on Twitter: www.twitter.com/PoliticallyRyan More:", "external_links": [], "published": "2015-05-28T16:51:00.000+03:00", "crawled": "2015-05-28T22:01:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}