{"organizations": [], "uuid": "b3cc7178342c1e1eeebb6a77a2bb6789e917e9e6", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_052615getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/pundits-blog/healthcare/243462-obama-will-win-obamacare-showdown", "country": "", "title": "Obama will win ObamaCare showdown | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama will win ObamaCare showdown | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "b3cc7178342c1e1eeebb6a77a2bb6789e917e9e6"}, "author": "", "url": "http://thehill.com/blogs/pundits-blog/healthcare/243462-obama-will-win-obamacare-showdown", "ord_in_thread": 0, "title": "Obama will win ObamaCare showdown | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 29, 2015, 03:00 pm Obama will win ObamaCare showdown By Brent Budowsky, columnist, The Hill Getty Images \nNext week brings the beginning of June and that means the great American showdown over ObamaCare will reach a crescendo when the Supreme Court rules on ObamaCare in the coming weeks. President Obama will win this great healthcare showdown no matter how the court decides, and ObamaCare will go down in history as a great legacy achievement. \nIf the Supreme Court rules in favor of the ObamaCare subsidies for all exchanges, which is the most likely outcome and was exactly what Congress intended when the Affordable Care Act was first enacted, it means game, set, match for ObamaCare. A favorable Supreme Court ruling would lead to ObamaCare becoming a legacy law like Social Security and a third rail that would become untouchable by the Republican right. ADVERTISEMENT With a favorable ObamaCare ruling by the court, enrollments that have already been dramatically greater than opponents predicted will skyrocket even further, and premiums that have been lower than opponents falsely predicted will remain lower than expected because of the competition and choices created by ObamaCare.\nConversely, if the court rules against the subsidies, the immediate crisis caused by the ruling will bring havoc to healthcare. Republicans and the right will be deluged by devastating news stories about Americans losing their insurance, about citizens with preexisting conditions losing their coverage, about children being thrown off insurance plans because they could no longer be covered by their parent's policies, and about insurance premiums skyrocketing because of Republican policies and a negative Supreme Court ruling. \nBriefly consider what happens in Florida: There could be a million healthcare customers directly or indirectly hurt by a negative Supreme Court ruling and they — and their families and neighbors — will be madder than hell at the Supreme Court and Republicans. This reaction would probably elect a Democratic senator to replace Sen. Marco Rubio (R-Fla.) and give Hillary Clinton a landslide victory for Florida's electoral votes in the presidential campaign! \nRepublicans in Congress and the right promised an alternative, but they never had one. Republicans and the right could never agree on an alternative and offer nothing except nihilistic opposition to healthcare reform. They even disagree with each other about any alternative. There is no GOP alternative except chaos for healthcare and punishment for healthcare consumers. \nIf the court rules negatively, Obama and Democrats in Congress will offer an easy fix to guarantee the subsidies, and Republicans will offer nothing of substance which is why they have passed nothing of substance in the Republican Congress, even though everyone has known the court ruling was coming in June. \nObama is now in overdrive, setting the pace and pushing his plan. Democrats in Congress and groups such as Organizing for Action and a wide range of progressive and healthcare reform groups are joining Obama in overdrive. Grassroots liberals and Democrats are signing petitions and calling the Congress and demanding action if the court rules wrongly and preparing to celebrate if the court rules correctly. \nThose of us who support ObamaCare are going all out today, and will be going all out until this showdown is over. In the end, President Obama will win the great ObamaCare showdown, one way or the other. \nBudowsky was an aide to former Sen. Lloyd Bentsen (D-Texas) and former Rep. Bill Alexander (D-Ark.), who was then chief deputy majority whip of the House. He holds an LL.M. degree in international financial law from the London School of Economics. Contact him at brentbbi@webtv.net . Tags: ", "external_links": [], "published": "2015-05-29T03:00:00.000+03:00", "crawled": "2015-05-30T05:02:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}