{"organizations": [], "uuid": "d6b5475b47bda911f21c896595c7b6849fcd2bcc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051115getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/pundits-blog/international/241704-obama-all-in-on-free-trade", "country": "", "title": "Obama, all in on free trade | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama, all in on free trade | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "d6b5475b47bda911f21c896595c7b6849fcd2bcc"}, "author": "", "url": "http://thehill.com/blogs/pundits-blog/international/241704-obama-all-in-on-free-trade", "ord_in_thread": 0, "title": "Obama, all in on free trade | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 12, 2015, 07:30 am Obama, all in on free trade By Raoul Lowery Contreras, contributor \nThis is the first piece in a two-part series. \nPresident Obama opposed \"free trade\" (specifically, NAFTA) when he ran for president in 2008. He campaigned to \"renegotiate\" the most successful trade agreement in U.S. history. Trade with Mexico tripled under NAFTA. In the end, he did not renegotiate NAFTA. He went on to promote a trade agreement with Colombia negotiated mostly by President George W. Bush. \nWith his Trans-Pacific Partnership (TPP) negotiations (with eight Pacific Rim countries), Obama has totally reversed his 2008 position. He is all-in now on free trade and fast-track authority. ADVERTISEMENT Funny how the real world makes political campaigning look silly compared to real governance and on-the-job-training. Businessman Donald Trump needs to learn that.\nMore than 21 years ago, on Jan. 1, 1994, NAFTA (between the United States, Canada and Mexico) went into effect. In its first month, the Bureau of Labor Statistics (BLS) counted 122 million Americans working. Unemployment was 6.7 percent for all; Hispanic unemployment was 10.2 percent and black unemployment was 12.6 percent. \nA revolt of Maya Indians in the southern Mexican state of Chiapas commenced that same day, with NAFTA being an excuse for the communist leaders of the revolt. They joined liberal/conservative American counterparts in objecting to NAFTA despite the United States being the largest market for Chiapas's principal product, coffee. After brief combat, the Mexican government isolated the rebels and the revolt petered out to insignificance. \nNAFTA was negotiated by President George H.W. Bush using fast-track authority, which allows the president to negotiate a trade deal and for Congress to vote up or down only, with no amendments allowed. Both houses approved NAFTA in 1993 and it was signed into law by President Clinton. NAFTA had solid support from almost all congressional Republicans and was opposed by most House Democrats. \nOpposed to NAFTA were ultraconservatives like Pat Buchanan, a handful of House Republicans like California's (now former) Rep. Duncan L. Hunter, and election spoiler Ross Perot. On the left were the AFL/CIO, Jesse Jackson, liberal groups and a majority of Democratic House members and senators (for the latter, 17 of 34 voted against, 16 voted \"for,\" with one senator not voting). The media labeled the opposition the \"Halloween Coalition.\" Despite his political base's opposition, Clinton called NAFTA an \"achievement.\" \nWhen Clinton left office on Jan. 20, 2001, these were the BLS numbers of jobs, unemployment and weekly wages: Working, 136 million people; unemployment was 4.2 percent for all, black unemployment was 7.6 percent and Hispanic unemployment was 5.6 percent. Weekly earnings were $480.89. \nClinton claimed to have created 20 million new jobs while he was president. The BLS numbers show us that 14 million more people were working six years after NAFTA went into effect and that black and Hispanic unemployment was slashed almost by half since Jan. 1, 1994. \nObjectively speaking, NAFTA's effect on the economy has been far more positive than not. NAFTA opponents had predicted the sky would fall and millions of jobs would disappear. \n\"The Mexicans are coming, the Mexicans are coming\" was the war cry of opponents Perot, Buchanan, Jackson, the AFL/CIO, Hunter (who briefly ran for president); the Mexicans were coming to steal American jobs. They wrongly predicted that millions of jobs would be lost to Perot's \"giant sucking sound\" from Mexico. \nIn NAFTA, there was a provision that provided for help and retraining for any American worker whose job was lost to Mexico or Canada. Between Jan. 1, 1994, through 2004, a grand total of 500,000 American workers made claims under that NAFTA provision: 50,000 a year. Contrast that with the increase of 14 million jobs documented by BLS between Jan. 1, 1994 and January 2001. That is a net gain of 13.7 million jobs. That is 2.28 million new jobs a year. The predictions of NAFTA opponents were wrong. \nIn the current arguments about Obama's Trans-Pacific Partnership, we see and hear the very same arguments used against NAFTA 22 years ago. \nFor example, businessman Trump (like Perot in 1993) in an ersatz presidential campaign declares that Mexico is the enemy because its automobile industry is booming. Ford, General Motors, Kia, Hyundai, Nissan, Audi and Mercedes-Benz have announced new car manufacturing factories/facilities in Mexico, creating close to 50,000 new high-paying Mexican jobs, plus ancillary jobs throughout the Mexican economy. Trump declares that booming Mexico is at war with the U.S. \nMexico manufactured 2.9 million cars in 2014, with 70 percent going to the U.S. Trump is in for a real shock when he finds out that Mexico is expected to export 5 million cars in 2020. Seventy percent to the U.S.? \nGeneral Motors manufactured 678,388 cars in Mexico in 2014; Nissan makes 600 cars a day in its one-year-old Mexican plant, employing 3,000. Almost every single Volkswagen sold in the U.S. is made in Mexico. Audi, Mercedes-Benz and Infiniti are coming to Mexico. A question Trump never asks is: Why is the auto manufacturing industry growing in Mexico? Answer: Mexican auto workers earn 20 percent of their Detroit counterparts, have equal skills, noticeably work harder and have more robotics than yesterday's Detroit. \nFor every Mexican auto worker and auto parts worker (Mexico is No. 6 in the world in auto parts manufacture) plus ancillary jobs, fewer Mexicans come to the U.S. for jobs. Additionally, that means many more Mexican visitors to California's Disneyland, San Diego's zoo and Sea World as well as Neiman Marcus stores and myriad hotels. Billions of foreign investment dollars are fueling the massive breakout of Mexico's industries that are hiring workers as fast as they apply. That results in billions of dollars being spent by vacationing Mexicans in the U.S. for goods and services and hundreds of billions more in bona fide trade. \nIf only people like Trump knew or recognized that, they would not oppose President Obama's Trans-Pacific Partnership that will affect over 25 percent of the world's commerce and bring billions of dollars in new trade to the United States. \nContreras formerly wrote for Creators Syndicate and the New American News Service of The New York Times . Tags: ", "external_links": [], "published": "2015-05-12T03:00:00.000+03:00", "crawled": "2015-05-12T14:58:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}