{"organizations": [], "uuid": "d013f4fd04238cde34034161e51cd6dce5840bfa", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/butterfieldgk_012715gn.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/house/240807-black-lawmakers-push-back-on-obama-over-thugs", "country": "US", "title": "Black lawmakers push back on Obama over 'thugs'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Black lawmakers push back on Obama over 'thugs'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T22:08:00.000+03:00", "replies_count": 0, "uuid": "d013f4fd04238cde34034161e51cd6dce5840bfa"}, "author": "Mike Lillis", "url": "http://thehill.com/homenews/house/240807-black-lawmakers-push-back-on-obama-over-thugs", "ord_in_thread": 0, "title": "Black lawmakers push back on Obama over 'thugs'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Black lawmakers push back on Obama over 'thugs' Greg Nash By Mike Lillis - 05/01/15 03:08 PM EDT \nLeading black Democrats are rejecting President Obama's conclusion that \"thugs\" were behind the furor in Baltimore that followed last month's death of a black man in the custody of city police. \nObama has characterized the rioters as \"criminals and thugs who tore up\" the city in the wake of Freddie Gray's death, which Maryland officials on Friday deemed a homicide committed by six police officers now facing murder charges. \nBut leading members of the Congressional Black Caucus (CBC) are denouncing the president’s language, arguing that a vast majority of the protesters — even those who resorted to violence — were simply kids swept away in the emotions of the moment. Obama, they say, overstepped in employing a term that, in recent years, has taken on sensitive racial dimensions. ADVERTISEMENT \"These are children, high-school students, you know, and I would not want to classify them as thugs,\" said CBC Chairman G.K. Butterfield (D-N.C.). \"Certainly they are lawbreakers, but they're still children. … These are youth, these are teenagers who are misguided, who don't have the same maturity that adults have, and I would not venture to call them thugs.\" \nRep. Alcee Hastings (D-Fla.) agreed, arguing that Obama simply used too broad a brush in attributing the violence to thugs. \n\"I would call them felons for breaking into an institution that they had no right or business to break into. I would call them criminals for the very same thing — burning cars and what have you. But a kid that just got out of high school at 3 o'clock in the afternoon in Baltimore and got caught up … and he's throwing a rock [and has] no criminal record and everything — he's not a thug, OK?\" said Hastings, another senior CBC member. \n\"Were there thugs out there? Damn right. But would you then attribute that to everybody in the crowd? No. And for that reason you should not say it,\" Hastings added. \"I would caution that any leader, including the president of the United States, that is going to comment about these kinds of things to remind the public of all of our responsibilities wait until we have all the facts.\" \nFox News reporter Leland Vittert, speaking on that network's \"Hannity\" show Thursday night, said he had asked Rep. Elijah Cummings (D-Md.) to suggest an appropriate term for the people involved in the disorder. By Vittert's account, Cummings responded, \"Human beings.\" \nGray, 25, was arrested by Baltimore police on April 12 after a chase through the streets of the city, and suffered severe spinal and head injuries in a police van on the ride to the station. He died of those injuries on April 19, and Baltimore's top prosecutor on Friday charged six arresting officers with murder and other charges. \nAfter Gray's death, thousands of protestors took to the streets of Baltimore to protest the police's initial handling of the case. Those protests turned violent on Monday night, following Gray's funeral, with cars set ablaze, businesses looted and burned, and Maryland Gov. Larry Hogan (R) calling in the National Guard to maintain order. More than a dozen police officers were hospitalized, according to the department. \nObama addressed the episode Tuesday, applauding those who pushed back against the violence and condemning the rioters as \"thugs.\" \n\"The overwhelming majority of the community in Baltimore I think have handled this appropriately, expressing real concern and outrage over the possibility that our laws were not applied evenly in the case of Mr. Gray, and that accountability needs to exist. And I think we have to give them credit,\" Obama said in a joint press conference with Japanese Prime Minister Shinzō Abe. \n\"My understanding is you’ve got some of the same organizers now going back into these communities to try to clean up in the aftermath of a handful of criminals and thugs who tore up the place.\" \nBaltimore Mayor Stephanie Rawlings-Blake initially used identical language, carving a distinction \"between the peaceful protests and the thugs, who only want to incite violence and destroy our city.\" \nThe mayor later walked back her comments, tweeting Wednesday that, \"When you speak out of frustration and anger, one can say things in a way that you don't mean.\" \nBut the White House took a different tack, doubling down on Obama's use of the term. \n\"Whether it's arson or, you know, the looting of a liquor store ... those were thuggish acts,\" White House spokesman Josh Earnest said Wednesday. \nObama on Friday addressed the new charges against the six officers surrounding Gray's death, saying it's “absolutely vital that the truth comes out.” \n“What I think the people of Baltimore want more than anything else is the truth,” he said. “That's what people around the country expect.” \nThe \"thug\" language has raised plenty of eyebrows in the black community, with a number of pundits, political scientists and Baltimore City leaders condemning the White House's characterization. \n\"Of course it’s not the right word to call our children thugs,” Councilman Carl Stokes said earlier this week. \nWriting Friday in The New York Times , Johns Hopkins University history professor N.D.B. Connolly said those employing the term, including the president, \"are fighting myths about degenerate black culture.\" \n\"Condemning 'criminals' and 'thugs' seems to get them away from beliefs about broad black inferiority,\" Connolly wrote. \nRep. Bennie Thompson, another leading Black Caucus member, emphasized that \"people who break the law should be punished.\" But the Mississippi Democrat also stressed that not everyone caught up in Baltimore's protests deserve the White House's characterization. \n\"I don't know if all lawbreakers, if we call them thugs. You know, thugs has a different connotation,\" Thompson said. \n\"Name-calling,\" he added, \"won't get us anywhere.\" Tags:", "external_links": [], "published": "2015-05-01T22:08:00.000+03:00", "crawled": "2015-05-02T01:17:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}