{"organizations": [], "uuid": "15a83609d82b8b948f7fe404e80265ea2694b73a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/leisy-j-abrego/president-obama-deception_b_7314656.html", "country": "US", "title": "President Obama, Deception Will Not Work: It's Time to End Family Detention | Leisy J. Abrego", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "President Obama, Deception Will Not Work: It's Time to End Family Detention | Leisy J. Abrego", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-20T21:40:00.000+03:00", "replies_count": 0, "uuid": "15a83609d82b8b948f7fe404e80265ea2694b73a"}, "author": "Leisy J. Abrego", "url": "http://www.huffingtonpost.com/leisy-j-abrego/president-obama-deception_b_7314656.html", "ord_in_thread": 0, "title": "President Obama, Deception Will Not Work: It's Time to End Family Detention | Leisy J. Abrego", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Co-authored by Leisy Abrego, Alfonso Gonzales, and Shannon Speed*\nPresident Obama and U.S. Immigration and Customs Enforcement (ICE) have failed again to deliver real change.\nFollowing mounting public pressure in the form of large demonstrations , negative national press coverage , and a hunger strike inside its facilities, U.S. Immigration and Customs Enforcement (ICE) announced a series of changes to its deceptively named, \"family residential centers.\"\nBut nothing is really changing except that now they have new curtains and are serving horchata in the facility that houses hundreds of asylum-seeking mothers and their children--many for close to a year - as a way to deter others from seeking refuge in the U.S.\nInstead of ending family detention and releasing the refugees, ICE proposes new measures that ostensibly will ensure that these privately-run prisons \"continue to serve as safe and humane facilities for families.\"\nWhile the designation of these facilities as \"safe\" is questionable given multiple instances of abuse and suicide attempts within them, we particularly refute the idea that incarcerating refugee women and children can be \"humane.\"\nIn its press release, ICE states that, \"our borders are not open to illegal migration, and that individuals apprehended crossing the border illegally are a Department priority.\" This is precisely the crux of the problem. The reforms are based on the idea that the women and children at Karnes are \"illegal\" migrants and not refugees seeking asylum protected by the 1951 Refugee Convention . Indeed, these are refugees, fleeing the consequences of US neoliberal and drug war policies.\nArticle 31 of the Convention makes clear that states must not penalize refugees for illegal entry into a country. This article was created in recognition of the fact that people fleeing their own countries in fear may have to enter another country without authorization to seek protection. Yet there are hundreds of asylum-seeking families at Karnes City family detention center. Among them there are at least 20 families who have been denied bond and held in detention for almost 10 months because they have a \"prior deportation.\" ICE has invoked national security concerns to bypass international law.\nEven if ICE were to implement in good faith the proposed reforms, which include things like starting a stakeholder task force to review complaints, expediting review of individual cases, and expanding the very limited medical and psychological care that is available, the practice of family detention is irreconcilable with the basic principals of a liberal democracy and of international law. In this context, the reforms are merely a deceptive tactic to shield the government from growing criticism of its unconscionable practices.\nWide-scale opposition to family detention began in summer 2014, when the administration reinitiated family detention despite having discontinued it five years earlier as unsupportable. But the most significant opposition to the practice of family detention has come from the incarcerated mothers themselves. Unwilling to sit idly as their children's health and wellbeing declined, they launched a hunger strike during Easter week to draw attention to their situation. This action, accompanied by a well-publicized letter with 78 of the women's signatures, informed and inspired mass mobilizations by various groups.\nSince that time, numerous groups nationwide, including immigration attorneys , NGOs , the ACLU , scholars , faith leaders , and even a federal court order , have called for the release of detainees. Most notable is the May 2 protest involving over 600 people who travelled from throughout the country to remote Dilley, Texas, where a huge detention camp is located.\nPoliticians are also increasingly among the ranks of those denouncing family detention. At a congressional oversight hearing in April, Rep. Hank Johnson pointedly questioned ICE Director, Sarah Saldaña, about the conditions that drove detainees to conduct a hunger strike. Congressional representatives Lucille Roybal-Allard, Zoe Lofgren and Luis Gutiérrez called on the DHS to end family detention. Even Hillary Clinton, who initially stated that women and children seeking asylum in the US \" should be sent back ,\" has changed her position and now expresses concern about family detention .\nICE's new guidelines are the latest phase in their public relations campaign to deceive the public about the harsh realities of incarcerating women and children who should never have been detained in the first place. The campaign has included denying the hunger strike altogether and providing controlled media tours.\nDuring the tours, guards employed by GEO, the private prison firm that runs the Karnes facility, deliberately isolated inmates suspected of participating in the hunger strike to prevent them from speaking with inspectors.\nThis type of charade reflects the same patterns evident in ICE's new guidelines to promote the notion of a kinder, friendlier refugee imprisonment. When asked her opinion about the new guidelines, a Central American woman in her early 30s who participated in the hunger strike said, \"Nothing has changed... we know that ICE will use anything to say that we have no rights.\"\nShe went on to say, \"I am a hen that lays golden eggs\" referring to the fact that the for-profit corporation GEO makes about $266 per day on the detention of each person.\nWith conviction, she affirmed, \"We are ready to die of hunger for the freedom of our children!\"\nPresident Obama has the power to end family detention and free these women and children. History is on the side of the refugees. What side is the president on?\nAlfonso Gonzales is an author and Assistant Professor in the Department of Mexican American and Latino Studies at The University of Texas at Austin.\nShannon Speed is an Associate Professor of Anthropology at The University of Texas at Austin and a public voices fellow with The OpEd Project .\nFollow Leisy J. Abrego on Twitter: www.twitter.com/AbregoLeisy\nMore: Family Detention Karnes County Detention Facility Central American Refugees Refugee Convention Immigration and Customs Enforcement", "external_links": [], "published": "2015-05-20T21:40:00.000+03:00", "crawled": "2015-05-20T21:28:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}