{"organizations": [], "uuid": "606e1345dd70e22af464be685fe657e71cf630f5", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/cruzted_012415getty_0.jpg", "site_section": "http://thehill.com/taxonomy/term/36/feed#", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/blogs/floor-action/house/242377-cruz-ties-immigration-to-trade", "country": "US", "title": "Cruz ties immigration to trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Cruz ties immigration to trade", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-18T18:38:00.000+03:00", "replies_count": 0, "uuid": "606e1345dd70e22af464be685fe657e71cf630f5"}, "author": "iswanson@thehill.com (Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/house/242377-cruz-ties-immigration-to-trade", "ord_in_thread": 0, "title": "Cruz ties immigration to trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 18, 2015, 11:38 am Cruz ties immigration to trade By Jordain Carney Getty Images \nPresidential hopeful Sen. Ted Cruz wants to tie a fight over immigration to the fast-track trade legislation currently before the Senate. \nThe Texas Republican has filed an amendment that would block any trade agreements that “alter or affect any law, regulation, or policy relating to immigration.” ADVERTISEMENT Cruz’s amendment could come up in the debate over fast-track, which if approved would prevent Congress from amending trade deals and force them to be considered in a majority vote.\nSenate Majority Leader Mitch McConnell (R-Ky.) hopes to finish the fast-track bill by the end of this week but is expected to have to deal with dozens of amendments to the legislation. \nConservative lawmakers have repeatedly warned that Obama could use the Trans-Pacific Partnership to reform immigration. \nCruz’s amendment would block any trade agreements that change immigration laws from being fast-tracked through Congress. Such trade deals could be amended and would be subject to Senate filibusters. \nAdministration officials, as well as the House Ways and Means Committee, have denied that either fast-track or the Asia-Pacific trade deal would impact immigration laws. \nWhile Cruz said that although he agrees with those leaders, he wants to put those assurances in the legislation. \n“I am a strong supporter of free trade, but I cannot support legislation that would allow the president to once again circumvent Congress to enact his own immigration laws,” he said in a statement. “Since the Obama administration has emphatically argued that TPA will not affect immigration, it should support this amendment, which makes that promise explicit.” Tags:", "external_links": [], "published": "2015-05-18T18:38:00.000+03:00", "crawled": "2015-05-18T22:57:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}