{"organizations": [], "uuid": "ff6d5f48e01177b0ddd8e589019495131f623495", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/overnights/241817-overnight-healthcare-gop-using-abortion-vote-to-renew-attack-on-roe-v-wade", "country": "US", "title": "OVERNIGHT HEALTHCARE: GOP uses abortion bill to ramp up attack on Roe v. Wade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT HEALTHCARE: GOP uses abortion bill to ramp up attack on Roe v. Wade", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T01:26:00.000+03:00", "replies_count": 0, "uuid": "ff6d5f48e01177b0ddd8e589019495131f623495"}, "author": "sferris@thehill.com (Sarah Ferris)", "url": "http://thehill.com/policy/healthcare/overnights/241817-overnight-healthcare-gop-using-abortion-vote-to-renew-attack-on-roe-v-wade", "ord_in_thread": 0, "title": "OVERNIGHT HEALTHCARE: GOP uses abortion bill to ramp up attack on Roe v. Wade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT HEALTHCARE: GOP uses abortion bill to ramp up attack on Roe v. Wade By Sarah Ferris - 05/12/15 06:26 PM EDT \nRepublicans are ramping up their attack on Roe v. Wade, with hopes of forcing the high court to reconsider the issue of abortion as soon as President Obama leaves office. \nThe House will vote Wednesday on a bill banning late-term abortions, which its own members acknowledge may be a violation of the court's 1973 decision. While it's unlikely to pass the Senate or reach President Obama's desk, Republicans say they are playing a long game intended to force the issue back into court. \n\"I think this is likely to get a challenge in the court and I think it's likely to prevail,\" Rep. Chris Smith (R-N.J.), chairman of the Pro-Life Caucus, said in an interview. ADVERTISEMENT Legislation banning abortions after 20 weeks has already been blocked by the Supreme Court in three states. But similar laws remain on the books in 11 other states – which would put Congress in murky legal territory that anti-abortion advocates hope draws attention from the high court.\nRepublicans are also laying down a marker for the 2016 elections, when they hope to win control of Congress and the White House. \n\"I think there's an awakening happening,\" Smith added. \"All the Republican candidates have signaled support on this.\" Read the full story in tomorrow's print edition and online at TheHill.com \nCONGRESS INTERVENES IN FLORIDA MEDICAID FIGHT: House Republicans will hold a hearing this summer on alleged attempts by the Obama administration to force Florida into accepting the Medicaid expansion under ObamaCare. \nFlorida Gov. Rick Scott (R) made the announcement Tuesday after a meeting in Washington with lawmakers. The discussion included Rep. Fred Upton (R-Mich.), the chairman of the House Energy and Commerce Committee. \n\"The committee's hearing will bring much-needed attention to the Obama Administration's disappointing political power play at the expense of the healthcare of low-income families in our state,\" Scott said in a statement. Read more here . \nFDA WANTS TO LIFT LIFETIME BLOOD DONATION BAN : The Obama administration took the biggest step in 30 years to end the lifetime ban on blood donations from gay and bisexual men. \nThe Food and Drug Administration (FDA) issued proposed rules Tuesday that would eliminate the lifetime prohibition, which it acknowledged \"is perceived by some as discriminatory.\" Still, the new rules ban men from donating blood if they have had sex with another man within a year. \nThe agency said the ban has become less effective over time and admitted that \"some individuals knowingly donate despite the deferral.\" The agency will now collect public comments on the rule for 60 days. Read more here . \nWednesday's schedule: \nThe House will vote on the Pain Capable Unborn Child Protection Act. \nReps. Phil Roe (R-Tenn.) and Linda Sanchez (D-Calif.) will hold a press conference about their bill to repeal ObamaCare's Independent Payment Advisory Board. \nState by state \nPublic hospitals brace for possible cuts as Florida's budget stalemate continues \nStudy: Half of Texas women face barriers to reproductive services \nArizona lawmakers taking hard line against health benefits, except the ones they receive \nWhat we're reading \nVitter's anti-ObamaCare crusade draws scorn – from GOP \nScott's claim that patients who use LIP funding are different than Medicaid is 'mostly false' \nAs Ebola disappears , no useful data seen from vaccine trials, WHO says \nWhat you might have missed from The Hill \nSenators plan rival bill on medical cures \nHouse E&C advances landmark bill to overhaul drug development \nSenate Dem attacks GOP over paid leave bill \nPlease send tips and comments to Sarah Ferris, sferris@thehill.com , and Peter Sullivan, psullivan@thehill.com . Follow on Twitter: @thehill , @sarahnferris , @PeterSullivan4", "external_links": [], "published": "2015-05-13T01:26:00.000+03:00", "crawled": "2015-05-13T06:58:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}