{"organizations": [], "uuid": "b47ee8e105e29a1d6c7718a6e61f19976cec1b1b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2921240/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/social-media/feed/", "section_title": "Social Media on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/07/obama-social-media_n_7215298.html", "country": "US", "title": "How Barack Obama Led Us Into The Selfie Century", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "How Barack Obama Led Us Into The Selfie Century", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-07T10:42:00.000+03:00", "replies_count": 0, "uuid": "b47ee8e105e29a1d6c7718a6e61f19976cec1b1b"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/07/obama-social-media_n_7215298.html", "ord_in_thread": 0, "title": "How Barack Obama Led Us Into The Selfie Century", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How Barack Obama Led Us Into The Selfie Century Posted: Updated: 9 minutes ago President Barack Obama greets people during a Cinco de Mayo reception at the White House on May 5, 2015. | AP Photo/Carolyn Kaster reddit \nWASHINGTON -- A new era in American politics was only faintly visible when The Huffington Post debuted on May 9, 2005. The changing time manifested itself in two ways. One was the incandescent smile of a freshman senator from Illinois named Barack Obama. The other was an emerging wave of social media -- Facebook, YouTube, Twitter and, yes, HuffPost. \nTen years later we're living in the Selfie Century, in which individuals and tribes (some ancient, others assembled virally overnight) contend with traditional institutions (such as nation states, governments, political parties and corporations) for control of public life. The next 10 years will be suffused with that tension. \nOther conflicts will also shape the decade ahead: the ever-growing gulf between the richest and the rest ; the costly chaos of climate change ; the possibilities and pain of creating a truly multiracial, multiethnic society ; the threats of belligerent nationalism ( China and Russia) and bloodthirsty theocracy (the militant mullahs in Iran, a “state” that falsely claims the banner of Islam). \nBut winning these other battles will require social and digital media to educate and empower people of good will in the United States and around the globe. How do we reach so many individuals without losing the privacy that makes free thinking possible? How do we push governments and corporations to focus on people, not merely the amassing of money and metadata? How do we disrupt unresponsive leadership and yet still govern ourselves? \nObama did not necessarily set out to start this conversation. In 2004, Howard Dean had been the first presidential candidate to really use the Internet as a medium-is-message organizing tool. But Obama took it from there. \nI interviewed Obama several times back then and since. The power of his personality, intellect, energy, biography (biracial, reared by a single mom, international experience) and ease with people he doesn’t know -- all were impressive, marketable and instantly, if somewhat distantly, charming. Anyone who saw the young senator in the corridors of the Capitol in the spring of 2005 knew -- and knew that he knew -- he was going places. \nIt wasn’t clear when. The Republicans were large and in charge, or so it seemed. President George W. Bush had just won a second term, though barely. The GOP controlled both houses of Congress and was rising in the states. Bush’s war in Iraq (which Obama had utterly opposed) was grinding on, and yet an exuberant economy (irrationally exuberant, in former Fed Chair Alan Greenspan's words) allowed Bush to cut taxes and support some generous new programs, such as added drug benefits for seniors. \nBut that same year saw the Bush unraveling. The reason was Hurricane Katrina. It produced pictures of an unconnected and seemingly callous president gazing down at a devastated New Orleans from an aircraft. That, plus his lack of granular knowledge of his aides’ actions, crippled him politically. \nAmerica wanted a connected president. \nSo it’s no accident that Obama and social media rose together. They were made for each other. However cool he could be in private -- and the air around him can get frigid -- he and his presidential campaign amassed 20 million “friends” on Facebook. He was the sunny side of a new day to his supporters, while his intimate omnipresence provoked deep fear among foes, who saw him as some kind of Orwellian force. He dug even deeper digitally in 2012, mining mega data to target a get-out-the-vote drive with far greater pinpoint accuracy than ever before. \nThe conventional wisdom about the Obama decade is that he was a better candidate than he has been a president. But that may be wrong. \nThough income inequality has grown on his watch, the United States (and the world) avoided economic catastrophe in 2008 and 2009, and the U.S. economy overall is reasonably strong again. The president had a lot to do with that. \nHe pushed through an expansion of health care, taking the risk despite an utterly rejectionist GOP. The launch of Obamacare was an unholy administrative mess. But it has become more useful and popular, and Republican candidates won't have much of a target in 2016 -- if they even try to shoot at it. \nObama promised to end the war in Iraq and did so, even if Islamic State militants have filled the void in some parts of that country. He wound down the war in Afghanistan, too -- a war he said was necessary to fight. While the results in that region are mixed at best, U.S. political strife over the conflicts has died down. GOP presidential candidates decry Obama’s alleged foreign policy weakness, yet there is little talk in Republican ranks of pouring troops back in. \nThere have been glaring failures in the Obama years. His robust use of drones abroad and digital surveillance at home has been unnerving to supporters, who thought his background as a constitutional lawyer would make him more cautious. Only recently, and well after being safely re-elected, has he highlighted the ruinous poverty and neglect of African-American communities in beleaguered cities, where local cops and citizens struggle to find peace. \nOnce he promised the nation renewed civility, bipartisanship and unity. But he could never overcome or outmaneuver GOP petulance. Their stance shocked and annoyed him, and after a while, he stopped bothering to try. The result: a further decline in trust of leaders and government. \nIronically, the dangerous toxicity in public debate that Obama hoped to calm thrives on the same social media that boosted him. Social media can enable tribalism or worse. Even as it shines a light on public and private misconduct, it can aid those who would respond violently or give tyrants the power to suffocate dissent through constant surveillance. \nIf social media is to live up to its promise, we have to figure out how to use it to do more than win an election or stage a protest or make a point or sell a product or promote ourselves. We have to use it to help heal the country, find answers to pressing problems and nurture a global community that is suddenly aware of its own existence. \nIn other words, the next decade is about using social media for the benefit of society. Let’s hope it works. More:", "external_links": [], "published": "2015-05-07T10:42:00.000+03:00", "crawled": "2015-05-07T14:54:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}