{"organizations": [], "uuid": "ea971007e5b3cea6cdc785e9950fa374cda55384", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamagulfsummit05142015getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/242292-obama-says-gulf-summit-was-very-successful", "country": "US", "title": "Obama says Gulf summit was 'very successful'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama says Gulf summit was 'very successful'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-16T02:48:00.000+03:00", "replies_count": 0, "uuid": "ea971007e5b3cea6cdc785e9950fa374cda55384"}, "author": "Ben Kamisar", "url": "http://thehill.com/blogs/blog-briefing-room/242292-obama-says-gulf-summit-was-very-successful", "ord_in_thread": 0, "title": "Obama says Gulf summit was 'very successful'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 15, 2015, 07:48 pm Obama says Gulf summit was 'very successful' Getty Images \nPresident Obama on Friday hailed a summit with six Gulf states as \"very successful\" and said the U.S. had underscored its commitment to Middle Eastern allies. \n\"I think it was very successful. And the intentions here were to deepen and broaden what is already an excellent relationship between the GCC [Gulf Cooperation Council] countries and the United States,\" Obama said in an interview with al-Arabiya, a Saudi news outlet, after the close of the summit. \nThe president met with leaders from Saudi Arabia, Bahrain, Qatar, Oman, Kuwait and the United Arab Emirates at Camp David on Thursday. Those countries have expressed concerns over the negotiations with Iran over its nuclear program. Some cited those tensions to explain why Saudi King Salman and Bahrain’s King Hamad bin Issa al-Khalifa skipped the meetings. ADVERTISEMENT The summit attendees, though, issued a joint statement on Thursday that promised the U.S. would “confront external aggression against our allies and partners” with assets including “the potential use of military force.”\nBut Obama also faced grumbling from leaders who wanted a formal treaty guaranteeing the security promises. \nObama defended his decision and said he would honor those promises but that a written treaty was not necessary. \n“The statement is a written agreement,” Obama said. \n“The treaty process is very cumbersome, requires congressional approval, and it’s not necessary in this situation in order for us to be able to accomplish the goals that we wanted to meet,” Obama told the network. \nIn the wide-ranging interview, Obama also emphasized his commitment to a two-state solution in the Israeli-Palestinian conflict. But he said his emphasis will be on rebuilding trust with the people of Gaza after the military conflict involving Israel last summer instead of through a “big overarching deal. \nHe added that while the majority of people on both sides understand the path to peace, it hasn’t always been easy. \n“Unfortunately, the politics of fear has been stronger than the politics of hope over recent years—partly because of the chaotic situation in the region overall. And it’s going to take some time to rebuild it,” said Obama. \nThe conversation also shifted to the civil war in Syria, which has left tens of thousands dead. \nObama said the civil war was a lose-lose situation for America, which would be criticized if it took action and if it chose not to. \nHe added that the violence will “probably not” end before he leaves office, but rejected comparisons to the genocide in Rwanda, where President Clinton subsequently said he regretted not sending troops into the country. \n“The situation in Syria is heartbreaking, but it’s extremely complex. And I am haunted by the hardships and the deaths. It’s something I take very seriously,\" said Obama. \"But when the analogy is used of Rwanda it presumes that some sort of swift U.S. intervention would have prevented these problems. \n“You have a civil war in a country that arises out of long-standing grievances. It wasn’t something that was triggered by the United States,\" said the president. \n\"It wasn’t something that could have been stopped by the United States.”", "external_links": [], "published": "2015-05-16T02:48:00.000+03:00", "crawled": "2015-05-16T04:13:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}