{"organizations": [], "uuid": "e6696dadb6424f3f8b7709682924b9cf2767964b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamapolice.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/242217-obama-hails-police-for-special-kind-of-courage", "country": "US", "title": "Obama hails police for 'special kind of courage'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama hails police for 'special kind of courage'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-15T19:27:00.000+03:00", "replies_count": 0, "uuid": "e6696dadb6424f3f8b7709682924b9cf2767964b"}, "author": "Jordan Fabian", "url": "http://thehill.com/blogs/blog-briefing-room/news/242217-obama-hails-police-for-special-kind-of-courage", "ord_in_thread": 0, "title": "Obama hails police for 'special kind of courage'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 15, 2015, 12:27 pm Obama hails police for 'special kind of courage' By Jordan Fabian Getty Images \nPresident Obama on Friday said the nation can and should do more to support law enforcement and rebuild trust with the communities it serves. \n“We cannot erase every darkness and danger from the duty that you have chosen,” he said during a speech at the National Peace Officers’ Memorial Service outside the Capitol. “We can offer you the support you need to be safe.” ADVERTISEMENT The event comes amid tensions between law enforcement and minority communities over a series of police-related deaths of young black men in Baltimore, Ferguson, Mo., and North Charleston, S.C., among other cities. \nThe president has tried to walk a fine line , expressing support for law enforcement while expressing alarm about what has called a “slow-rolling crisis” when it comes to the treatment of minorities. \nObama attended the event with Attorney General Loretta Lynch, who has taken a leading role in responding to unrest in Baltimore following the death of 25-year-old Freddie Gray. \nDuring his speech at the annual memorial service for officers killed in the line of duty, Obama praised law enforcement as “heroes” who are willing to sacrifice for their communities. \n“It takes a special kind of courage to be a peace officer,” he said. \nHe said the nation should do more to provide needed resources for police and root out poverty in the cities and towns they protect. \n“We can do everything we have to do to combat the poverty that plagues too many communities you have to serve,” he said. “We can work harder as a nation to heal the rifts that still exist in some place between law enforcement and the people you risk your lives to protect. We owe it to people who sacrificed their lives.” \nObama will travel to Camden, N.J., on Monday to meet with police officers and young residents.", "external_links": [], "published": "2015-05-15T19:27:00.000+03:00", "crawled": "2015-05-15T20:59:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}