{"organizations": [], "uuid": "e622ffd50f1743512185abe5a5d90a670b54a925", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/palinsarah_012415getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/blogs/blog-briefing-room/news/240867-palin-obama-flirting-with-the-devil-on-iran", "country": "US", "title": "Palin: Obama 'flirting with the devil' on Iran", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Palin: Obama 'flirting with the devil' on Iran", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-02T19:35:00.000+03:00", "replies_count": 0, "uuid": "e622ffd50f1743512185abe5a5d90a670b54a925"}, "author": "esmilowitz@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/news/240867-palin-obama-flirting-with-the-devil-on-iran", "ord_in_thread": 0, "title": "Palin: Obama 'flirting with the devil' on Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 02, 2015, 12:35 pm Palin: Obama 'flirting with the devil' on Iran By Mark Hensch Former Alaska Gov. Sarah Palin on Saturday urged Congress to stop President Obama’s nuclear arms negotiations with Iran at any cost. “We must realize Iranian leadership refuses to acknowledge Israel’s right to exist, and, in fact is hell-bent on Israel’s, and ultimately our, annihilation,” Palin wrote on her Facebook page. “The only thing standing between a president who’d jeopardize our country by ignoring our Constitution, and foes capitalizing on lopsided international treaties that weaken our allies, is Congress,” she said. ADVERTISEMENT “Congress must not sit back and watch our own president flirting with the devil,” Palin, a GOP vice presidential candidate in 2008, added. Palin also argued Obama’s tentative framework with Tehran had severely damaged U.S. relations with Israel. She called on Republican lawmakers to repair the frayed bonds between the two nations in Congress. “Our president and his anti-peace foreign policy supporters have not acted in the interest of our ally, Israel, resulting in dangerously compromised American interests,” Palin said. “The GOP majority must stop giving lip service to halting liberals’ fundamental transformation of our relationships with friendly nations and finally take a stand by exercising its constitutional right and responsibility to approve international treaties,” she wrote. “Certainly they must with such grave consequences involved.” Obama announced a tentative framework pact with Iran on April 2. He hailed it as a “historic” moment in diplomacy between the two nations during Rose Garden remarks that day. The potential deal would lift economic sanctions on Iran in exchange for greater restrictions on its nuclear energy capabilities. Iranian leadership has promised it will accept more frequent atomic inspections and caps on its centrifuge and uranium stockpiles as part of the bargain. Obama has long argued diplomacy as the only means of preventing an Iran with nuclear bombs. Israeli Prime Minister Benjamin Netanyahu has countered that Tehran has proven dishonest in the past and threatens his nation’s existence. Sen. Tom Cotton (R-Ark.) drew White House ire last month for his open letter to Ayatollah Ali Khamenei, Iran’s supreme leader, vowing Congress would void any final deal it found unsatisfactory. Cotton’s message was signed by 46 other GOP senators. Obama has since said he would consider legislation allowing Congress to review any definitive version of the agreement. Secretary of State John Kerry has spearheaded U.S. talks with Iran. Both sides are racing to meet a June 30 deadline for a final accord. Tags:", "external_links": [], "published": "2015-05-02T19:35:00.000+03:00", "crawled": "2015-05-02T20:48:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}