{"organizations": [], "uuid": "7d646497f610f133b35b15cb56982d3b4f87bcc3", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/Health_Overhaul_Preventive_Services___Judson.Berger@foxnews.com_1.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/11/salons-clickbait-strategy-phantom-fight-against-fox-news/", "country": "US", "title": "Obama administration says health insurers must offer free contraceptives", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama administration says health insurers must offer free contraceptives", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-11T23:38:00.000+03:00", "replies_count": 0, "uuid": "0efb7e50086865ba0436fc1a54a8192c03878561"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/11/obama-admin-close-insurance-loopholes-on-preventive-care-says-insurers-must/", "ord_in_thread": 0, "title": "Obama administration says health insurers must offer free contraceptives", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama administration says health insurers must offer free contraceptives Published May 11, 2015 Facebook 0 Twitter 0 livefyre Email Print Nov. 12, 2014: HealthCare.gov website, where people can buy health insurance, on a laptop screen, is seen in Portland, Ore. (AP) \nThe Obama administration made clear Monday health insurers will have to pay for the cost of contraceptives on everything from IUDs to the patch as part of the Affordable Care Act. \nThe department of Health and Human Services said insurers must cover at least one birth control option under each of the 18 methods of contraception without copays. \nReports by the Kaiser Family Foundation and the National Women’s Law Center, an advocacy group, found many insurers were not providing a no-cost birth control alternative to every type of contraceptive as written in the law. \n“Insurance companies have been breaking the law and, today, the Obama administration underscored that it will not tolerate these violations,” Gretchen Borchelt, vice president of health and reproductive services for the National Women’s Law Center, said in a statement. \nNancy Stanwood, chair of Physicians for Reproductive Health applauded the Obama administration for “proactively addressing the health needs of women.” \n“While most private insurance plans under the ACA are required to cover all contraceptive case, too often plans fail to follow this mandate,” Stanwood said in a written statement. “As physicians, we have seen multiple cases of women being wrongfully denied contraceptive coverage they have paid for and are entitled to by law.” \nMonday’s move by HHS not only addressed contraceptives but also closed a series of loopholes in the law, including one that prohibits insurers from charging patients for anesthesia services in connection with colonoscopies to screen for cancer risk. \nPresident Obama's health care law requires most insurance plans to cover preventive care at no additional charge to patients. The types of services covered generally dovetail with the recommendations of a government advisory panel. Also on the list are birth control pills and other contraceptives. \nBut independent experts and women's groups had recently found coverage gaps for some birth control methods. Insurers said they were trying to comply with the law, but that federal rules did not provide enough detail. \nThe new policy takes effect in 60 days. Other services covered without copays or cost-sharing include: \n-- Preventive screening, genetic counseling and BRCA genetic testing for women at increased risk for having a potentially harmful mutation in genes that suppress cancerous tumors. \n-- Prenatal care and other services to promote healthy pregnancies. The requirement applies to insurance plans that cover children as dependents. \n-- Certain preventive services for transgender people. For example, a mammogram for a transgender man who has residual breast tissue or an intact cervix. \nOn birth control, insurers will be required to offer at least one no-cost option in each FDA-approved category. These include daily birth control pills as well as longer-acting hormonal patches and IUDs, and the morning-after pill. The option provided can be a generic, but if a woman's doctor says a more expensive alternative is medically necessary, the plan must cover it without a copay. \nInsurance billing is notorious for breaking down procedures into different subcategories. The new rules made it clear that patients cannot be billed a copay for anesthesia during a colonoscopy. \n\"The plan or issuer may not impose cost sharing with respect to anesthesia services performed in connection with the preventive colonoscopy if the attending provider determines that anesthesia would be medically appropriate for the individual,\" HHS said in its guidance document. \nThe Associated Press contributed to this report. Advertisement", "external_links": [], "published": "2015-05-11T23:38:00.000+03:00", "crawled": "2015-05-12T00:04:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}