{"organizations": [], "uuid": "160f9052c2e3efbb858c42ee6007be0ba3e8afb3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/2014-09-18-gn-rubio-marco-1.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed#", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/immigration/241614-clinton-clobbers-rubio-on-immigration", "country": "US", "title": "Clinton clobbers Rubio on immigration", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Clinton clobbers Rubio on immigration", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-11T20:00:00.000+03:00", "replies_count": 0, "uuid": "160f9052c2e3efbb858c42ee6007be0ba3e8afb3"}, "author": "brentbbi@webtv.net (Brent Budowsky, columnist, The Hill)", "url": "http://thehill.com/blogs/pundits-blog/immigration/241614-clinton-clobbers-rubio-on-immigration", "ord_in_thread": 0, "title": "Clinton clobbers Rubio on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 11, 2015, 01:00 pm Clinton clobbers Rubio on immigration By Brent Budowsky, columnist, The Hill Greg Nash \nHillary Clinton's bold initiative last week to call for a path to citizenship and other dramatic reforms of immigration policies creates a brilliant contrast to the incoherent and weak immigration position of Sen. Marco Rubio (R-Fla.) and the hostile negativity of leading Republicans to immigration reform. \nDon't believe what you read about the GOP making significant inroads in the Hispanic vote in 2016. The Democrats have the upper hand on issues important to Hispanic voters, ranging from economics to immigration to healthcare and both Bill and Hillary Clinton have long had a special relationship with Hispanic voters. ADVERTISEMENT Last week, Hillary Clinton took forceful command of the immigration issue, a smart move that dramatizes the substantial advantage that Clinton and Democrats have over Rubio and Republicans.\nWhen the Senate passed historic immigration reform, in part because of the great leadership of Rubio, I applauded him for a profile in courage that demonstrated real leadership. \nWhat has happened since? Rubio has disowned his former position, disavowed his greatest legislative accomplishment in the Senate and destroyed his credibility on immigration. \nIt is sad to see. Rubio's profile in courage became a profile in cowardice. Rubio now opposes his previous good work on immigration and says he has learned his lesson. The lesson he learned is apparently to never show courage or leadership without obtaining permission from the right wing of the Republican Party. \nLet's see if former Gov. Jeb Bush (R-Fla.) — who sometimes seems to support historic immigration reform, sometimes seems to waffle about it, and sometimes seems to oppose it — has the courage of his convictions and defies the Republican right on a matter the right sadly considers a holy grail of modern conservatism. \nI respect Rubio, have at times praised him and consider him a serious candidate for the presidency. Yet, to my knowledge, no candidate has ever been elected president after disowning the major achievement in his career; one which would have been an argument in favor of presidential stature and now diminishes it. \nAmerica is a nation of immigrants. Historic immigration reform is urgently needed. Sen. Harry Reid (D-Nev.), the leader of Democrats in the Senate, understands this. Rep. Nancy Pelosi (D-Calif.), the leader of Democrats in the House, understands this. Hillary Clinton, the front-runner for the Democratic nomination for president, understands this and leads the charge for it. Republican leaders in Congress reject this and the junior senator from Florida was for it — before he was against it. \nBudowsky was an aide to former Sen. Lloyd Bentsen (D-Texas) and former Rep. Bill Alexander (D-Ark.), who was then chief deputy majority whip of the House. He holds an LL.M. degree in international financial law from the London School of Economics. Contact him at brentbbi@webtv.net . Tags:", "external_links": [], "published": "2015-05-11T20:00:00.000+03:00", "crawled": "2015-05-11T22:12:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}