{"organizations": [], "uuid": "e76bd3e18a1f35dec82b9d6d372360fdfccf86fa", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/25397/feed", "section_title": "Overnight Defense", "url": "http://thehill.com/policy/defense/overnights/241273-overnight-defense-house-republicans-push-to-nix-immigration-measure", "country": "US", "title": "OVERNIGHT DEFENSE: House Republicans push to nix immigration measure", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT DEFENSE: House Republicans push to nix immigration measure", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-07T01:19:00.000+03:00", "replies_count": 0, "uuid": "e76bd3e18a1f35dec82b9d6d372360fdfccf86fa"}, "author": "mmali@thehill.com (Kristina Wong and Martin Matishak)", "url": "http://thehill.com/policy/defense/overnights/241273-overnight-defense-house-republicans-push-to-nix-immigration-measure", "ord_in_thread": 0, "title": "OVERNIGHT DEFENSE: House Republicans push to nix immigration measure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT DEFENSE: House Republicans push to nix immigration measure By Kristina Wong and Martin Matishak - 05/06/15 06:19 PM EDT \nTHE TOPLINE: A group of 25 House Republicans asked the House Rules Committee to strike a provision in the 2016 defense policy bill that could pave the way for illegal immigrants serving in the armed forces. \nThe group -- led by Rep. Mo Brooks (R-Ala.) -- wants to eliminate an amendment by Rep. Ruben Gallego (D-Ariz.) that encourages the secretary of Defense to review allowing recipients of President Obama's Deferred Action for Childhood Arrivals (DACA) program to serve in the military. \n\"This controversial immigration language greatly increases the risk of the [national defense authorization act's] failure to pass the House. The Rules Committee has the power, and indeed the duty, to prevent such a threat to our national security,\" the group wrote in a letter on Tuesday. ADVERTISEMENT The House Armed Services Committee, which Brooks sits on, approved its $612 billion version of the defense policy blueprint in a marathon markup session last week.\nThe group noted that the full House has voted three times to defund DACA and argue Gallego's text is at odds with the chamber's \"previous position and is a severe threat to passage\" of the National Defense Authorization Act (NDAA). \nIn a statement, Gallego ripped those who signed the letter, saying \"there is no reason to strike it from NDAA other than to appease the fringe of the GOP.\" \nHe argued his proposal \"shouldn't be a controversial issue.\" \n\"The Secretary of Defense has the authority to deem what is in the national interest of the United States, and all we are asking is for him to consider allowing DACA recipients who meet the criteria and want to serve, into our military for that same reason,\" Gallego said. \nOn Tuesday, Senate Armed Services Committee Chairman John McCain (R-Ariz.) closed the door to including any such language in his draft of the legislation, which is expected next week. \nGallego fired back at McCain on Wednesday, saying he should \"stick to his job in the Senate and let the House do our job.\" \nDEFENSE CHIEF POURS COLD WATER ON SYRIA SAFE ZONES: Defense Secretary Ashton Carter told the Senate Wednesday that establishing humanitarian safe zones in Syria would require a \"major combat mission.\" \n\"We have thought this through -- how to secure that zone,\" Carter told a Senate Appropriations defense subcommittee. \"It's a difficult thing to contemplate... and challenging.\" \nHis remarks highlight the continuing reluctance of the Obama administration to establish such a safe zone, despite calls from NATO Turkey and a bipartisan group of senators. \n\"We urge that the United States work with key allies to establish and enforce one or more humanitarian safe zones in Syria without delay,\" said an April 22 letter by Sens. Dick Durbin (D-Ill.), Lindsey Graham (R-S.C.), Tim Kaine (D-Va.) and John McCain (R-Ariz.). \n\"These zones would provide essential protection for displaced Syrian civilians and a safe transit route for desperately needed humanitarian supplies,\" it said. \nDurbin, who is the subcommittee's ranking member, presided over the hearing. \nCarter said establishing humanitarian safe zones in Syria would be contested by the Islamic State in Iraq and Syria (ISIS), al-Nusrah and Syrian forces. \nCarter also told the panel that Russia-backed separatists might be preparing for another military campaign in Ukraine. \n\"It does appear that clearly Russian-backed separatists in eastern Ukraine are preparing for another round of military action which will be inconsistent with the Minsk agreement,\" Carter said. \nThe Minsk agreement was a ceasefire deal between the separatists and Ukraine struck last September, after Moscow's annexation of the Crimean peninsula. Carter's comments came after a senator raised the idea of the U.S. providing military weapons to Ukraine, which the Obama administration has been reluctant to do. The U.S. has been providing \"defensive arms\" to Ukraine rather than offensive arms, Carter explained. Carter said \"the big influencer\" is a combination of sanctions and falling oil prices on Moscow. \"That is what is punishing Russia now,\" he said. \nDEMS URGE FASTER ACTION ON GITMO: Three Democratic senators are urging President Obama to transfer more detainees from the U.S. military prison at Guantanamo Bay, Cuba, warning that \"time is of essence\" with only 20 more months left in his presidency. \n\"Although onerous restrictions imposed by Congress have hindered efforts to close the detention facility, we urge you to immediately take meaningful action in order to end this unfortunate chapter in our nation's history before you leave office,\" wrote Sens. Patrick Leahy (Vt.), Dianne Feinstein (Calif.), and Dick Durbin (Ill.) in a May 5 letter to the president. The warning comes as Congress is drafting its 2016 defense policy bill, which could hamper the administration's ability to shut down the facility and prevent the president from fulfilling a key campaign pledge. The Republican-controlled House next week is expected to vote on its bill, which would restore tougher requirements for any detainee release, and ban the transfer of any detainees to the U.S. or to any \"combat zone.\" The Senate Armed Services Committee will also draft and vote on its version next week, before sending it to the full Senate for a vote sometime during the summer. \nIt will likely include restrictions similar to those in a bill proposed earlier this year by some of the panel's Republican members. \nThe facility currently has 122 detainees, nearly half of whom have been cleared for transfer. The senators also reminded the president that since Jan. 15, there have been no transfers, something they said was an \"especially troubling lapse in light of how little time is left in your administration.\" \"Transferring the 57 cleared detainees as quickly as possible will be a momentous step toward closing Guantanamo,\" they said. \nREPORTERS WANT SENATE MARKUP OPENED: A key group of journalists asked Senate Armed Services Committee Chairman John McCain (R-Ariz.) to make the panel's markup of its annual defense policy bill open to the public. \nThe Standing Committee of Correspondents \"respectfully requests that you reconsider the April 23 decision not to open Senate Armed Services Committee defense authorization markups of non-classified material to the media and the public,\" the group, made of news organizations like the Associated Press and the Washington Post , wrote in a May 6 letter. \n\"We believe the American public would be well served if the committee allowed them to see their lawmakers at work, beginning with the Airland Subcommittee markup scheduled for May 11,\" the group told McCain. \nThe Armed Services panel last month voted 17-9 to keep its deliberation behind closed doors. \nThe national defense authorization act serves as a policy roadmap for all Defense Department programs and efforts. \nHalf of the Armed Services subpanels -- Readiness and Management, Emerging Threats and Capabilities and Personnel -- will be open to the public when they begin hammering out the bill next week, according to its web site. But three others -- Airland, Seapower and Strategic Forces -- will be classified. \nThe journalists noted that the House Armed Services Committee holds its markup of the defense policy blueprint in public. \n\"The process of making decisions should itself be visible to the American people in real time – as it is in most other corners of Congress,\" the panel wrote. \"We are hopeful that you will consider our point of view ahead of next week 's markups.\" \n  Pentagon credit cards used for escort services, says report \n-- Lawmaker raises new questions about plans to resettle Syrian refugees", "external_links": [], "published": "2015-05-07T01:19:00.000+03:00", "crawled": "2015-05-07T18:24:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}