{"organizations": [], "uuid": "c5db2d55078371f56606822603efcc72b577c2cc", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2986146/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "http://www.findata.co.nz/News/Latest/rss.xml", "section_title": "FinData - Latest News", "url": "http://www.huffingtonpost.com/2015/05/22/senate-passes-fast-track_n_7425614.html", "country": "NZ", "title": "Obama Takes Unexpected Setback On Trade Agenda", "performance_score": 8, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Takes Unexpected Setback On Trade Agenda", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-23T05:03:00.000+03:00", "replies_count": 0, "uuid": "c5db2d55078371f56606822603efcc72b577c2cc"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/22/senate-passes-fast-track_n_7425614.html", "ord_in_thread": 0, "title": "Obama Takes Unexpected Setback On Trade Agenda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Takes Unexpected Setback On Trade Agenda As Fast Track Passes Senate Posted: Updated: 8 minutes ago CAMP DAVID, MD - MAY 14: U.S. President Barack Obama speaks to reporters following the Gulf Cooperation Council-U.S. summit on May 14, 2015 at Camp David, Maryland. Obama hosted leaders from Saudi Arabia, Kuwait, Bahrain, Qatar, the United Arab Amirates and Oman to discuss a range of issues including the Iran nuclear deal. (Photo by Kevin Dietsch - Pool/Getty Images) | Pool via Getty Images reddit \nWASHINGTON -- President Barack Obama's trade agenda suffered a setback Friday evening during a series of last-minute maneuvers in the Senate. While the upper chamber eventually passed a bill that would help Obama streamline a trade pact with 11 Pacific nations, the final product threw a wrench into the president's plans. \nThe Senate approved a bill to \"fast-track\" trade agreements negotiated by the president. The agreement will prevent Congress from amending or filibustering Obama's controversial Trans-Pacific Partnership agreement. The TPP deal would have a hard time surviving without fast-track authority. \nBut a key crackdown on human trafficking survived the legislative jujitsu. The White House considers the provision a deal-breaker, as it would force one of the nations involved in the TPP talks -- Malaysia -- out of the agreement. An immigration-related amendment authored by Sen. Ted Cruz (R-Texas) never got a vote, making it far more difficult for Obama to win over skeptical tea party Republicans in the House. \nThe slavery provision's survival means that the House will either need to amend the bill and send it back to the Senate, which would cause a delay and complicate the House debate, or pass a bill and go to conference with the Senate, also causing a delay. It also potentially could be fixed in separate legislation otherwise moving through Congress. \nBut time is not on the side of advocates of the trade agenda, as summer recess is approaching, followed by a heated presidential campaign season. \"It leaves a substantial problem that no one's sure how will be addressed,\" said one senator. If fast-track is ultimately approved, 60 days would need to pass before the TPP could be voted on. \nSen. Bob Menendez (D-N.J.) authored the provision that would effectively bar Malaysia from the agreement, but came to an agreement with GOP leaders over modified language that would allow Malaysia to stay in the deal as long as it made progress toward reducing its dependence on slave labor. The modification, however, never made it into the bill. \n\"It's an interesting thing, isn't it, about Menendez -- it didn't get fixed,\" Sen. Sherrod Brown (D-Ohio), a staunch opponent of the trade bill, said Friday night after the final vote. \n\"So it means, if nothing changes, Malaysia should not be in this agreement,\" Brown said. \"And if the president relaxes or un-designates Malaysia as a tier 3 designation, it would be a tragedy. So either Congress changes it or the House changes it.\" \nIronically, it was Senate Republicans, or at least one Republican, who enabled the provision to stay. The Senate needed unanimous consent to move forward on votes on a series of amendments, including the Menendez modification, but was denied when a Republican senator objected. \nBrown was pleased the provision snuck through, and looked forward to the battle in the House. \n“I'm absolutely happy, because no country should get in with that designation,” Brown said. “I'll be working with [the House]. We had some victories here that surprised people. Everybody thought the Senate would be so easy to get it through and they were surprised that it isn't. I think they got more trouble in the House.” \nOver the past two weeks, Obama has been engaged in a bitter public feud with Senate Democrats over the fast-track bill, which would bar Congress from amending or filibustering the final TPP agreement that Obama negotiates. Senate Majority Leader Mitch McConnell (Ky.) and other Republican leaders have celebrated Obama's trade agenda as a tool to boost economic growth. But Democrats have decried it, saying it will exacerbate income inequality and undermine key financial and environmental regulations. Labor unions, environmentalists and Internet freedom advocates oppose TPP, while corporate lobbyists, including the U.S. Chamber of Commerce, support it. \nMany rank-and-file Republicans, meanwhile, are reluctant to get behind the deal, a position bolstered by radio host Rush Limbaugh on Friday afternoon. \n\"Republicans are providing the necessary push to get it passed, which kind of bothers me,\" Limbaugh said on his radio show. \"Since it's an Obama deal, the odds are it isn't good. Since it's an Obama deal, the odds are the United States is gonna take it in the shorts.\" \nLimbaugh's objections make it more difficult for Obama to win over tea party Republicans. But the most controversial provision of the final Senate bill is opposed not by the GOP, but by Obama himself. \nThat measure would bar governments considered to be complicit in human trafficking from receiving the economic benefits of a fast-tracked trade deal. Menendez, the author of the provision, has described it as a human rights protection that will prevent U.S. workers from competing with modern-day slave labor. The administration has pushed against the provision, saying it would prevent Malaysia from participating in the deal, and eliminate incentives for the country to upgrade its human trafficking enforcement. Human rights advocates strongly support the language that passed the Senate on Friday. \nThe president argues that if the U.S. doesn't cut deals with these partner countries, China will, to U.S. disadvantage. \nThe fast-track bill means the battle now moves to the House, where Speaker John Boehner (R-Ohio) is trying to marshal enough votes from tea partiers to overcome broad Democratic resistance. House leadership is trying to avoid protracted negotiations with the Senate about the final language of the fast-track bill, and was expected to try and push through the Senate version word-for-word. That plan may have been upended Friday. \nThe House may need to add the Cruz anti-immigration language to secure passage. Obama, meanwhile, will be placed in a tough spot by the human trafficking language. The administration could eliminate the procedural hurdle by simply upgrading Malaysia's formal status on human trafficking, but doing so would undermine the integrity of a key U.S. human rights initiative designed to shame rogue regimes. Whatever the result, the final fast-track bill seems destined for a contentious conference session to iron out differences between the House and Senate versions. Republican leaders in both chambers had hoped to avoid such an outcome. \nThe trade debate has roiled the Democratic Party like no issue since the invasion of Iraq in 2003, culminating in a bitter public feud between two of the most popular figures within the party. Obama assailed Sen. Elizabeth Warren (D-Mass.) for issuing supposedly \"dishonest\" critiques and spreading \"misinformation.\" Warren fired back that her concerns are backed by independent experts, and called for Obama to publicly release draft TPP documents to let the public gauge their merits. Obama has kept the texts classified. \nAnd more quietly, Brown united Democrats multiple times to block key procedural votes over the past two weeks, and tried to get amendments that the administration considered “poison pills” attached to the fast-track bill. \nSenate Minority Leader Harry Reid (D-Nev.) found himself at odds with Obama, vowing he would be a “hell no” on the president’s trade agenda, calling the push for it \"insanity.\" \nThe debate over the amendments Friday, and the result of the votes, was instructive. Obama almost lost a vote on legislation offered by Sens. Debbie Stabenow (D-Mich.) and Rob Portman (R-Ohio), which would have directed the administration to crack down on currency manipulation by governments involved in the TPP talks. Economists broadly agree that currency manipulation by China, Japan and other nations has destroyed U.S. jobs by making foreign products artificially cheaper. While China is not in the TPP, Japan is, and U.S. auto manufacturers vociferously advocated in favor of the Portman-Stabenow provision. Currency manipulation is broadly viewed as a major impediment to U.S. auto exports globally. The currency manipulation amendment failed by a vote of 48 to 51. \nAn amendment from Sens. Warren and Heidi Heitkamp (D-N.D.) would have barred fast-track perks to trade deals that allow corporations to challenge domestic laws and regulations before an international tribunal. While so-called investor state dispute settlement cases have been rare in the past, they have become increasingly popular with companies in recent years as a method for undermining a host of regulations. \n\"I want everyone to remember the day you voted on this amendment,\" Heitkamp said on the Senate floor ahead of the vote, predicting future corporate challenges to government rules. \nAn amendment from Brown that would have required congressional approval for any future countries to sign onto TPP failed by a vote of 47 to 52 \nSen. Jeff Flake (R-Ariz.) proposed an amendment to eliminate trade adjustment assistance from the trade package. That assistance provides job training and financial aid to workers who lose their jobs to international trade. Had the amendment passed, it would have destroyed the existing Democratic support for fast-track in the House. It failed by a vote of 35 to 63. \nWhile the battle in the Senate proved lengthy and heated, a far more grueling fight lies ahead. Heading into Memorial Day recess, House Republicans admitted the votes were not there to pass fast track, and urged Obama to lobby more Democrats. \n“Republicans are going to by and large provide the vast majority of the votes both in the House and the Senate,” Rep. Pat Tiberi (R-Ohio) told reporters this week. “But the president of the U.S. needs to get more Democrat involvement in passing this.” \nDemocrats have said Republicans shouldn’t rely on them to help pass the fast-track authority for Obama once it reaches the House. Right now, Republicans estimate they have roughly 20 Democrats who will vote with them to give the president the expedited powers, but it’s not enough. \n“I think there is a substantial enough bloc within our conference that have stated they are leaning no, or no, or are seriously undecided that we are going to have to have Democrats,” said Rep. Matt Salmon (R-Ariz.) “This president hasn’t been so engaged with Congress and now he’s trying to drum up some votes and build some capital that doesn’t exist. It’s not going to be an easy chore to corral the votes in the House.” More:", "external_links": [], "published": "2015-05-23T05:03:00.000+03:00", "crawled": "2015-05-23T05:48:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}