{"organizations": [], "uuid": "027096a9488d8b4ed424fcbc15a514d82c4397d8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/comedy/blog.xml", "section_title": "Comedy Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/david-vaughn/my-advice-to-president-ob_1_b_7308732.html", "country": "US", "title": "My Advice to President Obama for His New Twitter Account | David Vaughn", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "My Advice to President Obama for His New Twitter Account | David Vaughn", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-19T22:32:00.000+03:00", "replies_count": 0, "uuid": "027096a9488d8b4ed424fcbc15a514d82c4397d8"}, "author": "David Vaughn", "url": "http://www.huffingtonpost.com/david-vaughn/my-advice-to-president-ob_1_b_7308732.html", "ord_in_thread": 0, "title": "My Advice to President Obama for His New Twitter Account | David Vaughn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo by David Vaughn.\nHello, Mr. President!\nWelcome to the wonderful world of Twitter ! A lot has changed in the tweeting world since you stepped into office. Now we can have banners atop our profiles that no one ever sees. And we can link more apps than ever before, clouding people's Twitter feeds with horrible updates about where we ate lunch.\nJust in case the Michelle is too busy with her account, @FLOTUS , to show you the ropes, allow me:\nFirst, I'd like to suggest that you get this #hashtag thing down. It's a simple gesture allowing people to connect with you on certain ideas you may have. For instance, if you want to promote the great care Americans are receiving with the Affordable Care Act, you might want to write something like this:\nI just spoke with Karen Tenderman of Sandusky, Ohio. Her ingrown toenail is now a worry of the past! #ThanksObamaCare\nOr, at other times, it might just help you express how you feel:\n\"Just got heckled again during my latest national address #CanWeJustNot @GOP #IUsedtoLikeElephants\"\nSecond, don't self-promote too much. Twitter is a place for people to share with everyone in the world. However, oversharing is a big problem on social media. If you decide to start a new band (Obama and The Administration), don't try to shamelessly plug it every other post. We all listened to the song on YouTube already. It wasn't that great. We know there's a video. We only watched it because Mariska Hargitay was in it.\nThird: Don't drink and tweet. I repeat, do not drink and tweet. I've learned this the hard way, several times. Mostly, I just wrote to people, telling them how much I loved them. Still, you might not be so lucky. Your tweet might reveal far too much: \" @JoeBiden , I know you farted the other night. I let you blame Bo, but we all know that it was you... #SayNoToCabbage\".\nJust, please, don't do it.\nAlso, there is a thing called a \"troll.\" No, it's not those creatures that look like Ross Perot -- though it's just as formidable. A troll is a person who usually has a logo from his favorite sports team or a bizarre, ironic meme as his avatar. He'll enjoy tweeting mean things to you, just to hope that you read them. Most of these trolls are impossible to find, as they don't thrive beneath old bridges. However, they do live under a staircase in their grandmother's basement. Trolls thrive off of Mountain Dew and other people's tears. Do not feed them.\nLastly, ignore a celebrity or two who might feel inclined to tweet to you. For instance, Ashton Kutcher. I like Ashton Kutcher. However, if I was in your position and he tweeted me, I would have to ignore him. Not because Ashton did anything wrong (save for that Steve Jobs movie), it's just that Ashton doesn't' need a shout back. Your people need a shout back. \"Like\" a post by us. \"Retweet\" something refreshing from us. Let the people know that your account, @POTUS , is more than about following a trend; it's about putting yourself out there to hear from the people of Twitter... Oh, and hashtags. It's mostly about hashtags.\nFollow David Vaughn on Twitter: www.twitter.com/davidvaughn\nMore: Barack Obama Twitter Flotus Potus Obamacare Politics Satire Political Humor Obama Twitter This Blogger's Books and Other Items from... Middle-Class Fantasies\nby David Vaughn", "external_links": [], "published": "2015-05-19T22:32:00.000+03:00", "crawled": "2015-05-19T21:58:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}