{"organizations": [], "uuid": "394633c66b0bbb594ce94e1d308ce9fd0b05708d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/boltonjohn_032914getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/241548-bolton-terrorists-may-attack-before-obama-leaves-office", "country": "US", "title": "Bolton: Terrorists may attack before Obama leaves office", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Bolton: Terrorists may attack before Obama leaves office", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-09T22:38:00.000+03:00", "replies_count": 0, "uuid": "394633c66b0bbb594ce94e1d308ce9fd0b05708d"}, "author": "Elise Viebeck", "url": "http://thehill.com/blogs/blog-briefing-room/news/241548-bolton-terrorists-may-attack-before-obama-leaves-office", "ord_in_thread": 0, "title": "Bolton: Terrorists may attack before Obama leaves office", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images President Obama is encouraging terrorism and aggression toward the United States with an inept foreign policy, former Ambassador to the United Nations John Bolton claimed Saturday. The possible GOP presidential candidate, courting support at the South Carolina Freedom Summit, delivered the day’s most strident and sustained broadside against Obama and Hillary Clinton on the topic of national security. Bolton, a figure with much less name recognition than his potential 2016 rivals, warned of weapons of mass destruction carried by ISIS fights, a “nuclear holocaust” for Israel and the possibility of attacks while Obama remains in office. ADVERTISEMENT Terrorists “don’t know who will be elected in 2016. They know they’ve got Barack Obama until then. Any adversary out there with an agenda against the United States knows [that] this is the time to do it,” he told a moderately engaged crowd. Bolton, a think tank fellow and pundit on Fox News, considered entering the 2012 race for president but ultimately did not launch a bid. Little of his speech Saturday was used to pitch his own qualifications, and virtually none pertained to domestic policy. Instead, Bolton rattled off a string of attacks that left audience members fighting for the chance to applaud him. Obama is an “amateur” whose experience shows that on-the-job training in foreign policy doesn’t work, Bolton said in what could be interpreted as a swipe at potential GOP candidates such as Wisconsin Gov. Scott Walker. Clinton is a “radical” who is, in fact, “to the left of Elizabeth Warren,” the Massachusetts Democratic senator and liberal icon, he said. Bolton also gave the crowd the day’s only references to the 2012 Benghazi, Libya, terror attack and the violence of Islamist militant group Boko Haram. In a brief nod to his potential candidacy, Bolton suggested he would be the best person to face Clinton in a general election debate on international issues. How much that quality matters to GOP primary voters remains unclear. In an earlier focus group, audience members said they cared more about a candidate’s conservative positions than his or her ability to beat Clinton. “She can talk the talk when it comes to foreign policy,” Bolton insisted. “It a debate it is going to be critical for the Republican nominee to beat her soundly on an issue that should be ours.” Tags:", "external_links": [], "published": "2015-05-09T22:38:00.000+03:00", "crawled": "2015-05-09T23:15:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}