{"organizations": [], "uuid": "4a84c7a70a28b3de3b85167d098cbde25376b78f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/stan-sorscher/why-is-president-obama-having-so-much-trouble--selling-tpp_b_7288196.html", "country": "US", "title": "Why Is President Obama Having So Much Trouble Selling TPP? | Stan Sorscher", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Why Is President Obama Having So Much Trouble Selling TPP? | Stan Sorscher", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-15T05:08:00.000+03:00", "replies_count": 0, "uuid": "4a84c7a70a28b3de3b85167d098cbde25376b78f"}, "author": "Stan Sorscher", "url": "http://www.huffingtonpost.com/stan-sorscher/why-is-president-obama-having-so-much-trouble--selling-tpp_b_7288196.html", "ord_in_thread": 0, "title": "Why Is President Obama Having So Much Trouble Selling TPP? | Stan Sorscher", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Barack Obama is cool and personable -- no-drama Obama. Then suddenly, he scolds critics of the Trans-Pacific Partnership, his NAFTA-style trade deal. He accuses them of being \"wrong,\" unable to look at the facts, fighting the last war, confusing this new improved trade deal with NAFTA, if they don't want TPP they must want nothing at all ... and they definitely are not invited to his next birthday party.\nOf course, the critics are right , they are looking straight at the facts, the critics know exactly what a good trade policy would look like, and it's nothing like NAFTA or TPP. and deep down, everyone wants to be invited to his next birthday party.\nSo what's wrong with TPP?\nWill TPP create jobs?\nNo. Economic models predict a tiny increase in GDP from TPP. Globally, tariffs are already low. That deal is done. In the past, these same models have been wildly optimistic, so when they predict \"no gain,\" that says a lot.\nIn the NAFTA debates in 1993, we heard \"millions of new jobs.\" We lost 700,000 . When we let China into the WTO in 2000, we heard \"millions of new jobs.\" We did create 2 or 3 million new jobs -- in China . Three years ago, we heard the same promise for the Korean trade agreement -- 70,000 jobs. We lost 75,000 .\nThe other day, Nike said they would create \"up to\" 10,000 jobs in America , if we bring Vietnam into TPP. Right. Nike recently reduced their U.S. production workforce by a third . If they can really create 10,000 jobs, they should guarantee it.\nWe can't walk away from trade\nWe are told that 95 percent of the consumers in the world are outside the US. That's a big scary number. On the other hand, that number for Belgium is 99.8 percent, and Belgium is still OK.\nThose billions of consumers around the world are also producers. They can produce well beyond their capacity to consume, especially when our global corporations eagerly invest capital in low-wage countries and ship our technology to them. These deals are more about producing in low-wage countries, not selling there.\nIs TPP a secret?\nPresident Obama says TPP is not a secret . Any member of Congress can look at it. .... as long as they don't take notes -- no pictures, no copies and they can't discuss what they see. However, if Senator Elizabeth Warren tells her constituents about TPP's language protecting corporations, she would be violating national security secrecy laws, and could technically be accused of treason. Maybe at her trial, she can say, \"Well President Obama told me it wasn't a secret!\"\nExports go up.\nExports go up. Of course, imports go up faster. This is really a simple issue. You give me $5. I'll give you $3. Look! You just got $3. You should be very happy. We can congratulate each other for negotiating that great deal. Let's do it again. You give me $5 and I'll give you $3. Look. You have 3 more dollars!\nOf course, trade is much more complicated than that. Not only did you lose $2, you lost your job, your industrial capacity, your ability to innovate and create new products, and your standard of living. But your President is boasting about how his new deal, which you can't see, is different and better.\nWhat have we learned from NAFTA?\nThe labor and environmental standards are so ineffective that a country as violent as Colombia can get a trade deal with favorable access to our country, while hundreds of labor activists are killed for speaking up for workers. Our US Trade Representative is struggling to decide if murders are a violation of the labor protections in previous agreements. As Thea Lee, from the AFL-CIO put it , \"If there is a climate of terror against trade unionists who effectively are prevented from exercising their rights under the law, then our government ought to take this at least as seriously as a failure to send a labor inspector to a factory.\"\nA nutty argument about China\n\"We should set the rules before China does.\" This argument takes various forms. Perhaps TPP will contain China by binding Vietnam and New Zealand to our economy. Or maybe TPP will prevent US producers from moving work to Peru and Malaysia to gain access to China's markets. Somehow, TPP will deal with tariffs and taxes in China.\nThe problem with this argument is that China is not in TPP. China will pursue its national interests with New Zealand, Vietnam and any other country, with or without TPP.\nAs a case in point, we are already about as integrated with Europe as you can be economically, politically, culturally, and historically. Nevertheless, several European countries recently joined a major Chinese economic investment project .\nWill TPP set higher new standards?\nNot the way we might hope. Hundreds of corporate lobbyists are actively involved in the negotiating process. TPP will produce very favorable terms for global investors and global companies .\nThe handful of advisors for the public interest say their access is restricted and their recommendations are mostly ignored. Yes, TPP will set new global standards reflecting corporate values and principles, not our values as a democracy.\nTrust me\nSome of our elected officials ask, \"Why don't you trust the President?\"\nWe have accumulated over $10 trillion in goods trade deficits since NAFTA. Our lived experience tells us the 99 percent are getting burned by our trade policy, while global companies are doing great.\nTwenty years after NAFTA, our leaders and negotiators have lost the presumption of trust. They now have the burden of proof. Presidents back to Gerald Ford have made and broken the same promises. President Obama is the last in a long line of leaders playing a weak hand in the trade policy card game.\nWe need a new trade policy before we can rebuild trust. We can do better. We normally rely on democracy to solve difficult problems. Nothing about TPP looks like democracy.\nFollow Stan Sorscher on Twitter: www.twitter.com/sorscher\nMore: TPP Fast Track Nafta Trade Policy Globalization", "external_links": [], "published": "2015-05-15T05:08:00.000+03:00", "crawled": "2015-05-15T05:33:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}