{"organizations": [], "uuid": "7b3e0de8b2cc9c39a9939445b2dbaed3f78737c0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/blogs/e2-wire?format=feed&type=rss", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/240691-obama-signs-energy-efficiency-bill-into-law", "country": "US", "title": "Obama signs energy efficiency bill into law", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama signs energy efficiency bill into law", "spam_score": 0.0, "site_type": "blogs", "published": "2015-04-30T23:01:00.000+03:00", "replies_count": 0, "uuid": "7b3e0de8b2cc9c39a9939445b2dbaed3f78737c0"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/240691-obama-signs-energy-efficiency-bill-into-law", "ord_in_thread": 0, "title": "Obama signs energy efficiency bill into law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama signs energy efficiency bill into law By Timothy Cama - 04/30/15 04:01 PM EDT \nPresident Obama on Thursday signed into law a measure that is intended to improve energy efficiency in buildings and stop efficiency rules for certain water heaters. \nThe measure had strong bipartisan support and easily passed the Senate in March and the House in April. ADVERTISEMENT It creates new voluntary building efficiency standards and exempts certain grid-enabled water heaters from efficiency regulations.\nObama brought to the White House energy efficiency advocates and the leading congressional backers of the legislation, including Sens. Rob Portman (R-Ohio) and Jeanne Shaheen (D-N.H.), for the signing ceremony, along with Energy Secretary Ernest Moniz. \n“What we’ve seen is a coming together of Republicans and Democrats who are going to facilitate us being much smarter in terms of building buildings, how we use energy and, as a consequence, we’re going to save money for consumers, we’re going to save money for businesses, and we’re going to deal with issues like climate change that have an enormous economic and health impact on Americans as a whole,” Obama said before signing the bill, according to the White House. \nThe provisions contained in the bill were once part of a much broader energy efficiency package that Portman and Shaheen pushed in the last Congress with bipartisan support, but that got caught up in a fight over the Keystone XL oil pipeline and never passed. \nShaheen said she was glad to have the smaller measure signed into law. \n“It’s always tough to convince Washington to not play politics with a good idea,” she said in a statement. “But persistence has paid-off and this legislation is a small but significant victory over legislative gridlock.” Tags: Thousands of new Lerner emails... Congressional committees say an inspector general found roughly 6,400... Baltimore mom praised for smacking... \"I don't want him to be a Freddie Gray,\" Toya Graham said. Faith leaders demand that liberal... Scott Lively slammed Justices Kagan and Ginsburg for officiating same-sex... Brent Budowsky: Holy war against... OPINION | Republicans lead a party that looks like little more than an... Internet up in arms over '... An activist was seemingly plucked off the streets in full view of news... Dems hammer Japanese prime... Honda said Abe's \"refusal to squarely face history\" is an insult to so-... GOP unveils budget deal that seeks... The deal would approve more than $5 trillion in spending cuts over a... Baltimore teen disciplined by mom... \"I understand how much my mama really cares about me,” Michael Singleton... Sanders to launch presidential bid The independent senator will enter the Democratic fray Thursday to... Obama accidentally crashes WH... The president walked in on some of the journalists who cover him having... Young voters want a Democrat in... A poll of millennials shows a Democrat has wide support among 18-29-year-... Senators clash over Iran votes Democrats are warning that all bets are off if controversial amendments... Justice Kennedy doesn't reveal... The Supreme Court's most frequent swing vote sent mixed messages Tuesday. Dem to bring Korean 'comfort woman... Rep. Mike Honda (D-Calif.) has the Japan government of failing to own up... Senators vote to block EPA’s use... A Senate committee voted Tuesday to prohibit the Environmental Protection... Reid: 'Journalism doesn't exist' Reid hailed a man who peddled a false story about the minority leader... How Jeb Bush will win in 2016 Bush will find only one path to victory in 2016: through his brother,... Paul blames 'breakdown in the... '16 GOP hopeful says there are \"root, cultural causes\" for violence but \"... Carson slams rioters: 'It makes no... “Reacting out of anger seldom leads to anything helpful,” the possible... Sanders: ‘I am running for... The Vermont Independent told the AP he was all-in for 2016 on Wednesday.", "external_links": [], "published": "2015-04-30T23:01:00.000+03:00", "crawled": "2015-05-01T06:15:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}