{"organizations": [], "uuid": "57a6e9c47f3a7ed263bcb22e60acc5721ceb4c80", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/243139-hispanic-caucus-calls-immigration-court-ruling-a-huge-blow", "country": "", "title": "Hispanic Caucus calls immigration court ruling a 'huge blow' | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Hispanic Caucus calls immigration court ruling a 'huge blow' | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "57a6e9c47f3a7ed263bcb22e60acc5721ceb4c80"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/243139-hispanic-caucus-calls-immigration-court-ruling-a-huge-blow", "ord_in_thread": 0, "title": "Hispanic Caucus calls immigration court ruling a 'huge blow' | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 26, 2015, 05:23 pm Hispanic Caucus calls immigration court ruling a 'huge blow' By Cristina Marcos \nThe leader of the Congressional Hispanic Caucus said Tuesday that a federal appeals court's decision continue freezing President Obama's executive actions on immigration was a \"huge blow.\" \nThe Obama administration had filed an appeal to the temporary hold on the executive actions. But the Fifth Circuit Court of Appeals sided with a Texas judge who issued a temporary injunction in February that blocked the president's executive actions from moving forward. \n\"Today's denial of the emergency stay is a huge blow to our community,\" Congressional Hispanic Caucus Chairwoman Linda Sanchez (D-Calif.) said in a statement. \"The fear of deportation is a real and devastating burden that many of our Latino families live with, and one that should not continue to consume the lives of undocumented immigrants indefinitely.\" ADVERTISEMENT President Obama's executive actions issued in November would expand the program known as Deferred Action for Childhood Arrivals that allows qualifying illegal immigrants who arrived to the U.S. as children to obtain work permits, as well as a separate program that shields parents of citizens or legal residents from deportation.\nTwenty-six states led by Texas subsequently filed a lawsuit challenging the constitutionality of President Obama's executive actions. \nSanchez said the Hispanic Caucus hopes the Obama administration will appeal the court's decision. \n\"The ruling by the Fifth Circuit Court of Appeals is deeply disappointing but it is not an ultimate and permanent defeat. The Hispanic Caucus will do everything in its power to see the ultimate implementation of these executive actions,\" Sanchez said. Tags: ", "external_links": [], "published": "2015-05-27T03:00:00.000+03:00", "crawled": "2015-05-27T04:54:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}