{"organizations": [], "uuid": "70914b41c39a9f3b2239620dac1cfdbf2103a9f0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2973106/images/o-MY-BODY-MY-CHOICE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/blog.xml", "section_title": "Women Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/xojane-/i-had-an-abortion-to-save-my-life_b_7342170.html", "country": "US", "title": "I Had An Abortion To Save My Life | xoJANE", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "I Had An Abortion To Save My Life | xoJANE", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-22T17:57:00.000+03:00", "replies_count": 0, "uuid": "70914b41c39a9f3b2239620dac1cfdbf2103a9f0"}, "author": "xoJANE", "url": "http://www.huffingtonpost.com/xojane-/i-had-an-abortion-to-save-my-life_b_7342170.html", "ord_in_thread": 0, "title": "I Had An Abortion To Save My Life | xoJANE", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This post originally appeared on xoJane .\nBy Anonymous\nThe deepest grief I ever experienced was over the loss of a life that I, myself, ended. I was so traumatized by the entire experience that I was diagnosed with post-traumatic stress disorder.\nI had all the symptoms: flashbacks, nightmares, panic attacks. I would obsessively replay the scene in the abortion clinic over and over again in my mind, desperately wanting it to un-happen. I would have sacrificed a limb instead, if I could have. But that wasn't the choice I was given.\nMy options were to lose a pregnancy or lose my life, and... well, I guess you could say I chose life.\nI had been overjoyed when I found out I was pregnant. I thought there might be a little trouble at first because I suffer from a number of chronic health problems that would no doubt be difficult to treat without medication, but I figured they would all be manageable.\nI did a quick search on Google and found out that three of the medications I was taking were \"category D,\" meaning that they'd been definitively linked to birth defects and were only prescribed during pregnancy in worst-case scenarios. The other medication was \"category C,\" meaning that it might be dangerous but is sometimes worth a shot.\nI wanted this baby. I had completely fallen in love with him -- and I was sure it was a him -- from the moment I saw two pink lines on the pregnancy test. I felt panicked when I found out that my medication might be harmful, but it was important to me to protect this little guy.\nI was meant to be his mother; I knew that. I would be willing to endure pain and discomfort and even life-threatening complications for this baby's sake, if I had to.\nMaybe it was reckless, but it was what I wanted and needed. My doctor looked very worried when I came to her with what I tried to insist was good news. She stopped short of actually saying the word \"abortion,\" but she told me in no uncertain terms that I was going to have to choose between one tremendous risk and another.\nI could stay on my medication and nearly guarantee having a child with multiple severe birth defects -- and, indeed, it was very likely that the damage was already done -- or I could stop taking my medication and risk my own life.\nI quit my cocktail of medications cold-turkey, without having a backup to treat the conditions they were originally prescribed for. It wasn't so bad, to start out. I had terrible headaches and dry-mouth and was seeing stars and fainting. No big deal, I told myself.\nI started vomiting--at first five times a day, then ten, then 20. Soon I couldn't keep down even tiny sips of water, and the cascade of complications hit me. I grew delirious and confused and weak. I could barely remember who or where I was and the people around me seemed distant and surreal.\nI fainted over and over again, collapsing more than once while trying to get from one room to the next. I dry-heaved. I'm fairly certain that I had at least two grand-mal seizures.\nI tried to talk to a few people about the pain I was going through, physically and mentally. I understated how much my health was failing me and kept hidden in my apartment without telling anyone on the outside how bad it was. I didn't want them to tell me what I already knew, which was that I had made a mistake by trying to carry this pregnancy to term.\nWhen I did speak to a few friends, my pro-choice friends didn't understand why I was describing it as a \"baby\" or why I was so attached to a pregnancy that was killing me. My anti-choice friends -- \"friends,\" really -- told me that they were praying for me and that God would sort everything out if I just had faith. One even tried to send me to a preacher who would anoint me and faith-health me.\nAbsolutely no one told me what I needed to hear, which was, \"It's okay to end this pregnancy, and it's also okay to grieve it.\"\nMy experience at the abortion clinic didn't help things. When I got out of my car, a group of protesters holding pictures of dead fetuses screamed in my ear, \"Don't kill me, Mommy!\" And then yelled,\n\"We speak for those who can't speak for themselves!\"\nI couldn't help but hear, and internalize, what they were saying. I was murdering my baby. I was failing. I was being selfish.\nI started to scream, to tell them that this was the worst day of my life and they were making it worse. Delirious, I half-remember that one of them called me a murderer and that I had readied myself to punch him, when a security guard put an arm around me and ushered me in.\nIt didn't take much, if any, effort for the security guard to overpower me, of course. After weeks of being seriously ill, I weighed all of a 108 pounds and trembled like a leaf.\nThe experience inside the clinic wasn't much better. I hadn't been able to afford a sedative but had hoped that the procedure itself wouldn't be that bad if I was awake for it. After all, they're supposed to use a local anesthetic.\nBut it was only seconds into the abortion when I realized I had made a horrible, horrible mistake. I felt like I was being stabbed in the womb with a hot knife. I screamed and jerked involuntarily, and the nurses held me down and yelled at me to be quiet and be still.\nWhen it was over, I sobbed and wondered if my womb had been completely destroyed -- it wasn't supposed to hurt like that, was it?\nNo one gave me answers, and the room around me was full of women who were still waking up from the sedative. I remember making eye contact with them -- all of them drooling and looking apathetic -- and wishing desperately that I could be one of them. That I could be half-asleep now, and not feel this much pain.\nI found out months later that one of my medical conditions makes me completely immune to the effects of lidocaine and other local anesthetics -- so the reason for my pain was that I had essentially been through a major surgery while awake and able to feel it.\nIf I had known that beforehand, I would have never been subjected to so much pain and trauma. But, since I didn't, I've got one more diagnosis to add to my laundry-list of medical problems: Now, I have PTSD from the entire experience, with all the horrendous, disabling symptoms that come with it.\nThe first year or so after my abortion was absolute torture for me and I feel lucky that I survived it. I'm healing emotionally, slowly but surely.\nI got to have a second chance at having the same sweet little boy I'd wanted all along. My second pregnancy with him -- that's how I think of it -- was carefully planned and I worked with a team of experts to minimize the risks to both of us. It was a difficult pregnancy, but worth it in the end. I love my little boy with all my heart.\nThere's a danger in talking about \"good\" abortions -- these stories, like mine, of women choosing to end wanted pregnancies because of medical complications. They're important because they bring to light the need for abortion due to medical reasons, but they also present the danger of making it seem like other reasons for abortion are less valid. That's not my goal.\nI don't want anyone to think that I had abortion for a \"good\" reason and that abortions for other reasons are bad. What I do want is for people to hear my story and realize that abortion is often a much less black-and-white issue than politicians want us to think.\nMy journey was hard and painful, but years down the road, I know that I did nothing wrong and that, if there is a God who cares about what happens to my uterus, she forgives me for saving my own life. I'd like to think that others can do the same.\nALSO ON HUFFPOST:\nClose  #YesAllWomen Stories of  \n Share  Tweet  &#10006 Advertisement Share this &#10006 close Current Slide More: Abortion Women's Health Pro Choice Pro Abortion", "external_links": [], "published": "2015-05-22T17:57:00.000+03:00", "crawled": "2015-05-22T18:47:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}