{"organizations": [], "uuid": "58ae34e6a01d64ca4a65ba146d8b74bbb8b229ee", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/ken-blackwell/candidates-win-evangelicals-with-pro-american_b_7302202.html", "country": "US", "title": "Candidates Win Evangelicals With Pro-American Worker Immigration Policy | Ken Blackwell", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Candidates Win Evangelicals With Pro-American Worker Immigration Policy | Ken Blackwell", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-18T04:00:00.000+03:00", "replies_count": 0, "uuid": "58ae34e6a01d64ca4a65ba146d8b74bbb8b229ee"}, "author": "Ken Blackwell", "url": "http://www.huffingtonpost.com/ken-blackwell/candidates-win-evangelicals-with-pro-american_b_7302202.html", "ord_in_thread": 0, "title": "Candidates Win Evangelicals With Pro-American Worker Immigration Policy | Ken Blackwell", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wisconsin Governor Scott Walker, an expected GOP presidential candidate, drew the ire of the political right and left recently over his comments on immigration. When it comes to the immigration issue, Republicans are expected to use the tried and true, consultant tested \"secure the border\" talking point and move on to other issues.\nGov. Walker, like former U.S. Senator, Rick Santorum, has taken things further than just a discussion of illegal immigration. They have dared to discuss the impact of legal immigration on American workers. Like most Republicans, I'm still undecided about the Presidential field. But I have an enormous amount of respect for these guys and what they have done as they campaign. I applaud their statements on immigration and their willingness to go against the status quo on immigration.\nWhat radical proposal could have inspired attacks from liberal media outlets like MSNBC, Mother Jones magazine and the Huffington Post as well as The Wall Street Journal and establishment Republicans such as Senators Sen. John McCain (R-AZ) and Sen. Orrin Hatch (R-UT) and ?\n\"In terms of legal immigration, how we need to approach that going forward is saying -- the next president and the next Congress need to make decisions about a legal immigration system that's based on, first and foremost, on protecting American workers and American wages,\" stated Governor Walker during an interview with Glenn Beck.\nAccording to the elites, an immigration system \"based, first and foremost, on protecting American workers and American wages\" is unacceptable. But how does this resonate with voters?\nAccording to a poll last week at Evangelicals for Biblical Immigration , evangelical voters, a key voting bloc in the early Republican primary states, prefer an immigration policy that gives priority to American workers.\nThe survey polled evangelical voters nationwide on if they were aware of the \"2016 presidential candidates talking about whether to cut or increase annual legal immigration\" and they were then asked their opinion about types of statements being made by potential presidential candidates without mentioning any name or party.\nBy a 4-1 margin, evangelicals \"strongly supported\" (rather than \"strongly opposed\") a statement that legal immigration should be cut because \"the priority for U.S. immigration policy should be to protect American workers and their wages.\"\nOnly 24 percent of evangelicals agreed that our current level of immigration, about one million per year, should stay the same or be increased. About the same number (25 percent) said annual legal immigration should be cut to zero. Most wanted legal immigration cut by at least half.\nWhen it comes to amnesty, only 26 percent strongly or somewhat supported a priority of offering work permits and citizenship to illegal immigrants currently in the country, while 67 percent strongly or somewhat opposed it. Also by a 12-1 margin, evangelical voters said it is \"more moral\" for new jobs to go to unemployed Americans and legal immigrants already here than to give illegal immigrants an equal right to compete for the jobs.\nCandidates that wish to enlist the support from evangelical voters would be wise to advocate policies that prioritize American workers when it comes to immigration. That means opposing rewarding illegal aliens with work permits so they can compete with U.S. citizens and legal permanent residents for jobs. It also means reordering our legal immigration system to protect the jobs and wages of American workers. Candidates that do not advocate a pro-American worker immigration system will find life difficult on the campaign trail.\nFollow Ken Blackwell on Twitter: www.twitter.com/kenblackwell\nMore: Immigration Citizenship Amnesty Scott Walker Rick Santorum", "external_links": [], "published": "2015-05-18T04:00:00.000+03:00", "crawled": "2015-05-18T03:37:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}