{"organizations": [], "uuid": "11c4ff64c7c4f4111aebbddc6c46af0e0b994ce3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_042115getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/blogs/pundits-blog/economy-budget/243060-how-obama-could-hijack-tax-reform", "country": "US", "title": "How Obama could hijack tax reform", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "How Obama could hijack tax reform", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-26T14:00:00.000+03:00", "replies_count": 0, "uuid": "11c4ff64c7c4f4111aebbddc6c46af0e0b994ce3"}, "author": "ike.brannon@gmail.com (Ike Brannon, contributor)", "url": "http://thehill.com/blogs/pundits-blog/economy-budget/243060-how-obama-could-hijack-tax-reform", "ord_in_thread": 0, "title": "How Obama could hijack tax reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 26, 2015, 07:00 am How Obama could hijack tax reform By Ike Brannon, contributor \nIf congressional Republicans offered the president a deal that would make the tax code markedly more progressive, raise more revenue and also fund several of his second-term priorities, would he agree to such a thing? \nThe answer the White House would undoubtedly give would be a guarded \"yes\" — but that such a deal would never come from the Congress. That is certainly true, but the White House could propose precisely such a deal and come out with an undisputed political and policy victory, regardless of whether Republicans accept the deal. \nSuch a proposal would be a radical tax reform that goes far beyond what's currently being contemplated by congressional Republicans: Along with reducing the tax break for inherited wealth — an idea already floated by the White House — it would include eliminating the deduction for mortgage interest as well as state and local taxes while also capping the deductibility of charitable contributions and retirement savings. The proposal would also have a much lower cap for the deductibility of employer-provided health insurance than the one coming down the pike and eliminate lower tax rates for carried interest as well. \nThese tax deductions (actually, all tax deductions for that matter) go overwhelmingly to the wealthy. Only 30 percent of all households — the richest 30 percent — actually choose to go the route that allows them to take deductions from their income, and the tax code's progressivity amplifies the benefits that accrue to the wealthy from these deductions. Someone making $50,000 a year saves only 15 cents for each dollar he deducts, but someone making $500,000 a year saves 40 cents, and has a lot more to deduct as well. ADVERTISEMENT Republicans would likely take this deal because their goal in any tax reform is to pay for lower tax rates (which they believe begets more economic growth) by getting rid of various deductions, credits, and exclusions.\nThe problem is that most deductions have large lobbies dedicated to protecting them. If Senate Finance Chair Orrin Hatch (R-Utah) or Ways and Means Chair Paul Ryan (R-Wis.) were to propose these reductions, congressional Democrats would allege they are harming the middle class with their cuts and lobbyists would reward them for doing so. But if it's the White House that's proposing it, Messrs. Ryan and Hatch would leap at the deal and work furiously to round up votes, knowing there is no other way to come up with enough rid tax expenditure savings to finance anything worthy of being called a \"fundamental\" tax reform. The dynamics would be similar to what we're currently seeing regarding trade promotion authority — except congressional Democrats would lack the fig leaf of pretending that they're fighting for the working class. \nThat desperate desire of Republicans to generate tax savings gives the White House plenty of leverage to lay claim to a share of any new revenue for its priorities. A new child tax credit and money to make community colleges free would be just the starting point, and Republicans couldn't say \"no\" to more demands, since it constitutes a deal they could never hope to replicate with the next president, regardless of party. \nThe revenue that would be generated from ending these tax expenditures is huge: Savings approaching $4 trillion in the next decade would be achievable in the next decade if we pursued these changes. \nThe White House would get a political win regardless of the outcome: If Republicans acquiesce, then the administration will have funded its second-term priorities, and if not, it would create gigantic fissures within the Republican Party that will hinder them in the upcoming election. \nDemocratic congressman who represent wealthy big-city enclaves will be up in arms at the prospect of their constituents losing valuable deductions, but it's hard to see how this would cost any of them an election, especially since most vulnerable Democrats got picked off in the last race. A betting man would wager that not a single Democratic member who runs for reelection in 2016 will lose, tax reform or not. \nRepublicans would want use their share of the revenue to lower tax rates, which will anger progressives, but political exigencies will force them to do it for everyone, so the wealthy won’t get every dime back that they lose from the reduction in deductions. Far from it: Any reform that eliminates these big deductions will be radically progressive. \nThe only thing that would keep the White House from doing would be a perception that Republicans might benefit as much as them, but that would be wrong: Republicans have all the downside risk in this maneuver. The administration has everything to gain and nothing to lose from taking the offensive on a fundamental, progressive tax reform. \nBrannon was an economist for both the Senate Finance Committee as well as the U.S. Treasury. Tags:", "external_links": [], "published": "2015-05-26T14:00:00.000+03:00", "crawled": "2015-05-26T22:05:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}