{"organizations": [], "uuid": "f90b9c1cf023a311047208e93755e79198d56956", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/nikelogo05082015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/2005/feed#", "section_title": "The Hill: Finance Regulation", "url": "http://thehill.com/blogs/blog-briefing-room/241419-nike-backs-trade-deal-ahead-of-obama-visit", "country": "US", "title": "Nike backs trade deal ahead of Obama visit", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Nike backs trade deal ahead of Obama visit", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-08T13:39:00.000+03:00", "replies_count": 0, "uuid": "f90b9c1cf023a311047208e93755e79198d56956"}, "author": "tlejeune@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/241419-nike-backs-trade-deal-ahead-of-obama-visit", "ord_in_thread": 0, "title": "Nike backs trade deal ahead of Obama visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 08, 2015, 06:39 am Nike backs trade deal ahead of Obama visit By Jordan Fabian Getty Images \nNike said a new Pacific trade agreement would allow it to create tens of thousands of jobs in the United States in an announcement coinciding with President Obama's visit to the company's Oregon headquarters Friday to pitch the deal. \nDemocrats and labor unions are irked by the Obama's choice of Nike to push for a fast-track trade bill, given it is a major importer that has faced accusations of lax labor and environmental standards at its Asian manufacturing plants. ADVERTISEMENT But the president plans to use Nike as a backdrop to show how a new trade deal could create jobs in America while reducing the price of consumer goods.\n\"One of the things that we need to do to put people back to work is make sure that we are accessing the markets of the future,\" Obama said at a Democratic fundraiser Thursday night in Portland. \n\"We are concerned if the playing field is not level,\" he added. \"And that’s why we’ve got to have the kinds of enforceable, tough, fair trade deals that are going to make sure that American workers and American businesses aren’t locked out of these markets.\" \nThe president's Oregon trip is part of his push to urge Congress to pass trade promotion authority (TPA), also known as fast-track, an important step in finalizing the 12-nation Trans-Pacific Partnership that is at the top of his second-term agenda. \nThe agreement would lower tariffs on imported footwear. That would allow Nike to create 10,000 manufacturing and engineering jobs in the U.S., it says, along with 40,000 \"indirect supply chain and service jobs\" related to its development of \"new advanced manufacturing methods.\" \nThe president is ramping up his sales pitch on trade to skeptical Democrats, who believe new trade agreements would ship American jobs overseas. \nDemocrats in the House are threatening to sink the TPA bill, which would prevent Congress from amending any trade deals and allow lawmakers only an up-or-down vote. \nCritics of the trade deal expressed surprise that Obama decided to visit Nike to make his pitch due to its reputation as an outsourcer. \n“With less than 1 percent of its more than 1 million production jobs located in the United States, Nike perfectly depicts America’s lost-jobs, low-wage future under the Trans-Pacific Partnership,” Elizabeth Swager, director of the Oregon Fair Trade Campaign, said in a statement. \nNike says it employs 26,000 workers in the U.S., with 8,500 based in Oregon. \n“We believe agreements that encourage free and fair trade allow Nike to do what we do best: innovate, expand our businesses and drive economic growth,” said Mark Parker, president & CEO of Nike. \nRepresentatives from several Oregon small businesses will join the president and the Nike event in order to illustrate the trade deal's benefits for them. \nIn a White House blog post, Tess Darrow, chief executive of Portland printing company Egg Press, international customers \"won't take the risk\" of buying her products under existing rules due to high taxes and customs restrictions. \nOregon is also a symbolic destination for the president's trade push: it is the home state of Sen. Ron Wyden (D), who co-authored an Obama-backed bipartisan TPA bill with Sen. Orrin Hatch (R-Utah). Tags:", "external_links": [], "published": "2015-05-08T13:39:00.000+03:00", "crawled": "2015-05-08T13:54:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}