{"organizations": [], "uuid": "3b02162e5c71a15a5cf37bec556e9aa87aa32d5d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamas.png", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/241707-chicago-selected-for-obama-presidential-library", "country": "", "title": "Chicago selected for Obama presidential library | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Chicago selected for Obama presidential library | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "3b02162e5c71a15a5cf37bec556e9aa87aa32d5d"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/news/241707-chicago-selected-for-obama-presidential-library", "ord_in_thread": 0, "title": "Chicago selected for Obama presidential library | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 12, 2015, 07:16 am Chicago selected for Obama presidential library By Ben Kamisar \nThe foundation overseeing the creation of President Obama’s presidential library announced early Tuesday that it has selected a site on the South Side of Chicago. ADVERTISEMENT \"All the strands of my life came together, and I really became a man, when I moved to Chicago,\" Obama said in an online video alongside first lady Michelle Obama.\n\"That's where I was able to apply that early idealism, to try to work in communities in public service,” the president added. “That's where I met my wife, that's where my children were born.\" \nHe framed the decision as a way to spur growth on the South Side, a diverse part of the city with some neighborhoods battling significant crime and poverty. \n\"With a library and a foundation both on the South Side of Chicago, not only will we be able to encourage and affect change locally, but what we can also do is attract the world to Chicago,\" President Obama said. \nThe site near the University of Chicago beat out three other sites at the University of Hawaii, Columbia University in New York City, and the University of Illinois at Chicago. While those universities didn't win the big prize, the Barack Obama Foundation said in a statement that it will collaborate with all three in the future. \nThe Obamas have deep ties to Chicago, a reason that many considered the city a favorite in the library contest. President Obama worked as a community organizer in the city before he went to the University of Chicago for law school. He later taught law there and represented part of the South Side in the Illinois Senate. \nObama's former chief of staff, Rahm Emmanuel, left the White House to become the city's mayor. He will join Martin Nesbitt, the chairman of the Barack Obama Foundation, to officially announce the decision later Tuesday. \nMichelle Obama was born in Chicago and said in the video that she's \"thrilled to be able to put this resource in the heart of the neighborhood that means the world to me.\" \n\"I consider my self a South Sider,\" she said. \n--This report was updated at 7:33 a.m. Past: 1 day Report: Obama lied about bin Laden... Seymour Hersh accuses Obama of rushing to take credit for the al Qaeda... Michelle Obama speaks of emotional... She discussed facing comments \"rooted in the fears and misperceptions of... DHS secretary: Lone wolf attackers... “We’re very definitely in a new environment,\" Jeh Johnson said. Two years later, IRS probes drag on GOP lawmakers fuming about the status of the IRS investigation. Is Matt Drudge the second most... On TV, in newspapers and on the Internet, you often see the guiding hand... GOP 2016: The top 10 contenders Where the White House hopefuls stand with three months until the first... Karl Rove surrenders to ObamaCare He correctly tells Republicans that their pledge to repeal ObamaCare is a... 'Jade Helm' war game sparks fears... A Pentagon training exercise has sparked conspiracy theories about martial... Immigration debate roils GOP A group of dissident Republicans in the House are clashing with their... Carson: 'Poor people have pride... “There’s real-life experiences and then there’s politics,” he said. Attorney: Spy chief had 'forgotten... “We all make mistakes,” the attorney said of Jim Clapper's controversial... Iran letter divides Democrats Some liberal groups are accusing the holdouts of siding with a “rush to... Obama goes after Warren: ‘She’s... The president said Warren was seeking to bolster her political brand. Sanders: I'm 'most progressive'... “Billionaires should not be able to buy elections,” he said on a Sunday... Brent Budowsky: The ‘Clinton Cash... OPINION | The Clinton Cash con will soon be forgotten, as it should be. Graham: GOP 'getting creamed with... The likely presidential contender said the GOP will lose in 2016 without... Clinton calls for paid family... Clinton also called her own mother her “guiding light.\" Bolton: Terrorists may attack... He said the president is encouraging terrorism and aggression toward the U... Former NYPD commissioner blasts... Howard Safir said Holder spent more time investigating police departments... Santorum: Bomb ISIS 'back to the... The former senator had strong words at the South Carolina Freedom Summit. Transportation chief: ‘We ought to... Anthony Foxx said lawmakers should be ashamed of highway funding patches. Carter cuts short trip over health... The former president was in Guyana ahead of Monday's presidential election. Walker goes strong on foreign... The Wisconsin governor pledged to \"take the fight to\" ISIS and other... ", "external_links": [], "published": "2015-05-12T03:00:00.000+03:00", "crawled": "2015-05-12T14:57:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}