{"organizations": [], "uuid": "2abbabd166d48248c7911333babcf72ba282bf24", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/garland_050415getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/241295-lone-wolf-threat-rises-for-obama", "country": "US", "title": "Lone wolf threat rises for Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Lone wolf threat rises for Obama", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-07T13:00:00.000+03:00", "replies_count": 0, "uuid": "2abbabd166d48248c7911333babcf72ba282bf24"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/241295-lone-wolf-threat-rises-for-obama", "ord_in_thread": 0, "title": "Lone wolf threat rises for Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lone wolf threat rises for Obama By Jordan Fabian - 05/07/15 06:00 AM EDT \nThe threat of lone wolf terrorist attacks is becoming a growing challenge for the Obama administration in the wake of a shooting outside a “Draw Muhammad” event last weekend in Texas. \nRepublicans have used the latest incident to bolster their criticism that President Obama has weakened national security, highlighting an issue the GOP hopes to make a central theme of the 2016 presidential campaign. ADVERTISEMENT Experts on Islamic terrorism say the administration should be concerned about the possibility of future attacks, particularly after the publicity surrounding the Texas shooting that they say represented a significant public relations victory for the Islamic State in Iraq and Syria (ISIS), which claimed credit for the attack.\n“ISIS has figured out it can get … a lot of attention for even a relatively low-level attack,” said Jessica Stern, a lecturer at Harvard University and co-author of ISIS: The State of Terror . \nThat possibility creates a political and policy dilemma for the White House: It knows it will come under fire politically whenever there is a homegrown terrorist attack, but can do little if anything to prevent all of them. \nEven GOP critics of the administration in Congress have acknowledged that homegrown terrorists are difficult to stop. \n“That’s always the problem, we have to be right 100 percent of the time. They only gotta be right once,” said Jim Risch (R-Idaho), a member of the Senate Intelligence Committee, on CNN Tuesday. \nThe White House has sought to show this week that it is always vigilant in defending the homeland, and it has taken steps to respond aggressively to the lone wolf threat. \nThe FBI is stepping up its efforts to arrest U.S.-based ISIS recruits who are being lured to fight for the group via social media. Six men from Minneapolis’s Somali community were arrested last month for allegedly trying to join the group overseas. At least 25 people have been detained since the beginning of the year, according to CNN. \nFederal law enforcement officials routinely use stings and undercover agents to lure would-be terrorists into traps. \nAnd the administration is running pilot programs in three U.S. metropolitan areas — Boston, Los Angeles and Minneapolis-St. Paul — meant to stop terrorism before it starts. \nThe pilot program addresses radicalization at the local level through partnerships between law enforcement, clergy and families. The president requested $15 million for it in his budget proposal. \n“There is a robust response to this,” White House spokesman Josh Earnest said Wednesday. “This is something that this administration is keenly aware of and we are aware of the threat that it poses to the American people.” \nStill, there are signs that the attacks and attempted attacks have undercut confidence in the administration’s war against ISIS. \nJust 4 in 10 Americans approve of Obama’s handling of foreign policy, according to a CBS News/New York Times poll released Tuesday. Sixty-four percent said the U.S. fight against ISIS is going badly. \nRepublicans hope to make political hay with this in 2016, even though Obama is not on the ballot. \nSen. Ted Cruz (R-Texas) said Tuesday the administration knew of the shooters but “failed to connect the dots and prevent this act of terrorism.” \nFormer Arkansas Gov. Mike Huckabee (R) accused the president of having an “unbalanced” security approach that favors X-ray searches of “elderly grandmothers” at airports over catching Islamic terrorists. \nAnd during a speech Monday in Michigan, Wisconsin Gov. Scott Walker (R) said more attacks are inevitable and the Democratic front-runner Hillary Clinton is ill-equipped to address the problem. \n“When another terrorist attempt is made on our soil … I’d rather take the fight to them before they bring the fight to us,” he said. “That’s what’s at stake in the next election. We can continue down that path and have a third term of Barack Obama’s policies and that’s what we’ll get with Hillary Clinton.” \nExperts say the administration could spend more to beef up its ongoing efforts to counter ISIS on social media, but there are risks involved. \n“The government can do more, but it’s so much more credible when it doesn’t come from the government,” said Stern, adding it would be more effective for private citizens and companies to take the lead. \nAnd even when the government knows that a U.S. citizen or resident may have been radicalized, there is no guarantee he or she will be stopped. \nTamerlan Tsarnaev, one of the two brothers accused of carrying out the Boston Marathon, had been paid a visit by the FBI. \nAnd one of the gunmen in Texas, Elton Simpson, had been monitored by federal authorities for years for speaking out about joining extremist groups. \nIt remains unclear what, if any, connections Simpson had to ISIS, though the White House on Wednesday said it did not believe he was part of a broader conspiracy.", "external_links": [], "published": "2015-05-07T13:00:00.000+03:00", "crawled": "2015-05-07T14:16:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}