{"organizations": [], "uuid": "362364d6007982e560e6e6f05565925f617278f2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/getty-2011-12-26-pentagon-2.jpg", "site_section": "http://thehill.com/taxonomy/term/36/feed", "section_title": "The Hill: Floor Action", "url": "http://thehill.com/blogs/floor-action/votes/241514-this-week-defense-abortion-and-trade-top-agenda", "country": "US", "title": "This week: Defense, abortion and trade top agenda", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "This week: Defense, abortion and trade top agenda", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-11T13:00:00.000+03:00", "replies_count": 0, "uuid": "362364d6007982e560e6e6f05565925f617278f2"}, "author": "cmarcos@thehill.com (Cristina Marcos and Jordain Carney)", "url": "http://thehill.com/blogs/floor-action/votes/241514-this-week-defense-abortion-and-trade-top-agenda", "ord_in_thread": 0, "title": "This week: Defense, abortion and trade top agenda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 11, 2015, 06:00 am This week: Defense, abortion and trade top agenda By Cristina Marcos and Jordain Carney Getty Images \nThe House plans to debate immigration, abortion, Iran and renewing the Patriot Act all in one week starting on Tuesday as the Senate takes up trade. \nImmigration will dominate the debate over the National Defense Authorization Act as the House considers whether illegal immigrants should be allowed to enlist in the military — specifically those shielded from deportation by President Obama's Deferred Action for Childhood Arrivals (DACA) program. ADVERTISEMENT The House Armed Services Committee adopted two Democratic amendments during its markup of the bill last month that edge toward allowing immigrants without documentation to serve in the military.\nOne of the controversial provisions would establish a sense of Congress that the Secretary of Defense should review allowing DACA recipients to serve in the military, while the other would direct the Pentagon to evaluate how DACA recipients would affect the pool of recruits and military readiness. ADVERTISEMENT Reps. Mo Brooks (R-Ala.) and Paul Gosar (R-Ariz.) have submitted amendments to eliminate those provisions, warning that they could tank the entire defense authorization bill. A House GOP leadership aide indicated that one or both of the amendments would be allowed floor votes.\nMeanwhile, Rep. Jeff Denham (R-Calif.), a top Democratic target who represents a large Hispanic population, will push for a vote on his proposal that would outright allow illegal immigrants to enlist in exchange for legal status. GOP leaders denied him a vote last year — and appear likely to do so again. \nApart from immigration, the defense authorization will likely also feature debate on authorizing military force in the Middle East. \nIran \nThe House may take up legislation passed by the Senate last week to give Congress a say in any nuclear deal with Iran. \nIt passed the Senate in a 98-1 vote, and is expected to similarly win approval on a bipartisan vote in the House. \nBut conservatives may try to force votes on amendments that could scuttle the carefully negotiated bill. Republican Sens. Tom Cotton (Ark.) and Marco Rubio (Fla.) tried unsuccessfully to get a vote on an amendment that would force Iran to recognize Israeli statehood. \nIn the end, more lawmakers may prefer giving Congress a chance to approve or disapprove the nuclear deal than not having any say at all, even if they think the bill could be improved. \nInternational negotiators announced a framework agreement last month and are working toward a final deal by June 30. \nAbortion \nThe House plans to vote Wednesday on a bill to ban abortions after 20 weeks of pregnancy. The billt was yanked off the floor four months ago due to a GOP intraparty dispute. \nCentrists and many female House Republicans objected to a previous version of the measure that only allowed an exemption for rapes if they had been reported to police. \nThe revamped measure instead requires doctors to ensure that women seeking abortions have received medical treatment or counseling at least 48 hours before an abortion procedure. \nThe vote will be timed to coincide with the two-year anniversary of Kermit Gosnell's conviction on three murder counts for killing infants born alive during abortion procedures. \nTrade \nSenators will take their first test vote Tuesday on \"fast-track\" trade legislation. Senate Majority Leader Mitch McConnell (R-Ky.) wants to end debate on a motion to proceed to the legislation, which would allow Obama to pass trade agreements through Congress with a simple majority vote. \nThe issue is a rare area of agreement for the Kentucky Republican and the Obama administration, but McConnell is facing pushback from some of his own members, including Sen. Jeff Sessions (R-Ala.) who suggested last week that he is wary of the legislation. \nMinority Leader Harry Reid (D-Nev.) has also threatened to block the legislation, which he opposes, until Republicans have a path forward on the highway trust fund and surveillance proposals, both of which expire at the end of the month. \nBut even with a handful of Senate Democrats publicly opposing the trade legislation, it's unclear if he'll be able to gather enough support to make good on his threat. \nPatriot Act renewal \nLegislation to extend parts of the Patriot Act that are set to on expire June 1 is slated for a likely House floor vote on Wednesday. \nThe bill, known as the USA Freedom Act , would effectively end the National Security Agency's (NSA) bulk data collection and extend parts of the Patriot Act through 2019. One of the parts of the law set to expire, known as Section 215, has been used as justification for the NSA's phone records program. \nThe measure would eliminate the federal government's ability to collect Americans' phone records in bulk and instead require specific requests to private companies. \nConsideration of the bill comes a week after a federal court ruled that the NSA's data collection without warrants is illegal. \nBelow is a day-by-day breakdown of the week ahead: \nMonday \nThe House will not be in session. \nThe Senate will convene at 3 p.m., with debate over a resolution on Americans being held in Iran expected to start around 5 p.m. A vote on the resolution is expected around 5:30 p.m. \nTuesday \nThe House will convene at noon for morning hour debate and 2 p.m. for legislative business. Lawmakers will debate a bill requiring the Environmental Protection Agency and Army to withdraw and re-propose draft regulations to clarify the jurisdiction of the Clean Water Act. Noncontroversial bills considered under suspension of the rules will also be slated for votes, which will be postponed until 6:30 p.m. \nThe Senate will likely recess from 12:30-2:15 p.m. for weekly party lunches. An initial procedural vote on the trade legislation is expected at 2:30 p.m. If cloture is invoked on the motion to proceed, senators will have an additional 30 hours of debate unless time is yielded back. \nWednesday \nThe House plans to vote on legislation to ban abortions after 20 weeks of pregnancy to coincide with the Kermit Gosnell anniversary. It may also vote on the USA Freedom Act. \nThe Senate will likely still be on the trade bill. \nThursday \nThe House will likely move to considering the defense authorization bill. \nThe Senate may conduct more votes on the trade measure before leaving Washington for the week. \nFriday \nIf it has not already done so earlier in the week, the House may vote on the bill allowing Congress to review a nuclear deal with Iran. \nThe Senate is not expected to be in session. \n- Julian Hattem contributed.", "external_links": [], "published": "2015-05-11T13:00:00.000+03:00", "crawled": "2015-05-11T16:07:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}