{"organizations": [], "uuid": "07aedbbdcbf7c27c4d567628c0b8e238387abb88", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://mix.chimpfeedr.com/39664-Political-News", "section_title": "Political News", "url": "http://www.foxnews.com/politics/2015/05/21/obama-says-tunisia-to-be-non-nato-ally-us/", "country": "US", "title": "Obama says Tunisia to be non-NATO ally of US", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama says Tunisia to be non-NATO ally of US", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-21T20:47:00.000+03:00", "replies_count": 0, "uuid": "07aedbbdcbf7c27c4d567628c0b8e238387abb88"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/21/obama-says-tunisia-to-be-non-nato-ally-us/", "ord_in_thread": 0, "title": "Obama says Tunisia to be non-NATO ally of US", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama says Tunisia to be non-NATO ally of US Published May 21, 2015 Facebook 0 Twitter 0 Email Print \nPresident Obama on Thursday elevated Tunisia to new allied status, promising financial and security assistance to ensure the North African country's transition to democracy remains a success in a fragile region. \nObama announced in an Oval Office meeting with newly elected Tunisian President Beji Caid Essebsi that he intends to designate his country as a major non-NATO ally of the United States, a special status only a few countries have been granted. \"The United States believes in Tunisia, is invested in its success and will work as a steady partner for years to come,\" Obama said. \nEssebsi said Tunisia is still midway in its reforms and has a long road ahead, with threats coming from terrorists, anti-democracy forces and an unstable regional environment. \"We need the support of the U.S., and maybe the U.S. needs Tunisia now,\" said Essebsi, who was elected in December. \nObama said it's important that the U.S. and Tunisia partner in counterterrorism and try to stabilize Libya, which is divided between two rival governments in turmoil that has enabled the rise of Libya's Islamic State branch. Obama said the goal for Libya is that \"we don't have a failed state, a power vacuum that ends up affecting the situation in Tunisia.\" \nThe Islamic State claimed responsibility for a March terrorist attack at Tunisia's National Bardo Museum that killed 22 people, mostly foreign tourists. \nTunisians ended decades of dictatorship in 2011, overthrowing their longtime ruler, after a poor sidewalk vendor set himself ablaze after police confiscated his merchandise. \nObama hailed Tunisia for inspiring a series of pro-democracy uprisings that became known as the Arab Spring and praised Tunisia's progress since then in incorporating all parties, including women and minorities, in the governing process. \"It bodes well for Tunisia's future and the future of its children,\" he said. \nStatus as a non-NATO ally qualifies a country for certain privileges supporting defense and security cooperation but does not provide any security commitment to that country. Others with the designation include Afghanistan, Argentina, Australia, Bahrain, Egypt, Israel, Japan, Jordan, Kuwait, Morocco, New Zealand, Pakistan, the Philippines, Thailand and Korea. The White House has been discussing expanding the designation to other Arab allies. \nObama this year asked Congress for at least $100 million in assistance to Tunisia, which would bring total support since the 2011 revolution to nearly $700 million. Obama said he would expand economic assistance so ordinary Tunisians can feel the benefits of the change. Advertisement", "external_links": [], "published": "2015-05-21T20:47:00.000+03:00", "crawled": "2015-05-22T00:13:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}