{"organizations": [], "uuid": "53c47576df4e29d2f7507a0178e06bef28400840", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/13/jeb-sides-with-brother-on-invading-iraq-was-ducking-question/", "country": "US", "title": "Gulf leaders gather in Washington to push Obama on Iran", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Gulf leaders gather in Washington to push Obama on Iran", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T19:16:00.000+03:00", "replies_count": 0, "uuid": "a277c6d1c0bbb411985dd87af2951c6c1c14488f"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/13/gulf-leaders-gather-to-push-obama-on-iran/", "ord_in_thread": 0, "title": "Gulf leaders gather in Washington to push Obama on Iran", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gulf leaders gather in Washington to push Obama on Iran Published May 13, 2015 Facebook 0 Twitter 0 Email Print \nGulf nation leaders gathered Wednesday in Washington to warn President Barack Obama of the risks of completing a nuclear deal with Iran. Obama will try to convince them of the potential benefits for the region. \nBut when two days of talks wrap up on Thursday, it's unlikely much will have changed. The Gulf's skepticism of Iran is deep-seated and extends far beyond its nuclear pursuits. Obama, meanwhile, has invested too much in the Iran negotiations to let Gulf concerns upend his legacy-building bid for a deal. \n\"My guess is that the summit is going to leave everybody feeling a little bit unsatisfied,\" said Jon Alterman, the Middle East director at the Center for Strategic and International Studies. \nThe White House is expected to offer the Gulf nations more military assistance, including increased joint exercises and coordination on ballistic missile systems. But Gulf requests for a formal defense treaty already have been denied by the U.S., in part because of the difficulty of getting such an agreement approved by Congress. \nObama met separately Wednesday with Saudi Arabia's Crown Prince Mohammed bin Nayef and Deputy Crown Prince Mohammed bin Salman. The president had planned to meet with Saudi King Salman, but the kingdom abruptly announced over the weekend that the monarch would no longer travel to Washington and would instead send the lower ranking, but highly influential princes. \nThe president made no mention of Saudi skepticism of the Iran talks as he opened the meeting, but acknowledged the region is in the midst of a \"very challenging time.\" \nThe White House and Saudi officials insist the king was not snubbing Obama. But Salman's conspicuous absence comes amid indisputable signs of strain in the long relationship between the U.S. and Saudi Arabia, driven not only by Obama's Iran overtures, but also the rise of Islamic State militants and a lessening U.S. dependency on Saudi oil. \n\"There have been disagreements under this administration and under the previous administration about certain policies and development in the Middle East, but I think on a set of core interests, we continue to have a common view about what we aim to achieve,\" said Ben Rhodes, Obama's deputy national security adviser. \nLater Wednesday, Obama was hosting a White House dinner for the Saudi princes, as well as representatives from Qatar, the United Arab Emirates, Kuwait, Oman and Bahrain. The parties planned to spend Thursday at Camp David, the presidential retreat in Maryland's Catoctin mountains, discussing the nuclear talks and Tehran's reputed support of terrorism in the region. \nThe U.S. and five other nations are trying to reach an agreement with Iran by the end of June to curb its nuclear ambitions in exchange for relief from international economic sanctions. The Gulf nations fear that an influx of cash will only facilitate what they see as Iran's aggression. \nThe White House says a nuclear accord could clear the way for more productive discussions with Iran about its reputed terror links. The U.S. has criticized Iran's support for Hezbollah, as well as terror attacks carried out by Iran's Quds Force. \nIn 2011, the Obama administration accused Iran of plotting to kill the Saudi ambassador to the United States in Washington. \nThe Saudis are also particularly concerned about the situation in Yemen, where Houthi rebels with ties with Iran have ousted the U.S. and Saudi-backed leader. \nFor more than a month, a Saudi-led coalition has tried to push back the Houthis with a relentless bombing campaign. On Tuesday, a five-day humanitarian cease-fire went into effect, though the pause in fighting was already at risk. A jet-fighter from the Saudi coalition struck a military convoy belonging to Shiite rebels and their allies in southern Yemen on Wednesday, \nSaudi officials cited the cease-fire as one of the reasons why King Salman needed to stay in Riyadh and not make the trip to the United States. \nThe Saudi king isn't the only head of state sending a lower level representative to the summit. The heads of the United Arab Emirates and Oman have had health problems and were not making the trip. \nBahrain's royal court announced Wednesday that rather than travel to Washington, King Hamad bin Isa Al Khalifa would be attending a horse show and meet with Queen Elizabeth II. Advertisement", "external_links": [], "published": "2015-05-13T19:16:00.000+03:00", "crawled": "2015-05-14T00:11:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}