{"organizations": [], "uuid": "aaa2dc577e6f5e17bb76c270ab8a37c489c0c507", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_040215getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/blogs/blog-briefing-room/news/240859-obama-touts-education-initiatives", "country": "US", "title": "Obama touts education initiatives", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama touts education initiatives", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-02T13:00:00.000+03:00", "replies_count": 0, "uuid": "aaa2dc577e6f5e17bb76c270ab8a37c489c0c507"}, "author": "esmilowitz@thehill.com (David McCabe)", "url": "http://thehill.com/blogs/blog-briefing-room/news/240859-obama-touts-education-initiatives", "ord_in_thread": 0, "title": "Obama touts education initiatives", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 02, 2015, 06:00 am Obama touts education initiatives Getty Images President Obama touted his plan to provide e-books to students and his proposal to offer free community college to certain students in his weekly address Saturday. The program, announced this week , would provide 10,000 e-books to low-income students. The administration has gotten commitments from several publishers to support the proposal. \"It’s all part of our ConnectED initiative to connect 99 percent of America’s students to high-speed Internet,\" Obama said Saturday. \"Because no matter who you are, where you live, or how much money you’ve got, you should be able to access the world’s knowledge and information just like anyone else.\" ADVERTISEMENT \"In a global economy, we’ve got to help ensure that everyone, of every age, in every zip code — urban and rural — has the chance to learn the skills that lead directly to a good job,\" he said. He also said he will look to give his community college plan a boost when he gives the commencement address at Lake Area Tech in Watertown, S.D. “It’s a community college with a graduation rate that is nearly twice the national average,” he said. “They’re proving that a great education can be within everyone’s reach.” He filmed the weekly address at a library in Washington D.C.’s Anacostia neighborhood, where he announced the e-book initiative. The New York Public Library will create an application for the program, and volunteers will choose titles that will be available. “All of us have a responsibility to not only make sure our own children have pathways to success but that all children do,” he said. “And a great education is the ticket to a better life like never before. Making sure all our kids receive one is the surest way to show them that their lives matter.”", "external_links": [], "published": "2015-05-02T13:00:00.000+03:00", "crawled": "2015-05-02T13:30:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}