{"organizations": [], "uuid": "9556ee86fa8506c52ffb89f12294b026c40d91d7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamatwitter_051815twitter.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/pundits-blog/the-administration/242953-obama-twitter-and-racism", "country": "", "title": "Obama, Twitter and racism | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama, Twitter and racism | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "9556ee86fa8506c52ffb89f12294b026c40d91d7"}, "author": "", "url": "http://thehill.com/blogs/pundits-blog/the-administration/242953-obama-twitter-and-racism", "ord_in_thread": 0, "title": "Obama, Twitter and racism | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 22, 2015, 02:00 pm Obama, Twitter and racism By Brent Budowsky, columnist, The Hill Twitter \nPresident Obama has now moved the presidency into the vanguard of the social media movement by opening a Twitter account, @POTUS , that will be his personal social media sounding board. Great. Social media is exploding around the world. From the president to The Hill, from rock stars to foreign leaders to individual citizens who have something they want to say or want to respond to the ideas of others, social media is transforming the worlds of media and information. ADVERTISEMENT I hope those of you who read this will join millions of others and follow @POTUS, read what the president has to say, and write what you think about it — he just might read your words.\nI think it's terrific that Obama has joined Twitter. It offers a unique opportunity to make known his point of view and follow the dialogue of others from time to time. The president's Twitter initiative is a fantastic opportunity for anyone who wants to play a small but important role interacting with the president. Make the most of it! \nA brief word about the dark side of the Internet and social media. The Friday New York Times reported how there are some — a small minority of Twitter users with small minds — who have taken their racism to Twitter to make bigoted attacks against the nation's first black president. I will not dignify their garbage by repeating their racist insults, but I will say this: Twitter should require, at the least, that those who abuse their free speech rights with racism and political hate should have their real names used when they write these rants of racism. Let their husbands, wives, boyfriends, girlfriends, mothers, fathers, bosses and colleagues at work know exactly who they are and exactly what poisonous thoughts they think. \nFor the overwhelming majority of Twitter users, let's make the most of the president's creative use of Twitter and bring an intelligent and informed discussion, and a meaningful interaction with intelligence and substance between the nation's leader and the people whose nation he leads. \nBravo to the president for opening his Twitter account, and bravo to the men and women who use it to spread the information revolution of social media from the White House to the far corners of the world. \nBudowsky was an aide to former Sen. Lloyd Bentsen (D-Texas) and former Rep. Bill Alexander (D-Ark.), who was then chief deputy majority whip of the House. He holds an LL.M. degree in international financial law from the London School of Economics. Contact him at brentbbi@webtv.net . Tags: ", "external_links": [], "published": "2015-05-22T03:00:00.000+03:00", "crawled": "2015-05-22T21:27:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}