{"organizations": [], "uuid": "8f0377610d4b606030e3e412749bf1c34339b6c6", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/boehnerjohn_051415gn4.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/floor-action/house/242117-house-approves-iran-review-power", "country": "", "title": "House sends Iran review bill to Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "House sends Iran review bill to Obama | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "8f0377610d4b606030e3e412749bf1c34339b6c6"}, "author": "", "url": "http://thehill.com/blogs/floor-action/house/242117-house-approves-iran-review-power", "ord_in_thread": 0, "title": "House sends Iran review bill to Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 14, 2015, 04:12 pm House sends Iran review bill to Obama Greg Nash \nThe House on Thursday passed legislation requiring congressional review of a nuclear deal with Iran, handing a victory to critics of the talks who demanded that Congress have an oversight role. \nPassage came easily on a vote of 400-25. Only six Democrats and 19 Republicans opposed the measure. ADVERTISEMENT The carefully negotiated bill, which President Obama is expected to sign, gives Congress the power to approve or disapprove of a nuclear agreement with Iran during a 30-day period when economic sanctions could not be lifted.\nShould the House and Senate vote to disapprove of the deal, and then override a likely Obama veto, the administration would be barred from waiving some economic sanctions on Iran as part of international accord. \nThe Senate passed the bill overwhelmingly last week in a 98-1 vote. \nInternational negotiators reached a framework agreement with Iran last month, and are working to finish a final deal by June 30. The deal is expected to lift economic sanctions in exchange for limits on Iran’s nuclear program and a new regime of international inspections. \nFor months, the White House had stood firm against the effort in Congress to weigh in on the Iran deal, warning that the proposals threatened to upend the talks. \nBut with Democratic support for the Iran review bill growing, the administration reversed course, accepting a compromise from Senate Foreign Relations Committee Chairman Bob Corker (R-Tenn.) and the panel's top Democrat, Sen. Ben Cardin (D-Md.), that omitted provisions most opposed by the White House. \nHouse Foreign Affairs Committee Chairman Ed Royce (R-Calif.) argued the measure gives Congress more leverage over the Obama administration in the talks. \n\"Once this legislation is signed, when Secretary Kerry sits across from the Iranians, he'll now have on his mind, 'I've got to take this to Congress.' That prospect can only improve these negotiations. And I just hope it's not too late and we aren't too deep into a bad deal,\" Royce said. \nHouse GOP leaders moved the bill to the floor under a fast-track procedure typically reserved for noncontroversial legislation. The maneuver prohibits amendments and requires a two-thirds majority for passage. \nMembers of the conservative House Freedom Caucus had urged votes on amendments such as requiring Iran to recognize Israel's right to exist as part of a final deal. \nLawmakers of both parties may have found that amendment proposal politically difficult to oppose, even if it potentially strained the ongoing negotiations with Iran. \nSome conservatives bristled at the lack of amendments to the bill, which they think doesn't go far enough to rein in the administration. \n\"It is unconscionable for Congress to grant such sweeping power to President Obama, allowing him to lift sanctions on Iran, no matter the cost to our national security, the security of Israel, and the entire world. But even worse, the House is willing to do this today without having even one hearing, one amendment, a grand total of 40 minutes of debate,\" said Rep. Mike Pompeo (R-Kan.). \nInstead, GOP leadership scheduled a vote alongside the Iran bill on legislation to impose sanctions on Hezbollah. That measure passed 423-0. \nThe House passed a similar Hezbollah sanctions bill last year by a vote of 404-0, but the Senate did not act on it. \nSenate Majority Leader Mitch McConnell (R-Ky.) chose to move the painstakingly negotiated bill forward with only a few chances for amendment on the floor. Sens. Marco Rubio (R-Fla.) and Tom Cotton (R-Ark.) tried to force a vote on an amendment requiring Iran to recognize Israel, but were denied after McConnell moved to cut off debate. \n“If we didn’t face the threats of filibusters, or the blocking of amendments, or the specter of presidential vetoes, this bill would be a heck of a lot stronger. I assure you,\" McConnell said last week. “But the truth is, we do. That’s the frustrating reality.” \nThe Obama administration has indicated the president will sign the bill into law as long as it wasn't amended from the original deal struck with Corker and Cardin. \nSome liberal Democrats like Rep. Keith Ellison (D-Minn.) warned that the legislation signals to other countries that the U.S. is \"operating in less than good faith.\" \n\"I believe Congress must have oversight. But I don't believe we should make this deal stillborn in the crib before it's even allowed to emerge. We don't want to abort the deal before it's born,\" Ellison said. ", "external_links": [], "published": "2015-05-15T03:00:00.000+03:00", "crawled": "2015-05-15T15:44:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}