{"organizations": [], "uuid": "50ebc737281c823c8f7212c3e8303d6a350125e0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/25397/feed", "section_title": "Overnight Defense", "url": "http://thehill.com/policy/defense/overnights/242902-overnight-defense-obama-were-not-losing-to-isis", "country": "US", "title": "OVERNIGHT DEFENSE: Obama: We're not losing to ISIS", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT DEFENSE: Obama: We're not losing to ISIS", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-22T01:22:00.000+03:00", "replies_count": 0, "uuid": "50ebc737281c823c8f7212c3e8303d6a350125e0"}, "author": "mmali@thehill.com (Martin Matishak and Kristina Wong)", "url": "http://thehill.com/policy/defense/overnights/242902-overnight-defense-obama-were-not-losing-to-isis", "ord_in_thread": 0, "title": "OVERNIGHT DEFENSE: Obama: We're not losing to ISIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT DEFENSE: Obama: We're not losing to ISIS By Martin Matishak and Kristina Wong - 05/21/15 06:22 PM EDT \nTHE TOPLINE: President Obama said the U.S. is not losing the war   (ISIS), even though the group took control of two major Middle East cities this week, reports The Hill's Jordan Fabian. \n\"No, I don't think we're losing,\" Obama said in an interview with The Atlantic's Jeffrey Goldberg. \"There's no doubt there was a tactical setback.\" \nThe interview on Tuesday came two days after ISIS fighters drove Iraqi troops out of Ramadi. \nThe president's strategy in fighting ISIS has come under heavy scrutiny since the city's fall. Critics say the strategy of airstrikes and training for Iraqi troops is not enough to defeat the group. \nThe White House, though, says it is not changing its strategy, but will help Baghdad step up training of Sunni militias to launch a counteroffensive. \nThe president rejected calls from Republican lawmakers, including Sens. John McCain (R-Ariz.) and Lindsey Graham (R-S.C.), who want U.S. ground troops to help fight ISIS in Iraq. \n\"I know that there are some in Republican quarters who have suggested that I've over-learned the mistake of Iraq, and that, in fact, just because the 2003 invasion did not go well doesn't argue that we shouldn't go back in,\" he said. \n\"And one lesson that I think is important to draw from what happened is that if the Iraqis themselves are not willing or capable to arrive at the political accommodations necessary to govern, if they are not willing to fight for the security of their country, we cannot do that for them.\" \nIn the meantime, the Pentagon announced it is sending 2,000 anti-tank weapons to Iraq, which will arrive as early as next week. \nIt is also flowing in ammunition and other equipment to counter ISIS's increasing reliance on vehicle-borne bombs. \nIn the last 30 days, the U.S. has helped to deliver coalition donations of 22 million rounds of small arms ammunition and 12,000 mortar rounds to the Iraqi army. \nIt has also delivered 250 mine-resistant, ambush-protected (MRAP) vehicles, 50 of them with mine rollers; 2,000 Hellfire missiles; 20,000 M-16s; 10,000 sets of body armor and helmets; and millions of rounds of ammunition, including small arms, tank artillery and anti-tank weapons. \n\nPELOSI CALLS FOR AUMF: Congress should act immediately and take up President Obama's request for the use of force against, House Minority Leader Nancy Pelosi (D-Calif.) said Thursday. \n\"The ball is definitely in our court to take up this issue,\" Pelosi said during a press briefing in the Capitol, The Hill's Mike Lillis reported. \nThe remarks were a rebuke to Speaker John Boehner (R-Ohio), who has panned Obama's war powers request as \"irresponsible.\" Boehner urged the president to \"start over\" with a new proposal earlier this week. \nPelosi said Republicans are simply passing blame for Congress's inaction on the issue. \"The White House put a very clear authorization on the table for us to act upon, for Congress to work its will,\" she said. \nUnveiled in February, Obama's resolution, known as an authorization for use of military force (AUMF), is designed to set the terms of the administration's fight   (ISIS). \nThe Republican critics contend the measure is too restrictive and Democratic opponents maintain it's too broad. \nPelosi suggested those setbacks should light a new fire under Congress to take up the AUMF in search of a better strategy for combating ISIS. \n\"How could it be that all of this is happening and Congress has refused to have this conversation on the floor of the House?,\" she asked. \n\nELEVENTH HOUR DEAL ON VA HOSPITAL. House lawmakers reached a short-term deal that will allow the construction of a delay-plagued Veterans Affairs hospital outside of Denver to continue. \nThe project, which began more than a decade ago and was recently estimated to cost five times its original price tag, would have run out of money Sunday if lawmakers had not moved to lift its $800 million spending ceiling. \nThe three-week extension, introduced by Rep. Mike Coffman (R-Colo.) and passed by unanimous consent, raises the $800 million authorization cap for the 184-bed replacement facility in Aurora, Colo., to $900 million. \nThe deal also codifies into law a change to last year's $16 billion VA overhaul bill that allowed patients to receive private healthcare if they are unable to schedule an appointment at an agency clinic within 40 miles of their home within 30 days. \nPreviously, the 40-mile distance was calculated by a straight line, or \"as the crow flies.\" Under Thursday's agreement, the 40-mile limit will be defined by driving distance, a switch the VA endorsed last month. \n\nLAWMAKERS CLASH OVER REFUGEE PLANS: House and Senate lawmakers disagreed over the utility of an Obama administration effort to resettle Syrian refuges inside the U.S. \n\"We have no way... to know who these people are and so I think bringing them in is a serious mistake,\" House Homeland Security Committee Chairman Michael McCaul (R-Texas) said during a Christian Science Monitor breakfast. \nMcCaul said the U.S. has \"no intelligence footprint or capability\" inside Syria to ensure refugees mean no harm. \n\"We don't have databases on these individuals so we can't properly vet them,\" he added, \"to know where they came from, to know what threat they pose, because we don't have the data to cross-reference them with.\" \nMeanwhile, a group of 14 Senate Democrats called on the president to let 6,000 refugees into the country, calling the 700 that have been admitted so far \"an unacceptably low number.\" \nSenators said \"it is a moral, legal, and national security imperative for the United States to lead by example in addressing the world's worst refugee crisis of our time by greatly increasing the number of Syrian refugees who are resettled in our country.\" \n\n  GOP lawmaker takes Benghazi fight to House floor \n- Senators urge DOD to update policies for gay service members \n- Senate panel votes to end VA ban on medical marijuana \n- Senators condemn China's construction on disputed islands \n- Senate scrambles to save Patriot Act \n\nFollow us on Twitter: @thehill , @kristina_wong , @martinmatishak", "external_links": [], "published": "2015-05-22T01:22:00.000+03:00", "crawled": "2015-05-22T15:48:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}