{"organizations": [], "uuid": "8f2f9e28303626755473a39a079f2b3358ed988c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/29764/feed", "section_title": "The Hill: Cybersecurity", "url": "http://thehill.com/policy/cybersecurity/241648-gulf-leaders-seek-cyber-assurances-from-obama", "country": "US", "title": "Gulf leaders want cyber assurances from Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Gulf leaders want cyber assurances from Obama", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-11T22:56:00.000+03:00", "replies_count": 0, "uuid": "8f2f9e28303626755473a39a079f2b3358ed988c"}, "author": "cbennett@thehill.com (Cory Bennett)", "url": "http://thehill.com/policy/cybersecurity/241648-gulf-leaders-seek-cyber-assurances-from-obama", "ord_in_thread": 0, "title": "Gulf leaders want cyber assurances from Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gulf leaders want cyber assurances from Obama By Cory Bennett - 05/11/15 03:56 PM EDT \nGulf nation leaders plan to push President Obama for better cybersecurity cooperation during a Thursday summit at Camp David. The request is part of a broader security guarantee U.S. Gulf allies are seeking as they warily eye the rise of extremist threats in the region and the near-complete nuclear talks with Iran that would lift sanctions on the country. ADVERTISEMENT Leaders and delegates from the Gulf Cooperation Council — which includes Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, and the United Arab Emirates — are scheduled to visit the White House on Wednesday before a summit Thursday at presidential retreat Camp David. There, they will discuss a formal arrangement with the U.S. about cooperating on defensive efforts, officials said over the weekend. “In the past, we have survived with a gentleman's agreement with the United States about security,” Yousef Al Qtaiba, the United Arab Emirates' ambassador to the U.S., told the Associated Press. “I think today, we need something in writing. We need something institutionalized.” Cybersecurity will likely be part of that written agreement, said Saudi Foreign Minister Adel al-Jubeir through an interpreter during a Friday press conference with Secretary of State John Kerry. “I expect in the coming period there will be further strengthening and enhancement of these efforts so that … joint action will be more effective and more expansive in all areas, whether it relates to cybersecurity or defense against ballistic missiles or training — military training or equipping,” al-Jubeir said. Cyber pacts between countries often include pledges to exchange data on hackers, cooperate on law enforcement investigations and swap technology. The White House unveiled such a deal with Japan in late April, with an eye toward the curbing China's dominant cyber espionage program. Gulf countries are seeking similar commitments from the U.S. because of the rapid growth of digital dangers in the Middle East. Some cyber military experts expect economic sanctions relief on Iran to jumpstart the country's cyber program. “It will open up many opportunities for Iran to acquire new technology, new education and training, new methods,” Jeff Bardin, chief intelligence officer at cyber data firm Treadstone 71, told The Hill. “I think it will actually speed their adoption of cyber operations, cyber warfare activities.” And cyber experts believe Tehran would likely to use its heightened destructive cyber prowess on its Middle Eastern neighbors, not the U.S. The country has already shown a willingness to launch destructive attacks within the region. It’s widely believed Iran was behind the mammoth destructive attack in 2012 on Saudi oil giant Aramco, the world’s most valuable company. The digital assault wiped or damaged over 30,000 computers. Then-Defense Secretary Leon Panetta called it a “significant escalation of the cyber threat.” Islamist extremists throughout the region have also taken to cyberspace. A hacking group calling itself the Cyber Caliphate and claiming affiliation with the Islamic State of Iraq and Syria (ISIS) made headlines by launching a series of worldwide cyberattacks on media outlets, foreign government websites, and the U.S. Central Command’s Twitter account. Most recently, it was revealed one of the gunmen killed in the attempted attack on the Garland, Texas, contest to draw the Prophet Muhammad was a noted hacker who allegedly donated to the Cyber Caliphate. National Security Agency Director Adm. Michael Rogers on Monday identified ISIS' digital potential as one of the major cyber threats on the horizon. “At what point do they decide they need to move from viewing the Internet as a source of recruitment, as a way to spread ideology, as a way to spread their message and their propaganda?” he said during remarks at George Washington University. The next step, Rogers added, would be “viewing it as a potential weapon system.” “That’s a great concern and something we pay lots of attention to,” he said. Gulf officials are paying attention, too. They hope meetings this week will create tools to mitigate the rising digital menace. Al-Jubeir, the Saudi foreign minister, called any official security pact between the Gulf nations and the U.S. “further progress in issues that we are already working on.\" \"It’s natural for them to be enhanced and intensified between friendly countries,\" he added.", "external_links": [], "published": "2015-05-11T22:56:00.000+03:00", "crawled": "2015-05-12T00:18:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}