{"organizations": [], "uuid": "84dbf0c8fa4cb5deb11e072297af0eeb7f400c50", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/royalbaby_050215getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=33", "section_title": "TheHill - Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/240870-obamas-welcome-royal-baby", "country": "US", "title": "Obamas welcome royal baby", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obamas welcome royal baby", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-02T21:20:00.000+03:00", "replies_count": 0, "uuid": "84dbf0c8fa4cb5deb11e072297af0eeb7f400c50"}, "author": "Bernie Becker", "url": "http://thehill.com/blogs/blog-briefing-room/news/240870-obamas-welcome-royal-baby", "ord_in_thread": 0, "title": "Obamas welcome royal baby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 02, 2015, 02:20 pm Obamas welcome royal baby Getty Images \nThe Obamas gave a hearty welcome to the newest member of the British royal family on Saturday. \n“Michelle and I are delighted to congratulate the Duke and Duchess of Cambridge, her Majesty the Queen and the Royal Family, and all the people of the United Kingdom on the birth of the Royal Princess,” President Obama said in a statement. ADVERTISEMENT “On behalf of the American people, we wish the Duke and Duchess and their son George much joy and happiness on the occasion of the arrival of the newest member of their family.”\nKate Middleton, Britain’s Duchess of Cambridge, gave birth to a baby girl on Saturday — her second child with Prince William. The daughter, yet to be named, joins the royal couple’s son, George. \nThe birth of the second royal child has gotten plenty of attention on social media and cable news networks. Tags: Past: 1 day Socialist to snap at Clinton’s... Sanders could put a stamp on the next White House, even if he never sits... GOP prepares list of demands if... A Supreme Court ruling against the law would give Republicans new leverage. Six Baltimore officers charged;... All of the officers involved in the arrest will be charged. Police union pushes back on... \"None of the officers involved are responsible for the death of Mr. Gray.\" Sanders makes Rubio-sized waves on... He may face tough odds for the White House, but Sanders strikes a nerve on... Sanders raises $1.5M in one day Sen. Bernie Sanders raised (I-Vt.) more than $1.5 million in donations... Conservative senators sandbag... Sens. Cotton and Rubio are offering an amendment that could kill the Iran... Attorney asks: Where is Aaron... The attorney handling a lawsuit against former Rep. Aaron Schock is unable... Charged Baltimore officers post... The six officers' booking photos were released by Baltimore Police. Child found misplaced Capitol... One gun was left in a Capitol Hill bathroom stall. Insurers ignore ObamaCare birth... Some companies are still charging women out-of-pocket costs for birth... Report: Freddie Gray broke neck... A preliminary medical examination found that Freddie Gray suffered his... House votes to overturn DC's... Passage of the resolution to disapprove of Washington's local law fell... FLOTUS's post-WH plans First lady Michelle Obama has plans after her time in the White House is... House passes budget in win for GOP It's the first joint GOP budget to pass the House in roughly a decade. Michael Moore: Disarm the police Moore also says all blacks jailed on drug sentences should be released.", "external_links": [], "published": "2015-05-02T21:20:00.000+03:00", "crawled": "2015-05-02T22:00:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}