{"organizations": [], "uuid": "690327b2402916db7f6cf2217497c079d6e10e03", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/jason-salzman/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/denver/blog.xml", "section_title": "Denver Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/jason-salzman/coffman-wants-rape-victim_b_7283908.html", "country": "US", "title": "Coffman Wants Rape Victim to Get Police Permission to Get an Abortion | Jason Salzman", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Coffman Wants Rape Victim to Get Police Permission to Get an Abortion | Jason Salzman", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-14T19:29:00.000+03:00", "replies_count": 0, "uuid": "690327b2402916db7f6cf2217497c079d6e10e03"}, "author": "Jason Salzman", "url": "http://www.huffingtonpost.com/jason-salzman/coffman-wants-rape-victim_b_7283908.html", "ord_in_thread": 0, "title": "Coffman Wants Rape Victim to Get Police Permission to Get an Abortion | Jason Salzman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Abortion continues to be a major focus of Republicans in Washington DC , as they voted Wednesday for a ban on abortion starting at week twenty of a pregnancy.\nFew exceptions were included in the bill, and obstacles were put in place even for rape and incest victims who seek to end their pregnancies. For example, before having an abortion, a raped woman would have to report the crime to an \"appropriate law enforcement agency.\"\nIt would not be enough for a woman to tell her doctor she was raped. She's mandated to tell police, even if she doesn't want to, for whatever reason.\nColorado Congressman Mike Coffman's vote in favor the measure should be of interest to reporters. For most of his political career, Coffman took a hard-line position against any rape-or-incest exception to his anti-abortion stance . He was vocal on the topic.\nBut facing a tough re-election campaign in 2013, Coffman issued a statement that he favored exceptions for rape and incest . But he's never explained why his position changed.\nWhy the evolution from someone who was fiercely opposed to abortion, even for rape and incest , to someone who favors exceptions? The makeup of his new district? A personal story?\nWhy is the requirement that a woman must obtain permission to have an abortion from a law-enforcement agency enough for Coffman?\nJust as House Republicans in Washington are again focusing on abortion, the left-leaning People for the American Way has released a new report, \" The Personhood Movement: Where It Comes From and What it Means for the Future of Choice ,\" which explains the strategic thinking of the different factions of the anti-choice movement.\nWe saw these factions fighting each other in Washington this week over whether the 20-week abortion ban should include any exceptions for rape or incest victims. They compromised by allowing a raped woman to have an abortion -- if the rape is properly reported to authorities. But for some anti-choice advocates, this was not enough. No abortion, under any circumstances, should be allowed.\nThe report offers a broad overview of the politics and policy of personhood, focusing on the current disputes among personhood leaders over where to take the movement going forward. And it explains why some anti-choice leaders oppose state personhood amendments, even though they share the common goal of outlawing abortion.\nThe report points out that personhood leaders denounce anti-choice allies, like Coffman, when they support exceptions for rape and incest, even when done in an obvious effort to make themselves or their anti-abortion legislation more palatable to the public. The report states:\n\"But the greatest betrayal in the eyes of these personhood advocates is the willingness of major anti-choice groups to endorse legislation that includes exceptions for pregnancies resulting from rape and incest. The personhood movement's leaders contend that these political concessions are not only immoral and intellectually inconsistent, but also threaten to undermine the movement's goals in the long term.\"\nWe've seen this play out in Colorado, as personhood leaders have turned against Republicans like Coffman, once a close ally .\nAnd you wonder, how does Coffman feel about it? Does he have residual guilt about changing his views? What made him shift from being a complete moral absolutist to mostly a moral absolutist on abortion? What's Coffman's story?\nFollow Jason Salzman on Twitter: www.twitter.com/BigMediaBlog\nMore: Mike Coffman Media Personhood 20 Week Abortion Ban Pain Capable Unborn Child Protection Act Rape Incest Abortion People for the American Way", "external_links": [], "published": "2015-05-14T19:29:00.000+03:00", "crawled": "2015-05-14T20:31:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}