{"organizations": [], "uuid": "391e3bc56246a3294ae95fc284890300a94a1d43", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/warrenelizabeth_032515gn.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/241887-white-house-expects-apology-from-democratic-senator-who", "country": "US", "title": "White House expects apology from Dem who suggested Obama was sexist", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "White House expects apology from Dem who suggested Obama was sexist", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T16:55:00.000+03:00", "replies_count": 0, "uuid": "391e3bc56246a3294ae95fc284890300a94a1d43"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/241887-white-house-expects-apology-from-democratic-senator-who", "ord_in_thread": 0, "title": "White House expects apology from Dem who suggested Obama was sexist", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 13, 2015, 09:55 am White House expects apology from Dem who suggested Obama was sexist By Jordan Fabian \nThe White House on Wednesday said it expects Sen. Sherrod Brown to apologize for calling President Obama’s criticism of Sen. Elizabeth Warren sexist. \nWhite House press secretary Josh Earnest called Brown (D-Ohio) a “stand-up guy” who has worked well with the president in the past. ADVERTISEMENT “I’m confident after he has gotten a chance to take a look at the comments he made yesterday that he’ll find a way to apologize,” Earnest said on MSNBC’s “Morning Joe.”\nBrown is a chief critic of Obama’s trade agenda, and on Tuesday, he said the president disrespected Warren (D-Mass.), another leading anti-trade Democrat, when he responded to her comments on the issue. \nThe Ohio senator ripped Obama for calling Warren by her first name. \n“A number of those phrases he used, I assume he wished he hadn’t said them because he shouldn’t have said them,\" Brown told reporters. “I’m not going to get into more details. I think referring to her as first name, when he might not have done that for a male senator, perhaps? I’ve said enough.” \nBrown’s criticism was echoed by the National Organization for Women. \nEarnest said Obama frequently refers to his former Senate colleagues by their first names and was not singling Warren out because of her gender. \n“The president has a personal relationship with Sen. Warren. It’s not surprising he would call her by her first name in the same way he calls other senators by their first name,” he said. \n“We can have a disagreement on substantive issues, but the fact is, we agree on most of them, that President Obama and Sen. Warren and other Democrats in the United States Senate have worked together on a variety of issues that are critically important to middle-class families,” he added. \nEarnest refrained from criticizing Brown and noted the Ohio senator worked with the White House to confirm Janet Yellen as the first female head of the Federal Reserve. \n“As someone who gets paid to talk in public for a living, I try to be mindful of being slow to criticize people who say things in public so inconsistent with their reputation and with their character,” the spokesman said. Tags:", "external_links": [], "published": "2015-05-13T16:55:00.000+03:00", "crawled": "2015-05-13T20:24:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}