{"organizations": [], "uuid": "1dfae814eaea34ffe63fc33e024f42b35c185d1e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/marijuana_getty.jpg", "site_section": "http://thehill.com/taxonomy/term/33/feed", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/blogs/floor-action/house/240731-house-rejects-allowing-va-doctors-to-recommend-medical-marijuana", "country": "US", "title": "House rejects allowing VA doctors to recommend medical marijuana", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House rejects allowing VA doctors to recommend medical marijuana", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T01:47:00.000+03:00", "replies_count": 0, "uuid": "1dfae814eaea34ffe63fc33e024f42b35c185d1e"}, "author": "cmarcos@thehill.com (Cristina Marcos)", "url": "http://thehill.com/blogs/floor-action/house/240731-house-rejects-allowing-va-doctors-to-recommend-medical-marijuana", "ord_in_thread": 0, "title": "House rejects allowing VA doctors to recommend medical marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "April 30, 2015, 06:47 pm House rejects proposal to let VA doctors recommend medical marijuana By Cristina Marcos \nThe House rejected a proposal Thursday to allow doctors at Department of Veterans Affairs hospitals to discuss the use of medical marijuana with patients. \nRep. Earl Blumenauer's (D-Ore.) amendment to the first fiscal 2016 appropriations bill of the year, which funds the VA and military construction projects, failed narrowly by a vote of 210-213. \nMore than 30 Republicans voted in favor of the amendment. Boos ensued from the Democratic side of the House chamber when Republicans closed the vote despite the razor-thin margin. ADVERTISEMENT Medical marijuana is legal in more than 30 states and the District of Columbia. But VA doctors are prohibited from completing patient forms seeking recommendations or opinions regarding medical marijuana to treat conditions like Post-Traumatic Stress Disorder (PTSD). \nA 2012 VA report found nearly 30 percent of veterans who served in Iraq and Afghanistan suffer from PTSD or depression. \nLawmakers from both parties argued veterans should at least be able to receive recommendations from their doctors about the drug's merits. They stressed the amendment wouldn't force doctors to recommend medical marijuana or authorize marijuana possession at VA facilities. \n\"Let's lift the gag order. We owe it to our veterans to give them complete information when they ask for it, even if the means discussing medical marijuana,\" said Rep. Sam Farr (D-Calif.). \nRep. Dana Rohrabacher (R-Calif.) said fellow Republicans should support allowing free discussion about medical marijuana between veterans and their doctors. \n\"As Republicans, we supposedly believe in the doctor-patient relationship. But apparently some of my colleagues believe that relationship is not relevant when it comes to VA doctors and their patients,\" Rohrabacher said during floor debate. \n\"It is criminal that we send our men and women off to war where their minds and bodies are broken and then deny them the ability to obtain a recommendation from a legitimate VA doctor upon their return home,\" Rohrabacher added. \nBut other Republicans warned that a drug that remains illegal in many states shouldn't be prescribed for veterans with psychological problems. \n\"Why in the world would we give a drug that is addictive, that is prohibited under schedule I, that is not accepted for any specific mental disease or disorder and enhances psychosis and schizophrenia, why are we going to give that to our veterans, especially those with PTSD? That is just absolutely insane,\" said Rep. John Fleming (R-La.), a physician. \nBlumenauer offered the same amendment to the Military Construction-Veterans' Affairs appropriations bill last year. It was also defeated by a vote of 195-222 — a much wider margin than Thursday. Tags:", "external_links": [], "published": "2015-05-01T01:47:00.000+03:00", "crawled": "2015-05-01T02:00:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}