{"organizations": [], "uuid": "795e7028bb2268c1061e9dc3d7fc79560a30dc1e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/denver/blog.xml", "section_title": "Denver Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/wade-norris/president-obama-dont-fail_b_7252530.html?utm_hp_ref=denver&ir=Denver", "country": "US", "title": "President Obama Don't Fail Us Historically...", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "President Obama Don't Fail Us Historically...", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-12T22:49:00.000+03:00", "replies_count": 0, "uuid": "795e7028bb2268c1061e9dc3d7fc79560a30dc1e"}, "author": "Wade Norris", "url": "http://www.huffingtonpost.com/wade-norris/president-obama-dont-fail_b_7252530.html?utm_hp_ref=denver&ir=Denver", "ord_in_thread": 0, "title": "President Obama Don't Fail Us Historically...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nA little history lesson today. \nIn the summer of 2007, Democrats were lining up behind their preferred Presidential choice. I was a strong Edwards supporter, (and eventual Obama supporter) and was most wary of Hillary Clinton bringing on more NAFTA type trade agreements. \nIronically even before the next President takes office, we are already having the same discussions on the TPP. \nBack then, I sat down then with Edwards Campaign Manager former House Whip David Bonior of Michigan. He takes us back to 1993 when newly elected and popular President Bill Clinton abandoned Healthcare and began, instead, pushing NAFTA. \nWatch this interview and read the transcript and then just replace the words \"NAFTA\" with \"Trans Pacific Partnership\" or \"TPP\" and \"Clinton\" with \"Obama\" President Obama, we can't afford for you to forget such recent history of a 'good' Democrat pushing terrible trade policies. \nPart 1 3:03 in the interview - Majority Whip David Bonior the President and NAFTA \nQuestion - What was the atmosphere like, being a democrat, taking on a Democratic President? \nIt is very difficult to take on the President of your own party. When he made the decision to do the North American Free Trade Agreement - NAFTA as opposed to healthcare, it was the worst legislation of his (Clinton) presidency , worst piece of legislature in the history of our country. 17 years (of NAFTA) it has been a widening of the income gap, not only in the United States, but in Canada and Mexico, millions and millions of lost jobs, a devastation of the environment with no environmental protections, no labor protections. It has been a race to the bottom, it has been devastating. \noriginal diary from from Sept. 8,2007 \nConsider that phrase from a member of Clinton's own party: \nNAFTA was the worst legislation of his (Clinton) presidency, worst piece of legislature in the history of our country. \nI believe the TPP will become the new 'worst piece of legislature in the history of our country' NAFTA did not just hurt the United States, it increased the trading power for Mexican Drug Cartels, crushed Mexican Corn farmers with US corn subsidies , which ACTUALLY INCREASED the need for Mexican and Central Americans to cross the border to find work. \nNAFTA, by permitting heavily-subsidized US corn and other agri-business products to compete with small Mexican farmers, has driven the Mexican farmer off the land due to low-priced imports of US corn and other agricultural products. Some 2 million Mexicans have been forced out of agriculture, and many of those that remain are living in desperate poverty. These people are among those that cross the border to feed their families . (Meanwhile, corn-based tortilla prices climbed by 50%. No wonder many so Mexican peasants have called NAFTA their 'death warrant.' NAFTA's service-sector rules allowed big firms like Wal-Mart to enter the Mexican market and, selling low-priced goods made by ultra-cheap labor in China, to displace locally-based shoe, toy, and candy firms. An estimated 28,000 small and medium-sized Mexican businesses have been eliminated. Wages along the Mexican border have actually been driven down by about 25% since NAFTA, reported a Carnegie Endowment study. An over-supply of workers, combined with the crushing of union organizing drives as government policy, has resulted in sweatshop pay running sweatshops along the border where wages typically run 60 cents to $1 an hour. \nNow imagine that these conditions, known as 'NAFTA on Steroids' are not just over borders, but the Pacific Ocean, where it is impossible to escape to another country. \nBut history is not set yet. Bernie Sanders, Elizabeth Warren and others are standing up on this Deal. \nIt is very difficult to take on the president of your own party. \nWe can't simply be moving forward to the end of Obama's Presidency as if he is a student who made honor roll all year, so we let him slide on the final exam. This is Obama's final exam for history. \nThe TPP , if he pushes it through, against the wishes of many in his own party, it will be a terrible legacy for us in terms of Jobs, wages, and most importantly the Environment. \nConsider this : \n\" If the environment chapter is finalized as written in this leaked document, President Obama's environmental trade record would be worse than George W. Bush's ,\" said Michael Brune, executive director of the Sierra Club. \"This draft chapter falls flat on every single one of our issues - oceans, fish, wildlife, and forest protections - and in fact, rolls back on the progress made in past free trade pacts.\" \nTell the President \"don't fail us HISTORICALLY \" \nFollow Wade Norris on Twitter: www.twitter.com/wadenorris More:", "external_links": [], "published": "2015-05-12T22:49:00.000+03:00", "crawled": "2015-05-12T23:31:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}