{"organizations": [], "uuid": "b2a6a430f0f84fb4900e9adc6895788e978b68c9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/special_reports/use.arlingtoncemetery.jpg", "site_section": "http://thehill.com/rss/syndicator/19111", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/242994-obama-commemorates-troops-who-lost-their-lives", "country": "US", "title": "Obama commemorates troops lost in line of duty", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama commemorates troops lost in line of duty", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-23T13:00:00.000+03:00", "replies_count": 0, "uuid": "b2a6a430f0f84fb4900e9adc6895788e978b68c9"}, "author": "Elliot Smilowitz", "url": "http://thehill.com/homenews/administration/242994-obama-commemorates-troops-who-lost-their-lives", "ord_in_thread": 0, "title": "Obama commemorates troops lost in line of duty", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama commemorates troops lost in line of duty Getty Images By Elliot Smilowitz - 05/23/15 06:00 AM EDT President Obama on Saturday used his weekly address to commemorate Memorial Day, calling this year’s holiday “especially meaningful” because it is the first since the end of major combat operations in Afghanistan. Obama said he plans to visit Arlington National Cemetery on Monday to stand alongside military families and remember American troops who lost their lives during the nation’s longest war. He shared the stories of the last two U.S. troops to die in combat operations in Afghanistan: Army Specialist Wyatt Martin, an Arizona native, and Sergeant First Class Ramon Morris, a Jamaican immigrant who lived in Queens. ADVERTISEMENT “Like generations of heroes before them, these Americans gave everything they had — not for glory, not even for gratitude, but for something greater than themselves,” Obama said. “We cannot bring them back. Nor can we ease the pain of their families and friends who live with their loss.” Even though major operations in Afghanistan have ended, Obama noted there are still American troops serving there. He honored the loss of Army combat medic John Dawson, a Massachusetts resident who was the first U.S. soldier killed the military’s training and support missions. “This weekend also reminds us that, around the world, our men and women in uniform continue to serve and risk their lives,” Obama said. “This Memorial Day, we’ll honor Corporal Dawson as well.” Obama called on all Americans to use Memorial Day to remember soldiers who fought and died in the nation’s wars. “We are the Americans they died to defend,” Obama said. “So what we can do — what we must do — is fulfill our sacred obligations to them, just like they fulfilled theirs to us. We have to honor their memory.” And the president said it’s imperative that the country takes care of its veterans after they return from combat zones overseas. “We have to care for their families, and our veterans who served with them,” he said. “And as a nation, we have to remain worthy of their sacrifice — forever committed to the country they loved and the freedom they fought for and died for.” Tags:", "external_links": [], "published": "2015-05-23T13:00:00.000+03:00", "crawled": "2015-05-23T13:25:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}