{"organizations": [], "uuid": "ae10e1ab47f4190edec6480854c4f1c9ae6e2402", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/earnestjos_030915getty.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/immigration/241418-josh-earnest-is-wrong-obamas-job-on-immigration-not-over", "country": "US", "title": "Josh Earnest is wrong; Obama's job on immigration not over", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Josh Earnest is wrong; Obama's job on immigration not over", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-08T14:30:00.000+03:00", "replies_count": 0, "uuid": "ae10e1ab47f4190edec6480854c4f1c9ae6e2402"}, "author": "cvargas@drmcapitolgroup.com (Cesar Vargas, contributor)", "url": "http://thehill.com/blogs/pundits-blog/immigration/241418-josh-earnest-is-wrong-obamas-job-on-immigration-not-over", "ord_in_thread": 0, "title": "Josh Earnest is wrong; Obama's job on immigration not over", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 08, 2015, 07:30 am Josh Earnest is wrong; Obama's job on immigration not over By Cesar Vargas, contributor Getty Images \nThe 2016 presidential season has kicked off, and all attention has focused on the candidates from all sides who are talking about immigration. Meanwhile, the Obama administration seems to be preparing for retirement. ADVERTISEMENT Election Day is still more than a year away, however, and the White House still has much to do: toasting at a Cinco de Mayo celebration is not the end of the line for President Obama's job on immigration.\nWhite House Press Secretary Josh Earnest is legally wrong that the president did all that he could. For example, by utilizing Section 504(b)(2) of the enlistment statute, the president has statutory power to direct the secretary of Defense to allow talented Dreamers to enlist because their enlistment is \"vital to the national interest.\" \nRepublicans have shown, time and time again, that they are completely incapable of addressing immigration reform, allowing only bills attacking Dreamers to pass through the House of Representatives and never touching even the rightward-leaning Gang of 8 bill that passed the Senate with strong bipartisan support. \nEven though Hillary Clinton took a great step by committing to further action on immigration, Obama should not defer to future presidents on leadership that is needed now. \nLegal experts from around the country have agreed that a president has expansive legal authority to act to temporarily protect additional groups from deportation — and that this authority is rooted in statute, court opinion, regulations and precedent. \nObama has not exhausted the legal limits of this power yet, despite finding some political relief within a Department of Justice memo that outlined certain limits regarding executive power. \nHis authority on deportation relief, however, is fairly clear. Needless to say, the latest lawsuit against the president's immigration actions is nothing more than political theatrics by the far right of the Republican party and not based on law. \nWhile almost everyone running for president puts an emphasis on immigration legislation, ferrying legislation through Congress will not be easy or quick, however, and will require executive solutions to bridge the gap between now and the enactment of new laws. \nThe president can still expand deportation relief — as he did with Dreamers — to help keep more families intact and talent in the U.S. \nSignificantly, the \"bed mandate\" is an arbitrary policy offensive to contemporary notions of due process written into the Department of Homeland Security (DHS) Appropriations Act of 2010. DHS has interpreted this as a mandate to contract for and fill 33,400 beds in detention centers, which was increased in 2013 to 34,000. \nAs an agency, DHS is of course subject to executive authority: If the president were to direct DHS to interpret the funding differently, such as interpreting the 34,000 beds as an upper limit rather than a minimum, this could drastically change immigration detention, thereby allowing nonviolent immigrants to rejoin their families while their cases are processed. \nRather than settling for a legacy of executive timidity, President Obama can still leave a legacy of hope. While Congress is still relearning how to tie its shoes, the country needs an executive who will protect our families where our broken immigration system, and equally broken Congress, have failed. \nVargas is co-director of the Dream Action Coalition and a national advocate for immigration reform. Tags:", "external_links": [], "published": "2015-05-08T14:30:00.000+03:00", "crawled": "2015-05-08T15:01:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}