{"organizations": [], "uuid": "2bd29c68cf5e0f3668d00720f0d046dfd4a16157", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2964038/images/o-SAD-WOMAN-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/women/blog.xml", "section_title": "Women Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/david-a-grimes/how-legal-abortion-helps-american-families_b_7302440.html", "country": "US", "title": "How Legal Abortion Helps American Families | David A. Grimes", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "How Legal Abortion Helps American Families | David A. Grimes", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-18T20:08:00.000+03:00", "replies_count": 0, "uuid": "2bd29c68cf5e0f3668d00720f0d046dfd4a16157"}, "author": "David A. Grimes", "url": "http://www.huffingtonpost.com/david-a-grimes/how-legal-abortion-helps-american-families_b_7302440.html", "ord_in_thread": 0, "title": "How Legal Abortion Helps American Families | David A. Grimes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Legal abortion helps women in many ways; the medical, social, and economic benefits have been documented for decades . Less well appreciated are the benefits that extend to women's families, especially their children -- and most women having abortions are already mothers .\nSource: National Cancer Institute\n\"Shotgun marriages\"\nBefore Roe v. Wade , an unplanned pregnancy often led either to an unsafe abortion or to a forced marriage before the impending birth. The term \"shotgun\" stemmed from the threat of violence from the pregnant woman's father should the couple not marry. The prospects for these marriages were poor. Created under duress, these ill-advised unions failed at a high rate. An early study showed that after 1969, states with increasing abortion rates showed a decrease in overall marriage rates. Another study focused on young women, who would be most likely to be pressured into marriage; it found a significant inverse relationship between abortion and marriage rates. Further declines in \"shotgun marriages\" in recent decades have been related to better contraception and increasing acceptance of births out-of-wedlock.\nOut-of-wedlock births\nChildren born out-of-wedlock face medical and psychological challenges beyond those experienced by children born to married parents. These higher risks include low birth weight and infant death. In turn, these risks are related to the high proportion of single, young women giving birth for the first time. Growing up in a single-parent household has been associated with decreased verbal skills, abuse, and neglect .\nLegalization of abortion was strongly linked with a decrease in out-of-wedlock births across America. This reflected the greater use of abortion by unmarried than by married women. From 1971-1975, all states had declining rates of out-of-wedlock births. However, states with liberalized abortion laws had a decline that was six times steeper than other states.\n... legal abortion was of pivotal importance in the nationwide declines in illegitimacy between 1970 and 1971.\nWomen as heads of households\nAccess to safe, legal abortion influences women's decisions about unwanted pregnancies. The most compelling evidence comes from the impact of the Hyde Amendment on poor women. The discontinuation of Medicaid funding for abortions for poor women accounted for about half the increase in African-American women as heads of households. Parental notification and consent for abortion have been linked with a small increase in white women heading households.\nVulnerable women\nAccess to safe abortion is especially important for women struggling with medical and social problems . After Roe v. Wade , fertility declined, and the decline was steepest for women who were at the extremes of the reproductive age interval, unmarried, and of minority races. For example, pregnancy and childbirth are especially dangerous for older African-American women. Women at higher risk of poor medical and social outcomes of pregnancy disproportionately rely on abortion.\nBabies as beneficiaries\nLegalization of abortion in Oregon was rapidly linked with important declines in premature births, \"spontaneous\" fetal deaths, and infant deaths. New York City witnessed unprecedented decreases in the number and rate of infant deaths after the legalization of abortion. Another study examined the effects of abortion, newborn intensive care, poverty, women's educational attainment, Medicaid funding, organized family planning programs, and social services; it reached the following conclusion:\nAbortion was the single most important determinant of lowered neonatal mortality rates among African-Americans .\nChild abuse and neglect\nUnplanned births are linked with child abuse and neglect. In families with two unplanned births, children are twice as likely to be victims of abuse as are children in families without an unplanned birth. In families with three or more unplanned births, this risk increases five-fold . As would be expected, abortion availability is inversely related to mistreatment of children. States with limited access to abortion have higher rates of child maltreatment than do states without these restrictions. Similarly, abortion availability is inversely related to the percentage of children receiving social services.\nSumming up\nLegal abortion helps American families. After Roe v. Wade , \"shotgun marriages\" and out-of-wedlock births rapidly declined. Infant deaths were reduced as well. Women with medical and social problems disproportionately rely on abortion. Moreover, access to legal abortion is directly related to child well-being. Conversely, lack of access to abortion is related to child neglect and abuse. Unwanted births are associated with poor outcomes for both mother and child. The net effect of abortion is helping to ensure that every child born will be wanted, loved, and well cared for. This is a goal for American families around which there should be broad agreement.\nFollow David A. Grimes on Twitter: www.twitter.com/drdavidagrimes\nMore: Abortion Abortion Infant Mortality Child Abuse Out of Wedlock Of Child Neglect This Blogger's Books and Other Items from... Every Third Woman in America: How Legal Abortion Transformed Our Nation\nby David A. Grimes The Lancet Handbook of Essential Concepts in Clinical Research (The Lancet Handbooks)\nby Kenneth Schulz PhD MBA, David A. Grimes MD", "external_links": [], "published": "2015-05-18T20:08:00.000+03:00", "crawled": "2015-05-18T20:05:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}