{"organizations": [], "uuid": "093a2f19f03761f3239ca22170517587923a3ea3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/trumpdonald_022715gn.jpg", "site_section": "http://thehill.com/taxonomy/term/1183/feed", "section_title": "News", "url": "http://thehill.com/blogs/blog-briefing-room/news/241207-trump-to-slam-obama-trade-agenda", "country": "US", "title": "Trump to slam Obama trade agenda", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trump to slam Obama trade agenda", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-06T19:29:00.000+03:00", "replies_count": 0, "uuid": "093a2f19f03761f3239ca22170517587923a3ea3"}, "author": "mhensch@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/news/241207-trump-to-slam-obama-trade-agenda", "ord_in_thread": 0, "title": "Trump to slam Obama trade agenda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 06, 2015, 12:29 pm Trump to slam Obama trade agenda By Mark Hensch Greg Nash \nNew York business mogul Donald Trump will take aim at President Obama’s trade agenda and Republicans who support it in a new radio ad released later this week. \nThe Daily Caller reported on Wednesday that Trump would appear in the spot for Americans for Limited Government. ADVERTISEMENT The organization plans on airing the clip Thursday in New Hampshire and South Carolina. It will then debut on May 11 nationwide.\n“I learned a long time ago that a bad deal is far worse than no deal at all,” Trump, a possible 2016 GOP presidential candidate, says in the ad. \n“And the Obama Trans-Pacific Partnership and fast track are a bad, bad deal for American businesses, for workers, for taxpayers,” he continues. \n“It’s a huge set of handouts for a few insiders who don’t even care about our great, great America,” Trump says. “Congress has to stand up and defeat this raw power grab.” \nTrump’s new ad next takes issue with Republicans backing the trade deal. Their support, he argues, will cost America’s economy. \n“While I’m a Republican, some in the Republican party are working overtime to hand more power to President Obama,” he says in the spot. \n“These same people are turning their backs on the American workers and businesses,” he adds. “It’s unbelievable.” \nThe ad closes with Trump urging listeners to pressure their lawmakers against the deal. \n“With the dismal Obama track record, why should a Republican Congress give him more power and gut the Constitution to do it?” he asks. \n“It’s just crazy,” Trump says. “Tell your congressmen and your senators, vote no on fast track.” \nFast track authority would let Obama negotiate trade deals without Congressional approval. \nObama is seeking that power as he tries finalizing the Trans-Pacific Partnership, or TPP. \nThe proposed pact is a free trade agreement between the U.S. and 11 Pacific Rim nations. Tags: Past: 1 day NASA: Humanity closer to reaching... \"It is my firm belief that we are closer to getting there today,\" Charles... Perry criticizes Texas governor... A conspiracy theory claims the military is using a training exercise to... Bill Press: Sanders a serious... OPINION | The long-shot candidate will have a profound, positive impact on... Why isn’t Huckabee getting more... In many ways, Mike Huckabee is the Rodney Dangerfield of the 2016 election. Hillary to GOP: You get 1 shot on... Clinton's attorney says there is no \"logic\" to the panel's request. Juan Williams: Republicans and... OPINION: Southern white male dominance in the GOP has prompted alarm. Republicans pass a budget, flexing... The 51-48 vote capped weeks of work by Republican leaders in the House and... Clinton takes hit in new poll Her unfavorable ratings are up 6 percentage points, but she still tops... Bill would bar lawmakers from... Members of Congress are seeking to ensure taxpayers don't pay for luxury... NASA plan could lead to ‘... In the next decade, NASA wants to rope in and \"redirect\" an asteroid. CDC: Hispanics in US living longer... Much of the disparity can be attributed to the lower smoking rates among... Immigration battle moves to the... The fight underscores the GOP’s difficulty in wrestling with Obama’s DACA... Obama hints at post-presidential... Commander in chief getting more serious about his future endeavors. Team Hillary prepares 'Clinton... John Podesta said the campaign will not let attacks \"go unchallenged.\" Feds to require climate change... The new FEMA policy is sparking Republican criticism. Winners, losers in $612B defense... Rep. Martha McSally (R-Ariz.) and the F-35 are among the winners. Court hears challenge to Obama's... Judges questioned Arizona Sheriff Joseph Arpaio's legal standing in the... Lupus is not arthritis Lupus is an unpredictable, mysterious and misunderstood autoimmune disease... Buffett: I'm going to vote for... “I think that she is the most likely person to be president,\" the... House VA chief's patience wears... The head of the House Veterans’ Affairs Committee is running out of...", "external_links": [], "published": "2015-05-06T19:29:00.000+03:00", "crawled": "2015-05-06T20:48:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}