{"organizations": [], "uuid": "d543f3237135e661ef6d716e0f2b83b64e502681", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/abortion_012213aw_0.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/floor-action/senate/241979-house-approves-bill-banning-many-abortions", "country": "", "title": "House approves 20-week abortion ban | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "House approves 20-week abortion ban | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-14T01:11:00.000+03:00", "replies_count": 0, "uuid": "d543f3237135e661ef6d716e0f2b83b64e502681"}, "author": "", "url": "http://thehill.com/blogs/floor-action/senate/241979-house-approves-bill-banning-many-abortions", "ord_in_thread": 0, "title": "House approves 20-week abortion ban | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 13, 2015, 05:33 pm House approves 20-week abortion ban Getty Images \nThe House approved a bill banning abortions after 20 weeks of pregnancy in a party-line vote on Wednesday. \nThe legislation, which also requires a 48-hour waiting period, informed consent forms and mandatory counseling for victims of rape and sexual assault before abortions, passed 242-184, with 4 Republicans in opposition. \nFour Democrats voted for the measure. Rep. Jody Hice (R-Ga.) voted present. ADVERTISEMENT The bill was initially scheduled for a vote in January, but had been abruptly cancelled after some Republicans voiced concerns about a requirement that rape victims have to report to the police before they have the procedure.\nSeveral of the Republicans who raised complaints back then, including Reps. Renee Ellmers (N.C.) and Jackie Walorski (Ind.), voted for the bill Wednesday. \nThe bill stands almost no chance of becoming law while President Obama remains in office, though Republicans say it is part of their long game to force the issue back into the courts. \nThe Senate has no plans to immediately pick up the measure, though Senate Majority Leader Mitch McConnell (R-Ky.) backs a Senate version of the legislation. \nThe Obama administration again threatened to veto the bill on Wednesday, calling it “disgraceful” for House Republicans to push a late-term abortion ban bill that puts up barriers for sexual assault victims. \n“The bill continues to add a harsh burden to survivors of sexual assault, rape and incest who are already enduring unimaginable hardship,” press secretary Josh Earnest said. \nThe new language eliminates a requirement for rape victims to go to the police, though it did not change a controversial provision that allows victims of incest to receive an abortion only if they are under 18 years old. \nWhile Republicans have argued that the bill’s language on sexual assault would also cover incest, Democrats have insisted on a separate provision. \n“Incest does not necessarily involve rape,” Rep. Steven Cohen (D-Tenn.) said on the floor Wednesday. “Incest should always be an exception.” \nOpponents of the bill have also condemned the 48-hour waiting period and requirements to receive counseling or police attention before sexual assault victims can receive abortions. \n“This is truly adding insult to injury,” said Rep. Carolyn Maloney (D-N.Y.). \nThe four Republicans who voted agains the bill were Reps. Charlie Dent (Pa.), Bob Dold (Ill.), Rodney Frelinghuysen (N.J.) and Richard Hanna (N.Y.).The four Democrats who supported it were Reps. Henry Cuellar (Texas), Jim Langevin (R.I.), Dan Lipinski (Ill.) and Collin Peterson (Minn.). \nRepublicans have spent months working with House Majority Leader Kevin McCarthy (R-Calif.) to make tweaks that would unite the party around the bill. \nThe party’s effort was lifted by a recent study from the New England Journal of Medicine, which found that premature babies can survive at 22 weeks. \nAnti-abortion advocates are now hoping the new research will force the court to reconsider the question of viability of unborn babies — the lack of which was cited as a factor in the 1973 ruling. \nRep. Trent Franks (R-Ariz.), who authored the legislation, argued that banning abortions by the late stage of a pregnancy as a matter of conscience. \n“It is a test of our basic humanity and who we are as a human family,” Franks said in an emotional floor speech. \nAbortion rights advocates have disputed the findings and criticized the validity of the study. \n“In no way shape or form is a 20-week fetus viable. There’s no evidence of a 20-week fetus surviving, even with intensive medical care,” Dr. Hal Lawrence, the executive vice president of the American Congress of Obstetricians and Gynecologists, told reporters on Wednesday. \nWednesday’s vote marks the second time in three weeks that the House has voted on legislation related to abortions. House Republicans voted late last month to overturn a D.C. law prohibiting workplace discrimination based on reproductive health choices. \nHouse GOP leaders timed the vote to coincide with the two-year anniversary of Kermit Gosnell’s murder conviction for killing infants born alive during abortion procedures. The original January vote was meant to fall on the same day as the annual March for Life when thousands of anti-abortion activists descend upon Washington to protest the Roe v. Wade decision. \nThe House approved a similar late-term abortion ban in 2013, though the bill did not move to the then-Democratic controlled Senate. \n", "external_links": [], "published": "2015-05-14T01:11:00.000+03:00", "crawled": "2015-05-14T01:17:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}