{"organizations": [], "uuid": "ac03524752aabf1cb67f1f34b8b1fa4e06459bae", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/divorce/blog.xml", "section_title": "Divorce Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/tina-swithin/an-open-letter-to-president-obama-kelly-rutherfords-custody-case_b_7206618.html", "country": "US", "title": "An Open Letter to President Obama: Kelly Rutherford's Custody Case | Tina Swithin", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "An Open Letter to President Obama: Kelly Rutherford's Custody Case | Tina Swithin", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-19T01:32:00.000+03:00", "replies_count": 0, "uuid": "ac03524752aabf1cb67f1f34b8b1fa4e06459bae"}, "author": "Tina Swithin", "url": "http://www.huffingtonpost.com/tina-swithin/an-open-letter-to-president-obama-kelly-rutherfords-custody-case_b_7206618.html", "ord_in_thread": 0, "title": "An Open Letter to President Obama: Kelly Rutherford's Custody Case | Tina Swithin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dear President Obama,\nI know that you are a busy man, but by now I'm sure you've heard about Kelly Rutherford's plight to bring her children home to the United States of America? As you are probably aware, Kelly Rutherford and Daniel Giersch's children (two American-born citizens) were ripped from the arms of their primary parent by Judge Teresa A. Beaudet in an unprecedented move designed to cater to Daniel's inability to enter the United States of America.\nYou see, Mr. President, Daniel's visa was revoked due to suspicions and swirling allegations that he is an international drugs and weapons dealer. I ask you, if the United States has deemed this individual suspicious enough to ban him from our country, how are we allowing these two young children to be removed from their country and be shipped off to a foreign land where neither parent actually has citizenship? Plot twist: Daniel is a German citizen and Kelly is an American citizen yet the children are residing in France.\nIn an interview with People Magazine , Kelly was asked about the moment that she heard Judge Teresa Beaudet's decision, Kelly replied,\nI remember when she made the ruling, I just thought, 'There's something wrong here. Not because of their father and I or anything -- I've always wanted my kids to have a relationship with him, and I've really only encouraged that all along.\nWhen I went into court, I never asked for money, and I never asked for full custody. I just wanted what was right for them and their well-being moving forward.\nIn a statement released by Kelly's attorney, Wendy Murphy , she explained the driving force behind this new petition which will be landing on your desk very soon,\nThis is a political problem for President Obama and a constitutional problem for the courts. The president recently issued an executive order declaring that children born in this country to illegal immigrant parents must be allowed to remain in this country.\nMr. Obama specifically talked about the importance of mothers and children being allowed to stay together in America. How could Kelly and her children not be entitled to at least the same legal protections?\nIf Kelly's children are not rescued from involuntary expatriation to France, it would mean that President Obama believes non-citizens are entitled to greater rights than citizens in this country.\"\nLabeled by legal consultant, Dan Abrams as \" The worst custody decision in United States history, \" this is a your opportunity to correct a heart-breaking situation which continues to baffle and terrify American's across the country. I encourage you to bring Hermes and Helena back to their home in the United States of America.\nClick here for Kelly's petition\nSincerely,\nTina Swithin -- Family Court Advocate\nFollow Tina Swithin on Twitter: www.twitter.com/@tinaswithin\nMore: Kelly Rutherford Kelly Rutherford Divorce Kelly Rutherford Custody Battle Barack Obama This Blogger's Books and Other Items from... Divorcing a Narcissist: Advice from the Battlefield\nby Tina Swithin Divorcing a Narcissist - One Mom's Battle\nby Tina Swithin", "external_links": [], "published": "2015-05-19T01:32:00.000+03:00", "crawled": "2015-05-19T01:07:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}