{"organizations": [], "uuid": "50e5fa40df341fc30dc9e5e2e434c72326e3d6a6", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/anbariraq05222015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/18/feed", "section_title": "The Hill: Contributors", "url": "http://thehill.com/blogs/pundits-blog/defense/243281-why-republicans-cant-blame-obama-for-iraq-or-isis", "country": "US", "title": "Why Republicans can't blame Obama for Iraq or ISIS", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Why Republicans can't blame Obama for Iraq or ISIS", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-28T13:30:00.000+03:00", "replies_count": 0, "uuid": "50e5fa40df341fc30dc9e5e2e434c72326e3d6a6"}, "author": "goodmanauthor@gmail.com (H.A. Goodman, contributor)", "url": "http://thehill.com/blogs/pundits-blog/defense/243281-why-republicans-cant-blame-obama-for-iraq-or-isis", "ord_in_thread": 0, "title": "Why Republicans can't blame Obama for Iraq or ISIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 28, 2015, 06:30 am Why Republicans can't blame Obama for Iraq or ISIS By H.A. Goodman, contributor Getty Images \nThe National Review claims that President Obama is to blame for Iraq's demise and states: \"What had been won on the ground could be just as easily lost if the U.S. did not leave behind peacekeepers in the manner that it had in all its past successful interventions: the Balkans, Germany, Italy, Japan, the Philippines, and South Korea.\" However, American soldiers in postwar German, Japan, the Philippines and other regions never had to contend with anything similar to Iraq's counterinsurgency conflict: ambushes, improvised explosive devices and insurgents destroying rival holy sites . Aside from the fact that countries like post-World War II Germany and post-invasion Iraq are polar opposite scenarios (West Germany had a government longing for American forces , while Iraq has been a deadly sectarian quagmire since 2003), this viewpoint also ignores the fact that Iraqi leaders had their own objectives, and these goals ran contrary to U.S. national security. ADVERTISEMENT First, it was President George W. Bush, not Obama, who negotiated the Status of Forces Agreement that set the timetable for a 2011 withdrawal of U.S. soldiers. As for former Florida Gov. Jeb Bush's (R) belief that Obama \"refused\" a plan to leave 10,000 Americans in Iraq, that is rated \" mostly false \" according to Politifact.com. While Obama has been accused of not taking negotiations for a new agreement seriously , the leader of Nouri al-Maliki's bloc in the Iraqi parliament believed that American demands were \"a nonstarter for most of the parties and MPs [members of parliament]\" and that a new status of forces agreement would be \"very difficult, if not impossible,\" as quoted in The Atlantic . Echoing this viewpoint, a TIME magazine article headlined \"Iraq's Government, Not Obama, Called Time on the U.S. Troop Presence\" notes that \"ending the U.S. troop presence in Iraq was an overwhelmingly popular demand among Iraqis\" and that \"it was Iraqi democracy that put the kibosh on that goal.\"\nSecond, it was never in U.S. interests to remain in a country that refused the presence of U.S. troops. This fact is also ignored by Republicans like Jeb Bush who blame Obama for Iraq's demise. A 2011 Atlantic article headlined \"U.S. Troops are Leaving Because Iraq Doesn't Want Them There\" quotes former Iraqi Prime Minister Ayad Allawi as saying, \"Keeping Americans in Iraq longer isn't the answer to the problems of Iraq.\" Allawi also stated that a prolonged U.S. presence was \"definitely not the solution to the problems of my country.\" \nIn terms of a post-American Iraq that Republicans believe could have been saved by thousands of American soldiers, Foreign Affairs paints a picture of a corrupt political system where peace and tranquility could never have resulted simply from the presence of 10,000 U.S. soldiers: Prime Minister Nouri al-Maliki presides over a system rife with corruption and brutality, in which political leaders use security forces and militias to repress enemies and intimidate the general population. The law exists as a weapon to be wielded against rivals and to hide the misdeeds of allies. ... The Iraqi state cannot provide basic services, including regular electricity in summer, clean water, and decent health care; meanwhile, unemployment among young men hovers close to 30 percent, making them easy recruits for criminal gangs and militant factions. \nWould 10,000 U.S. soldiers have prevented the \"corruption and brutality\" of the Maliki regime in Iraq, provide \"basic services to Iraqis\" or fix the 30 percent unemployment? \nOf course not, and once Americans left, Iraq's Shiite-dominated government arrested its Sunni vice president. Shiite leaders immediately consolidated power at the expense of Sunni rivals. As a result of Sunnis reacting to being marginalized after decades of dominance (Saddam Hussein was Sunni), a PBS Frontline article headlined \"How Saddam's Former Soldiers are Fueling the Rise of ISIS\" explains that \"As the Islamic State [in Iraq and Syria] continues its march through Syria and Iraq, the jihadist group is quietly utilizing a network of former members of Saddam Hussein's Baath Party to help militarize a fighting force that has effectively erased the border between both nations and left roughly 6 million people under its rule.\" \nSince al-Maliki was \" pulling Iraq apart ,\" as described by The Telegraph , Sunni tribal leaders were eventually forced to do what Newsweek referred to as \"bet on the strong horse, and that's ISIS.\" As for Obama's culpability in the rise of the Islamic State in Iraq and Syria (ISIS), and Iraq's demise, Thomas Ricks blames Iraq's Shiite leaders. In a recent Foreign Policy article by Ricks headlined \"Who Lost Iraq? I Don't Think It Was Obama, I Think It Was Iraq's Shiite Leaders,\" Ricks states that keeping U.S. forces longer in Iraq \"might have made the U.S. government a hostage to the Baghdad government.\" In terms of American forces possibly stemming the tide of sectarian violence, Ricks states \"I don't see evidence that additional American pressure might have made the Shiite leaders act any more generously.” \nFinally, there was never a time, from 2003 until the present day, where Iraq was \"won,\" and there has never been a year in Iraq since 2003 where the words \" Mission Accomplished \" could be uttered without hearing the sounds of suicide bombs or ambulance sirens. A recent study estimates that nearly 500,000 Iraqis have died during the war, while M.I.T. states that around 3.5 to 5 million have been displaced because of the conflict. Iraq Body Count estimates a total of 1,003 suicide bombings in Iraq from 2003 to 2010. The U.S. military can't stop people from deciding to blow themselves up, regardless of what is said by Republicans who blame Obama for Iraq's demise. \nEven with 10,000 American soldiers, which the Iraqis refused to allow in 2011, there would still have been rampant political corruption, suicide bombings, Iranian backed-Shiite militias and Saudi-backed Sunni tribes , and also the emergence of ISIS (a rebranding of al Qaeda, since ISIS used to be al Qaeda in Iraq ) in Syria. Obama isn't perfect, but the demise of Iraq began the moment Bush decided upon regime change, not in 2011 with Obama's decision to bring our soldiers home. The fact that Iraq's Shiite-dominated security forces showed \" no will to fight \" — in the words of Secretary Ash Carter — a Sunni terror group named ISIS in Ramadi highlights the reality that Iraq's ethnic divisions always doomed a functioning state. \nGoodman is an author and a journalist. Tags:", "external_links": [], "published": "2015-05-28T13:30:00.000+03:00", "crawled": "2015-05-28T16:19:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}