{"organizations": [], "uuid": "25eb53d7461741286e3866dc7dcd7d34a4fc647d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2316218/images/o-MARIJUANA-EDIBLE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/healthy-living/blog.xml", "section_title": "Healthy Living Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/the-new-england-journal-of-medicine/marijuana-edibles_b_7347814.html", "country": "US", "title": "Half-Baked -- The Retail Promotion of Marijuana Edibles | The New England Journal of Medicine", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 2, "title_full": "Half-Baked -- The Retail Promotion of Marijuana Edibles | The New England Journal of Medicine", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-22T02:22:00.000+03:00", "replies_count": 1, "uuid": "3597dc64056478b678e286a1a6adf2900e7cc0bf"}, "author": "The New England Journal of Medicine", "url": "http://www.huffingtonpost.com/the-new-england-journal-of-medicine/marijuana-edibles_b_7347814.html#post-0", "ord_in_thread": 0, "title": "Half-Baked -- The Retail Promotion of Marijuana Edibles | The New England Journal of Medicine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Robert J. MacCoun, Ph.D., and Michelle M. Mello, J.D., Ph.D.\nFrom the Stanford Law School, the Freeman Spogli Institute, and Stanford University School of Medicine\nA striking feature of the rollout of the state-legalized retail sales of marijuana has been the tremendous popularity of edible marijuana products. Marijuana brownies have long been a staple of cannabis coffee shops in the Netherlands, but the new products are quite different. They are skillfully produced and packaged to closely mimic popular candies and other sweets. These products can now be purchased legally in four states; retail stores are operating in Colorado and Washington State, and voters recently approved retail sales in Alaska and Oregon.\nThe new edibles raise public health concerns, including a risk of consumption by children. Although the states that have legalized recreational use of marijuana have only partially addressed these risks, many others -- including Arizona, California, Maine, Massachusetts, Missouri, Nevada, and Vermont -- are likely to move legalization proposals forward, developments that may amplify the problem.\nMarijuana is associated with a long history of public misinformation and anxiety, and many observers will therefore view concerns about edibles with skepticism. Still, edibles that resemble sugary snacks pose several clear risks. One is overintoxication. Whereas consumers commonly assume that a candy bar constitutes a single serving, some of these products contain four or more times the level of tetrahydrocannabinol (THC) that is considered to be a safe dose. (Colorado, for instance, set a standard size for an edible serving at no more than 10 mg of THC.) At high doses, THC can produce serious anxiety attacks and psychotic-like symptoms. This problem is augmented by differences in the pharmacokinetic and metabolic effects of marijuana when it is ingested rather than smoked. [ 1 ] In addition, case reports document respiratory insufficiency in young children who have ingested marijuana. [ 2 ]\nAlthough the use of marijuana remains illegal everywhere for people under 21 years of age, today's edibles are likely to appeal to children and young people. Even if consumption by minors is not intended by manufacturers, the packaging of edibles brings to mind the tort-law concept of the \"attractive nuisance\" -- a hazardous condition that is foreseeably likely to attract children who are unable to appreciate the risk involved. It also evokes tobacco companies' use of advertising campaigns with youth appeal, such as the long-running campaign featuring Joe Camel. [ 3 ]\nWhether through deliberate acquisition or unknowing consumption, these child-friendly edibles increase minors' risk of exposure to and experimentation with marijuana. [ 4 ] A recent study showed that the proportion of ingestion-related emergency department visits by young children in Colorado that were attributable to marijuana ingestion increased after legal restrictions were eased and that the majority of identified sources of the marijuana involved were edibles. [ 5 ] Accidental exposures are not the only reason for concern, however. Plausibly, the availability of child-friendly edibles could increase the probability of initiation to marijuana use, reduce the average age of initiation, and increase the frequency and intensity of use among users of all ages.\nWhy have new kinds of marijuana edibles proliferated? The answer is simple: They appeal to consumers, and the ballot propositions that legalized marijuana use did not include rules prohibiting edibles in formulations and packages that appeal to children. In the face of intense lobbying from the new industry, Colorado and Washington State subsequently adopted fairly modest regulations for edibles. Both states require child-resistant packaging, a warning to \"keep out of the reach of children,\" and labeling describing a standard serving size. Neither requires warnings that ingested marijuana can have different effects from smoked marijuana. Both states prohibit packaging and advertising that specifically target children, but neither requires formulation or packaging that is clearly distinguishable from ordinary food products.\nThe federal government does not regulate marijuana edibles. Marijuana remains a Schedule I controlled substance under the federal Controlled Substances Act (CSA), which means that it's considered to have high potential for abuse, is not recognized as having any accepted medical use, and is not considered safe to administer even under medical supervision. As long as it remains on Schedule I -- a determination that has been periodically reconsidered -- it is outside the purview of the Food and Drug Administration (FDA) to regulate as a drug, except in the context of research studies. The FDA could determine that marijuana edibles qualify as a food under the federal Food, Drug, and Cosmetic Act (FDCA) and seek to enforce regulations concerning food adulteration. Under the FDCA, foods must not contain additives that the FDA has not approved or that are not \"generally recognized as safe.\" Marijuana arguably fails that standard, but the FDA has given no indication that it will assert its authority. Politically, the agency can't easily begin regulating marijuana sales while such sales remain federally prohibited.\nThe Department of Justice could enter the scene, enforcing the CSA's marijuana prohibition against edibles companies and consumers. However, it has stated that enforcing the CSA against persons whose actions are in compliance with state and local law is not an agency priority -- though it left the door open for action where absent or anemic state regulations allow legalized marijuana to threaten key national interests such as preventing distribution to minors.\nAs things stand, states have created a wide berth for marketing of marijuana edibles that federal agencies are unwilling or unable to narrow. But states can implement strong restrictions on the formulation, packaging, and marketing of these products at the time that they legalize medicinal or recreational use of marijuana. Child-resistant packaging is necessary but not sufficient; older children can easily defeat it. Clear labeling regarding THC doses and recommended serving sizes, along with warning labels about the risks of overconsumption, are also commonsense measures but won't protect young children. We believe that regulations should also impose substantive restrictions on product formulation and packaging aimed at reducing the likelihood that minors and other consumers will confuse marijuana and non-marijuana products. Restricting the extent to which marijuana edibles can look and taste like familiar sweets could also keep the psychological barriers to marijuana initiation among children and adolescents from being lowered. Finally, regulations could seek to reduce the risk of overconsumption by controlling and standardizing THC content. [ 4 ]\nThe courts may serve as another avenue of regulation. Consumers who are injured by ingestion of edibles may bring personal-injury claims seeking damages against manufacturers and retailers. Judges and juries could well find credible consumers' claims that these products were negligently designed, since the risks of overdose and consumption by children are reasonably foreseeable and avoidable. Such lawsuits could make the effects of these products on health more salient for manufacturers -- but might be too infrequent and low-cost to spur adoption of more responsible business practices. Lawsuits would be more likely to draw attention to the problem than to obviate the need for formal regulations.\nFood companies could also bring trademark-infringement suits to prevent companies from marketing edibles that closely resemble their non-marijuana products. A Colorado edibles manufacturer recently settled such a suit with Hershey. The threat of litigation could deter companies from mimicking familiar candies and drinks, which may reduce the risk of inadvertent consumption by children, but it won't prevent manufacturers from marketing equally appealing products that are not outright mimics.\nBecause legal channels are available to address the problems with marijuana edibles, such issues are not an argument against legalizing marijuana. Indeed, one potential advantage of legalization is that it provides more regulatory levers than are available under prohibition. Rather, the edibles problem is an argument against implementing legalization before an appropriate regulatory framework is in place. Though the ingenuity and swiftness with which manufacturers have formulated the new edibles have been surprising, the general problem was predictable. As legalization of marijuana spreads, new adopters should ensure that their regulatory scheme for marijuana edibles is fully baked.\nSee the article, and read the comments, on NEJM.org.\nListen to an audio interview with Prof. Robert MacCoun on the marketing of marijuana edibles and the risks posed by legalizing retail marijuana.\nFollow The New England Journal of Medicine on Twitter: www.twitter.com/NEJM\nMore: Marijuana Retail Marijuana Edible Marijuana Public Health Marijuana Edibles", "external_links": [], "published": "2015-05-22T02:22:00.000+03:00", "crawled": "2015-05-22T05:41:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}