{"organizations": [], "uuid": "e0e0952bef017292092c7820823662f26497751a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabasketball_020615getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1990/feed", "section_title": "In The Know", "url": "http://thehill.com/blogs/in-the-know/in-the-know/243342-obama-praises-recently-axed-chicago-bulls-coach", "country": "US", "title": "Obama praises recently axed Chicago Bulls coach", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama praises recently axed Chicago Bulls coach", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-28T21:16:00.000+03:00", "replies_count": 0, "uuid": "e0e0952bef017292092c7820823662f26497751a"}, "author": "bkamisar@thehill.com (Ben Kamisar)", "url": "http://thehill.com/blogs/in-the-know/in-the-know/243342-obama-praises-recently-axed-chicago-bulls-coach", "ord_in_thread": 0, "title": "Obama praises recently axed Chicago Bulls coach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 28, 2015, 02:16 pm Obama praises fired Chicago Bulls coach Getty \nPresident Obama departed from a Twitter chat on climate change Thursday to address the tenuous state of his hometown Chicago Bulls, which just fired its head coach. \nTweeting from his new @POTUS account, he expressed solidarity with former coach Tom Thibodeau hours after the Bulls announced his dismissal in a statement. ADVERTISEMENT “Love thibs and think he did a great job,” Obama said, referring to the popular coach who clashed with team management. \n“Sorry to see him go but expect he will be snatched up soon by another team.” \nThe Obama administration’s has supported Thibodeau since before he became the Bull’s head coach after a stint as an assistant with the Boston Celtics. Team owner Jerry Reinsdorf told the Chicago-Sun Times in 2011 that Secretary of Education Arne Duncan, a former Harvard basketball player, first recommended that the team hire Thibodeau to lead the team. \nWhen the team finally chose Thibodeau, both Obama and his senior adviser David Axelrod congratulated Reinsdorf and told him he had made a good choice. \nAnd despite the tension between the team and its coach, Obama praised Thibodeau during a radio spot on ESPN Radio last December. \n“I just like Thibodeau as a coach,” he said. “The guy's tough.” Past: 1 day Report: Obama lied about bin Laden... Seymour Hersh accuses Obama of rushing to take credit for the al Qaeda... Michelle Obama speaks of emotional... She discussed facing comments \"rooted in the fears and misperceptions of... Bin Laden report 'full of lies,'... Seymour Hersh’s report is “garbage,” says SEAL who claims he killed Osama... Juan Williams: The GOP's festival... OPINION | Candidates are abandoning previous positions to better appeal to... Investigative journalist defends... Seymour Hersh accuses the White House of mischaracterizing details of bin... Two years later, IRS probes drag on GOP lawmakers fuming about the status of the IRS investigation. DHS secretary: Lone wolf attackers... “We’re very definitely in a new environment,\" Jeh Johnson said. Killings of police officers on the... Fifty-one officers were killed in a felony crime in 2014, the FBI said. 113 Republicans back lawsuit... They accuse the president of \"disrupting the delicate balance of powers.\" George Zimmerman shot in Florida Police in Florida say George Zimmerman was involved in what appears to be... Immigration debate roils GOP A group of dissident Republicans in the House are clashing with their... Pressure mounts as Congress dives... The clock is fast running out on the agency’s power to collect phone... Report: Christie spent $300,000 in... A watchdog found Christie racked up an $82,000 bill at the home of the... Karl Rove surrenders to ObamaCare He correctly tells Republicans that their pledge to repeal ObamaCare is a...", "external_links": [], "published": "2015-05-28T21:16:00.000+03:00", "crawled": "2015-05-28T22:59:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}