{"organizations": [], "uuid": "cea61bf0d45005dd481208673373aacb4d38b164", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamamichelle04072015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news-campaigns/242068-poll-michelle-obama-would-be-hillarys-strongest-dem", "country": "US", "title": "Poll: Michelle Obama would be Hillary’s strongest Dem rival in 2016", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Poll: Michelle Obama would be Hillary’s strongest Dem rival in 2016", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-14T19:03:00.000+03:00", "replies_count": 0, "uuid": "cea61bf0d45005dd481208673373aacb4d38b164"}, "author": "nzimmerman@thehill.com (Neetzan Zimmerman)", "url": "http://thehill.com/blogs/blog-briefing-room/news-campaigns/242068-poll-michelle-obama-would-be-hillarys-strongest-dem", "ord_in_thread": 0, "title": "Poll: Michelle Obama would be Hillary’s strongest Dem rival in 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 14, 2015, 12:03 pm Poll: Michelle Obama would be Hillary’s strongest Dem rival in 2016 By Neetzan Zimmerman Getty Images \nIf Michelle Obama decided to run for president in 2016, she would pose the most significant threat, among likely contenders, to Hillary Clinton's chances of winning the Democratic nomination, according to a new Rasmussen poll . \nA telephone survey of 1,000 likely voters conducted by the polling company found that in a hypothetical match-up between the current first lady and the former secretary of State, Clinton would best Obama 56 percent to 22 percent. ADVERTISEMENT That may seem like a significant margin, but according to the most recent RealClearPolitics polling average , Elizabeth Warren, a popular hypothetical challenger to Clinton, receives only 12.5 percent to Clinton's 64 percent.\nSen. Bernie Sanders (I-Vt.), the only other major Democratic candidate in the race for president, is even further behind, with 7.4 percent. Former Maryland Gov. Martin O’Malley, who is expected to announce his bid on May 30, fares the worst against Clinton, with 1.2 percent of support from likely voters. \nThe first lady is highly unlikely to mount a presidential campaign, however. In fact, of the people surveyed by Rasmussen, just 14 percent thought she should run. \nStill, 40 percent of black voters welcomed the idea of her running, and she bests Clinton among those voters, with 44 percent support among African-Americans compared with 36 percent for Clinton. \nObama herself recently joked about a possible October surprise, hinting to \"Late Show\" host David Letterman that the thought had crossed her mind.", "external_links": [], "published": "2015-05-14T19:03:00.000+03:00", "crawled": "2015-05-15T08:27:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}