{"organizations": [], "uuid": "291ddb52518eb6db54e65441c9a33fc46ddb83b2", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/05/30/WE01217024/3609853/obamamaduropng-3609853_lg.jpg", "site_section": "http://rss.ireport.com/feeds/latest.rss", "section_title": "CNN iReport - Latest", "url": "http://ireport.cnn.com/docs/DOC-1245595?ref=feeds%2Flatest", "country": "US", "title": "#Sorprendente ¿Que Negocia Maduro con Obama? Columna Regiones Web de esta semana", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "#Sorprendente ¿Que Negocia Maduro con Obama? Columna Regiones Web de esta semana", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-30T14:45:00.000+03:00", "replies_count": 0, "uuid": "291ddb52518eb6db54e65441c9a33fc46ddb83b2"}, "author": "anmon", "url": "http://ireport.cnn.com/docs/DOC-1245595?ref=feeds%2Flatest", "ord_in_thread": 0, "title": "#Sorprendente ¿Que Negocia Maduro con Obama? Columna Regiones Web de esta semana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "#Sorprendente ¿Que Negocia Maduro con Obama? Columna Regiones Web de esta semana By anmon | Posted 5 minutes ago Regiones Web: Gobierno de EE.UU. negocia con Maduro ¿Adivine qué? El Representante de Estados Unidos va y viene. Las llamadas. Los mensajes encriptados no cesan entre un gobierno y otro. Para muchos se busca mejorar las relaciones pero cualquier infante estudioso de las relaciones internacionales sabe que los norteamericanos no dan “puntilla sin dedal”. Algunos analistas se atreven a señalar dentro de la “negociación” el futuro de Maduro. Una supuesta transición e incluso suenan algunos nombres. Unos señalan a HENRY FALCON y sus últimas posturas pudieran favorecer esta tesis, solo que al Suboficial retirado más de la mitad del “Alto Chavismo” no lo quiere y los “gringos” tampoco. Otros mencionan a Eduardo Fernández, solo que lo veo tan ocupado en ver como reflota políticamente para poder volver a tener valor que no creo este haciendo el “lobby” para esto. No creo que se negocie ese invento que algunos radicales llaman “transición”. El fin del chavismo será proporcional a su llegada. No existe otra posibilidad. Cualesquier transición es impensable para quien tiene tantos compromisos con “entes” extraños a la nación. Otros señalan que “Negocia el regreso de la DEA” para cercar al segundo. Para mi esa es otra fantasía del radicalismo opositor. El gobierno de EEUU no necesita tener una sede de la DEA aquí para saber lo que pasa. A mi juicio lo que se negocia son condiciones y quizá la entrega o la facilitación en la captura de un NARCO muy famoso que operaba en Cuba bajo el patrocinio de los Castro y que ha huido de varios países sudamericanos . No se les puede olvidar que Estados Unidos en lo práctico no es una nación sino un “negocio”. La justicia y los valores tienen como preferencia sus “intereses”. CARACAS FISICO POLITICO : Voluntad Popular arriesga físico con el acto convocado para el sábado. Tres cosas pueden ocurrir: Uno, que el acto sea bueno pero se origine un problema de seguridad que obligue a intervenir a las autoridades y sea una excusa para otras decisiones. Dos, Que no vaya nadie. Tres, que sea un éxito rotundo. Cualquiera de las tres cosas que pasen implica un costo político para LEOPOLDO LOPEZ. Sin embargo no se sorprendan de que funcione en Caracas y no en las regiones, o por lo menos no en todas ellas, motivado a las mismas contradicciones que subyacen en el partido VOLUNTAD POPULAR que en muchos estados es VOLUNTAD PERSONAL. La MUD como era de esperarse se vio obligada a “recular”. Lo más estúpido que he visto es que lo hizo de manera individual cada uno de los Jefes de Partido y no el cuerpo en general, llegándose al colmo de que el propio “Chuo” dijo que irá a la marcha. Mundo de locos. Veo las posturas de HENRY RAMOS y me recuerda la misma actitud que tenía cuando en el país reinaban AD-COPEI y ellos creían que nunca perderían el poder. Algunos aseguran que detrás de las decisiones de LEOPOLDO LOPEZ hay asesoramiento “gringo”. Otros señalan que es producto de su propia situación. Lo cierto es que LEOPOLDO es definitivamente el líder de Venezuela en este momento. Esto no es del todo bueno ni del todo malo pero es una señal inequívoca de que el pueblo sigue “escaneando” en busca de un MESIAS que parece haber encontrado. De lo que resulte el sábado, VOLUNTAD POPULAR y sus aliados pudieran deslindarse por completo de la MUD. Muchas encuestas serias señalan como un hecho cierto la formación de un BLOQUE EMERGENTE, aunque aún es prematura asegurarlo. Leopoldo pudiera ser quien lo lidere. Nada ésta decidido. Será una discusión. MIEDO CHAVISTA los ha llevado a aumentar el uso de escoltas. Es asombroso observarlo no solo en Caracas sino en toda Venezuela. ¿A qué le tienen miedo? SE CONFIRMA LO que anunciamos sobre COPEI la semana pasada y la cabeza que han pedido. No analizó si es justa o no. FUTBOL Qué bueno sería, escuchar a CESAR FARIAS hablar sobre las vagabunderías que permitieron a ESQUIVEL manejar esa federación tantos años. Muchos se asombrarían. SOCIALISMO LATINOAMERICANO SIGUE MOSTRANDO DE QUE ESTA HECHO: CORRUPCION La supuesta “pobreza” de Pepe Mujica al parecer es un Bluf Ha plagado de corrupción y escándalo el continente. En Argentina hablar de la Presidenta y de su partido es sinónimo de corrupción y hasta de otras cosas más como la muerte de Nissman y el atentado terrorista en contra de judíos, donde ella ésta señalada de ser “colaboradora” en el mejor de los casos. En Perú con el Presidente ocurre lo mismo. Acaba de ser capturado uno de sus ex Asesores fugado de Bolivia donde había sido capturado. Brasil es la comidilla con su Presidenta y su partido ligados a sobornos, corrupción, entre otros. La más calladita en Chile ha asombrado por la abundante podredumbre que la rodea empezando por su hijo, tanto que ella señalo ante una pregunta de Don Francisco que CHILE ha dejado de creer y pidió la renuncia de todos sus ministros. En Bolivia aparece el segundo al mando ligado a Narcotráfico con un “Capo Brasilero” y la mentira del año es quizá la FALSA POBREZA del Ex Presidente PEPE Mujica que recientemente un periodista muy serio dio a conocer. Es mentira que tiene por carro solo un “wolsvagen”, no declaro una cifra importante en dólares y posee otros bienes que quizá no estén a su nombre. Su único objetivo ganar el PREMISO NOBEL de la Paz para seguir desde el socialismo influyendo y plagando al continente de estas “joyitas”. No hablemos de Guatemala, ni de Nicaragua y mucho menos de Venezuela. Por eso yo preguntaría ante la estúpida frase del Presidente Maduro repetida una y mil veces ¿Quién es el que ésta en CRISIS? ¿El Capitalismo o el socialismo? FALCON El pueblo falconiano ésta dolido. Muy afligido por la tragedia de una Mujer y su hijo de 7 años. Se cayeron en una boca de visita abierta. Primero cayó el niño y luego su madre al verlo se lanzó también para rescatarlo. Aparecieron días después muertos ambos. En la capital Coro hay mucho malestar con la Gobernadora y el alcalde Pablo Acosta. Si esto hubiese sucedido en un Estado OPOSITOR ya estarían presos o por lo menos acusados por la FISCAL GENERAL . También en PARAGUANA el problema eléctrico y el suministro del agua cada día empeora y la Gobernadora nada más se ve los sábados por su programa, asumiendo la responsabilidad pero no se ve en hechos ninguna solución. Ella ésta dedicada a la zona de la sierra y occidente, porque allí es candidato “El huido”, su esposo, a diputado. El domingo pasado vino a Punto Fijo Arias Cárdenas a la firma del compromiso de los precandidatos del eje Carirubana-los taqués y cuando Jesús Montilla entro al local donde se efectuaba el evento lo recibieron con una pita descomunal de rechazo. El que tenga ojos que vea. LARA Para mí no hay sorpresa en la postura del Gobernador HENRY FALCON. Recuérdese su apoyo al gobierno y su crítica al Gobierno de los Estados Unidos. Ha sido coherente en su planteamiento de plantear el dialogo como salida a la crisis. Le respeto su visión y también ésta arriesgando físico político. Peor aún: su producto político ésta absolutamente devaluado y fuera del mercado. Malo porque no creo que ayude mucho como portaviones en las Parlamentarias. Sin embargo en política solo gana el que se atreve, con todas las consecuencias que ello implica. MONAGAS El gran derrotado de la MUD es el Alcalde de Maturín Warner Jimenéz. Su candidato llegó tercero en el propio municipio donde él viene de ganar y su partido presentó otra fórmula, distinta a la suya. TACHIRA La semana que concluye se estremeció cuando el Gobernador VIELMA MORA señalo que detrás de la crisis cambiaría están “Eligio Cedeño, Nelsón Mezerhane y los DUEÑOS DE GLOBOVISION”. Poca importancia se le ha dado a tan grave denuncia. GLOBOVSION es un canal que mantiene muy buenas relaciones con un sector muy poderoso dentro del chavismo. Un Gobernador que manda en un estado donde no nació y que no es el Zulia, se le señala de ser socio de “GORRIN”. La pregunta sería entonces ¿Dentro del propio Chavismo conspiran contra “MADURO”? ¿Qué alguien me diga? Pocos medios le dieron importancia a este señalamiento. ZULIA Un alto dirigente del PSUV Zulia paso en cadena este mensaje: “Alerta a todos nuestros militantes de la causa socialista, nosotros podemos ser críticos e irreverentes en el debate, y a pesar de todas las dificultades que se puedan estar desarrollando en el medio de esta lucha de clases y cuando más se agudizan las contradicciones, debemos permanecer leales y comprometidos con nuestra revolución, de repente veamos sus dificultades y errores en lo político, económico o social, quizá nos hemos sentidos atropellados y maltratados por algunos sectores del proceso , pero es nuestra revolución y es la que tenemos, la de Chavez, la de maduro, no hay otra, y tenemos que defenderla con la vida de ser necesario, lo contrario sería la dictadura del capitalismo, la subyugación de la clase más humilde de este país ante la oligarquía, sería la eliminación de la educación y salud gratuita, sería la eliminación de nuestras misiones sociales, así que si estas arrecho por cualquier circunstancia, drenemos esa arrechera y preparémonos para la lucha , para defender nuestra revolución y nuestro camarada Presidente Nicolas Maduro, no existe capitalismo bueno, ni existirá, el peor de los socialismo siempre será mejor que el mejor de los capitalismo, desprendámonos de todo resentimiento, de todo egoísmo, de nuestras miserias humanas y preparémonos para defender nuestra patria de Chavez y Bolívar”. Mensaje lanzado al vacío ante un pueblo chavista que vive y padece una crisis y observa el lujo y la dolce vita de sus líderes. En que anda Manuel Rosales. Me responde: “En las dos últimas semanas he cumplido una gira internacional de alta importancia. Bajo perfil, sin pantalla, sino trabajando en la salida electoral con propuestas y garantías en el proceso”. ELECCIONES INTERNAS DEL PSUV: En el circuito 5 (Juana de Avila-Mcbo) la pelea será entre Danny Boza y Heber Galicia. Muy bajo perfil Emanuel Pulgar. En el Circuito 4 (Venancio Pulgar-Mcbo) la pelea HENRY RAMIREZ Vs FIDEL MADROÑERO como lo anunciamos ya ésta dando que hablar. La semana que concluye hubo una batalla campal en la Curva de Molina entre los 8 Guardaespaldas de Fidel contra los dirigentes de Henry. No estoy inventando nada, FIDEL admitió el uso de “guardaespaldas” en un programa de TV y que incluso le reclamaran a MADURO (lo dijo el mismo) quien es quien se lo paga. En el circuito 7 (Cristo de Aranza-Mcbo) se mueve como un peso pluma Jorge Manolo Medina a quien yo llamo “Papaleco”. Luis Pérez trata de proyectase sobre la figura de Jackeline Pirela. En el Circuito 8 debe ganar Willy Casanova, aunque José Camargo le da pelea. En el circuito 3 (Guajira) el favorito es Sergio Fuenmayor pupilo de Luis Caldera. En el Sur del Lago circuito 12 Blagdimir Labrador debe ganar sin problemas la candidatura. En los dos circuitos de la COL deben imponerse Felix Bracho hijo y José Luis Bermudez. En San Francisco debe ganar Omar Prieto perdón Lisandro Cabello, mano derecha, asesor principal, novio de la madrina, cuarto bate del Alcalde que por error señale al principio. La TERCERA VIA LANZA CANDIDATOS y a los efectos suenan CARLOS ALAIMO, JOSE PERNIA, ADALID MORALES, JORGE PORRAS y otros que aun asisten a la MUD pero están comprometidos por aquí. El manager de este grupo es Alejandro Orozco. Angel Monagas Estoy de lunes a viernes a las 9 am en la FM 88.1 A PUNTO vía web http://radiofeyalegrianoticias.net y a las 12 del mediodía EXPRESION LIBRE por la FM 88.3 vía web http://eclipse883fm.com Mi twitter @angelmonagas En Barco grande ande o mal ande TAGS:", "external_links": [], "published": "2015-05-30T14:45:00.000+03:00", "crawled": "2015-05-30T14:56:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}