{"organizations": [], "uuid": "23798973e63a235a3d20111215e9ecdefe778f00", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2890150/images/o-MIDDLE-SCHOOL-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/education/blog.xml", "section_title": "Education Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/barack-obama/my-fifthgrade-teacher_b_7176062.html", "country": "US", "title": "My Fifth-Grade Teacher | Barack Obama", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 47, "title_full": "My Fifth-Grade Teacher | Barack Obama", "spam_score": 0.0, "site_type": "blogs", "published": "2015-04-30T04:41:00.000+03:00", "replies_count": 65, "uuid": "e800d4c57e96b6ef180052c8f9201c70dea0f04d"}, "author": "Barack Obama", "url": "http://www.huffingtonpost.com/barack-obama/my-fifthgrade-teacher_b_7176062.html#post-0", "ord_in_thread": 0, "title": "My Fifth-Grade Teacher | Barack Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This post is adapted from an email sent by the president to the White House email list, highlighting the importance of having good teachers on the road to higher education and a brighter future. Share your own \"favorite teacher\" story here and with the hashtags #HpHeartsTeachers and #ThankATeacher.\nI credit my education to Ms. Mabel Hefty just as much as I would any institution of higher learning.\nWhen I entered Ms. Hefty's fifth-grade class at Punahou School in the fall of 1971, I was just a kid with a funny name in a new school, feeling a little out of place, hoping to fit in like anyone else.\nThe first time she called on me, I wished she hadn't. In fact, I wished I were just about anywhere else but at that desk, in that room of children staring at me.\nBut over the course of that year, Ms. Hefty taught me that I had something to say -- not in spite of my differences, but because of them. She made every single student in that class feel special.\nAnd she reinforced that essential value of empathy that my mother and my grandparents had taught me. That is something that I carry with me every day as President.\nThis is the simple and undeniable power of a good teacher. This is a story that every single kid in this country, regardless of background or station in life, should be able to tell. Sharing stories like these helps underline the vital importance of fighting for that reality.\nToday, I honored Shanna Peeples as the 2015 National Teacher of the Year -- and I'd like you to share which teacher, like Ms. Hefty, helped shape your education. You can do that here , or by using the hashtag #ThankATeacher online.\nTomorrow, I'll travel to a local library that serves as a hub of learning in the Anacostia community of Washington, D.C. America's librarians, like our teachers, connect us to books and learning resources that help us dream big. They help ensure that we continue learning throughout our lifetime. And that's something that more kids ought to be able to access.\nSo while I'm at the library, I'll announce new efforts to provide popular books to millions of underprivileged children and young adults around the country and connect more students to their local libraries -- because we know that reading just 20 minutes a day can make a tremendous difference in a student's success. Online, I want you to join the conversation by sharing which book was critical to making you who you are today using the hashtag #BooksForAll. (We all have one.)\nAnd on Friday, as I work on the commencement address I'll deliver at South Dakota's Lake Area Technical Institute next Friday, I want you to share with me how far community college has taken you. For a number of folks on our staff here, it's taken them all the way to the White House.\nThis week, we're focusing on those fundamental people, places, and stories that made us who we are today. So whether it's a teacher who inspired you, a book that changed you, or a college that shaped you -- I want to hear from you. We'll be responding to and sharing your responses all week long.\nI'm looking forward to hearing your stories.\n~ President Barack Obama\nFollow Barack Obama on Twitter: www.twitter.com/BarackObama\nMore: Teachers Teaching Teacher Appreciation Hpheartsteachers", "external_links": ["http://www.twitter.com/BarackObama", "https://www.whitehouse.gov/issues/education/road-to-higher-ed", "https://www.whitehouse.gov/blog/2015/04/29/email-president-obama-my-fifth-grade-teacher"], "published": "2015-04-30T04:41:00.000+03:00", "crawled": "2015-05-01T04:25:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}