{"organizations": [], "uuid": "cb3a42a35377eb733d8a158db29875391a86d85e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/25397/feed", "section_title": "Overnight Defense", "url": "http://thehill.com/policy/defense/overnights/241843-overnight-defense-immigration-fight-hits-house-rules-panel", "country": "US", "title": "OVERNIGHT DEFENSE: Immigration fight hits House Rules panel", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT DEFENSE: Immigration fight hits House Rules panel", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T02:02:00.000+03:00", "replies_count": 0, "uuid": "cb3a42a35377eb733d8a158db29875391a86d85e"}, "author": "mmali@thehill.com (Martin Matishak and Kristina Wong)", "url": "http://thehill.com/policy/defense/overnights/241843-overnight-defense-immigration-fight-hits-house-rules-panel", "ord_in_thread": 0, "title": "OVERNIGHT DEFENSE: Immigration fight hits House Rules panel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT DEFENSE: Immigration fight hits House Rules panel By Martin Matishak and Kristina Wong - 05/12/15 07:02   Both the House and Senate are moving forward on their respective drafts of next year's defense policy bill. \nOver in the House, the powerful Rules Committee will come to order Wednesday to begin considering the nearly 350 amendments that have been filed for that chamber's $612 billion draft of the bill. \nA major point of contention will be language encouraging the military to allow illegal immigrants who qualify for President Obama's deferred deportation program to serve in the military. ADVERTISEMENT The measures have sparked a fight within the GOP, with conservatives pushing for the Rules panel to strip the language from the bill.\nHouse Armed Services Committee Chairman Mac Thornberry (R-Texas) is staying out of the fight. \n\"I do not think that the [national defense authorization act] is the appropriate place to have a big debate over immigration,\" Thornberry said Tuesday during roundtable with reporters \nHowever, the provision, \"doesn't really do anything. It doesn't make any changes to law or anybody's status -- we can't do that in our jurisdiction,\" he added. \n\"But it provokes this bigger debate and we've got enough issues on our plate,\" said Thornberry. \nIn the Senate, the Armed Services Committee held a trio of open but low-key subpanel hearings. The full committee will convene on Wednesday to start hammering out the rest of the massive authorization bill that sets spending limits for all Defense Department programs and initiatives. \nTHORNBERRY KNOCKS SYRIAN REBEL PROGRAM: Thornberry also chided the Defense Department for the speed and size of its effort to train moderate Syrian rebels to combat the Islamic State in Iraq and Syria (ISIS). \n\"I don't think anybody's pleased with the size or the pace or holds any illusions about how much difference this makes in the short- to medium-term,\" he told reporters. \nThe Pentagon said last week that after months of delays, it had finally started the train-and-equip effort -- a major component of President Obama's strategy to defeat ISIS -- starting with around 90 rebel fighters. \nThornberry emphasized that panel members still have \"a lot of questions\" about the train-and-equip effort, especially whether moderates will fight ISIS as they agreed to, or instead battle the Assad regime. \n\"I don't think anybody is seeing this through rose-colored glasses,\" he said, but he added that \"we're not ready to say\" the training effort should be stopped. \nTWO MILITARY AIRCRAFT ACCIDENTS? The U.S military faced two separate incidents involving aircraft on Tuesday. In Nepal, a U.S. military helicopter helping with earthquake relief efforts went missing, while in a separate, unrelated incident a fighter jet crashed in the Persian Gulf. \nThe Huey Helicopter was declared missing near the village of Charikot at around 10 p.m. local time, according to a statement released by the military joint task force coordinating the relief effort. \nSix U.S. Marines and 2 Nepalese were aboard the aircraft and there is currently no indication of a crash. \nNepal suffered a massive 7.3-magnitude earthquake on Tuesday, which came two weeks after a 7.8-magnitude quake in the country that killed thousands of people. \nSeparately, on Tuesday, a U.S. Navy fighter jet crashed Tuesday shortly after launching from an aircraft carrier in the Persian Gulf. \nThe F/A-18F Super Hornet fighter jet took off from the USS Theodore Roosevelt at around 5:30 p.m. local time, going down shortly afterwards. \nThe two personnel onboard ejected from the jet and were recovered by search and rescue crew on the Roosevelt, though the plane was not. \nInitial reports indicate they are both conscious and alert, without serious injury, said a Navy spokesman. \n\"The crash was not a result of hostile activity,\" the spokesman said. \nThe Navy is investigating the cause. \nThe carrier was operating in the northern Persian Gulf, in support of airstrikes against the Islamic State in Iraq and Syria. \nThe F/A-18 belongs to the Strike Fighter Squadron 211 based at Naval Air Station Oceana, Va., and is assigned to Carrier Air Wing One. \nLAWMAKER SAYS BIN LADEN STORY 'IRRELEVANT': Rep. Michael Turner (R-Ohio) on Monday said questions about a report claiming President Obama lied to the public about the 2011 operation that killed Osama bin Laden are \" meaningless .\" \n\"We sought Osama bin Laden, and we brought him to justice. Nothing from unnamed sources or from someone speculating should diminish that story,\" Turner said during an interview on CNN's \"Erin Burnett OutFront.\" \nIn a 10,000-word piece published Sunday in the London Review of Books , journalist Seymour Hersh wrote that Pakistan knew the whereabouts of bin Laden and agreed to hand him off to the United States, which was tipped off to his location. His article claims the raid on the Abbottabad compound was staged. \nTurner said he met with former CIA chief David Petraeus earlier in the day, and he called Hersh's report \"just nonsense.\" \nThe White House has made an all-out effort to trash the piece, with several former administration officials coming to the president's defense. \nTurner also shrugged off an NBC report that made a similar claim about Pakistani intelligence hiding bin Laden in the country. \n\"There has always been suspicion as to what the Pakistanis knew or did not know. But the reality is, that doesn't change the narrative of what the United States undertook and what was accomplished,\" Turner said. \nA former top CIA official also dismissed the story , saying that any Pakistani help to locate Osama bin Laden was \"irrelevant.\" \n\"Look, what I don't know is whether somebody did walk in and say, 'I know where he is,'\" Mike Morell, who served as deputy director of the CIA ahead of the May 2011 raid that killed bin Laden, said on \"Fox and Friends.\" \n\"But I can guarantee you that any information given to us by a walk-in with regard to bin Laden – and there were probably a lot of people who walked in and said, 'I know where he is' – that was completely irrelevant,\" Morell said. \nHe also scoffed at Hersh's suggestion that bin Laden's body was never buried in the sea. \n  Cruz: 'Of course' Iraq was a mistake \n- Governors to Congress: Don't make cuts to National Guard \n- House Chairman frets 'virtually nonexistent' foreign screening \n- White House 'strongly supports' NSA reform bill \n- Ex-aide says Jeb Bush 'misheard' Iraq question", "external_links": [], "published": "2015-05-13T02:02:00.000+03:00", "crawled": "2015-05-13T18:47:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}