{"organizations": [], "uuid": "f3ba956cf1a4abb66f78bc3d77027a737c26faac", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/blog.xml", "section_title": "WorldPost Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/david-harris/eight-words-from-presiden_b_7432244.html", "country": "US", "title": "Eight Words From President Obama | David Harris", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 13, "title_full": "Eight Words From President Obama | David Harris", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-24T23:27:00.000+03:00", "replies_count": 24, "uuid": "0379f7819bf043e4d4b711a6757a69d0ec84a712"}, "author": "David Harris", "url": "http://www.huffingtonpost.com/david-harris/eight-words-from-presiden_b_7432244.html#post-0", "ord_in_thread": 0, "title": "Eight Words From President Obama | David Harris", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Barack Obama delivered a compelling and heartfelt speech on May 22 at a Washington synagogue.\nHe spoke directly to the concerns and aspirations of the Jewish people, identifying himself squarely with Jewish ethical values and the Jewish historical journey as a metaphor for the universal quest for peace and justice.\nWhile not intended as a full-blown policy address, he did touch on the Israeli-Palestinian conflict, asserting:\nJust as Israelis built a state in their homeland, Palestinians have a right to be a free people on their land, as well. Now, I want to emphasize that's not easy. The Palestinians are not the easiest of partners.\nFor starters, like a clear majority of Israelis, I have long believed that the Palestinians have such a right. It would serve not only Palestinian interests but Israeli interests as well, allowing the Jewish state to end an unsought occupation, dating back to 1967, and also shift significantly the demographic balance within its own borders.\nBut there is just one problem, and it is contained in eight words the president expressed: \"The Palestinians are not the easiest of partners.\"\nThe audience's reaction was to laugh right after this sentence. But, of course, it's no laughing matter. Indeed, it's the heart of the issue, and has been for decades.\nI don't say this as a debating point. I'm not trying to win an argument. I have only one obsessive goal: witnessing the day when Israel can live in peace, true and enduring peace, with its neighbors.\nNor do I say this to suggest that Israeli leaders, by their words and actions, have always conducted themselves in exemplary fashion.\nLike politicians everywhere in democratic societies, they are human and, therefore, fallible; they are subject to the demands of the electorate and, in the case of Israel, the rough-and-tumble of coalition building, and they may have 20-20 hindsight but, alas, not 20-20 foresight.\nYet, at the end of the day, the intentions of Palestinian leaders are anything but obvious. Others, from Washington to Brussels, may seek to interpret Palestinian goals. But, in the quest to hasten a solution, they too often ignore, downplay, or rationalize those fundamental elements that would otherwise challenge their assertions.\nFrankly speaking, the Palestinians could have had a state and become \"a free people in their own land\" on multiple occasions, yet, for reasons perhaps best known to their leaders, they chose not to do so.\nTo many, this sounds totally counterintuitive. After all, if the Palestinians have been clamoring for a state of their own and have been offered most of what they allege they want, how could it be that they remain without a nation?\nAnd this is where it gets problematic.\nPalestinian spokesmen and their enablers find every possible means to divert attention from their own substantial responsibility for the current state of affairs. And too often they find receptive audiences, all too ready to believe -- the facts be damned! -- that Israel, the convenient whipping boy, is the sole culprit here.\nBut then how to explain the turndown of the UN recommendation for two states, Jewish and Arab, in Mandatory Palestine in 1947?\nOr the categorical refusal to engage with Israel after the 1967 Six-Day War, when Israel proposed a land-for-peace deal?\nOr the Palestinian unwillingness to learn from the examples of Egypt and Jordan, both of which achieved peace on favorable terms with Israel by acknowledging Israel's right to live in the region?\nOr the flat-out rejection of Prime Minister Ehud Barak's offers, fully supported by President Bill Clinton, in 2000 and again in 2001, for a two-state accord, instead triggering a bloody \"second intifada\" against Israel?\nOr the failure to accept, or even to make a counteroffer, to Prime Minister Ehud Olmert's two-state plan in 2008?\nOr the current Palestinian violations of the 1993 Oslo Accords, by acting unilaterally, circumventing Israel and the bargaining table, and going to UN bodies where the votes are there for the asking?\nOr the frequent Palestinian resort to incitement, incendiary language such as \"genocide,\" and deification of terrorists with the blood of Israeli civilians on their hands?\nOr the inescapable fact that a two-state agreement today is, in any case, rendered virtually impossible because Gaza is in the hands of Hamas, an Iranian-backed terrorist group whose charter calls for the obliteration of Israel, and Mahmoud Abbas' security in the West Bank is anything but assured (even less so without the unheralded help of Israeli security forces)?\nAs a Jew, I understand that seeking peace is at the core of our identity. The words of the prophet Isaiah -- \"And nation shall not lift up sword against nation, nor shall they learn war anymore\" -- define our DNA.\nBut that can't be the start and finish of the discussion. There is a second reality. I wish there weren't, but, alas, it stares us in the face. Invoking the nobility of Jewish values doesn't make it somehow go away.\nPeace requires a partner who genuinely shares the goal of an end to the conflict, who is also ready to compromise for that aim, and who offers reason to believe the future can provide a promising break from the past.\nDoes Israel today have such a partner? The jury -- or is it Jewry? -- is still out. But when Israel does, then peace will become not only possible, but, I dare say, inevitable.\nMore: Israel Barack Obama Israeli Palestinian Conflict Palestinian Authority", "external_links": [], "published": "2015-05-24T23:27:00.000+03:00", "crawled": "2015-05-25T14:45:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}