{"organizations": [], "uuid": "a2a2e9f9ca4eb676c72bd36d010cff812c7ff35e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamaaddress0516.png", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/242295-obama-my-goal-is-creating-opportunity-for-all", "country": "US", "title": "Obama: My goal is 'creating opportunity for all'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: My goal is 'creating opportunity for all'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-16T13:00:00.000+03:00", "replies_count": 0, "uuid": "a2a2e9f9ca4eb676c72bd36d010cff812c7ff35e"}, "author": "esmilowitz@thehill.com (Mark Hensch)", "url": "http://thehill.com/blogs/blog-briefing-room/news/242295-obama-my-goal-is-creating-opportunity-for-all", "ord_in_thread": 0, "title": "Obama: My goal is 'creating opportunity for all'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 16, 2015, 06:00 am Obama: My goal is 'creating opportunity for all' By Mark Hensch President Obama on Saturday described his time in office as a singular quest for improving the possibilities available to everyday Americans. “Everything we’ve done over the past six years has been in pursuit of one overarching goal: creating opportunity for all,” Obama said in his weekly address. Obama cited expanding tax cuts, raising high school graduation rates and ObamaCare as some of the policies he said opened doors for average people. Despite this, he noted the challenges facing a nation as socially diverse as the U.S. “What we’ve long understood is that some communities have consistently had the odds stacked against them,” Obama said. “That’s true of rural communities with chronic poverty,” he said. “That’s true of some manufacturing communities that suffered after the plants they depended on closed their doors. It’s true of some suburbs and inner cities, where jobs can be hard to find and harder to get to.” The president said places lacking economic and employment options turned towards civil strife and violence. “That sense of unfairness and powerlessness has helped to fuel the kind of unrest that we’ve seen in places like Baltimore, Ferguson and New York,” Obama said, referencing recent protests in all three cities. Obama urged Americans to cooperate with one another to ensure bountiful futures for younger generations. The promise of a better tomorrow, he charged, was integral to the American identity. “Whether we are Democrats, Republicans or independents; whether we live in one of our poorest communities, one of our wealthiest, or anywhere in between, we all want our country to be one where hard work pays off and responsibility is rewarded,” Obama said. “We want a place where you can make it if you try,” he said.", "external_links": [], "published": "2015-05-16T13:00:00.000+03:00", "crawled": "2015-05-16T15:52:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}