{"organizations": [], "uuid": "4e94d30787ec891e6b492738dae58c96e6956a2b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/gutierrez_1.jpg", "site_section": "http://thehill.com/taxonomy/term/1752/feed", "section_title": "House", "url": "http://thehill.com/blogs/floor-action/house/242070-dem-compares-gop-immigration-hardliners-to-if-you-give-a-mouse-a", "country": "US", "title": "Dem on GOP's immigration demands: 'If You Give a Mouse a Cookie'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Dem on GOP's immigration demands: 'If You Give a Mouse a Cookie'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-14T19:06:00.000+03:00", "replies_count": 0, "uuid": "4e94d30787ec891e6b492738dae58c96e6956a2b"}, "author": "cmarcos@thehill.com (Cristina Marcos)", "url": "http://thehill.com/blogs/floor-action/house/242070-dem-compares-gop-immigration-hardliners-to-if-you-give-a-mouse-a", "ord_in_thread": 0, "title": "Dem on GOP's immigration demands: 'If You Give a Mouse a Cookie'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 14, 2015, 12:06 pm Dem on GOP's immigration demands: 'If You Give a Mouse a Cookie' By Cristina Marcos \nRep. Luis Gutiérrez (D-Ill.) on Thursday compared House Republicans' constantly shifting demands on immigration to the titular rodent in the classic children's book If You Give a Mouse a Cookie . \nGutiérrez accused GOP immigration hard-liners of forever moving the goalposts. The latest example, he argued, came during debate over the National Defense Authorization Act. \nThe House is slated to vote later Thursday on an amendment from Rep. Mo Brooks (R-Ala.) that would strip out a provision establishing a sense of Congress that the Pentagon should review allowing young illegal immigrants to enlist in the military. Those immigrants would have to possess work authorizations through President Obama's Deferred Action for Childhood Arrivals (DACA) program. ADVERTISEMENT However, a second provision in the bill directs the secretary of Defense to evaluate how allowing DACA recipients to enlist could expand the pool of recruits and impact military readiness and report the results to the House Armed Services Committee.\n\"This all reminds me of the story of the little mouse. I used to read it to my grandson, Luisito — the same story you probably read to your kids or grandkids,\" Gutiérrez said on the House floor. \nIn the book, the mouse first demands milk with his cookie ... and then a straw, mirror, scissors, a broom, a nap, and so on, until, eventually, he wants another cookie. \n\"Anything you give the little mouse is going to lead to a new and bigger request. And that must be what the Speaker of the House feels like with his nativist wing of his party,\" Gutiérrez said. \nThe Illinois Democrat argued that demands starting with more deportations have now reached the point of stripping \"every single reference to anything related to immigrants without papers\" from legislation. \n\"If you give the restrictionists a vote or a hearing on every crazy idea they come up with, you will be relegated as a party to being a provincial party with maybe power in the House of Representatives and maybe from time to time being able to run the Senate. But you'll never win the White House, and you'll never run the Supreme Court,\" Gutiérrez said. \n\"At some point, I respectfully suggest you cut off the mouse’s supply of cookies,\" he concluded. Tags:", "external_links": [], "published": "2015-05-14T19:06:00.000+03:00", "crawled": "2015-05-14T21:33:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}