{"organizations": [], "uuid": "c7f534a425c5cc1d54e371b98c4880f02e098401", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/ashcroft_obama_dunford05052015getty.jpg", "site_section": "http://thehill.com/taxonomy/term/39/feed#", "section_title": "The Hill: Defense Policy", "url": "http://thehill.com/policy/defense/241073-obama-praises-new-military-chiefs-experience", "country": "US", "title": "Obama praises new military chief's experience", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama praises new military chief's experience", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-05T19:35:00.000+03:00", "replies_count": 0, "uuid": "c7f534a425c5cc1d54e371b98c4880f02e098401"}, "author": "iswanson@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/defense/241073-obama-praises-new-military-chiefs-experience", "ord_in_thread": 0, "title": "Obama praises new military chief's experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama praises new military chief's experience Getty Images By Jordan Fabian - 05/05/15 12:35 PM EDT \nPresident Obama on Tuesday announced Marine Gen. Joseph Dunford Jr. as his pick to become chairman of the joint chiefs of staff, praising him as “one of the most admired officers in our military.” \nDuring a Rose Garden ceremony, the president noted Dunford’s combat experience and his reputation for being candid. ADVERTISEMENT “I know Joe. I trust him,” he said. “He’s already proven his ability to give me his unvarnished military advice based on his experience on the ground.”\nIf confirmed by the Senate, Dunford will replace Army Gen. Martin Dempsey, who has served as the president’s top military adviser since 2011. Dunford is currently commandant of the Marine Corps. \nFrom 2013 to 2014, Dunford led coalition forces in Afghanistan; he also led a Marine unit during the 2003 invasion of Iraq. \nWhile at the helm in Afghanistan, Dunford oversaw the drawdown of U.S. combat troops. Troop levels remain a challenge for Obama. In March he announced the withdrawal of additional troops would be delayed to help Kabul fight extremist forces including the Taliban and the Islamic State in Iraq and Syria (ISIS). \nWhile Dunford’s pick signals the administration’s continued focus on battling Islamic extremists in the Middle East, Obama said Dunford will also be charged with overseeing the U.S.’s \"pivot\" to Asia and combating cybersecurity threats. \nThe combat-tested general is widely respected in Congress, paving the way for a smooth confirmation process. \nSenate Armed Services Committee Chairman John McCain (R-Ariz.) applauded Dunford's selection. \n“I've known him very well for many years, and he's an outstanding leader,” McCain said Monday afternoon. “He's a combat veteran. He's a warrior.” \nMcCain, however, predicted the president would not heed Dunford’s counsel. \n“He won’t take their advice and counsel. He won’t. He has taken any of it, so why should he start now?” the Arizona Republican told reporters on Tuesday. \nObama also named Air Force Gen. Paul Selva, commander of the U.S. Transportation Command, as vice chairman of the Joint Chiefs of Staff. \nThe president and the top generals were accompanied by Vice President Biden, Defense Secretary Ash Carter and national security adviser Susan Rice in the Oval Office. \nThe president also praised Dempsey, the outgoing chairman, even though they sometimes differed on whether ground troops were needed to combat ISIS in Iraq and Syria. \nDempsey said in a statement he supported both nominations. \n“I've known General Dunford for almost half of his 39 years of service. He is a phenomenal, combat-tested leader and a man of integrity, courage, and humility,” he said in a statement. \nDempsey called Selva “a leader of competence and character.” \nKristina Wong contributed.", "external_links": [], "published": "2015-05-05T19:35:00.000+03:00", "crawled": "2015-05-06T11:27:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}