{"organizations": [], "uuid": "b698946a1f643e0fd4f06b4b1a6d2b2becea3d32", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/blogs/healthwatch?format=feed&type=rss", "section_title": "The Hill: Healthcare Policy", "url": "http://thehill.com/policy/healthcare/overnights/241404-overnight-healthcare-new-study-could-throw-twist-in-abortion", "country": "US", "title": "OVERNIGHT HEALTHCARE: New study could throw twist in abortion debate", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT HEALTHCARE: New study could throw twist in abortion debate", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-08T01:24:00.000+03:00", "replies_count": 0, "uuid": "b698946a1f643e0fd4f06b4b1a6d2b2becea3d32"}, "author": "psullivan@thehill.com (Peter Sullivan)", "url": "http://thehill.com/policy/healthcare/overnights/241404-overnight-healthcare-new-study-could-throw-twist-in-abortion", "ord_in_thread": 0, "title": "OVERNIGHT HEALTHCARE: New study could throw twist in abortion debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT HEALTHCARE: New study could throw twist in abortion debate By Peter Sullivan - 05/07/15 06:24 PM EDT \nA new study finds that babies are sometimes able to survive when born at just 22 weeks, raising questions for the abortion debate. \nThe study released Thursday in the New England Journal of Medicine finds that 5.1 percent of babies born at 22 weeks were able to survive, and 3.4 percent were able to survive without severe impairments. \nMost of the variation between hospitals in survival rates is due to how heavily they decide to treat these premature babies. ADVERTISEMENT The finding is significant for the abortion debate, where the point of viability for a baby outside the womb is considered to be 24 weeks. This study could be a step in that moving up to 22 weeks. \nDr. Edward Bell, a University of Iowa professor who led the study, told The New York Times that he thinks 22 weeks is the new point of viability. \n\"That's what we think, but this is a pretty controversial area,\" he said. \"I guess we would say that these babies deserve a chance.\" \nThe point of viability is used by the Supreme Court in protecting the right to an abortion. The majority opinion in Planned Parenthood v. Casey in 1992, upholding much of Roe v. Wade , recognized \"the right of the woman to choose to have an abortion before viability and to obtain it without undue interference from the State.\" \nAnd according to the pro-abortion rights Guttmacher Institute, 20 states ban abortions after viability, except in cases involving the life or health of the mother. \nTen states put the ban even earlier, at 20 weeks. However, those bans could be open to legal challenge. \nA 20-week abortion ban in Arizona was struck down by a federal court in 2013 for unconstitutionally violating the Supreme Court ruling protecting abortions up to the point of viability. \nRepublicans in Congress also tried to pass a 20-week abortion ban but had to drop the effort in January after a revolt from female members and centrists. Read more here . \nROVE TO GOP: PUT ASIDE OBAMACARE REPEAL Top Republican strategist Karl Rove says it's time for the GOP to finally stop trying to repeal ObamaCare. \nThe former adviser to George W. Bush wrote in an op-ed for The Wall Street Journal that Republicans need to instead plan for a potential Supreme Court ruling against ObamaCare this summer, which could strip 7.5 million people of their subsidies. \n\"Some Republicans may insist on simply repealing ObamaCare. But doing this would chew up valuable time and give the president a veto opportunity he relishes,\" he wrote. \nRove stressed that GOP leaders needed to quickly build consensus around a single plan for the looming King v. Burwell case, which is expected to be decided next month. He called the implications of the case the \"GOP's healthcare reckoning.\" Read more here . \nWATCHDOG: CALIF. OBAMACARE SITE VULNERABLE California's ObamaCare marketplace did not comply with all federal security requirements and could have been vulnerable to hackers, according to an inspector general report released Thursday. \nThe federal Department of Health and Human Services Inspector General report found that Covered California, the state's ObamaCare marketplace, did have some security measures in place, as of June 2014. \n\"However, it did not always comply with Federal requirements,\" the report states. For example, the marketplace did not perform a \"vulnerability scan\" to identify weaknesses in its systems, in accordance with federal requirements, the IG finds. \nWhile the report notes that there was no evidence that any attacks had actually been able to exploit the weaknesses, the report notes that people's personal information was in danger of being compromised. \n\"The weaknesses were collectively and, in some cases, individually significant and could have potentially compromised the integrity of the marketplace,\" the report states. Read more here . \nState by state \nObama administration's snub of Florida hospital funding has other states on edge \nWhere reproductive rights stand in the states in six maps \nFlorida Gov. Rick Scott asks courts to quickly intervene in ObamaCare spat with HHS \nWhat we're reading \nHow ObamaCare changed health insurance... maybe \nHow five Republicans let Congress keep its fraudulent ObamaCare subsidies \nWhat you might have missed from The Hill \nWealthier Americans are least satisfied by health insurance companies, study finds \nHealth advocates want Obama to call for eating less meat \nHHS chief touts legacy of ObamaCare on mental health \nPlease send tips and comments to Sarah Ferris, sferris@thehill.com , and Peter Sullivan, psullivan@thehill.com . Follow on Twitter: @thehill, @sarahnferris, @PeterSullivan4", "external_links": [], "published": "2015-05-08T01:24:00.000+03:00", "crawled": "2015-05-08T03:43:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}