{"organizations": [], "uuid": "f5b2493b46e17bffb7a0691ed4bb301958bb183f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/clintonhillary_041615getty.jpg", "site_section": "http://thehill.com/taxonomy/term/29/feed#", "section_title": "The Hill: Ballot Box", "url": "http://thehill.com/blogs/ballot-box/presidential-races/243200-hillary-blasts-federal-courts-immigration-decision", "country": "US", "title": "Hillary blasts court’s immigration decision", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Hillary blasts court’s immigration decision", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-27T19:15:00.000+03:00", "replies_count": 0, "uuid": "f5b2493b46e17bffb7a0691ed4bb301958bb183f"}, "author": "kballuck@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/ballot-box/presidential-races/243200-hillary-blasts-federal-courts-immigration-decision", "ord_in_thread": 0, "title": "Hillary blasts court’s immigration decision", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 27, 2015, 12:15 pm Hillary blasts court’s immigration decision By Jordan Fabian Getty \nHillary Clinton on Wednesday blasted a federal appeals court for maintaining a hold on President Obama’s executive actions on immigration. ADVERTISEMENT “5th Circuit is wrong on immigration. @POTUS followed precedent, took steps for families when GOP House wouldn't. Must continue the fight,” Clinton tweeted .\nThe tweet was signed “-H,” indicating it came directly from Clinton and not her campaign staff. \nClinton has taken an aggressive stance on immigration as she ramps up her campaign for president. \nThe Democratic front-runner supports a pathway for citizenship for immigrants living in the U.S. illegally. And if Congress does not act, she said she would go further than Obama in using her executive power to grant deportation relief if elected to the White House. \nThe 5th Circuit Court of Appeals on Tuesday ruled Obama’s program, which would allow parents of U.S. citizens and legal residents to apply for a temporary stay of deportation and work permits, must remain on hold until judges hear an appeal of lower court’s ruling preventing the programs from taking effect. \nClinton has suggested she would set up a similar program for parents of immigrants who were brought to the U.S. illegally as children, also known as DREAMers. \nImmigrant-rights groups and Democrats have warned Republicans that they will suffer at the ballot box in 2016 because of the lawsuit, which was filed by 26 GOP-led states. \n“As we look to 2016, those contenders who continue to block or flip flop on immigration reform must know that the immigrant vote will remember,” Debbie Smith, associate general counsel for the Service Employees International Union, told reporters Tuesday. \nBut the court ruling could also fire up Republicans who believe Obama overstepped his constitutional authority when he announced the programs. \nRepublican National Committee spokeswoman Ruth Guerra said the 5th Circuit’s decision “should come as no surprise to President Obama, who admitted over 22 times he didn’t have the legal authority to take this politically-motivated action or to Hillary Clinton who’d like to go further.” Tags:", "external_links": [], "published": "2015-05-27T19:15:00.000+03:00", "crawled": "2015-05-28T04:21:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}