{"organizations": [], "uuid": "0bf1b1466f89d8ba54fd20d1ea26a055443b6004", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/1752/feed", "section_title": "House", "url": "http://thehill.com/policy/defense/241779-house-armed-services-chief-declines-to-pick-side-in-immigration-fight", "country": "US", "title": "House Armed Services chief declines to pick side in immigration fight", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House Armed Services chief declines to pick side in immigration fight", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-12T21:26:00.000+03:00", "replies_count": 0, "uuid": "0bf1b1466f89d8ba54fd20d1ea26a055443b6004"}, "author": "mmatishak@thehill.com (Martin Matishak)", "url": "http://thehill.com/policy/defense/241779-house-armed-services-chief-declines-to-pick-side-in-immigration-fight", "ord_in_thread": 0, "title": "House Armed Services chief declines to pick side in immigration fight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House Armed Services chief declines to pick side in immigration fight By Martin Matishak - 05/12/15 02:26 PM EDT \nThe head of the House Armed Services Committee on Tuesday said House GOP leaders will have to determine what happens next in the fight over whether illegal immigrants should be able to serve in the military. \nChairman Mac Thornberry (R-Texas) said House leaders and the Rules Committee will have to “sort out” whether to eliminate a provision by Rep. Ruben Gallego (D-Ariz.) from the defense authorization bill that encourages the secretary of Defense to review allowing recipients of President Obama’s Deferred Action for Childhood Arrivals (DACA) program to serve in the armed forces. \n“I do not think that the [national defense authorization act] is the appropriate place to have a big debate over immigration,” Thornberry said Tuesday during roundtable with reporters, repeating a the argument he made when the panel held its marathon markup session earlier this month. \nHowever, Gallego’s provision, which Thornberry voted against, “doesn’t really do anything. It doesn’t make any changes to law or anybody’s status — we can’t do that in our jurisdiction.” \n“But it provokes this bigger debate and we’ve got enough issues on our plate,” he added. “I would prefer it not be a part of our bill but there was a close vote in committee, so how that gets handled on the floor is really going to be up” Rules Committee chairman Pete Sessions (R-Texas). \nLast week Rep. Mo Brooks (R-Ala.) and 24 other GOP members sent a letter to Sessions asking the panel to strike the DACA language before the bill reaches the House floor. \nBrooks also submitted an amendment to the defense blueprint that would nix Gallego’s provision. \nGallego, in turn, sent a letter of his own to Sessions and House Speaker John Boehner (R-Ohio) demanding that the language be kept in the bill, arguing that such a move be part of floor debate on the legislation rather than stripped out earlier. \nThe Rules Committee is set to meet Wednesday to begin consideration of the nearly 350 amendments members filed to the authorization bill. \nThe measure is expected to hit the House floor Thursday, with a vote on final passage expected some time Friday.", "external_links": [], "published": "2015-05-12T21:26:00.000+03:00", "crawled": "2015-05-12T23:35:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}