{"organizations": [], "uuid": "49267682e6953c52b900eb3468b9c479626de00c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2895944/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/green/blog.xml", "section_title": "Green Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/kassie-siegel/president-obama-must-conf_b_7187134.html", "country": "US", "title": "President Obama Must Confront His Own Climate Denial | Kassie Siegel", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 11, "title_full": "President Obama Must Confront His Own Climate Denial | Kassie Siegel", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T22:10:00.000+03:00", "replies_count": 35, "uuid": "6e9f4265411827c783f2c64107518124d73ca673"}, "author": "Kassie Siegel", "url": "http://www.huffingtonpost.com/kassie-siegel/president-obama-must-conf_b_7187134.html#post-0", "ord_in_thread": 0, "title": "President Obama Must Confront His Own Climate Denial | Kassie Siegel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Standing in the Florida Everglades during a record-breaking spring heat wave this April, President Barack Obama didn't mince words. \"Climate change can no longer be denied,\" the president said. \"And action can no longer be delayed.\"\nDays later, Secretary of State John Kerry joined his boss in criticizing climate denial and inaction. Kerry even called for a grassroots movement to give world leaders \"the political will\" needed to respond to the climate crisis.\nBut climate denial takes many forms. Even as President Obama rightly deplores global warming's threats to human well-being and our planet's web of life , his administration is opening up more public lands for dirty fossil fuel production and weakening international efforts to cut planet-warming pollution.\nPresident Obama pushed every country going to this year's Paris climate talks to propose a greenhouse gas reduction goal. But then the president himself announced a weak national plan that scientists say just won't reduce our pollution enough to help prevent catastrophic warming.\nUnder the Obama national plan, America would still be spewing at least 5 billion metric tons of greenhouse gas pollution a year by 2025 -- far more than entire continent of Africa emits now. And to make matters worse, the plan is just a goal, not the enforceable commitment that we need.\nThe U.S. and other developed countries must cut pollution much more to do their fair share in helping to avoid a climate catastrophe, according to calculations by a team of scientists.\nOn the home front, the Obama administration has been moving quickly to turn more of our public lands and offshore coastal areas over to private companies for drilling, mining and fracking.\nHundreds of thousands of acres of federal land have been leased for coal mining . Onshore oil production on public and tribal lands has increased more than 80 percent since 2008, according to Interior Secretary Sally Jewell . Ninety percent of new wells on federal land are now fracked .\nThe administration even allocated 810,000 acres of U.S. public land for oil shale and tar sands leasing in the Colorado River Basin -- a grave blow to the climate, since these are among the dirtiest, most carbon-intensive fuels on earth.\nOur oceans are also fair game. Secretary Jewell recently pledged to open \"vast areas\" of the ocean to oil drilling. She has put Arctic drilling back on the table, backed oil exploration along the Atlantic coast, and is opening up tens of millions of acres in the Gulf of Mexico for new drilling and offshore fracking.\nOur planet pays the price. A recent report estimated that planet-warming pollution from fossil fuel leasing on federal lands and waters accounts for more than one-fifth of our nation's greenhouse gas emissions.\nThis fossil-fuel frenzy just isn't compatible with climate protection -- or with the Obama administration's strong words on the risks of global warming.\nBut there's also good news. The global movement for climate action called for by Secretary Kerry? That already exists.\nFour hundred thousand people marched through New York City last September ahead of the United Nations climate change meeting there. Hundreds of thousands more will protest at the upcoming talks in Paris.\nAnd that movement is calling on the Obama administration to support adequate, binding pollution cuts, to leave the majority of dirty fossil fuels in the ground, and compensate those already suffering the greatest loss from climate change.\nPeople around the world understand perfectly that climate disruption endangers our food supplies, our coastal cities and everything we hold dear. They want the White House to stop denying that much more ambitious action is needed to preserve a livable climate.\nNow it's time for President Obama and other leaders to listen -- and to act.\nFollow Kassie Siegel on Twitter: www.twitter.com/CBD_Climate\nMore: Barack Obama Climate Change Sally Jewell Fracking Paris Climate Change United Nations Carbon Emissions", "external_links": ["http://www.doi.gov/news/speeches/loader.cfm?csModule=security/getfile&pageid=1014220", "http://climateactiontracker.org/publications/briefing/155/Below-2C-or-1.5C-depends-on-rapid-action-from-both-Annex-I-and-non-Annex-I-countries.html", "http://www.biologicaldiversity.org/news/press_releases/2015/carbon-pollution-03-31-2015.html", "http://www.twitter.com/CBD_Climate", "http://www.reuters.com/article/2014/07/22/us-usa-utah-tarsands-idUSKBN0FR02H20140722", "http://wilderness.org/sites/default/files/Stratus-Report.pdf", "http://www.blm.gov/wo/st/en/prog/energy/coal_and_non-energy/coal_lease_table.html", "http://www.blm.gov/wo/st/en/info/newsroom/2015/march/nr_03_20_2015.html", "http://www.nytimes.com/2015/05/05/science/new-estimates-for-extinctions-global-warming-could-cause.html?smid=fb-nytimes&smtyp=cur&bicmp=AD&bicmlukp=WT.mc_id&bicmst=1409232722000&bicmet=1419773522000", "http://www.usatoday.com/story/opinion/2015/04/21/earth-day-2015-john-kerry-climate-change-column/26070603/", "http://www.slate.com/articles/health_and_science/science/2015/04/obama_s_earth_day_speech_the_everglades_is_losing_to_climate_change.html", "http://blog.seattlepi.com/seattlepolitics/2015/03/17/jewell-vast-areas-for-offshore-oil-drilling-with-care/"], "published": "2015-05-01T22:10:00.000+03:00", "crawled": "2015-05-02T08:38:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}