{"organizations": [], "uuid": "6600bf4eecc4fff0db7a3f949164c1ed360608af", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/immigration_getty_2014.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/blogs/blog-briefing-room/241471-feds-issued-2k-expanded-immigration-permits-after-court-order", "country": "US", "title": "Feds issued 2K expanded immigration permits after court order", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Feds issued 2K expanded immigration permits after court order", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-08T21:28:00.000+03:00", "replies_count": 0, "uuid": "6600bf4eecc4fff0db7a3f949164c1ed360608af"}, "author": "Ben Kamisar", "url": "http://thehill.com/blogs/blog-briefing-room/241471-feds-issued-2k-expanded-immigration-permits-after-court-order", "ord_in_thread": 0, "title": "Feds issued 2K expanded immigration permits after court order", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 08, 2015, 02:28 pm Feds issued 2K expanded immigration permits after court order Getty Images \nThe government \"erroneously\" doled out about 2,000 expanded immigrant work permit authorizations under President Obama's controversial executive actions, even after a federal judge blocked the move, the Justice Department says. \n“The Government sincerely regrets these circumstances and is taking immediate steps to remedy these erroneous three-year terms,” the Department of Justice wrote in a court advisory filed late Thursday in the Southern District of Texas. ADVERTISEMENT The advisory comes after District Court Judge Andrew Hanen halted the implementation of the executive actions, which defer deportations for immigrants living in the U.S. illegally and provide them with expanded access to work permits, until the courts could decide whether the policies are constitutional.\nWhile the old policies authorize a two-year renewal of work permits under the Deferred Action for Childhood Arrivals program, the new program would allow for a three-year renewal. \nThe DOJ added in the advisory that the Department of Homeland Security is “converting” the three-year renewals into two-year terms and that DHS Secretary Jeh Johnson has asked the agency’s inspector general to investigate. \nA group of states, led by Texas, has sued the administration, claiming that the executive actions are a constitutional overreach by the president. \nThis is not the first time the Justice Department issued a clarification to the court. In March, it admitted that the government granted 100,000 of these expanded work permit renewals to illegal immigrants under the president’s new program before the court decision. \nJohnson announced the department’s intent to issue three-year expansions immediately in a November memo. But DOJ lawyers told the court the agency wouldn’t be processing any new applications until mid-February, which the government admitted could have led to “confusion.” \nHanen ruled against lifting his hold on the immigration actions in April, accusing the government of misleading the court by issuing those expanded work permits. \nA federal appeals court heard oral arguments on whether to lift the hold in April. Both sides are currently awaiting a decision in that case.", "external_links": [], "published": "2015-05-08T21:28:00.000+03:00", "crawled": "2015-05-08T22:56:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}