{"organizations": [], "uuid": "8f7ac03d7461357fb303640c9258763a18083583", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2258560/images/o-IMMIGRATION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/bronwyn-lea/what-you-dont-know-about-immigration_b_7216388.html", "country": "US", "title": "What You Don't Know About Immigration | Bronwyn Lea", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "What You Don't Know About Immigration | Bronwyn Lea", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-06T01:36:00.000+03:00", "replies_count": 0, "uuid": "8f7ac03d7461357fb303640c9258763a18083583"}, "author": "Bronwyn Lea", "url": "http://www.huffingtonpost.com/bronwyn-lea/what-you-dont-know-about-immigration_b_7216388.html", "ord_in_thread": 0, "title": "What You Don't Know About Immigration | Bronwyn Lea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In the 10 years I have lived in the United States, people have often been shocked when I tell them that not only do I not have a green card, but that I couldn't get one even if I tried.\nI would love to be the holder of a green card -- that elusive piece of paper which would grant me the right to remain in the U.S. indefinitely -- but as it is, I don't and can't qualify. There is not a single category under which I can legally apply for permanent residence.\nThis is shocking to many, perhaps because I defy some of the stereotypes about immigrants and immigration laws. After all, I am English-speaking and hold two graduate degrees. I am white, I am a committed member of my church, I have three children who are natural-born American citizens. I volunteer on the PTA, I do community service. I have both the skills and the desire to work, but when people want to pay me for writing or speaking, I have to decline. My visa status allows me to volunteer, but not to earn any income. (This strikes me as a pity, because I would so gladly pay taxes on any income I could earn. The perks of living in a country like the U.S. are well worth the taxes, if you ask me.)\nThis is what I want you to know about immigration: being English-speaking, privileged, white, skilled, educated, hard-working, legally above-board and socially respectable are not enough to apply for residence in the U.S.\nAs it turns out, there are very few categories under which one can apply for permanent residence, and unless your employer is sponsoring you or you are marrying in, you have to be a bit of an über-mensch (as in, a scholar of international standing, a Pulitzer prize winner, an Olympic athlete, to name some of the examples listed on the website) to qualify.\nI am none of these things.\nBut, I have hitched my wagon to a man who holds a PhD in Engineering from a well-respected U.S. university and works in research that affects the spending of millions of tax dollars. Our immigration attorneys tell us they are \"hopeful\" that his application will be successful. No guarantees. But all our eggs are in that one basket, and if he gets a green card, I -- his loving wife and maker of the sandwiches -- can have one too.\nUntil the day we have permanent residence, though, I live under the constant threat that something will happen: Funding will be cut and my husband will lose his job/ he will get hit by a driver who is texting/ he will have a heart attack -- and I would instantly lose my status as a legal alien in the U.S. I would have no grounds to apply to stay on my own merit. I would have to leave the country immediately, without time to pack up our house or bury my loved ones, and I would have to pull my American children from their schools and therapies and take them back to a country where they would then become immigrant kids.\nUntil the day we have green cards, I live under the constant threat of being \"randomly\" pulled over for hours of questioning in arrivals halls at airports (Not being paranoid. This has happened.) I live with the fear that an official will make a notation on one of our pieces of paper which we don't understand or don't notice, but which jeopardizes the legality of our stay here and requires us to leave the country to fix it (Not being paranoid. This just happened to us, too). We have been finger -printed, retina-scanned, swabbed and searched; we have submitted documents detailing every place we have every worked and studied, every address of every member of our families worldwide. (This has happened. Who is paranoid?)\nWe have spent hundreds of hours and thousands of dollars trying to stay legal and keep our paperwork current -- but still, as immigrants we live aware that something unforeseen and uncontrollable could happen to our visa status, and we would be vulnerable. Fleeing. Homeless.\nI am a legal, documented and in-every-way-welcomed-by-our-community immigrant, and yet I want you to know that being an immigrant still means I live with the fear that our paperwork is a house of cards, just waiting to come tumbling down. I am afraid of losing my home. I am afraid of being separated from my children. I am afraid that we will have spent 10 years trying to build a life here, and still we will lose everything.\nTo be an immigrant is to be vulnerable. And if I, as a legal immigrant, feel vulnerable -- how much more so are those who have a black mark against their record that they feel powerless to erase?\nTo be an immigrant is to fear. And if I, as a legal immigrant, feel scared -- how much more so are those who would not just have to leave, but who would be punished?\nTo be an immigrant is to risk being unexpectedly wrenched from your family. And if I, as a legal immigrant, fear this, how much more do others?\nI'm not justifying illegal immigration. We have done everything we can to stay and be legal in our efforts, and we would do everything we can to encourage and others to be documented, rather than undocumented, workers.\nBut I do want you to know that being allowed to stay in this beautiful land of opportunity is far tougher and more complicated than you might think. The laws which protect the U.S.'s borders are the same laws which apply to our family. Even though we don't \"look\" like immigrants, we are.\nWhen people talk with us about immigration and hear our story, sometimes they say, \"Oh, we're not talking about you... We're talking about all those who came here illegally.\" They say, \"They shouldn't be rewarded for their crimes with citizenship.\" They say, \"If they want to move to the U.S., they should do it legally and just get in line.\"\nWhat I want you to know is that there is no line . Immigration is not like Disneyland, where if you pay enough money and queue patiently for several hours, anyone can ride Space Mountain. There is not a single line that I can stand in on my own merit. Even with language and education and money and privilege aplenty, even though I don't come from India or China or Mexico, there is no line for me. So, I'm holding my husband's hand while he stands in that elusive, exclusive line; and we're hoping for the best.\nIn the meanwhile, I'm telling my story because, unlike so many others who know the vulnerability and fear of living as an immigrant, my speaking out doesn't put my status in the U.S. at risk. I am one of a smaller group who have experienced just how narrow and broken the immigration laws can be, but who can speak about it without fear of being discovered and deported.\nI want you to know what it's like to be an immigrant because perhaps you, like so many of the wonderful, thoughtful people we have come to know in the US, will hear our story and say, \"I had no idea,\" and \"I'm so sorry,\" and \"Whoa! That's so much more broken than I realized.\"\nMaybe you didn't know these things. We certainly didn't when we first came. The system is complex and deeply flawed. And so, I thought you should know.\nThis post first appeared here . Follow Bronwyn Lea on Facebook .\nFollow Bronwyn Lea on Twitter: www.twitter.com/bronleatweets\nMore: Immigration Immigration Reform Illegal Immigrants", "external_links": ["https://www.facebook.com/bronleablog", "http://www.twitter.com/bronleatweets", "http://bronlea.com/2015/05/05/what-you-dont-know-about-immigration/"], "published": "2015-05-06T01:36:00.000+03:00", "crawled": "2015-05-06T01:20:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}