{"organizations": [], "uuid": "b4669fd9a7dd7e15eed00d6eccbcc9c6b9f58e1d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/ryanpaul_030614gn_0.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/243305-paul-ryan-trade-bill-holds-obama-accountable", "country": "US", "title": "Paul Ryan: Trade bill would hold Obama 'accountable'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Paul Ryan: Trade bill would hold Obama 'accountable'", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-28T18:04:00.000+03:00", "replies_count": 0, "uuid": "b4669fd9a7dd7e15eed00d6eccbcc9c6b9f58e1d"}, "author": "mmali@thehill.com (Mark Hensch)", "url": "http://thehill.com/policy/finance/243305-paul-ryan-trade-bill-holds-obama-accountable", "ord_in_thread": 0, "title": "Paul Ryan: Trade bill would hold Obama 'accountable'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Ryan: Trade bill would hold Obama 'accountable' Greg Nash By Mark Hensch - 05/28/15 11:04 AM EDT \nPassage of fast-track negotiating authority for trade deals would hold President Obama “accountable,” Rep. Paul Ryan (R-Wis.) argued on Thursday. \n“Congress needs to show the world that even though the president doesn’t always follow through, it can still rely on America,” Ryan wrote in an op-ed for Fox News titled “Trade Promotion Authority will rebuild U.S. credibility.” ADVERTISEMENT “And given the state of affairs, establishing TPA would be a real sign of seriousness,” Ryan said of the powers, also known as trade promotion authority (TPA).\nTPA would let Obama negotiate international trade deals that Congress could not then amend or filibuster. \nIt would instead approve or reject potential pacts in a straight up-or-down vote. \nPassage of the bill is seen as critical for finishing a sweeping trade pact known as the Trans-Pacific Partnership. \nBut while a TPA bill passed the Senate last week, it is facing a tougher climb in the House, where the majority of Democrats are firmly opposed. \nThe liberal opposition, combined with skepticism on the right about providing Obama with new powers, has left Ryan and other supporters of TPA needing every vote they can get. \nRyan urged House lawmakers considering the controversial measures not to let distrust of Obama cloud their judgment. \n“TPA doesn’t give the president more authority,” Ryan wrote. “TPA holds the president accountable.” \n“The world is writing the rules of the global economy right now,” he said. \n“Either we seize this opportunity, or we will lose it,” Ryan added. \nA Reuters/Ipsos poll released on Wednesday found that a majority of Americans are eager for new trade deals. It found that 56 percent of respondents support new agreements promoting the sale of U.S. goods overseas, while 13 percent do not. Another 31 percent were undecided. \nThe poll did not specifically ask participants about TPA or the Trans-Pacific Partnership, focusing instead on broader international deals in general. \nRyan also said TPA is crucial for protecting U.S. interests during ongoing trade negotiations with the European Union and the coalition of Pacific Rim nations. \nHe charged allowing Congress to approve a trade deal but not amend it helps Obama secure deals more favorable to everyday Americans. \n“And this division of power makes other countries think twice,” Ryan wrote of Congress supporting Obama on trade. \n“They don’t want to make concessions to the administration only to see Congress rewrite the deal,” he said. \nRyan additionally said that better trade deals would help the U.S. dictate the rules of marketplaces abroad. \nIn turn, this would give American workers a “fair deal,” he added. \n“Opening up other countries’ markets to the U.S. binds them together — because when the U.S. grows, they grow,” Ryan wrote.", "external_links": [], "published": "2015-05-28T18:04:00.000+03:00", "crawled": "2015-05-28T21:08:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}