{"organizations": [], "uuid": "0a73a2a9aa76d69444d692983f1c5588f6cebabc", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/17/feed", "section_title": "The Hill: Congress Blog", "url": "http://thehill.com/blogs/congress-blog/labor/241098-the-obama-administrations-anti-worker-anti-business-agenda", "country": "US", "title": "The Obama administration’s anti-worker, anti-business agenda", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "The Obama administration’s anti-worker, anti-business agenda", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-07T00:00:00.000+03:00", "replies_count": 0, "uuid": "0a73a2a9aa76d69444d692983f1c5588f6cebabc"}, "author": "jpicard@thehill.com (Heather Greenaway)", "url": "http://thehill.com/blogs/congress-blog/labor/241098-the-obama-administrations-anti-worker-anti-business-agenda", "ord_in_thread": 0, "title": "The Obama administration’s anti-worker, anti-business agenda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 06, 2015, 05:00 pm The Obama administration’s anti-worker, anti-business agenda By Heather Greenaway \nAt a time of economic uncertainty, the Obama administration continues to endorse and even promote anti-business practices. In April, a new rule by the National Labor Relations (NLRB) board came online that would significantly tighten the amount of time required to hold union elections. \nThe “ambush” election ruling comes on the heels of a decision to allow “micro-unions” giving small groups of workers the ability to form collective bargaining units, upending decades of labor law in a giveaway to union bosses. Both of these renderings take away workers’ rights and drive up costs for businesses. ADVERTISEMENT After receiving over $1 billion in campaign donations from Big Labor in 2008 and 2012, President Obama has consistently supported policies that aid union bosses, while undercutting job creators and workers. With union membership steadily declining in recent years, Big Labor is desperate to do anything to boost its membership rolls. \nThe “ambush” election ruling reduces the time required for union elections from an average of 38 days to as few as 11 days. Between 2004 and 2014, elections that took place within 36 to 42 days favored labor 60 percent of the time compared to 86 percent for elections held in under 21 days. It’s not hard to understand why union bosses have been pushing for the rule change. \nTo make matters worse, businesses are now required to give union organizers an unprecedented amount of information about their workers, including shift times, work locations and personal contact information such as home addresses and cell phone numbers. Labor bosses have already proven they are willing to go to great lengths to coerce workers to support union formation, including harassing employees at their homes. Now, with this additional information, union organizers will be able to harass employees on the job in front of their co-workers and at their homes in front of their families, while at the same time calling and emailing them. The rule is not fair to individuals who just want to make a living; instead, it makes serves as an undue burden. \nWorkers are not the only ones who are hurt by the “ambush” election ruling. Small businesses, that often do not have in-house lawyers to deal with complex labor issues, will have little or no time to get sufficient legal advice to ensure they are complying with the new rules. Additionally, the employers’ automatic right to a post-election NLRB review is abolished, replaced by discretionary reviews. This clearly benefits union bosses who will have a less oversight of their suspect practices. \nThe micro-union decision reached by Obama’s Labor Board also benefits union bosses by allowing them to organize small segments of a business and gain a foothold in a firm. Micro-unions will make businesses less efficient and negatively impact worker cohesion, which will have a disproportionate impact on the retail industry. \nMicro-unions sow discontent within companies as groups of workers compete with each other for favorable contract terms and benefits resulting in increased acrimony and red tape. This will make the management of small businesses increasingly difficult due to increased costs forcing some employers to either close their doors or increase prices on goods they sell or produce. \n“Ambush” elections and micro-unions subvert the rights of workers by tipping the scales in favor of desperate union bosses. The Congress should continue to fight Obama’s Labor Board by seeking to pass legislation undoing their giveaways to union bosses or eliminating the funding which enables them to undertake these harmful policies. \nOur government should stand up for the rights of everyone, including employees and employers. Capitulating to union bosses at the expense of workers’ rights is not the role of a government agency funded by our taxpayer dollars. \nGreenaway is a spokesperson for the Workforce Fairness Institute (WFI), a business-funded, anti-union organization.", "external_links": [], "published": "2015-05-07T00:00:00.000+03:00", "crawled": "2015-05-07T00:43:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}