{"organizations": [], "uuid": "607321ea67abdef73ffde3708e488f882f6358c9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/blogs/blog-briefing-room/240660-obama-names-new-usaid-chief", "country": "", "title": "Obama names new USAID chief | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama names new USAID chief | TheHill", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "607321ea67abdef73ffde3708e488f882f6358c9"}, "author": "", "url": "http://thehill.com/blogs/blog-briefing-room/240660-obama-names-new-usaid-chief", "ord_in_thread": 0, "title": "Obama names new USAID chief | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "April 30, 2015, 01:18 pm Obama names new USAID chief By Jordan Fabian \nPresident Obama will nominate Gayle Smith, a senior National Security Council official, to lead the U.S. Agency for International Development (USAID), the White House said Thursday. \nSmith would replace Rajiv Shah, who left the foreign civilian aid agency in February after serving as its chief since 2009. ADVERTISEMENT She has decades of experience working in African development and also served in the Clinton administration and with non-governmental organizations. USAID has helped lead the country’s overseas response to the Ebola crisis in Africa.\nShah was well-liked by both parties on Capitol Hill for his focus on smarter spending and enlisting private businesses to run agency projects in order to keep costs down. \nBut the agency has faced scrutiny over its covert propaganda efforts to use hip-hop artists and a Twitter-like social media platform to promote democracy in Cuba. \nObama said Smith has his “full confidence” and said she would be an outstanding leader for the agency. \n“Gayle’s energy and passion have been instrumental in guiding America’s international development policy, responding to a record number of humanitarian crises worldwide, and ensuring that development remains at the forefront of the national security agenda at a time when USAID is more indispensable than ever,” he said in a statement. Thousands of new Lerner emails... Congressional committees say an inspector general found roughly 6,400... Baltimore mom praised for smacking... \"I don't want him to be a Freddie Gray,\" Toya Graham said. Faith leaders demand that liberal... Scott Lively slammed Justices Kagan and Ginsburg for officiating same-sex... Brent Budowsky: Holy war against... OPINION | Republicans lead a party that looks like little more than an... Internet up in arms over '... An activist was seemingly plucked off the streets in full view of news... Dems hammer Japanese prime... Honda said Abe's \"refusal to squarely face history\" is an insult to so-... GOP unveils budget deal that seeks... The deal would approve more than $5 trillion in spending cuts over a... Baltimore teen disciplined by mom... \"I understand how much my mama really cares about me,” Michael Singleton... Sanders to launch presidential bid The independent senator will enter the Democratic fray Thursday to... Obama accidentally crashes WH... The president walked in on some of the journalists who cover him having... Young voters want a Democrat in... A poll of millennials shows a Democrat has wide support among 18-29-year-... Senators clash over Iran votes Democrats are warning that all bets are off if controversial amendments... Justice Kennedy doesn't reveal... The Supreme Court's most frequent swing vote sent mixed messages Tuesday. Dem to bring Korean 'comfort woman... Rep. Mike Honda (D-Calif.) has the Japan government of failing to own up... Senators vote to block EPA’s use... A Senate committee voted Tuesday to prohibit the Environmental Protection... Reid: 'Journalism doesn't exist' Reid hailed a man who peddled a false story about the minority leader... How Jeb Bush will win in 2016 Bush will find only one path to victory in 2016: through his brother,... Paul blames 'breakdown in the... '16 GOP hopeful says there are \"root, cultural causes\" for violence but \"... Carson slams rioters: 'It makes no... “Reacting out of anger seldom leads to anything helpful,” the possible... Sanders: ‘I am running for... The Vermont Independent told the AP he was all-in for 2016 on Wednesday. ", "external_links": [], "published": "2015-05-01T03:00:00.000+03:00", "crawled": "2015-05-01T11:31:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}