{"organizations": [], "uuid": "97dad34c9e3a1420cb90f08d461d6c7ad8f6c952", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamasaudi.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/blogs/blog-briefing-room/news/242155-obama-seeks-to-reassure-gulf-states-with-new-joint-security", "country": "US", "title": "Obama seeks to reassure Gulf states with new joint security measures", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama seeks to reassure Gulf states with new joint security measures", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-15T01:00:00.000+03:00", "replies_count": 0, "uuid": "97dad34c9e3a1420cb90f08d461d6c7ad8f6c952"}, "author": "Jordan Fabian", "url": "http://thehill.com/blogs/blog-briefing-room/news/242155-obama-seeks-to-reassure-gulf-states-with-new-joint-security", "ord_in_thread": 0, "title": "Obama seeks to reassure Gulf states with new joint security measures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 14, 2015, 06:00 pm Obama seeks to reassure Gulf states with new joint security measures By Jordan Fabian Getty Images \nPresident Obama on Thursday announced a series of new security initiatives designed to reassure Gulf state allies who are concerned about threats posed by Iran as the U.S. attempts to finalize a nuclear agreement with Tehran. \nBut the announcement fell short of the demands of some Gulf Cooperation Council (GCC) nations, which wanted the United States to put security commitments in writing as part of a binding mutual defense treaty. ADVERTISEMENT During a one-day summit at Camp David, the leaders discussed a new partnership to speed up arms sales and bolster counterterrorism operations, according to a joint statement. They agreed to conduct joint, large-scale military training exercises and create a regional ballistic missile defense system.\nThe U.S. also reaffirmed it would be prepared to use military force to protect Gulf states against “external threats.” \n“I was very explicit that the United States will stand by our GCC partners against external attack,” Obama told reporters. “We want to make sure that this is not just a photo op, but a concrete series of steps.” \nThe president said he agreed to meet with high-level Gulf state leaders again next year. \nThe president held a whirlwind day of meetings at Camp David with leaders from Saudi Arabia, Bahrain, Qatar, Oman, Kuwait and the United Arab Emirates. \nThose nations worry a nuclear deal with Iran would embolden their Shiite rival and allow it to boost its influence in the Middle East. \nExpectations for the summit were lowered earlier this week, when it was announced the highest-ranking leaders of just two of the six nations would attend. \nSaudi Arabia’s King Salman dropped out of the meeting on Monday after being previously scheduled to attend. Crown Prince Mohammed bin Nayef, the Saudi interior minister, and Deputy Crown Prince Mohammed bin Salman, the defense minister, participated instead. \nKing Hamad bin Issa al-Khalifa of Bahrain reportedly skipped the summit in favor of a horse show with the Queen Elizabeth II of Britain. \nThe White House downplayed the absences, saying all nations sent influential top officials. \nObama said the leaders discussed Iran’s “destabilizing activities in the region.” The meeting came on the same day Iranian ships reportedly fired on a Singapore-flagged cargo ship in the Persian Gulf. The U.S. agreed to increase training and technical assistance for Gulf states' coastal security. \nThe leaders also agreed to boost cooperation in combating extremist groups such as the Islamic State and al Qaeda in the Arabian Peninsula. They also discussed the conflict in Yemen, where the U.S. backed a Saudi-led air campaign against Houthi rebels supported by Iran. \nThe summit was called last month after the U.S. and five other world powers reached a framework agreement with Iran that would curb its nuclear program in exchange for sanctions relief. \nThe White House views the deal as a key component of Obama’s second-term legacy. Negotiators have set a deadline of June 30 to reach a final agreement. Tags:", "external_links": [], "published": "2015-05-15T01:00:00.000+03:00", "crawled": "2015-05-15T01:15:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}