{"organizations": [], "uuid": "e718a1a7c37915283fbeae0c4f212b5a998b5f13", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/paul-alexander/obama-saying-so-long-to-g_b_7451408.html", "country": "US", "title": "Obama Saying So Long to Green Biofuels? | Paul Alexander", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Saying So Long to Green Biofuels? | Paul Alexander", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-28T01:26:00.000+03:00", "replies_count": 0, "uuid": "e718a1a7c37915283fbeae0c4f212b5a998b5f13"}, "author": "Paul Alexander", "url": "http://www.huffingtonpost.com/paul-alexander/obama-saying-so-long-to-g_b_7451408.html", "ord_in_thread": 0, "title": "Obama Saying So Long to Green Biofuels? | Paul Alexander", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In the seventh year of his presidency, Barack Obama is being forced to defend himself against the unusual charge that he's not progressive -- or at least not progressive enough. Forget that in the past critics have called him a socialist . His advocacy of the Trans-Pacific Partnership (TPP), a secret 12-nation trade deal for which he's attempting to secure fast-track approval from the United States Congress, has prompted progressives to claim he has sold out to the corporate establishment.\nTo be sure, on TPP, Obama has found support from a new constituency for him -- Republicans. \"The president has done an excellent job on this,\" Senate Majority Leader Mitch McConnell said -- a rare endorsement offered by the Republican powerbroker. Meanwhile, Senator Elizabeth Warren, speaking on behalf of progressives and workers unions, launched an attack on TPP so stinging Obama felt the need to lash back. Calling Warren \" wrong ,\" he claimed TPP is the \" most progressiv e trade bill in history.\" Ironically, progressives continue to disagree. When the Senate recently voted 62-14 to grant Obama fast-track negotiating authority for TPP, only 14 Democrats voted with the 48 Republicans. Opposition is expected to be even stronger in the House of Representatives.\nThe trade deal flap has garnered such notoriety that another abandonment of progressivism by Obama has gone largely ignored. On May 7, a group of Democratic senators, including Heidi Heitkamp, Richard Durbin, Maria Cantwell, Jeanne Shaheen, and Al Franken, held a press conference to attack the Obama Administration, to Quote: one industry publication , \"over delays in setting annual targets for biofuels through the renewable fuel standard program.\" Durbin, the senior senator from Illinois, admonished the administration by saying \" there is no excuse for what we've been going through for the last two and a half, three years.\"\nDurbin was referring to a proposal made by the Environmental Protection Agency in November 2013 to lower the requirements for the use of biofuels. In 2005, Congress passed the Energy Policy Act establishing the Renewable Fuel Standard (RFS), which required the blending of renewable fuels, like ethanol, with traditional fuels. The RFS was expanded in the Energy Independence and Security Act of 2007 , which was signed into law by President George W. Bush. The law required oil companies to use increasing amounts of renewable fuels, reaching 36 billion gallons in 2022.\nFrom 2005 until 2013, the EPA enforced RFS requirements, much to the displeasure of Big Oil. As Reuters reported, \"Refiners say the law...is an untenable burden as gasoline demands shrinks. Biofuel groups say the volumes required by the law should be met.\" Then, in late 2013, caving into pressure from the Carlyle Group and Delta Airlines , both of which own oil refineries, the Obama Administration proposed weaker RFS guidelines -- the first time requirements had been lowered since the original law was passed in 2005. It was a win for Big Oil, an accommodation even President Bush was not willing to make.\nThe proposed weaker RFS requirements should have been finalized in 2014, but, for reasons that have not been revealed by the EPA, they were not. As the year passed, progressives became increasingly frustrated with the Obama Administration. \"It certainly seems as if the administration has backtracked on renewable fuels,\" Melanie Sloan , then executive director of Citizens for Responsibility and Ethics in Washington, said in October. \"The question is why.\"\nIn March 2015, in a surprise move, the American Petroleum Institute (API) and the American Fuel and Petrochemical Manufacturers (AFPM), the trade groups that represent Big Oil, filed a lawsuit against the EPA in the U.S. District Court of the District of Columbia, claiming the agency was \" disregarding statutory deadlines. \" In a consent decree, the EPA agreed that it would propose RFS requirements for 2014 and 2015 (perhaps even 2016) by June 1. Those requirements will be finalized by November 30.\nAs the announcement of those new requirements looms, progressives, especially members of the biofuel industry and the environmental movement, worry that what Big Oil really wants is to do away with RFS altogether. The oil companies are setting up that move by claiming there is a limit to the amount of biofuel a car can use, a so-called \" blend wall. \" By using this excuse, oil companies -- not the EPA -- would calculate how much biofuel is appropriate to blend into domestic fuels. Obviously, the oil companies would use a little as possible. So far, the EPA appears to willing to allow Big Oil, not an objective third party, to establish \"blend wall\" limits.\nOn May 1, API and AFPM sent a letter to the EPA detailing their opposition to RFS requirements. \"The U.S. has reached the...blend wall,\" the letter stated, \"and the gasoline supply is currently saturated with the maximum amount of ethanol that can safely be blended without posing risks to the vehicle fleet, refueling infrastructure, and vehicle warranties. [The] EPA must recognize in its upcoming rulemaking that [increasing RFS requirements] could restrict the availability of domestic transportation fuels and threatens to negatively impact our economy.\" The letter concluded: \"The RFS is fundamentally flawed and imposes economic costs without environment benefits.\"\nClearly, by claiming the country has reached the blend wall and by arguing the RFS is \"fundamentally flawed,\" Big Oil is intensifying its attack on the very concept of a renewable fuels standard. That's why the pending guidelines are important. Not merely a policy proposal, the guidelines will indicate if the Obama Administration, supposedly the most progressive in modern history, will defend biofuels or if it will placate Big Oil and allow the RFS to die.\nMore: Barack Obama Trans Pacific Partnership Mitch McConnell Elizabeth Warren Renewable Fuel Standard Heidi Heitkamp Richard Durbin Maria Cantwell Al Franken Environmental Protection Agency The Carlyle Group Delta Airlines Melanie Sloan Biofuels Ethanol Blend Wall", "external_links": [], "published": "2015-05-28T01:26:00.000+03:00", "crawled": "2015-05-28T00:46:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}