{"organizations": [], "uuid": "329da577dd4c197d648133392b40ada50bcc6801", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama-netanyahu-benjamin_032013getty_2_0.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/241317-obama-looks-forward-to-working-with-netanyahu", "country": "US", "title": "Obama 'looks forward' to working with Netanyahu", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama 'looks forward' to working with Netanyahu", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-07T17:23:00.000+03:00", "replies_count": 0, "uuid": "329da577dd4c197d648133392b40ada50bcc6801"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/news/241317-obama-looks-forward-to-working-with-netanyahu", "ord_in_thread": 0, "title": "Obama 'looks forward' to working with Netanyahu", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 07, 2015, 10:23 am Obama 'looks forward' to working with Netanyahu By Jordan Fabian \nPresident Obama on Thursday congratulated Israeli Prime Minister Benjamin Netanyahu for forming a new government, saying he looks forward to working with the leader he has feuded with over Iran. \"The president congratulates the Israeli people, Prime Minister Netanyahu and the new governing coalition on the formation of Israel’s new government. President Obama looks forward to working with Prime Minister Netanyahu and his new government,” press secretary Josh Earnest said in a statement. \n\"The United States places great importance on our close military, intelligence and security cooperation with Israel, which reflects the deep and abiding partnership between both countries,\" Earnest said. \nHe added that the president would continue to consult with Netanyahu on the Iran nuclear talks and \"the importance of pursuing a two-state solution\" with the Palestinians. ADVERTISEMENT The White House statement makes no mention of its \" need to reassess” the U.S.-Israel relationship in the wake of Netanyhau’s promise to oppose a two-state solution as long as he is in power.The administration suggested it could change the United States’ stance toward Israel at the United Nations after Netanyahu said just days before his election he would not support the creation of a Palestinian state. Netanyahu later walked back his comments. Relations between Obama and Netanyahu have become increasingly strained due to the nuclear negotiations between Iran, the U.S. and five other world powers. Netanyahu gave a controversial address to Congress bashing the talks without giving the Obama administration prior notice. The Israeli leader has said the deal could leave Iran with the capability to rush toward building a nuclear weapon, which could threaten Israel’s existence. Netanyahu assembled a right-wing coalition to form his government, with the bare minimum of 61 seats in the Israeli parliament. \n— This story was updated at 10:45 a.m.", "external_links": [], "published": "2015-05-07T17:23:00.000+03:00", "crawled": "2015-05-07T22:44:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}