{"organizations": [], "uuid": "f6b0864b075305b99577deaa91c17fe572ac55a8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/hank-bordowitz/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/education/blog.xml", "section_title": "Education Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/hank-bordowitz/an-open-letter-to-preside_b_7388940.html", "country": "US", "title": "An Open Letter To President Obama, Dr. Jill Biden andTom Hanks | Hank Bordowitz", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "An Open Letter To President Obama, Dr. Jill Biden andTom Hanks | Hank Bordowitz", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-21T22:24:00.000+03:00", "replies_count": 0, "uuid": "f6b0864b075305b99577deaa91c17fe572ac55a8"}, "author": "Hank Bordowitz", "url": "http://www.huffingtonpost.com/hank-bordowitz/an-open-letter-to-preside_b_7388940.html", "ord_in_thread": 0, "title": "An Open Letter To President Obama, Dr. Jill Biden andTom Hanks | Hank Bordowitz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As an instructor at the largest community college in the State of New Jersey, I was initially thrilled by the idea of free community college to students who maintained a 3.0 GPA and other standards that would set the collegiate experience apart from the high school experience for both the students and the instructors. I was also very appreciative of the \"big up\" Tom Hanks gave to the plan.\nHowever, if you are going to make this happen, one of the things you must keep in mind is who is doing most of that instructing. At our school, more than 60% of the classes are taught by adjuncts, and more are taught by other \"contingent faculty .\" \"Full-time Faculty\", i.e.; Professors of various ranks, teach somewhat less than a quarter of the classes offered. While this makes economic sense to the schools, it has become disastrous for the majority of contingent instructors.\nIn your State of the Union Address, you, President Obama, spoke of promoting a strong middle class. Yet there is an entire substrata of highly educated people making fry-chef wages because we chose to take on the mantle of educating our future leaders. At your request, I will enclose a copy of my W9 form for 2014. I taught seven courses that year and made less than $15,000! Our school pays in the neighborhood of $700 per credit hour. Many of my colleagues are on some form of state assistance, be it Medicaid (and thank the Lord for the ACA), SNAP, or even welfare.\nPart of this problem is that colleges across the country have eliminated full-time, tenure track positions in favor of a contingent, mostly part-time faculty. How about if, as part of the legislation to make two year colleges free to motivated student with the initiative to keep up their grades, you help raise the fortunes of my colleagues and myself who want to do nothing more than provide an excellent education to our students? What if colleges using \"contingent\" faculty as more than, oh, 20% of the warm bodies in front of the classrooms could not earn accreditation? This would return the idea of an adjunct to the professional who wants to offer hands on expertise to interested students. Good for students, good for teachers, maybe a bit painful for administrators, but ultimately better for the schools.\nI posted this on Facebook and received this reply from a former student:\nYou guys deserve a lot more than what you're getting. I learned more in your Composition class than all of the English/Writing classes I've ever been in combined. Keep it up, you guys are more valuable to us students than any paycheck can reflect.\nSomething certainly needs to be done, as this situation becomes less tenable by the term. In a previous State of the Union Address, you made mention of the Public Sector needing an equal or greater knowledge base than the Private Sector. All we ask is a taste of that equality. I like that my students find what I do valuable. I would also like to be able to pay the rent.\nFollow Hank Bordowitz on Twitter: www.twitter.com/hankaim\nMore: Fr éDucation College College Instruction Adjunct Facutly Adjuncts Middle Class Poverty", "external_links": [], "published": "2015-05-21T22:24:00.000+03:00", "crawled": "2015-05-21T21:41:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}