{"organizations": [], "uuid": "df5be6d7e9af01056b6a80815d86f66924649360", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=29", "section_title": "TheHill - Congress Blog", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/241961-lawmakers-urge-obama-to-raise-human-rights-issues-with", "country": "US", "title": "Lawmakers urge Obama to raise human rights issues with Gulf leaders", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Lawmakers urge Obama to raise human rights issues with Gulf leaders", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-14T14:00:00.000+03:00", "replies_count": 0, "uuid": "df5be6d7e9af01056b6a80815d86f66924649360"}, "author": "Brian Dooley", "url": "http://thehill.com/blogs/congress-blog/foreign-policy/241961-lawmakers-urge-obama-to-raise-human-rights-issues-with", "ord_in_thread": 0, "title": "Lawmakers urge Obama to raise human rights issues with Gulf leaders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 14, 2015, 07:00 am Lawmakers urge Obama to raise human rights issues with Gulf leaders By Brian Dooley \nOn Wednesday, a bipartisan group of 45 congressional leaders urged President Obama to push the leaders of the Gulf Cooperation Council (GCC)—Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates (UAE)—to reform their human rights practices. Obama met with leaders in Washington on Wednesday and will meet with them at Camp David today. \nIn a letter led by Rep. Jim McGovern’s (D-Mass.) office for the Tom Lantos Human Rights Commission, the group urged the president to press the Gulf leaders to end “undue restrictions on the operation of civil society groups and religious minorities,” and reform laws “that discriminate against women, limit women’s full participation in society, or make it difficult to address domestic and other gender-based violence.” Signatories – which include members of the Foreign Affairs and Armed Services committees – also asked the president to push the GCC leaders on human rights measures “which will improve the collective security of our allies.” ADVERTISEMENT It’s unclear whether the president will raise these issues at Camp David today. Although he previously promised to have a “tough conversation” with Washington’s repressive Gulf allies about the need to allow peaceful dissent, an unnamed senior administration official reportedly said the meeting won’t be about political reform. Instead, it will likely focus on how the U.S. government can deepen its military commitment to the Gulf dictatorships to ease their fears over a deal with Iran.\nToday is also when jailed Bahraini human rights defender Nabeel Rajab’s appeal verdict is due. He was convicted of insulting government ministries in a tweet. The U.S. government called for the charges against him to be dropped. It would be useful for the president to repeat that call directly to Bahrain’s crown prince. \nThe crown prince is one of several substitutes sent instead of Gulf heads of state in what some are calling a snub of the president. The other deputies are the crown princes, Abu Dhabi Sheikh Mohammed bin Zayed al Nahyan from the UAE and Mohammed bin Nayef from Saudi Arabia. Both are Obama administration favorites, and both are responsible for overseeing repression in their countries. Sheikh Mohammed runs the feared State Security Apparatus, the UAE’s Stasi, and Crown Prince Nayif is Saudi’s Minister of the Interior. \n“While we recognize that many of these governments state their aspirations to assist in countering violent extremism, we are concerned that their records of ongoing internal repression can only hinder their future stability and damage our enduring regional interests,” reads the Congressional letter. \nThe crackdown on civil society across the Gulf is likely to foment extremism, as those who are denied peaceful outlets of dissent may look elsewhere to express their grievances. That’s already happening in Bahrain, where protests have taken on a more violent edge since authorities throttled civil society. \nIn the UAE there is zero tolerance of dissent. When I was in the UAE recently to research our latest report , human rights defenders told me they feel abandoned by the U.S. government, which seems only concerned with its military relationship with their government. They take Washington’s muted response on the crackdown against them as enabling the repression, and doubt that Obama is going to raise human rights issues at all at Camp David. “We wonder if the president is really tough enough to have the tough conversation,” said one. \nA key conclusion of our research in Saudi Arabia , Bahrain , and the UAE is that true stability in the Gulf region can only be reached through democratic reforms that allow for peaceful dissent. As civil society disappears, so too does the moderate opposition, which is quickly supplanted by extremism. As Obama discusses security concerns with his Gulf allies, he would do well to tell them that the biggest security threat to both the US and the Gulf is their own repression. \nDooley is the Gulf region expert for Human Rights First.", "external_links": [], "published": "2015-05-14T14:00:00.000+03:00", "crawled": "2015-05-14T15:34:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}