{"organizations": [], "uuid": "4b3216fe92efb182b4a74e82497b4782c4c6eaa0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2946030/images/o-JOHN-MCCAIN-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/blog.xml", "section_title": "Politics Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/steven-choi/ten-years-since-mccain-kennedy-an-immigration-starter-kit-for-the-2016-presidential-candidates_b_7274448.html", "country": "US", "title": "Ten Years Since McCain-Kennedy, an Immigration Starter Kit for the 2016 Presidential Candidates | Steven Choi", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Ten Years Since McCain-Kennedy, an Immigration Starter Kit for the 2016 Presidential Candidates | Steven Choi", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T18:11:00.000+03:00", "replies_count": 0, "uuid": "4b3216fe92efb182b4a74e82497b4782c4c6eaa0"}, "author": "Steven Choi", "url": "http://www.huffingtonpost.com/steven-choi/ten-years-since-mccain-kennedy-an-immigration-starter-kit-for-the-2016-presidential-candidates_b_7274448.html", "ord_in_thread": 0, "title": "Ten Years Since McCain-Kennedy, an Immigration Starter Kit for the 2016 Presidential Candidates | Steven Choi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This week marks the ten-year anniversary to the date that Senators John McCain and Ted Kennedy introduced an immigration reform bill into Congress, the Secure America and Orderly Immigration Act. The McCain-Kennedy bill has been somewhat forgotten in recent years, as several attempts to push an immigration reform bill through Congress have come up and failed. But the bill and its history is a lesson that 2016 Presidential candidates, and our current Congress, should study up on.\nThe McCain-Kennedy bill was the first comprehensive immigration reform package to be introduced after the events of September 11th. The bill's introduction on May 12th was a sign that the American public had rejected the post-9/11 backlash against immigrants espoused by fear-mongering nativists, and that the country was ready to move forward to creating inclusive policies that welcomed newcomers who had contributed so much to America since its founding. The bill also had support from President George W. Bush, together with a wide base of supporters.\nYet, after a contentious debate, the bill failed to even come up for a vote in the Senate -- dashing the hopes of America's immigrant communities. Since 2005, there have been a number of immigration reform proposals based on the McCain-Kennedy bill. As the Latino, Asian and immigrant electorate has grown, each successive bill has brought the dream of comprehensive immigration reform one step closer to realization. In 2013, a bi-partisan, comprehensive immigration reform bill passed the Senate by a 68-32 margin -- a stark contrast from the McCain-Kennedy bill's failure to make it onto the floor for a vote.\nAnd yet, none of these bills have made it to the finish line.\nEven the last comprehensive bill in 2013 was prevented from coming to a vote in the House, and we have now reached 10 years of failure to pass legislation to deal with an issue -- immigration -- that can truly shape our country's future. In an effort to provide some temporary relief, President Obama issued a series of executive actions last fall that would allow undocumented parents of U.S citizens and legal permanent residents to apply for a halt to deportation and work authorization. But even these executive actions are delayed and stuck in legal limbo as conservative forces attempt to block them.\nThese efforts to block any possibility of immigration reform has done more harm than good. While a vast majority of Americans have said that they support a solution to the country's broken immigration system, persistent political plays to block progress have left communities frustrated and angry.\nMoving into the 2016 race, any Presidential candidate that wants a fighting chance needs to prioritize an immigration reform game plan -- one that is fair, just, family-oriented and economically sound. Ten years after the McCain-Kennedy bill, here's our recommended starter kit for a comprehensive immigration reform proposal that must pass during the first term of the next president:\nProvide a path to citizenship. First and foremost, any plan must recognize that the approximately 11 million undocumented immigrants play a critical, valuable role to our economy and our society, and should provide a broad legalization program with a path to citizenship.\nStrengthen family unity. Immigration reform will not be successful until we harmonize public policy with one of the main factors driving migration: families that want to be together. Currently, families are separated by visa waiting periods and processing delays that can last decades. Immigration reform must increase the number of visas available for family members and eliminate bars to re-entry so that individuals are separated from their family for decades.\nMeet our workforce needs. Any solution must satisfy legitimate employer needs while respecting both immigrant and U.S.-born workers. We need visas for workers at all skill levels and a process to adjust for need. Increased visa numbers must go hand in hand with long-term investments in the U.S. workforce, including better education and job training opportunities. Reforms must uphold the wages and working conditions of all workers and ensure that immigrant workers in the formal and informal sectors have equal workplace rights and protections as well as a clear path to citizenship. We must reject faulty programs like \"E-verify\" that will harm the American economy and U.S. workers while doing little to end the hiring of undocumented workers.\nEnforce the rules fairly. The U.S. Constitution guarantees due process for all people in this country. Our government, however, has not fulfilled that guarantee in its treatment of immigrants. Immigration enforcement, including detention and immigration court procedures, should adhere to basic due process and human rights standards. Any plan must restore basic civil liberties for all individuals in this country and our commitment to core American values of fairness and justice.\nTen years since the first post-9/11 attempt to fix U.S immigration policy, it's time we saw results.\nFollow Steven Choi on Twitter: www.twitter.com/SteveChoiNYIC\nMore: Immigration Elections John McCain Kennedy Bush Citizenship Undocumented Immigrants", "external_links": [], "published": "2015-05-13T18:11:00.000+03:00", "crawled": "2015-05-13T18:58:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}