{"organizations": [], "uuid": "d42cc48e81839e2048654fc150c065aefec035dd", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/cameronimmigrationinternal32322.jpg", "site_section": "http://feeds.foxnews.com/foxnews/world", "section_title": "FOX News", "url": "http://www.foxnews.com/world/2015/05/21/look-at-what-at-stake-for-6-nations-currently-at-center-eu-russia-tug-war/", "country": "US", "title": "UK's Cameron announces new plans as immigration surges", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "UK's Cameron announces new plans as immigration surges", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-21T19:18:00.000+03:00", "replies_count": 0, "uuid": "314e9a46b454b484824942c4ce47adb6a1c1f762"}, "author": "", "url": "http://www.foxnews.com/world/2015/05/21/uk-cameron-announces-new-plans-as-immigration-surges/", "ord_in_thread": 0, "title": "UK's Cameron announces new plans as immigration surges", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UK's Cameron announces new plans as immigration surges   May 21, 2015: Britain's Prime Minister David Cameron answers a question from a journalist after delivering a speech on immigration at the Home Office in London. (AP) \nLONDON – Prime Minister David Cameron on Thursday announced plans to crack down on illegal immigration and tighten Britain's borders as new official figures showed a significant rise in the number of migrants. \nNet migration to Britain surged to roughly 318,000 in 2014, up from 209,000 the year before, the Office for National Statistics said. The figure, which represents the estimated number of people moving to the country for a year or more minus the number departing, is the highest in a decade. \nImmigration has become one of the most divisive political issues in Britain, and increasing numbers of Britons argue that uncontrolled migration has a negative effect on the country -- from employment to social infrastructure such as housing and health services. \nIn his first speech on immigration since he won a second term in the general election, Cameron outlined stricter controls targeting illegal migration, including giving police new powers to seize immigrants' earnings if they do not have the right to work in Britain. \n\"While a strong country isn't one that pulls up the drawbridge, it is one that properly controls immigration,\" he said. \nThe data showed that 641,000 immigrants came to Britain last year, up by more than 100,000 since 2013. Of those, just under half were from within the European Union. \nUnder EU rules, citizens from the 28-nation trade bloc have the right to live and work legally inside Britain. \nCameron focused his speech on illegal migration -- although there are no official figures indicating how many people enter or remain in Britain illegally. Banks will be forced to check accounts against databases of migrants who have entered illegally, while local authorities will be given powers to speed up evictions of migrants who are in the country illegally. \nBusinesses will be barred from recruiting abroad without advertising in Britain. \nCameron pledged before the 2010 election that he could cut net migration to the \"tens of thousands.\" He maintained Thursday that he stood by that ambition despite the new figures. Advertisement", "external_links": [], "published": "2015-05-21T19:18:00.000+03:00", "crawled": "2015-05-21T19:35:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}