{"organizations": [], "uuid": "130377af9e7d7f820ed9152d15ea0ab87dcbaaef", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarack_040715getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/241826-obama-seeks-path-forward-with-senate-dems", "country": "US", "title": "Obama seeks 'path forward' with Senate Dems", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama seeks 'path forward' with Senate Dems", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-13T01:01:00.000+03:00", "replies_count": 0, "uuid": "130377af9e7d7f820ed9152d15ea0ab87dcbaaef"}, "author": "tlejeune@thehill.com (Jordan Fabian)", "url": "http://thehill.com/blogs/blog-briefing-room/241826-obama-seeks-path-forward-with-senate-dems", "ord_in_thread": 0, "title": "Obama seeks 'path forward' with Senate Dems", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "May 12, 2015, 06:01 pm Obama seeks 'path forward' with Senate Dems By Jordan Fabian Getty Images President Obama met with Senate Democrats on Tuesday afternoon in an attempt to break an impasse over his controversial trade agenda. The president huddled with 10 pro-trade Democrats shortly after members of his own party dealt him a stinging defeat in the Senate on one of his top agenda items: a trade promotion authority bill (TPA). \"They had a constructive session and discussed the need to advance legislation to give the president the authority he needs to complete negotiations on the Trans-Pacific Partnership and enforce the agreement,\" the White House said in a statement. ADVERTISEMENT Earlier Thursday, a motion to proceed to the TPA bill failed to get the 60 votes necessary to pass. Just one Democrat, Sen. Tom Carper (Del.), voted for it. Carper was joined at the White House meeting by Sens. Michael Bennet (Colo.), Maria Cantwell (Wash.), Ben Cardin (Md.), Heidi Heitkamp (D-N.D.), Tim Kaine (Va.), Patty Murray (Wash.), Bill Nelson (Fla.), Mark Warner (Va.), and Ron Wyden (Ore.), a co-author of the TPA bill. The TPA bill, known as \"fast-track,\" would allow Obama to negotiate new trade deals without amendments from Congress. But it has run into significant opposition from liberal Democrats and labor unions, who say new trade agreements will ship jobs overseas. Senate Democrats have demanded that the \"fast-track\" bill be packaged with other pieces of legislation: a customs and enforcement measure that includes language on currency manipulation, a trade bill for African nations and Trade Adjustment Assistance (TAA), which aids Americans who lose their jobs to overseas workers. But Senate Majority Leader Mitch McConnell (R-Ky.) was unwilling to combine the customs bill with the TPA and TAA measures. \"Members in attendance reiterated their support for TPA legislation that will pave the way for high-standard trade agreements,\" the White House said. \"The president and members committed to continuing work on this important priority in order to ensure workers and businesses can compete on a level playing field in the global economy.\" White House press secretary Josh Earnest earlier Tuesday downplayed the defeat, describing it as \"a procedural snafu.\" He also dismissed the notion that the president's aggressive sales pitch to Democrats on trade has fallen flat. “I would urge you to withhold judgement about the president’s persuasion ability ... until we’ve had a chance to advance this legislation,” Earnest said.", "external_links": [], "published": "2015-05-13T01:01:00.000+03:00", "crawled": "2015-05-13T08:08:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}