{"organizations": [], "uuid": "7d9e857601a01fd1deb639bfbc693187248b53e1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3000834/images/o-MICHELLE-BACHELET-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/health-news/blog.xml", "section_title": "Health News Blog on The Huffington Post", "url": "http://www.huffingtonpost.com/steve-siebold/its-time-to-legalize-abortion-in-chile-and-everywhere-else_b_7444224.html", "country": "US", "title": "It's Time to Legalize Abortion in Chile and Everywhere Else | Steve Siebold", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "It's Time to Legalize Abortion in Chile and Everywhere Else | Steve Siebold", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-28T00:32:00.000+03:00", "replies_count": 0, "uuid": "7d9e857601a01fd1deb639bfbc693187248b53e1"}, "author": "Steve Siebold", "url": "http://www.huffingtonpost.com/steve-siebold/its-time-to-legalize-abortion-in-chile-and-everywhere-else_b_7444224.html", "ord_in_thread": 0, "title": "It's Time to Legalize Abortion in Chile and Everywhere Else | Steve Siebold", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A shocking new ad campaign in Chile is telling women if they want to have an abortion, they should consider falling from the top of a staircase. That's because right now in Chile, it's illegal to end a pregnancy regardless of the circumstances. So even if the fetus won't survive outside the uterus, conception occurred as the result of rape or even if the mother's own life is in danger from carrying the baby, the law says a woman must keep the baby unless she miscarries naturally. Chilean President Michelle Bachelet wants to overturn the law, but has her work cut out for her as she takes on a conservative and Roman Catholic-based legislature.\nHere in America, I'm happy, yet amazed Roe vs. Wade hasn't been overturned. It's proof that there are so many people who believe in a woman's right to choose, but are only brave enough to admit it when it's law. I don't blame people for being afraid, because taking any social position in America that goes against the religious right can cost you your job, friends and even family.\nThe delusional thinking is that a fetus is a human being. A fetus is only a fetus and it cannot survive without its mother's body, which makes critical thinking on abortion simple: we own our bodies, and neither the government nor the church has any jurisdiction or say in what we do with it.\nOnce it's breathing independently outside the mother's womb it has rights, but until a fetus becomes a human being it is part of its mother's body. The problem with people who argue against this is they are thinking through emotion instead of logic. Abortion is a sad but sometimes necessary event; the mother should be free to choose what happens inside her own body.\nThe fact is that the advent of contraception and legalized abortion has done more to liberate women than any two events in history, and the all-boys club of \"women should be kept barefoot and pregnant\" is none too pleased. Women have been controlled, bullied and abused by men since the beginning of time, and maintaining control of their reproductive rights is one of the methods men have used to keep them from rising up in the world.\nAs long as a woman had to be home raising kids, she couldn't go out in the world and stake her own claim or make her own money. Men not only had a physical strength advantage over women, but they enjoyed absolute monetary power as well. It's hard to have equal rights with empty pockets, and unplanned pregnancy was the catalyst of inequality. Birth control and abortion changed all that, and in the past 40 years we have witnessed the greatest emancipation of women in American history.\nWomen now have the power to forge their own destiny, earn unlimited amounts of money and challenge men for political power. This evolution would never have taken place in America without legalized abortion. Overturning Roe vs. Wade has never been about saving babies. It's about controlling women and the religious extremists will continue masking this hidden agenda until they are exposed.\nFortunately, millions of strong independent women refused to be subjected to the tyranny of ancient religious dogma and puritanical societal norms and are boldly creating their own futures. As women continue to gain more political power, social status and financial equality, they will make America a stronger, more prosperous country.\nMost Latin American countries severely limit access to abortion. A total ban is in place in seven of them: El Salvador, the Dominican Republic, Nicaragua, Honduras, Haiti, Suriname and Chile.\nHopefully, in time, Chile will see the law on abortion overturned. I'm hopeful it will as it recently passed a series of education reforms aimed at more inclusion for Chilean students, as well as a bill approving civil unions for unmarried partners, which included same-sex couples.\nIn 2015, it's amazing that we're still seeing many women around the world treated as second-class citizens. When will people wake up and stop giving into ancient dogma and allow women the same rights and freedoms as men?\nPresident Bachelet should be commended for her fight to bring gender equality and women's access to reproductive health services to the country. Let's hope she wins the battle and sets the example for all countries that still outlaw abortion and a woman's right to choose.\nMore: Chile Chile Abortion Abortion Civil Rights Women's Rights Michelle Bachelet Fetus Roe v. Wade Babies South America Roman Catholic Church", "external_links": [], "published": "2015-05-28T00:32:00.000+03:00", "crawled": "2015-05-27T23:53:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}