{"organizations": [], "uuid": "63a21564304408f41e991731a3f9c27b17dc1a78", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/warrenelizabethobamabarack_042215getty.jpg", "site_section": "http://thehill.com/taxonomy/term/16/feed#", "section_title": "The Hill: Blog Briefing Room", "url": "http://thehill.com/blogs/blog-briefing-room/news/241546-obama-goes-after-warren-shes-absolutely-wrong-on-trade", "country": "US", "title": "Obama goes after Warren: ‘She’s absolutely wrong’ on trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama goes after Warren: ‘She’s absolutely wrong’ on trade", "spam_score": 0.0, "site_type": "blogs", "published": "2015-05-09T22:04:00.000+03:00", "replies_count": 0, "uuid": "63a21564304408f41e991731a3f9c27b17dc1a78"}, "author": "esmilowitz@thehill.com (Elise Viebeck)", "url": "http://thehill.com/blogs/blog-briefing-room/news/241546-obama-goes-after-warren-shes-absolutely-wrong-on-trade", "ord_in_thread": 0, "title": "Obama goes after Warren: ‘She’s absolutely wrong’ on trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images President Obama went after Sen. Elizabeth Warren (D-Mass.) for her increasingly pointed critiques of a proposed trade deal he supports. “She’s absolutely wrong,” Obama told Yahoo News in an interview published Saturday. The comments come after Warren said the deal might eventually undo Wall Street reform, one of Obama’s signature achievements and a major issue for Warren and her supporters. ADVERTISEMENT The White House responded that the Trans-Pacific Partnership would specifically prevent that unless Congress overrode the provision with a vote. Obama, in an unusually frank critique, suggested Warren was seeking to bolster her political brand by going after the deal and that she was going too far in floating “hypotheticals.” “The truth of the matter is that Elizabeth is, you know, a politician like everybody else. And you know, she’s got a voice that she wants to get out there. And I understand that,” Obama said, according to Yahoo. “On most issues, she and I deeply agree. On this one, though, her arguments don’t stand the test of fact and scrutiny.” He said he would have to be “pretty stupid” to support a trade deal that could undo financial reform. “Think about the logic of that, right?” he said. “The notion that I had this massive fight with Wall Street to make sure that we don’t repeat what happened in 2007, 2008. And then I sign a provision that would unravel it? … This is pure speculation [by Warren]. She and I both taught law school, and you know, one of the things you do as a law professor is you spin out hypotheticals. And this is all hypothetical, speculative.” The comments are sure to ratchet up the fight over the deal, which has support from top Republicans but is opposed by many Democrats and conservatives. Warren, a liberal icon whom many on the left want to challenge Hillary Clinton in 2016, is an increasingly vocal critic. Republicans have used their last three weekly addresses to push legislation that is seen as crucial for finalizing the deal. Tags:", "external_links": [], "published": "2015-05-09T22:04:00.000+03:00", "crawled": "2015-05-10T04:05:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}