{"organizations": [], "uuid": "dc1bcc8792df11b07157692401f6c65ea4f42cef", "thread": {"site_full": "edition.cnn.com", "main_image": "", "site_section": "http://feeds.feedburner.com/ForumNewsTopStories", "section_title": "Forum News, Top Stories", "url": "http://edition.cnn.com/2015/05/04/us/garland-mohammed-drawing-contest-shooting/index.html", "country": "GB", "title": "Raped girl, 10, denied abortion in Paraguay", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Raped girl, 10, denied abortion in Paraguay", "spam_score": 0.0, "site_type": "discussions", "published": "2015-05-02T19:12:00.000+03:00", "replies_count": 0, "uuid": "c038eac2a429874d4eabc3becc6437c61ec41157"}, "author": "", "url": "http://edition.cnn.com/2015/05/01/americas/paraguay-girl-rape-pregnancy/index.html", "ord_in_thread": 0, "title": "Raped girl, 10, denied abortion in Paraguay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Group presses to allow abortion for raped 10-year-old 02:17 Story highlights Girl was raped by her stepfather, whom authorities are seeking, prosecutors say Paraguayan law bans abortions except in cases where mother's life is in jeopardy Health minister says girl's life isn't at risk, and that government will oversee her prenatal care (CNN) An international rights group is pressing the Paraguayan government to allow an abortion for a 10-year-old girl who allegedly was impregnated by her stepfather -- a procedure that health officials in the South American country have so far blocked. At issue is Paraguayan law, which bans abortions except in cases where the pregnancy endangers the mother's life. The Paraguayan Ministry of Health says there's no indication that the health of the girl -- now 22 weeks' pregnant -- is at risk. But the girl's family is asking for an abortion, and Amnesty International is backing them, saying her age should trigger the health exception. The group also asserts the law is too restrictive, noting that it doesn't provide additional exceptions for rape. \"The physical and psychological impact of forcing this young girl to continue with an unwanted pregnancy is tantamount to torture,\" Amnesty International official Guadalupe Marengo said this week. \"The Paraguayan authorities cannot sit idly by while this young rape survivor is forced to endure more agony and torment.\" Doctors learned the girl was pregnant after she entered a hospital in the Paraguayan capital, Asuncion, on April 21 for abdominal pain. That spurred a criminal investigation. Authorities allege that she was raped by her stepfather, and that the pregnancy stems from that crime, according to the prosecutor in charge of the case, Monalisa Munoz. A warrant has been issued for the stepfather, who is at large, Munoz told Paraguayan TV network Telefuturo. The girl's mother has been arrested in connection with the case, Munoz said. She faces charges including breaching her duty of care, Amnesty International said. Amnesty said the girl's mother asked on Tuesday that her daughter be allowed to have an abortion. But Paraguayan Health Minister Antonio Barrios said the pregnancy would continue. \"There is no indication that the health of the (girl) is at risk ... therefore we are not, from any point of view, in favor of the termination of the pregnancy,\" Barrios said Thursday. Barrios said the girl, who has been transferred from a children's hospital to Asuncion's Red Cross Hospital, will be taken to a shelter where the state will oversee her prenatal care. \"The Justice Department will determine later who will have custody of the mother and child after (the birth),\" Barrios said. Amnesty International argues the girl's age alone should make her eligible for Paraguay's abortion exception, saying pregnancy poses health risks to young girls whose bodies aren't fully developed. A 2013 United Nations report said that 2 million girls under age 14 give birth in developing countries every year, many of whom suffer resulting long-term or fatal health problems. It estimated that 70,000 adolescents die each year from complications from pregnancy or childbirth. Journalist Sanie López Garelli and CNN's Marilia Brocchetto, Dakota Flournoy and Theresa Waldrop contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Americas", "external_links": [], "published": "2015-05-02T19:12:00.000+03:00", "crawled": "2015-05-04T23:36:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}