{"organizations": [], "uuid": "d52d1fef9598ecb37749f17fa591a836d01fca67", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150514192742-obama-welcomes-leaders-and-delegations-from-the-gulf-cooperation-council-large-169.jpg", "site_section": "http://feeds.feedburner.com/ForumNewsTopStories", "section_title": "Forum News, Top Stories", "url": "http://edition.cnn.com/2015/05/18/asia/isis-ramadi/index.html", "country": "GB", "title": "Obama, Arab nations dance to different tunes", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama, Arab nations dance to different tunes", "spam_score": 0.0, "site_type": "discussions", "published": "2015-05-17T13:46:00.000+03:00", "replies_count": 0, "uuid": "d368b7b201327d4ae436eadf3ba353118e74e0e1"}, "author": "", "url": "http://edition.cnn.com/2015/05/15/opinions/ghitis-arab-leaders-summit/index.html", "ord_in_thread": 0, "title": "Obama, Arab nations dance to different tunes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Obama, Arab nations dance to different tunes Updated 1343 GMT (2043 HKT) May 15, 2015 JUST WATCHED Obama on Iran: 'Deal is not completed' 04:31 Story highlights President Obama hosted summit of Arab leaders at Camp David Frida Ghitis: Arab visitors undoubtedly heard unpleasant warnings from Obama Perception that Obama was snubbed has been hard to shake, she says Frida Ghitis is a world affairs columnist for The Miami Herald and World Politics Review and a former CNN producer and correspondent. Follow her @FridaGhitis . The opinions expressed in this commentary are solely those of the author. (CNN) What we have been watching is a carefully choreographed diplomatic dance, starring President Barack Obama and the Arab leaders who came to the United States for high-level talks at Camp David, Maryland. But the truth is that Obama's dance partners started moving to a different beat even before they arrived. After a day of meetings at the presidential retreat, Obama appeared to take questions from reporters alone, declaring there will now be an expanded relationship as a result of the Camp David meeting, with greater security cooperation between the United States and Gulf Cooperation Council members. But don't buy the niceties. They are an act. Frida Ghitis The two sides are sharply at odds over a number of issues, most stemming from the preliminary nuclear deal with Iran. Yet the differences actually go much further, and the consequences of the spat are nothing short of history-changing serious. At the heart of the disagreement is the nuclear deal that the United States and world powers are negotiating with Tehran, which Arab countries believe Washington, leading the talks, is botching badly. Indeed, Arab officials have already said repeatedly that if Iran is allowed to keep a nuclear program, they will start their own. \"Whatever the Iranians have, we will have, too,\" said Prince Turki bin Faisal, the former Saudi intelligence chief. Others suggested the same. If you think the Middle East could not possibly become any more dangerous, imagine a slew of competing nuclear programs in the land of nihilistic extremists and apocalyptic rivalries. Then imagine that the countries of the region don't believe the United States is interested in playing a major role in the Middle East -- and specifically reining in Tehran -- and you have a recipe for even more deadly conflict. The reality is that Middle Eastern states worry that there is more to the nuclear deal than the United States is letting on, and they wonder what, exactly, it intends to achieve in negotiations with Iran. In a pre-summit interview, Obama argued that a nuclear deal with Iran would empower moderates. But Arab commentators were quick to fire back , saying the deal could do exactly the opposite, and would strengthen hard-liners. Indeed, the Middle East is rife with rumors that the Obama administration is eyeing a rebalancing of power in the Middle East that would bring the United States closer to Tehran at the expense of America's traditional Arab allies. The President had likely hoped to allay such fears with the invitation to Camp David, the perfect setting for reassuring leaders of the Gulf Cooperation Council -- Saudi Arabia, Kuwait, Bahrain, Oman, Qatar and the United Arab Emirates. But the problem is one of substance, not setting. And if Obama was trying to convey a calming message to the Saudi King and neighboring monarchs, they sent him a message first -- by staying away. Of the six heads of state invited to Camp David, only two showed up. That is an astonishing snub. King Salman of Saudi Arabia made the slight even more painful by waiting until the last minute -- after the White House had confirmed his attendance -- before canceling. Speaking moments after the cancellation , the newly named Saudi foreign minister, Adel al-Jubeir, was at his diplomatic, soft-spoken best, insisting there was absolutely no snub. \"The circumstances have changed,\" he said. And he claimed that relations are strong as ever. \"We have no doubt,\" he said, \"no doubt whatsoever about America's commitment to the security of Saudi Arabia.\" It is also true that the monarchs who stayed away sent powerful stand-ins. Saudi Arabia, by far the most important of the Gulf states, sent the recently appointed Crown Prince Mohammed bin Nayef, first in line to the throne, and the deputy crown prince, fast-rising Defense Minister Mohammed bin Salman. Yet the suggestion that the President was snubbed has been hard to shake. Meanwhile, there is little doubt that those in attendance gave the President an earful. Al-Jubeir had already said the summit would focus on what he called Iran's \"aggressive moves.\" Such comments come against a backdrop of ongoing tensions between Iran and the Saudis, which have been playing out in the fighting in Syria, where Iran supports the regime of Bashar al-Assad, while most Gulf states back the opposition. In Yemen, meanwhile, Saudi Arabia has launched airstrikes to push back the gains of Houthi militias, allegedly backed by Iran, which overthrew the previous government. The Saudis say that Lebanon's Hezbollah, which exercises massive influence in Lebanon, is also fighting in Yemen, which is right on their doorstep. Still, while Obama surely heard their complaints, the Arab visitors undoubtedly heard unpleasant warnings from the President as well. Earlier, Obama had admonished Arab states, saying the greatest threat they face is from their own populations, something he said they need to hear. But crown princes and emirs did not come to get a lesson in democracy. Obama wanted them here to convince them the United States has their back and they should support an Iran agreement. Yet although it has all been made to sound relatively placid, that's just the ballet. Behind the scenes, the choreography was not nearly as convivial.", "external_links": [], "published": "2015-05-17T13:46:00.000+03:00", "crawled": "2015-05-18T18:02:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}