{"organizations": [], "uuid": "6c743c0b1d9801409b777d1bca33e0df2da92d29", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/hillwhip.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/trade/241114-whip-list-dems-bucking-obama-on-trade", "country": "US", "title": "Whip List: Dems bucking Obama on trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Whip List: Dems bucking Obama on trade", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T23:37:00.000+03:00", "replies_count": 0, "uuid": "6c743c0b1d9801409b777d1bca33e0df2da92d29"}, "author": "mmali@thehill.com (Vicki Needham)", "url": "http://thehill.com/policy/finance/trade/241114-whip-list-dems-bucking-obama-on-trade", "ord_in_thread": 0, "title": "Whip List: Dems bucking Obama on trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sen. Dan Coats (Ind.) — Voted for the TPA bill in the Senate Finance Committee. \nSen. John Cornyn (Texas) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Mike Crapo (Idaho) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Ted Cruz (Texas) — Penned an op-ed in The Wall Street Journal , alongside Rep. Paul Ryan, supporting the fast-track bill . \nSen. Mike Enzi (Wyo.) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Cory Gardner (Colo.) - “I urge Congress to quickly take up and pass trade promotion authority so we can conclude a TPP agreement. Our position in the world depends on it,” Gardner wrote in an op-ed in the Greeley Tribune . \nSen. Chuck Grassley (Iowa) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Orrin Hatch (Utah) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Dean Heller (Nev.) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Johnny Isakson (Ga.) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Mitch McConnell (Ky.) \nSen. Rob Portman (Ohio) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Jim Risch (Idaho) \nSen. Pat Roberts (Kan.) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Mike Rounds (S.D.) \nSen. Tim Scott (S.C.) — Voted for the TPA bill in the Senate Finance Committee. \nSen. John Thune (S.D.) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Pat Toomey (Pa.) — Voted for the TPA bill in the Senate Finance Committee. \nSen. Roger Wicker (Miss.) \n\nREPUBLICANS - NO (3) \nSen. Richard Burr (N.C.) — Burr was the only Republican on the Senate Finance Committee to vote against the fast-track bill. \nSen. Lindsey Graham (S.C.) — Graham told Politico on April 21 that he will not support the bill, “unless they get a better deal on currency.” \nSen. Jeff Sessions (Ala.) — Sessions has voiced concerns over the bill, which he worries could give President Obama an opportunity to attach immigration measures. \n\nREPUBLICANS - UNDECIDED (5) \nSen. John Boozman (Ark.) — “I think it’s going to be tight,” said Boozman, who is leaning in favor of voting yes because the farm community supports the legislation. \nSen. Susan Collins (Maine) — Collins is a co-sponsor on the Trade Adjustment Assistance bill with Sen. Ron Wyden (D-Ore.). \nSen. Shelley Moore Capito (W.Va.) — “I’m really looking at it carefully. Our state is under serious economic distress right now. So, I’m going to look at it to see if it brings greater opportunities,” Capito told The Hill. \nSen. Jeff Flake (Ariz.) — \"To the benefit of U.S. producers and consumers alike, today's introduction of bipartisan legislation renewing trade promotion authority is a positive step toward reducing trade barriers and increasing economic growth in the U.S. and abroad,\" Flake said. \"I welcome the opportunity for the Senate to carefully consider this important legislation.\" \nSen. Thom Tillis (N.C.) — Wrote a letter to U.S. Trade Representative Michael Froman addressing his concerns over China possibly joining the TPP agreement in the future. \n\nSen. Michael Bennet (Colo.) — Voted for the TPA bill in the Senate Finance Committee \nSen. Maria Cantwell (Wash.) — Voted for the TPA bill in the Senate Finance Committee \nSen. Ben Cardin (Md.) — Voted for the TPA bill in the Senate Finance Committee \nSen. Tom Carper (Del.) — Voted for the TPA bill in the Senate Finance Committee \nSen. Bill Nelson (Fla.) — Voted for the TPA bill in the Senate Finance Committee \nSen. Mark Warner (Va.) — Voted for the TPA bill in the Senate Finance Committee \nSen. Ron Wyden (Ore.) — Wyden, ranking member of the Finance Committee, helped negotiate the fast-track trade deal. \n\nDEMOCRATS - NO (13) \nSen. Tammy Baldwin (Wis.) — “Instead of handing over fast-track authority to the Administration, Congress should be increasing oversight of unfair trade deals that stack the deck against American workers. These agreements have been negotiated behind closed doors with no input from the workers whose lives will be most affected by them,” Baldwin said in a statement. \nSen. Sherrod Brown (Ohio) — Voted against the TPA bill in the Senate Finance Committee. \nSen. Bob Casey Jr. (Pa.) — Voted against the TPA bill in the Senate Finance Committee. \nSen. Al Franken (Minn.) — Franken signed a January letter to Harry Reid, along with other senators, opposing TPA. A representative also said, “Sen. Franken believes that Congress has a very important role to play in trade policy, and fast track authority has prevented Congress from playing that role. He has said he is opposed to fast track authority, because real congressional input is necessary to ensure that any trade deal will truly benefit Minnesota.” \nSen. Martin Heinrich (N.M.) — \"It’s time to shine a light on this latest free trade deal. And you can count on the fact that I won’t be giving up the right to fight for New Mexican workers by supporting 'fast-track' authority no matter how it’s repackaged,” Heinrich said in a statement. \nSen. Joe Manchin (W.Va.) \nSen. Ed Markey (Mass.) — “We should not hand over authority and rush approval of trade agreements that would be a historically bad deals for our nation’s middle class, our workers and our environment,” Markey said in a statement. “It is critically important that both trade deals protect workers’ rights, safeguard our environment, and don’t go around the U.S. courts. I will not support any legislation that hastens approval of agreements that outsource justice or jobs overseas,” he added. \nSen. Robert Menendez (N.J.) — Voted against the TPA bill in the Senate Finance Committee. \nSen. Harry Reid (Nev.) — The Senate minority leader has expressed his continued opposition to the bill. “You couldn't find a person ... who feels more negatively about it than I do,” he said. “So the answer is not only no but hell no,” he added. \nSen. Brian Schatz (Hawaii) \nSen. Charles Schumer (N.Y.) — Voted against the TPA bill in the Senate Finance Committee. \nSen. Debbie Stabenow (Mich.) — Voted against the TPA bill in the Senate Finance Committee. \nSen. Elizabeth Warren (Mass.) — Warren penned an op-ed in The Washington Post outlining her opposition to an Investor-State Dispute Settlement (ISDS) clause in the TPP. “ISDS would allow foreign companies to challenge U.S. laws — and potentially to pick up huge payouts from taxpayers — without ever stepping foot in a U.S. court,” she wrote. \n\nDEMOCRATS - UNDECIDED (7) \nSen. Barbara Boxer (Calif.) — Boxer has said she is leaning no on TPA. \nSen. Dick Durbin (Ill.) — “He has concerns that the bill would give away Congress’s right to take a close look at the trade agreement and how it might impact our country and our states,” a representative said. Durbin, the No. 2 Democrat in the Senate, voted against similar legislation when it came up in 2002. \nSen. Dianne Feinstein (Calif.) — \"Senator Feinstein is still reviewing the Trade Promotion Authority legislation and hasn’t reached a definitive conclusion. She has spoken with the U.S. Trade Representative and will continue to speak with him and other stakeholders in the coming days,” a representative said. Feinstein is one of four Democrats whose support could be crucial, according to Politico . \nSen. Tim Kaine (Va.) — “While Senator Kaine is generally supportive of free trade on account of how it's helped fuel Virginia's economy, he also feels that environmental and labor concerns should be taken into consideration as part of any final agreement. He has heard directly from voices on both sides of this issue and looks forward to a robust debate on the Senate floor soon,” a representative said. Kaine is one of four Democratic senators the White House is lobbying to secure passage, according to Politico . \nSen. Patty Murray (Wash.) — Murray told Politico she is undecided and still reviewing how “Washington state businesses have an opportunity to sell overseas.” Murray is one of four Democrats whose support could be crucial, according to Politico. \nSen. Gary Peters (Mich.) — Wrote a letter to U.S. Trade Representative Michael Froman addressing his concerns over China’s involvement in future TPP negotiations. \nSen. Jeanne Shaheen (N.H.) — Shaheen is one of four Democrats whose support could be crucial, according to Politico . “I’m still trying to make up my mind,” Shaheen told the paper.", "external_links": [], "published": "2015-05-05T23:37:00.000+03:00", "crawled": "2015-05-06T00:26:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}