{"organizations": ["U.N.", "The Washington Post", "CNN", "Yale Law School", "New York Times"], "uuid": "d6de06926a1c234239a8bdcf04ab90e843af15ce", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150325082152-social-gfx-cnn-logo-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/05/17/us/tsarnaev-13th-juror-last-word/index.html", "country": "US", "title": "Will Michelle Obama campaign for Hillary Clinton?", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Will Michelle Obama campaign for Hillary Clinton?", "spam_score": 0.0, "site_type": "news", "published": "2015-05-17T18:08:00.000+03:00", "replies_count": 0, "uuid": "f377bbc96daccba7f952a5749a9697614b24d939"}, "author": "", "url": "http://edition.cnn.com/2015/05/17/politics/ip-first-ladies-club/index.html", "ord_in_thread": 0, "title": "Will Michelle Obama campaign for Hillary Clinton?", "locations": ["U.S.", "Iowa Straw", "Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pataki", "Jonathan Martin", "Rick Santorum", "Bush", "John Berman", "O'Malley", "Bolton", "Hillary Clinton", "Clinton", "Berman", "Marco Rubio", "Martin", "George Pataki", "Santorum", "Perry", "Will Michelle Obama", "Scott Walker", "Rick Perry", "Martin O'Malley", "Robert Costa", "Rubio", "John Bolton"], "text": "The future of the Iowa Straw Poll 00:45 PLAY VIDEO \"All the resources ought to go to the thing that matters, which is the Iowa caucuses on February 1,\" Bush said. \"What's relevant is running a campaign, creating a strategy, building a good team toward success, which is in the primaries, and doing it in a way that makes it possible to actually win the general election, which is the whole objective.\" Some other candidates haven't made their intentions quite as clear. We're waiting to hear if Scott Walker will or won't compete there. But The New York Times' Jonathan Martin points out that \"compete\" may have a different definition this time around. \"Marco Rubio, for example, may show up to speak there at the event, because there's going to be thousands of activists there that they want to reach, but I am told that Rubio, at least -- 'absolutely positively,' to quote one of his advisers -- will not spend money to bus supporters there,\" said Martin. \"So competing there, what does that actually mean? Does that mean actually spending money or just showing up to speak? Important difference.\" 4. Bolton's 'radical' plans for Clinton's 2016 campaign John Bolton announced this week that he's not running for the 2016 GOP presidential nomination. But he gave The Washington Post's Robert Costa a hint about what he is going to do in the coming months during the primaries. Bolton, a former U.S. ambassador to the U.N., said he's going to be spending about $6 million to $7 million to make sure his hawkish perspective gets out there during the debates, even though he won't be participating. But he's not limiting himself to the primaries. \"He wants to use his political action committee and his presence to go up against Secretary Clinton, should she be the Democratic nominee,\" said Costa. \"He was a classmate of Clinton's at Yale Law School and he calls her, quote, 'a radical' in our conversation. And he thinks he's going to make that point in a lot of ads this fall.\" 5. O'Malley, Santorum, Perry and Pataki's common link In the next few weeks, Martin O'Malley, Rick Santorum, Rick Perry and George Pataki are expected to jump into the race. What do they have in common? \"Well, not many people give them a chance, which makes me think back to November of 2011, when I interviewed Rick Santorum about his first presidential campaign,\" said CNN's \"Inside Politics\" guest host John Berman. \"And I spent a significant part of that interview noting again and again and again that not many people thought he had a chance. My exact questions included, 'Why aren't you doing better in the polls?' And 'Why isn't your message catching on?'\" Less than two months later, Santorum won Iowa, and went on to win 10 other states before suspending his campaign. \"He had a chance,\" said Berman. \"I was wrong and learned that perhaps we should see how they run before we call the race. So candidates, lace up those shoes and have at it.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-05-17T18:08:00.000+03:00", "crawled": "2015-05-17T18:32:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}