{"organizations": [], "uuid": "9dec17132535374d3ce72cd519d4e5042902c478", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2895488/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/04/30/democrats-trans-pacific-partnership-obama_n_7175186.html", "country": "", "title": "Obama Accused Democrats Of Lying About Trade Deal, And They Aren't Having It", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Accused Democrats Of Lying About Trade Deal, And They Aren't Having It", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T00:26:00.000+03:00", "replies_count": 0, "uuid": "9dec17132535374d3ce72cd519d4e5042902c478"}, "author": "", "url": "http://www.huffingtonpost.com/2015/04/30/democrats-trans-pacific-partnership-obama_n_7175186.html", "ord_in_thread": 0, "title": "Obama Accused Democrats Of Lying About Trade Deal, And They Aren't Having It", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Accused Democrats Of Lying About Trade Deal, And They Aren't Having It Posted: reddit \nWASHINGTON -- Democrats are not happy about President Barack Obama's accusation that they are being \"dishonest\" about his trade agenda. \nLast week, Obama told reporters that Democrats, including Sen. Elizabeth Warren (D-Mass.), who have called his controversial Trans-Pacific Partnership a \"secret\" agreement were not telling the truth, since much of the negotiation text is available to members of Congress. It was an unusually aggressive jab from the president, who rarely resorts to such rhetoric against Republicans, let alone members of his own party. Obama also accused his Democratic critics of spreading \"misinformation that stirs up the base but ultimately doesn't serve them.\" \nWarren and Sen. Sherrod Brown (D-Ohio) responded by pointing out that the pact remains classified, making it a crime for lawmakers to share its details with the public. In interviews with The Huffington Post this week, several other Democrats cried foul on Obama's attacks. \n\"I think that's unfair, and I think that rather than the president engaging in this war of words, he ought to take the concerns that have been expressed by a lot of Democrats seriously and try to address them,\" Rep. Jim McGovern (D-Mass.) told HuffPost. \"The White House shouldn't get defensive. What they should be doing is trying to work with us to make sure these concerns get addressed.\" \n\"These are his allies and he's trying to rally the troops because most members of Congress are opposed to this,\" Rep. Rosa DeLauro (D-Conn.) told HuffPost. \"This is about an honest disagreement, and I disagree.\" \nDemocrats, environmental organizations, labor unions, Internet freedom groups and many public health experts oppose TPP, saying it will exacerbate income inequality and hamper key regulatory protections. Republican leaders in Congress and corporate lobbying groups such as the U.S. Chamber of Commerce support it, saying it will boost economic growth. \nObama likely cannot get TPP through Congress without receiving \"fast-track\" authority, which would prevent legislators from amending the final deal. And fast-track authority cannot pass without Democratic support. House Majority Whip Steve Scalise (R-La.) warned Wednesday that GOP leadership does not yet have the votes needed, because a large contingent of tea party-aligned members are opposed to TPP. So far, only about a dozen House Democrats have come out in favor of the bill, and House Speaker John Boehner has said he thinks he will need 50 Democrats to cross the aisle to make up for defections from his own side. \nRep. Lloyd Doggett (D-Texas) said Obama is overselling the deal. \n\"After personally reading those limited portions of the agreement begrudgingly made available by [the U.S. Trade Representative], I can say that the book does not fully match the cover,\" Doggett told HuffPost. \"Let the public read the text now and decide for itself. If there is nothing to hide, why so secret?” \nRep. Alan Grayson (D-Fla.) concurred. Grayson has previously called the administration's access standards on TPP \"abuse of the classified information system.\" \n\"Let the American People see the secret trade giveaways, and then they can judge who is right and who is wrong,\" Grayson said. \nEven Democrats who are open to supporting Obama's trade agenda are unenthusiastic about the president's strategy of blasting members of his own party. \n\"Quite frankly, I think the administration has mishandled the political support for the bill,\" Rep. Charlie Rangel (D-N.Y.) said. \nObama said Friday that TPP makes substantial, progressive improvements over the 1993 North American Free Trade Agreement signed into law by President Bill Clinton. Unlike NAFTA, Obama emphasized, TPP will have enforceable labor and environmental standards. He also said the deal will help American automakers sell more cars in Japan, the largest economy of the 11 nations with which the U.S. is negotiating. \nBut plenty of Democrats seem unconvinced that TPP marks a genuine break with prior policy. \n\"Anybody wants to know what the trade bill plan can do, just look at NAFTA,\" Rep. James Clyburn (D-S.C.), the third-ranking House Democrat, told HuffPost. \nMany Democrats are particularly upset with Obama's refusal to include language barring currency manipulation as part of the deal. Both China and Japan have aggressively devalued their currencies to make their exports cheaper in the U.S., thereby undercutting American manufacturers. Obama said Friday that language to combat currency manipulation could interfere with the Federal Reserve's ability to boost the economy with its own monetary policy. It's an unusual objection, since currency manipulation involves purchasing large quantities of another country's assets, and the Fed has been buying up American bonds. \n\"The focus for most of us has been currency,\" Rep. Dan Kildee (D-Mich.) said. \"Their assertion that U.S. monetary policy could be considered currency manipulation is beyond a stretch -- it's just factually false. So to use that as a defense or somehow try to diminish the arguments we've been making about the importance of currency manipulation, to me, is a stretch that's just too far to accept.\" \nRep. John Yarmuth (D-Ky.) gave the administration credit for pursuing progressive priorities, but noted that it has not pursued Democratic priorities effectively. Dozens of union organizers in Colombia and Guatemala have been murdered during Obama's tenure -- sometimes amid active contract disputes -- and the AFL-CIO and other labor groups say the Obama administration has not effectively invoked existing trade rules to combat the violence. \n\"I think they can make a case that there’s a lot of good stuff in the TPP,\" Yarmuth told HuffPost. \"It is an improvement on the status quo, if it is enforced ... but the track record isn't too good on that.\" \n\"It's a tough thing because labor is a major part of our constituency,\" said Rep. Steve Cohen (D-Tenn.), who told HuffPost he has not made up his mind on TPP. \"Most of the supporters -- [the U.S. Chamber of Commerce] and the manufacturers -- are not. So it's politically difficult.\" Also on HuffPost: ", "external_links": [], "published": "2015-05-01T00:26:00.000+03:00", "crawled": "2015-05-01T00:28:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}