{"organizations": [], "uuid": "f5ec17b5c703af37350176713ddc1f0b7695207c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_041415getty.jpg", "site_section": "http://www.thehill.com/index.php?option=com_rd_rss&id=1", "section_title": "TheHill - Top News", "url": "http://thehill.com/homenews/administration/241745-obama-rips-fox-news-over-poor", "country": "US", "title": "Obama rips Fox News over poor", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama rips Fox News over poor", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T19:47:00.000+03:00", "replies_count": 0, "uuid": "f5ec17b5c703af37350176713ddc1f0b7695207c"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/241745-obama-rips-fox-news-over-poor", "ord_in_thread": 0, "title": "Obama rips Fox News over poor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama rips Fox News over poor By Jordan Fabian - 05/12/15 12:47 PM EDT \nPresident Obama on Tuesday criticized Fox News for showcasing people who represent negative stereotypes of the poor. \n“If you watch Fox news on a regular basis, they will find folks that make me mad,” Obama said during a panel discussion on poverty at Georgetown University. “I don’t know where they find them.” ADVERTISEMENT The president chided the network for showing people who “just want a free Obamaphone” and express no interest in work. \n“That becomes an entire narrative that gets worked up,” he said. \nIn the wake of unrest in Ferguson, Mo., and Baltimore, Obama has placed an increased focus on the root causes of the nation’s racial wounds, including poverty in minority communities. \nThe president called for increased investments to address income inequality and poverty to help young people have access to technology and job opportunities. \nBut he said it can be difficult to muster the political will to boost the social safety net because the wealthy are increasingly living apart from the poor and the middle class and are not in tune with their needs. \n“What used to be racial segregation now mirrors itself in class segregation,” he said. “The broader trends in our society will make it harder and harder for us to deal with both poverty and inequality.” \nToo often, there is an image of the poor people as “sponges” and “leeches” who “don't want to work,” Obama said. \nThe president called on the public to change how it views poor people, including finding out what it’s like to not be able to pay the bills. \n“Our job is to guard against cynicism, especially in this town,” Obama said. \n“[We should] not buy the idea the poor will always be with us and there is nothing we can do. There is a lot we can do, the question is, do we have the political will, the communal will to do it?” \nDuring the hour-plus long discussion, Obama did not hold back in offering his unvarnished views on class and race. \nHe hit back at critics who oppose his proposals to raise taxes to fund more social spending, such as eliminating the carried interest loophole for hedge fund managers to pay for early childhood education. \n“I have been called Hitler for doing this,” the president said, referencing criticism from prominent hedge fund chief Stephen Schwartzman. \nThe president said the top 25 hedge fund managers make more than all of the public school kindergarten teachers in the U.S. combined. \n“If we can’t ask from society’s lottery winners to just make that modest investment, then this conversation is just for show.” \n- Updated at 1:02 p.m.", "external_links": [], "published": "2015-05-12T19:47:00.000+03:00", "crawled": "2015-05-12T20:15:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}