{"organizations": [], "uuid": "70cd8a9cf6cb2e701ee16232ab8aa17319713622", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2933910/images/o-OBAMA-TORTURE-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/11/obama-administration-torture_n_7242542.html", "country": "", "title": "Obama Administration Faces Mounting Pressure To Answer For Torture", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Administration Faces Mounting Pressure To Answer For Torture", "spam_score": 0.0, "site_type": "news", "published": "2015-05-11T18:30:00.000+03:00", "replies_count": 0, "uuid": "70cd8a9cf6cb2e701ee16232ab8aa17319713622"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/11/obama-administration-torture_n_7242542.html", "ord_in_thread": 0, "title": "Obama Administration Faces Mounting Pressure To Answer For Torture", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "reddit \nWASHINGTON -- The Obama administration is facing renewed pressure to answer for its track record on torture after the relative calm that followed the release of the Senate torture report’s damning executive summary in December. \nIn a letter to Attorney General Loretta Lynch Friday, human rights group Amnesty International pressed the Justice Department to revisit its decision not to prosecute former officials from the CIA and the George W. Bush administration for their involvement in the agency’s post-9/11 torture program. The new evidence from the report prepared by the U.S. Senate Select Committee on Intelligence merits another look, says Salil Shetty, secretary general of Amnesty International, in the letter. \n“As the new Attorney General you have a critical responsibility to ensure the USA complies with its international human rights obligations to effectively investigate evidence of crimes under international law and to bring the suspected perpetrators to justice,” reads the letter, which is expected to arrive on Lynch’s desk Monday. “We urge you to personally examine the full SSCI report and to immediately order a 'preliminary review' into violations of federal and international laws, with a view to bringing an end to the impunity that has become the hallmark of this unlawful programme.” \nThe Justice Department did not immediately respond to a request for comment Monday. \nDOJ said in December that it would not reopen any investigation into the now-defunct torture program, which included the use of interrogation techniques like waterboarding, rectal feeding and stress positions. The department cited its own 2009 investigation, led by federal prosecutor John Durham. In 2012, then-Attorney General Eric Holder announced that Durham's investigation did not find grounds to file charges. \nBut critics have long argued that Durham and his team did not lead a thorough inquiry , and now they say the evidence in the Senate report -- a document that even President Barack Obama has said illustrates torture, which is illegal under U.S. and international law -- is cause for another look. \nDOJ has also declined to indicate whether anyone at the department has actually read the intelligence committee’s full report, which is 6,900 pages long and remains mostly classified. In court filings in January, the government indicated that no one at DOJ had opened the department's copy of the completed report, raising questions as to how, exactly, it had reached a decision not to prosecute the officials named in the study. \nThe department has consistently refused to clarify that position, citing ongoing litigation over a Freedom of Information Act request for the full torture report. \nThis is shaping up to be an uncomfortable week for the Obama administration as far as questions of torture and accountability are concerned. Early Monday morning, the U.S. appeared before the United Nations Council on Human Rights for its periodic review , its first appearance since the controversy over the Senate torture report in 2014. \nStanding before a jury of its peers, both friendly and not so friendly, the U.S. was pressed on its human rights record, and was asked specifically by more than a dozen member states about its failure to hold accountable any of the officials involved in the CIA’s torture program. \nSeveral countries, including Slovenia and the Czech Republic, had submitted questions for the U.S. about its failure to prosecute the former torturers or their superiors, as well as on the lack of legislative response to the report. \n\"What we would like to see is the U.S. say is that it will appoint a special prosecutor to conduct an investigation into torture in light of the Senate Torture report,\" said Laura Pitter, senior national security counsel for Human Rights Watch, in an email to The Huffington Post. \"We have a new attorney general who when asked at her confirmation hearing whether waterboarding was torture said 'yes' and that it was a crime. So perhaps we will see a different reaction this time to recommendations from countries that the U.S. should properly and credibly investigate torture.\" \nThe Obama administration is no stranger to U.N. criticism, especially on its failure to hold officials from the previous administration accountable for the torture program. In November, the U.N. Committee Against Torture slammed the Obama administration for slow-walking the release of the Senate report. U.N. officials also criticized the Durham investigation as sloppy and inadequate. Also on HuffPost: ", "external_links": [], "published": "2015-05-11T18:30:00.000+03:00", "crawled": "2015-05-11T19:38:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}