{"organizations": ["Gertrude Castellow Ford Center", "Republican", "Congress", "University of South Carolina", "University of Mississippi", "University of Pittsburgh", "Belmont University", "Xcel Center", "National Partnership for Women and Families", "Senate District on Chicago", "DNC", "UNITED STATES", "Iowa State University", "North Carolina State University", "U.S. Senate Barack Obama", "NAACP", "U.S. Senate", "Democratic"], "uuid": "c127b8ebfbe465977be17bb6819b9195db8503a0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2941394/images/o-MICHELLE-OBAMA-TUSKEGEE-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/12/angela-mcglowan-michelle-obama_n_7266510.html", "country": "", "title": "Fox News Guest: Michelle Obama Should Thank Affirmative Action For Her Success", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Fox News Guest: Michelle Obama Should Thank Affirmative Action For Her Success", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "c127b8ebfbe465977be17bb6819b9195db8503a0"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/12/angela-mcglowan-michelle-obama_n_7266510.html", "ord_in_thread": 0, "title": "Fox News Guest: Michelle Obama Should Thank Affirmative Action For Her Success", "locations": ["Williams-Brice Stadium", "South Carolina", "Springfield", "CHICAGO", "D.C.", "New Hampshire", "California", "LOS ANGELES", "WASHINGTON", "Tennessee", "D-NY", "IA", "US", "IL", "Raleigh", "Berlin", "Mississippi", "U.S", "NEW YORK", "Des Moines", "Evansville", "New York City", "New York", "U.S.", "EVANSVILLE", "Pennsylvania", "Colorado", "SPRINGFIELD", "Oxford", "Columbia", "Chicago", "CA", "Iowa", "MATTESON", "Indiana", "Pittsburgh", "Minnesota", "Washington", "Nashua", "Delaware", "Illinois", "Matteson", "Ames", "DC", "RALEIGH", "St. Paul", "NASHVILLE", "Montana", "Invesco Field", "Nashville", "North Carolina", "Denver", "Los Angeles", "South Dakota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Edwards", "Dick Cheney", "Malia", "Barack Obama", "Alan Keyes", "Calvin Klein", "Michelle", "Dunand", "John", "Joe", "Jill", "Hillary Clinton", "J. Richards", "Mark", "Frederick M. Brown/Getty", "Neal Hamberg/Bloomberg", "Joe Biden", "Marcel Thomas/FilmMagic", "Charles", "Alex", "Obama", "Michelle Obama", "E. Jason Wambsgans/Chicago", "Winfrey", "Tim", "McCain", "Sasha", "Oprah Winfrey"], "text": "Michelle Obama: Before She Was FLOTUS of   CHICAGO - NOVEMBER 2: Candidate for the U.S. Senate Barack Obama (D-IL) sits with his wife Michelle and daughters Sasha (L) in a hotel room as they wait for election returns to come in November 2, 2004 in Chicago, Illinois. Obama is expected to win easily against the Republican candidate Alan Keyes. (Photo by Scott Olson/Getty Images) UNITED STATES - JULY 27: DEMOCRATIC NATIONAL CONVENTION--Democrat Illinois state Sen. Barack Obama, and wife, Michelle, embrace after he delivered the keynote address during the Democratic National Convention. (Photo by Scott J. Ferrell/Congressional Quarterly/Getty Images) MATTESON, IL - AUGUST 4: Barack Obama blows out candles on his birthday cake at his 43rd birthday celebration with his wife Michelle, who is holding the cake, and daughters Sasha and Malia (R) during a fundraiser August 4, 2004 in Matteson, Illinois. Obama is the Democratic candidate from Illinois running for the U.S. Senate and currently represents Illinois' 13th Senate District on Chicago' s South Side. (Photo by Tim Boyle/Getty Images) U.S. Senator elect Barack Obama of Illionis shares a moment with his wife, Michelle, and children during a victory party at the Hyatt Regency in Chicago, Illinois, on November 2, 2007. (Photo by E. Jason Wambsgans/Chicago Tribune/MCT via Getty Images) WASHINGTON - JANUARY 4: U.S. Senator Barack Obama (D-IL) (2nd L) poses for with his wife Michelle (2nd R), Vice President Dick Cheney (R), daughters (C) Malia and Sasha during the reenactment of a swearing -in ceremony on Capitol Hill January 4, 2005 in Washington, DC. The 109th Congress was sworn in January 4. (Photo by Alex Wong/Getty Images) LOS ANGELES, CA - MARCH 19: Senator Barack Obama and his wife Michelle arrive at the 36th NAACP Image Awards at the Dorothy Chandler Pavilion on March 19, 2005 in Los Angeles, California. (Photo by Frederick M. Brown/Getty Images) SPRINGFIELD, IL - FEBRUARY 10: Senator Barack Obama (D-IL) (2nd-L) his daughters Sasha (L) and Malia (C) and his wife Michelle (R) wave to a crowd gathered on the lawn of the old State Capital Building February 10, 2007 in Springfield, Illinois. Obama announced to the crowd that he would seek the Democratic nomination for President. (Photo by Scott Olson/Getty Images) AMES, IA - FEBRUARY 11: Michelle Obama, wife of Senator Barack Obama (D-IL), shares a moment with her daughter Sasha as the Senator addresses a crowd gathered at a campaign rally at Iowa State University February 11, 2007 in Ames, Iowa. Obama is wrapping up a two-day campaign swing through Iowa after announcing February 10, that he would seek the Democratic nomination for President. (Photo by Scott Olson/Getty Images) UNITED STATES - MAY 27: Democratic presidential candidate Barack Obama kisses his wife Michelle prior to speaking at an 'ice cream social' campaign event at Veterans Memorial Park in Berlin, New Hampshire, on Sunday, May 27, 2007. Obama and his family are spending two days campaigning through northern New Hampshire. (Photo by Neal Hamberg/Bloomberg via Getty Images) DES MOINES, IA - JULY 4: Democratic presidential hopeful Barack Obama is joined by his wife Michelle and daughters, Malia and Sasha at a campaign event, July 4, 2007 in Des Moines, Iowa. The U.S. senator from Illinois, who is on a two-day campaign swing through Iowa, recently announced that his campaign had raised $32.5 million in the second quarter, outpacing rival Sen. Hillary Clinton (D-NY), who pulled in $20 million. (Photo by Charles Ommanney/Getty Images) DES MOINES, IA - AUGUST 16: Democratic Presidential Candidate Senator Barack Obama (D-IL) gives his wife Michelle a playful kiss as they tour the Iowa State Fair August 16, 2007 in Des Moines, Iowa. The fair runs until August 19th and is expected to draw about 1 million people. John Edwards also made a campaign stop at the fair today. (Photo by Scott Olson/Getty Images) Illinois Senator and Democratic presidential hopeful Barack Obama's wife, Michelle, waves to the crowd during a campaign rally also attended by television host Oprah Winfrey 09 December 2007 inside the University of South Carolina's Williams-Brice Stadium in Columbia, South Carolina. Talk show host and pop culture kingmaker Winfrey stumped a second day for Obama, bringing showbiz buzz to the campaign trail. Fans of Winfrey and Obama lined up outside the 80,000-seat football stadium before dawn to catch a glimpse of their heroes. AFP PHOTO/Paul J. Richards (Photo credit should read PAUL J. RICHARDS/AFP/Getty Images) DES MOINES, IA - DECEMBER 8: Talk show host Oprah Winfrey (L) and Michelle Obama embrace at a rally for her husband Democratic presidential hopeful Sen. Barack Obama (D-IL) December 8, 2007 in Des Moines, Iowa. Obama and Winfrey are scheduled to make two stops in Iowa before heading off to campaign events in South Carolina and New Hampshire tomorrow. (Photo by Scott Olson/Getty Images) Democratic presidential hopeful Barack Obama is embraced by his wife Michelle as he addresses supporters at a primary election results rally in Nashua, 08 January 2008. According to US media reports, Obama lost the state to rival New York Senator Hillary Clinton. AFP PHOTO/Emmanuel DUNAND (Photo credit should read EMMANUEL DUNAND/AFP/Getty Images) CHICAGO - FEBRUARY 05: Democratic presidential hopeful Sen. Barack Obama's (D-IL) wife Michelle Obama waves and greets supporters during a Super Tuesday primary campaign rally at the Hyatt Hotel February 5, 2008 in Chicago, Illinois. Obama is facing off with rival contender Sen. Hillary Clinton (D-NY) on the biggest 'Super Tuesday' in American history. (Photo by Chip Somodevilla/Getty Images) Democratic presidential candidate US Senator Barack Obama and his wife Michelle during a rally at University of Pittsburgh in Pittsburgh, Pennsylvania, April 21, 2008. Pennsylvania will hold its primary vote on April 22. AFP PHOTO/Emmanuel Dunand (Photo credit should read EMMANUEL DUNAND/AFP/Getty Images) RALEIGH, NC - MAY 6: Democratic presidential hopeful U.S Senator Barack Obama (D-IL)'s (D-IL) wife Michelle Obama backstage before her husband's speech during a rally at the North Carolina State University arena May 6, 2008 in Raleigh, North Carolina. Obama won the North Carolina primary while his opponent Sen. Hillary Clinton (D-NY) held an early lead in Indiana. (Photo by Charles Ommanney/Getty Images) EVANSVILLE, IN - APRIL 22: Michelle Obama, wife of Democratic presidential candidate Sen. Barack Obama of Illinois listens as her husband addresses supporters at a rally April 22, 2008 in Evansville, Indiana. Late exit polls showed Obama losing the Pennsylvania primary to rival Sen. Hillary Clinton of New York by ten percentage points. (Photo by Scott Olson/Getty Images) CHICAGO - JUNE 3: Democratic presidential hopeful Sen. Barack Obama (D-IL) (L) and his wife Michelle Obama prepare to board their plane to travel to St. Paul, Minnesota, June 3, 2008 in Chicago, Illinois. Obama, nearing the number of delegates needed to win the Democratic presidential nomination, is to attend a rally at the Xcel Center in St. Paul after the Democratic primaries in Montana and South Dakota. (Photo by Chip Somodevilla/Getty Images) NEW YORK - JUNE 17: Michelle Obama attends a fundraiser for husband Democratic presidential candidate Sen. Barack Obama (D-IL) at designer Calvin Klein's home on June 17, 2008 in New York City. (Photo by Marcel Thomas/FilmMagic) WASHINGTON - JUNE 20: Michelle Obama, wife of presumed Democratic presidential candidate Sen. Barack Obama (D-IL), addresses about 900 people at the National Partnership for Women and Families annual luncheon June 20, 2008 in Washington, DC. Obama expressed her support for the organization and talked about the challenges of being a working mother. (Photo by Chip Somodevilla/Getty Images) US Democratic presidential candidate Illinois Senator Barack Obama's wife Michelle (R) and running mate Delaware Senator Joe Biden's wife Jill arrive at a rally in Springfield, Illinois, on August 23, 2008. AFP PHOTO/Emmanuel Dunand (Photo credit should read EMMANUEL DUNAND/AFP/Getty Images) Date created: DENVER - AUGUST 25: Michelle Obama (C), wife of presumptive Democratic nominee U.S. Sen. Barack Obama (D-IL), stands with her daughters Sasha (L) and Malia on stage during day one of the Democratic National Convention (DNC) at the Pepsi Center August 25, 2008 in Denver, Colorado. The DNC, where U.S. Sen. Barack Obama (D-IL) will be officially nominated as the Democratic candidate for U.S. president, starts today and finishes August 28th. (Photo by John Moore/Getty Images) DENVER - AUGUST 28: Democratic U.S. Presidential nominee Sen. Barack Obama (D-IL) (R) kisses his wife Michelle Obama after his speech on day four of the Democratic National Convention (DNC) at Invesco Field at Mile High August 28, 2008 in Denver, Colorado. U.S. Sen. Barack Obama (D-IL) is the first African-American to be officially nominated as a candidate for U.S. president by a major party. (Photo by Joe Raedle/Getty Images) OXFORD, MS - SEPTEMBER 26: Democratic presidential candidate U.S. Sen. Barack Obama (D-IL) and his wife Michelle walk off of the stage after the first of three presidential debates before the 2008 election September 26, 2008 in the Gertrude Castellow Ford Center at the University of Mississippi in Oxford, Mississippi. Both candidates arrived in Oxford after taking part in negotiations the previous day in Washington, D.C. to solve the current financial crisis. (Photo by Win McNamee/Getty Images) NASHVILLE, TN - OCTOBER 07: Michelle Obama, wife of Democratic presidential candidate Sen. Barack Obama (D-IL), shakes hands after during the Town Hall Presidential Debate between Obama and McCain at Belmont University's Curb Event Center October 7, 2008 in Nashville, Tennessee. Tonight's debate is the second presidential debate of three, the only one being held in the town hall style with questions coming from audience members. (Photo by Mark Wilson/Getty Images) NASHVILLE, TN - OCTOBER 07: Michelle Obama, wife of Democratic presidential candidate Sen. Barack Obama (D-IL), shakes hands after during the Town Hall Presidential Debate between Obama and McCain at Belmont University's Curb Event Center October 7, 2008 in Nashville, Tennessee. Tonight's debate is the second presidential debate of three, the only one being held in the town hall style with questions coming from audience members. (Photo by Mark Wilson/Getty Images)  Share ", "external_links": [], "published": "2015-05-12T03:00:00.000+03:00", "crawled": "2015-05-12T20:21:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}