{"organizations": [], "uuid": "b8406e1c3d26dbbcc33feaff32142f78cd554694", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/14/nukes-nukes-everywhere-and-obama-fails-to-rein-them-in/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422605290257.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/14/nukes-nukes-everywhere-and-obama-fails-to-rein-them-in.html", "country": "", "title": "Nukes, nukes, everywhere and Obama fails to rein them in | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Nukes, nukes, everywhere and Obama fails to rein them in | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "b8406e1c3d26dbbcc33feaff32142f78cd554694"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/14/nukes-nukes-everywhere-and-obama-fails-to-rein-them-in.html", "ord_in_thread": 0, "title": "Nukes, nukes, everywhere and Obama fails to rein them in | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nFrom the start of his presidency, Barack Obama made reducing the world’s stock of nuclear weapons a priority, but that vision is now in shambles. \nLast week, we learned that North Korea is quietly expanding its uranium-enrichment capacity at the Yongbyon facility. Nuclear-watchdog analyses of satellite photos and other data show that while Pyongyang had 2,000 centrifuges there three years ago, it now has 4,000. This doubling of capacity will let the Kim regime build four enriched-uranium bombs a year. \nAnalysts believe that Pyongyang has built fewer than a dozen plutonium-based bombs since it first tested a crude device in 2006. Now, with the more efficient enriched-uranium path, its capacity to threaten its neighbors is growing by leaps and bounds. \n[pullquote] \nMeanwhile, as the North Koreans turn from plutonium to enriched uranium, Iran is moving in the opposite direction. More On This... Obama under fire for failing to curb nuclear proliferation \nThe Wall Street Journal reported last week that, while the world has for years concentrated on the pace of Iran’s spinning centrifuges in secret enrichment sites like the Fordow facility, Tehran has quietly advanced plutonium production at its heavy-water plant in Arak — an alternate path that may allow it to build a bomb by next summer. \nTesting plutonium-fueled bombs is how India and Pakistan went nuclear in the late 1990s, when they broke the five-superpower monopoly on nuclear weapons and ended a balance of power that had lasted for most of the second half of the 20th century. \nOf course, Iran might just become “merely” a nuclear-ready power. The message will still be the same: We’re here, we’re nuclear, get used to it. \nBut it doesn’t end there. \nAs the world’s worst regime is set to further threaten East Asia, North Korea’s neighbors are unlikely to sit by and watch — especially when America is cutting naval budgets that once guaranteed their safety. \nJapan, for one, has all the technology it needs to become a nuclear power. For all the deep historical trauma in the country of Hiroshima and Nagasaki, Tokyo may have no choice but to get its own bomb as the North Korean threat grows. \nDitto South Korea, Indonesia, et al. \nAnd as the Mideast sectarian wars heat up, Saudi Arabia, its Gulf neighbors and other Sunni stalwarts like Turkey are unlikely to let Shiite Iran become the neighborhood’s only nuclear power. \nAs the club grows, going nuclear gets ever easier. Pakistan’s A.Q. Khan showed in the last decade how readily scientists can spread nuclear know-how. \nWhat about Obama? In 2009, Obama told Czechs in a Prague speech that one of his top goals as president would be to “seek the peace and security of a world without nuclear weapons.” He then pursued nuclear-arms-reducing pacts with Russia with all the enthusiasm of a 1980s “no-nukes” campus activist. \nAlong the way, he angered those Czechs and other European allies, like Poland, as he scrapped missile-defense projects just to induce Moscow to sign those treaties. \nBut signing those pacts didn’t shift the world’s course — because this era’s nuclear story isn’t about the size of US and Russian arsenals. \nAnd as he worked on his Moscow “reset,” Obama’s half-hearted attempts to reverse Pyongyang nuclear advances went nowhere. And he’s seen no progress on his declared goal of stopping Iran from getting the bomb, either. \n(That may yet change: Citing “music I’m hearing lately from Washington,” former Israeli army intelligence chief Amos Yadlin said last week that Obama’s “red light” on Israeli attacks against Iran’s nuclear facilities “hasn’t changed to green, I think, but it’s definitely yellow.”) \nFor now, Obama’s holding off on any Iran moves until he determines if Iran’s new president, Hassan Rouhani, is really-really serious about diplomacy. \nBut the Arak heavy water facility is scheduled to go “hot” within months — at which point it would be virtually immune to bombings. So the US military threat may soon be nonexistent. \nAnd as for our North Korea policy — well, we have none. \nHow far will the nuclear club grow? With so many less-savory regimes getting The Bomb, it’s going to be tough to keep them from proliferating next to top terror groups. \nWe’re fast advancing toward a radical global shift, in which everybody and his uncle will possess history’s most destructive weapons. \nSo, yes, War Is Bad For Children And Other Living Things. But no, the policy equivalent of hanging that poster on your dorm-room wall won’t stop it. \nThis opinion article originally appeared in the New York Post . \nBenny Avni is a New York Post columnist. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:14:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}