{"organizations": [], "uuid": "dcb8972c33c43d4d777afac309a5b508bcbe99c5", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/102113/0/0/102113_sr_goler_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/22/president-obama-wants-and-your-kids-to-be-his-co-victims.html", "country": "", "title": "President Obama wants you and your kids to be his co-victims | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "President Obama wants you and your kids to be his co-victims | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "dcb8972c33c43d4d777afac309a5b508bcbe99c5"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/22/president-obama-wants-and-your-kids-to-be-his-co-victims.html", "ord_in_thread": 0, "title": "President Obama wants you and your kids to be his co-victims | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Is Obama locked in a victim mentality? \nThis explains why Barack Obama took no exception to his wife’s statement that she had never been proud of America during her adult life, until Democrats began rallying around her husband’s campaign during February, 2008. \nThis explains the president’s opposition to gun rights, because an armed man or woman is, more likely than not, an autonomous individual. That cannot be tolerated by someone who feels he has been victimized by stronger people, again and again. \nThis explains the president’s desire to redistribute wealth, taking away power from those who have accumulated influence by accumulating assets. \nThis explains the president’s zeal to force Americans to buy services (health insurance) that they may not want. Independent adults decide how to use their money. \nThis explains the President’s disempowering message to business owners that they didn’t build the companies they own; government made it possible. The owners were never resourceful or courageous or smart. \nThis explains the president’s attack on the Constitution as reflecting “deep flaws in American culture.” \nThis explains the president’s zeal to make as many people as possible dependent on food stamps, unemployment, government-sponsored health insurance and subsidized housing. Because the only trustworthy American is a disempowered American. \nThe only decent America, to this president, in fact, is a disempowered America. \nThat’s why the president is driving America deeper into debt. \nThat’s why the president favors cutting the military. \nThat’s why the president won’t secure the borders. An America that bleeds in either direction at its borders is an anemic America. And an anemic America is the only America Barack Obama can love. Because it can’t hurt him or the many millions of people he considers his co-victims. \nHow do Americans defend themselves against a leader who wishes to sideline them by making them feel injured, oppressed and deserving of restitution? \nFirst, we must recognize the psychological game being played. Because once you know that someone is trying to diminish you, to empty you out, you start looking at that person and his ideas very differently. The end of the game is in sight. \nWe must get as many Americans as possible to realize that food stamps when you don’t absolutely need them are no better than any other drug. \nWe must remind Americans in every way possible that an offer of 99 weeks of unemployment checks is a toxic message to stay home and not go all-out to find a job. \nWe must remind Americans that 50 cents earned is a far more reliable road to financial independence than 75 cents taken from public coffers. \nWe must remind Americans that keeping their children on their health insurance policies until those children are 26-year-old adults is a dangerous message to those adults that could hobble them--forever. \nWe must remind Americans that gun ownership, in these days of disempowerment politics, is not only a right, but a civic responsibility. \nWe must build private charities for our fellow Americans in need, but tie them to measureable efforts and achievements, in order to put the government out of the psychological bloodletting business. \nThis president is victim-in-chief. He is the Disempowerment President. \nRemember, when Moses stood before the burning bush, God did not tell him that the stammer Moses suffered from was a good reason to avoid visiting the Pharaoh. \nGod did not agree that Moses was broken and should stay home. \nHe told him that he was the one for the job. And he told him that if the Pharaoh asked the name of God, that Moses should respond, “Tell them ‘I am has sent me to you.’” \nI am. We all are. There is greatness possible from every one of our sons and daughters. And we are long overdue in recognizing that the President of the United States wants to convince them, otherwise. \nDr. Keith Ablow is a psychiatrist and member of the Fox News Medical A-Team. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:10:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}