{"organizations": ["Islamic State Obama"], "uuid": "8a7638b28774db56fd5ce1eebf7f6afdff4ea5b6", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2015/05/21/obama-us-is-not-losing-fight-against-islamic-state/", "country": "IL", "title": "Obama: U.S. is not losing fight against Islamic State", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama: U.S. is not losing fight against Islamic State", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T00:35:00.000+03:00", "replies_count": 0, "uuid": "8a7638b28774db56fd5ce1eebf7f6afdff4ea5b6"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/05/21/obama-us-is-not-losing-fight-against-islamic-state/", "ord_in_thread": 0, "title": "Obama: U.S. is not losing fight against Islamic State", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama: U.S. is not losing fight against Islamic State   EFE \nPresident Barack Obama said in an interview published Thursday that the United States is not losing the fight against the Islamic State jihadist group in Iraq and Syria, but he acknowledged that it will be necessary to intensify the training of Sunni militias in some zones to support Iraqi military forces. \n\"I don't think we're losing. There's no doubt there was a tactical setback, although Ramadi had been vulnerable for a very long time,\" Obama said in an interview with news magazine The Atlantic, a few days after the Iraqi city of Ramadi was overrun by IS fighters. \nObama blamed the IS capture of Ramadi, the capital of Al Anbar province, on the lack of training and reinforcement of Iraq's security forces. \n\"They have been there essentially for a year without sufficient reinforcements,\" he said, adding that \"it is indicative that the training of Iraqi security forces, the fortifications, the command-and-control systems are not happening fast enough in Anbar, in the Sunni parts of the country.\" \nHe also admitted that it is necessary to do a better job in enlisting Sunni tribesmen in Al Anbar province to fight against the IS, something the Shiite-headed national government has not been doing. \nIraq's Sunni minority, for its part, is deeply mistrustful of the Iraqi armed forces, which are dominated by Shiite commanders, and also the Shiite militias supported by Iran that have been key in expelling the IS from other cities such as Tikrit. \nMeanwhile, in the north, the Iraqi Kurdish forces have kept the IS at bay while the U.S.-led international coalition has been carrying out airstrikes on the jihadists since last autumn across a wide area running from northwestern Syria to the outskirts of Baghdad. \nObama, however, denied once again that he is considering sending U.S. ground troops into Iraq. \n\"There's no doubt that in the Sunni area we're going to have to ramp up not just training, but also commitment, and we better get Sunni tribes more activated than they currently have been,\" he said. \nThe White House has been the target of harsh criticism since the IS gained a significant advantage over the Syrian army by taking the city of Palmyra, a move that put the jihadists in control of more than half of Syrian territory. EFE", "external_links": [], "published": "2015-05-22T00:35:00.000+03:00", "crawled": "2015-05-22T01:15:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}