{"organizations": [], "uuid": "87c0080cd2ffc24e7563807a425ada1c5f716b00", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/arpaiojoe_122214getty.jpg", "site_section": "http://thehill.com/taxonomy/term/49/feed#", "section_title": "The Hill: All Regulation", "url": "http://thehill.com/regulation/court-battles/240951-appellate-court-hears-arguments-in-case-challenging-obamas-executive", "country": "US", "title": "Court hears challenge to Obama's immigration actions", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Court hears challenge to Obama's immigration actions", "spam_score": 0.0, "site_type": "news", "published": "2015-05-04T20:10:00.000+03:00", "replies_count": 0, "uuid": "87c0080cd2ffc24e7563807a425ada1c5f716b00"}, "author": "lwheeler@thehill.com (Lydia Wheeler)", "url": "http://thehill.com/regulation/court-battles/240951-appellate-court-hears-arguments-in-case-challenging-obamas-executive", "ord_in_thread": 0, "title": "Court hears challenge to Obama's immigration actions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Court hears challenge to Obama's immigration actions Getty Images By Lydia Wheeler - 05/04/15 01:10 PM EDT Justices on the nation's second most influential court questioned Monday whether Arizona Sheriff Joseph Arpaio has legal standing to challenge President Obama’s executive actions on immigration. \nThe outspoken lawman is challenging Obama's move last year to shield millions of illegal immigrants from deportation. But during arguments before the U.S. Court of Appeals for the D.C. Circuit, a panel of three justices appeared skeptical of the case. ADVERTISEMENT “Your client has to have standing to raise the challenge he’s raising and you have to show how the president’s program is causing harm to your client and how the relief he seeks would address that harm,” Judge Cornelia “Nina” Pillard said. Larry Klayman, the attorney representing Arpaio, said his client had to spend $9 million from February to December 2014 to handle an increase in the number of immigrants being incarcerated in his Maricopa County jail. Because of the president’s actions, he said immigrants who would have otherwise been deported are staying in the country and becoming repeat offenders. “Only the most severe criminals are deported, but the lower level criminals are in these jails and it’s raising the cost for Maricopa Country,” Klayman said. Arpaio is appealing U.S. District Judge Beryl Howell’s December 2014 decision to dismiss the case. In her opinion, she said Arpaio brought up important issues in his lawsuit, but lacked legal standing to file the suit because he couldn't show he suffered direct harm from Obama’s actions. Now Arpaio is asking the federal court of appeals to overturn Howell’s decision and stop the president from giving legal status and work permits to nearly five million illegal immigrants. The case stems from actions Obama took in November to expand eligibility for the Deferred Action for Childhood Arrivals program, or DACA, which offers protections to immigrants brought to the United States illegally as children. He also created a new program to allow parents of U.S. citizens and permanent residents to apply for amnesty. Klayman argues that Obama’s orders not only keeps criminals in the country, but acts as a “magnet,” attracting new immigrants to enter the country illegally. Beth Brinkmann, the attorney representing the Obama administration and the Department of Justice, said Obama’s policies do not allow an application to be made by someone who has committed a crime. Judge Sri Srinivasan questioned whether the president's orders would apply to a person with only one misdemeanor, but Brikmann said low-level misdemeanors don't require jail time. Because Obama’s orders don't apply to illegal immigrants who entered the country after Jan. 1, 2010, immigrants that have felonies, multiple misdemeanors or pose a threat to public safety or national security, she said Klayman's theory of increased crime is “unlikely” and “speculative.” “The court’s opinion below really shows why this is a non-judicial matter,” she said. Two of the judges hearing the case — Srinivasan and Pillard — were nominated to the court by Obama. Judge Janice Rogers Brown was nominated by Republican President George W. Bush. Tags:", "external_links": [], "published": "2015-05-04T20:10:00.000+03:00", "crawled": "2015-05-05T02:58:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}