{"organizations": ["Fox News Obama"], "uuid": "775147af11cfcb0907d70bddfa4fb95a01e54638", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/060513/0/0/reporter_doocy_060513.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/05/real-reason-obama-tapped-susan-rice-for-national-security-adviser.html", "country": "", "title": "The real reason Obama tapped Susan Rice for national security adviser | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The real reason Obama tapped Susan Rice for national security adviser | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "775147af11cfcb0907d70bddfa4fb95a01e54638"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/05/real-reason-obama-tapped-susan-rice-for-national-security-adviser.html", "ord_in_thread": 0, "title": "The real reason Obama tapped Susan Rice for national security adviser | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Susan Rice", "Obama"], "text": "Obama’s Inner Circle Shrinks Again \nSusan Rice can’t do any of those things. \nShe has zero credibility with the media, on Capitol Hill, with the foreign policy community and foreign leaders, and is so badly tarnished by the Benghazi scandal that she walks into the job on Day One weak and wounded. \nThe most obvious problem is her disastrous performance on the Sunday talk shows peddling the administration’s fairy tale on Benghazi; when she was either complicit in the cover-up or incompetent. \nEither she knew what really happened and deliberately lied to the American people or she was a mere actress who read the script she was given and didn’t know enough to question whether the words she spoke were accurate. \nRice might have been able to overcome the Benghazi debacle if she had other strong credentials, for example being a senior military officer like Colin Powell and Brent Scowcroft, or a respected academic like Henry Kissinger and Zbig Brzezinski. But Susan Rice is none of these. \nWhen the spotlight was on her at the U.N. she was an ineffective ambassador who couldn't get Russia or China on board to deal with Syria or impose strict sanctions against Iran. \nNot only did she fail to persuade those key members of the Security Council, she didn't know it until after the votes on sanctions were taken! Benghazi was supposed to be her audition for the Secretary of State job -- go on all the Sunday talk shows and be the Obama administration’s primary spokesman. \nShe was so eager for the try out that she didn't stop and ask why they wanted her. The decision to send someone from the administration to appear on all five talk shows is a decision made at the highest levels of the White House. \nIt should have been the Secretary of State, or maybe Secretary of Defense, or CIA chief, or NSC Adviser or White House Chief of Staff – they were part of the decision process. \nSusan Rice was the one senior administration official who knew nothing about events leading up to Benghazi and the attack itself, yet the White House asked her to go on those shows? \nAlarm bells should have gone off in her head! \nI checked their schedules and most of the other senior officials were in Washington and available that morning. It’s just that they were smarter than Rice and realized it was a poisoned chalice. So what is Obama thinking with the Rice appointment? He’s doubling down and circling the wagons. He's rewarding Rice for being a loyal (if incompetent) soldier. He is hanging tough on the scandals and claiming that he knew nothing about them until he read about them in the papers. \nOn the other hand, maybe Obama's appointment of Rice is smarter than it looks on the surface. \nBy appointing Rice to the NSC job the president can invoke executive privilege and claim she doesn’t have to testify on Capitol Hill. And even if she does talk about Benghazi, at some point, she will certainly be a loyal soldier if she is now sitting just steps from the Oval Office. \nBut despite what the president might want the Benghazi isn't over, not by a long shot. \nKathleen Troia \"K.T.\" McFarland is a Fox News National Security Analyst and host of FoxNews.com's \"DefCon 3.\" She served in national security posts in the Nixon, Ford and Reagan administrations. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}