{"organizations": [], "uuid": "46299d942de10e8fd17e9a06f57fd2728c747c64", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamamcconnell_050515gn.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed#", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/242274-washingtons-new-odd-couple-mcconnell-and-obama", "country": "US", "title": "Washington’s new odd couple: McConnell and Obama", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Washington’s new odd couple: McConnell and Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-05-18T13:00:00.000+03:00", "replies_count": 0, "uuid": "46299d942de10e8fd17e9a06f57fd2728c747c64"}, "author": "dweaver@thehill.com (Alexander Bolton and Jordan Fabian)", "url": "http://thehill.com/homenews/administration/242274-washingtons-new-odd-couple-mcconnell-and-obama", "ord_in_thread": 0, "title": "Washington’s new odd couple: McConnell and Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington’s new odd couple: McConnell and Obama By Alexander Bolton and Jordan Fabian - 05/18/15 06:00 AM EDT \nWashington's new odd couple is President Obama and Senate Majority Leader Mitch McConnell. \nThe longtime adversaries — McConnell memorably said his top priority was to make Obama a one-term president — are suddenly cooperating on trade legislation and saying nice things about one another. ADVERTISEMENT It's a marriage of convenience more than a new era, but the two leaders suddenly find themselves with common interests.\nMcConnell, a Republican from Kentucky, wants to show the Senate can get things done by turning bills into law, while Obama wants to add to his legislative legacy. \nOn trade, they happen to agree. And while things are likely to get tougher down the road, there are reasons to think McConnell and Obama could eventually make deals on issues such as infrastructure funding, raising the debt ceiling and dealing with the budget cuts under sequestration. \nMcConnell sees their budding alliance as the latest in a long line of peculiar political partnerships, stretching back to Bill Clinton and Newt Gingrich on welfare reform and Ronald Reagan and Tip O’Neill on overhauling Social Security. \n\"A lot of folks like to joke about the odd couple that was [last Sen.] Ted Kennedy [D-Mass.] and [Sen.] Orrin Hatch [R-Utah],\" McConnell said last weekend at the Edward M. Kennedy Institute in Boston. \"But I think Mitch McConnell and Barack Obama may have them outdone.” \nMcConnell surprised reporters a week earlier when he complimented Obama at the Senate GOP leadership’s weekly press conference, which is usually devoted to bashing the president’s policies. \nHe praised Obama for “speaking the truth to his base” and showing “he is intent on working with us” to pass fast-track negotiating authority for trade deals. \nObama surprised members of his party by dismissing the anti-trade arguments of Sen. Elizabeth Warren (D-Mass.) as not standing “the test of fact and scrutiny.” \nMcConnell’s aides say he has always been willing to work with the president. They say the trade debate is a rare instance when Obama has been willing to stand up to his party’s left wing. \n“It validates what McConnell has been saying for the last six and a half years. If the president wants to join us on something that’s good for the country, we will work with him. This is an example of that,” said Don Stewart, McConnell’s spokesman. \nMcConnell urged Obama shortly after he won the 2008 election to work with Republicans and Democrats in Congress on reforming Social Security, Medicare and Medicaid. \n“And here’s my pledge — if they do so, they can expect more cooperation from Republicans than the last president received from them,” McConnell said at the National Press Club in January in 2009. \nJosh Holmes, McConnell’s former chief of staff, said his old boss and the president aren’t personal friends by any stretch, but that doesn’t mean they can’t share common goals. \n“McConnell has been so straightforward for so long. He doesn’t view business in Washington through a personal context. Almost everybody else does,” Holmes said. \n“The way that he works is, that if both sides are genuinely interested in coming to an accommodation that they can live with on any issue, he’s willing to hear the other side out and try get something done provided its mutually beneficial and beneficial to the country,” he added. \nDarrell West, the director of Governance Studies at the Brookings Institution, said McConnell knows Republicans face a difficult political environment next year when Hillary Clinton, the Democrats’ expected presidential nominee, will draw more liberal voters to the polls. \n“McConnell does need to improve his party imaging into the 2016 election. People nationally have more negative view of Republicans compared to Democrats. If McConnell can find a few areas to work with the president, it would boost the party’s image in several ways,” he said. \nThe White House has extended an olive branch to McConnell as it works to push legislation through Congress. \nObama recently sent a handwritten note to McConnell thanking him for supporting Loretta Lynch’s nomination to serve as the nation’s first female African-American attorney general. \nMcConnell noted the rare gesture during his remarks at the Kennedy Institute. \n“The president has a good deal of respect for Senator McConnell,” White House spokesman Eric Schultz told reporters on Friday, noting the two leaders worked “closely together” to build a bipartisan support for fast-track. \nAides to Obama and McConnell have been in close touch over the past few weeks as trade legislation has advanced through the Senate. \nLawmakers hope the cooperation will extend to other thorny political issues, such as transportation funding, prison-sentencing reform and avoiding a government shutdown in the fall. \n“To the extent the majority leader and the president are making nice, I’m happy. We need a lot more consensus in the federal government. There’s partisanship at every turn,” said Republican Sen. Roger Wicker (Miss.). \nWicker said he hopes McConnell and Obama can revive the moribund appropriations process, which has been stymied in recent years by sharp fighting over spending levels, but said he’s not holding his breath. \n“How do trade deals get done? They get done with Republican congresses and Democratic administrations. It’s the way it’s supposed to work,” he said. \n“I think it’s more the fact that this is trade and trade is special. If we could do that on bringing the appropriation bills forward, that would really be something,” Wicker added. \nWhite House officials aren’t making any predictions about whether the Obama-McConnell alliance will last. \n“I don’t have any grand projections to make for you about their relationship,” Schultz said. \nDespite their collaboration on trade, the White House and McConnell remain at odds on several other issues. \nThe White House on Friday pressured the Senate to pass the USA Freedom Act, which would reform the National Security Agency’s controversial bulk data collection program. \nBut McConnell does not want changes to the NSA and is pushing for a “clean” extension of the Patriot Act before the June 1 deadline. \nThe president this week said he would have to change the mindsets of McConnell and Speaker John Boehner (R-Ohio) when it comes to poverty and income inequality, two issues that figure prominently in Obama’s agenda. \nDuring a panel discussion on Tuesday at Georgetown University, a moderator asked Obama how he would sway the two GOP leaders if they were watching. \n“I assure you they’re not watching this,” the president quipped. \nAnd despite Obama’s respect for the Senate leader, it’s apparent they don’t have a close personal relationship. \nCase in point: the “bourbon summit” that Obama suggested holding with McConnell after the Republicans’ midterm victory in November still has not taken place.", "external_links": [], "published": "2015-05-18T13:00:00.000+03:00", "crawled": "2015-05-18T15:03:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}