{"organizations": [], "uuid": "09cc8b75c3cd984650d5fedc2f86c0c2cbbeede0", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Entertainment/0/0/james%20taylor%20cap%20ap.jpg", "site_section": "http://www.foxnews.com/entertainment/index.html", "section_title": "Entertainment News | Latest News, Videos &amp; Photos on Celebrities, Movies &amp; Music | Fox News", "url": "http://www.foxnews.com/entertainment/2015/05/14/james-taylor-thinks-obama-is-greatest-president-all-time/", "country": "US", "title": "James Taylor thinks Obama is greatest President of all-time", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "James Taylor thinks Obama is greatest President of all-time | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "09cc8b75c3cd984650d5fedc2f86c0c2cbbeede0"}, "author": "Associated Press", "url": "http://www.foxnews.com/entertainment/2015/05/14/james-taylor-thinks-obama-is-greatest-president-all-time/", "ord_in_thread": 0, "title": "James Taylor thinks Obama is greatest President of all-time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Associated Press Email Print May 13, 2015. Grammy Award winning singer-songwriter James Taylor poses for a portrait in New York. (The Associated Press)\nBarack Obama supporter James Taylor doesn't just think the U.S. president is great — he believes Obama is the greatest of all-time.\n\"I've been watching politics since (Dwight) Eisenhower and Adlai Stevenson, when dinosaurs roamed the Earth, and Obama is my favorite, favorite president,\" Taylor said in an interview Wednesday. \"I am just thankful for every day that he's in office. I am so proud that he represents my country and I think he represents me — I think he represents the America that I know.\"\nTaylor, 67, is a recipient of the National Medal of Arts. The pop icon performed \"America the Beautiful\" at Obama's second inauguration in 2013.\n\"I had a really tough time during the Cheney-Bush years, I did, and I had a hard time accepting that that administration represented me because I don't think they did,\" Taylor said.\nThe Rock and Roll Hall of Famer also called Obama's family \"precious\" and said he appreciates the U.S. leader because he's \"sane\" and \"balanced.\"\n\"He promised to give us a health care system, it's a work in progress, but he has put us on a road to that,\" Taylor said. \"I'm so grateful for what he's done for gay rights and for the emancipation of gay people. Particularly from my point of view, I think that was so overdue and so important, and so important for America to be ahead of the curve on this.\"\nTaylor criticized Congress in Obama's defense.\n\"I've never seen a Congress that has been so obstructive and so contrary and so committed to doing anything that will foul up this administration. I just think it's an absolute scandal that he has had so little cooperation,\" he said. \"So anyway, you hit a nerve and I'll go on forever. But I'll just say it a third time: Every day that Barack Obama and Michelle Obama are in the White House is a day that I am thankful for.\"\nObama isn't the only politician Taylor is supporting: The singer said he's on the Hillary Rodham Clinton train, too.\n\"And aside from the fact that she's a woman running, she's the right person. ... The whole point — black or white, male or female, gay or straight, Christian, Jewish, Muslim, atheist — it doesn't matter what these other connections are,\" he said. \"Our country needs to come together and the question is, 'Is this public servant someone who will bring us together?' And I think she is.\"\nTaylor will release a new album, \"Before This World,\" on June 16. He will also launch a U.S. tour in July.\n ", "external_links": [], "published": "2015-05-14T03:00:00.000+03:00", "crawled": "2015-05-14T21:21:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}