{"organizations": [], "uuid": "f8004b9d5f5de39292095355b0f3f530821e6ea5", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_tunisia052115_getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed#", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/242861-obama-designates-tunisia-as-major-us-ally", "country": "US", "title": "Obama designates Tunisia as major US ally", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama designates Tunisia as major US ally", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T22:49:00.000+03:00", "replies_count": 0, "uuid": "f8004b9d5f5de39292095355b0f3f530821e6ea5"}, "author": "mmali@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/242861-obama-designates-tunisia-as-major-us-ally", "ord_in_thread": 0, "title": "Obama designates Tunisia as major US ally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama designates Tunisia as major US ally Getty By Jordan Fabian - 05/21/15 03:49 PM EDT \nPresident Obama on Thursday said he would boost Tunisia’s status as a United States ally and pledged long-term support in its transition to democracy following the Arab Spring. \nObama announced during a meeting with Tunisian President Béji Caïd Essebsi in the Oval Office that he intends to make the country a major non-NATO ally of the U.S., a status held by only 15 other nations. That would allow Tunisia to receive increased military and economic aid. \nThe president praised Tunisia’s progress toward establishing a democracy after decades of autocratic rule, including allowing women and minorities to participate in government. ADVERTISEMENT \"I want the president and the people of Tunisia to know that the United States believes in Tunisia, is invested in its success and will work as a steady partner for years to come,” Obama said.\nObama made an effort to highlight the emerging democracy as his administration grapples with turmoil elsewhere in the Middle East and North Africa, including the rise of the Islamic State in Iraq and Syria (ISIS), and the Syrian civil war. \nEssebsi is the first democratically elected leader of Tunisia to visit the White House. \nThe president said the two leaders discussed the importance of security, counterterrorism operations and working together to “stabilize Libya so we don’t have a failed state, a power vacuum that ends up affecting the situation in Tunisia.” \nThe U.S. has committed more than $570 million in assistance since the 2011 revolution, and the funds will increase to $134 million next year, Obama and Essebsi wrote in a joint op-ed Thursday in The Washington Post . \nThe U.S. is working to double military assistance to Tunisia next year, according to the leaders. \n“We need the U.S. and maybe the U.S. needs Tunisia now,” Essebsi said through a translator. \nThe Arab Spring began in Tunisia in 2011, when a street vendor lit himself on fire to protest government harassment. That triggered an uprising that toppled the country's leader, and the protests spread across the region. \nBut Tunisia has also faced challenges in its democratic transition, including high youth unemployment and a deadly terrorist attack at the Bardo National Museum in March, for which ISIS claimed credit. \nIn addition to increasing military aid, Obama said, he would boost economic assistance “so that ordinary Tunisians can feel the concrete benefits of a change to a more open and competitive economy.”", "external_links": [], "published": "2015-05-21T22:49:00.000+03:00", "crawled": "2015-05-22T02:21:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}