{"organizations": [], "uuid": "0587eb20adfa42ddd5a1b1a667e1a873217bdeab", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/2obamabarack0526getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/243343-obama-nothing-secret-about-pacific-trade-deal", "country": "US", "title": "Obama: 'Nothing secret' about Pacific trade deal", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: 'Nothing secret' about Pacific trade deal", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T21:25:00.000+03:00", "replies_count": 0, "uuid": "0587eb20adfa42ddd5a1b1a667e1a873217bdeab"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/243343-obama-nothing-secret-about-pacific-trade-deal", "ord_in_thread": 0, "title": "Obama: 'Nothing secret' about Pacific trade deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: 'Nothing secret' about Pacific trade deal By Jordan Fabian - 05/28/15 02:25 PM EDT President Obama took time out of an impromptu Twitter Q&A on climate change Thursday to defend a sweeping Pacific trade agreement that’s one of his top second-term priorities. \nObama wrote that there is “nothing secret” about the deal, known as the Trans-Pacific Partnership, rebutting a criticism frequently made by liberal opponents of the deal. \nHe made the statement in response to a question about making the text of the deal available. @POTUS #AskPOTUS why won't you release the full text of the TPP to the American people? — Grant Kermec (@gkermmm) May 28, 2015 . @gkermmm 1/ TPP is still being negotiated! But legislation requires the full text for 60 days before I sign. — President Obama (@POTUS) May 28, 2015 @.gkermmm 2/ after I sign agreement, Congress will have months of debate before a vote. Nothing secret about it. — President Obama (@POTUS) May 28, 2015 \nThe president’s ability to persuade congressional Democrats to back his trade agenda will be tested next month, when the House is expected to take up a package of trade bills including trade promotion authority (TPA). \nThe president views the TPA bill as essential for completing the Pacific trade deal; it would allow Congress to vote on the pact but not add amendments that could kill it. \nMany Democrats in Congress oppose the bill, also known as fast-track, out of concern new trade deals will ship jobs overseas. Some Republicans are reluctant to grant Obama more power. \nLiberal critics, such as Sen. Elizabeth Warren (D-Mass.), have accused the administration of keeping details of the trade bill from the public. The administration has noted that members of Congress and their staffs have the opportunity to read the text of the deal in a secure room inside the Capitol complex. \nObama also defended the trade deal against claims from green groups it will undermine environmental protections abroad. @HLF3267 In fact new trade deal with have the strongest enforceable environmental provisions in history, raising standards across Asia. — President Obama (@POTUS) May 28, 2015 Tags:", "external_links": [], "published": "2015-05-28T21:25:00.000+03:00", "crawled": "2015-05-28T22:43:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}