{"organizations": [], "uuid": "d466bdacf0f37d09e64d02f626f550d6079e1b61", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2980432/images/o-LUIS-GUTIERREZ-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/luis-gutierrez/feed", "section_title": "Luis Gutierrez on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/21/gutierrez-puerto-rico_n_7401062.html", "country": "US", "title": "Gutierrez: Obama And Congress Have 'A Responsibility' To Help Puerto Rico", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Gutierrez: Obama And Congress Have 'A Responsibility' To Help Puerto Rico", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T20:32:00.000+03:00", "replies_count": 0, "uuid": "d466bdacf0f37d09e64d02f626f550d6079e1b61"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/21/gutierrez-puerto-rico_n_7401062.html", "ord_in_thread": 0, "title": "Gutierrez: Obama And Congress Have 'A Responsibility' To Help Puerto Rico", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gutierrez: Obama And Congress Have 'A Responsibility' To Help Puerto Rico Posted: reddit \nWASHINGTON -- Rep.   said this week that the Obama administration is not doing enough to help the territory of Puerto Rico, home to 3.7 million U.S. citizens, as it enters its eighth year of a crippling economic recession. \nThe problem: Puerto Rico’s political status as a U.S. territory makes it ineligible to receive many of the financial protections extended to every city and state within the country -- including the abilities to file for bankruptcy and restructure public debt. \nWhen pressed on whether Congress should act, Gutierrez shouted, “Yeah!” \n“In the end, [Puerto Rico] doesn’t have the tools with which to deal with this problem,” Gutierrez told The Huffington Post on Tuesday. “We should give it the tools to deal with that. The federal government and Barack Obama administration should be doing more.” \nIn fact, there is a bill that would grant statelike powers to Puerto Rico and allow some of its government-owned corporations to restructure their debt under the U.S. bankruptcy code. \nThe Obama administration has long maintained that it will not support a bailout of the territory, instead urging the local government to get its economic house in order. In a call with local officials last month, Treasury Secretary Jack Lew doubled down on that position, insisting that the island come up with a “credible” plan to solve its financial problems . \nGutierrez, however, takes a different view. \n“Congress has a responsibility,\" he said. “We should be transferring all those powers to the people of Puerto Rico, so at least they could do what the state of California could do, which is organize in a proper manner so they can get creditors... [That's] what you and I would try to do as individual citizens. You and I have more rights with our creditors than the people of Puerto Rico have over such fundamental things as their utilities.” \nWhile Puerto Rico continues to struggle with raising the revenue it needs to stave off default, the island’s unemployment rate is more than double the U.S. figure, hovering at 13.7 percent -- a higher rate than the U.S. experienced even during the worst of the Great Recession . \n“Just think of how bondholders, Wall Street, is now going to be able to control the day-to-day priorities of the government of Puerto Rico,” Gutierrez said. “That’s just shameful that we allow something like that.” \nGutierrez’s comments aren’t an exaggeration. Most of Puerto Rico’s $72 billion in debt is owned by investors stateside -- much of it by wealthy Wall Street hedge funds. The territory's municipal bonds, once highly touted within the bond market due to their tax-exempt status, are now certified “junk” by all of the major credit rating agencies. However, that hasn’t stopped big-time hedge funds from buying Puerto Rico debt at distressed levels -- and turning over a healthy profit in the process. \nAccording to Bloomberg, a group of 35 hedge funds , headed by the New York firm Fir Tree Partners, owns a combined $4.5 billion in Puerto Rican debt. Another hedge fund, Paulson & Co., bought a record-setting $3.4 billion last year. \n“We’re spending billions of dollars rebuilding Afghanistan and Iraq, and we can't help the fiscal crisis where there’s [3.7] million American citizens? This is absurd, what is happening,\" said Gutierrez. \"Then again, it’s not like they have senators or congressmen here who can vote and legislate.\" \nPuerto Rico’s financial troubles have been a long time coming. After years of financial mismanagement, then-Gov. Luis Fortuno introduced austerity to the island in 2009 in the form of across-the-board spending cuts and massive job cuts in the public sector . \nNow, after months of political gridlock, Gov. Alejandro Garcia Padilla’s proposal for $500 million in spending cuts is expected to make its way out of the statehouse this week, according to local outlet El Nuevo Dia -- even though the proposal is unpopular among voters. \nThe plan, which aims to raise $1.2 billion in revenue, includes an increase to the local sales tax totaling 11.5 percent. It also calls for $166 million in cuts to Puerto Rico’s public university system. The latter measure prompted mass demonstrations last week, resulting in a tense face-off between police and student protesters. \nGutierrez stressed that Congress should ultimately allow “Puerto Rico to organize in an orderly fashion, like any other state.” \nIt's unlikely, though, that the House will vote to grant Puerto Rico the ability to file bankruptcy. Many Republicans are against the idea, arguing that the territory’s government needs to present a more substantial plan as to how it will handle its debt. Also on HuffPost:", "external_links": [], "published": "2015-05-21T20:32:00.000+03:00", "crawled": "2015-05-22T16:41:40.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}