{"organizations": [], "uuid": "ca7f50eae9aae9885cd917b0e91f504d518f7741", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2985154/images/o-CALIFORNIA-SNOWPACK-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/san-francisco/news.xml", "section_title": "San Francisco News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/22/david-frum-immigrants_n_7423206.html?utm_hp_ref=san-francisco&ir=San+Francisco", "country": "US", "title": "Atlantic Editor Wonders If Maybe Immigration Has Something To Do With California's Water Crisis", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Atlantic Editor Wonders If Maybe Immigration Has Something To Do With California's Water Crisis", "spam_score": 0.0, "site_type": "news", "published": "2015-05-23T01:15:00.000+03:00", "replies_count": 0, "uuid": "ca7f50eae9aae9885cd917b0e91f504d518f7741"}, "author": "Roque Planas", "url": "http://www.huffingtonpost.com/2015/05/22/david-frum-immigrants_n_7423206.html?utm_hp_ref=san-francisco&ir=San+Francisco", "ord_in_thread": 0, "title": "Atlantic Editor Wonders If Maybe Immigration Has Something To Do With California's Water Crisis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Atlantic Editor Wonders If Maybe Immigration Has Something To Do With California's Water Crisis Posted: Updated: 05/22/2015 6:59 pm EDT Frank Gehrke, chief of the California Cooperative Snow Surveys for the Department of Water Resources, walks out to the meadow checks to conduct the final snow survey of the season at Phillips near Echo Summit, California, Thursday, May 1, 2014. (AP Photo/Rich Pedroncelli) | ASSOCIATED PRESS reddit \nDavid Frum, a conservative pundit and senior editor at The Atlantic, wants to know why The New York Times isn’t putting more emphasis on immigration in its coverage of the California water crisis. \nIn a pair of tweets Friday, Frum criticized the Times for not including more references to the state’s “immigration-driven population surge” in its reporting on the crisis. Population has grown by 10 mn people since 1990 - a 33% increase - almost all by immigration. Maybe that’s relevant? https://t.co/HwIf07ZAQs \n— David Frum (@davidfrum) May 22, 2015 NYT has covered CA water crisis with scant reference to its immigration-driven population surge. That’s an omission https://t.co/nJmIPpbIGW \n— David Frum (@davidfrum) May 22, 2015 \nThe New York Times has, in fact, raised the question of how many people California can sustain given its water supply problems. But the paper has mainly attributed California’s water crisis to a four-year drought that has drastically reduced the snowpack in the Sierra Nevada. When the snowpack melts in the spring and summer, it typically supplies California with roughly one-third of the state’s water , according to the Associated Press. \nThe Times has also called attention to the role of California's agricultural industry, which accounts for a huge amount of the state's water use. \n“California farmers produce more than a third of the nation’s vegetables and two-thirds of its fruits and nuts,” the Times wrote in an interactive feature published Thursday . “To do that, they must use nearly 80 percent of all the water consumed in the state.” \nPeter Gleick, a climate scientist and the president of the Pacific Institute, an organization dedicated to environmental protection, dismissed Frum’s argument that immigration is a significant factor in California’s water crisis. \n“To claim California's water crisis is due to immigration and the use of water by immigrants is to grossly misunderstand California's true water challenges,\" Gleick told The Huffington Post in an email. \"Population growth of course affects the use of all resources (land, energy, food, water), but the water crisis was here 30 years ago, urban demand is only 20 percent of total water demand, urban water use has been level for 30 years and per-capita water use is going down, not up.\" \nResponding to Gleick's criticism, Frum told HuffPost that population growth is still important to consider. \n\"If per capita water use is going down and you add 10 million people, then the decline in per capita use would be overmatched by the increase in total population,\" Frum said. \"The question is not 'is immigration the cause of the crisis.' My tweet noted that some people want to omit any mention of it at all. And it seems to me that certainly the growth in California’s population is relevant. In California, water is a finite resource.\" \nYet it still seems doubtful that population growth is playing more of a role in California's water crisis than agribusiness. Nearly 95 percent of California residents live in urban areas , and the state's total urban water use has remained roughly constant for the last two decades, according to the Public Policy Institute of California. \nIn addition, the “immigrant-driven population surge” Frum refers to is somewhat exaggerated, and the figures he cites are overstated. California’s population in 1990 stood at 29.8 million , according to the U.S. Census. By 2014, the state’s population had risen to 38.8 million -- an increase of just over 9 million, not 10 million, and of about 30.4 percent, not 33 percent. \nEven if one accepts Frum's 33 percent figure, though, it still doesn't mean the state's recent immigrant-driven population growth can really be called a “surge.” \nHistorically, immigration has indeed fueled a steady growth in California's population, ever since European-Americans began a massive influx toward the area the mid-19th century. \nBut according to census data, that steady migration began to taper off during the 1990s -- precisely the time that Frum views as decisive. \nSince 2000, California’s population growth has slowed to a rate that's “barely keeping pace with the nation as a whole,” according to The Sacramento Bee. \nNative births and migration from other parts of the U.S. have accounted for the majority of California's population growth in recent years. California’s foreign-born population grew from 6.5 million in 1990 to 10.2 million in 2013 , according to census estimates -- meaning that although the state added 9 million new residents during that time, only 3.7 million of them were immigrants. Foreign-born residents of California accounted for 27 percent of the population in 2013, up from 21.7 percent in 1990. More:", "external_links": [], "published": "2015-05-23T01:15:00.000+03:00", "crawled": "2015-05-23T09:47:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}