{"organizations": ["Washington Mystics", "Tulsa Shock", "St. Columbanus Parish and School", "TNT", "DNC", "Episcopal Church", "National Medical Center", "White House", "U.S. Capitol", "National Tree Lighting Ceremony", "National Building Museum", "Illinios"], "uuid": "2cc5504e51b44bbf17bad2e3cff6d9d0ec48848d", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150407165727-malia-obama-restricted-tease-image-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/05/27/politics/rick-santorum-2016-presidential-announcement/index.html", "country": "US", "title": "Kenyan lawyer offers livestock for Malia Obama", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "Kenyan lawyer offers livestock for Malia Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T18:09:00.000+03:00", "replies_count": 0, "uuid": "0414676e2bc7ae383c596379cc6cd7a7ad07b778"}, "author": "", "url": "http://edition.cnn.com/2015/05/27/living/feat-malia-obama-kenyan-lawyer/index.html", "ord_in_thread": 0, "title": "Kenyan lawyer offers livestock for Malia Obama", "locations": ["Waimanalo", "Washington", "Missouri", "South Lawn", "Springfield", "Lafayette Park", "Hawaii", "Chicago", "JFK Stadium", "Alabama", "Johannesburg", "Selma", "U.S.", "Brazil", "Zandspruit Township", "South Africa", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Caralyn Buehner", "Seuss", "Malia Obama", "Malia", "Sasha Obama", "Barack Obama", "Michelle", "John", "Obama", "Michelle Obama", "Hugh Jackman", "Bo", "Martin Luther King Jr.", "Marian Robinson", "Sasha", "Edward M. Kennedy"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Kenyan lawyer offers cows, goats, sheep to marry Malia Obama Updated 1609 GMT (2309 HKT) May 27, 2015 Sasha and Malia Obama: 2008-present 24 photos Malia and Sasha Obama arrive prior to their father, President Barack Obama, at the Edmund Pettus Bridge on March 7 in Selma, Alabama. The Obamas were in Alabama to commemorate the 50th anniversary of Bloody Sunday, when voting rights marchers attempting to walk to the Alabama capitol clashed with police. Click through the gallery to see pictures of the first daughters through the years since their father was elected president in 2008. Hide Caption 1 of 24 Sasha and Malia Obama: 2008-present 24 photos Just days before he was elected, then-Democratic presidential candidate U.S. Sen. Barack Obama of Illinois, campaigns with his family at JFK Stadium in Springfield, Missouri, November 01, 2008. Hide Caption 2 of 24 Sasha and Malia Obama: 2008-present 24 photos President-elect Obama stands on a stage with the future-first family during an election night gathering in Grant Park on November 4, 2008, in Chicago. Hide Caption 3 of 24 Sasha and Malia Obama: 2008-present 24 photos President-elect Barack Obama and his family hands out food for thanksgiving during a surprise visit to St. Columbanus Parish and School in Chicago, Illinios, November 26, 2008. Hide Caption 4 of 24 Sasha and Malia Obama: 2008-present 24 photos Barack Obama takes the oath of office with wife Michelle by his side and daughters Sasha, far right, and Malia standing close by on January 20, 2009. Hide Caption 5 of 24 Sasha and Malia Obama: 2008-present 24 photos President Obama with his daughters and new dog Bo, during the dog's introduction to the White House press corps on the South Lawn of the White House on April 14, 2009. The six-month-old puppy was a gift from the late Sen. Edward M. Kennedy. Hide Caption 6 of 24 Sasha and Malia Obama: 2008-present 24 photos Sasha watches her Dad from the Truman Balcony after he arrives on the south lawn of the White House via Marine One on May 14, 2009. Hide Caption 7 of 24 Sasha and Malia Obama: 2008-present 24 photos Sasha and Malia play with Bo as they wait for their Dad's helicopter to land on the South Lawn of the White House on September 15, 2009. Hide Caption 8 of 24 Sasha and Malia Obama: 2008-present 24 photos Sasha looks at a turkey named Courage during an event to pardon the 20-week-old and 45-pound turkey at the North Portico of the White House on November 25, 2009. Hide Caption 9 of 24 Sasha and Malia Obama: 2008-present 24 photos Malia, right, and Sasha read the book \"Snowmen at Night\" by Caralyn Buehner to children during a visit to the Children's National Medical Center in Washington on December 22, 2009. Hide Caption 10 of 24 Sasha and Malia Obama: 2008-present 24 photos First lady Michelle Obama and Sasha honor the Rev. Martin Luther King Jr. legacy by serving meals to the needy at a facility January 18, 2010, in Washington. President Obama and Malia also helped in the dining room. Hide Caption 11 of 24 Sasha and Malia Obama: 2008-present 24 photos President Obama and Sasha watch the Tulsa Shock play the Washington Mystics on August 1, 2010, in Washington. Hide Caption 12 of 24 Sasha and Malia Obama: 2008-present 24 photos First lady Michelle Obama with Sasha and Malia Obama, reading to children from \"The Cat in the Hat\" by Dr. Seuss as they visit the Emthonjeni Community Centre in Zandspruit Township, Johannesburg, South Africa, on June 21, 2011. Hide Caption 13 of 24 Sasha and Malia Obama: 2008-present 24 photos The first family greet children dressed as elves prior to the taping of \"Christmas in Washington,\" at the National Building Museum in Washington on December 11, 2011. Hide Caption 14 of 24 Sasha and Malia Obama: 2008-present 24 photos President Obama walks with daughters Malia and Sasha after a visit to Sea Life Park December 27, 2011, at Waimanalo, Hawaii. Hide Caption 15 of 24 Sasha and Malia Obama: 2008-present 24 photos The first family at the National Tree Lighting Ceremony on The Ellipse in early December 2011 singing with Kermit the Frog. Hide Caption 16 of 24 Sasha and Malia Obama: 2008-present 24 photos President Obama shares a laugh with his wife Michelle and daughter Malia, as the U.S. Senior Men's National Team plays Brazil in a pre-Olympic exhibition basketball game on July 16, 2012, in Washington. Hide Caption 17 of 24 Sasha and Malia Obama: 2008-present 24 photos The first family walks across Lafayette Park to St. John's Episcopal Church to attend Sunday services in Washington on August 19, 2012. Hide Caption 18 of 24 Sasha and Malia Obama: 2008-present 24 photos President Obama and his daughters, Malia, left, and Sasha, watch on television as first lady Michelle Obama delivers her speech at the DNC from the Treaty Room in the White House on September 4, 2012. Hide Caption 19 of 24 Sasha and Malia Obama: 2008-present 24 photos President Obama greets his wife and daughters after being sworn in for his second term on the West Front of the U.S. Capitol on January 21, 2013. Hide Caption 20 of 24 Sasha and Malia Obama: 2008-present 24 photos The first family sings during the finale of TNT's \"Christmas in Washington\" on December 15, 2013. Also shown are Mrs. Obama's mother, Marian Robinson, and the program's host, actor Hugh Jackman. Hide Caption 21 of 24 Sasha and Malia Obama: 2008-present 24 photos Malia, Sasha, Michelle Obama and her mother, Marian Robinson, visit the Xi'an City Wall on March 24, 2014. The first lady's one-week-long visit in China was focused on educational and cultural exchanges. Hide Caption 22 of 24 Sasha and Malia Obama: 2008-present 24 photos President Obama, first lady Michelle Obama and their daughters, Sasha and Malia, hand out Thanksgiving food at Bread for the City in Washington on November 26, 2014. The president and first family were participating in their annual tradition of distributing food to the needy at Thanksgiving. Hide Caption 23 of 24 Sasha and Malia Obama: 2008-present 24 photos Malia, Sasha, President Obama and the first lady speak onstage during the taping of TNT's \"Christmas in Washington\" on December 14, 2014. Hide Caption", "external_links": [], "published": "2015-05-27T18:09:00.000+03:00", "crawled": "2015-05-27T18:34:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}