{"organizations": [], "uuid": "9d27c3e3597c5c2832def0dc5b261930ce4e54b3", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/05/30/new-york-times-pide-obama-que-siga-luchando-en-favor-de-los-inmigrantes/", "country": "", "title": "The New York Times pide a Obama que siga luchando en favor de los inmigrantes | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The New York Times pide a Obama que siga luchando en favor de los inmigrantes | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "9d27c3e3597c5c2832def0dc5b261930ce4e54b3"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/05/30/new-york-times-pide-obama-que-siga-luchando-en-favor-de-los-inmigrantes/", "ord_in_thread": 0, "title": "The New York Times pide a Obama que siga luchando en favor de los inmigrantes | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "The New York Times pide a Obama que siga luchando en favor de los inmigrantes Published May 30, 2015 EFE \nNueva York – El diario The New York Times pidió hoy al presidente de EE.UU., Barack Obama, que no retroceda en su política migratoria y que, a pesar del último revés legal, persista en su compromiso para hacer un sistema de inmigración \"más humano\". \nUn editorial del periódico comentó las opciones que tiene Obama después del nuevo revés legal sufrido el pasado martes por su Administración ante la Corte de Apelaciones de Nueva Orleans (Luisiana). \nEse tribunal rechazó una petición del Gobierno para que paralizara una decisión de un juez federal de Texas que ordenó la suspensión de las medidas migratorias de Obama acordadas en noviembre pasado para limitar las deportaciones, a partir de la solicitud presentada por 26 estados, en su mayoría republicanos. \nPero la decisión del tribunal de Nueva Orleans no entró a fondo en el tema, sino que dictó su medida atendiendo a procedimientos judiciales, y no consideró los argumentos legales de la decisión del juez de Texas ni la constitucionalidad del programa de Obama que buscaba el alivio migratorio de jóvenes indocumentados. \nEstas medidas representaban una extensión del programa de Acción Diferida para los Llegados durante la Infancia (DACA, en inglés), aprobado en 2012 y que protege a los indocumentados ante el riesgo de la deportación. \nEl Times recuerda que la Administración de Obama tiene ahora la posibilidad de recurrir ante el Tribunal Supremo o seguir el proceso en la Corte de Apelaciones de Nueva Orleans, que verá el caso de nuevo en julio próximo. \nLos jueces de este tribunal revisarán entonces los fundamentos legales de la decisión del juez de Texas, Andrew Hanen, quien suspendió las medidas ejecutivas de Obama por no seguir las normas de la Ley de Procedimientos Administrativos. \nEl Departamento de Justicia de Estados Unidos ya informó el pasado miércoles de que no se amparará ante el Tribunal Supremo sino que continuará su batalla legal en la Corte de Apelaciones de Nueva Orleans. \n\"Este periplo legal se extenderá hasta el próximo año, y posiblemente más allá. No sabe qué queda en el horizonte\", sostiene el diario de Nueva York. \n\"Mientras espera y se inquieta -agrega el editorial-, la Administración todavía tiene la obligación de no abandonar. Obama debería seguir adelante con su reiterado compromiso para hacer todo lo posible a fin de que el sistema de inmigración sea más humano\". \nEso significa garantizar que sigue funcionando como estaba previsto el programa DACA, que no ha sido bloqueado por ningún tribunal, aunque sí la extensión de ese plan migratorio aprobada por Obama el 20 noviembre pasado y que beneficia a unos 5 millones de indocumentados. \nEl Times pide que el Gobierno reduzca el nivel de deportaciones, que sólo en el último año fiscal (1 de octubre 2013-30 septiembre 2014) afectaron a 360.000 personas. \nPero, a la vez, dice el editorial del periódico, luchar contra las arbitrariedades de los agentes policiales en el trato de los indocumentados y terminar con los abusos en los centros de detención de inmigrantes. \n\"Los que huyen hacia aquí para salvar sus vidas no deben languidecer detrás de los barrotes. Los niños inocentes nunca deben pertenecer a la cárcel\", agrega el diario. ", "external_links": [], "published": "2015-05-30T03:00:00.000+03:00", "crawled": "2015-05-31T19:33:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}