{"organizations": [], "uuid": "c2fe17e31ab121f78d60c327e576829e126d76f7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/immigration_090814getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/house/241031-immigration-battle-moves-to-the-military", "country": "US", "title": "Immigration battle moves to the military", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Immigration battle moves to the military", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T13:00:00.000+03:00", "replies_count": 0, "uuid": "c2fe17e31ab121f78d60c327e576829e126d76f7"}, "author": "Cristina Marcos", "url": "http://thehill.com/homenews/house/241031-immigration-battle-moves-to-the-military", "ord_in_thread": 0, "title": "Immigration battle moves to the military", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration battle moves to the military By Cristina Marcos - 05/05/15 06:00 AM EDT \nA battle is brewing in the Republican Party over whether illegal immigrants granted deferred deportation by President Obama should be eligible to serve in the military. \nAnti-immigration hard-liners and vulnerable Republicans who represent districts with large Hispanic populations are battling over provisions in the annual Defense authorization bill, which is set to come to the House floor next week. ADVERTISEMENT The fight underscores the GOP’s difficulty in wrestling with Obama’s Deferred Action for Childhood Arrivals (DACA) program, which allows qualified illegal immigrants who came to the U.S. as children to obtain temporary work permits.\nGOP presidential candidates are split over the issue, with staunch conservatives such as Sen. Ted Cruz (Texas) arguing it should be done away with. Former Florida Gov. Jeb Bush and Sen. Marco Rubio (Fla.) have criticized Obama’s executive actions but have also called for workers living in the U.S. illegally to be given a path to legal status. \nObama’s 2012 actions have won some bipartisan support, while an expansion of the program announced after last year’s midterm elections has been more controversial. A federal appeals court is set to consider the legality of the 2014 actions. \nThe defense bill is the latest unlikely battleground on immigration because of the House Armed Services Committee’s adoption of two Democratic amendments that edge toward allowing young illegal immigrants to serve in the military. \nOne provision encourages the secretary of Defense to review allowing DACA recipients to serve in the armed forces; the other directs the Pentagon to evaluate how DACA recipients could expand the number of potential recruits and affect military readiness. \nThe first amendment, offered by Rep. Ruben Gallego (D-Ariz.), attracted the votes of six Republicans, including vulnerable Reps. Mike Coffman (Colo.) and Martha McSally (Ariz.). It narrowly passed on a vote of 33-30. \nSeven Republicans crossed the aisle to support the second amendment, sponsored by Rep. Marc Veasey (D-Texas). It was approved in a 34-29 committee vote. \nCoffman, a Marine Corps combat veteran who will be a top Democratic target in the next election cycle, argued that so-called “Dreamers” who grew up in the U.S. and are part of the American workforce should be given a chance to enlist. \n“I will fight to make sure our effort to encourage military service among Dreamers remains part of the NDAA [National Defense Authorization Act],” he said. “These kids grew up in this country, went to school here and often know of no other country. I want to give them the same opportunity I had to serve this country.” \nImmigration hard-liner Rep. Steve King (R-Iowa) promised a “major fight” when the bill hits the floor next week. He suggested that anyone who supports the provisions is voting to “expand the president’s amnesty agenda.” \n“It is the wrong policy on the wrong bill at the worst time,” King said in a statement. “This will bring about a major fight among those of us who have given our oath to support and defend the Constitution and mean it, and those who simply gave their oath. \n“This is a dark day both for those that defend the rule of law and those that seek to keep the United States safe,” King concluded. \nMore fights are on the way for the defense bill. \nRep. Jeff Denham (R-Calif.), a Democratic target who also represents a large Hispanic constituency, plans to offer his bill allowing young illegal immigrants to serve in the military in exchange for legal status as an amendment to the NDAA, a spokeswoman confirmed. \nHouse GOP leadership denied him a vote on the proposal last year. In 2013, he withdrew his proposal under pressure from fellow Republicans who wanted to debate the measure separate from the massive Defense authorization. \nIf the proposals that deal with allowing illegal immigrants to serve in the military culminate in roll call votes, it will mark the second time this year the GOP has specifically voted on DACA. \nThe House adopted an amendment in January to a bill funding the Department of Homeland Security that would freeze the DACA program. But 26 Republicans, mostly centrists and lawmakers who represent a sizable number of Hispanics, broke ranks and joined Democrats in opposition. \nHouse GOP leaders have been quiet about their next move. \nThe House Rules Committee, which decides how legislation is considered on the floor and is controlled by Speaker John Boehner (R-Ohio), is expected to announce which amendments will get votes by the middle of next week. \nBut Heritage Action, an influential conservative group, warned that the immigration proposals could scuttle passage of the entire Defense authorization. The organization previously threatened to urge members to vote against last year’s defense bill if Denham’s amendment was adopted. \n“If amnesty politics are allowed to seep into the NDAA, it will jeopardize the bill’s status as must-pass. Conservatives expect leadership will not allow an NDAA on the floor that contains either of these provisions,” Heritage Action spokesman Dan Holler told The Hill.", "external_links": [], "published": "2015-05-05T13:00:00.000+03:00", "crawled": "2015-05-05T13:57:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}