{"organizations": [], "uuid": "13e9ae3903c8cf218dd5d3337d92ff46804b00b0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/uber_081214getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/technology/241968-plouffe-moves-to-new-role-at-uber", "country": "", "title": "Former Obama adviser gets new role at Uber | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Former Obama adviser gets new role at Uber | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "13e9ae3903c8cf218dd5d3337d92ff46804b00b0"}, "author": "", "url": "http://thehill.com/policy/technology/241968-plouffe-moves-to-new-role-at-uber", "ord_in_thread": 0, "title": "Former Obama adviser gets new role at Uber | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mario Trujillo", "Obama"], "text": "Former Obama adviser gets new role at Uber Getty Images By Mario Trujillo - 05/13/15 03:50 PM EDT \nDavid Plouffe is moving into a chief adviser role at Uber and will join the ride-sharing company's board of directors. \nPlouffe, President Obama's former campaign manager and senior adviser, joined the company as senior vice president of policy and strategy less than a year ago in August 2014. ADVERTISEMENT In his chief adviser role he will focus on strategic planning and external affairs, moving away from the day-to-day operation, the company confirmed. \nRe/code first reported the move. ADVERTISEMENT Rachel Whetstone, a senior vice president for communications and policy at Google, will take over Plouffe's old position as senior vice president of policy and communications. \nPlouffe's hiring at Uber was announced last August in a blog post by Uber cofounder Travis Kalanick, where he compared the company to a political candidate. Plouffe was hired to lead all global public policy, political activity, communications and branding. \n\"We needed someone who understood politics but who also had the strategic horsepower to reinvent how a campaign should be run – a campaign for a global company operating in cities from Boston and Beijing to London and Lagos,\" Kalanick said at the time. \nThe company has exploded in the past few years. It is reportedly valued at more than $40 billion, and has expanded to hundreds of cities around the word. It has received criticism along the way as it bumped heads with local regulators and faced questions from some members of Congress about its privacy policies. Tags: ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T02:05:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}