{"organizations": ["Dean Genth"], "uuid": "10410d3a27dff15d019803c9071c0e7d714cd26c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2965434/images/o-CLINTON-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/18/hillary-clinton-police-militarization_n_7309296.html", "country": "", "title": "Hillary Clinton Backs Obama Plan To Reverse Police Militarization", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Hillary Clinton Backs Obama Plan To Reverse Police Militarization", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T01:43:00.000+03:00", "replies_count": 0, "uuid": "10410d3a27dff15d019803c9071c0e7d714cd26c"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/18/hillary-clinton-police-militarization_n_7309296.html", "ord_in_thread": 0, "title": "Hillary Clinton Backs Obama Plan To Reverse Police Militarization", "locations": ["U.S.", "Iowa", "Mason City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Hillary Clinton", "Gary Swenson", "Scott Olson", "Hillary Clinton Backs Obama"], "text": "Hillary Clinton Backs Obama Plan To Reverse Police Militarization Posted: Updated: 1 minute ago Democratic presidential hopeful and former U.S. Secretary of State Hillary Clinton speaks during a grassroots-organizing event at the home of Dean Genth and Gary Swenson on May 18, 2015 in Mason City, Iowa. Clinton is scheduled to host a small business roundtable discussion on May 19, in Cedar Falls, Iowa. (Photo by Scott Olson/Getty Images) | Scott Olson via Getty Images reddit \nWASHINGTON -- President Barack Obama's executive order banning the federal government from transferring certain types of military-style equipment to police forces would remain in place if Hillary Clinton wins the presidency in 2016. \nClinton is \"supportive of the recommendations and of the need for reform,\" a spokesperson for the Democratic candidate said Monday after Obama announced in Camden, New Jersey, that the transfer of certain military gear to police would be sharply curtailed. \nClinton last month slammed police militarization in a major speech on criminal justice issues. \"We can start by making sure that federal funds for state and local law enforcement are used to bolster best practices, rather than to buy weapons of war that have no place on our streets,\" she said in the speech, which followed the death of Baltimore's Freddie Gray at the hands of police. \"President Obama's task force on policing gives us a good place to start. Its recommendations offer a roadmap for reform, from training to technology, guided by more and better data.\" \nObama's announcement flowed from the task force recommendations that Clinton cited. Under the president's plan, bayonets, camouflaged uniforms, grenade launchers, certain types of armored vehicles, firearms of .50-caliber or larger and weaponized vehicles would no longer be transferred to law enforcement agencies. Other military equipment would be on a controlled list that would require law enforcement organizations to demonstrate need. \nClinton, in her speech, called for every police department to have body cameras for officers, and highlighted the need for community policing. \"We should listen to law enforcement leaders who are calling for a renewed focus on working with communities to prevent crime, rather than measuring success just by the number of arrests or convictions,\" she said. \"As your senator from New York, I supported a greater emphasis on community policing, along with putting more officers on the street to get to know those communities.\" \nObama on Monday said militarized gear “can sometimes give people the feeling like there's an occupying force as opposed to a force that's part of the community.\" \nThe Justice Department’s Office of Community Oriented Policing Services is preparing after-action report looking at mistakes by the St. Louis County Police Department in handling protests in Ferguson, Missouri, related to the police killing of teenager Michael Brown in August. Photos of the police department's heavily armed officers and military-style gear made world news. Also on HuffPost: Two Ferguson Officers Shot During Protest of   Police officials conduct an investigation in the Ferguson, Missouri neighborhood near the area of the overnight shooting of two police officers at the Ferguson Police Department on March 12, 2015. Two police officers shot overnight in the troubled Missouri city of Ferguson -- which for months has battled racial tensions -- were victims of an 'ambush,' police said Thursday. AFP PHOTO/MICHAEL B.THOMAS (Photo credit should read Michael B. Thomas/AFP/Getty Images) Police personnel conduct an investigation in the Ferguson, Missouri neighborhood near the area of the overnight shooting of two police officers at the Ferguson Police Department on March 12, 2015. Two police officers shot overnight in the troubled Missouri city of Ferguson -- which for months has battled racial tensions -- were victims of an 'ambush,' police said Thursday. AFP PHOTO/MICHAEL B.THOMAS (Photo credit should read Michael B. Thomas/AFP/Getty Images) Police officials conduct an investigation in the Ferguson, Missouri neighborhood near the area of the overnight shooting of two police officers at the Ferguson Police Department on March 12, 2015. Two police officers shot overnight in the troubled Missouri city of Ferguson -- which for months has battled racial tensions -- were victims of an 'ambush,' police said Thursday. AFP PHOTO/MICHAEL B.THOMAS (Photo credit should read Michael B. Thomas/AFP/Getty Images) FERGUSON, MO - MARCH 12: Law enforcement officials search for evidence in a neighborhood where gunshots were believed to have been fired that wounded two police officers during a protest last night outside the police station on March 12, 2015 in Ferguson, Missouri. Demonstrators had gathered outside the station to celebrate and protest after learning the city's police chief would be stepping down following the release of a Justice Department report that disparaged the department. Ferguson has faced many violent protests since the August shooting death of Michael Brown by a Ferguson police officer. (Photo by Scott Olson/Getty Images) Police officials conduct an investigation in the Ferguson, Missouri neighborhood near the area of the overnight shooting of two police officers at the Ferguson Police Department on March 12, 2015. Two police officers shot overnight in the troubled Missouri city of Ferguson -- which for months has battled racial tensions -- were victims of an 'ambush,' police said Thursday. AFP PHOTO/MICHAEL B.THOMAS (Photo credit should read Michael B. Thomas/AFP/Getty Images) FERGUSON, MO - MARCH 12: Law enforcement officials search for evidence in a neighborhood where gunshots were believed to have been fired that wounded two police officers during a protest last night outside the police station on March 12, 2015 in Ferguson, Missouri. Demonstrators had gathered outside the station to celebrate and protest after learning the city's police chief would be stepping down following the release of a Justice Department report that disparaged the department. Ferguson has faced many violent protests since the August shooting death of Michael Brown by a Ferguson police officer. (Photo by Scott Olson/Getty Images) FERGUSON, MO - MARCH 12: An agent with the Department of Alcohol Tobacco and Firearms arrives to investigate the scene outside the Ferguson Police Department on March12, 2015 in Ferguson, MO. Two police officers were shot and wounded in front of the Ferguson Police department overnight as protestors gathered after the resignation of Ferguson Police Chief Tom Jackson. Both officers were taken to hospital with serious injuries but were reported to be concious. (Photo by Michael B. Thomas/Getty Images) FERGUSON, MO - MARCH 12: Police crime scene personnel investigate the scene outside the Ferguson Police Department on March 12, 2015 in Ferguson, MO. Two police officers were shot and wounded in front of the Ferguson Police department overnight as protestors gathered after the resignation of Ferguson Police Chief Tom Jackson. Both officers were taken to hospital with serious injuries but were reported to be concious. (Photo by Michael B. Thomas/Getty Images) St. Louis County police Chief Jon Belmar, left, answers questions as Webster Groves police Captain Mike Nelson listens during a news conference Thursday, March 12, 2015, in Ferguson, Mo. Belmar spoke about the two officers shot, one from the St. Louis County police department and one from Webster Groves, in front of the Ferguson Police Department early Thursday as demonstrators gathered. (AP Photo/Jeff Roberson) FERGUSON, MO - MARCH 12: Law enforcement officials secure the crime scene and continue to search for evidence outside the police station after two officers were shot and wounded during last night's protest on March 12, 2015 in Ferguson, Missouri. Demonstrators had gathered outside the station to celebrate and protest after learning the city's police chief would be stepping down following the release of a Justice Department report that disparaged the department. Ferguson has faced many violent protests since the August shooting death of Michael Brown by a Ferguson police officer. (Photo by Scott Olson/Getty Images) Paramedics load one of two police officers who were shot while standing guard in front of the Ferguson Police Station during a protest on Thursday, March 12, 2015. Police take cover after two officers were shot while standing guard in front of the Ferguson Police Station on Thursday, March 12, 2015 in Ferguson, Mo. (Laurie Skrivan/St. Louis Post-Dispatch/TNS via Getty Images) Police mobilize in the parking lot of the Ferguson Police Station after two police officers were shot while standing guard in front of the Ferguson Police Station on Thursday, March 12, 2015 in Ferguson, Mo. (Laurie Skrivan/St. Louis Post-Dispatch/TNS via Getty Images) Photos released by St. Louis County Police show a helmet worn by one of the Ferguson officers shot during protests Thursday morning, March 12, 2015. Photos released by St. Louis County Police show a helmet worn by one of the Ferguson officers shot during protests Thursday morning, March 12, 2015. Police shine a light on a helmet as they investigate the scene where two police officers were shot outside the Ferguson Police Department Thursday, March 12, 2015, in Ferguson, Mo. (AP Photo/Jeff Roberson) FERGUSON, MO - MARCH 11: Protestors hold up their hands in front of police car during a protest outside the Ferguson Police Department on March11, 2015 in Ferguson, MO. Protests erupted after the announcement of the resignation of Ferguson Police Chief Tom Jackson earlier in the day. (Photo by Michael B. Thomas/Getty Images) FERGUSON, MO - MARCH 11: A demonstrator is detained and arrested during a protest outside the Ferguson Police Department on March11, 2015 in Ferguson, MO. Protests erupted after the announcement of the resignation of Ferguson Police Chief Tom Jackson earlier in the day. (Photo by Michael B. Thomas/Getty Images) FERGUSON, MO - MARCH 11: Protestors sit in the street outside the Ferguson Police Department on March11, 2015 in Ferguson, MO. Protests erupted after the announcement of the resignation of Ferguson Police Chief Tom Jackson earlier in the day. (Photo by Michael B. Thomas/Getty Images) FERGUSON, MO - MARCH 11: Police in riot gear respond to demonstrators blocking traffic during a protest outside the Ferguson Police Department on March11, 2015 in Ferguson, MO. Protests erupted after the announcement of the resignation of Ferguson Police Chief Tom Jackson earlier in the day. (Photo by Michael B. Thomas/Getty Images) FERGUSON, MO - MARCH 11: Protestors demonstrate outside the Ferguson Police Department on March11, 2015 in Ferguson, MO. Protests erupted after the announcement of the resignation of Ferguson Police Chief Tom Jackson earlier in the day. (Photo by Michael B. Thomas/Getty Images) Police arrest a demonstrator outside the Ferguson Police Department, Wednesday, March 11, 2015, in Ferguson, Mo. Earlier in the day, the resignation of Ferguson police chief Thomas Jackson was announced in the wake of a scathing Justice Department report prompted by the fatal shooting of an unarmed black 18-year-old by a white police officer. (AP Photo/Jeff Roberson)  Share ", "external_links": [], "published": "2015-05-19T01:43:00.000+03:00", "crawled": "2015-05-19T01:43:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}