{"organizations": ["AP"], "uuid": "4dfc1ea41c039518bb3d85c9b9aa6d8096d24c2c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2928778/images/o-SYNTHETIC-MARIJUANA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/08/synthetic-marijuana-hospitalizations_n_7241772.html", "country": "", "title": "There's Been A Sudden, Alarming Spike In Hospitalizations Caused By Synthetic Marijuana", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "There's Been A Sudden, Alarming Spike In Hospitalizations Caused By Synthetic Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T17:49:00.000+03:00", "replies_count": 0, "uuid": "4dfc1ea41c039518bb3d85c9b9aa6d8096d24c2c"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/08/synthetic-marijuana-hospitalizations_n_7241772.html", "ord_in_thread": 0, "title": "There's Been A Sudden, Alarming Spike In Hospitalizations Caused By Synthetic Marijuana", "locations": ["Kansas", "Missouri"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["DAVE COLLINS", "McCall"], "text": "There's Been A Sudden, Alarming Spike In Hospitalizations Caused By Synthetic Marijuana | By DAVE COLLINS Updated: 3 minutes ago This Feb. 15, 2010, photo shows a package of K2 which contains herbs and spices sprayed with a synthetic compound chemically similar to THC, the psychoactive ingredient in marijuana. State lawmakers in Missouri and Kansas have introduced bills which would create penalties for K2 possession similar to those for marijuana.(AP Photo/Kelley McCall) | ASSOCIATED PRESS reddit \nHARTFORD, Conn. (AP) — A huge nationwide spike in hospitalizations last month caused by a class of drugs often called \"synthetic marijuana\" illustrates the potency and dangers of the chemicals used to make them and the shifty tactics authorities believe manufacturers are using to evade regulation. \nPoison control centers nationwide reported 359 cases in January of illnesses from synthetic cannabinoids, which mimic the effects of the main psychoactive ingredient in marijuana but can be far more potent. There were 273 in February and 269 in March. But the number skyrocketed to just over 1,500 in April, according to the American Association of Poison Control Centers. \n\"This is the worst outbreak of drug abuse that I've lived through,\" said Dr. Steven Marcus, executive director of the New Jersey Poison Information and Education System at the New Jersey Medical School at Rutgers University, who has been monitoring the recent spike. \"It's almost as if someone had made a witches' brew of these cannabinoids. This is not just powerful marijuana. This is really dangerous stuff that has effects that can be life-threatening.\" \nA potential common link in last month's spike is a compound called MAB-CHMINACA, Marcus told The Associated Press in an interview. The compound was found during tests of synthetic marijuana seized by police in several states where people became ill, he said. \nAll 50 states have banned cannabinoids by outlawing specific compounds since 2011, and a federal law in 2012 added certain cannabinoids to the U.S. controlled substances list, according to the National Conference of State Legislatures. \nMAB-CHMINACA is relatively new and hasn't been banned in many states or by the federal government. A similar compound, AB-CHMINACA, emerged in the illicit drug market last year and was declared an illegal controlled substance in January under a temporary order by the Drug Enforcement Administration. \nThe DEA says a major problem has been chemical makers, including many in Asia, slightly changing chemical compounds so they're no longer banned controlled substances. \n\"It's hard to keep up with them,\" agency spokeswoman Barbara Carreno said. \"We're not far behind, but they can tweak a formula faster than we can regulate it.\" \nSynthetic marijuana usually is non-marijuana plant material sprayed with cannabinoids and marketed under brand names like Spice, K2 and Scooby Snax. It emerged in the U.S. around 2008 and became readily available in small retail outlets like convenience stores and head shops, as well as on the Internet, according to the Office of National Drug Control Policy. \nIt generally costs about $30 per 3-gram package, similar to marijuana. Many brands list \"not for consumption\" on the small packages in an apparent attempt to avoid regulation, authorities say. \nIt became popular because it was easy to buy, people wrongly thought was harmless and its chemicals aren't detected on standard drug tests, the National Institute on Drug Abuse says. But it can be more potent than regular marijuana and can cause vomiting, seizures, hallucinations, elevated blood pressure, loss of consciousness and death, health officials say. \nThis week in the Willimantic, Connecticut, area, about a dozen people became ill and five were hospitalized after taking K2 believed to be laced with the hallucinogen PCP, police said. The five have been discharged. \nWillimantic police began receiving calls Monday morning of people exhibiting psychotic behavior after smoking the drug. \n\"We've seen people running around without shirts, running down main thoroughfares within the city, asking for help,\" said police Cpl. Stanley Parizo Jr. \nIn New York City, there were more than 120 emergency-room visits linked to synthetic pot during a little more than a week last month, compared with an average of two to three visits a day earlier this year, according to the city Health Department. \nOverdoses last month killed two people and sent several others to the hospital in tiny Hancock County, Mississippi; killed one person and sickened two others in Hampton, Virginia; sent nearly 100 people to the hospital in Alabama; and resulted in more than 30 hospitalizations in New Jersey. More than 100 overdose cases have been reported in Lincoln, Nebraska, in the past few weeks, with many users ending up in emergency rooms. \nHealth officials and police believe \"tweaked\" formulas may be responsible for the rash of hospitalizations. \nRecent testing of synthetic marijuana seized by police in New York, New Jersey, Pennsylvania, Mississippi, Louisiana and other states have turned up a variety of substances, with many samples testing positive for MAB-CHMINACA, said Marcus, citing reports by the DEA's National Forensic Laboratory Information System, which collects test results from state and local forensic labs across the country. \nCarreno said she could not confirm or deny the results, citing ongoing criminal investigations. \nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Also on HuffPost: ", "external_links": [], "published": "2015-05-08T17:49:00.000+03:00", "crawled": "2015-05-08T18:03:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}