{"organizations": ["Congress", "Fox News While Obama"], "uuid": "e10d83edede400a341eeff7d83df13dd4c81264b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/07/09/what-egyptians-think-obama-after-morsi-disaster/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422584225836.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/09/what-egyptians-think-obama-after-morsi-disaster.html", "country": "", "title": "What Egyptians think of Obama after the Morsi disaster | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "What Egyptians think of Obama after the Morsi disaster | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "e10d83edede400a341eeff7d83df13dd4c81264b"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/09/what-egyptians-think-obama-after-morsi-disaster.html", "ord_in_thread": 0, "title": "What Egyptians think of Obama after the Morsi disaster | Fox News", "locations": ["Egypt"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Morsi", "Obama"], "text": "While Obama backs Egypt's military, lawmakers in Congress debate whether to halt some aid \nWith Obama’s full-fledged support of Morsi, you would think that Egyptians would be in love with him. But the deeply troubled Egyptian public is in no way enamored with this White House. \nQuite the contrary. Here’s why: More than 40 percent of Egyptian citizens currently must survive on about $2 per day. Lines to purchase gasoline stretch on for hours. The lines for a tank of propane—needed for cooking and other necessities of life—extend for up to nine hours. Electricity is cut off from 2-3 hours per night. \nWhen the Egyptian masses finally couldn’t take it anymore, 22 million people signed a petition to recall Morsi’s election—more than twice the number of people than originally voted for him. \nThen something totally unprecedented happened: 30 million people took to the streets. The largest mass demonstration in human history. \nThe Egyptian Army had tried on many previous occasions to mediate between President Morsi and the opposition. But Morsi autocratically and arrogantly refused to talk to anyone other than his masters in the Muslim Brotherhood headquarters. \nIn order to avoid the stigma of a coup, the military leaders met with a cross-section of the Egyptian population and religious leaders, including Islamists. As a result, they produced a wise plan calling for an election and appointing the chief justice of the Supreme Court as the interim president. \nBut here is the irony: while millions of Egyptians responded to Morsi’s ouster by joyfully dancing in the streets, the Muslim Brotherhood advisers in the White House helped Obama produce a non-descript statement . With his wishy-washy message about those who are democratically elected, Obama confirmed in Egyptian minds that he is in the pocket of the Muslim Brotherhood. \nIt is downright depressing to see the leader of the free world unable to comprehend the Islamic understanding of democracy. To the Islamist, democracy means “one man, one vote, one time.” Once they have their power, there’s no reason to ever have another election. \nThank God for the wise and courageous Egyptian people who comprehended that plan and stopped it before it was too late. \nAnd thank God for the persecuted Christians in Egypt who have cried out to God while withstanding injustice during the reign of the Muslim Brotherhood. \nAs a committed Christian, I believe God has heard their cries, even when our president has covered his ears. They have set an example for every harassed believer in the world, including in America, to pray and hope that God will hear our prayers. \nDr. Michael Youssef is the founding pastor of the Church of the Apostles in Atlanta, Georgia and the author of over 30 books, including his most recent, \" Jesus, Jihad & Peace: What Does Bible Prophecy Say About World Events Today? \" (Feb. 17, 2015, Worthy Publishers). Find him online at www.michaelyoussef.com and follow him on Twitter: @MichaelAYoussef . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:15:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}