{"organizations": [], "uuid": "ec950dda0eba1c3d1f0e0d94388b0738d66202da", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2916858/images/o-HILLARY-CLINTON-IMMIGRATION-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/05/hillary-clinton-immigration-reform_n_7217768.html", "country": "", "title": "Hillary Clinton Goes Big On Immigration", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Hillary Clinton Goes Big On Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T03:26:00.000+03:00", "replies_count": 0, "uuid": "ec950dda0eba1c3d1f0e0d94388b0738d66202da"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/05/hillary-clinton-immigration-reform_n_7217768.html", "ord_in_thread": 0, "title": "Hillary Clinton Goes Big On Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Kevin Hagen"], "text": "Hillary Clinton Goes Big On Immigration Posted: Updated: 3 minutes ago Hillary Clinton said she would strongly support immigration reform if elected president next year. | Kevin Hagen via Getty Images reddit \nWASHINGTON -- Hillary Clinton vowed on Tuesday that she would not only support immigration reform and protect deportation relief policies put forward by President Barack Obama. If elected president next year, she would expand them. \n\"If Congress continues to refuse to act, as president I would do everything possible under the law to go even further,\" the 2016 Democratic candidate said at an event with young undocumented immigrants, held at Las Vegas' Rancho High School. \nClinton's remarks, which essentially ran down the wish list of immigration activists, were more detailed than most expected. She argued that she would lean in on immigration, and she used that as an attack on Republican presidential candidates who have backed away from the issue. \nOn deportation relief, Clinton said she would do something that Obama hasn't: extend protections to the parents of Dreamers, the young undocumented immigrants who came to the U.S. as children. She said that other categories of undocumented immigrants should also be able to apply for such relief. \nSome Dreamers are able to remain in the U.S. and work temporarily under Obama's 2012 Deferred Action for Childhood Arrivals program, or DACA. In November executive actions, the president extended similar protections to more Dreamers and to the parents of U.S. citizens and legal permanent residents. Those executive actions are currently blocked in the courts, but if they move forward, as many as 5 million undocumented immigrants could gain relief. Millions more would remain without protections. \nOn Tuesday, Clinton defended Obama's actions against attacks by Republicans. \"He had to act in the face of inaction that was not on the merits but politically motivated for partisan reasons,\" she said. \nClinton said it was unrealistic to act as though all 11 million undocumented immigrants now in the U.S. could be deported. She said the idea was \"beyond absurd. That's not going to happen.\" \nShe also addressed less widely discussed immigration issues, arguing that those in deportation proceedings -- at the very least, the young -- should receive more legal representation. \nClinton said she believes that undocumented immigrants who are children, who are particularly vulnerable such as transgender individuals, or who generally are not criminals should not be detained. She also criticized the congressional mandate that a certain number of detention beds be maintained and the fact that private prison companies run many immigrant detention facilities. \n\"People go out and round up people in order to get paid on a per-bed basis,\" she said. \"That just makes no sense at all to me. That's not the way we should be running any detention facility.\" \nRepublican candidates have struggled with the issue of immigration in the past. Though it isn't typically the number one concern for Latinos in polls, it does tend to be more personal to those voters. Republicans' statements against undocumented immigrants likely contributed to the GOP's poor performance among Latinos in 2012. \nClinton, on the other hand, has potential to do well among Latinos. They favored her over Obama in the 2008 Democratic primaries, according to the Pew Research Center . And in the current campaign, she clearly views immigration as offering a positive contrast between herself and Republicans. \nShe said Tuesday that none of the GOP presidential candidates supports immigration reform the way she does. Sen. Marco Rubio (R-Fla.) and former Florida Gov. Jeb Bush (R), in particular, previously called for a path to citizenship but have since backed focusing on border security first or permitting undocumented immigrants to attain legal status only. \n\"When they talk about 'legal status,' that is code for second-class status,\" Clinton said. More: ", "external_links": [], "published": "2015-05-06T03:26:00.000+03:00", "crawled": "2015-05-06T03:26:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}