{"organizations": [], "uuid": "771bd0326832d3b247654bdb8be9d1b1c81123ad", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/05/14/obama-persian-gulf-states-support-verifiable-nuclear-pact-with-iran/", "country": "IL", "title": "Obama: Persian Gulf states support \"verifiable\" nuclear pact with Iran", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama: Persian Gulf states support \"verifiable\" nuclear pact with Iran", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T02:47:00.000+03:00", "replies_count": 0, "uuid": "771bd0326832d3b247654bdb8be9d1b1c81123ad"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/14/obama-persian-gulf-states-support-verifiable-nuclear-pact-with-iran/", "ord_in_thread": 0, "title": "Obama: Persian Gulf states support \"verifiable\" nuclear pact with Iran", "locations": ["Persian Gulf"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama: Persian Gulf states support \"verifiable\" nuclear pact with Iran Published May 14, 2015 EFE \nU.S. President Barack Obama said Thursday that the officials of the six Arab Persian Gulf nations with whom he met expressed to him their support for a nuclear agreement with Iran that is \"comprehensive and verifiable,\" adding that none of them is seeking an endless confrontation with Tehran. \nObama made his remarks at the end of the U.S.-hosted summit attended by Saudi Arabia, the United Arab Emirates, Kuwait, Qatar, Oman and Bahrain, all members of the Gulf Cooperation Council, which was held on Thursday at the presidential retreat at Camp David, Maryland. \nThe president also accepted an invitation from the officials of the six nations to hold another regional summit next year and he gave them an \"ironclad commitment\" of U.S. support against \"external aggression.\" \nIn his brief remarks at the end of the summit, Obama called the meeting \"excellent\" and expressed the hope that the region would achieve \"the kind of peace and good neighborliness with Iran that I think so many of the countries here seek.\" \nMeanwhile, Saudi Foreign Minister Adel al Jubeir confirmed in remarks to reporters that the United States and the Gulf nations will hold \"another meeting\" next year to continue their consultations. \nThe Sunni leaders from the Persian Gulf states, in particular Saudi Arabia, fear that the nuclear pact being negotiated between Iran and the 5+1 Group - comprising the United States, France, the United Kingdom, China, Russia and Germany - will be the prelude for normalizing relations between Washington and Tehran. \nThey are also concerned that the eventual lifting of sanctions on Iran could give Tehran the funds to increase what they consider to be its hostile activities in the region, for instance in countries such as Iraq, Syria and Yemen. \nIn a joint communique, the seven countries at the summit committed themselves to work together to counteract the destabilizing activities of Iran in the region. \nObama, in turn, said that the aim of this security cooperation is not to perpetuate any long-term confrontation with Iran or to marginalize that nation. \nHe said that Washington and the Gulf states welcome an Iran that plays a responsible role in the region, which takes concrete and practical steps to build confidence, resolves differences with its neighbors by peaceful means and adheres to international rules and norms. \nAccording to the president, ending tensions in the region and resolving its conflicts will require broader dialogue, one that includes Iran and its GCC neighbors. \nThe leaders of only two of the Gulf nations - the emirs of Kuwait and Qatar - attended the summit, with the other four Arab nations sending top security and other officials. EFE", "external_links": [], "published": "2015-05-15T02:47:00.000+03:00", "crawled": "2015-05-15T03:03:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}