{"organizations": ["Immigration Can Cause Psychosis"], "uuid": "731572ffc9151d5d14b28d8940c8637896956754", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2985858/images/o-CARRIBEAN-IMMIGRATION-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/22/immigration-psychosis_n_7347142.html", "country": "", "title": "The Stress Of Immigration Can Cause Psychosis, According To New Study", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "The Stress Of Immigration Can Cause Psychosis, According To New Study", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "731572ffc9151d5d14b28d8940c8637896956754"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/22/immigration-psychosis_n_7347142.html", "ord_in_thread": 0, "title": "The Stress Of Immigration Can Cause Psychosis, According To New Study", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThe stress and hardship faced by immigrants setting up in a new country could be contributing to an increased risk of psychosis among certain communities. And for those coming to a new country with refugee status -- which usually means they’re also escaping adversity or trauma -- the risk of mental illness is even higher, according to a new study by researchers at Canada's Western University . \n“Our study is the first to look at refugee status as a predictor of higher risk of psychotic disorders,” lead researcher Kelly Anderson, a psychiatry and epidemiology professor, told The Huffington Post. She noted that not all immigrants had parallel experiences: \"We also found that some groups, particularly those coming from from northern and southern European countries, as well as those coming from East Asia, had a lower rate of psychotic disorder compared to the general population here in Canada. That’s not a finding that has been reported in [previous studies].\" \nMany European research groups have documented a higher risk of schizophrenia in immigrant groups in the past, and Anderson wanted to see if the same held true for Canada. She examined the medical records of 4.2 million people in Ontario and followed up with them an average of ten years later. Ten percent were first-generation immigrants, and 23 percent of those immigrants had refugee status. She found that immigrants and the general population had about the same risk of psychotic disorders. But after adjusting for age, sex, residence and neighborhood income, refugees had about a 27 percent higher risk of psychotic disorder compared to immigrants who weren’t refugees. \nNon-refugee immigrants from the Caribbean and Bermuda had a 60 percent greater risk of psychotic disorder as compared to the general population, while immigrants from Europe and East Asia had about half the risk. Among refugees, those from East Africa had a 95 percent greater risk than the general population, while people from South Asia had a 51 percent greater risk. \nFirst-generation migrants make up almost 30 percent of Ontario’s population, and per Canada's immigration policy, most are young, highly skilled or educated and are proficient in either English or French. They also have to undergo a pre-immigration physical and mental health examination. Refugees, on the other hand, gain entry by showing that they can’t return to their home country for fear of persecution, or they come from countries for which Canada has announced asylum support because of a civil war or armed conflict. They are also exempt from the health screening. \nBecause of the difference in screening processes, Canada's non-refugee immigrant population certainly skews healthier -- both mentally and physically, admitted Anderson. But she also argues that the difficulty of fleeing trauma, as well as settling into a new place, may be contributing to higher risk of psychosis in refugees. In her study, she wrote that because the psychosis rates among immigrants in Canada don’t mirror the mental illness rates in their home countries, there could be something “inherent” in the refugee experience that creates the conditions for psychosis. \n\"The risk depends both on the circumstances from which they’re leaving, as well as the circumstances they’re migrating to,” Anderson told HuffPost. \"Both are playing a role in the high risk of psychotic disorders we’re seeing.” Just a few of the factors that make re-settlement mentally trying, she added, include the fact that refugees are less likely to speak either French or English and more likely to have limited education and socioeconomic resources. \nPast studies have also revealed a similar trend in the United States. In a 2007 comparison of Black Caribbean immigrants to African-American men, Harvard University researcher David Williams found that the immigrant men were at a higher risk of psychiatric disorders compared to African-American men from the U.S. Interestingly, these rates didn’t improve across generations; the risks were even higher in second- and third- generation Caribbean black men in America. Williams hypothesized that the stress of downward social mobility specifically linked to “being Black in America” could be contributing to the problem. \n\"Increased exposure to minority status in the United States was associated with higher risks for psychiatric disorders among Black Caribbean immigrants, which possibly reflects increased societal stress and downward social mobility associated with being Black in America,” Williams concluded. \nAnderson agrees that racism could certainly be one factor increasing refugees’ risk of psychosis, but she doesn’t think it's the only reason. \n\"There’s likely a whole lot of other things going on that are all contributing to the higher risk of schizophrenia, and experiences of racism and discrimination are certainly one of many things that are contributing,” she said. \"But I think what we believe it that it’s likely not such a simple and straightforward explanation.\" \nPatrick Koga, the director of Refugee Health Research Center at the University of California, Davis, isn’t at all surprised by what Anderson found. He works with the California Department of Public Health assessing incoming refugees for mental issues, including post-traumatic stress disorder, and suspects that the causes are more social than genetic. Specifically, the double whammy of leaving trauma behind in the home country, coupled with the stress of unemployment and other problems in the new country, could be working together to create higher rates of mental illness in certain refugee communities. \nKoga says he's seen how the stress of settling in California -- sparked in part by unemployment, social isolation, gender role reversal and intergenerational conflict -- affect new residents from Afghanistan, Iraq and Iran. \n“A year of two after finding a safe haven in California, many of our refugees break down mentally,\" he wrote in an email to HuffPost. \nBoth Koga and Anderson hope that by studying immigrants in the U.S. and Canada, they can help create ways to ease refugees' transitions into their new home countries, while helping address the adversity they left behind. Anderson is particularly interested in what seems to protect some immigrant groups, like those from European and East Asian countries, from mental illness. \n\"If we can understand why some of these groups have a lower risk of psychotic disorder, we may be able to develop some sort of immigrant support programs or other intervention strategies to help reduce this excess risk we’re seeing,” Anderson concluded. \nThe study was published online May 11 in the Canadian Medical Association Journal . Also on HuffPost: ", "external_links": [], "published": "2015-05-22T03:00:00.000+03:00", "crawled": "2015-05-23T02:54:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}