{"organizations": [], "uuid": "c1dd26edb9cfb6a8d83f8fa93a41a6b2e4cd231c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/05/mr-obama-empty-threats-hollow-promises-wont-scare-al-qaeda-or-anyone-else/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422600021463.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/05/mr-obama-empty-threats-hollow-promises-wont-scare-al-qaeda-or-anyone-else.html", "country": "", "title": "Mr. Obama, empty threats, hollow promises won't scare Al Qaeda or anyone else | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mr. Obama, empty threats, hollow promises won't scare Al Qaeda or anyone else | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "c1dd26edb9cfb6a8d83f8fa93a41a6b2e4cd231c"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/05/mr-obama-empty-threats-hollow-promises-wont-scare-al-qaeda-or-anyone-else.html", "ord_in_thread": 0, "title": "Mr. Obama, empty threats, hollow promises won't scare Al Qaeda or anyone else | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nPresident Obama's much discussed style of \" leading from behind \" has led to the United States metaphorically cowering under the bed. So much for President Obama’s claim that “Bin Laden is dead and Al Qaeda is on the ropes.” \nAl Qaeda is now in more places around the world and stronger than ever before. \nOf course, that's not to say that the latest terror threats to our embassies aren't real. And, of course, they can't and shouldn't be ignored. \nBut it’s not just Al Qaeda. Remember that \"reset\" with Russia? President Putin humiliated Obama time and again -- and got either silence or empty threats in response -- so now he feels free to poke him in the eye by granting NSA leaker Snowden a one year asylum. We helped topple a dictator in Libya and got Benghazi in return. We failed to track down and punish those killers, and Al Qaeda’s leaders are now emboldened to launch this latest terror plot against Americans from Algeria to Bangladesh. \n[pullquote] America's empty threats fueling Al Qaeda? \nWe pulled the rug out from under another dictator in Egypt, then \"led from behind\" while opening the door for the Muslim Brotherhood in Egypt. Now angry Egyptians are in the streets blaming Obama for the mess Egypt has become. \nWe led from behind in Syria, too, with empty threats, movable red lines and warnings. Now, after two years of civil war, millions of refugees and hundreds of thousands of dead civilians, we’re arming the Al Qaeda-affiliated rebels. \nWe’ve alternated threats and entreaties to Iran to halt their nuclear program and now they’ve started developing a whole new line of nukes. Look, you don’t need a foreign policy expert to tell you empty threats and hollow promises don’t work. Ask any parent of a rebellious teenager. If you don’t make good on the threats, you’re asking for worse behavior next time. \nIf you say, \"come home before dark or I’ll ground you,\" and he doesn’t and you don’t, the next time he’ll stay out ‘til midnight. And the time after that he’ll sneak out in the middle of the night. At first the testing is with minor things, to see what they can get away with.But once they realize there are no limits, and there is no point at which you make good on those threats, the defiance ramps up to have real consequences. \nLike Iran building nuclear weapons, Syria using chemical weapons, Russia sending warships to Cuba, weapons to Syria and nuclear reactors to Iran. Al Qaeda attacking the twin towers. Al Qaeda attacked the USS Cole and bombed several U.S. embassies in East Africa in the late 1990’s. We knew who did it but we didn’t go after them. Instead, we beefed up security at our embassies and changed the Navy’s rules of engagement. \nIt only served to embolden Al Qaeda. New recruits filled their Afghanistan training camps, and new donations filled their coffers. Bin Laden’s June 2001 recruitment video encouraged Muslims to join holy jihad against Americans who wouldn’t fight back. Then we got September 11th. Look, no one (not even most of the neocons), is urging a return to war in the Middle East. --The Bush administration showed the futility of starting wars that we finish only if we’re willing to come home without victory. \nBut there is a lot of space between meaningless speeches making threats we won’t carry out and scrambling the jets for wars we can’t win. But we are where we are. So, how does the U.S. restore our leadership role in the world? \nReagan won the Cold War by first restoring America’s economy and military and then staring down an economically weakened Soviet Union.He knew defeating Russia couldn’t be accomplished without laying the groundwork. \nWe’re in the same position today. It took us a decade to get into this position, and it will take several years to get us out. It isn’t a quick fix, but it is fixable. First, approve the Keystone pipeline. Not only is it an immediate boon for job growth and the U.S. economy, it also gives us an incalculable national security advantage. \nOnce we have energy independence we won’t need Arab oil, and don’t need to be in the middle of the civil wars that have plagued the Middle East for millennia. \nEnergy independence will be the first step in the U.S. becoming a major energy exporter. That means as Russian oil fields play out and increased instability in the Middle East makes their oil more unreliable, energy importers like China, India and Japan will increasingly look to us for their energy needs. Second, push back against Putin. Cancel the upcoming Obama-Putin summit which they want more than we need. \nPutin wants foreign investment to develop Russia’s non-energy industries and western technology to tap new oil fields to replace the ones that are currently winding down. Make it clear to him that the U.S. will put roadblocks on both unless he changes his attitude and cooperates with us over Iran. \nRethink the missile shield in Poland and the Czech Republic, and explore helping Poland develop it’s new natural gas finds. Third, explain to the Libyan government that either they round up those responsible for Benghazi by noon tomorrow, or we will. Then capture and bring them to justice, as a lesson that if you kill Americans you will be held accountable and punished accordingly. Sadly, this administration is unlikely to do any of these. They will make tough sounding speeches about how Al Qaeda is in the run, or declare that Putin will face consequences, or that we are hunting down those responsible for Benghazi. \nBut empty threats are often worse than saying nothing at all. \nIt’s like leading from behind. Eventually no one thinks you’re leading at all. And after a while, no one is even listening. \nThat’s when the greatest, strongest, most powerful nation is in the world is reduced to cowering under the bed. \nKathleen Troia \"K.T.\" McFarland is a Fox News National Security Analyst and host of FoxNews.com's \"DefCon 3.\" She served in national security posts in the Nixon, Ford and Reagan administrations. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:14:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}