{"organizations": [], "uuid": "ee62bb7ca7edc372d5febe83d04996db3f639d12", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/243178-bipartisan-duo-calls-on-boehner-to-take-up-existing-isis-war-resolution", "country": "", "title": "Bipartisan duo slams Boehner for inaction on Obama war request | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Bipartisan duo slams Boehner for inaction on Obama war request | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee62bb7ca7edc372d5febe83d04996db3f639d12"}, "author": "", "url": "http://thehill.com/policy/defense/243178-bipartisan-duo-calls-on-boehner-to-take-up-existing-isis-war-resolution", "ord_in_thread": 0, "title": "Bipartisan duo slams Boehner for inaction on Obama war request | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boehner", "Martin Matishak", "Obama"], "text": "Bipartisan duo slams Boehner for inaction on Obama war request By Martin Matishak - 05/27/15 09:58 AM EDT \nA bipartisan pair of senior lawmakers is calling on Speaker John Boehner (R-Ohio) to work on President Obama’s request to battle Islamic militants, rather than starting over from scratch. \n“To ask the president to start over and draft another [Authorization for the Use of Military Force (AUMF)] to send to Congress because ‘it’s the president’s responsibility to wage this battle’ … is an abdication of your responsibility as Speaker and the leader of the House of Representatives to uphold the seven clauses of the Constitution that explicitly delegate war powers to Congress,” Rep. Walter Jones (R-N.C.) and Jim McGovern (D-Mass.) said Tuesday in a letter to Boehner. ADVERTISEMENT “The failure of Congress to act upon the president’s request in a timely manner is a deep breach of our constitutional authority and responsibilities, and the trust of the American people in the People’s House,” they added.\nThe missive comes a week after Boehner said the president should abandon his proposed war powers resolution against the Islamic State in Iraq and Syria (ISIS). \n“The president’s request for Authorization of Use of Military Force calls for less authority than he has today. Given the fight that we’re in, it’s irresponsible,” he told reporters after a GOP conference meeting. \nBoehner said the president should withdraw the AUMF and “start over.” \nHis remarks have caused an uproar, especially among Democrats like House Minority Leader Nancy Pelosi (Calif.), who argue that it was Boehner and his fellow Republicans who argued Congress could not act until Obama sent lawmakers an AUMF. \nThe president did so in February, but members in both parties promptly panned it. Republicans said language restricting \"enduring offensive ground combat operations\" could limit military options. Liberals argued the same text could lead to another open-ended U.S. ground presence in the Middle East. \nIn their letter, Jones and McGovern urge Boehner to bring up Obama’s AUMF from debate sometime in June or July. \n“There is no need to waste more time,” they wrote. “Political expediency should never trump a moral and constitutional duty.” ", "external_links": [], "published": "2015-05-28T03:00:00.000+03:00", "crawled": "2015-05-28T17:26:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}