{"organizations": [], "uuid": "45903f4d7a99339a708e0a26ec9b5365ffcfe57d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2935436/images/o-SAUDI-KING-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/foreign-affairs/feed", "section_title": "Foreign Affairs on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/11/gulf-snubs-obama-summit_n_7262062.html", "country": "US", "title": "Obama Administration Downplays Saudi Snub", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Downplays Saudi Snub", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T01:47:00.000+03:00", "replies_count": 0, "uuid": "45903f4d7a99339a708e0a26ec9b5365ffcfe57d"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/11/gulf-snubs-obama-summit_n_7262062.html", "ord_in_thread": 0, "title": "Obama Administration Downplays Saudi Snub", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. Rejects Notion That Gulf Rulers Snubbing Obama Summit Reuters | By Matt Spetalnick & Angus McDowall Posted: reddit \nWASHINGTON/RIYADH, May 11 (Reuters) - The White House scrambled on Monday to counter perceptions that the Saudi king's absence from a summit later this week could undermine U.S. efforts to assure Gulf states it remains committed to their security against Iran. \nKing Salman's abrupt decision to skip the U.S.-hosted regional talks shows how Gulf rulers, displeased by what they see as U.S. indifference to Iranian meddling in the Arab world, may hesitate to bless any final nuclear deal that President Barack Obama reaches with Tehran. \nSome analysts and diplomats in the Middle East and Washington interpreted Salman's decision to stay away from the meeting at the Camp David presidential retreat as a diplomatic snub, despite denials from U.S. and Saudi officials. \nRiyadh announced the monarch's no-show on Sunday, only two days after the White House had said he would attend the summit of Gulf Cooperation Council (GCC) states - some of which have long doubted Obama's commitment to confronting Iranian backing of Shi'ite Muslim militias across the region. \nCrown Prince Mohammed bin Nayef, who has strong ties with the U.S. political and security establishment, will represent Saudi Arabia at the May 13-14 gathering along with Deputy Crown Prince Mohammed bin Salman, the king's son who serves as the defense minister. Since Salman took power in January, the pair have determined most aspects of Saudi policy. \nOnly two of the Gulf countries - Kuwait and Qatar - will be represented by their ruling monarchs, while the others are all sending lower-ranking officials. \nU.S. officials quickly pushed back against the notion that Gulf Sunni Muslim allies downgraded their attendance to signal dissatisfaction with Obama's diplomacy with Shi'ite Iran ahead of an end-June deadline for a landmark nuclear deal. \nThe White House announced that Obama had spoken by phone to Salman on Monday, apparently trying to show that relations remained on a solid footing. \nBen Rhodes, Obama's deputy national security adviser, said the administration was convinced that the president would have \"the right group of people around the table\" at Camp David. \"These are the people responsible for the security portfolios,\" he told reporters in a pre-summit briefing. \nThe Saudi government said one of the main reasons Salman was skipping the summit was because it overlapped with a five-day humanitarian ceasefire in neighboring Yemen, where a Saudi-led coalition is waging a bombing campaign against Iran-allied Houthi rebels. \nThe leading Gulf Arab power has complained for years that Washington does not take its concerns seriously. It thinks a focus on settling the dispute over Tehran's nuclear program has distracted the United States from more urgent problems and raised questions about broader security commitments to the region. \nSEEKING TO PLACATE ALLIES \nSeeking to reassure the Gulf allies, White House officials said on Monday the summit would produce announcements on integrating ballistic missile defense systems and increasing joint military exercises. \nThey said there would also be a statement outlining both U.S. and Gulf states' commitments but were vague about whether that would entail the written U.S. assurances that some Gulf diplomats have sought. The U.S. officials said, however, that they told Gulf states they would not offer a defense treaty, which would face steep obstacles in Congress. \nWashington is also poised to offer new weapons under a push for a joint region-wide missile defense system, senior U.S. officials said last week. \n\"The conspiracy theorists of old have been proven right. The U.S. creates threats for us and then offers us more weapons systems. That does not bode well for us,\" said Sami Alfaraj, a Kuwaiti security adviser to the six-nation GCC. \nRiyadh believes Iranian support for militias in Lebanon, Syria, Iraq and Yemen is the biggest cause of regional instability, aggravating sectarian tensions, undermining strong government and boosting Sunni Muslim jihadists. \nThe Saudis fear Obama sees a settlement between world powers and Tehran as his legacy. Such a deal on the nuclear program - which the West believes may be aimed at building weapons despite Iranian denials - could lift international sanctions without taming the country's regional ambitions, they think. \nBacking from the GCC - made up of Saudi Arabia, Kuwait, Qatar, Bahrain, the United Arab Emirates (UAE) and Oman - is important for Obama to show Congress that the Iran deal has broad regional support, despite Israeli opposition. \nSalman expressed guarded support for a framework nuclear agreement reached last month, but insists any accord must be robust, verifiable and no threat to Tehran's neighbors. \nEchoing White House denials, Saudi Foreign Minister Adel al-Jubeir told reporters in Washington that the notion of a snub by Salman was \"really off-base,\" and he insisted the king's absence was not related to any disagreements between the two countries. \nBut others in the region cited reasons for Saudi disappointment. \n\"Their experience of six years from Obama is assurances, promises, nice words. But at the end of the day they got nothing in their hands,\" said Mustafa Alani, an Iraqi security analyst with close ties to the Saudi crown prince's Interior Ministry. \nSome diplomats in the region believe the absence from Camp David of King Salman and close ally King Hamad of Bahrain, host of the U.S. Fifth Fleet, may backfire. \n\"Of course it (Salman's non-appearance) is a snub. But I don't think Obama is going to put up with this. He wants the nuclear deal. It is the number one priority,\" said a Western diplomat based in the region. (Additional reporting by Sylvia Westall in Beirut, William Maclean in Dubai, Jeff Mason, Roberta Rampton and Warren Strobel in Washington; Editing David Stamp and Stuart Grudgings) More:", "external_links": [], "published": "2015-05-12T01:47:00.000+03:00", "crawled": "2015-05-12T06:31:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}