{"organizations": [], "uuid": "dd7c19fee69b971734b73c42388152f2fd6f2bde", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3006178/images/o-OBAMA-BULLS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/nba/feed", "section_title": "Nba on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/28/tom-thibodeau-barack-obama_n_7462566.html", "country": "US", "title": "Obama Tweets Support For Freshly Fired Bulls Coach Tom Thibodeau", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Tweets Support For Freshly Fired Bulls Coach Tom Thibodeau", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T18:47:00.000+03:00", "replies_count": 0, "uuid": "dd7c19fee69b971734b73c42388152f2fd6f2bde"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/28/tom-thibodeau-barack-obama_n_7462566.html", "ord_in_thread": 0, "title": "Obama Tweets Support For Freshly Fired Bulls Coach Tom Thibodeau", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Feb 25, 2015 at 7:19pm PST \nRead the Bulls' full statement: \nChicago Bulls General Manager Gar Forman announced today that Tom Thibodeau will not be retained as the team’s head coach. \nChicago Bulls Chairman Jerry Reinsdorf said, “The Chicago Bulls have a history of achieving great success on and off the court. These accomplishments have been possible because of an organizational culture where input from all parts of the organization has been welcomed and valued, there has been a willingness to participate in a free flow of information, and there have been clear and consistent goals. While the head of each department of the organization must be free to make final decisions regarding his department, there must be free and open interdepartmental discussion and consideration of everyone's ideas and opinions. These internal discussions must not be considered an invasion of turf, and must remain private. Teams that consistently perform at the highest levels are able to come together and be unified across the organization-staff, players, coaches, management and ownership. When everyone is on the same page, trust develops and teams can grow and succeed together. Unfortunately, there has been a departure from this culture. To ensure that the Chicago Bulls can continue to grow and succeed, we have decided that a change in the head coaching position is required. Days like today are difficult, but necessary for us to achieve our goals and fulfill our commitments to our fans. I appreciate the contributions that Tom Thibodeau made to the Bulls organization. I have always respected his love of the game and wish him well in the future.” \nFollowing 21 years in the NBA as an assistant coach (he was an advance scout in 1991-92), Chicago named Thibodeau the team’s head coach on June 23, 2010. During his five seasons at the helm of the Bulls, Thibodeau’s teams compiled an overall record of 255-139 (.647). The Bulls advanced to the playoffs five times during Thibodeau’s tenure, where he posted a postseason record of 23-28 (.451). \n\"When Tom was hired in 2010, he was right for our team and system at that time, and over the last five years we have had some success with Tom as our head coach,” said Chicago Bulls General Manager Gar Forman. “But as we looked ahead and evaluated how we as a team and an organization could continue to grow and improve, we believed a change in approach was needed.\" More:", "external_links": [], "published": "2015-05-28T18:47:00.000+03:00", "crawled": "2015-05-29T00:39:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}