{"organizations": [], "uuid": "426c771da326a84dca544b53722a3045fed95995", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://newsfeed.kk-consulting.co.uk/HumanRightsUruguay", "section_title": "KKC Human Rights Uruguay", "url": "http://latino.foxnews.com/latino/lifestyle/2015/05/16/11-year-old-girl-pregnancy-renews-battle-over-abortion-in-uruguay/", "country": "US", "title": "11-Year-old girl's pregnancy renews battle over abortion in Uruguay", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "11-Year-old girl's pregnancy renews battle over abortion in Uruguay", "spam_score": 0.0, "site_type": "news", "published": "2015-05-16T16:56:00.000+03:00", "replies_count": 0, "uuid": "426c771da326a84dca544b53722a3045fed95995"}, "author": "", "url": "http://latino.foxnews.com/latino/lifestyle/2015/05/16/11-year-old-girl-pregnancy-renews-battle-over-abortion-in-uruguay/", "ord_in_thread": 0, "title": "11-Year-old girl's pregnancy renews battle over abortion in Uruguay", "locations": ["Uruguay"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "11-Year-old girl's pregnancy renews battle over abortion in Uruguay Published May 16, 2015 EFE \nOrganizations for and against abortion in Uruguay clashed about whether an 11-year-old girl who became pregnant after being raped by a man of 40 should continue with the gestation process now in its 15th week. \nThe anti-abortion movement known as Pro-Vida published Friday a communique slamming the statement by a group of six human-rights NGOs that came out in favor of the girl having an abortion. \nPro-Vida denounced the \"alarming levels of authoritarianism acquired by organizations promoting abortion\" and alleges that the girl herself has expressed a desire to have the baby. \nThe minor also has a psychiatric pathology, which has heightened even more the controversy over who should decide the future of the fetus. \nIn an interview with Efe, Lilian Celiberti, coordinator of Cotidiano Mujer, one of the non-government organizations that have spoken up on the matter, said that \"an 11-year-old girl can't be the object of a decision that doesn't consider her safety.\" \nA court ordered last week that the minor be moved from the children's hospital in Montevideo where she has been kept, to a home of the Child and Adolescent Institute of Uruguay, or INAU, and said the abortion depends on a medical decision that considers the opinion of the girl and her mother. \n\"There's a mother who for weeks has been asking for her daughter's pregnancy be interrupted. Then there's a bureaucratic, hypocritical system that allows the continued violation of her rights, without a care for how much it will harm the girl,\" the communique signed by the six NGOs said. \n\"We demand the immediate interruption of the 11-year-old girl's pregnancy, within the framework of the law, in order to protect her health and her rights,\" the petition said. \nIn case the pregnancy goes forward, INAU must take charge of the girl and her baby. \nThe 41-year-old aggressor was sent to prison \"as the continuous perpetrator of the crime of rape.\" EFE", "external_links": [], "published": "2015-05-16T16:56:00.000+03:00", "crawled": "2015-05-17T00:35:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}