{"organizations": ["Fox News Outgoing IRS"], "uuid": "d9595b2f04ee5b8d2ae4bdcab17f001ef568c369", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/051613/0/0/reporter_emanuel_051613.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/17/obama-scandals-reveal-dangers-big-government.html", "country": "", "title": "Obama scandals lay bare very real dangers of big government | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama scandals lay bare very real dangers of big government | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "d9595b2f04ee5b8d2ae4bdcab17f001ef568c369"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/17/obama-scandals-reveal-dangers-big-government.html", "ord_in_thread": 0, "title": "Obama scandals lay bare very real dangers of big government | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Outgoing IRS Head: Agency Made 'Foolish Mistakes' \nThe ballooning Obama scandals – IRS, HHS, DOJ, EPA – are not really about character or competence, but the danger of big government itself. The more power any government has, the more power it will abuse. The more money it spends, the more money it will mis-spend. Dysfunction and corruption grow on government like mold on otherwise perfectly good bread. It has nothing to do with party or ideology – it has to do with human nature. This is one of the fundamental tenets of conservatism, and one of the hardest to communicate past the credulous liberalism of the mainstream media. Yet this week, the media and the Obama administration are actually making the case for us. President Obama’s political guru David Axelrod himself said this morning that, “Part of being president is there’s so much beneath you that you can’t know because the government is so vast.” Exactly. These scandals expose the inherent flaw of the progressive promise: that government can and should be trusted with more and more power, because it will wield that power in the disinterested pursuit of the common good. This week, the Obama administration’s words are being impeached by the administration’s deeds. With the possible exception of the Benghazi cover-up, all of the recent Obama scandals do not so much impeach the president’s character; they indict his worldview. And his agenda. The president’s entire program is based on giving more power and discretion to the same executive branch agencies demonstrating themselves this week to either be criminally incompetent or tyrannically corrupt. ObamaCare? Expanded gun background checks? Comprehensive immigration reform? They’re all based on an assumption of competent collection and ethical use of personal information coerced from the American people by the federal bureaucracy. Today it’s your 501(c)(4) application; tomorrow it’s your medical records. Rather than chasing scapegoats, conservatives – especially elected conservatives – should be translating the lessons of the Obama scandals into arguments for delaying, defunding, and repealing ObamaCare, or for cutting the huge Gang of Eight immigration bill down to a series of smaller, manageable, incremental reforms. Perhaps even more importantly, conservatives need to take this opportunity to communicate how our natural, cooperative preferred alternatives to big government coercion – civil society and the free market – would do a better job delivering the services government monopolizes. We need to explain why an America without HHS shakedowns and EPA cronyism would not only enjoy more honest government, but also better, more affordable health care and a cleaner environment. Congress should absolutely get to the bottom of these various scandals. And the American people should absolutely be outraged. But we should not be surprised that a $3.7 trillion government is corrupt. What should surprise us is that anyone would expect a $3.7 trillion government not to be. Conservatives – including elected partisans – should recognize that these scandals aren’t about Republicans versus Democrats – they’re about Washington, D.C. versus everyone else. They’re about an entrenched, entitled political elite protecting its unearned power and privileges from accountability, whether challenged by reformers or reporters. \nThey’re frankly also about the Republican Party’s own enablement of that power and privilege, and our failure to effectively advance and apply the conservative principles that would protect the country from their abuse. Abuse of power, corruption, cronyism -- this is what always happens when government gets too big. The Founders knew that over time, either the people would control the government, or the government would control the people. That’s why they bequeathed to us a constitutionally limited government -- a republic, if we could keep it. The way to keep it is not to demonize Barack Obama, but to expose the truth about the dangers of progressivism. \nRepublican Mike Lee represents Utah in the U.S. Senate. He is a member of the Judiciary Committee. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:20:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}