{"organizations": ["Catholic"], "uuid": "62ed279a10fd0ade6cdb37438532373a8bccea2d", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2015/05/12/catholic-bishops-call-for-changes-at-us-immigration-detention-centers/", "country": "IL", "title": "Catholic bishops call for changes at U.S. immigration detention centers", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Catholic bishops call for changes at U.S. immigration detention centers", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T17:32:00.000+03:00", "replies_count": 0, "uuid": "62ed279a10fd0ade6cdb37438532373a8bccea2d"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/05/12/catholic-bishops-call-for-changes-at-us-immigration-detention-centers/", "ord_in_thread": 0, "title": "Catholic bishops call for changes at U.S. immigration detention centers", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Catholic bishops call for changes at U.S. immigration detention centers   EFE \nThe U.S. Conference of Catholic Bishops has called for a radical change in detention centers for undocumented immigrants to end long-term stays and replace it with supervised release. \n\"It is time for our nation to reform this inhumane system, which unnecessarily detains persons, especially vulnerable populations, who are no threat to us and who should be afforded due process and legal protections,\" Bishop Eusebio Elizondo, auxiliary bishop of Seattle and chairman of the USCCB Committee on Migration, said in a statement. \nThe USCCB released a report, \"Unlocking Human Dignity: A Plan to Transform the U.S. Immigrant Detention System,\" drawing on observations made during visits to detention centers in Illinois, Florida, Arizona, California and other states. \nThe report pointed out that the vast majority of people in the Department of Homeland Security's custody remain in jails and other facilities, where they are subjected to the same rules and regulations designed for individuals who have committed a crime. \nThe bishops said that, in many ways, detained immigrants were treated even more harshly than criminals. \nThe church leaders criticized the use of detention as a \"tool\" to deal with undocumented immigrants, adding that detention should be used only as a last resort, and they denounced the detention of pregnant women or nursing mothers, elderly and sick people, and individuals seeking asylum. \nOnly individuals with a criminal record should remain in detention and not those who have only violated immigration laws, the bishops said. \nThe USCCB said the current system of using privately operated detention centers and having \"retention quotas\" should be dismantled and replaced with a program that includes different levels of supervised release to ensure the undocumented immigrants will come back for their hearings before an immigration judge. \nImmigrant advocates have denounced the existence of a \"bed quota,\" benefitting private prison companies by holding at least 34,000 undocumented immigrants. \nThe Catholic bishops criticized the lucrative business that the detention of undocumented immigrants has become for big private corporations operating those facilities. \n\"There are ways to create a humane system and also ensure that immigrants are complying with the law,\" Bishop Nicholas DiMarzio, of Brooklyn, New York, said. \n\"But we have created a detention industry in this country which preys upon the vulnerability of our fellow human beings, the vast majority of whom are not criminals,\" DiMarzio said. \nThe U.S. government spends almost $1.7 billion each year to keep undocumented immigrants detained. \nThese funds, DiMarzio said, have become an incentive to keep immigrants detained for the profit of private companies and contractors managing detention facilities. EFE", "external_links": [], "published": "2015-05-12T17:32:00.000+03:00", "crawled": "2015-05-12T18:21:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}