{"organizations": ["Keystone", "Senate", "Greenpeace", "Shell", "State Department", "Interior Department's Bureau of Ocean Energy Management", "Interior Department"], "uuid": "d53512d5bf22c6ea286c98483408997c2295791d", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/11/politics/obama-approves-arctic-drilling/index.html", "country": "", "title": "Obama administration approves drilling in Arctic - CNNPolitics.com", "performance_score": 8, "site": "cnn.com", "participants_count": 0, "title_full": "Obama administration approves drilling in Arctic - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T02:07:00.000+03:00", "replies_count": 0, "uuid": "d53512d5bf22c6ea286c98483408997c2295791d"}, "author": "", "url": "http://www.cnn.com/2015/05/11/politics/obama-approves-arctic-drilling/index.html", "ord_in_thread": 0, "title": "Obama administration approves drilling in Arctic - CNNPolitics.com", "locations": ["Chukchi Sea", "Washington", "Pakistan", "Port of Seattle", "Arctic Ocean", "Alaska", "Arctic", "Gulf of Mexico"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Smith", "Abigail Ross Hopper", "Curtis Smith", "Tim Donaghy", "Obama"], "text": "Saving Pakistan's coral reefs Washington (CNN) The Obama administration, citing \"rigorous safety standards\" and a long review process, has granted conditional approval to energy giant Shell to begin oil drilling in the Arctic waters off the coast of Alaska. The Interior Department wrote in a statement that Shell could begin drilling in the Chukchi Sea once several environmental conditions are met, including a sign-off from agencies assessing the impact on endangered species. State agencies must also approve the plan. The move has upset environmental activists who are concerned the drilling will have detrimental effects. RELATED: Keystone vote: Senate fails to override veto Shell, if it obtains the remaining permits, would be the only company drilling in the federal waters in the Arctic. Abigail Ross Hopper, the director of the Interior Department's Bureau of Ocean Energy Management, said her agency had taken \"a thoughtful approach\" to Shell's requests for drilling permits in the Arctic. \"As we move forward, any offshore exploratory activities will continue to be subject to rigorous safety standards,\" she said. Shell has been pressing for years to gain permission from the federal government to tap Arctic Ocean oil reserves, a move environmentalists have protested for the perceived risks to the environment and wildlife. The Interior Department estimates there to be more than 20 billion barrels of oil and 90 trillion cubic feet of natural gas beneath the freezing Arctic waters near Alaska. Tim Donaghy, a senior research specialist for Greenpeace, panned Monday's decision. \"Instead of holding Shell accountable and moving the country towards a sustainable future, our federal regulators are catering to an ill-prepared company in a region that does not tolerate cutting corners,\" he said. Obama's administration has ramped up actions meant to curb the effects of climate change, including putting new regulations on coal plants and implementing new limits on greenhouse gas emissions. The executive actions -- taken after legislative moves appeared all but impossible -- could form a major part of Obama's environmental legacy. Still outstanding, however, is a decision on the controversial Keystone XL pipeline, which would transport oil from Canadian tar sands to the Gulf of Mexico. The White House says it's still awaiting a final recommendation from the State Department before approving or denying the project. Before Shell can begin drilling for oil in the Arctic it first must obtain permits from various other departments and agencies, including from the Port of Seattle, where Shell tankers would need to lease a terminal. Shell said the approval of their drilling proposal \"is an important milestone and signals the confidence regulators have in our plan,\" according to Curtis Smith, a company spokesman. \"However, before operations can begin this summer, it's imperative that the remainder of our permits be practical, and delivered in a timely manner,\" Smith said. \"In the meantime, we will continue to test and prepare our contractors, assets and contingency plans against the high bar stakeholders and regulators expect of an Arctic operator.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News ", "external_links": [], "published": "2015-05-12T02:07:00.000+03:00", "crawled": "2015-05-12T02:07:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}