{"organizations": [], "uuid": "a5125e45659a566bee6563e84852398814901b2a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/ferguson_081914getty_0.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/242346-obama-limiting-military-hardware-to-police-departments", "country": "US", "title": "Obama limiting military hardware to police departments", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama limiting military hardware to police departments", "spam_score": 0.0, "site_type": "news", "published": "2015-05-18T13:00:00.000+03:00", "replies_count": 0, "uuid": "a5125e45659a566bee6563e84852398814901b2a"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/242346-obama-limiting-military-hardware-to-police-departments", "ord_in_thread": 0, "title": "Obama limiting military hardware to police departments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama limiting military hardware to police departments Getty Images By Jordan Fabian - 05/18/15 06:00 AM EDT \nThe White House on Monday announced new limits on federal programs that supply local police with military-style equipment. \nAfter four months of study, a Cabinet working group tasked by President Obama to reform the initiatives unveiled eight categories of military supplies local law enforcement will be banned from acquiring from federal agencies or with federal funds. \nThe list includes grenade launchers, tracked armored vehicles, armed aircraft, bayonets, and guns and ammunition of .50 caliber or higher. \nThere is a “substantial risk of misusing or overusing these items,” which “could significantly undermine community trust,” the group’s report reads. \nOther federally supplied equipment, such as wheeled armored vehicles, drones, helicopters, firearms and riot gear, will come with new strings attached for local police to ensure officers are trained in their use and in “community policing, constitutional policing and community input.” \nPolice must provide a “clear and persuasive explanation” for the need of the equipment and get approval from their local government. \nThe steps are part of the White House’s effort to reestablish trust between law enforcement and their communities in response to a string of police-related deaths of black men in Baltimore, Ferguson, Mo. and North Charleston, S.C., among other cities. \nThe issue of police militarization entered the national spotlight last summer as officers and demonstrators angered by the death of Michael Brown, 18, violently clashed in the streets of Ferguson. \nThe public was shocked by images of heavily armed police in military armored vehicles who were sent to quell the protests. A bipartisan group of lawmakers and civil-rights groups pushed to end initiatives, such as the Pentagon’s 1033 program, that allow surplus military equipment to be transferred to local police. \nThe White House has stopped short of eliminating the program. The equipment “enhances the safety of officers” responding to dangerous situations and being improperly equipped can have life‐threatening consequences,” according to the report. \nThe administration is announcing new rules to better keep track of the equipment, including gathering information whenever it is used in a “significant incident.” \nMore than $4 billion of military equipment has been transferred to police under the 1033 program since it was created in the late 1990s. But almost 150 law enforcement agencies have been suspended over the last six years for losing track of equipment, according to ABC News and Fusion . \nThe president has recently lamented the limits of his power when it comes to addressing the police reforms, saying he “can't federalize every police force in the country.” \nBut Obama’s latest moves are meant to show he is not sitting on the sidelines in addressing what he has called the nation’s “slow-rolling crisis” when it comes to police treatment of minorities. \nObama will announce $163 million in new Department of Justice grants to promote “community policing” practices at local departments, such stronger policies against racial profiling and increased transparency about officer-related incidents. \nThe Justice Department will also offer a “tool kit” to encourage more police departments to use body cameras in the field. \nOne of the most popular reforms to emerge after Ferguson was the widespread use of body cameras by police. The White House has launched a limited program that would equip 50,000 police officers with the cameras, but has stopped short of calling for their mandatory use. \nThe announcements come on the same day Obama is visiting Camden, N.J., which the White House has touted as antidote to Ferguson. \nCamden’s troubled police department was eliminated in 2012, and a new county-run force has been credited with improving community relations while driving down crime. \nThe city is one of 20 jurisdictions participating in a police data-sharing program that makes public information about use of force, traffic stops and officer-involved shootings. \nLast month, the Obama administration selected Camden as one of eight new “Promise Zones,” a federal program that gives preferential treatment to struggling municipalities applying for anti-poverty, health and crime-prevention grants. \nIt also participates in the White House’s My Brother’s Keeper Community Challenge, which sets educational standards for young minority males. \nDuring the visit, the president will meet with Camden County Police Chief Scott Thompson and tour the department's tactical operations center. He will also visit a group of police officers and young people and speak at a Salvation Army community center. \n“Camden is an example of a lot of good things happening, a lot of things moving in the right direction,” White House Domestic Policy Council Director Cecilia Muñoz said Sunday on a conference call with reporters. \nObama is dispatching Attorney General Loretta Lynch, Housing and Urban Development Secretary Julián Castro, Education Secretary Arne Duncan, Transportation Secretary Anthony Foxx, Labor Secretary Tom Perez and Agriculture Secretary Tom Vilsack to 10 other cities in the coming weeks where local authorities have improved relations with their communities.", "external_links": [], "published": "2015-05-18T13:00:00.000+03:00", "crawled": "2015-05-18T13:12:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}