{"organizations": ["U.S. Consulate", "Obama White House", "Fox News Facebook", "Twitter"], "uuid": "87d25994a372717156903302b5a9473fb7579452", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/09/11/many-questions-scant-justice-from-obama-white-house-one-year-after-benghazi/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422876232229.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/11/many-questions-scant-justice-from-obama-white-house-one-year-after-benghazi.html", "country": "", "title": "Many questions, scant justice from Obama White House one year after Benghazi attacks | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Many questions, scant justice from Obama White House one year after Benghazi attacks | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "87d25994a372717156903302b5a9473fb7579452"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/11/many-questions-scant-justice-from-obama-white-house-one-year-after-benghazi.html", "ord_in_thread": 0, "title": "Many questions, scant justice from Obama White House one year after Benghazi attacks | Fox News", "locations": ["Benghazi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print Sept. 11, 2012: The U.S. Consulate in Benghazi is seen in flames. \nOne year ago today, on September 11, 2012, we were reminded that despite our successes in the war on terror, Al Qaeda and its affiliates continue to threaten the United States and our personnel and facilities around the world. \nWe remember the lives and service of the four Americans, including Ambassador Chris Stevens, who were slain in Benghazi, Libya while trying to help bring peace and stability to a country going through a difficult transition. \nWe pray for their families who still mourn the loss of their loved ones. Unfortunately, a year later many questions remain about this tragedy. \nJust last month, Secretary of State John Kerry absolved the four State Department employees, who had previously been removed from their jobs, of any responsibility for the security failures that put Ambassador Stevens and his colleagues at risk. \n[pullquote] \nThis raises questions about the work of the Accountability Review Board and also means that no one at the State Department has been held accountable. \nAstonishingly, the Senate Foreign Relations Committee has yet to schedule hearings with the survivors of the attack, or State Department employees directly involved in overseeing the security of the diplomatic facility in Benghazi or the administration’s response that night. It’s also unacceptable that despite President Obama’s pledge last year that his “biggest priority” was to bring the perpetrators to justice, none of the terrorists who attacked the compound in Benghazi and who murdered four Americans have been killed or captured. \nThose who would threaten Americans and our interests are watching this failure to respond to the first murder of an American ambassador in the line of duty in decades closely. \nWe need to make sure that our men and women who serve overseas are adequately protected. The Obama administration continues to show no interest in learning from the mistakes that led to this tragic event. The administration’s unwillingness to take this attack seriously will have implications for our national security for years to come. \nRepublican Marco Rubio represents Florida in the U.S. Senate. He is a member of the Senate Committee on Commerce, Science and Transportation and a candidate for the Republican nomination for president in 2016. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}