{"organizations": [], "uuid": "4078c2f1afe713692eba76b08782b76b3a9353bc", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/09/03/as-syria-vote-looms-love-affair-grows-between-obama-and-liberal-media/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422621171393.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/03/as-syria-vote-looms-love-affair-grows-between-obama-and-liberal-media.html", "country": "", "title": "As Syria vote looms, love affair rekindled between Obama and liberal media | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "As Syria vote looms, love affair rekindled between Obama and liberal media | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "4078c2f1afe713692eba76b08782b76b3a9353bc"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/03/as-syria-vote-looms-love-affair-grows-between-obama-and-liberal-media.html", "ord_in_thread": 0, "title": "As Syria vote looms, love affair rekindled between Obama and liberal media | Fox News", "locations": ["US", "Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bret Stephens", "Obama"], "text": "Bret Stephens: Isolationism never served US, GOP interests \n\"Marc Ambinder of GQ tweeted, “Wow. Obama just pulled the loose string from that Gordian knot of the imperial presidency.” \nShortly after Republican media consultant Rick Wilson accurately tweeted, “A few seconds after his speech, I predicted a liberal and media squeeze-fest over this shenanigan. And I'm right,” Marc Ambinder shot back, “but Rick — maybe once — just this once — it’s deserved.” \nPerhaps the most high brow and hagiographic tweet of all came from the New York Times’ and CNBC’s John Harwood, who wrote, “Obama just changed historic trajectory of executive-legislative relations on war powers” and followed it up with “Obama said at March on Washington commemoration that arc of history doesn't bend on its own. He has bent it on WH war power.” \nThe press is in full “Defend the Precious” mode now. The divorce is off. The love affair rekindled by the president’s scapegoating Congress via procedural machinations. \nHe changed his mind on a forty-five minute walk with his chief of staff, USA Today would have you know. \nThe president surprised his national security team. John Kerry, having just Friday lifted his face to the camera to suggest action was imminent, got thrown under the bus except, the Washington press corps will have you know, he fully supports the decision. \nThus the press corps, bored from a rather mundane August where they have done their best to ignore Senators Mike Lee and Ted Cruz except to bash them, returns to Washington in September all atwitter, literally, for their man Barry. \nGeorge W. Bush, getting congressional approval for military operations seven days after the September 11th attack was not bending the arc of history, but John Harwood will probably spend the next week of reporting telling us all exactly how arc bending Barack Obama is. \nWhat’s really going on is Barack Obama needs Congress to save him from himself. The British were supposed to join us in our Syrian adventure. British and American warships moved into position. All David Cameron needed to do was get his Parliament on board. That did not turn out the way everyone expected. \nBarack Obama was perfectly happy to go it alone. \nJohn Kerry made it clear. \nSenior White House aides made it clear. But after talking with his chief of staff — the Washington press corps has failed to even consider political calculations in all of this — Barack Obama decided to punt it all to Congress. \nConsidering how rapidly the Washington press corps gravitated to “historic” and “arc bending” rhetoric, it is likely the president’s forty-five minute walk included a lot of talking points created to rekindle the romance with the press. \nThe original strategy laid out by Barack Obama had been questioned by some of the people who originally designed the plan. \nPro-war Senators like John McCain were questioning the wisdom of sending in a few cruise missiles without much else. \nMost of Washington buzzed that the planning thus far has been erratic and amateurish. \nThe president’s plan seemed, at best, a strategy of being only a little bit pregnant in Syria. No one really knew what the president wanted to do other than fire some missiles. \nFrederic Hof, a fellow at the Atlantic Council and the former Syria point person for the Obama State Department, told BuzzFeed over the weekend, “The results of this mystifying lack of preparedness have been abysmal.” \nWithout Britain on board, the United States would go it alone without any idea what exactly it would accomplish. \nThe public, sensing the Keystone Kops approach toward Syria, moved decisively against bombing. \nThe president, having pounded his chest in the name of executive power, now without Britain, needed to extricate himself from the situation. Passing the buck to Congress was the solution. Again, in its rush to defend the precious, it is staggering how so much of the press has ignored the political calculus of using Congress as a scapegoat. \nThis is not a bold move. \nThis is not an arc bending move. \nThis is not a move that should leave no one’s jaw dropped except by how quickly the Washington press corps has rallied to President Obama’s side. \nThe president is asking Congress to debate whether or not to bomb Syria on behalf of Al Qaeda aligned rebels and telling anyone who will listen he might just ignore Congress should it reject the bombing. \nThe only sad part of this whole affair is that Barack Obama’s new found skills at extricating himself from bad situations in the Middle East came too late to deploy for others in Benghazi. \nErick Erickson is a Fox News contributor and editor of RedState.com . Follow him on Twitter @EWErickson . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:11:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}