{"organizations": [], "uuid": "f76915f42ba773a1e4ff28f0c8db5b77eaa70d15", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2984170/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/22/obama-iraqi-premier_n_7421658.html", "country": "", "title": "Despite Obama Endorsement, U.S. Concerns Grow Over Iraqi Premier", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Despite Obama Endorsement, U.S. Concerns Grow Over Iraqi Premier", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T18:41:00.000+03:00", "replies_count": 0, "uuid": "f76915f42ba773a1e4ff28f0c8db5b77eaa70d15"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/22/obama-iraqi-premier_n_7421658.html", "ord_in_thread": 0, "title": "Despite Obama Endorsement, U.S. Concerns Grow Over Iraqi Premier", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Despite Obama Endorsement, U.S. Concerns Grow Over Iraqi Premier Reuters reddit \nBy Matt Spetalnick and Phil StewartWASHINGTON, May 21 (Reuters) - The Obama administration is publicly voicing confidence in Iraq's prime minister in the fight against surging Islamic State militants, but privately some U.S. officials question whether he is too weak to bridge the sectarian divide.Washington is still betting on Prime Minister Haider al-Abadi, who stands at the center of President Barack Obama's strategy to roll back the latest conquests of Islamic State while keeping the United States from being pulled deeper into a conflict U.S. combat troops left in 2011.But even if Abadi's forces manage to retake the provincial capital of Ramadi after its capture last weekend by Islamic State, his reliance on Iran-backed Shi'ite militias could strengthen his political rivals in Baghdad and signify U.S. acquiescence to greater Iranian influence in Iraq.That underscores how few options Washington has to beat back Islamic State without overhauling a policy that relies heavily on air strikes or committing large forces of American ground troops, which Obama has ruled out.As the jihadists shore up their positions, Abadi, a moderate Shi'ite leader, faces an important test over whether he can draw Sunni Arabs away from Islamic State, a challenge he has struggled to meet despite vows of a more inclusive governance. He must also show the ability to control powerful Shi'ite militias tainted by earlier abuses that have stoked Sunni anger toward his government.\"Abadi may be more vulnerable than ever,\" one U.S. official said, speaking on condition of anonymity. \"And if he's on the hot seat, we're being tested too.\"Islamic State, meanwhile, appears to have the momentum, with the Sunni radicals on Thursday seizing the central Syrian city of Palmyra, one of the most important cultural centers of the ancient world, and overrunning Iraqi government defenses east of Ramadi.The U.S. response has been limited, including air strikes, stepped-up weapons deliveries and a push for expanded training and equipping of moderate Sunnis, aimed at building up Iraqi forces to retake Ramadi.But just as notable is what Washington has not done and may not be prepared to do. There has been no announcement, for instance, of increasing troop levels beyond the 3,000 deployed to Iraq in train-and-assist roles in recent months.Also on hold for now is the idea of positioning U.S. special forces or military advisers closer to the fighting, which would put them at risk but provide more effective forward spotters for targeting U.S. air strikes. A senior U.S. State Department official said no such recommendation had yet been made by the Pentagon.FETED IN WASHINGTONThe mood in Washington has been tempered since a White House visit last month when Abadi was hailed by Obama as a \"strong partner\" who would create the multi-sectarian Iraqi government needed to beat back the Islamic State onslaught.U.S. officials have made clear that Washington is not ready to seek a replacement for Abadi, who took over from a polarizing figure, Nuri al-Maliki, as prime minister in late 2014 with strong backing from Washington.Obama, in an interview with The Atlantic magazine published on Thursday, described Abadi as \"sincere and committed to an inclusive Iraqi state\" and pledged to provide his government with \"all assistance that they need.\" But he added, \"We can't do it for them.\"One U.S. official said there had been longstanding concerns in Washington about Abadi's ability to navigate Iraq's sectarian politics, especially with fellow Shi'ite politicians such as Maliki believed to be actively seeking to undermine him. Recent events had raised misgivings about him, the official added.\"That fear still exists,\" the official said, speaking on condition of anonymity.\"ONLY HORSE TO BACK\"One reason Washington is sticking with him is that it sees no viable alternative to lead the fractured country, current and former U.S. officials said.\"I expect administration thinking at this stage is still that he is the only horse to back,\" said Paul Pillar, a former senior CIA specialist on the Middle East and now a professor of security studies at Georgetown University.The biggest test of U.S. patience will be whether Iraqi forces and Shi'ite militias, under Abadi's command, can retake Ramadi, capital of Iraq's biggest province in the Sunni heartland, without the fighting spiraling into a sectarian bloodbath by hardline militias accused of committing atrocities in an earlier campaign to reclaim Tikrit.Such violence would fuel Sunni resentment against the Shi'ite-dominated government in Baghdad and suggest Abadi was powerless to rein in the militias, some of which have strong financial backing from Iran.Shi'ite militias have sent thousands of fighters to join government forces outside Ramadi.The United States has said it will support the counter-offensive but that Shi'ite irregular forces must be under direct Iraqi military command and Sunni fighters must also be included.Despite Abadi's efforts to arm and train local Sunni tribesmen and integrate them into Iraq's security forces, little progress has been made, U.S. officials acknowledge, blaming this mostly on Shi'ite hardliners.The risk now is that even if Ramadi is retaken, Abadi will only be weakened while Iran will be seen, at least among Iraq's Shi'ite majority, as having come to Baghdad's aid. The timing is critical: many Sunni Arabs fear Iranian influence over Iraq will only grow if Washington clinches an Iran nuclear deal, possibly further damaging Abadi's chances of bridging the sectarian gap between Sunnis and Shi'ite Muslims.\"He may survive as prime minister but his power will be limited and his aims of inclusiveness frustrated,\" Dennis Ross, Obama's former top Middle East adviser, said of Abadi. But he added, \"Iran probably prefers a weak prime minister that leaves the Islamic Republic with all the leverage.\" (Additional reporting by Arshad Mohammed and Mark Hosenball; Editing by Jason Szep and Howard Goller) Also on HuffPost: ", "external_links": [], "published": "2015-05-22T18:41:00.000+03:00", "crawled": "2015-05-22T19:30:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}