{"organizations": [], "uuid": "a3a635f21f436a710d26b9896868650ad6064bdb", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/05/30/obama-declara-situacion-de-desastre-en-texas-por-las-grandes-inundaciones/", "country": "", "title": "Obama declara situación de desastre en Texas por las grandes inundaciones | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama declara situación de desastre en Texas por las grandes inundaciones | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "a3a635f21f436a710d26b9896868650ad6064bdb"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/05/30/obama-declara-situacion-de-desastre-en-texas-por-las-grandes-inundaciones/", "ord_in_thread": 0, "title": "Obama declara situación de desastre en Texas por las grandes inundaciones | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama declara situación de desastre en Texas por las grandes inundaciones Published May 30, 2015 EFE \nWashington, 29 may (EFEUSA).- El presidente, Barack Obama, firmó hoy una declaración de situación de desastre mayor en Texas a causa de las fuertes tormentas y grandes inundaciones de los últimos días que se han cobrado la vida de por lo menos 21 personas en el estado. \nEn un comunicado, la Casa Blanca informó de la declaración del presidente, que implica el envío de ayuda federal para complementar la que ya están proporcionando el estado, los municipios y las reservas de nativos americanos. \nDesde principios de mayo, pero especialmente durante los últimos cinco días, varias tormentas, tornados y fuertes vientos han azotado esa zona del sur del país, lo que ha causado grandes inundaciones que han dejado totalmente anegadas por días ciudades como Houston, la cuarta mayor del país. \nLa declaración de Obama responde a la petición expresa del gobernador de Texas, el republicano Greg Abbott, y pone fondos federales a disposición de las personas afectadas en los condados de Harris, Hays y Van Zandt. \nEntre otras cosas, la ayuda incluye subvenciones para alojamiento temporal y reparación de casas, préstamos a bajo costo para cubrir pérdidas de propiedades no aseguradas y \"otros programas para ayudar a los residentes y propietarios de negocios a recuperarse de los efectos del desastre\". \nEl temporal y las consecuentes inundaciones han dejado al menos 21 muertos en Texas, 6 en Oklahoma y 14 en el norte de México, y han forzado a otros muchos en la zona a abandonar sus casas. EFEUSA ", "external_links": [], "published": "2015-05-30T03:00:00.000+03:00", "crawled": "2015-05-31T19:32:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}