{"organizations": ["Fox News"], "uuid": "bd597cb11630448a3a9975f5d90428b4fd3e0d7f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media.foxbusiness.com/thumbnails/083013/0/0/083012_fb_ohanlon.JPG?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/30/secretary-kerry-mr-obama-emotions-may-win-arguments-but-dont-win-wars.html", "country": "", "title": "Secretary Kerry, Mr. Obama, emotions may win arguments, but they don't win wars | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Secretary Kerry, Mr. Obama, emotions may win arguments, but they don't win wars | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "bd597cb11630448a3a9975f5d90428b4fd3e0d7f"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/30/secretary-kerry-mr-obama-emotions-may-win-arguments-but-dont-win-wars.html", "ord_in_thread": 0, "title": "Secretary Kerry, Mr. Obama, emotions may win arguments, but they don't win wars | Fox News", "locations": ["Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kerry", "Obama"], "text": "Secretary Kerry Makes Forceful Case for Action on Syria \nIt is important not to let emotions get in the way of cold, hard, calculated military planning. \nEmotions may win arguments, but they don't win wars. Wars are won by clearly stating military and diplomatic objectives, committing the resources required to achieve those objectives, and not stopping until those objectives are achieved. \nWhat are the president's goals in using military force? To punish Assad? To deter Assad from using chemical weapons again? To telegraph to others that they will be punished similarly should they try to use these weapons? \nIf Obama's goal is punish Assad, then a limited strike against some of his war-making capacity is more of a military spanking that serious punishment. President Obama has made it clear we will not send troops into Syria, nor try to topple Assad from power. But unless our punishment fits the crime, Assad will conclude he has gotten away with it at a price, but a price worth paying. \nIf Obama's goal is to deter Assad, then what happens if our military action does not stop him, and he uses chemical weapons again? With all the caveats and limitations the president and his top officials have put on our military response, it is unlikely an American attack would destroy the chemical weapons themselves. \nSo what if Assad once again calls the president's bluff, as he did with the red line threat, and uses his remaining chemical weapons next week or next month? \nWould Obama then be willing to escalate the fighting, as President Johnson did during the Vietnam War? If not, then Syria, Iran and others will conclude that while America may talk tough, we will go only so far in carrying out our threats, and no further. \nLike a poker player, what if the Assad sees our bet and raise it? The British, Germans, and probably the Turks and French were in this poker game to start, but now seem to have dropped out. Will Obama do so too? \nIn foreign policy the only thing worse than not doing something, is doing something that fails or makes the situation worse.. Even U.S. military leaders, including the chairman of the Joint Chiefs of Staff, have spoken publicly and privately that they see enormous problems if the U.S. takes military action against Syria. Our limited actions are unlikely to deter Assad or anyone else. \nIndeed, they might encourage greater carnage. \nSo, while I'm moved by Secretary Kerry's eloquent statement, I'm not sold on military action unless someone can tell me what the president's military objectives are, how the forces he plans to commit will achieve those objectives, and what we can with confidence anticipate as the endgame of U.S. military action in Syria. \nKathleen Troia \"K.T.\" McFarland is a Fox News National Security Analyst and host of FoxNews.com's \"DefCon 3.\" She served in national security posts in the Nixon, Ford and Reagan administrations. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}