{"organizations": ["National Press Club", "Senate", "Congress"], "uuid": "bf0b7cff2273d6eb8a699da13cffd45080bd7dc4", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150428175511-barack-obama-april-28-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/05/08/health/kelly-hager-coma-to-ceo-irpt/index.html", "country": "US", "title": "Cliffhanger free-trade vote pits Democrats against Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Cliffhanger free-trade vote pits Democrats against Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T19:41:00.000+03:00", "replies_count": 0, "uuid": "8e4cf2c56e80af4dd8c36ad4a30327272d2984c6"}, "author": "", "url": "http://edition.cnn.com/2015/05/12/politics/free-trade-fast-track-vote/index.html", "ord_in_thread": 0, "title": "Cliffhanger free-trade vote pits Democrats against Obama", "locations": ["Washington", "Massachusetts", "Kentucky"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul", "Mitch McConnell", "Reid", "Warren", "Barack Obama", "McConnell", "Rand Paul", "Obama Here", "Elizabeth Warren", "Harry Reid", "Obama"], "text": "Here's why the TPP is such a big deal 03:24 Washington (CNN) President Barack Obama's clout within his own party is on the line with a cliffhanger vote in the Senate over whether to begin debate on a pet free-trade measure of his on Tuesday afternoon. Opposition to the measure, which would allow for quick approval of the 12-country free-trade agreement known as the Trans-Pacific Partnership, has been building among progressive Democrats for some time. It remained an open question early Tuesday whether an aggressive lobbying effort from the President himself would be enough to cobble together the Democratic votes needed to move to debate on the bill. It's a rare vote that will align Sen. Elizabeth Warren of Massachusetts, a liberal darling, and Sen. Rand Paul of Kentucky, a conservative favorite, in opposition. Paul said Tuesday he's told leadership he'll vote against opening debate — a break with his party, which broadly favors the free-trade agreement — because he hasn't seen enough of the agreement in the works. RELATED: Trade highlights Democrats' divorce from Obama \"While Sen. Paul has always been a strong advocate of free trade, he is hesitant to give blanket authority on a trade agreement that has yet to be seen,\" a Paul aide said. Warren and her fellow progressives have long been an outspoken opponent of the bill for the same reason — that it largely removes Congress' ability to weigh in on the deal until after it's been negotiated, a process that critics say has been done in secret and in close cooperation with lobbyists and special interests. Warren reiterated those complaints in an interview with NPR Tuesday morning. \"The way I see this, that's a tilted process, and a tilted process yields a tilted result,\" she said. More broadly, progressives are wary of a new free-trade deal because they believe it would draw jobs overseas and hurt American workers. During a speech at the National Press Club on Tuesday, Warren gave voice to those concerns, warning that \"this country is in real trouble.\" \"We cannot continue to run this country for the top 10 percent. We can't keep pushing through trade deals that benefit multi-national companies at the expense of workers,\" she said. \"Government cannot continue to be the captive of the rich and the powerful. Working people cannot be forced to give up more and more as they get squeezed harder and harder.\" Further raising doubts about final passage of the bill, Senate Minority Leader Harry Reid said the measure his Republican counterpart, Mitch McConnell, plans to bring up for a vote may not be enough. Democrats have demanded McConnell combine the fast-track trade bill with three other pieces of legislation, including one to help workers impacted by the trade agreement, and one cracking down on currency manipulation. But McConnell said Tuesday he'll only pair the trade bill with one other measure, Trade Adjustment Assistance, and let the rest of the bills get a debate in the amendment process. Reid hinted on the Senate floor Tuesday morning that McConnell's refusal to bundle all four bills could mean the vote's failure. \"If he doesn't do that, it's going to be very difficult to get to the guts of this,\" Reid said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-05-12T19:41:00.000+03:00", "crawled": "2015-05-12T21:05:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}