{"organizations": [], "uuid": "3ce6a4e0a4e00056a956855aa138d9816f259638", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/courtroom.jpg", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/policy/healthcare/243311-house-gop-challenges-obama-in-court", "country": "US", "title": "House GOP challenges Obama in court", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "House GOP challenges Obama in court", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T18:33:00.000+03:00", "replies_count": 0, "uuid": "3ce6a4e0a4e00056a956855aa138d9816f259638"}, "author": "Peter Sullivan", "url": "http://thehill.com/policy/healthcare/243311-house-gop-challenges-obama-in-court", "ord_in_thread": 0, "title": "House GOP challenges Obama in court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House GOP challenges Obama in court By Peter Sullivan - 05/28/15 11:33 AM EDT \nA federal judge on Thursday volleyed tough questions at the Obama administration during oral arguments in the House Republican lawsuit against President Obama’s use of executive power.The Obama administration argues that the House lacks legal standing and asked the court to dismiss the lawsuit. ADVERTISEMENT Administration lawyer Joel McElvain said the issue is a \"generalized\" dispute and there is no particular harm to House, meaning lawmakers have no standing.Federal District Judge Rosemary Collyer, an appointee of President George W. Bush, pressed McElvain on \"why you think this just an abstract issue of law.\"\"I want to know where you find the appropriation,\" she said. The lawsuit focuses on two issues related to ObamaCare.\nHouse Republicans argue the administration is unconstitutionally making payments to insurers to help cover low-income household’s expenses under a section of ObamaCare. The House argues the administration is paying out the money despite Congress never appropriating it. \nSecond, the House is challenging administration’s delay of the mandate for employers to provide insurance. While the Affordable Care Act set the mandate to begin in 2014, the administration first delayed it until 2015 and then delayed it again for medium-sized employers until 2016. Past: 1 day Report: Obama lied about bin Laden... Seymour Hersh accuses Obama of rushing to take credit for the al Qaeda... Michelle Obama speaks of emotional... She discussed facing comments \"rooted in the fears and misperceptions of... Bin Laden report 'full of lies,'... Seymour Hersh’s report is “garbage,” says SEAL who claims he killed Osama... Juan Williams: The GOP's festival... OPINION | Candidates are abandoning previous positions to better appeal to... Investigative journalist defends... Seymour Hersh accuses the White House of mischaracterizing details of bin... Two years later, IRS probes drag on GOP lawmakers fuming about the status of the IRS investigation. DHS secretary: Lone wolf attackers... “We’re very definitely in a new environment,\" Jeh Johnson said. Killings of police officers on the... Fifty-one officers were killed in a felony crime in 2014, the FBI said. 113 Republicans back lawsuit... They accuse the president of \"disrupting the delicate balance of powers.\" George Zimmerman shot in Florida Police in Florida say George Zimmerman was involved in what appears to be... Immigration debate roils GOP A group of dissident Republicans in the House are clashing with their... Pressure mounts as Congress dives... The clock is fast running out on the agency’s power to collect phone... Report: Christie spent $300,000 in... A watchdog found Christie racked up an $82,000 bill at the home of the... Karl Rove surrenders to ObamaCare He correctly tells Republicans that their pledge to repeal ObamaCare is a...", "external_links": [], "published": "2015-05-28T18:33:00.000+03:00", "crawled": "2015-05-28T18:56:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}