{"organizations": [], "uuid": "71c52c6af9ca080be0df77de351a67db1b896f49", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2907034/images/o-OHIO-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/civil-rights/feed", "section_title": "Civil Rights on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/03/ohio-abortion-clinics-clo_n_7199964.html", "country": "US", "title": "Half Of Abortion Clinics In Ohio Have Closed In The Past 4 Years", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Half Of Abortion Clinics In Ohio Have Closed In The Past 4 Years", "spam_score": 0.0, "site_type": "news", "published": "2015-05-03T17:05:00.000+03:00", "replies_count": 0, "uuid": "71c52c6af9ca080be0df77de351a67db1b896f49"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/03/ohio-abortion-clinics-clo_n_7199964.html", "ord_in_thread": 0, "title": "Half Of Abortion Clinics In Ohio Have Closed In The Past 4 Years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ohio Clinics Close, Abortions Decline Amid Restrictions Associated Press | By Julie Carr Smyth Posted: Updated: 42 minutes ago In this Tuesday, April 28, 2015 photo, a woman walks past the Center for Women's Health, in Cleveland. The Associated Press has documented that half of Ohio's abortion providers have either closed or reduced services over the last four years and the number of abortion procedures also is falling. | ASSOCIATED PRESS reddit \nCOLUMBUS, Ohio (AP) — The number of abortion providers in Ohio has shrunk by half amid a flurry of restrictive new laws over the past four years, and the number of the procedures also is declining, according to a review of records by The Associated Press. \nBoth sides agree the added limits and hurdles placed on Ohio abortions have played a role in facility closures reaching to every corner of the nation's 7th most populous state. What is less clear is whether the downward trajectory in procedures is a cause or an effect of some of the most significantly reduced abortion access in the nation. \nSeven of 16 Ohio abortion providers have either closed since 2011 or curtailed abortion offerings, while an eighth, in Toledo, is operating under the cloud of pending litigation, according to AP interviews and examinations of state licensing and business records. \nThe plunge places Ohio second in closures nationally, behind Texas, where 17 of 40 providers have stopped operating since 2011. The recent shuttering of two of 20 abortion providers in Virginia is widely considered the third most significant example, since one of the facilities was the state's busiest. Both states also have tightened abortion laws. \nOhio saw induced abortions fall from 25,473 in 2012 to 23,216 in 2013 — a period when 5 of the 7 affected providers closed or curtailed services — state figures show. That was the lowest level recorded since the state began tracking the data in 1976, and part of a general downward trend that began in the late 1990s. \nAbortion foes call the decisions of Ohio facilities to close or to stop providing all types of abortions a victory for their lobbying strategy, which has increasingly substituted sophisticated outreach and incremental legislative proposals for the shock value of bloody fetal photographs. \nOhio Right to Life President Mike Gonidakis says expanded access to health care for the poor and to crisis pregnancy counseling is also helping push abortions down. \n\"It's a combination of a lot of things,\" he said. \"Our society's changing. More and more women are choosing life.\" \nAbortion rights advocates, however, say Ohio has passed so many limits on the procedure — affecting girls and women, doctors and facilities — that many people who want an abortion can't get one. \nNARAL Pro-Choice Ohio executive director Kellie Copeland says her organization has collected many stories of Ohio women have to drive long distances or leave the state to get abortions. After a clinic in Lima closed, for example, residents there would have to drive about an hour to Toledo or Dayton or make a trek to neighboring Indiana to find an open clinic. Reduced access has also meant delays that push women past the window for a legal, safe abortion, Copeland said. \nOhio's reputation as a politically purple state doesn't apply to abortion, said Elizabeth Nash, senior state issues associate for the abortion-rights nonprofit Guttmacher Institute. \n\"On abortion, for decades it has been incredibly conservative,\" she said. \"It's one of the states people look to, to see what the next restriction is going to look like.\" \nSince 2011, when Republicans reclaimed both chambers of the Legislature and GOP Gov. John Kasich succeeded a Democrat, laws have passed banning all abortions after a fetus is deemed viable outside the womb; requiring women to undergo an ultrasound and listen to the fetal heartbeat before an abortion; and making it difficult or impossible to get the hospital transfer agreement required to operate a legal abortion clinic. \nOhio Right to Life and its allies have announced plans to introduce additional restrictions. A twice-defeated \"heartbeat bill\" backed by a separate group, which would effectively ban abortions as early as six weeks into pregnancy, also has been reintroduced. \nTamara Mann, of Columbus, learned at 13 weeks that her fetus wasn't viable. It was a wanted pregnancy for a woman in her 30s, she says. \nMann said Ohio's restrictive climate added hurdles to the already heartbreaking process of undergoing a D&C, or dilation and curettage, which she undertook after consultation with multiple doctors and three rabbis. \n\"I had a fetal heartbeat and it was very, very hard to get medical attention in Ohio,\" she said. \"Everyone agreed that I should have the D&C, but my insurance companies treated it as an optional abortion until I fought against it, and the state forced me through this entire informed consent issue, which was very challenging.\" \nMann has taken to describing her experience as \"a complicated miscarriage\" rather than an abortion — saying the stigma and pre-conceived notions attached to the word hinder productive debate. \nAbortion rights supporters say Ohio's legal restrictions directly affected access to abortions in some cases. A clinic that had trouble arranging the required transfer agreement closed in Toledo, for example, and another near Cincinnati stopped providing surgical abortions after a legal fight with the state over a related issue about backup care. \nCopeland rejects the suggestion that a reduced demand for abortions is prompting the supply of Ohio abortion facilities to shrink. \n\"If that were the case, and we've seen roughly half of our clinics close, the corollary you'd think would be we'd see roughly half the procedures — and that's not the case,\" she said. \"These laws have all been about creating these false hurdles for clinics to have to jump through in order to provide safe, legal abortion care to their patients.\" \n___ \nContributing to this report were Associated Press writers Kantele Franko in Columbus; Will Weissert in Austin, Texas; and Larry O'Dell in Richmond. Related on HuffPost: Abortion Protests Around The Nation of   FILE - In this July 12, 2013 file photo, anti-abortion rights supporter Katherine Aguilar holds a crucifix and prays while opponents and supporters of abortion rights gather in the State Capitol rotunda in Austin, Texas. Nearly three-quarters of Texas' 18 abortion facilities would be forced to close by the end of Aug. 2014 if one of the nation's toughest new anti-abortion laws is allowed to take effect, attorneys for clinics challenging the law told a federal judge Monday, Aug. 4, 2014. (AP Photo/Tamir Kalifa, File) Demonstrators rally against Colorado Senate Bill 175, in a protest led by Archbishop of Denver Samuel J. Aquila, on the steps of the state capitol in Denver, Tuesday April 15, 2014. The bill up for debate Tuesday is described as a guarantee that state or local policies won't interfere with reproductive decisions such as abortion and contraception. Democratic sponsors say the measure is needed to protect women's rights. (AP Photo/Brennan Linsley) Georgia Sen. Donzella James, D-Atlanta, left, and Sen. Valencia Seay, D-Riverdale, right, hold up coat hangers with pictures of the Statue of Liberty attached while protesting against an abortion bill sponsored by Sen. Judson Hill, RâMarietta, rear, on the Senate floor, Monday, March 3, 2014, in Atlanta. The Georgia Senate has voted to approve a bill restricting abortion coverage in plans available through the state health insurance exchange.State senators voted 35-18 to advance the bill, which now heads to the House for consideration. The federal health care law allows states to draft legislation prohibiting abortion coverage in qualified health plans offered through an exchange. Supporters of the Georgia effort say 24 states have done so. Democrats opposed the bill, calling it a continuation of a \"war on women\" and saying it infringes on a woman's right to choose. (AP Photo/David Goldman) FILE - This Feb. 20, 2013 file photo shows a protester outside the Red River Valley Women's Clinic, the state's sole abortion provider, in Fargo, N.D. The clinic has entered into settlement talks on a lawsuit it filed last year against a new law that requires doctors who perform abortions to obtain hospital-admitting privileges. (AP Photo/Dave Kolpack, File) Ellie Schilling, center, a lawyer representing Louisiana abortion clinics, speaks at a protest outside the Department of Health and Hospitals building on Tuesday, Feb. 4, 2013, in Baton Rouge, La. Abortion rights supporters say DHH issued rules that would have shut down all of the state's abortion clinics. The department rescinded the rules this week. (AP Photo/Melinda Deslatte) Abortion opponents gather in San Francisco's Civic Center for the \"Walk for Life\" rally and march, Saturday, Jan. 25, 2014, in San Francisco. Thousands of abortion opponents marched through downtown San Francisco for the 10th annual \"Walk for Life West Coast.\" The protesters rallied at Civic Center Plaza in front of City Hall before marching down Market Street to Justin Herman Plaza. (AP Photo/Beck Diefenbach) Abortion opponents from across Kansas rally outside the Statehouse, Wednesday, Jan. 22, 2014, in Topeka, Kan. Hundreds marked the anniversary of the U.S. Supreme Court decision legalizing abortion nationwide. (AP Photo/John Hanna) Anti-abortion demonstrators rally at the annual March for Life on the National Mall in Washington, Wednesday, Jan. 22, 2014. Thousands of anti-abortion demonstrators are gathering in Washington for an annual march to protest the Supreme Court's landmark 1973 decision that declared a constitutional right to abortion. (AP Photo/Charles Dharapak) Pro-choice demonstrators rally outside the Supreme Court in Washington, Wednesday, Jan. 22, 2014. Thousands of abortion opponents are facing wind chills in the single digits to rally and march on Capitol Hill to protest legalized abortion, with a signal of support from Pope Francis. (AP Photo/Susan Walsh) FILE - In this March 25, 2013, file photo Kris Kitko, left, leads chants of protest at an abortion-rights rally at the state Capitol in Bismarck, N.D. Abortion-rights advocates filed a lawsuit in federal court June 25, 2013, in Bismarck, N.D., challenging two new North Dakota laws that impose the nation's toughest abortion restrictions. (AP Photo/James MacPherson, File) BOSTON - JUNE 28: Congregants from Immaculate Conception Parish in Everett, Mass. recited the rosary outside Planned Parenthood in Boston, Mass. on June 28 2014. (Photo by Wendy Maeda/The Boston Globe via Getty Images) FILE - This Nov. 21, 2013 file photo shows abortion support signs outside of the Jackson Women's Health Organization clinic in Jackson, Miss. A federal appeals court panel ruled Tuesday, July 29, 2014 that a Mississippi law that would close the state's only abortion clinic is unconstitutional. (AP Photo/Rogelio V. Solis, File) Demonstrators gather outside the Alabama Statehouse in Montgomery, Ala., Tuesday, April 2, 2013. About 100 Pro-Choice demonstrators gathered to voice their opinions to lawmakers who were gathering inside the Statehouse for the second half of the regular legislative session. (AP Photo/Dave Martin) Abortion-rights supporters Dina van der Zalm, right, and Allyson Junker stand on the steps of the Missouri Capitol Wednesday, Sept. 10, 2014, in Jefferson City, Mo. Missouri lawmakers are expected to consider whether to override a veto by Gov. Jay Nixon of legislation requiring a 72-hour waiting period for abortions, one of the longest mandatory delays in the nation, during a special legislative session that begins Wednesday. (AP Photo/Jeff Roberson) Opponents to expanded abortion rights in New York state hold signs at the Capitol on Wednesday, June 12, 2013, in Albany, N.Y. Part of Gov. Andrew Cuomo's 10-point women's rights legislation aims to codify the federal Roe v. Wade decision on abortion rights into state law. (AP Photo/Mike Groll) Ruth Bromer, 63 of Raleigh, North Carolina (foreground) and Jennifer Hesse, 34, of Cary (center) shout slogans on the BiCentennial Plaza across from the Legislative Building as the North Carolina Senate gave its approval to a series of abortion restrictions Wednesday, July 3, 2013 in Raleigh, North Carolina. The bill, when originally introduced prohibited the recognition of foreign law, such as Islamic Sharia law, in family courts, was changed Tuesday with little public notice and the new bill titled the Family, Faith and Freedom Protection Act, added anti-abortion legislation. Senators voted 29-12 to approve House Bill 695. (Chuck Liddy/Raleigh News & Observer/MCT via Getty Images) The Senate gallery is already at capacity before session starts Wednesday July 3, 2013, in Raleigh, North Carolina. House bill 695, when originally introduced prohibited the recognition of foreign law, such as Islamic Sharia law, in family courts, was changed Tuesday with little public notice and the new bill titled the Family, Faith and Freedom Protection Act, added anti-abortion legislation. Senators voted 29-12 to approve House Bill 695. (Chuck Liddy/Raleigh News & Observer/MCT via Getty Images)  Share", "external_links": [], "published": "2015-05-03T17:05:00.000+03:00", "crawled": "2015-05-03T22:00:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}