{"organizations": ["FBI", "Justice Department", "Apple", "White House", "Yahoo", "Microsoft", "Facebook", "Google", "National Security Agency"], "uuid": "6be47b39406670f213bf605ecc596fa25793a53b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/computersmartphoneinternet_051315getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/cybersecurity/242473-tech-coalition-pressures-white-house-on-encryption", "country": "", "title": "Tech coalition pressures Obama on encryption | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Tech coalition pressures Obama on encryption | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "6be47b39406670f213bf605ecc596fa25793a53b"}, "author": "", "url": "http://thehill.com/policy/cybersecurity/242473-tech-coalition-pressures-white-house-on-encryption", "ord_in_thread": 0, "title": "Tech coalition pressures Obama on encryption | TheHill", "locations": ["U.S.", "Silicon Valley"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Edward Snowden", "Obama", "Cory Bennett"], "text": "Tech coalition pressures Obama on encryption Getty Images By Cory Bennett - 05/19/15 09:28 AM EDT The tech community is stepping up its pressure on the White House to oppose any requirement that could force companies to compromise security to guarantee government investigators access to data. A coalition of nearly 150 civil liberties organizations, digital rights advocates, tech industry trade groups, security researchers and major Silicon Valley firms all signed a letter sent Tuesday to President Obama. ADVERTISEMENT “The administration faces a critical choice,” it said. “Will it adopt policies that foster a global digital ecosystem that is more secure, or less? That choice may well define the future of the Internet in the 21st century.” The move comes as the White House is preparing a report on potential ways law enforcement can bypass encryption during a criminal or national security investigation. “We urge you to reject any proposal that U.S. companies deliberately weaken the security of their products,” the letter said. “We request that the White House instead focus on developing policies that will promote rather than undermine the wide adoption of strong encryption technology.” The tech community has been battling the Obama administration over encryption standards since disclosures from former National Security Agency contractor Edward Snowden revealed numerous secret spying programs. Tech leaders like Apple and Google rolled out products with encryption technology that locked out government officials and even the companies themselves. The Justice Department and FBI started banging the drum, warning that these moves are creating a zone of safety for criminals. The agencies say they support strong encryption, but argue federal investigators should be able to obtain information from phones when armed with a warrant. The disagreement has created a standoff. The tech set holds firm that any sort of guaranteed access to an encrypted product creates a “back door” vulnerability that will eventually be exploited by nefarious actors. The government says it simply wants a legal framework to get data through the “front door.” It doesn’t care how companies make that data accessible. “Whether you call them ‘front doors’ or ‘back doors,’ introducing intentional vulnerabilities into secure products for the government’s use will make those products less secure against other attackers,” the coalition said. “Every computer security expert that has spoken publicly on this issue agrees on this point, including the government’s own experts.” Most of Silicon Valley’s major players signed on to the letter, including Adobe, Apple, Facebook, Google, LinkedIn, Microsoft, Twitter and Yahoo. Lawmakers on both sides of the aisle also back the coalition’s argument, making any congressionally mandated access a tough option for Obama. Lawmakers recently sparred with an FBI official about the topic during a hearing . \n“Creating a pathway for decryption only for good guys is technologically stupid,” said Rep. Ted Lieu (D-Calif.), who has a bachelor’s degree in computer science from Stanford University. ", "external_links": [], "published": "2015-05-19T03:00:00.000+03:00", "crawled": "2015-05-19T22:24:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}