{"organizations": [], "uuid": "01a3192f6c67c2837136147f6cbc03df7de63c6c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2956308/images/o-ELIZABETH-WARREN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/15/elizabeth-warren-fight-for-15_n_7292142.html", "country": "", "title": "Bernie Sanders, Elizabeth Warren Ask Obama To 'Fight For $15' With Executive Power", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Bernie Sanders, Elizabeth Warren Ask Obama To 'Fight For $15' With Executive Power", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T19:41:00.000+03:00", "replies_count": 0, "uuid": "01a3192f6c67c2837136147f6cbc03df7de63c6c"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/15/elizabeth-warren-fight-for-15_n_7292142.html", "ord_in_thread": 0, "title": "Bernie Sanders, Elizabeth Warren Ask Obama To 'Fight For $15' With Executive Power", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Elizabeth Warren Ask Obama", "Bernie Sanders"], "text": "Bernie Sanders, Elizabeth Warren Ask Obama To 'Fight For $15' With Executive Power Posted: reddit \nWASHINGTON -- The Fight for $15 labor movement has found some high-profile allies in the U.S. Senate, and now they're asking President Barack Obama to get onboard. \nIn a letter to the White House led by Sen. Bernie Sanders (I-Vt.) on Friday, 18 senators, including Sen. Elizabeth Warren (D-Mass.), asked Obama to issue a \"model employer\" executive order, which would give contracting preference to firms that pay a living wage, offer health care and sick leave, and guarantee union rights for workers. \n\"Mr. President, the stroke of your pen can have transformative impact for millions of workers,\" the letter states. \"As low-wage fast food, retail and federal contract workers continue to strike in growing numbers to 'Fight for $15 and a Union,' we urge you to harness the power of the presidency to help these workers achieve the American Dream.\" \nThe letter notes that the president has held up for-profit companies like Costco as high-road employers, so the federal government itself should \"invest our taxpayer dollars to incentivize model employers that commit to creating good jobs and to rebuilding America's ailing middle class.\" \nObama has already issued executive orders that he says will improve pay and working conditions for workers employed under federal contracts. That includes an order that sets a $10.10 minimum wage for such workers, and another order that bars firms proven to have committed wage theft from getting new contracts. \nThe senators asked the president to \"build further on that momentum.\" \nThose earlier orders came amid intermittent strikes and protests by low-wage workers in Washington, D.C., who are affiliated with a group called Good Jobs Nation. Most of the protesters do janitorial and concessions work for contractors in federal buildings, including the Capitol, and many earn close to the minimum wage. Good Jobs Nation is funded by the Change to Win labor federation, which includes the Service Employees International Union, the union that has bankrolled national fast food strikes . \nFight for $15 is the 3-year-old, union-backed coalition that has been staging worker strikes and protests in cities around the country to draw attention to low wages. Funded largely by the SEIU, the protests began with fast-food workers but have grown to include home care workers and even adjunct professors. \nThe letter is just the latest indication that the union-backed movement has succeeded in influencing Democratic politics, and not just when it comes to state and local minimum wage laws. \nPaco Fabian, a spokesman for Good Jobs Nation, said Democrats looking to run for the White House should take note of Friday's letter, which was signed entirely by Democrats and Sanders, an independent who is also making a bid for the Democratic nomination . \n\"For the first time a group of U.S. Senators are demonstrating strong support for low wage workers trying to improve their working conditions by proposing a realistic solution,\" Fabian said in an email. \"The federal government's role regarding economic inequality is clear. The question is which candidates for President plan to propose common sense solutions? This letter provides part of the answer.\" \nThe other Democrats who signed the letter are Dick Durbin (Ill.); Richard Blumenthal (Conn.); Edward Markey (Mass.); Mazie Hirono (Hawaii); Debbie Stabenow (Mich.); Ron Wyden (Ore.); Barbara Mikulski (Md.) Al Franken (Minn.); Jeff Merkley (Ore.); Chris Murphy (Conn.); Tammy Baldwin (Wis.); Jack Reed (R.I.); Ben Cardin (Md.); Bob Menendez (N.J.); Sheldon Whitehouse (R.I.); and Martin Heinrich (N.M.). More: ", "external_links": [], "published": "2015-05-15T19:41:00.000+03:00", "crawled": "2015-05-15T20:55:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}