{"organizations": [], "uuid": "f6666588e517e7fff6c34cb9906a606b037ab52c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051115_kf_jeb.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/05/12/take-chill-pill-jeb-bush-dismisses-dip-in-polls-defends-immigration-stance/", "country": "US", "title": "Jeb Bush dismisses dip in polls, defends immigration stance", "performance_score": 5, "site": "foxnews.com", "participants_count": 26, "title_full": "Jeb Bush dismisses dip in polls, defends immigration stance | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T03:00:00.000+03:00", "replies_count": 27, "uuid": "72d7075df5a67d916cf029aa625760629645e0e1"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/12/take-chill-pill-jeb-bush-dismisses-dip-in-polls-defends-immigration-stance/#post-0", "ord_in_thread": 0, "title": "Jeb Bush dismisses dip in polls, defends immigration stance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 12, 2015 FoxNews.com livefyre Email Print\nJeb Bush, in an exclusive interview with Fox News’ “The Kelly File,” rejected the suggestion that the momentum behind his likely presidential bid has slowed – calling recent polls “irrelevant” and urging those closely watching them to “take a chill pill.”\nBush, though widely expected to run for the Republican nomination, has held back as several other Republicans have officially announced their 2016 campaigns in recent weeks. As they dominate the headlines, some – notably, Bush’s presumed home-state rival, Florida Sen. Marco Rubio – have enjoyed a surge in the polls.\nBut Bush stressed in the interview with Fox News that he’s not a candidate yet.\n“The polls are totally irrelevant,” the former Florida governor told show host Megyn Kelly. “I’m not a candidate yet. So … everybody needs to take a chill pill on the polls until it gets closer.”\nIn the roughly 22-minute interview, Bush addressed Common Core, immigration reform and his family’s political dynasty – all issues posing early challenges for him in a potential GOP primary. And he defended his 2016 exploratory efforts – first announced in mid-December – while taking a swipe at the campaign for Democratic frontrunner Hillary Clinton.\n“I godo town hall meetings, don’t screen the questions, don’t have a protected bubble like Mrs. Clinton does, don’t have town hall meetings or roundtable discussion where I pick who gets to come and I screen the questions, and the press has to behave a certain way,” he said in his first full, on-camera TV interview this year.\nWhile Bush continues to stay visible, his poll numbers have jumped around since he emerged as an initial GOP frontrunner earlier this year.\nFox News polling released late last month showed Rubio enjoying a bump after his mid-April campaign announcement, polling at 13 percent in the race for the GOP nomination. Bush slipped down to 9 percent in that survey.\nThe average of polling on RealClearPolitics.com shows Bush slipping only slightly, but his advantage over the rest of the field slimming considerably. He now pulls 16 percent of the vote but leads Rubio by just 1 percentage point, according to RealClearPolitics.com.\nBush, in the Fox News interview, continued to defend his stance on the English and math standards known as Common Core while acknowledging conservative criticisms.\nHe argued that schools must be held to higher standards and pointed to the program’s success in Florida, where he was governor from 1997 to 2007.\n“I respect people having a view,” Bush said. “But the simple fact is, we need higher standards. They need to be state driven. The federal government should play no part in this either, either in the creation of standards, content or curriculum.”\nHe argued that only one-third of U.S. students are college or career ready and that Florida under his leadership led the country in learning gains, includes vastly improved graduation rates.\nIn response to criticism by conservatives that he supports a form of amnesty for illegal immigrants, Bush said he backs legal status -- but not citizenship -- for those who have entered the country illegally.\n“A practical solution of getting to fixing the legal system is also allowing for a path to legalized status, not necessarily citizenship,” he said.\nNevertheless, he suggested that the country must take some kind of common sense approach to what to do with an estimated 11 million people living illegally in the United States, particularly children of illegal immigrants.\n“What are we supposed to do, marginalize these people forever?” Bush asked.\nHe also suggested he would undo President Obama’s executive actions that suspend deportation for some illegal immigrants, under comprehensive reform legislation.\nOn the foreign policy front, Bush said that he would have authorized the 2003 invasion of Iraq, like his brother, President George W. Bush did, and said Clinton – who backed the authorization for use of force as senator -- also would have.\n“And so would almost everybody that was confronted with the intelligence they got,” he told Megyn Kelly.\nHe also acknowledged that he indeed uses his brother as a foreign policy adviser but said he is not the only adviser. And he dismissed criticism that winning the White House would only extend the family’s presidential dynasty that started with his father, George H.W. Bush, in 1989.\n“I love my brother, and I respect his service,” Bush said. “I haven’t been in Washington … ever. I’m not part of Washington.”\nAdvertisement\nTrending in Politics 1 Federal judge agrees to reopen Hillary Clinton email lawsuit 2 Jeb Bush dismisses dip in polls, defends immigration stance 3 Krauthammer on Morell: \"Most telling statement is what he says about Benghazi\" 4 Fiorina answers NBC's website flap questions by snapping up 'ChuckTodd.org' 5 Obama's pick to be US ambassador to Somalia withdraws See all Trends Advertisement", "external_links": [], "published": "2015-05-12T03:00:00.000+03:00", "crawled": "2015-05-12T12:16:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}