{"organizations": [], "uuid": "856b6ee44dabec022fd2a130f4e261a8bd5d02f2", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/21/politics/tunisia-president-essebsi-obama-meeting/index.html", "country": "", "title": "President Obama pledges aid to Tunisia - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "President Obama pledges aid to Tunisia - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T02:01:00.000+03:00", "replies_count": 0, "uuid": "856b6ee44dabec022fd2a130f4e261a8bd5d02f2"}, "author": "", "url": "http://www.cnn.com/2015/05/21/politics/tunisia-president-essebsi-obama-meeting/index.html", "ord_in_thread": 0, "title": "President Obama pledges aid to Tunisia - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> President Obama pledges aid to Tunisia Updated 2316 GMT (0616 HKT) May 21, 2015 JUST WATCHED Trouble in the birthplace of the Arab Spring 06:37 Washington (CNN) As ISIS spreads across the Middle East to North Africa and other regional states writhe in turmoil, one country is desperately fighting to hold onto its democratic freedom: Tunisia, the small North African nation that gave birth to the revolutionary movement more than four years ago. In Washington, D.C., Thursday, President Barack Obama met with Tunisian President Beji Caid Essebsi to assure him more U.S. aid and backing was on the way to sustain Tunisia's fledgling democracy. Appearing together in the Oval Office, Obama said his administration was \"fully committed\" to building on Tunisia's success. He designated Tunisia as a major non-NATO ally of the U.S., which clears the way for the country to receive more military aid and other upgraded security arrangements. While grateful, Essebsi emphasized that Tunisia has \"a long way ahead\" and \"is threatened by terrorists, by parties that do not believe in democracy.\" Essebsi stressed, \"We must protect those gains.\" Right now, Tunisia, the home of the Arab Spring and the only country to emerge from the revolutions as a democracy, is in jeopardy. Essebsi, elected in December for a five-year term, is under no illusions that he has very little time to turn things around. The poor young revolutionaries who took the streets in 2011 to spark the Arab Spring made economic opportunity, foreign investments and job creation central to their demands. A high unemployment rate Yet officials say nearly 35 percent of young Tunisians are unemployed. \"In some areas of the country there are real rumblings beneath the surface, pockets of misery, that have the potential to spill and blow up into something,\" said Middle East scholar Sarah Feuer of the Washington Institute for Near East Policy. Feuer pointed to the growing number of unemployed Tunisian graduate students, who've recently joined the labor movement in protests, hunger strikes and sit-ins, raising concern that more unrest is to come. Some political observers say the U.S. is, at best, guilty of benign neglect, holding Tunisia up as a beacon of hope without supporting the lone Arab Spring democracy economically. Secretary of State John Kerry called Tunisia \"a shinning light in the region,\" but there is a question about how much the U.S. is willing to contribute to try to keep that light on. The Foreign Policy Initiative, a conservative think tank, notes the U.S. provided $189 million in aid to Tunisia in 2012 but only requested $66 million in 2015. In February of this year, the State Department announced its intention to nearly double economic assistance and triple security aid for 2016. Feuer called the trend reversal a \"positive step.\" JUST WATCHED Tunisian Pres. committed to democracy in face of terror 08:58 PLAY VIDEO On Thursday the Obama administration announced it would provide $134 million in aid to Tunisia for next year and up to $500 million in loan guarantees for economic reforms. In a joint op-ed by Obama and Essebsi published in the Washington Post, the leaders said, \"This is not charity; it's a smart investment in our shared future.\" Obama and Essebsi also wrote that, \"Tunisia shows that democracy is not only possible but also necessary in North Africa and the Middle East.\" Feuer said that Tunisia has turned out differently -- so far -- from other countries that experience Arab Spring revolutions because, unlike its neighbors, it has a relatively small, homogenous population, a strong, educated middle class, a weak military, active civil society and both Islamist and non-Islamist politicians who decided everyone would have a stake in Tunisia's future. From the looks of who attended the U.S.-Tunisian talks this week, Tunisia might also get some help in sustaining that unique situation from the private sector as well. Kerry's closed-door meeting with Essebsi's delegation Wednesday, led by U.S. Commerce Secretary Penny Pritzker, included business leaders from Google, Soros, Hilton, Bechtel and Motorola. Essebsi hopes to attract an equally high-octane economic audience in Germany when he attends the G7 summit next week. But it's not just economic woes that are buffeting the North African country. Security threats loom large Tunisia is also facing huge security threats. It's not a friendly neighborhood. To the West, along the border with Algeria, the Tunisian government continues to battle jihadists who are working with criminal cartels aimed at smuggling weapons into the country. To the east, Tunisia has had to absorb more than a million refugees who've fled Libya's civil war. While Essebsi was able to successfully negotiate the transition of power from the country's major Islamist party in 2013 and create a secular, inclusive constitution, Tunisia's neighbors threaten to unravel the country's progress. Most notably, Libya. Since the ouster of Moammar Gadhafi in 2011, the country has nearly collapsed as warring factions compete for power. Essebsi has publicly said that while foreign military intervention is not the answer, the U.N.-sponsored talks for reconciliation have been too slow. In the meantime, extremists groups are flourishing. In March of this year, Tunisia was rocked to its core when two young, educated, middle-class Tunisian men trained at a Libyan terrorist camp, returned to Tunisia and killed 21 foreign tourists and a police officer at Tunis's Bardo National Museum. Tunisian authorities say ISIS has successfully recruited close to 3,000 Tunisians to fight for them in Iraq and Syria, with Islamist militants targeting Tunisia's vulnerable disenfranchised youth. The fear is that if Tunisia's economy tanks, ISIS will attract even more. Gunmen attack Tunisian museum 15 photos People pray at the entrance gate of the Bardo Museum in Tunis, Tunisia, on Wednesday, March 18. Earlier in the day, at least 23 people were killed -- most of them tourists -- when gunmen opened fire in the museum. Hide Caption Gunmen attack Tunisian museum 15 photos A person is taken away on a stretcher outside the museum. Hide Caption Gunmen attack Tunisian museum 15 photos Bullet holes are seen in a bus window near the museum. Hide Caption 3 of 15 Gunmen attack Tunisian museum 15 photos A helicopter flies around the museum, which is housed in a 19th-century palace and describes itself as \"a jewel of Tunisian heritage.\" Its exhibits showcase Tunisian art, culture and history. Hide Caption Gunmen attack Tunisian museum 15 photos Tourists are moved away from the scene of the shooting. Hide Caption 5 of 15 Gunmen attack Tunisian museum 15 photos Tunisian President Beji Caid Essebsi leaves a Tunis hospital after visiting those injured in the attack. Hide Caption Gunmen attack Tunisian museum 15 photos Security forces patrol around the museum. Hide Caption 7 of 15 Gunmen attack Tunisian museum 15 photos The museum is evacuated by authorities. There was a significant number of foreign tourists at the museum at the time of the attack -- something that's not surprising, given its prominence in Tunisia and the fact that at least two cruise ships were docked in Tunis. Hide Caption Gunmen attack Tunisian museum 15 photos A security officer holds his position near the museum. Hide Caption Gunmen attack Tunisian museum 15 photos Security forces secure the area around museum. Hide Caption Gunmen attack Tunisian museum 15 photos Police arrest a man they believed to be suspicious. Hide Caption Gunmen attack Tunisian museum 15 photos Police in plainclothes stop a vehicle as they secure the area around the museum. Hide Caption Gunmen attack Tunisian museum 15 photos Tunisian security forces secure the area around the museum. Hide Caption Gunmen attack Tunisian museum 15 photos Security forces take up position outside the museum. Hide Caption Gunmen attack Tunisian museum 15 photos Police take up position behind a car near the museum. Hide Caption ", "external_links": [], "published": "2015-05-22T02:01:00.000+03:00", "crawled": "2015-05-22T02:01:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}