{"organizations": [], "uuid": "b1ada1db3f67d2f6805e0d1dffebc2711ebea412", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/10/03/partisan-in-chief-obama-crossing-line-with-america-federal-workforce/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422640737650.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/03/partisan-in-chief-obama-crossing-line-with-america-federal-workforce.html", "country": "", "title": "Partisan-in-chief Obama – crossing the line with America's federal workforce | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Partisan-in-chief Obama – crossing the line with America's federal workforce | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "b1ada1db3f67d2f6805e0d1dffebc2711ebea412"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/03/partisan-in-chief-obama-crossing-line-with-america-federal-workforce.html", "ord_in_thread": 0, "title": "Partisan-in-chief Obama – crossing the line with America's federal workforce | Fox News", "locations": ["America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Is Obama really the one on an 'ideological crusade'? \nWhere were they in the late 90s and early 2000s when the medical insurance industry were getting out of control? \nWhere was their backbone during the time when they had both houses of Congress and the White House where they could have fixed the health care system through enhanced regulation? \nSimply put, the Republican's failed to act when they had the chance. There is a time and place for partisan debate. \nThe president took the opportunity to address the government shutdown with members of the whole federal government – this was expressed in an internal Department of Defense official message, titled: \nMESSAGE FROM PRESIDENT OBAMA TO ALL U.S. GOVERNMENT EMPLOYEES. \nIt then begins: \nTHIS MESSAGE WAS PASSED, VIA SECDEF HAGEL ON TO THE MEN AND WOMEN OF OUR ARMED FORCES VIA OFFICIAL MESSAGE CHANNELS. \nMost of the military personnel who received this note appreciated the president’s concern and tone. It was realistic, to the point and did something that any commander in chief should do: reassure the federal employees and members of the military that their hard work is not only appreciated, it is vital to the continued success and sustainment of our republic. \nThe president does an outstanding job explaining the issues the federal workforce has faced: \n“YOU DO ALL THIS IN A POLITICAL CLIMATE THAT, TOO OFTEN IN RECENT YEARS, HAS TREATED YOU LIKE A PUNCHING BAG. YOU HAVE ENDURED THREE YEARS OF A FEDERAL PAY FREEZE, HARMFUL SEQUESTER CUTS, AND NOW, A SHUTDOWN OF OUR GOVERNMENT. AND YET, YOU PERSEVERE, CONTINUING TO SERVE THE AMERICAN PEOPLE WITH PASSION, PROFESSIONALISM, AND SKILL. \nNONE OF THIS IS FAIR TO YOU. AND SHOULD IT CONTINUE, IT WILL MAKE IT MORE DIFFICULT TO KEEP ATTRACTING THE KIND OF DRIVEN, PATRIOTIC, IDEALISTIC AMERICANS TO PUBLIC SERVICE THAT OUR CITIZENS DESERVE AND THAT OUR SYSTEM OF SELF-GOVERNMENT DEMANDS.” \nHe even goes on to quote President George W. Bush: \n“SO WHILE THE BUDGET FIGHTS IN WASHINGTON ARE TOO OFTEN PARTISAN, YOUR SERVICE TO THE COUNTRY MUST NEVER BE. AS ONE OF MY PREDECESSORS, PRESIDENT GEORGE H.W. BUSH, ONCE SAID, \"THERE IS NOTHING MORE FULFILLING THAN TO SERVE YOUR COUNTRY AND YOUR FELLOW CITIZENS AND TO DO IT WELL. AND THAT IS WHAT OUR SYSTEM OF SELF-GOVERNMENT DEPENDS ON.\" \nHowever, there is a paragraph of the president’s message that many members of the Department of Defense, and myself, find troubling. \nAs much as I am critical of the Republicans over the way the fight over ObamaCare, has been handled, many of members of congress are simply representing the views of their constituents who oppose the president’s health care law and they are doing their job. These members of Congress will be re-elected. There are, and will remain, political differences. \nIn an otherwise solid message of support, the president suddenly takes a partisan tone; one which is not appropriate for a commander in chief, someone who must stay above the fray and work to resolve issues: \n“THIS SHUTDOWN WAS COMPLETELY PREVENTABLE. IT SHOULD NOT HAVE HAPPENED. AND THE HOUSE OF REPRESENTATIVES CAN END IT AS SOON AS IT FOLLOWS THE SENATE'S LEAD, AND FUNDS YOUR WORK IN THE UNITED STATES GOVERNMENT WITHOUT TRYING TO ATTACH HIGHLY CONTROVERSIAL AND PARTISAN MEASURES IN THE PROCESS.” \nIt is an outrage – beyond inappropriate -- for the president to “editorialize” in this official statement to the members of the military on a partisan issue. \nThe men and women who serve this country do so to protect the American people and do not wish to become pawns in the political games of Washington. \nI received feedback from multiple members of the armed forces who felt that this was “awkward” and “inappropriate” for President Obama to make such a statement in an official government communication. \nThe members of the military, and the larger federal government, must serve presidents of both political parties with equal enthusiasm and professionalism. \nThey cannot and should not take sides, in their official duties, when it comes to partisan politics. They must remain outside of the political fray, and it is simply wrong for the president to try and pull them into it. \nWe all hope for a rapid resolution of the government slimdown. We have wonderful, intelligent, able and well equipped men and women serving in our armed forces. \nThey must be protected and defended from the political drama in Washington. \nThey had no hand in creating it, and they must be allowed to carry on, doing their duty, outside of the political extravaganza that plays out on a daily basis in Washington. \nLt. Col. Tony Shaffer (ret.) is a CIA trained former senior intelligence officer and the New York Times bestselling author of Operation \" Dark Heart: Spycraft an Special Operations on the Frontlines of Afghanistan - And The Path to Victory. \" His latest book is The Last Line . He is a senior fellow with both the London Center for Policy Research and the Center for Advanced Defense Studies. The opinions reflected here are those solely of Lt. Col. Shaffer -- and are not the opinion of the London Center for Policy Research (LCPR), the Center for Advanced Defense Studies (CADS) or of any other group or organization with which Lt. Col. Shaffer is affiliated. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:10:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}