{"organizations": ["Alcoa", "United Steelworks", "Green Jobs National Conference", "Sierra Club"], "uuid": "8bb1773527fa9dc7d7263212116cc143a4fefe29", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3006468/images/o-ELIZABETH-WARREN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/28/elizabeth-warren-trade-slavery_n_7463252.html", "country": "", "title": "Warren Pushes Obama To Keep Slavery Ban In Trade Deal", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Warren Pushes Obama To Keep Slavery Ban In Trade Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-05-29T00:27:00.000+03:00", "replies_count": 0, "uuid": "8bb1773527fa9dc7d7263212116cc143a4fefe29"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/28/elizabeth-warren-trade-slavery_n_7463252.html", "ord_in_thread": 0, "title": "Warren Pushes Obama To Keep Slavery Ban In Trade Deal", "locations": ["Washington", "WASHINGTON", "D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Elizabeth Warren"], "text": "Warren Pushes Obama To Keep Slavery Ban In Trade Deal Posted: Updated: 22 minutes ago WASHINGTON, D.C. - Sen. Elizabeth Warren (D-Mass.) delivers remarks during the Good Jobs Green Jobs National Conference at the Washington Hilton April 13, 2015 in Washington, D.C. Sponsored by a varied coalition including lightweight metals producer Alcoa, the United Steelworks union, the Sierra Club and various other labor, industry and telecommunications leaders, the conference promotes the use of efficient and renewable energy and cooperation in updating the country's energy infrastructure. | Chip Somodevilla via Getty Images reddit \nBOSTON -- Sen. Elizabeth Warren (D-Mass.) on Thursday decried efforts by the Obama administration to undermine an anti-slavery measure that the Senate approved last week as part of a major trade bill. \nThe provision, authored by Sen. Robert Menendez (D-N.J.), would bar the U.S. from expediting trade deals with governments that the State Department deems to be among the very worst offenders on human trafficking. The Senate passed the Menendez language late Friday night, despite strident objections from President Barack Obama's administration. Both Obama officials and House Ways and Means Committee Chairman Paul Ryan (R-Wis.) are now working to defang the anti-slavery effort. \nThe problem for Obama is Malaysia, one of 11 other nations included in the controversial trade talks for the Trans-Pacific Partnership. Malaysia occupies a strategically important position in global shipping routes, but its government has a long history of supporting some of the most abusive forms of human trafficking, earning it a spot on the State Department's official list of the worst abettors of modern slavery . \nWhen asked by The Huffington Post Thursday whether the U.S. should ink trade deals with such countries, Warren responded emphatically in the negative. \n\"I'll give you a really short answer on that,\" Warren said. \"No.\" \n\"This is an opportunity for the United States to use our leverage to get countries like Malaysia to clean up their acts,\" she added. \"We're talking about really horrible violations of human rights. And Malaysia needs to make significant changes if it wants to be part of a trade agreement with other countries.\" \nEarning a State Department designation as a Tier 3 human trafficking violator is no easy task. Malaysia's companions on the list include Iran and North Korea. Other notorious offenders, like Qatar , where hundreds of migrant workers have been killed in recent years, are considered better at fighting human trafficking than Malaysia. \nThe Guardian reported this week on the discovery of mass graves for trafficking victims in Malaysia. One-third of workers in the nation's burgeoning electronics industry are victims of forced labor, according to the nonprofit group Verite , which works with the State Department on human rights issues. The government is not merely looking the other way -- the State Department has said Malaysia needs to beef up efforts to investigate and prosecute government officials who profit from such exploitation. \nAlthough Warren has long opposed Obama's trade agenda, tensions between the two Democratic leaders erupted into a public feud last month, when Obama attacked Warren's arguments as \"dishonest,\" \"bunk\" and an effort to spread \"misinformation.\" \nWarren responded by calling on Obama to release a draft of the TPP legislation, so that the public could make up its own mind about the trade pact. When Obama opted to keep the deal classified, Warren's office issued a report detailing lax enforcement of labor and human rights standards in trade deals on Obama's watch. \nMost of Warren's critique has focused on regulatory issues and a host of academic experts have supported her arguments. Leaked TPP documents have revealed that the pact will include an enforcement mechanism known as Investor State Dispute Settlement, which allows corporations to challenge a country's domestic laws and regulations before an international tribunal. Adverse rulings could require governments to change their laws or pay financial penalties. \nBut much of the debate over TPP has shifted to human rights issues, due to the unexpected Senate survival of the Menendez ban on slavery. Warren's comments Thursday marked the first time she publicly spoke out on the Malaysian human trafficking issue. Although Obama has touted the TPP as \"the most progressive trade bill in history,\" complete with robust labor and environmental standards, the administration now finds itself seeking to neutralize a human trafficking crackdown to maintain its trade coalition. \nThe Office of the U.S. Trade Representative has said that excluding Malaysia from the TPP would take away diplomacy tools that could help fight slavery in the South Pacific nation. But substitute legislation sought by the Obama administration would not actually require the Malaysian government to improve its human trafficking record in order to enjoy trade benefits from the TPP. \nMalaysia occupies a strategically important position in the Strait of Malacca, through which a tremendous amount of global commerce currently passes. China, in particular, relies heavily on the oil shipments that pass through the strait. Malaysia has been eager in recent years to contain China's influence in the strait and the neighboring South China Sea. \nZach Carter reported from Washington and Shahien Nasiripour reported from Boston. Also on HuffPost:   Elizabeth Warren announced a bill creating a Financial Product Safety Commission with House and Senate Democrats in March 2009. The body was designed to have oversight over mortgages and other financial instruments to protect consumers against predatory practices. She said if the agency had existed before the subprime collapse then \"there would have been millions of families who got tangled in predatory mortgages who never would have gotten them.\" HuffPost's Ryan Grim reported: Without all these toxic assets on banks' balance sheets, the institutions wouldn't be on the brink of collapse and the recession would be more manageable. \"Consumer financial products were the front end of the destabilization of the American economic system.\" Sen. Charles Schumer's cosponsorship of the bill is notable because of his proximity to Wall Street. The bill's merit, the New York Democrat said, is that it regulates the actual financial product rather than the company producing it. Tim Geithner expressed opposition to her nomination for the Consumer Financial Protection Bureau, reported HuffPost's Shahien Nasiripour. Geithner thought Warren's views on the big banks and Wall St. were too tough. Warren's oversight of the Treasury department as a watchdog for TARP apparently irked Geithner, agressively questioning him during Congressional hearings: While her grilling of Geithner in September, over what members of Congress have called the \"backdoor bailout\" of Wall Street through AIG, inspired the \"squirm\" video, just last month Warren pressed Geithner on the administration's lackluster foreclosure-prevention plan, Making Home Affordable. Criticizing him for Treasury's failure to keep families in their homes, she questioned Treasury's commitment to homeowners. Elizabeth Warren reiterated her desire for a strong Consumer Financial Protection Agency to HuffPost's Shahien Nasiripour: \"My first choice is a strong consumer agency,\" the Harvard Law professor and federal bailout watchdog said in an interview with the Huffington Post. \"My second choice is no agency at all and plenty of blood and teeth left on the floor.\" In September of 2010, HuffPost's Ryan Grim reported that Elizabeth Warren was being considered as a candidate for interim director of the Consumer Financial Protection Bureau. Days later the announcement was official. The move allowed Warren to set up the groundwork for the agency immediately without risking a GOP filibuster of her nomination, a response that seemed certain giving the public opposition expressed by some Republican senators. When it came time to put forth an appointment for a longterm CFPB chief, Warren was overlooked, partially because she was seen as unfeasible, but also, HuffPost's Shahien Nasiripour reported, because she was a divisive figure within the Obama administration: Ultimately, Warren wanted the job, allies said. And near-united opposition from Senate Republicans -- 44 of them signed a letter saying they'd oppose any nominee -- should have made it easier for Obama to nominate her, since the Republicans publicly said they wouldn't support anyone for the role. Instead, the Republicans made it easy for the White House to deflect questions about the administration's lack of support for Warren. Asked how she squared the administration's public statements with its private ones, Warren declined. \"I really have to say, I'm just not there. I'm not in the intricacies of the political part of this, and I can't comment,\" Warren said Monday. \"The truth is I don't know anything about it.\" In October 2010, shortly after being tasked with building the groundwork for the CFPB, Warren stopped by HuffPost to chat with Ryan Grim and Shahien Nasiripour \"This is the first real agency we've built in the 21st century -- well, there's Homeland Security, but one for the people. And it means we ought to think differently,\" said Warren. \"The government can talk to people and people can talk to the government differently than when the Consumer Product Safety Commission was built, or when the FDA was built. And if we do this right, that should change the whole dynamic of who this agency really is.\" HuffPost's Ryan Grim reported: By gathering information, contracts and documents from homeowners and consumers, and allowing watchdog groups and individual concerned citizens access to those documents, the agency can exponentially expand the manpower it has to review the operations of banks and lenders. The goal would be to become aware of a particularly fraudulent practice before it is rampant and insulates itself in the financial services industry. For full video of the interview, click here. In May, Warren was called to testify before a House subcommittee and defend the merits of the CFPB. Some of the questions submitted by Republican representatives appeared confused and at times aggressive, leaving Warren to correct them on some basic facts about the actual purpose of the bureau. HuffPost's Mike McCauliff relays one particularly contentious moment: The subcommittee chairman, Rep. Patrick McHenry (R-N.C.), began the proceedings by suggesting Warren had lied to the committee in a previous hearing that had questioned the CFPB's role in offering advice to state attorneys general negotiating a settlement with abusive mortgage servicers. At the time, Warren said she was proud her agency had been able to help, at the request of the treasury secretary. But McHenry brought up the memo again, suggesting it showed that she hid a larger role in the negotiations from Congress. \"This is our job, and we're trying to do our job, to be helpful to other agencies, and to help those agencies to hold those who break the law accountable,\" Warren said, repeating that she was proud of the work. Elizabeth Warren announced on September 14, 2011 that she was running for the United States Senate seat currently held by Scott Brown (R-Mass.) \"After listening to people all across our state who know that we can do better, folks who are frustrated like I am that Washington just doesn't get it, I'm running for the Senate so I can fight every day for Massachusetts families,\" Warren wrote on The Huffington Post. One month into her campaign to secure the U.S. Senate seat currently held by Scott Brown in Massachusetts, Elizabeth Warren raised $3.15 million, largely from small donations. According to a campaign email, 96 percent of donations were under $100. \"These are pretty amazing numbers for our first official finance report, raised in a very short period of time,\" she said in an email to supporters. Warren's campaign has also attracted large liberal donors, including colleagues from Harvard and well-known liberal donors like George Soros, Barbra Streisand, and DreamWorks CEO Jeffrey Katzenberg. Warren raised an impressive $5.7 million in the fourth quarter of 2011. In early January, the candidate's money bomb pulled in more than $100,000 in just one weekend. Elizabeth Warren and Sen. Scott Brown (R-Mass.) signed a pledge to curb third-party attack ads. If either campaign breaks the agreement, they would donate half the cost of the outside ad to a charity of their opponent's choice. \"This may not work,\" Warren said in an email to supporters. \"But there's enough at stake to make it worthwhile to try to take back this election.\"  Share ", "external_links": [], "published": "2015-05-29T00:27:00.000+03:00", "crawled": "2015-05-29T00:27:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}