{"organizations": [], "uuid": "b3fb1b91dfc875e5967f206f2fdabc1e76affa1b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2898864/images/o-JOHN-BOEHNER-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/04/30/john-boehner-trade-bill_n_7181926.html", "country": "", "title": "John Boehner: Obama 'Needs To Step Up His Game' On Garnering Support For Trade Bill", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "John Boehner: Obama 'Needs To Step Up His Game' On Garnering Support For Trade Bill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T06:11:00.000+03:00", "replies_count": 0, "uuid": "b3fb1b91dfc875e5967f206f2fdabc1e76affa1b"}, "author": "", "url": "http://www.huffingtonpost.com/2015/04/30/john-boehner-trade-bill_n_7181926.html", "ord_in_thread": 0, "title": "John Boehner: Obama 'Needs To Step Up His Game' On Garnering Support For Trade Bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bill John Boehner", "Obama", "John Boehner"], "text": "John Boehner: Obama 'Needs To Step Up His Game' On Garnering Support For Trade Bill Posted: \nHouse Speaker John Boehner (R-Ohio) said Thursday that President Barack Obama “needs to step up his game” to rally more Democrats behind legislation that would give him fast-track authority on trade deals. \nBoehner told reporters that “there will be strong Republican support for trade promotion authority.” \nThe bill, which would allow Obama to use expedited procedures to push the Trans-Pacific Partnership through Congress, has a majority of Republicans backing it in the House , but lacks the votes needed for passage. \n“Another point you should keep in mind is that every Democrat leader in the House and Senate are opposed to giving the president what he’s asking them,” Boehner said. “The president needs to step up his game in terms of garnering more support amongst Democrats, especially here in the House.” \nAccording to Democrats, however, Obama has lobbied Congress on trade more than any other issue during his presidency. The issue has pitted a significant number of Democrats against Obama. \nHouse Minority Leader Nancy Pelosi (D-Calif.) said Thursday that she still hopes the House “can find a path to yes.” She admitted the deal Obama has worked out with 12 Pacific Rim countries and Europe puts the U.S. in a “better place” than under the North American Free Trade Agreement. However, she said, Democrats still have concerns, specifically on currency manipulation measures and making sure the trade deals do not hurt American workers. \n“I don’t think enough of our issues have been resolved for us to be having a big movement of votes,” Pelosi said. \nShe wouldn’t talk about the details of her Wednesday meeting with Obama, which appeared to be about the ongoing trade discussions. Also on HuffPost: Pelosi's Greatest 'What Is Going On Here?' Faces of   U.S. House Minority Leader Rep. Nancy Pelosi (D-CA) speaks during her weekly news conference January 29, 2014 on Capitol Hill in Washington, D.C. (Photo by Alex Wong/Getty Images) Democratic Leader Nancy Pelosi answers questions during the 'SiriusXM Leading Ladies' series hosted by SiriusXM host/veteran White House correspondent Julie Mason at The Newseum on March 4, 2014 in Washington, D.C. (Photo by Paul Morigi/Getty Images for SiriusXM) Democratic Leader Nancy Pelosi answers questions during the 'SiriusXM Leading Ladies' series hosted by SiriusXM host/veteran White House correspondent Julie Mason at The Newseum on March 4, 2014 in Washington, D.C. (Photo by Paul Morigi/Getty Images for SiriusXM) House Minority Leader Nancy Pelosi (D-CA) answers questions during her weekly press conference January 9, 2014 in Washington, D.C. (Photo by Win McNamee/Getty Images) House Democratic leaders (L-R) House Budget Committee ranking member Rep. Chris Van Hollen (D-MD), Minority Whip Steny Hoyer, Rep. Steve Israel (D-NY), Minority Leader Nancy Pelosi (D-CA), Rep. James Clyburn (D-SC) and Rep. Xavier Becerra (D-CA) talk to reporters after meeting with U.S. President Barack Obama and Vice President Joe Biden in the Oval Office at the White House October 15, 2013 in Washington, D.C. (Photo by Chip Somodevilla/Getty Images) House Minority Leader Nancy Pelosi (D-CA) speaks during a press conference October 3, 2013 in Washington, D.C. Congressional Democrats and Republicans remain gridlocked on funding appropriations for the federal government as the shutdown enters its third day. (Photo by Win McNamee/Getty Images) U.S. House Minority Leader Rep. Nancy Pelosi (D-CA) (L) and U.S. Senate Majority Leader Sen. Harry Reid (D-NV) (R) speak to the media with after a meeting at the White House with U.S. President Barack Obama, Speaker of the House John Boehner and Senate Minority Leader Mitch McConnell about the government shutdown on October 2, 2013 in Washington, D.C. (Photo by Win McNamee/Getty Images) U.S. House Minority Leader Rep. Nancy Pelosi (D-CA) speaks to members of the press during a news conference September 12, 2013 on Capitol Hill in Washington, D.C. (Photo by Alex Wong/Getty Images) U.S. House Minority Leader Rep. Nancy Pelosi (D-CA) speaks during her weekly news conference September 27, 2013 on Capitol Hill in Washington, D.C. (Photo by Alex Wong/Getty Images) House Minority Leader Nancy Pelosi (D-CA) (R) speaks to the media with Rep. Xavier Becerra (D-CA) after a meeting with President Barack Obama on Capitol Hill, July 31, 2013 in Washington, D.C. (Photo by Mark Wilson/Getty Images) House Minority Leader Nancy Pelosi (D-CA) speaks to the media at her weekly news conference on Capitol Hill, July 11, 2013 in Washington, D.C. (Photo by Mark Wilson/Getty Images) House Minority Leader Nancy Pelosi (D-CA) speaks to the media during her weekly news conference, on January 4, 2013 in Washington, D.C. (Photo by Mark Wilson/Getty Images) Congresswoman Nancy Pelosi visits 'Late Night With Jimmy Fallon' at Rockefeller Center on August 17, 2012 in New York City. (Photo by Jason Kempin/Getty Images) House Minority Leader Nancy Pelosi (D-CA) holds her weekly news conference in the Visitors Center at the U.S. Capitol July 26, 2012 in Washington, D.C. (Photo by Chip Somodevilla/Getty Images) House Minority Leader Rep. Nancy Pelosi (D-CA) answers questions during her weekly news conference July 19, 2012 in Washington, D.C. (Photo by Win McNamee/Getty Images)  Share ", "external_links": [], "published": "2015-05-01T06:11:00.000+03:00", "crawled": "2015-05-01T06:11:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}