{"organizations": [], "uuid": "99086f6d69e0b0f8dc194c02e9f34b5cb8952d4c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/090913/0/0/090913_dotcom_failedsyria_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/05/mr-obama-youve-already-lost-syrian-war-here-how-to-win-big-one.html", "country": "", "title": "Mr. Obama, you've already lost the Syrian War -- here's how to win the big one | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mr. Obama, you've already lost the Syrian War -- here's how to win the big one | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "99086f6d69e0b0f8dc194c02e9f34b5cb8952d4c"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/05/mr-obama-youve-already-lost-syrian-war-here-how-to-win-big-one.html", "ord_in_thread": 0, "title": "Mr. Obama, you've already lost the Syrian War -- here's how to win the big one | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama – face it, you’ve already lost the Syrian war. You probably lost it a year ago when you laid down that \"red line\" threat without any idea how you respond if Assad called your bluff. \nAs any parent knows, if you make a threat, you better be ready to carry it out. If you tell your teenager, “Be home before dark or I’ll ground you,” and then if he isn’t and you don’t, you can bet he will stay out ‘til midnight next time, and before long he’ll be sneaking out in the middle of the night. \nNo matter how you try to wiggle out of it, you're the one who set the \"red line\" -- not the world, not Congress, not the American people. By tossing the Syrian decision to Congress, you guaranteed that you’ve lost the Syrian war. The American people are overwhelming against another Middle East war, and the more your administration tries to sell it, the more public support falls off. \n[pullquote] \nSecretaries Kerry and Hagel team did lay out why it’s important to attack Syria -- because Assad used chemical weapons to slaughter innocent civilians, women and children. \nThey also laid out what you want to accomplish by attacking Syria – punishing Assad, deterring his further use of chemical weapons and reinforcing American’s credibility. \nBut what Kerry & Co. failed to explain is how a limited attack against Syria will accomplish those goals. And they certainly failed to say what funds are available to pay for it in light of your reduced defense budgets. By taking the fight to Congress instead of to Syria, you’ve left legislators to fight amongst themselves over the details of an American response. Even if they reach agreement and vote in favor of an attack, it’s likely to be too little and too late to make a difference. \nAssad will have had plenty of time to move mobile military assets to hospital parking lots and school playgrounds, so the only choice you’ll have is between lobbing a few missiles into the Syrian desert, or killing innocent civilians in population centers. \nIf Assad calls your bluff and launches another chemical attack in response or widens the war, you’ll be faced with either backing off or escalating the Syrian war, just like LBJ did with Vietnam. \nIf you do escalate, and topple Assad, you’ll pave the way for Al Qaeda-affiliated rebels to take his place. If Congress does not approve your attack plan, you will look even more ineffective. \nEither way, those chemical weapons will remain -- for Assad or the Al Qaeda rebels to use --- since no one thinks they can be sabotaged, destroyed, or captured without boots on the ground. And no one is voting for boots on the ground. Face it, President Obama. You’ve been outmaneuvered on Syria, and have no good options left. As bad as it would be to do nothing, doing something that fails would be even worse. \nBetter to focus on winning the bigger war. Stop thinking tactically, and start thinking strategically. \nSyria may loom large today, just like Iraq, Libya and Egypt have before. But the Middle East wars will not stop with Syria, they are likely to spread throughout the region as oil-fueled Sunnis battle oil-fueled Shiites in country after country for years to come. The single best thing you could do to improve America’s position in the Middle East is what President Kennedy did when the Russians shocked the world by being the first country to send a man into space. In response, Kennedy pledged to land a man on the moon within a decade. \nYou should pledge America to becoming energy independent by the end of your presidency, and a major oil and natural gas exporter by the end of the decade. Approve the Keystone Pipeline. Unshackle American energy companies and allow them to develop U.S. resources. American energy independence would mean we no longer need to curry favor with one side or another in the perennial Middle East conflicts. \nBecoming the Arab oil countries’ biggest competitor means they will be forced to worry about how they are going to meet their own domestic payrolls. They will have neither time nor money left over to pay for terrorists or proxy wars. \nOne of the Middle East’s savviest investors, Prince Alwaleed bin Talal, warned his Saudi brethren their revenues will plummet if the U.S. develops shale oil and gas. \nIran’s oil revenues have fallen significantly and their financial support for terrorist Hamas has dwindled as a result. Let that be the new normal in the Middle East. That’s how, Mr. President, you can win the war. Develop America’s energy resources. It will send shivers up the spines of the Arab oil states who are paying for both sides of the Syrian war, and bankrolling Hezbollah and Al Qaeda and other like-minded groups. \nAnd while you're in Russia for the G20 meeting, have a little heart-to-heart with President Putin. Explain to him that the Russian economy may be riding high now, but it will collapse in a few short years without foreign investment and American technology to develop new oil and natural gas fields and infrastructure projects. \nGive Putin the choice -- the US and Russia can either bury the hatchet and work together to solve Iran, Syria, Islamic jihad, and the other international issues on which we disagree, or we can continue to spar over those issues. \nIf Russia wants to work with us, we'll work with them on energy projects. If not, they might continue to humiliate us, but we'll help bankrupt them. \nThen remind Putin that the reason the Soviet Union collapsed and Reagan won the Cold War was because he maneuvered events so the price of oil fell from $40 to $18 dollars a barrel in nine months, thus causing Russian economy to collapse. \nWe are happy to do it again. \nDespite Putin's efforts in recent years to diversify their economy, the world still doesn't want Russian cars or computers. Russia remains a petro-state: one third of the country's GNP and half their budget comes from energy exports. \nIf you do this, President Obama, you will send a clear message to President Putin: Stop trying to wrestle bears and ride shirtless in the Siberian wilderness, and start worrying about how you are going to pay Russia’s bills when your oil and gas reserves run out in a few years time. \nAnd then invite him to get in touch -- sooner rather than later. \nKathleen Troia \"K.T.\" McFarland is a Fox News National Security Analyst and host of FoxNews.com's \"DefCon 3.\" She served in national security posts in the Nixon, Ford and Reagan administrations. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:36.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}