{"organizations": [], "uuid": "a6966e8b325a74051922fe3ce0e26253e3b309f3", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/0509%20obama.jpg", "site_section": "http://www.foxnews.com/politics/index.html", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/05/09/obama-administration-willing-to-re-engage-with-north-korea-on-nuclear-talks/", "country": "US", "title": "Obama administration willing to re-engage with North Korea on nuclear talks", "performance_score": 10, "site": "foxnews.com", "participants_count": 9, "title_full": "Obama administration willing to re-engage with North Korea on nuclear talks | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-09T03:00:00.000+03:00", "replies_count": 10, "uuid": "1efcfb6265a8e37136c72de7dea3f769cb043a43"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/09/obama-administration-willing-to-re-engage-with-north-korea-on-nuclear-talks/#post-0", "ord_in_thread": 0, "title": "Obama administration willing to re-engage with North Korea on nuclear talks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 09, 2015 FoxNews.com livefyre Email Print April 2, 2015: President Barack Obama speaks in the Rose Garden of the White House in Washington about the breakthrough in the Iranian nuclear talks. (AP)\nAfter three years of diplomatic deadlock, the Obama administration says it is willing to hold preliminary talks with North Korea to probe its intentions and assess the prospects of ridding the country of nuclear weapons.\nA senior South Korean envoy traveled to Washington and Beijing in the past week as nations involved in long-stalled aid-for-disarmament negotiations consider their diplomatic options. Tensions have eased a little on the Korean Peninsula following the completion of annual U.S.-South Korean military drills.\nHowever, it still remains unclear if a diplomatic overture to North Korea will even get to first base as the Asian nation appears on retaining its nuclear weapons. U.S. officials do not believe the North has demonstrated a serious interest in re-engaging with the countries on the issue. A spokesman at the North Korean diplomatic mission at the United Nations declined to comment on the question of re-engagement.\nIn the last few months, President Obama has broken the ice with several storied adversaries in Iran, Cuba and Myanmar. In the case of Iran, the U.S. has joined with several world powers in negotiating the framework agreement to prevent Teheran from obtaining a nuclear weapon.\nNorth Korea, though, does not seem to be looking to disarm anytime soon. The North conducted its first nuclear test in 2006, and despite overwhelming sanctions intended for Pyongyang from obtaining sensitive technology, and starve it of its funds, U.S.-based experts are forecasting that it could increase its nuclear weaponry from at least 10 to between 20 and 100 in the next five years.\nThat's a powerful incentive to give diplomacy another shot, but there's a gulf between North Korea's desire to be recognized as a nuclear power, and the sworn aim of the negotiating process that China, Japan, Russia, South Korea and the U.S. say they want to revive: denuclearization of the Korean Peninsula.\nThe last public attempt made by the U.S. to negotiate a nuclear freeze and get the six-party process restarted collapsed in 2012 after North Korea launched a long-range rocket. The North conducted its third nuclear test in February 2013, and has test-fired shorter-range missiles since then.\nThe U.S. quietly proposed a meeting with North Korea this January, before the recent U.S.-South Korea military exercises. The two sides, however, failed to agree on who could meet and where.\nChina, North Korea's traditional benefactor, has constantly pushed for resumption of dialogue, and South Korean envoy Hwang Joon-kook, who met separately with his U.S. and Chinese counterparts this week, made a very public overture, saying all five parties were ready to have talks to probe North Korea's intentions.\n\"We want to meet with the North first without any conditions to determine whether it has real commitment (toward denuclearization),\" he said in Beijing on Thursday.\nA senior U.S. official told The Associated Press it is willing to be flexible about a format for “serious dialogue” with the North on denuclearization.\nOne possible venue could be the North East Asia Cooperation Dialogue, an annual conference of officials and experts organized by the University of California. It is being co-hosted this year by the Japanese government, and is due to be held in Tokyo toward the end of May. Japan has invited North Korea.\nAny talks would need to address thorny issues, including conditions under which the six-party negotiations could resume after a gap of seven years. But the atmospherics remain poor, and U.S.-South Korean military drills will restart in August, which could stoke up tensions again.\nIn January, the U.S. imposed new sanctions after an alleged North Korean hacking attack on Sony Pictures, and Obama angered Pyongyang soon after when he said in an interview that an isolated, authoritarian regime like North Korea's will ultimately collapse.\nU.S. support for a U.N. commission of inquiry that found North Korea had committed crimes against humanity has also strained relations. At the United Nations last week, an event chaired by U.S. Ambassador Samantha Power on North Korea's human rights record turned into chaos, as North Korean diplomats insisted on reading a statement of protest, and then stormed out amid shouts from North Korean defectors.\nThe Associated Press contributed this report\n 3 Illinois 5 Vermont state senator pleads not guilty to sex charges ", "external_links": [], "published": "2015-05-09T03:00:00.000+03:00", "crawled": "2015-05-09T13:16:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}