{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "04364dcecc643ce03800bf8ffc1695b882974f43", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/092013/0/0/092013_ANR_Iran_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/23/obama-living-in-la-la-land-when-dealing-with-iran-syria.html", "country": "", "title": "Obama living in La La Land when dealing with Iran, Syria | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama living in La La Land when dealing with Iran, Syria | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "04364dcecc643ce03800bf8ffc1695b882974f43"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/23/obama-living-in-la-la-land-when-dealing-with-iran-syria.html", "ord_in_thread": 0, "title": "Obama living in La La Land when dealing with Iran, Syria | Fox News", "locations": ["Iran", "Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 Email Print \nHere’s a happy thought — the deal on Syrian chemical weapons is a “dry run” for a deal on Iranian nukes. \nHappy, that is, for Iran’s thugocracy. For the rest of the world, it is shaping up as a disaster. \nThe idea that the hollow “solution” to the Syrian problem is a template for White House goals with Iran rings frighteningly true, given how quickly President Obama dropped his red-line threats. There is not a snowball’s chance in hell that Bashar al-Assad will keep his promises to turn over his sarin stockpiles, nor is there any hope Russia will force him to. He is already getting wishy-washy about the terms and holding out his hand for American cash. \nEven with that ominous start, the talk is growing that Obama quickly pivoted to Iran in hopes that Russia would help him pull off another Houdini escape from responsibility. The president is corresponding with Iran’s new president and is almost certain to meet him when both are at the United Nations this week. \nThe problem is that the “peace at any price” approach always raises the price later. Syria and Iran are not likely to give up their weapons of mass destruction, especially with Vladimir Putin protecting them. More On This... Iran: Can it be trusted? \nHis embrace shields both from the Security Council and American military action. Even Israel will find it impossible to use force against Iran’s nukes while Putin has lured a desperate Obama into endless negotiations. \nOh, for the good old days. That would be three weeks ago, when the White House was calling Assad “Hitler” and vowing to punish him for war crimes. Now we are his partner and eager to make the same deal with Iran. \nOnly in America, only under Obama. \nTo continue reading Michael Goodwin's column in the New York Post, click here . \nMichael Goodwin is a Fox News contributor and New York Post columnist. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}