{"organizations": [], "uuid": "3ca36a3cda2ace1cc8e29b38e0a3859c82e12f3a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2916088/images/o-DARE-SCREENSHOT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/amanda-reiman/dare-program-marijuana_b_7215854.html", "country": "US", "title": "Amanda Reiman: The Difference Between Real and Fake News About Marijuana", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Amanda Reiman: The Difference Between Real and Fake News About Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T18:21:00.000+03:00", "replies_count": 0, "uuid": "3ca36a3cda2ace1cc8e29b38e0a3859c82e12f3a"}, "author": "Amanda Reiman", "url": "http://www.huffingtonpost.com/amanda-reiman/dare-program-marijuana_b_7215854.html", "ord_in_thread": 0, "title": "Amanda Reiman: The Difference Between Real and Fake News About Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nHonest, science-based drug education has been acknowledged as a cornerstone of the prevention of drug abuse among teenagers. Yet for decades, young people have been exposed, indeed bombarded, with messages, particularly about marijuana, that are exaggerated. Many are just plain false. \nThe latest \"installment\" of such scare tactics comes from an old source, Drug Abuse Resistance Education. \nFor many years, D.A.R.E. was the most widely-implemented youth drug education program in the United States. While a lack of proven effectiveness drained it of federal funds in 1998, D.A.R.E. received a $13.6 million grant from the Robert Wood Johnson Foundation in 2001 to re-vamp the program to create \"the new D.A.R.E.\" \nToday, new D.A.R.E. programs are used in almost 30 percent of elementary schools around the country, with 55 percent of all students reported to have been through the program, despite the commercial availability of at least 200 other drug and alcohol prevention programs and curricula. Young folks are taught to rely on D.A.R.E. as a source of evidence informed information about drugs and how to make good decisions about them. Young people are also dissuaded from obtaining information about drugs from other sources. \nWith D.A.R.E. being held up by our government as the most reliable source of information about drugs for young people, a recent posting on the D.A.R.E. website is cause for alarm. The headline screamed \"Edible Marijuana Candies Kill 9 in Colorado, 12 at Coachella.\" The piece was taken down after reporters started reaching out to them about the article. \nThe post was taken from a website called TopekasNews , and a 30-second scan of the site raises red flags about its legitimacy. Take for instance a companion piece called, \" Obama's Plan To Start the Ebola Zombie Apocalypse in America Revealed .\" Or this gem . \nEven if the folks at D.A.R.E. somehow did not realize that this was likely, at best, a satire site, any qualified drug educator should know that the information about marijuana contained in the article is not even close to accurate. \nThe article claims that, \"For every one joint of marijuana, four teenagers become burdened with pregnancy. And for every bag of marijuana candy sold, it seems 16 violent crimes in the 16 to 45-year-old cohort break down.\" \nIt would be funny, if it were not being perpetuated by one of the government's go-to drug education service for our children. \nBut it's not funny. \nMarijuana prohibition is causing real harm to the lives of thousands of American families. It's not funny because we need real, honest drug education that provides scientific information and proven methods for teaching good decision making. \nIt's not funny when we lie to youth and insult their intelligence under the guise of protecting them. Once they figure it out, they lose trust in everything. \nIt's not funny because we owe our youth more than misinformation and outright nonsense posted by D.A.R.E. \nHere is a screenshot of how the piece appeared on the D.A.R.E. website: \nAmanda Reiman is the manager for marijuana law and policy for the Drug Policy Alliance . \nThis post originally appeared on the DPA blog . \nFollow Amanda Reiman on Twitter: www.twitter.com/AmandaReiman More:", "external_links": [], "published": "2015-05-05T18:21:00.000+03:00", "crawled": "2015-05-05T22:38:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}