{"organizations": [], "uuid": "5c00411f61bf400a628737f6c20331e99c747bde", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/judgegave1131.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/26/federal-court-delivers-blow-to-president-obama-immigration-executive-action/", "country": "", "title": "Federal appeals court delivers blow to Obama's immigration executive action | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Federal appeals court delivers blow to Obama's immigration executive action | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T22:40:00.000+03:00", "replies_count": 0, "uuid": "5c00411f61bf400a628737f6c20331e99c747bde"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/26/federal-court-delivers-blow-to-president-obama-immigration-executive-action/", "ord_in_thread": 0, "title": "Federal appeals court delivers blow to Obama's immigration executive action | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Federal appeals court delivers blow to Obama's immigration executive action Published May 26, 2015 AP \nIt is another blow to the Obama administration’s fight to implement its executive action on immigration. \nThis time the knock-out punch occurred in the 5th U.S. Circuit Court of Appeals in New Orleans, which refused to lift a temporary hold on President Barack Obama's executive action that could shield as many as 5 million immigrants illegally living in the U.S. from deportation. \nThe U.S. Justice Department had asked the court to reverse a Texas judge who agreed to temporarily block the president's plan in February, after 26 states filed a lawsuit alleging Obama's action was unconstitutional. But two out of three judges on a court panel voted to deny the government's request. \nIt wasn't immediately clear if the government would appeal, either to the full appeals court in New Orleans or to the U.S. Supreme Court. \nThe states suing to block the plan, led by Texas, argue that Obama acted outside his authority and that the changes would force them to invest more in law enforcement, health care and education. But the White House has said the president acted within his powers to fix a \"broken immigration system.\" \nU.S. District Judge Andrew Hanen sided with the states and, from his court in Brownsville, Texas, issued a temporary injunction on Feb. 16 to block the plan from taking effect while the lawsuit works its way through the courts. \nJustice Department lawyers sought a stay while they appealed the injunction. They argued that keeping the temporary hold interfered with the Homeland Security Department's ability to protect the U.S. and secure the nation's borders. They also said immigration policy is a domain of the federal government, not the states. \nBut, in Tuesday's ruling, 5th Circuit judges Jerry Smith and Jennifer Walker Elrod denied the stay, saying in an opinion written by Smith, that the federal government lawyers are unlikely to succeed on the merits of that appeal. Judge Stephen Higginson dissented. \nObama announced the executive action in November, saying lack of action by Congress forced him to make sweeping changes to immigration rules on his own. Republicans said Obama overstepped his presidential authority. \nSupporters of the executive action denounced the court’s decision. \n“Once again, we find ourselves in a battle to preserve the hope of millions of families who have long made America their home,” said Rocio Saenz, executive vice president of the Service Employees International Union (SEIU) International Executive Vice President. “We have no doubt that the deferred action initiatives will prevail. We always knew that the fight for immigration reform was not going to be easy and that there would be bumps along the way.” \n“The same cannot be said of the Republican leaders and the 26 plaintiff states who have unapologetically stood in the way of real immigration solutions,\" Saenz said. \"They have failed to live up to our American values and, by their actions, place families at risk.” \nThe first of Obama's orders -- to expand a program that protects young immigrants from deportation if they were brought to the U.S. illegally as children -- was set to take effect Feb. 18. The other major part, extending deportation protections to parents of U.S. citizens and permanent residents who have been in the country for some years, had been scheduled to begin May 19. \nHanen issued his injunction believing that neither action had taken effect. But the Justice Department later told Hanen that more than 108,000 people had already received three-year reprieves from deportation as well as work permits. Hanen said the federal government had been \"misleading,\" but he declined to sanction the government's attorneys. \nThe Justice Department has also asked the 5th Circuit to reverse Hanen's overall ruling that sided with the states. A decision on that appeal, which will be argued before the court in July, could take months. \nAlong with Texas, the states seeking to block Obama's action are Alabama, Arizona, Arkansas, Florida, Georgia, Idaho, Indiana, Kansas, Louisiana, Maine, Michigan, Mississippi, Montana, Nebraska, Nevada, North Carolina, North Dakota, Ohio, Oklahoma, South Carolina, South Dakota, Tennessee, Utah, West Virginia and Wisconsin. \nThe Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-05-26T22:40:00.000+03:00", "crawled": "2015-05-26T22:40:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}