{"organizations": [], "uuid": "3aac70560d71033fd8a3f94803156aea92e738f8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/043013/0/0/043013_dcl_gosnell_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/03/worked-at-abortion-clinic-like-dr-gosnell-practice.html", "country": "", "title": "I worked at an abortion clinic like Dr. Gosnell's 'house of horrors' | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "I worked at an abortion clinic like Dr. Gosnell's 'house of horrors' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "3aac70560d71033fd8a3f94803156aea92e738f8"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/03/worked-at-abortion-clinic-like-dr-gosnell-practice.html", "ord_in_thread": 0, "title": "I worked at an abortion clinic like Dr. Gosnell's 'house of horrors' | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gosnell", "Manny"], "text": "Dr. Manny: Where is the outrage in the medical community over the Gosnell case? \nMy conscience bothered me at times and I would secretly try to change the patient's mind during counseling. \nOne woman came in who was pregnant with twins and already had another child. I just couldn’t counsel her to choose abortion and told her that there are other options. She chose to keep the twins and saw me a couple years later and told me how grateful she was for my advice and that her children were her joy. \nAs time went by I learned every position in the clinic and the doctor trusted me. However, he was always in a bad mood and rude to patients and employees. He referred to the larger women as cows or whales. I hated how he treated everyone and left but went back because I needed the money. \nAlthough one might say I was used to this type of work, my heart now felt heavier as I watched woman after woman have an abortion. \nLooking back, I believe God was working through my conscience, trying to get my attention and wake me up to the horror of what I was doing. \nI tried to soothe my soul by comforting these women during their abortions or helping them with rides to the airport or bus and even had a few stay at my home because they had no extra money for hotels. But I saw more things that made me question why I was working there. I saw the doctor increasing prices for no reason, making pregnancies look larger on the ultra sound to charge more. I saw him charge women for being overweight, on medication by a primary doctor, for having had previous C-sections, for having a tilted uterus, and many other reasons he just made up. But even worse than lying to the women or dealing with a cranky boss was what I saw during the abortions. I was the doctor’s right hand person in the operating room and just like those employees of Dr. Gosnell, I saw the abortionist puncture the soft spot in the baby’s head or snip its neck if it was delivered alive. \nWhat in the world was I doing there? Where was the teenager who used to take a Bible everywhere she went? One day a flier was sent to the clinic asking for people to contact a certain pro-life group if they suspected illegal activity at the clinic. I secretly took it home with me, not sure if I would need it at a later date. I considered leaving several times but I had my children and their livelihood to think about. Eventually, I made a decision to leave and called the number on the flier. That group put me in touch with Abby Johnson, a former Planned Parenthood clinic director who now runs And Then There Were None, a ministry that helps abortion workers leave their jobs. I do not know where I would be now without Abby’s help. Her organization has kept me financially stable, helped me spiritually and she has personally been a mentor to me. My days are brighter knowing that I no longer have to witness abortion and the abuse done to the mothers, not to mention all of the illegal activities done in the clinic. I am now pro-life without exception and have rediscovered my faith since I left. I go to church every week and take my children with me. I have found the grace of forgiveness and healing. I still cannot believe I worked in the abortion industry for so long. I wish I would have left sooner. It is my hope that abortion workers will see that there are other options besides working in a job that takes lives or helping in a house of horrors, like that of Dr. Gosnell’s. ATTWN and Abby Johnson can help, just like they did for me. My faith was always there, even in the midst of the horrible things I was doing, and I am so glad that God never gave up on me. \nDeborah Edge worked in the abortion industry for 17 years in the Houston area. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:20:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}