{"organizations": [], "uuid": "15bab06b33de954a6c59749e58c55ed3573f05e1", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/241644-obama-budget-chief-slams-gop-transportation-and-housing-bill", "country": "US", "title": "Obama budget chief slams GOP transportation and housing bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama budget chief slams GOP transportation and housing bill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T00:15:00.000+03:00", "replies_count": 0, "uuid": "15bab06b33de954a6c59749e58c55ed3573f05e1"}, "author": "iswanson@thehill.com (Rebecca Shabad)", "url": "http://thehill.com/policy/finance/241644-obama-budget-chief-slams-gop-transportation-and-housing-bill", "ord_in_thread": 0, "title": "Obama budget chief slams GOP transportation and housing bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama budget chief slams GOP transportation and housing bill By Rebecca Shabad - 05/11/15 05:15 PM EDT \nWhite House budget director Shaun Donovan on Monday blasted a House GOP spending bill for not providing enough funds for the Transportation and Housing and Urban Development departments. \nDonovan said spending ceilings put into place under the 2011 “sequestration” budget deal should be eliminated, and he also criticized riders in the legislation, including one aimed at restricting travel to Cuba. ADVERTISEMENT The budget director made the complaints in a letter to House Appropriations Committee Chairman Hal Rogers (R-Ky.) first obtained by The Hill. The panel is scheduled to mark up the transportation and housing bill on Wednesday.\nDonovan pointed out that the bill funds housing vouchers $1.2 billion below Obama’s request, which he said would fail to restore nearly 70,000 vouchers lost from the 2013 sequester and would prevent the government from renewing 28,000 existing vouchers. \n“What it highlights is just how important the sequestration debate is to improving economic mobility, reducing poverty and other issues like revitalizing distressed communities,” an Obama administration told The Hill about the letter. \nThe bill would cut funding to TIGER grants that the federal government awards for surface transportation projects to 80 percent below its lowest level since the program began in 2009, the letter said. \nIt would provide $2.5 billion for the Federal Aviation Administration’s (FAA) facilities and equipment account, $355 million below Obama’s request and the lowest funding level in 15 years, the letter added. \nDonovan said the FAA would be “hampered” in its ability to maintain the capacity and safety of the current National Airspace System. \nFor fiscal 2016, which begins Oct. 1, the bill would provide $17.2 billion to the Transportation Department, which is $1 billion below the 2015 level and $6.8 billion below Obama’s request. \nThe Housing and Urban Development would receive $42 billion, which is $1 billion above the 2015 level and $3 billion less than Obama’s request. \nThe letter comes just a few weeks after the House passed the first two fiscal 2016 bills, which fund military construction projects and veterans’ benefits as well as energy and water development programs. \nWhile Republicans are sticking to sequestration budget ceilings that return in full force on Oct. 1, a number of lawmakers have been floating the idea of another deal that lifts the caps. Congress approved a deal in December 2013 that relieved sequestration for two fiscal years. \n“I will say we are encouraged by a number of recent developments,” the administration official told The Hill. \nThe official mentioned that there’s been bipartisan support for another deal to lift budget ceilings and Speaker Boehner’s (R-Ohio) comment about being open to an agreement is “particularly encouraging,” the official added.", "external_links": [], "published": "2015-05-12T00:15:00.000+03:00", "crawled": "2015-05-12T04:56:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}