{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "82ec95807f49f2e8654c3e0faff5c8baa49c9c41", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/100113/0/0/amhq_obama_100113.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/07/why-does-obama-always-choose-conflict-over-cooperation.html", "country": "", "title": "Move over Jimmy Carter, Obama has my vote for worst president -- ever | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Move over Jimmy Carter, Obama has my vote for worst president -- ever | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "82ec95807f49f2e8654c3e0faff5c8baa49c9c41"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/07/why-does-obama-always-choose-conflict-over-cooperation.html", "ord_in_thread": 0, "title": "Move over Jimmy Carter, Obama has my vote for worst president -- ever | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jimmy Carter", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nAmerica has had some great presidents, many mediocre ones and a few bad ones. But we’ve never had one like Barack Obama. He’s the first who thinks the job is beneath him. \nHe’s the first who turns political give-and-take into a crisis by refusing to negotiate with Congress. \nHe’s the first who thinks the way to more power is to inflict pain on ordinary people. \nThe move to barricade the World War II memorial reveals the mentality of a tin-pot dictator. The limited government shutdown did not need to affect the memorial because it is open 24 hours, without gates and often without guards. \n[pullquote] George Will on President Obama \nBut to turn public opinion in his favor, Obama’s goons trucked in barricades to keep out World War II vets and other visitors. By one estimate, the barricades and workers cost $100,000. \nThe same punish-the-people attitude led to shutdowns of other parks and historic sites that get no federal funding. \n“We’ve been told to make life as difficult for people as we can. It’s disgusting,” a Park Service ranger told The Washington Times. \nThe ranger cited the order to close the parking lot at George Washington’s home in Mount Vernon so visitors couldn’t use it. The cheap trick captured the contrast between a revered president and the current one. \nI’ve been saying for a while that there is no bottom to Obama. He’s not just ruthless. He’s without scruples and honor. \nHowever the shutdown ends, it will bring only a temporary respite from the crisis atmosphere in Washington. When it comes to his countrymen, Obama always chooses conflict over cooperation. \nMeanwhile, Jimmy Carter can rest easy. We have a new worst president. \nTo continue reading Michael Goodwin's column in the New York Post, click here . \nMichael Goodwin is a Fox News contributor and New York Post columnist. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:10:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}