{"organizations": [], "uuid": "f4e59cf7fda3db97f3b6fb22c5247fc86de1c95b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_042415getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/243072-pro-trade-group-seeks-to-bolster-dem-resolve", "country": "US", "title": "Pro-trade group tied to Obama begins ad blitz", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Pro-trade group tied to Obama begins ad blitz", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T16:40:00.000+03:00", "replies_count": 0, "uuid": "f4e59cf7fda3db97f3b6fb22c5247fc86de1c95b"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/finance/243072-pro-trade-group-seeks-to-bolster-dem-resolve", "ord_in_thread": 0, "title": "Pro-trade group tied to Obama begins ad blitz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pro-trade group tied to Obama begins ad blitz By Jordan Fabian - 05/26/15 09:40 AM EDT \nA pro-trade group tied to President Obama is running a series of digital ads this week backing senators who voted for a fast-track bill that is vehemently opposed by the left.The ads from the Progressive Coalition for American Jobs (PCAJ), which is advised by former Obama campaign officials, will also run in the districts of House members who have indicated they will support fast-track. ADVERTISEMENT “We want our elected leaders to know that we appreciate their support for this critical legislation, we have their backs, and we’ll continue to stand with them as the conversation continues around free and fair trade,” PCAJ Executive Director Chris Wyant said in a statement. The ads come as the White House works to build support among Democrats for Obama’s trade agenda ahead of a likely bruising fight in the House. The group says it is putting six figures behind the ads, which start running Wednesday in California, Colorado, Delaware, Florida, Maryland, Missouri, New Hampshire, North Dakota, Oregon, Virginia and Washington, as well as in selected House districts. The Obama administration views fast-track authority as a crucial step to completing the Trans-Pacific Partnership, a sweeping 12-nation trade deal that’s at the top of the president’s second-term agenda. “Thank you … for supporting free and fair trade, American workers, and the environment,” the PCAJ ads read, next to a photo of senators who voted for the fast-track bill last week.PCAJ is advised by 270 Strategies, a firm co-founded by former Obama campaign staffers Mitch Stewart and Jeremy Bird. The group is advised by Stewart and Lynda Tran, former press secretary for Organizing for America.", "external_links": [], "published": "2015-05-26T16:40:00.000+03:00", "crawled": "2015-05-26T22:05:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}