{"organizations": ["Tea Party | Fox News Facebook", "Twitter", "New York Times"], "uuid": "e3e522ab90103a4e89401899567f3d6d0138ab48", "thread": {"site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/06/latest-obama-scandal-has-even-new-york-times-sounding-like-tea-party.html", "country": "", "title": "Latest Obama scandal has even New York Times sounding like Tea Party | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Latest Obama scandal has even New York Times sounding like Tea Party | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "e3e522ab90103a4e89401899567f3d6d0138ab48"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/06/latest-obama-scandal-has-even-new-york-times-sounding-like-tea-party.html", "ord_in_thread": 0, "title": "Latest Obama scandal has even New York Times sounding like Tea Party | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nYou are reading this online and Uncle Sam probably knows it. If you call your friends about the story, the government knows what number you called. These latest scandals about the government investigating its own citizens are blowing up across Washington like early fireworks, with one of the most explosive results coming from one of Obama’s biggest allies. The New York Times blasted the administration over its massive overreach gathering data on ordinary Americans. “The administration has now lost all credibility on this issue,” wrote the editorial dated June 7 and published Thursday afternoon. This was a big change for a paper that has both endorsed the president and supported him throughout his presidency. The Times sounded practically Tea Partian in its critique. “Mr. Obama is proving the truism that the executive will use any power it is given and very likely abuse it.” The paper even harkened back to the Constitution, sounding even more like the Tea Partiers it has long mocked. “To casually permit this surveillance -- with the American public having no idea that the executive branch is now exercising this power -- fundamentally shifts power between the individual and the state, and repudiates constitutional principles governing search, seizure and privacy,” the grey lady continued. Heck, the only Tea Party standard the Times left out was quoting the Founders. The paper was strong in its criticism of the president: “Mr. Obama clearly had no intention of revealing this eavesdropping, just as he would not have acknowledged the killing of Anwar al-Awlaki, an American citizen, had it not been reported in the press.” The Times made it clear it wasn’t accusing Obama of illegality, just of massive wrongdoing. “It is the very sort of thing against which Mr. Obama once railed, when he said in 2007 that the Bush administration’s surveillance policy ‘puts forward a false choice between the liberties we cherish and the security we provide.’” When the Times throws your anti-Bush comments back in your face, you have problems. Thursday things got worse -- much worse. Three similar stories made their way onto the evening news. First, the gathering of phone records. Then, a Washington Post story wrote that a government program called PRISM was letting the NSA and FBI tap into servers of nine top Internet firms “extracting audio, video, photographs, emails, documents and connection logs that enable analysts to track a person’s movements and contacts over time.” Twitter erupted over both stories. As if that wasn’t enough, NBC News detailed how, in 2008, Chinese hackers broke into the campaign computers of both Obama and his opponent Sen. John McCain. Who do they think they are? The NSA? Coupled with the existing scandals of IRS investigations and intimidation of Tea Parties, multiple investigations of the press and misinformation about Benghazi, Obama now faces a crisis of confidence. Not just in his leadership but in the very government he leads – from both sides of the aisle. Obama isn’t alone in this one. Both sides of official Washington have backed the Patriot Act and other intelligence gathering. Even The Wall Street Journal published an editorial late Thursday saying “ Thank You for Data-Mining .” Critics of today’s revelations have also come from both parties. Even former vice president Al Gore called the practices described in the order “obscenely outrageous” in a message posted on Twitter Wednesday night. No matter what kind of collateral damage these explosive stories have for other politicians, Obama is still president. The buck isn’t the only thing that stops at his desk. He also gets to be the front man defending a government that operates more like the Soviet KGB than anything our Founders ever envisioned. \nDan Gainor is the Media Research Center's Vice President for Business and Culture . He writes frequently about media for Fox News Opinion. He can also be contacted on Facebook and Twitter as dangainor. \n", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}