{"organizations": ["CNN"], "uuid": "7b4ea9b58c519b0d1072193612d5a60e559ab959", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/05/24/WE01215746/3605350/AllLanguageAlliancecertifieddocu-3605350_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1244128", "country": "", "title": "Detained by Immigration for a Typo - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Detained by Immigration for a Typo - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-05-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "7b4ea9b58c519b0d1072193612d5a60e559ab959"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1244128", "ord_in_thread": 0, "title": "Detained by Immigration for a Typo - CNN iReport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Detained by Immigration for a Typo By kconner2 | Posted 16 hours ago \nCNN PRODUCER NOTE “Detained by Immigration for a Typo.” It started out as a flashy title to catch your attention. Then, a quick search of Google turned up a real story about a man whom this happened to. He was actually held for two years because of the clerical error on his paperwork. No drama needed, then; no bombshell headlines to grab your eye. This stuff really happens. Even the seasoned traveler has probably encountered a lighter version of this: Book those cheap tickets online with some fly-by-night airline, and see if you don’t have some trouble at check-in when your boarding pass does not exactly match your passport name. Little things happen all the time; but it is the molehills that turn into mountains that keep us from living our lives happily. Legal translation is not a game. It is not a business practice that should be left to chance. Someone serious about their immigration, foreign work, or global court proceeding situation should search for a professional legal translation service. Certified document translations are required for immigration, permanent residence, citizenship, adoption, working and visiting the United States. Professionally translated foreign language legal documents are crucial to your success, safety, and happiness. Above and beyond these matters, however, you have multilingual e-Discovery translation service which is also very important. When you are involved in a lawsuit spanning international borders, the universal legal standard for evidence admissible in court is e-Discovery. From the time the litigation is started, either by you or against you; all emails, databases, web sites, and all “raw” electronic data that is out there or on the litigants’ computers, is gathered and stored by e-Discovery. There is a formal, certified process for translating this information before it is put into legal storage. Mess that up, and you will have a heap of trouble. A simple typo in the database is a can or worms waiting to be opened when the trial or settlement talks start. Aside from electronic data is the human factor. People have to testify and give evidence in person, by a process of deposition. This is literally where they come to a room and get videotaped while answering questions under oath. Often, this requires an interpreter present, for each side. It is mandatory that each party to the suit be assisted by a court-certified interpreter; otherwise you end up with more liability if a mistake is made. Lawsuits are stressful enough. You do not need your problems multiplying once each party sits down to speak. Often times, the text of the the web sites involved in the lawsuit must be translated. This must be performed accurately by a legal translation service that employs certified legal translators. You cannot have a general summary, or a synopsis, of what a website says. Often, the web sites themselves have their own detailed legal pages such as the company privacy policy and other legal information. And all that needs to be translated professionally. There are many legal translation services available on the web. Which ones do you trust? It is not a road that you want to start down without being sure, because the way back is long, difficult, and expensive. You want to do it right the first time, from a position of trust; not just a price per page quote for quick translations. Anyone can promise you anything. Only a reputable multilingual legal translation service, such as All Language Alliance, Inc . can offer you the years of official experience that will give you peace of mind. You will not see a big price tag when you visit their web page; only a careful explanation of their services and an invitation to request a translation quote. They like to take it slow from the start; so that they can deliver quickly once all of the relevant facts and details have been gathered from you through careful, personal consultation. Discover the difference that a trusted legal translation service can make. Take the time to reach out and contact them first. Do not be in a hurry. Go with your gut based on the level of their courteous customer service. TAGS: What do you think of this story? Select one of the options below. Your feedback will help tell CNN producers what to do with this iReport. If you'd like, you can explain your choice in the comments below. Be and editor! Choose an option below: ", "external_links": [], "published": "2015-05-24T03:00:00.000+03:00", "crawled": "2015-05-25T02:02:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}