{"organizations": [], "uuid": "c27c94b48fa428e096e02104f581de305f88feb2", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/07/15/mr-obama-zimmerman-trial-is-over-can-please-move-on/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422588964213.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/15/mr-obama-zimmerman-trial-is-over-can-please-move-on.html", "country": "", "title": "Mr. Obama, the Zimmerman trial is over, can we please move on? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mr. Obama, the Zimmerman trial is over, can we please move on? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "c27c94b48fa428e096e02104f581de305f88feb2"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/15/mr-obama-zimmerman-trial-is-over-can-please-move-on.html", "ord_in_thread": 0, "title": "Mr. Obama, the Zimmerman trial is over, can we please move on? | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Zimmerman", "Obama"], "text": "Zimmerman Verdict: Mass Protests Call For Justice \nBut in this case it should. \nI understand why so many in the black community feel there was an injustice. The original injustice was that George Zimmerman was not arrested for the crime. \nNBC News and other news outlet compounded the sense of injustice by selectively editing 911 phone calls to make Zimmerman's statements sound worse than they were. \nZimmerman was eventually arrested, charged, and tried and a jury found him not guilty of both murder and manslaughter. \nThe State of Florida listened and acted. \nA judge allowed the prosecution to add manslaughter as a possible crime at the end of the trial. \nStill, a jury concluded Zimmerman is not guilty. \nOur system is not perfect, but it is preferable to rule by the mob. Juries are not perfect, but they are better than the court of public opinion. \nMany will feel justice was not served, but it was. Justice does not mean getting the outcome one side desires. Even so, those who are glad of the verdict should try to understand why so many feel so cold by what has happened and some see injustice. \nI see too much politicization by too many people on more than one side. A boy is dead. A man's life ruined. And too many are trying to capitalize on the politics of now. \nAs the president said yesterday, a jury has spoken. It is time to respect the verdict of that jury and move on. Trayvon Martin will never come back and George Zimmerman may be free, but it will be a long time, if ever, before his life returns to normal. \nOur country still has much to learn about itself. Sadly, too many profit from us not learning and fanning the flames of hostility. Those who have legitimate grievance in the verdict — and they do exist beyond Trayvon Martin's family — are drowned out by those whose only grievance is their inability to profit as much as they may from this tragedy. \nWe should all embrace the quiet dignity shown by Trayvon Martin's parents these last few days and embrace the President's words: \n\"We are a nation of laws and a jury has spoken. I now ask every American to respect the call for calm reflection from two parents who lost their young son.\" \nMr. Obama, I hope your administration will make it clear that it is time to embrace the better angels of ourselves and move on from this tragedy. A federal trial does not do that and I am heartened by your words yesterday that you seem to recognize this. \nErick Erickson is a Fox News contributor and editor of RedState.com . Follow him on Twitter @EWErickson . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:15:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}