{"organizations": [], "uuid": "20456ea29c3f0cbd91313de95fac3e3267b3641e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/oregon/feed", "section_title": "Oregon on Huffington Post", "url": "http://www.huffingtonpost.com/russ-belville/democratic-oregon-senator_b_7286168.html", "country": "US", "title": "Russ Belville: Democratic Oregon Senator Ginny Burdick Ignores Marijuana Legalization Voters", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Russ Belville: Democratic Oregon Senator Ginny Burdick Ignores Marijuana Legalization Voters", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T21:08:00.000+03:00", "replies_count": 0, "uuid": "20456ea29c3f0cbd91313de95fac3e3267b3641e"}, "author": "Russ Belville", "url": "http://www.huffingtonpost.com/russ-belville/democratic-oregon-senator_b_7286168.html", "ord_in_thread": 0, "title": "Russ Belville: Democratic Oregon Senator Ginny Burdick Ignores Marijuana Legalization Voters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nIf you're just joining us, Oregon's joint legislative committee that was assigned the task of implementing our recreational marijuana legalization got bogged down trying to restrict the medical marijuana program. Never mind that the Measure 91 recreational marijuana legalization initiative said, three times , that the existing medical marijuana program was not to be affected, and 56 percent of the voters agreed with that. \nIt appears as though some of our elected officials think our petitions and votes aren't what we want to see written into law. They think our initiatives are merely advice. And like then-Washington Gov. Christine Gregoire in 2011 , they are so easily frightened by vague, unrealized federal threats they're willing to line-item veto the key provisions of sensible marijuana regulation. \nAnd should these politicians succeed, they'll wreak the same sort of havoc on Oregon's successful medical marijuana program as we are now seeing wrought upon Washington's . \nThat joint committee of five senators and five representatives was well on its way to accomplishing most of the drastic changes to Oregon's medical marijuana program they sought, including the reduction in medical marijuana gardens from 6 mature plants per patient to a limit of just 12 plants total, regardless of how many patients a grower serves, in urban areas, as well as new recordkeeping and inspection requirements for medical marijuana growers. (Again, despite Measure 91 saying, in effect, \"don't tinker with medical marijuana!\") \nBut they deadlocked on local medical marijuana bans. When our medical marijuana dispensaries were created by the legislature in 2013, they allowed city councils and county commissions to institute bans until May 1, 2015. Then 146 of 242 cities and 26 of 36 Oregon counties instituted bans . \nNow that the ban deadline is up, the question became how can cities and counties maintain those bans? House members wanted such bans to automatically go to the ballot for the voters to decide. Senate members instead wanted bans to remain until the people collected enough signatures to put it to a vote of the people. \nNever mind the fact that the recreational marijuana legalization we just passed by a 56 percent vote says that in order to ban a recreational marijuana dispensary it requires a vote of the people, not just the votes of city councils or county commissions. As committee member Rep. Ann Lininger adroitly noted, it shouldn't be any easier to ban medical marijuana sales . \nSince the joint committee has deadlocked, Senate President Peter Courtney has empaneled a Senate committee to push the local medical marijuana dispensary ban language the Senate members wanted. Leading that committee is the same co-chair of the joint committee, Democratic Senate President Pro-Tem Ginny Burdick, joined by Republican Senator Jeff Kruse. \nThe political calculus here is that she thinks she can get a bipartisan Senate majority to support it. Then when it goes to the House, it's not just Rep. Lininger and four other joint committee members stonewalling it. The full House, she believes, will be swayed by the Senate into supporting the local ban language she favors. \nOf course, it strains credulity to think that if the handful of officials running a city or county can vote to ban medical marijuana dispensaries, they won't demand that power to ban recreational marijuana shops, in contradiction of the clear language of Measure 91 that says only the public vote can institute a ban. \nThen we'll find ourselves in the same morass as Washington State, where medical and recreational marijuana are only available in the urban centers. The price of marijuana will be artificially inflated, especially if the precedent for ignoring Measure 91's \"only the people can ban\" language is later applied by the legislature to the \"only the state can tax\" language, allowing local pot sales taxes. And the reduction in the black market that legalization promised vanishes as it fills the need for patients and consumers in 146 cities and 26 counties, or more! \nIf Senator Ginny Burdick accomplishes these line-item vetoes regarding local bans and local taxes, she'll have then defied the intent of fully two-thirds of her district who supported Measure 91. \nThis isn't about marijuana. This is about Democracy. Again, I ask, what good is citizen initiative power if the politicians feel they have the right to line-item veto it? What good is voting when a key senator is willing to ignore a supermajority of her own constituents? Please, contact Senator Ginny Burdick and let her know she needs to respect the will of the people. \nFollow Russ Belville on Twitter: www.twitter.com/RadicalRuss More:", "external_links": [], "published": "2015-05-14T21:08:00.000+03:00", "crawled": "2015-05-15T03:09:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}