{"organizations": ["Army", "Congress", "Defense", "Armed Services Committee", "Rules Committee", "House", "Defense Department"], "uuid": "767a55d7f0b10c91af3f3d9184d84e25daf4bf5d", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/military_army_040914getty_1.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/241271-army-enlisting-dreamers-as-congress-debates-immigration-action", "country": "", "title": "Army already enlisting 'Dreamers' as Congress debates immigration | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Army already enlisting 'Dreamers' as Congress debates immigration | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "767a55d7f0b10c91af3f3d9184d84e25daf4bf5d"}, "author": "", "url": "http://thehill.com/policy/defense/241271-army-enlisting-dreamers-as-congress-debates-immigration-action", "ord_in_thread": 0, "title": "Army already enlisting 'Dreamers' as Congress debates immigration | TheHill", "locations": ["The Hill", "U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ruben Gallego", "Kristina Wong", "Brooks", "Margaret Stock", "Mo Brooks", "Stock", "Obama"], "text": "Army already enlisting 'Dreamers' as Congress debates immigration Getty Images By Kristina Wong - 05/06/15 06:13 PM EDT The Army has already allowed almost 50 illegal immigrants to enlist as members of Congress debate whether to allow them to seek citizenship through military service. Since January, the Army has accepted into the ranks 46 so-called \"Dreamers,\" or people who have immigrated to the U.S. as children and qualify for President Obama's Deferred Action for Childhood Arrivals (DACA) program, according to retired Army Lt. Col. Margaret Stock. And there are thousands more waiting to enlist, she said. ADVERTISEMENT Stock helped create a program that allows highly skilled legal immigrants to enlist in the military as a fast-track to citizenship. The Army this year expanded that program from 1,500 enlistees per year to 3,000 per year, Stock said in an interview with The Hill on Wednesday. Though she said the expansion was in order to meet recruitment goals, it also allowed for those first Dreamers to enlist, because there was already a backlog of thousands of applicants. \"Otherwise none of them would have been able to sign contracts because there were no spaces left,\" Stock said. The program will expand to 5,000 enlistees per year in October, she added. The Defense Department ordered the Army to begin accepting illegal immigrants who qualify for DACA into the program last year, but that effort stalled because the program was not created to accept people without legal papers. The program, called Military Accessions Vital to the National Interest, was meant to recruit people with medical training or who speak a critical language, such as Mandarin, Urdu or Arabic. Stock said some members of Congress are frustrated with the low number of Dreamers being recruited through the program, and are now seeking other ways to get them in. The House next week is set to debate a 2016 defense policy bill that contains an amendment by Marine veteran Rep. Ruben Gallego (D-Ariz.) to encourage the Defense secretary to consider those who qualify for DACA as \"vital\" to national security, enabling them to enlist in the military. On Tuesday, a group of 25 House Republicans asked the Rules Committee to remove the amendment, saying it threatened the passage of the bill, which authorizes Pentagon activities and spending. “This controversial immigration language greatly increases the risk of the [bill's] failure to pass the House. The Rules Committee has the power, and indeed the duty, to prevent such a threat to our national security,\" said a letter led by Rep. Mo Brooks (R-Ala.). Brooks, an Armed Services Committee member, was one of two \"no\" votes against the defense bill. “Especially in this time of increased terrorism, our national security should not be threatened by allowing such controversial language on a program we have rejected three times as unconstitutional,” the letter said. Tags: ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-08T08:01:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}