{"organizations": [], "uuid": "444e93e3c1040d42ca9b44d7c4a5f5a8972b0806", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/marijuana_201501getty_0.jpg", "site_section": "http://thehill.com/taxonomy/term/25208/feed#", "section_title": "The Hill: International Regulation", "url": "http://thehill.com/regulation/international/241128-marijuana-advocates-press-un-on-global-drug-laws", "country": "US", "title": "Marijuana advocates press UN on global drug laws", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Marijuana advocates press UN on global drug laws", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T00:27:00.000+03:00", "replies_count": 0, "uuid": "444e93e3c1040d42ca9b44d7c4a5f5a8972b0806"}, "author": "tdevaney@thehill.com (Tim Devaney)", "url": "http://thehill.com/regulation/international/241128-marijuana-advocates-press-un-on-global-drug-laws", "ord_in_thread": 0, "title": "Marijuana advocates press UN on global drug laws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marijuana advocates turn to UN to fight global drug laws \nMarijuana advocates are pressing the United Nations to end the war on pot worldwide. \nGlobal drug laws that criminalize pot discriminate against minorities, who are arrested at a disproportionately high rate, and lead to “serious human rights violations,” dozens of civil rights and drug reform groups say in a letter to the United Nations. \nThe groups, including Human Rights Watch and the American Civil Liberties Union, are calling on the United Nations to address these “injustices.\" ADVERTISEMENT “Existing U.S. and global drug control policies that heavily emphasize criminalization of drug use, possession, production and distribution are inconsistent with international human rights standards and have contributed to serious human rights violations,” they write.\nThe letter comes as the United Nations convenes this week to review its drug policy. \nThe groups pointed to \"discriminatory policing” practices that lead to the arrests of black people more often than white people for marijuana-related offenses. \nIn other countries, some drug offenders may even face the death penalty. \nGlobal drug policies have also given rise to an illegal black market, the groups say. \n\"Criminalization of the drug trade has dramatically enhanced the profitability of illicit drug markets, fueling the operations of groups that commit abuses, corrupt authorities, and undermine democracy and the rule of law in many parts of the world,” they write. 1 day Juan Williams: Republicans and... OPINION: Southern white male dominance in the GOP has prompted alarm. Sanders: ‘We need a political... The 2016 candidate called on Americans to rise up against influence of... Right's new check on McConnell Sen. Cotton has become a conservative foil to Senate Majority Leader Mitch... Report: Netanyahu rejected Kerry... Kerry reportedly wanted to travel to Israel right after Netanyahu's win. McConnell’s tough choice on Iran McConnell could file to end debate on the Iran bill, or he could allow a... Carly Fiorina suffers website... Visitors to CarlyFiorina.org encounter claims about layoffs at Hewlett-... ER visits climb under ObamaCare,... The law had been intended to reduce the need to rely on emergency rooms. SNL cautiously spoofs the... \"Saturday Night Live\" took a baseball bat to the riots in Baltimore in its... Bill Press: Sanders a serious... OPINION | The long-shot candidate will have a profound, positive impact on... Buffett: I'm going to vote for... “I think that she is the most likely person to be president,\" the... Carson: ‘I’m announcing my... “I’m not 100 percent sure politics as usual is going to save us,\" he said. Hillary to GOP: You get 1 shot on... Clinton's attorney says there is no \"logic\" to the panel's request. Union worker behind CarlyFiorina.... “It was something that I did completely unrelated to my job,\" the SEIU...", "external_links": [], "published": "2015-05-06T00:27:00.000+03:00", "crawled": "2015-05-06T01:12:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}