{"organizations": ["White House", "Fox News Facebook", "Walter Reed National Military Medical Center", "Twitter"], "uuid": "ec1bed8de31b07d5276180adef6e1358b171179f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Opinion/0/0/660-Obama-door-AP.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2015/04/30/trade-fight-do-trust-obama-to-rewrite-rules-for-world-economy/", "country": "", "title": "Trade fight: Do you trust Obama to rewrite rules for world's economy? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Trade fight: Do you trust Obama to rewrite rules for world's economy? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T02:30:00.000+03:00", "replies_count": 0, "uuid": "ec1bed8de31b07d5276180adef6e1358b171179f"}, "author": "", "url": "http://www.foxnews.com/opinion/2015/04/30/trade-fight-do-trust-obama-to-rewrite-rules-for-world-economy/", "ord_in_thread": 0, "title": "Trade fight: Do you trust Obama to rewrite rules for world's economy? | Fox News", "locations": ["Washington", "South Lawn"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print April 29, 2015: President Obama walks out of the Oval Office of the White House in Washington to board Marine One on the South Lawn for a trip to Walter Reed National Military Medical Center to meet with wounded veterans. (AP Photo/Evan Vucci) \nDo you trust President Obama to rewrite the rules for the world economy? \nCongress will soon answer that question when they decide whether to grant President Obama fast track trade authority, paving the way for almost certain passage of a treaty between the United States and eleven other countries known as the TransPacific Partnership (TPP). \nBut don’t be fooled, the TPP is not a free trade deal, it is instead what Bloomberg News calls it -- “a regulatory deal” with only five out of twenty seven sections covering trade. So, 1990s NAFTA-style “free trade” arguments are really irrelevant to whether Congress should ease a pathway for TPP’s passage. \nThe push to pass fast track is not about free trade, it is about power. It is about whether Congress trusts President Obama to rewrite the regulatory rules for the world. \nCongress is trying to ease passage of TPP by changing the requirements for ratifying a treaty through passage of fast track legislation, and lowering the vote threshold for treaty approval from a two-thirds vote in the Senate to a simple majority in the Senate and House of Representatives. \nSenate Majority Leader Mitch McConnell makes no bones about the significance of his supporting giving the president fast track calling it, “ an enormous grant of power .” \nFinance Committee Chairman Senator Orrin Hatch, another supporter of empowering Obama, stunningly admitted that it takes faith in President Obama to give him fast track saying to the Washington Times , “There’s an element of trust here, no question about that, and I expect the president to live up to it.” \nUnfortunately, when Obama hasn’t lived up to that trust in the past, Congress has proven unwilling to use its authority to rein him in, hence the gigantic leap of faith needed to vote for fast track. \nSupport for fast track requires that you travel through the looking glass, where Utah’s Hatch trusts Obama to not abuse his authority to achieve his agenda, and Senate Majority Leader McConnell wants to give President Obama even more powers than he has already seized from Congress. \nOne wonders if Hatch and McConnell have been paying attention to what President Obama has been up to the past few years? Have they even listened to their own Party's rhetoric which consistently and rightfully bemoans this president’s dramatic power grabs on everything from the Environmental Protection Agency’s regulatory excesses in Obama’s war on coal to current attempts to impose Executive Amnesty on the nation? \nIt is not like the president has earned Congress’ trust with his foreign policy dealings either as his Iranian nuclear deal looks a lot more like a pathway to a nuclear Iran than a roadblock, and this is just one of many glaring examples. \nYet, Senator Hatch and Leader McConnell somehow trust that this time they can depend upon Obama to not abuse his authority, careening forward like political Charlie Browns expecting that this time Lucy won’t pull the football away. \nRepublican Senator Jeff Sessions, on the other hand, has expressed opposition to granting the president fast track due to concerns about elements of the TransPacific Partnership which touches on virtually every aspect of the U.S. economy with climate change and immigration being just two of them. Sessions explained in a radio interview that the treaty is viewed as a “living document, so the treaty signatories can change it at any time if we authorize it to go through…” \nIf the Executive Branch has been given fast track authority, these changes could be enacted by simple Congressional majorities leading to potential rapid and massive changes to U.S. law without normal legislative protections or amendments. \nIncredibly, Chairman Hatch’s Finance Committee revealed another disturbing aspect of the secret TPP this past week – after ratification, other nations can join it without Congressional assent with the Committee specifically rejecting an amendment that sought Congressional approval if China sought to join a ratified TPP. \nThis likely makes the TPP one of America’s last major trade deals, as non-signatory countries join to gain access to what currently is 40 percent of the world’s economy without the strain and ratification hassle of bilateral negotiations. \nThe push to pass fast track is not about free trade, it is about power. It is about whether Congress trusts President Obama to rewrite the regulatory rules for the world. \nThe stakes are high, and a vote is near. Congressional Republicans should pay attention to history and reject the enormous leap of faith required to trust Obama with fast track and subject any treaty Mr. Obama signs to full Constitutional scrutiny. \nRichard Manning is president of Americans for Limited Government. Advertisement ", "external_links": [], "published": "2015-05-01T02:30:00.000+03:00", "crawled": "2015-05-01T02:41:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}