{"organizations": [], "uuid": "518269f7ba310efd579874bc8636957862747850", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/espanol/2015/05/30/obama-pide-al-senado-aprobar-la-ley-que-acaba-con-la-recogida-masiva-de-datos/", "country": "", "title": "Obama pide al Senado aprobar la ley que acaba con la recogida masiva de datos de la NSA | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama pide al Senado aprobar la ley que acaba con la recogida masiva de datos de la NSA | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "518269f7ba310efd579874bc8636957862747850"}, "author": "", "url": "http://latino.foxnews.com/latino/espanol/2015/05/30/obama-pide-al-senado-aprobar-la-ley-que-acaba-con-la-recogida-masiva-de-datos/", "ord_in_thread": 0, "title": "Obama pide al Senado aprobar la ley que acaba con la recogida masiva de datos de la NSA | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama pide al Senado aprobar la ley que acaba con la recogida masiva de datos de la NSA Published May 30, 2015 EFE \nWashington – El presidente de EEUU, Barack Obama, pidió hoy al Senado que apruebe un proyecto de ley que para terminar con la recogida de datos telefónicos de millones de ciudadanos por parte de la Agencia de Seguridad Nacional (NSA) y evitar así que expiren otras medidas antiterroristas esenciales. \n\"Mañana domingo, a la medianoche, algunas herramientas importantes que utilizamos contra los terroristas expirarán. Eso es porque el Congreso no las habrá renovado, y ocurrirá porque una legislación, la Ley de Libertad, se ha quedado atascada en el Senado\", dijo el presidente en su discurso semanal a la nación. \nCon 57 votos a favor y 42 en contra, por debajo de los 60 necesarios para ser aprobada, el Senado bloqueó la semana pasada la propuesta legislativa conocida como \"Ley de la Libertad de EEUU\" (\"USA Freedom Act\"), que prohíbe la recogida masiva de datos telefónicos y modifica la Ley Patriota, aprobada tras los atentados terroristas del 11S. \nDe salir adelante, la Ley de la Libertad hubiese enmendado la Sección 215 de la Ley Patriota, que ampara la recogida de datos telefónicos de millones de ciudadanos sin vínculos con el terrorismo, pero a su vez hubiese renovado la validez del conjunto de la ley con éste y otros cambios hasta 2019. \nObama explicó que, de este modo, seguirían vigentes las capacidades de las agencias de seguridad para investigar redes terroristas con una orden judicial para ciertos registros o intervenciones telefónicas concretas para rastrearlos cuando cambian sus teléfonos móviles. \n\"Podemos pedir intervenciones telefónicas de los llamados sospechosos lobos solitarios que no tienen por qué estar directamente vinculados a un grupo terrorista. Estas herramientas no son controvertidas\", reiteró. \nEl mandatario recordó que, desde que entraran en vigor, estas medidas se han renovado en numerosas ocasiones y que han sido calificadas como \"esenciales\" por el director del FBI, James Comey, quien considera que su pérdida tendría un efecto grave en la seguridad nacional. \nRespecto a la polémica recogida masiva de datos, Obama explicó que eliminar esta cuestión ayudará a aumentar la transparencia y \"construir confianza entre el pueblo estadounidense de que su privacidad y sus libertades civiles están siendo protegidas\". \n\"La Ley de Libertad de EEUU refleja las ideas de los defensores de la privacidad, de nuestros socios del sector privado y de nuestros expertos en seguridad nacional\", insistió. \nLa Cámara de Representantes ya aprobó el texto con un fuerte apoyo bipartidista, sin embargo, algunos de los senadores, encabezados por el líder de la mayoría republicana, Mitch McConnell, se oponen a esa modificación y quieren renovar la legislación sin ningún cambio. \nPor desgracia, algunas personas están tratando de utilizar este debate para ganar puntos políticos. Pero esto no debe y no puede ser ir sobre política. Este es un asunto de seguridad nacional\", dijo el presidente en su alocución. \n\"Los terroristas como Al Qaeda y el Estado Islámico (EI) no van a dejar de conspirar de repente contra nosotros en la medianoche de mañana. Y no debemos renunciar a las herramientas que ayudan a mantenernos seguros. Sería irresponsable. Sería imprudente. Y no debemos permitir que esto suceda\", concluyó\". \nAnte la incapacidad para llegar a un acuerdo a tiempo antes del receso que ahora disfrutan los legisladores, McConnell convocó para este domingo una sesión extraordinaria que tratará de llegar a un acuerdo antes de que venza el plazo a las doce de la noche. ", "external_links": [], "published": "2015-05-30T03:00:00.000+03:00", "crawled": "2015-05-31T19:33:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}