{"organizations": ["Catholic Church | Fox News Latino Fox News Latino", "ACLU"], "uuid": "ab6e4ed663bab192e16a73b0094bcdcbd39eb0f4", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/070814_OTR_Border_640.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/opinion/2015/05/04/opinion-in-its-abortion-advocacy-aclu-pretends-to-challenge-catholic-church/", "country": "", "title": "Opinion: In its abortion advocacy, ACLU pretends to challenge Catholic Church | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Opinion: In its abortion advocacy, ACLU pretends to challenge Catholic Church | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "ab6e4ed663bab192e16a73b0094bcdcbd39eb0f4"}, "author": "", "url": "http://latino.foxnews.com/latino/opinion/2015/05/04/opinion-in-its-abortion-advocacy-aclu-pretends-to-challenge-catholic-church/", "ord_in_thread": 0, "title": "Opinion: In its abortion advocacy, ACLU pretends to challenge Catholic Church | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fox News Latino \nYoung women and girls who have illegally crossed the border, in many cases trafficked and abused, may soon find themselves without the tender and familiar help of the Catholic Church. The ACLU is suing the federal government, irate at the fact that Catholic charities will not provide abortions. This may lead to the end of the very successful partnership between the federal government and Catholic Church in the care of these poor people. If the ACLU succeeds in severing the Church from its mission to help migrant children, I doubt that the ACLU lawyers and their abettors will be showing up to help at the border. \n- Dr. Grazie Pozo Christie \nJust last year almost 90,000 children crossed the border and about one third of these were girls. The utter vulnerability of these children is hard to contemplate. They come from Honduras, Guatemala, and El Salvador, where life for the poor has become hellish due to the brutish violence of the drogos (drug gang members) who virtually run whole villages and townships with impunity. Desperate mothers and fathers think the perilous journey with a coyote is less risky than staying home where violence is almost sure to claim them. \nOn the other side of the border waits the Church. In many ways, the story of Roman Catholicism in the United States for the past 150 years has been the story of immigration. Starting with the influx of Irish Catholics fleeing the starvation caused by the potato blight and continuing through wave after wave of Italians, Poles, Germans, and Eastern Europeans, immigrants found “home” again in the Church. Popular devotions, parishes rich with ethnic flavor, help from selfless nuns and priests, education for their children, and material help to get ahead, were all there for the “huddled masses.” The Church of the poor and for the poor, of the dispossessed and for the dispossessed. \nIn many ways, the Church typifies and expresses the welcome and generosity of the whole American people. At the border today, it partners in an unusually successful way with the federal government to offer a nurturing refuge to vulnerable and lonely children. The best part of it is that the Church is not a cold government bureaucracy, simply doling out blankets and toothbrushes. The Church acts out of her mission to live out the gospel call to serve “the least of these.” \nThis is a call that is answered with tender attention to the spiritual and personal needs of each child, not just their material needs. The young people easily recognize that solicitude, it is the same they know from home, where churches are the main source of support and assistance, not the government. \nThe federal government would be lost without faith based organizations like Catholic Charities. Six of out nine national refugee resettlement agencies in the United States are faith-based, and Catholic Charities serves the greatest number of people. Most refugees that enter the U.S. are resettled by these organizations. \nSo what is the gripe of the ACLU? Simply that Catholic Charities cannot, in good conscience, provide abortions as part of their care of the children. It cannot, because it recognizes that unborn children are no less human than the mothers who carry them, and deserve the same dignity and respect. How can they answer the violence of sexual abuse and trafficking with the violence of abortion? Their call is to love and protect the child as well as the mother. In fact, their motivation to serve is their religious conviction to protect human life. \nIn its abortion advocacy, the ACLU is quite willing to remove Catholic Charities from its irreplaceable position as succor to unaccompanied minors of all faiths or no faith. The ACLU puts its belief in abortion access before the welfare of the children. \nThe United States Conference of Catholic Bishops (USCCB) states that it informs the government when a girl in their care wants access to an abortion or abortifacient drug, and that it rarely happens. Kevin Appleby, Director the USCCB’s Office of Migration Policy said: “Let’s be clear about the ACLU’s purpose here: ending the productive and successful partnership between the Catholic Church and the federal government on the care and shelter of vulnerable populations.” This is a direct, frontal attack on the religious liberty of Catholic Charities to serve the vulnerable while holding true to the faith that motivates them. \nIf the ACLU succeeds in severing the Church from its mission to help migrant children, I doubt that the ACLU lawyers and their abettors will be showing up to help at the border. Don’t expect them there, with their sleeves rolled up and their arms opened wide. They won’t come. \nDr. Grazie Pozo Christie specializes in radiology in the Miami area and serves on the advisory board for The Catholic Association. \nFollow us on twitter.com/foxnewslatino ", "external_links": [], "published": "2015-05-04T03:00:00.000+03:00", "crawled": "2015-05-05T13:40:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}