{"organizations": ["Fox News Facebook", "Inc.", "Twitter"], "uuid": "98667d493581268035ab3c35b7920f3948d49e56", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/060513/0/0/060513_al_obama_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/10/obama-still-failing-as-ceo-usa-inc.html", "country": "", "title": "Obama still failing as CEO of USA, Inc. | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama still failing as CEO of USA, Inc. | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "98667d493581268035ab3c35b7920f3948d49e56"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/10/obama-still-failing-as-ceo-usa-inc.html", "ord_in_thread": 0, "title": "Obama still failing as CEO of USA, Inc. | Fox News", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama is failing as CEO of the U.S government. His appointment of Susan Rice to be his top national security adviser and other missteps, indicate he views the fallout from recent scandals as a political challenge, rather than a management failure. Nothing could be less true or more damaging. \nRevelations about the IRS targeting conservative groups, the Justice Department broadly searching the emails of journalists, and recent revelations indicate systemic management dysfunctions, and a culture of contempt for the protections of individual rights and the limits on the executive power required by the Constitution. \nHis stockholders—the American people—are rapidly losing confidence in his management. In a recent Wall Street Journal/NBC News poll 55 percent of respondents said IRS targeting of conservative groups raised doubts about the broader honesty and integrity of his administration. \n[pullquote] \nYet, Mr. Obama is behaving as if all the turmoil on Capitol Hill and the media come down to Republican gaming in preparation for the 2014 congressional elections. More On This... Obama admin. to open investigation into NSA leak \nBy appointing Susan Rice as National Security Adviser, the woman who misled Americans into believing the murder of U.S. diplomats in Benghazi was the result of spontaneous street demonstrations when the State Department simply knew otherwise, he is challenging the GOP to stop him if they can, instead of committing to get to the root of recent scandals and fixing what is broke. \nSimilarly, the president sent up three very liberal nominations for the pivotal D.C. Circuit Court of Appeals, where the constitutionality of many presidential actions is determined. \nThe plan, crafted with Democratic senators, is to force their Republican colleagues into blocking those appointments, make the GOP appear obstructionist, and distract attention from all the scandals. \nAt the heart of Mr. Obama’s problems is his aloof style, impatience with critiques and disdain for the rules of the game. \nFor example, in a clear disregard for the separation of powers, his administration is training Democratic members of Congress and their staff to help sign up constituents for health insurance under ObamaCare. \nWrong on two counts: signing up Americans is clearly an Executive Branch responsibility, which should be kept out of the hands of politicians, and it appears Americans who have Democratic representatives are more entitled to government benefits than those who vote Republican. \nSimilarly, we learn that Assistant Senate Majority Leader Dick Durbin specifically asked the IRS to investigate conservative groups in 2010, which led to terrible harassment. Yet, the President has not encouraged his Democratic colleagues to better discipline their more visceral political instincts. \nOver and over again, the president has demonstrated by word and action an attitude of whatever it takes to move forward his progressive agenda. \nIn the federal agencies and on Capitol Hill, this cultivates impatience and disregard for thoughtful people who have honest disagreements with him and their constitutional rights. \nNow his second term agenda is threatened by growing distrust and lack of confidence in the honesty and fundamental integrity of his administration and with more than three years remaining, that is a terribly dangerous brew. \nAny good CEO would root out the abuses at the IRS, Justice and elsewhere, put in place reasonable standards of performance and expectations for the use of managerial discretion, and establish mechanisms to both evaluate managers’ performance and insulate them from inappropriate outside interference—for the IRS, the likes of Senator Durbin. \nTo win back the confidence of all Americans, the president must forthrightly take responsibility for government agency missteps and abuses, and explain what he is doing to fix them—this is no time to lead from behind. \nInstead, the resident of the White House continues to treat the multiplying crises and escalating concerns about his leadership as a political game—this to the great peril of our liberties, security and ultimately the legitimacy of our republic. \nPeter Morici served as Chief Economist at the U.S. International Trade Commission from 1993 to 1995. He is an economist and professor at the Smith School of Business, University of Maryland, and a widely published columnist. He is the five time winner of the MarketWatch best forecaster award. Follow him on Twitter @PMorici1 . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}