{"organizations": [], "uuid": "e0479ce37e305d3878ef3a8e083c07bddec05ecb", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2969348/images/o-BOEHNER-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/19/john-boehner-aumf-islamic-state_n_7321986.html", "country": "", "title": "John Boehner Wants Obama To 'Start Over' On ISIS War Authorization", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "John Boehner Wants Obama To 'Start Over' On ISIS War Authorization", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T00:38:00.000+03:00", "replies_count": 0, "uuid": "e0479ce37e305d3878ef3a8e083c07bddec05ecb"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/19/john-boehner-aumf-islamic-state_n_7321986.html", "ord_in_thread": 0, "title": "John Boehner Wants Obama To 'Start Over' On ISIS War Authorization", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Boehner Wants Obama"], "text": "John Boehner Wants Obama To 'Start Over' On ISIS War Authorization Posted: reddit \nWASHINGTON -- House Speaker John Boehner (R-Ohio) hasn't taken any action to authorize the ongoing war against Islamic State militants. But on Tuesday, he criticized President Barack Obama's proposal for authorizing the military campaign, and said Obama should just withdraw it. \n\"The president's request for an Authorization of Use of Military Force calls for less authority than he has today. I just think, given the fight that we're in, it's irresponsible,\" Boehner told reporters. \"This is why the president, frankly, should withdraw the Authorization of Use of Military Force and start over.\" \nIt's been nine months since the U.S. began bombing the Islamic State in Iraq and Syria, or ISIS, without new congressional authorization. The Constitution requires Congress to declare wars, but in this case, Obama has said he doesn't need lawmakers' sign-off because a sweeping 2001 AUMF covers his actions. Lawmakers in both parties disputed that point for months, so Obama sent them a new, ISIS-specific AUMF proposal in February, saying he welcomed their vote even if he doesn't think he needs it. \nNothing has happened since. \nDemocrats say Obama's proposal is too broad and Republicans say it's too restrictive, and their differences have given way to complacency. Meanwhile, the war has continued with no parameters placed on its duration, cost or endgame. To date, the U.S. has spent more than $2.1 billion fighting the Islamic State, participated in more than 3,700 airstrikes and sent roughly 3,000 military personnel to Iraq. \nBoehner argued Tuesday that Republicans don't have a clear sense of Obama's strategy for countering ISIS, so they can't support the president's request for authorization. He pushed back on the idea that Congress is ceding its responsibility to the executive branch by not weighing in on war matters. \n\"We have one commander in chief at a time,\" he said. \"It's the president's responsibility to wage this battle, and the president, in my view, is not taking this threat as seriously as [he] should.\" \nBut nothing prevents Boehner or any other lawmakers from amending Obama's proposal to shape it into a war authorization that they could support. Republican leaders could also put forward an entirely new AUMF. Neither has happened. \nWhite House press secretary Josh Earnest practically laughed off Boehner's suggestion that Obama should withdraw his AUMF because Republicans don't like it. \n\"He's the Speaker of the House and he's blaming the president for something not moving through Congress?\" Earnest asked during his daily briefing. \n\"The president has been very clear about what he would like to see from Congress, and that is Congress fulfilling their constitutional responsibility when it comes to matters of war and peace,\" he said. \"Congress has been AWOL when it comes to the AUMF.\" \nLawmakers have to overcome three main points of dispute to get an AUMF done: how to use U.S. ground troops in the battle, if at all; how to define what the mission is, given Syria's ongoing civil war; and what to do with the 2001 AUMF. Some Democrats want to repeal the earlier authorization entirely, on the grounds that it's too broad and wasn't intended to apply to a war 14 years in the future. Republicans are loath to do anything that would rein in the president's war authority. \nIf there's any action, it's likely to begin with the Senate Foreign Relations Committee. Sens. Bob Corker (R-Tenn.) and Ben Cardin (D-Md.), the chairman and ranking member of the committee, respectively, have been in talks about finding a bipartisan way forward. In the meantime, the House isn't doing a thing. \nRep. Adam Schiff (D-Calif.), a vocal proponent of passing a new AUMF, said Boehner's comments are just the latest in a string of justifications for doing nothing. In the nine months since the war began, Republicans first argued they didn't want to vote on the AUMF until the new Congress began, then argued they wanted a draft proposal from the president. Then, when they got it, they said they didn't support his strategy, and now they want a new draft AUMF. \n\"Why on earth, if we don't like the draft the president has sent, don't we come up with our own draft?\" Schiff said in an interview with The Huffington Post. \"The reality is, it's simply an abdication of our responsibility. It's a marriage of convenience, of apathy and indifference and political interest in the Congress.\" \nThe House did take one bit of action on the ISIS war last week: It authorized billions of dollars to keep funding it. \nElise Foley contributed reporting. Also on HuffPost: More: ", "external_links": [], "published": "2015-05-20T00:38:00.000+03:00", "crawled": "2015-05-20T00:41:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}