{"organizations": [], "uuid": "4af455ba1e536686d7889989b8d361c21b6b10e1", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/kidney%20donor%20latino%202.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/health/2015/05/22/immigration-officials-delay-man-deportation-so-can-donate-kidney-to-his-sister/", "country": "", "title": "Immigration officials delay man's deportation so he can donate kidney to his sister | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration officials delay man's deportation so he can donate kidney to his sister | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T19:59:00.000+03:00", "replies_count": 0, "uuid": "4af455ba1e536686d7889989b8d361c21b6b10e1"}, "author": "", "url": "http://latino.foxnews.com/latino/health/2015/05/22/immigration-officials-delay-man-deportation-so-can-donate-kidney-to-his-sister/", "ord_in_thread": 0, "title": "Immigration officials delay man's deportation so he can donate kidney to his sister | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration officials delay man's deportation so he can donate kidney to his sister Published May 22, 2015 Fox News Latino \nThese are bittersweet days for Jazmin Longoria-Lara. \nThe 23-year-old Illinois woman, who is undergoing dialysis, needs a kidney transplant and doctors have identified a potential donor – her older brother, Argenis. \nBut Argenis, who is 27, ran into trouble with the law and ended up in a county jail and then in the custody of immigration officials, who have him slated for deportation to his native Mexico. \nNow, however, he has been released temporarily on humanitarian grounds so that he can help save his sister’s life. \nImmigration officials agreed to hold off his deportation for at least six months so that Argenis, who wants to donate his kidney to his sister, can go through the various tests and other steps needed for a transplant. \n\"I feel dizzy, but I'm just smiling because I feel happy that he's here,\" said Longoria-Lara on Thursday, as quoted by AOL News, after a dialysis treatment, and as she prepared to reunite with her brother. \nJazmin’s mother donated a kidney to her, but it failed. Argenis is the only other match, according to published reports. \nOnce they learned that Argenis was a match, the family turned to Sen. Dick Durbin and Rep. Luis Gutierrez for help in appealing to immigration officials to have him released. \n\"I think it was real nice of them to consider it in letting me out to do this deed for my sister. I really appreciate it,\" Argenis said, according to NBC News . \"I didn't expect it. I really was, like, hoping for the best but preparing for the worst.\" \nArgenis and Jazmin are scheduled to meet with doctors Friday. They do not yet have a date for the transplant, NBC News said. \nAfter U.S. Immigration and Customs Enforcement granted the humanitarian release, Argenis, who pleaded guilty to burglary and was serving more than a year in prison, was transferred from the McHenry County Jail to a federal building in Chicago. After being processed there, he was released. \nICE said in a statement: “After this stay of removal expires, ICE will review Mr. Longoria-Lara's case to determine what further action is required.” \n“U.S. Immigration and Customs Enforcement (ICE) carefully considers and reviews all requests for prosecutorial discretion based on humanitarian grounds,” it continued. “ICE remains focused on smart, effective immigration enforcement that prioritizes the removal of convicted criminals and public safety threats. ICE exercises prosecutorial discretion on a case-by-case basis, considering the totality of the circumstances in an individual case.\" \nArgenis’ lawyer, Matthew Katz, declined to talk about the criminal case or deportation, but was quoted by NBC News as saying: \"Way too often laws are very minimally forgiven for individuals in this circumstance, and thankfully we've seen that the government did show some heart and did show some compassion.” \nLike us on Facebook ", "external_links": [], "published": "2015-05-22T19:59:00.000+03:00", "crawled": "2015-05-22T21:16:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}