{"organizations": ["NSA", "Senate"], "uuid": "b3c14a6a0c8a013d3cfb1c46838f251d2315b7f0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_052615getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/national-security/243503-obama-pleads-that-senate-act-on-nsa-reform", "country": "", "title": "Obama pleads that Senate act on NSA reform | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama pleads that Senate act on NSA reform | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-30T00:52:00.000+03:00", "replies_count": 0, "uuid": "b3c14a6a0c8a013d3cfb1c46838f251d2315b7f0"}, "author": "", "url": "http://thehill.com/policy/national-security/243503-obama-pleads-that-senate-act-on-nsa-reform", "ord_in_thread": 0, "title": "Obama pleads that Senate act on NSA reform | TheHill", "locations": ["Jordan Fabian"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama pleads that Senate act on NSA reform Getty Images By Jordan Fabian - 05/29/15 05:30 PM EDT \nPresident Obama on Friday made a last-minute push to urge Congress to renew key provisions of the Patriot Act before a Sunday deadline, arguing that failing to do so could put the nation at greater risk of terrorist threats. \nThe president called on Senate Majority Leader Mitch McConnell (R-Ky.) to pass a bipartisan reform bill approved in a 338-88 House vote. ADVERTISEMENT “Heaven forbid we’ve got a problem where we could have prevented a terrorist attack or apprehended someone who was engaged in dangerous activity but we didn’t do so simply because of inaction in the Senate,” Obama said in the Oval Office alongside Attorney General Loretta Lynch. \nSenators will return to Washington for a rare Sunday session to try and break the impasse over a series of measures, including language authorizing the National Security Agency’s controversial bulk phone records collection program. \nThe Senate failed to move forward with the House bill late last week when a procedural motion won only 57 votes — three short of the number needed to proceed. \n“We’ve only got a few days,” Obama said. “Authorities expire Sunday at midnight and I don’t want us to be in a situation where for a certain period of time those authorities go away. ... I’ve indicated to Leader McConnell and other senators, I expect them to take action and take action swiftly.” \nIt appears increasingly likely those authorities, which the White House has deemed crucial to national security, will be allowed to lapse. \nThe White House says the only way to avoid that would be to pass the USA Freedom Act, the measure cleared by the House. It would revamp the NSA’s phone records program, while renewing other authorities, such as roving wiretaps for terror suspects. \nBut McConnell has refused to support the measure, saying it would deprive counterterrorism officials of key powers. McConnell is backed by other GOP hawks, including Sen. Richard Burr (R-N.C.), the chairman of the Senate Intelligence Committee. \nSen. Rand Paul (R-Ky.) is taking the opposite position. He argues the House bill does not go far enough in reforming the program, and argues the Patriot Act should be allowed to expire. \nThere are no signs of a resolution, and it’s not clear what bills the senators will consider on Sunday. \nObama said “the only thing that’s standing in the way” of the USA Freedom Act “is a handful of senators who are resistant to these reforms.\" \n“This is not an issue where we have to choose between security and civil liberties, this is an issue in which we in fact have struck the right balance and shaped a piece of legislation that everybody can support,” he said. “So let’s go out and get it done.” \nObama's comments came after a meeting with Lynch, in which they discussed cyber security, counterterrorism, and police reforms. Tags: ", "external_links": [], "published": "2015-05-30T00:52:00.000+03:00", "crawled": "2015-05-30T00:52:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}