{"organizations": [], "uuid": "29e996f4229cfb5da8c8e95ce0bd2ecf5cddd2c7", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com/thumb/2015/05/26/un-grupo-de-migrantes-cruza-hacia-mxico-tras-ser-deportados-de-estados-unidos_300x169.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/05/26/corte-federal-de-eu-paraliza-acciones-migratorias-de-barack-obama", "country": "", "title": "Corte federal de EU paraliza acciones migratorias de Barack Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Corte federal de EU paraliza acciones migratorias de Barack Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T01:46:00.000+03:00", "replies_count": 0, "uuid": "29e996f4229cfb5da8c8e95ce0bd2ecf5cddd2c7"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/05/26/corte-federal-de-eu-paraliza-acciones-migratorias-de-barack-obama", "ord_in_thread": 0, "title": "Corte federal de EU paraliza acciones migratorias de Barack Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Corte federal de EU paraliza acciones migratorias de Barack Obama La decisión representa un revés para los millones de migrantes que buscan protegerse de posibles deportaciones en Estados Unidos Martes, 26 de mayo de 2015 a las 17:49 Un grupo de migrantes cruza hacia México tras ser deportados de Estados Unidos (EFE/Archivo). Lo más importante La decisión de la corte federal es una victoria para los grupos conservadores que no quieren un alivio migratorio Evitar deportaciones y aplicar para puestos de empleo, las medidas que impulsa Barack Obama Temas relacionados Obama aplicará veto a iniciativas contra inmigración \nWASHINGTON (CNN) — Una corte federal de apelaciones negó este martes una solicitud de los abogados del Departamento de Justicia que permitiría al presidente de Estados Unidos, Barack Obama, aplicar las acciones controversiales de alivio migratorio, en espera de una apelación. \nLa decisión es una victoria para Texas y otras 25 entidades estadounidenses que han desafiado las acciones de la administración de Obama, bloqueadas por un juez de una Corte de Distrito en febrero. \nLa decisión del martes significa que si bien el tema es apelable, los migrantes que aplicaban para recibir los beneficios de las acciones del plan de Obama, presentado en noviembre pasado, no podrán aplicar a los programas que los protegían contra las amenazas de ser deportados. \n“Debido a que es poco probable que el gobierno tenga éxito en sus méritos de su apelación sobre este mandato judicial, negamos la moción y la solicitud para reducir el alcance de este mandato judicial”, establece el documento sobre la decisión que fue votada por 2-1 en un panel de la Corte del Quinto Circuito de Apelaciones de Estados Unidos. \nEn la línea está la implementación del programa para la aplicación de leyes para los padres indocumentados de estadounidenses y residentes legales (DAPA, por sus siglas en inglés), y el programa de protección de los inmigrantes sin documentos que llegaron a Estados Unidos cuando eran niños (DACA, por sus siglas en inglés). \nAmbos protegían a los migrantes que cubrieran estos requisitos contra posibles deportaciones e incluso les permitiría aplicar a puestos de empleo. \n“Las comunidades de migrantes están decepcionadas por la decisión de hoy, pero no se inmutarán”, dijo Karen Tumlin del Centro Nacional de Leyes para Migrantes. \n“Las acciones para migrantes ayudarán a nuestra economía, nuestra comunidad y nuestras familias. Cada día que este mandato judicial se mantenga en pie, vamos a sufrir las consecuencias”, dijo Tumlin. \nLa decisión del presidente Obama de actuar unilateralmente en noviembre pasado para otorgar beneficios a millones de migrantes en Estados Unidos, provocó la ira de los republicanos que inmediatamente presentaron acciones de inconstitucionalidad contra el presidente. \nAhora los conservadores han librado una batalla en el Congreso para atar los fondos para el Departamento de Seguridad Nacional que haga inviables las acciones de inmigración de Obama. \nLa acción del mandatario estadounidense sobre migración podría beneficiar hasta 5 millones de personas que están en riesgo de ser deportadas en el territorio estadounidense. Encuentra este artículo con: mundo, migrantes, migracion, estados unidos, corte federal apelaciones, barack obama, presidente estados unidos, deportaciones, acciones migratorias, texas Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"6236484d6a074b02899763fe212aa6f7\", \"time\": \"2015-05-26T22:46:13.506Z\" } Video ", "external_links": [], "published": "2015-05-27T01:46:00.000+03:00", "crawled": "2015-05-27T01:46:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}