{"organizations": [], "uuid": "2f8ff23c58ab8213b4e3fbe946306fba194bedb8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2980268/images/o-TEXAS-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/index.xml", "section_title": "WorldPost - The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/23/so-that-happened-texas-abortion_n_7384684.html?utm_hp_ref=world&ir=WorldPost", "country": "US", "title": "So That Happened: How One Texas Bill Could Make It Impossible For Minors To Get Abortions", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "So That Happened: How One Texas Bill Could Make It Impossible For Minors To Get Abortions", "spam_score": 0.0, "site_type": "news", "published": "2015-05-23T14:30:00.000+03:00", "replies_count": 0, "uuid": "2f8ff23c58ab8213b4e3fbe946306fba194bedb8"}, "author": "Jason Linkins", "url": "http://www.huffingtonpost.com/2015/05/23/so-that-happened-texas-abortion_n_7384684.html?utm_hp_ref=world&ir=WorldPost", "ord_in_thread": 0, "title": "So That Happened: How One Texas Bill Could Make It Impossible For Minors To Get Abortions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "So That Happened: How One Texas Bill Could Make It Impossible For Minors To Get Abortions Posted: Updated: 30 minutes ago Texas state Rep. Geanie Morrison proposed a bill making it more difficult for girls younger than 18 to obtain abortions without their parents' consent. (AP Photo/Eric Gay) | ASSOCIATED PRESS reddit \nSo, that happened. On this week's podcast, we look into Texas legislation restricting access to abortion for minors, compare and contrast federal bills aimed at curbing what food stamps can buy with the fact that Congress want us to give them more money, and conclude our conversation from last week on Seymour Hersh's controversial claims about the raid that killed Osama bin Laden. \nListen to this week's \"So, That Happened\" podcast below: \n* * * \nSome highlights from this week: \n“The most insidious part of the legislation is that they also said that the state will presume that everyone seeking an abortion is a minor unless that person shows a valid form of government identification.” -- Samantha Lachman on Texas’ new abortion restrictions \n“Instead of trying to figure out what would be a good thing for people on food stamps to eat, we’re just gonna take the standard from WIC. So it’s a lazy piece of legislation.” -- Arthur Delaney on federal legislation to limit what Americans on food stamps can purchase \n“There are apparently members of Congress who just sort of get by. And it’s a fact that in this modern era, Congress critters are expected to have a domicile in Washington, D.C., or thereabouts and a home back in their district. I’m straining myself to be generous.” -- Jason Linkins on members of Congress asking for a raise \n* * * \nThis podcast was produced and edited by Ibrahim Balkhy and engineered by Brad Shannon, with assistance from Christine Conetta and Adriana Usero. \nTo listen to this podcast later, download our show on iTunes . While you're there, please subscribe, rate and review our show. You can check out other HuffPost Podcasts here . \nHave a story you'd like to hear discussed on \"So, That Happened\"? Email us at your convenience! Also on The Huffington Post Close   While running for president in 2007, former New York Mayor Rudy Giuliani told a reporter at a Montgomery, Ala., supermarket that he estimates \"a gallon of milk is probably about a $1.50, a loaf of bread about a $1.25, $1.30, last time I bought one.\" It must have been a few election cycles since his last trip: The grocery store's website listed milk for $3.38 and bread up to $3.49. During George H.W. Bush's reelection campaign in 1992, Vice President Dan Quayle scoffed at the \"Murphy Brown situation,\" referring to a television character who had a child out of wedlock. Quayle called the Brown story \"totally unreal,\" adding, \"A highly paid professional woman [with a baby] ... give me a break.\" In a display of aloofness that many political observers say led to her defeat by Republican Scott Brown, Democratic Senate candidate and Massachusetts Attorney General Martha Coakley erred in brushing off the idea of ramping up her campaigning. When asked whether she was being too apathetic, she referenced one of Brown's ads and fired back, \"As opposed to standing outside Fenway Park? In the cold? Shaking hands?\" Republican vice presidential candidate Spiro Agnew, branded as Richard Nixon's go-to guy on cities, vowed in 1968 to avoid poor neighborhoods. \"If you've seen one slum, you've seen them all,\" Agnew said. While visiting the Alamo in 1976, President Gerald Ford bit into a tamale through the husk, a faux pas later deemed the \"Great Tamales Incident.\" President George H.W. Bush caught flak for appearing awed by a supermarket check-out scanner while touring a grocers convention in 1992. It turned out the president was being shown a new bar code technology, and the convention worker who was alongside Bush later said it's \"foolish to think the president doesn't know anything about grocery stores. He knew exactly what I was talking about.\" In 2008, President George W. Bush said he had not heard predictions that gas prices could soon hit $4 a gallon. At the time, the national average was $3.29 a gallon. In 2003, Democratic presidential contender John Kerry ordered Swiss cheese on a cheese steak while campaigning in South Philadelphia, straying from the traditional favorite topping, Cheez Whiz. Democratic presidential contender Michael Dukakis tried to one-up Republican opponent George H.W. Bush on national defense by striking a pose in an M1 Abrams tank. Mitt Romney has had his fair share of seemingly out-of-touch statements this election cycle, admitting he likes to \"fire people\" and expressing amazement at the touchscreen ordering system at convenience store Wawa. President Barack Obama is not exempt from the \"gotcha\" moment. In June, he described the private sector economy as \"doing fine.\" The gaffe immediately elicited comparisons with his 2008 Republican opponent, John McCain, who said that the \"fundamentals of the economy are strong\" in the midst of a crippling financial crisis.  Share", "external_links": [], "published": "2015-05-23T14:30:00.000+03:00", "crawled": "2015-05-23T15:06:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}