{"organizations": [], "uuid": "9f6c2e3b057c19bce175840444eed4a5922d6382", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/640medicalmarijuana.jpg", "site_section": "http://www.foxnews.com/health/index.html", "section_title": "Health News | Latest Medical, Fitness, Healthcare &amp; Nutrition News | Fox News", "url": "http://www.foxnews.com/health/2015/05/28/dr-manny-why-need-more-efficient-yet-properly-regulated-medical-marijuana/", "country": "US", "title": "Dr. Manny: Why we need more efficient yet properly regulated medical marijuana research", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Dr. Manny: Why we need more efficient yet properly regulated medical marijuana research | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "9f6c2e3b057c19bce175840444eed4a5922d6382"}, "author": "Manny Alvarez", "url": "http://www.foxnews.com/health/2015/05/28/dr-manny-why-need-more-efficient-yet-properly-regulated-medical-marijuana/", "ord_in_thread": 0, "title": "Dr. Manny: Why we need more efficient yet properly regulated medical marijuana research", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Dr. Manny Alvarez\nPublished May 28, 2015 FoxNews.com livefyre Email Print\nI think that the groundbreaking approach by an anti-legalization group calling for a regulatory way to study medical marijuana under academic supervision is the right way to evaluate the potential use of this highly debated drug.\nThe group, Smart Approaches to Marijuana, appears to be the first of its kind to make moves that would hopefully allow for more efficient research of medical marijuana and its component cannabidiol (CBD).\nSmart Approaches to Marijuana is calling on the government to give more entities than just the University of Mississippi the permission to grow marijuana for federal research purposes. It also is asking the Department of Health and Human Services to eliminate a review process for marijuana research that critics say is needless, and it is calling on the Drug Enforcement Agency (DEA) to also get rid of certain regulatory requirements for CBD research. Proponents of medical marijuana say purified CBD does not contain marijuana’s psychotropic chemical, tetrahydrocannabinol (THC), but the DEA classifies marijuana as a Schedule 1 drug, which falls under the same bucket as heroin, ecstasy and LSD— meaning that researching the drug requires federal approval across multiple fronts.\nWhile the group is calling for fewer barriers to marijuana research— which critics argue is stalling the efficiency of studies that could point to medical benefits from marijuana— we still need to proceed with caution.\nYes, we have an incredible number of studies showing that for certain medical conditions like epilepsy, pain control, and antiemetic effect, medical marijuana seems to be doing a good job in treatment. However, those studies are anecdotal an thus not objective. We still are limited by the knowledge of how the chemical is working and how it affects the physiology of the brain, and more importantly how it can be used in pediatric patients. Equally crucial, we need to figure out the best extraction and dosing methods needed to effectively treat these conditions.\nRight now, the legalization of marijuana is being driven by consumers. And in those 23 states, plus the District of Columbia, where medical marijuana has been approved— and in those four states where recreational marijuana is legal— it is the for-profit market that’s leading the charge in its potential use for medical therapies.\nIn order for us to be ahead of the game, Washington has to create appropriate, easy pathways for genuine scientists to be able to grow, process and study marijuana under institutional board review protocols so that ultimately we will be able to successfully evaluate the benefits and safety of medical marijuana.\nIf the federal government does not do this, then we will continue to have a partially regulated industry that right now seems to be a little bit out of control.\nFollow Dr. Manny on Facebook and subscribe to his YouTube channel for more.\nDr. Manny Alvarez serves as Fox News Channel's Senior Managing Editor for Health News. Prior to this position, Alvarez was a FNC medical contributor. Click here more information on Dr. Manny's work with Hackensack University Medical Center . Visit AskDrManny.com for more.\n Man 2 3 ", "external_links": [], "published": "2015-05-28T03:00:00.000+03:00", "crawled": "2015-05-28T22:45:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}