{"organizations": [], "uuid": "ee0e116dc78bcf6b85cb865d0c1f8c15d471508c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051415_obama_syria_640.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/15/obama-not-drawing-red-line-with-assad-amid-new-allegations-chemical-weapons-use/", "country": "US", "title": "Obama not drawing ‘red line’ with Assad, amid new allegations of chemical weapons use", "performance_score": 2, "site": "foxnews.com", "participants_count": 32, "title_full": "Obama not drawing ‘red line’ with Assad, amid new allegations of chemical weapons use | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T03:00:00.000+03:00", "replies_count": 37, "uuid": "f92590e3b3fbba1bd1b0f74d2f8d57ae73521364"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/15/obama-not-drawing-red-line-with-assad-amid-new-allegations-chemical-weapons-use/#post-0", "ord_in_thread": 0, "title": "Obama not drawing ‘red line’ with Assad, amid new allegations of chemical weapons use", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 15, 2015 FoxNews.com   livefyre Email Print \nPresident Obama does not appear to be drawing any more red lines with Syria’s Bashar Assad amid allegations that his regime has returned to using chemical weapons.\nThe president was asked about the allegations at a press conference Thursday, at the close of a Camp David summit with Arab allies.\nObama said the U.S. is working with international partners to investigate if the Syrian president’s government is dropping chlorine bombs, as alleged.\nIf it is, he said, the U.S. will cooperate with international monitors and Assad's patrons, like Russia, \"to put a stop to it.\"\nObama issued no threat Thursday, open or veiled, of military force.\nThe tone was a sharp departure from when he vowed “enormous consequences” for Assad in 2012 if chemical weapons were used, and drew a so-called red line on the issue. A year later, Obama decided not to order a military response despite evidence the weapons were used. Instead, he struck a deal with Russia for Assad to relinquish his chemical arsenal.\nOn Thursday, Obama asserted that it has been verified that the regime already gave up its chemical weapons.\nHowever, chlorine gas – which Assad’s government is now accused of using -- was not a part of that agreement. Obama gave a nuanced response Thursday, noting that chlorine isn't an internationally banned chemical weapon.\nHowever, he said, “when it is used in this fashion, [it] can be considered a prohibited use of that particular chemical. And so we're working with the international community to investigate that.”\nLast week, others in Obama’s administration called for an immediate U.N. investigation into the \"abhorrent acts\" – without saying what, if any, punishment Assad might face if formally blamed for the string of alleged chlorine gas attacks. \nOne western U.N. diplomat told Fox News the situation has become \"unacceptable\" in Syria. \n\"There is mounting evidence of repeated chlorine attacks,\" the diplomat said. \nCivilians, including children, allegedly have been injured and killed in the latest attacks. In a letter sent last week to the U.N. Security Council from the National Coalition of Syrian Revolution and Opposition Forces, the group cited reports of chlorine gas attacks in the Idlib and Hama areas and urged the creation of a no-fly zone to protect the Syrian people. \n\"In the past two weeks alone, witnesses and medics on the ground in Idlib and Hama governorates reported at least nine separate instances of toxic chemical attacks -- several of them deadly,\" the group wrote. \"... in each instance, barrel bombs loaded with poisonous chemical substances were deployed from Syrian regime helicopters.\" \nThe U.S. has submitted a preliminary draft Security Council resolution that aims to set up a mechanism for determining who is to blame and to hold them accountable. \nA U.S. official told Fox News the Security Council is overdue in addressing \"the need to determine who is responsible\" for the attacks. \"Doing so is critical to getting justice for the Syrian people,\" he said. \nThe Associated Press contributed to this report. \nAdvertisement\nTrending in Politics 1 Feds to return $107G they seized from NC business owner, attorneys say 2 Fox News Poll: Voters believe White House incompetent, US still in recession and ISIS has moved next door 3 ABC’s Stephanopoulos gave $75G to Clinton Foundation without disclosing it, apologizes 4 House GOP strips immigration language from defense bill 5 Senate panel probes ObamaCare aid confusion, as customers learn they owe IRS See all Trends Advertisement", "external_links": [], "published": "2015-05-15T03:00:00.000+03:00", "crawled": "2015-05-15T07:17:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}