{"organizations": [], "uuid": "fde1178af68f213baecc393db73fdee29258b1ca", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/brownsherrod_041523gn.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/senate/242019-brown-tries-to-pressure-obama-on-trade", "country": "US", "title": "Brown tries to pressure Obama on trade", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Brown tries to pressure Obama on trade", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T02:18:00.000+03:00", "replies_count": 0, "uuid": "fde1178af68f213baecc393db73fdee29258b1ca"}, "author": "Jordain Carney", "url": "http://thehill.com/homenews/senate/242019-brown-tries-to-pressure-obama-on-trade", "ord_in_thread": 0, "title": "Brown tries to pressure Obama on trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brown tries to pressure Obama on trade By Jordain Carney - 05/13/15 07:18 PM EDT Sen. Sherrod Brown (D-Ohio) on Wednesday said President Obama should veto a \"fast-track\" trade bill if he doesn't first sign a customs enforcement proposal. “It’s critical that we vote on enhanced trade enforcement before Congress gives up its ability to amend the largest trade deal ever negotiated,” Brown said in a statement. \"The president should veto the fast track bill if he has not yet signed the trade enforcement legislation.\" The Ohio Democrat is part of a coalition of Senate Democrats who staunchly oppose the legislation, which would allow the president to get his trade agreements approved by Congress with a simple majority vote. ADVERTISEMENT His remarks came after leadership struck a deal that will allow for stand-alone votes on a customs and enforcement bill that includes currency manipulation language and a stand-alone package of trade preferences for sub-Saharan Africa, before starting debate on the trade promotion legislation. Brown added that \"by voting on the increased trade enforcement before fast track authority, we can give American workers and American manufacturers a fighting chance. We can crack down on countries that manipulate their currency to give their exports a price advantage over American-made products.\" But it’s incredibly unlikely that Obama would veto the fast-track bill he strongly supports, and the Ohio Democrat's push will likely amount to little more than political posturing. The currency measure also faces opposition in both the House and among administration officials. Even if the measure passes the Senate, the House could choose to bring up its own customs bill, which doesn't include the Senate's currency measure, and force lawmakers to go to a conference committee to hammer out the differences, dragging out the process. And while the White House hasn't explicitly said it would veto the Senate's customs and enforcement legislation if it did manage to reach the president's desk, Press Secretary Josh Earnest told reporters Tuesday that the administration believes \"we have a variety of effective mechanisms already that allow the administration — as we’ve effectively done when it comes to China and Japan — to protect the interest of the United States and our economy when it comes to currency policy.\" Brown's comments follow remarks he made Tuesday implying that Obama's criticism of Sen. Elizabeth Warren (D-Mass.), who also opposes the trade legislation, was sexist. Those remarks quickly placed the Ohio Democrat under the media spotlight, but he brushed off suggestions from the White House that he would apologize.", "external_links": [], "published": "2015-05-14T02:18:00.000+03:00", "crawled": "2015-05-14T03:49:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}