{"organizations": [], "uuid": "9c01837f217889a6402cb9dcd42f8fc87001e4e3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/obamabarack_040715getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed#", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/242851-obama-thanks-senate-for-advancing-trade-bill", "country": "US", "title": "Obama thanks Senate for advancing trade bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama thanks Senate for advancing trade bill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T22:25:00.000+03:00", "replies_count": 0, "uuid": "9c01837f217889a6402cb9dcd42f8fc87001e4e3"}, "author": "esmilowitz@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/242851-obama-thanks-senate-for-advancing-trade-bill", "ord_in_thread": 0, "title": "Obama thanks Senate for advancing trade bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama thanks Senate for advancing trade bill Getty Images By Jordan Fabian - 05/21/15 03:25 PM EDT President Obama on Thursday thanked the Senate for advancing a key part of his trade agenda. The Senate voted to end debate on a fast-track trade bill, handing Obama a major victory and bringing the measure one step closer to passage. “I want to thank the bipartisan group of senators who took a big step forward this morning” on trade, Obama said during a Cabinet meeting at the White House. ADVERTISEMENT Sixty-two senators voted to move forward on the bill, which would give Obama the power to put a 12-nation trade agreement before lawmakers for an up-or-down vote, without amendments that could kill the deal. The vote was close, and the result was only apparent after Sen. Maria Cantwell (Wash.) was assured that Senate Majority Leader Mitch McConnell (R-Ky.) would allow a vote next month on renewing the charter of the Export-Import Bank. The White House has made an aggressive lobbying effort to convince Democrats in Congress to back his trade agenda. Many Democrats oppose fast-track authority; some say new trade deals would ship American jobs overseas. Press secretary Josh Earnest said Thursday the president made a number of calls to lawmakers late last night “to build that bipartisan common ground in support of this proposal.” Obama said the new trade agreement under consideration “is consistent with strong labor standards, strong environmental standards, and access to markets that too often are closed even as these other countries are selling goods in the United States.” “It’s an agenda that is good for U.S. businesses, but most importantly, it is good for American workers,” he added.", "external_links": [], "published": "2015-05-21T22:25:00.000+03:00", "crawled": "2015-05-22T02:21:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}