{"organizations": [], "uuid": "d2a3de085b454e14879de540996acc3e94eb4c3d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3010162/images/o-SHEPARD-FAIREY-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/29/shepard-fairey-obama_n_7469312.html", "country": "", "title": "Shepard Fairey Thinks These Changes Could Help Obama Do More In The White House", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Shepard Fairey Thinks These Changes Could Help Obama Do More In The White House", "spam_score": 0.0, "site_type": "news", "published": "2015-05-29T21:01:00.000+03:00", "replies_count": 0, "uuid": "d2a3de085b454e14879de540996acc3e94eb4c3d"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/29/shepard-fairey-obama_n_7469312.html", "ord_in_thread": 0, "title": "Shepard Fairey Thinks These Changes Could Help Obama Do More In The White House", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nStreet artist Shepard Fairey shot to fame after designing the iconic poster used in then-Senator Barack Obama's 2008 campaign for president. \nBut now, he's questioning whether Obama is living up to the hype. \nWhen Fairey was asked in an interview with Esquire if Obama had lived up to the famous \" Hope \" poster, the artist had a simple answer: \"Not even close.\" \n\"Obama has had a really tough time, but there have been a lot of things that he's compromised on that I never would have expected,\" Fairey said. \"I mean, drones and domestic spying are the last things I would have thought [he'd support].\" \nIn this Monday, Jan. 12, 2009 file photo, Los Angeles street artist Shepard Fairey poses for a picture with his Barack Obama Hope artwork in the Echo Park area of Los Angeles. (AP Photo/Damian Dovarganes) \nFairey noted his issues aren't always with the president. Fairey suggested taking money out of politics and educating the American public to help facilitate positive moves in the White House. \n\"I hate to say Americans are ignorant and lazy, but a lot of them are ignorant and lazy,\" Fairey said. \n\"When you live in a place that has a lot of good things that make life easier, it's easier to take them for granted. But what frustrates me to no end are people who want to blame Obama or blame anything that is something that if they were actually doing anything as simple as voting, it might not be as bad as it is,\" Fairey added. \"There's a lot of finger pointing and very little action and very little research into the dynamics that created the situation that they're unhappy about.\" \nFairey penned an op-ed for The Huffington Post in October 2012, explaining why he chose to vote for Obama. He previously blogged for HuffPost in 2010, where he expressed frustration in the hand Obama had been dealt. \nRead more at Esquire . ", "external_links": [], "published": "2015-05-29T21:01:00.000+03:00", "crawled": "2015-05-29T21:01:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}