{"organizations": [], "uuid": "cd36143334257c2659e47d0dca980a4a507f5ccf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2673340/images/o-ABORTION-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/11/house-gop-late-term-abort_n_7262246.html", "country": "", "title": "House GOP Abortion Bill Requires Doctors To Help Fetus Survive", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "House GOP Abortion Bill Requires Doctors To Help Fetus Survive", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T07:13:00.000+03:00", "replies_count": 0, "uuid": "cd36143334257c2659e47d0dca980a4a507f5ccf"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/11/house-gop-late-term-abort_n_7262246.html", "ord_in_thread": 0, "title": "House GOP Abortion Bill Requires Doctors To Help Fetus Survive", "locations": ["Washington", "DC"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Deborah Jaffe", "MANDEL"], "text": "House GOP Abortion Bill Requires Doctors To Help Fetus Survive Associated Press Updated: 13 minutes ago Anti-abortion activists take part in the annual March for Life rally on January 22, 2015 in Washington, DC. AFP PHOTO/MANDEL NGAN (Photo credit should read MANDEL NGAN/AFP/Getty Images) | Deborah Jaffe via Getty Images reddit \nWASHINGTON (AP) — Doctors performing late-term abortions would be required to take steps to give the fetus the best chance of survival, according to a Republican bill the House plans to debate this week. \nThe legislation requires that if the fetus seems capable of surviving outside the womb, a second, neonatal doctor must be present to provide care and rush it to a hospital. \nThe provisions are part of a broader bill criminalizing most abortions starting at the 20th week of pregnancy. Though the overall measure was described last week by GOP aides and lobbyists, language detailing the efforts required to save the fetus' life was not available until the measure's full text was posted online Monday. \nThat focus on saving the fetus has been hailed by anti-abortion groups, who strongly support the overall legislation. \nGOP leaders added the provisions aimed at saving the fetus' life to a late-term abortion ban bill that was slated for debate in January. They abruptly postponed that debate after Republican women and moderates objected that a rape victim would only be exempted from the abortion ban if she had reported her assault to a law enforcement agency. \nThe new version of the bill drops that requirement and allows rape victims to receive late-term abortions if they receive counseling or medical care — though not from an abortion clinic — within 48 hours of the procedure. The women had complained that requiring a report to law enforcement officials was unduly harsh and could portray the GOP as insensitive toward women. \nAs with the original bill, the measure's other exemptions to the late-term abortion ban include mothers whose lives are in danger and minors who are incest victims and report the assault to law enforcement authorities or agencies that respond to cases of child abuse. Doctors — but not mothers — who violate the law could be subject to fines and up to five years in prison. \nNewly added to the bill is a requirement that the mother sign a consent form acknowledging that an attempt will be made to let her fetus be born alive unless the mother's health would be threatened. In addition, women would be able to bring civil actions against doctors who violate the law, and the federal government would be required to compile statistics on abortions performed under the law. \nRepublican aides and lobbyists say the new bill was written after months of consultations with anti-abortion lawmakers and Republican women who objected to the initial bill. \nHouse debate is scheduled for Wednesday. \nThe measure is likely to be strongly opposed by Democrats and faces a likely veto threat from President Barack Obama, giving it little chance of becoming law. More: ", "external_links": [], "published": "2015-05-12T07:13:00.000+03:00", "crawled": "2015-05-12T07:14:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}