{"organizations": [], "uuid": "75fee4673d6789b30cb6ecc4f68d6b74471d0cf6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/raghida-dergham/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/world/index.xml", "section_title": "WorldPost - The Huffington Post", "url": "http://www.huffingtonpost.com/raghida-dergham/an-opportunity-for-seriou_b_7238588.html?utm_hp_ref=world&ir=WorldPost", "country": "US", "title": "An opportunity for serious negotiations at the meeting between Gulf leaders and Obama", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "An opportunity for serious negotiations at the meeting between Gulf leaders and Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T07:17:00.000+03:00", "replies_count": 0, "uuid": "75fee4673d6789b30cb6ecc4f68d6b74471d0cf6"}, "author": "Raghida Dergham", "url": "http://www.huffingtonpost.com/raghida-dergham/an-opportunity-for-seriou_b_7238588.html?utm_hp_ref=world&ir=WorldPost", "ord_in_thread": 0, "title": "An opportunity for serious negotiations at the meeting between Gulf leaders and Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nRaghida Dergham \nThe meetings between Gulf leaders and US leaders next week will be a historic opportunity for a fundamental turning point in US-Arab relations, that is, if the Gulf leaders negotiate firmly, earnestly, and skillfully. The US political class has become accustomed to be disregardful of Arab visits, as they rely on secret deals behind closed doors and wager on Arab-Western distrust and differences. Things are different this time because of what looks like a Gulf mandate to the new Saudi leadership to present a joint vision for the anticipated shift in the US-Arab relationship, in light of the nuclear deal set to be concluded in late June. The security concerns of the Gulf nations will be strongly present on the agenda of the meeting with US President Barack Obama, who has linked his historical legacy to a deal with the Islamic Republic of Iran. Any attempt to dissuade Obama from his eagerness for a deal with Tehran would draw the ire of the man who does not accept criticism easily and who has no wish to deviate from the path he set with Iran. Any attempt to remind him that he had backed away from his own red line on the 11th hour will be sure to anger him and make him more critical of his interlocutors. Barack Obama is not an easy man, but he is more complicated now on the verge of a nuclear deal with the Islamic Republic of Iran. He has little patience and he has no room for bargaining. For this reason, if the Gulf leaders make sure they understand the general American mood and Obama's mood, they would be able to go to Washington with more confidence in themselves and their choices, and would be in a good position to convince the United States of the benefits of strong mutual relations rather than tell Washington what they need. There is a wide gap between the two sides. Iran is presenting itself to Washington as a strong partner able to defeat the Islamic State group (ISIS) on the ground in Iraq and Syria. Iran's diplomacy speaks the language that addresses US fears, to undermine the international coalition in which the Arab countries have a key role, and to disparage Gulf participation in that coalition as long it is limited to aerial but not ground operations. The Obama administration believes it can exploit the Arab and Iranian preparedness in the strategy to crush ISIS, which in US calculations is now the number one terrorist group. Some in the administration believe the Arab-Iranian rivalry benefits US interests and therefore, there is no need to defuse it. The Gulf leaders will not back away from the anti-ISIS coalition, as this group is an existential threat to them and as it drums up hostility for the Sunnis given that it was Sunnis behind 9/11 and Sunnis behind the unprecedented terror of ISIS. These leaders may find themselves compelled to draft logical and practical proposals to let Obama and Congress know that they are willing to let Iran combat ISIS alone to test its real abilities to defeat ISIS without Sunni participation in the war. It may be worthwhile for Gulf leaders to detail it to the US political and media class how the Gulf and other Arab countries play a role in the war on ISIS, and what would the fate of the war be without Arab and Sunni participation. This would challenge the Iranian claims that Tehran is the partner that is up to the job, and show that Iran would not be able to vanquish ISIS if the Arab countries withdrew from the international coalition. Second, the Islamic Republic of Iran is pretending that it is ready to start a new page in regional security cooperation and build a new joint security system bringing together Iran, Iraq, and the six GCC nations. These claims are music to the ears of the US media class. But the GCC countries are not prepared to dismantle the GCC and replace it with an alternative regional security system that would include Iran and Iraq, because they believe Tehran wants to fragment the only Arab bloc that has real security and economic institutions. The GCC is not in the Iranian interest. Furthermore, the regional security system being sought by Iran is for Tehran a gateway that would achieve two main things: First, crowning Iran as the primary actor in relation to Gulf security, especially after international recognition of its nuclear importance. Second, replacing the US security relationship with the GCC countries with a US-Iranian relationship that would strengthen Iran. Accordingly, the Gulf leaders must be armed with explanations to give to the American political and media class the pitfalls of Iranian proposals and the reasons why they are opposed to them, with political realism. It is clear that the United States and the European countries are gearing up to benefit from the new nuclear reality - following a deal with Iran - to conclude deals for \"protecting\" against the sense of superiority Tehran will feel following a final deal. For this reason, President Obama wants to renew efforts to develop a missile shield for the Gulf. The US military industry is ready to take advantage, and so are the European military industries, especially those of France. Indeed, France wants to benefit from the Gulf détente with French President Francois Hollande, who attended a summit with Gulf leaders recently. The oil and construction industries are also preparing themselves. Lifting the sanctions on Iran is also tempting for Wall Street, as much as it is tempting for European oil companies. None of them want to let Russian, Chinese, Indian, or Brazilian companies benefit by themselves. The language of interests is prevailing now in conjunction with the political and nuclear negotiations. In the past, the Gulf leaders rushed to appease through commercial and military contracts. Perhaps, this time, they are going to Washington in a more prudent mood, linking strategic matters to commercial matters in the Gulf region and beyond, for example in Syria. Gulf leaders, particularly Saudi leaders, see the Iranian objectives as part of a regional project that affects Arab national security, starting with Saudi Arabia through its borders with Yemen, and not ending with Iraq, Lebanon, and Syria. The Gulf leaders are aware that the six negotiating parties in the P5+1 framework with Iran complied with the Iranian insistence on not discussing regional issues and focus the talks on nuclear issues exclusively. For the record, the Iranian position and the US position in the negotiations were the opposite of the positions that prevailed later. In other words, Tehran did not want to discuss regional issues in the beginning, but the US and the Europeans were opposed to this. Accordingly, the United States, Russia, China, Britain, France, and Germany focused on nuclear negotiations and refused to discuss regional Iranian actions from Iraq to Syria, Lebanon, and Yemen. Now, some of these countries are trying to address this mistake and say that it's not too late. There are two opinions regarding this issue: one opinion that says the window for a 'grand bargain' has closed and that there is no room for anything now except for some \"patching up\" here and there. The other opinion holds that now is the right time to fix the mistake, especially since Tehran has reached the last stop and is desperate for a deal. Consequently, now is the time for grand tradeoffs and even a grand bargain is not yet too late. Syria is a major part of the bargaining, which is why the Syrian issue has returned to the fore. On the battlefield, the balance of power is not in the regime's favor. Politically, UN Envoy Staffan De Mistura has been making new proposals, including for talks in Geneva to which he invited all opposition leaders as well as Iran. Tehran may celebrate the fact that it was invited despite Gulf reservations against giving Iran a say on Syria's fate as it is a party to the civil war there. However, Iran today is under the microscope. Recall that Iran had rejected from the outset the Geneva 1 communique calling for establishing a transitional governing body in Damascus. Therefore, when the Gulf leaders raise the Syrian issue with Obama at Camp David, they will have ammunition at their disposal based on the fact that Iran had circumvented the reference framework for a political settlement in Syria. If the Gulf leaders bend in the direction of half-solutions and half-promises to the Syrian opposition in footsteps of the Obama administration, then the Gulf positions will not be taken any seriously and the operation in Yemen would have no regional payoff. But if they show determination, then the payoff in Syria could be great in the context of curbing Iranian regional ambitions. On Yemen, it will not be difficult to highlight the Gulf positions, particularly the Saudi position. Just like the Obama administration wants to contain the Yemeni crisis, Riyadh do wants an exit strategy for Yemen so that it does not become a quagmire for the Saudis that the Iranian leadership that backs the Houthis would sit and watch with glee. Here. The Gulf leaders can insist that the Obama administration can truly make Tehran understand firmly that the time has come for Iran to end meddling in Yemen and using the Houthis to provoke a war of attrition that would be destructive for the Yemeni people. The Gulf leaders can stress that the Arab alliance will not back down in Yemen no matter how arrogant Iran acts, because the events in Yemen for the Arab powers marks \"enough is enough.\" What about at the nuclear level? Gulf leaders may come to Washington hoping that Congress would side with them in opposing a nuclear deal that gives Iran a strategic edge and billions of dollars to achieve its nuclear ambitions and expand in the region. It is best for these leaders not to place all their eggs in one basket. It is best also for them not to appear as though they are interfering in internal US policy. What the fate of the nuclear deal will boil down to is lifting sanctions and re-imposing them in case Tehran breaks its promises regarding not pursing military nuclear capacity, and the mechanism of supervision to prevent the conversion of peaceful nuclear capacity to military nuclear capabilities. Both are being drafted. If the Gulf leaders bring more complaints to US policymakers about Iranian \"treachery\" and \"malice\", this will fall on deaf ears in Washington. If the leaders go to Washington carrying careful questions and insist on having answers regarding these aspects of the nuclear deal, they would be letting Washington know they are unwilling to content themselves with smooth talking and \"reassurances\" and insist on strategic guarantees rather that distraction meant to keep them away from shaping the future of the region. Translated by Karim Traboulsi \nFollow Raghida Dergham on Twitter: www.twitter.com/raghidadergham More: Click here to view Conversations Conversations", "external_links": [], "published": "2015-05-08T07:17:00.000+03:00", "crawled": "2015-05-08T08:06:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}