{"organizations": ["Fox News", "Obama White House"], "uuid": "2baafa6ce19e0e4a69b1337380929c1828d63e12", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/112513/0/0/anr_pastor_112513.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/11/25/obama-white-house-betrays-american-pastor.html", "country": "", "title": "Obama White House betrays an American pastor | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama White House betrays an American pastor | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "2baafa6ce19e0e4a69b1337380929c1828d63e12"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/11/25/obama-white-house-betrays-american-pastor.html", "ord_in_thread": 0, "title": "Obama White House betrays an American pastor | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nThe Obama administration has left an American pastor behind. \nIn its quest for a “ deal ” with the hostile, jihadist Iranian regime, The Obama administration has thrown an American Christian, Saeed Abedini, under the bus – the latest American victim in the administration’s continual, naïve (at best) quest to bargain with Islamic radicals. \nLet’s go to the scorecard: A part of this “deal,” Iran not only gets to keep its centrifuges (key equipment in the quest to build nuclear weapons) but is permitted to continue enriching uranium. \n[pullquote] \nIt also gets billions of dollars in sanctions relief and unspecified humanitarian aid from the West. More On This... What is the administration doing to help Saeed Abedini? \nWhat does America get? \nIranian promises. Promises that they won’t enrich over a certain threshold and promises that it will dismantle a modest amount of previously-enriched uranium. \nThese promises would have been easier to believe had Iran taken at least one concrete step to demonstrate good faith -- by releasing an American pastor -- a U.S. citizen -- whom it has held and tortured for more than a year, tortured because of his Christian faith. \nPastor Saeed Abedini, an Idaho resident, last year received permission to enter Iran to help build an orphanage. \nShortly after his arrival, Iran’s radical Revolutionary Guard arrested him, threw him in one of Iran’s worst prisons, and tried and convicted him on trumped-up “national security” charges – charges that had nothing to do with national security and everything to do with his Christian faith. \nEven after President Obama raised Pastor Saeed’s case directly to the Iranian President Hassan Rouhani, Iran responded not by releasing Saeed but by transferring him to an even worse prison -- a prison full of murderers and rapists, where his life is in danger at every moment. \nThe Iranian regime rebuked the president of the United States, and we’re now supposed to believe it’s acting in good faith? \nPresident Obama is now trying to spin our stunning act of weakness as a breakthrough for peace. In fact, we were so weak that (according to the administration) that the State Department did not even raise Pastor Saeed’s during the nuclear negotiations. \nFox News asked an administration spokesman why Pastor Saeed was not part of the agreement, and the spokesman responded: “The P5+1 talks focused exclusively on nuclear issues.” \nThis is self-evidently false. Even the administration’s own fact sheet on the agreement describes how the U.S. will not only ease the sanctions directly related to Iran’s nuclear program but also facilitate additional “humanitarian transactions” that are not related to the sanctions regime. \nWhy couldn’t we demand that Iran “facilitate” its own “humanitarian transaction” by releasing an American pastor (and all other Americans held in Iran) back to his wife and two young children? \nThis is an unconscionable betrayal and leaves the American people with no choice but to believe that Iran is unchanged – still our hostile enemy, ready to kill or imprison our people at every opportunity. \nIran’s record of wrongdoing is long and sordid . \nBeginning with the 1979-1981 hostage crisis, moving through repeated terrorist attacks – from the deadly Marine Barracks bombing in 1983, to the Kobar Towers bombing in 1996, to the direct intervention of Iran’s Quds force against American forces in Iraq – and including ongoing deadly support for terrorists fighting American forces in Afghanistan, Iran has proven by its deeds and words that it is America’s enemy. \nIf Iran had released Pastor Saeed we would have at least one concrete action to give Americans confidence that this deal was anything other than a disaster. Instead, we are left with nothing but “ commitments ” from a regime that has proven itself committed only to killing and imprisoning Americans. \nTo make matters even worse, we have squandered a position of strength. \nIran was suffering under sanctions that were finally beginning to truly bite -- wrecking its economy and causing deep discontent within Iraq. This was our opportunity to drive a hard bargain, to reach a deal that didn’t depend solely on Iranian “commitments.” \nBut we squandered that opportunity and left an American behind. \nThe Obama administration has betrayed Pastor Saeed. \nJay Sekulow is Chief Counsel of the American Center for Law and Justice (ACLJ), which focuses on constitutional law. He is a New York Times bestselling author. Jay's latest book \" UNDEMOCRATIC: How Unelected, Unaccountable Bureaucrats Are Stealing Your Liberty and Freedom \" will be published on May 19. He hosts \"Jay Sekulow Live\" -- a daily radio show which is broadcast on more than 850 stations nationwide as well as Sirius/XM satellite radio. Follow him on Twitter @JaySekulow . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:09:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}