{"organizations": [], "uuid": "a497a9c39dd45d21cc15fe8d18932cc800edc3d8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051315_sr_kurtz_640.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/14/russian-spanish-language-ads-fueling-drivers-license-fraud-in-vermont/", "country": "US", "title": "Does Obama want better reporting, or just more favorable coverage?", "performance_score": 5, "site": "foxnews.com", "participants_count": 1, "title_full": "Does Obama want better reporting, or just more favorable coverage?", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T14:25:00.000+03:00", "replies_count": 0, "uuid": "ab1667c86eb20f94c5281251d3976763866b9a59"}, "author": "Howard Kurtz", "url": "http://www.foxnews.com/politics/2015/05/14/does-obama-want-better-reporting-or-just-more-favorable-coverage/", "ord_in_thread": 0, "title": "Does Obama want better reporting, or just more favorable coverage?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama wants to change the way the media cover issues. \nHe thinks there’s not enough substance. \nIf there was more substance, he says, it would help change the minds of Republican leaders. \nWhich doesn’t sound like the media’s job. \nBesides, he sort of undercut his point about a more bipartisan approach to helping the poor by throwing a hard jab at Fox News. He just couldn’t help himself. \nLook, when this president turns media critic, which is often, he makes some valid points. They are points that I have made, and other media analysts have made, for years. \nThe media focus on politics over substance. They swarm over an issue when there’s a big crisis—Tuesday’s Amtrak crash in Philadelphia, last month’s Baltimore riots, a mining accident or bridge collapse—and then demonstrate their short attention span by quickly moving on. They get too wound up in the flap of the day—Obama calling Sen. Warren “Elizabeth” in their trade battle, as if that was some sexist slam—and, especially on television, have difficulty grappling with complexity. \nBut what Obama said at a Georgetown conference on poverty was this: \n“And so if we're going to change how John Boehner and Mitch McConnell think, we're going to have to change how our body politic thinks, which means we're going to have to change how the media reports on these issues and how people's impressions of what it -- what it's like to struggle in this economy looks like and how budgets connect to that. And that's a hard process because of -- that requires a much broader conversation than typically we have on the nightly news.” \nAll presidents want broader conversations on issues close to their heart. But should this one be telling journalists he wants to change the way they report so as “to change how John Boehner and Mitch McConnell think”? That, sir, is not our job. \nIt's important to note that the media have done important and substantive reporting on such matters as ObamaCare, the Pacific trade deal, bogus VA waiting lists and Secret Service failures--much of which hasn't been to the administration's liking. \nAnd the White House doesn’t make our task easier by limiting press access to certain events, posting its own videos and rarely granting presidential interviews to beat reporters—while Obama chats up either BuzzFeed and YouTube personalities or liberal commentators such as Chris Matthews, Vox’s Ezra Klein and New York Times columnist Tom Friedman. \nWhite House officials yesterday declined to provide examples of what the president had in mind when he slapped Fox for portraying the poor as lazy folks who just want free Obamaphones (under a federally subsidized phone access program). But there was a strong rebuttal from the host of MSNBC’s “Morning Joe.” \n“Saying that Roger Ailes and Roger Ailes' network calls people leeches, sponges, and lazy, at a summit that’s supposed to bring both sides together on poverty, is stunning to me,” Joe Scarborough said, adding: “Is he really the sole arbiter of what is right and just? Is he the only one who cares about the poor?” \nMoments before his complaint about Fox, Obama talked about “what used to be racial segregation now mirrors itself in class segregation and this great sorting that’s taking place. Now, that creates its own politics. Right? I mean, there’s some communities where not only do I not know poor people, I don’t even know people who have trouble paying the bills at the end of the month. I just don’t know those people. And so there’s a less sense of investment in those children.” \nI don’t think the media do a great job of covering class segregation or problems of low-income folks that have unfolded over decades, for reasons ranging from government policies to family dysfunction. But in the way he asked for a change in media reporting as he made his case, the president sent a signal, perhaps unintentionally, that he wants the news business to help build support for his policies. \nClick for more from Media Buzz. media-buzz \nMedia Buzz , hosted by Howard Kurtz, airs on Sundays at 11AM and 5PM ET on Fox News Channel.", "external_links": [], "published": "2015-05-14T14:25:00.000+03:00", "crawled": "2015-05-14T15:32:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}