{"organizations": ["Supreme Court"], "uuid": "604349344c64eadf0219d30409524f5893887dee", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/fn_latino_128x128.png", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/news/2015/05/27/obama-will-not-seek-supreme-court-protection-on-immigration-measures/", "country": "IL", "title": "Obama will not seek Supreme Court protection on immigration measures", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama will not seek Supreme Court protection on immigration measures", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T01:51:00.000+03:00", "replies_count": 0, "uuid": "604349344c64eadf0219d30409524f5893887dee"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/05/27/obama-will-not-seek-supreme-court-protection-on-immigration-measures/", "ord_in_thread": 0, "title": "Obama will not seek Supreme Court protection on immigration measures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama will not seek Supreme Court protection on immigration measures   EFE \nThe U.S. administration will not seek Supreme Court protection to carry out President Barack Obama's immigration measures designed to normalize the status of five million undocumented foreigners, which he announced six months ago but the implementation of which a court temporarily put on hold. \nThe Department of Justice announced in a communique that, instead of resorting to the high court, the government will focus on fighting for immigration relief at a hearing scheduled for July 6 in the 5th Circuit Court of Appeals in New Orleans, where all the court judges are scheduled to study the case. \nIn a vote of 2-1, three magistrates of the appeals court decided on Tuesday to decline an urgent government appeal and maintain the suspension of the measures, as per the February ruling of Texas federal Judge Andrew Hanen at the behest of 26 mostly Republican states headed by Texas. \n\"The Department of Justice is committed to taking steps that will resolve the immigration litigation as quickly as possible in order to bring greater accountability to our immigration system by prioritizing deporting the worst offenders, not people who have long ties to the United States and who are raising American children,\" said Justice Department spokesman Patrick Rodenbush. \nHe said the best way to do that would be to argue the case on its merits before the New Orleans appeals court, which is considered to be one of the most conservative courts in the country. \nAlthough Judge Hanen suspended implementation of Obama's measures in February, the Justice Department appealed that ruling, arguing that the measures should be implemented while the lawsuit by the 26 states proceeds. However, the appeals court on Tuesday refused to grant that request. EFE", "external_links": [], "published": "2015-05-28T01:51:00.000+03:00", "crawled": "2015-05-28T02:06:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}