{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "6149b4095820b1640135d2cfdc27933c27c2b16e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/10/04/despite-cancelled-asia-trip-obama-must-pay-attention-to-china-game-chicken/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422641252702.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/04/despite-cancelled-asia-trip-obama-must-pay-attention-to-china-game-chicken.html", "country": "", "title": "Despite cancelled Asia trip, Obama must pay attention to China's game of chicken | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Despite cancelled Asia trip, Obama must pay attention to China's game of chicken | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "6149b4095820b1640135d2cfdc27933c27c2b16e"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/04/despite-cancelled-asia-trip-obama-must-pay-attention-to-china-game-chicken.html", "ord_in_thread": 0, "title": "Despite cancelled Asia trip, Obama must pay attention to China's game of chicken | Fox News", "locations": ["Malaysia", "Malaysian", "Putrajaya", "Asia", "Kuala Lumpur", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jinping", "Najib Razak", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print Oct. 4, 2013: Chinese President Xi Jinping speaks during a join press conference with Malaysian Prime Minister Najib Razak in Putrajaya, outside Kuala Lumpur, Malaysia. Xi is on a three-day visit aimed at deepening diplomatic and trade ties between the two countries. (AP Photo/Vincent Thian) \nWith the president’s decision to cancel this weekend’s trip to Asia and miss both the Asia-Pacific Economic Cooperation (APEC) summit and the East Asia Summit, it’s useful to remind ourselves that the key reason for that trip was to reinvigorate the administration’s planned “pivot” to Asia. \nThose plans had lost crucial momentum because of the ongoing problems in the Middle East. Indeed, no sooner did President Obama announce a desire to “pivot” America’s strategic focus from the Middle East to East Asia than turmoil in Egypt and Syria, and the continuing threat from Iran, showed that the United States cannot opt out of one of the world’s most vital regions. \nBut if problems at home and the Middle East are preoccupying the president, the reason for the pivot -- the rise of a problematic China -- has not gone away. If anything, the challenge posed by Beijing is growing. \nThe past year has seen increasingly aggressive behavior on the part of the Chinese navy and coast guard over the Senkaku island chain in the East China Sea. \n[pullquote] Is an aggressive China risking US influence in Asia? \nChinese vessels have made incursions into Japanese-controlled waters both with greater frequency and for longer periods of time. And the Japanese air force has had to scramble its fighter jets scores of times to head off Chinese military aircraft as they head toward Japanese air space. \nChina is playing a game of great-power “chicken”-- except it’s no game. The risk of miscalculation and conflict is real. \nMeanwhile, in the South China Sea -- over much of which Beijing has laid claim with only the slightest pretense of justification -- Beijing is moving to assert control over the Scarborough Shoal, an area just 124 nautical miles off the shores of the Philippines and clearly within that country’s Exclusive Economic Zone (EEZ). \nOver the past year, China has used armed vessels to keep Philippine fishermen from entering the Shoal’s waters and, now, according to the Philippine government, is beginning to build a Chinese structure there. \nThis tactic is not new. In the mid-90s, China claimed Mischief Reef -- another area well within the Philippines EEZ -- and built a structure supposedly for fishermen seeking protection from storms, which ultimately morphed into a quasi-military installation. As Manila notes, China is once more engaging in a “creeping invasion” of its country. \nChina’s behavior at home poses another challenge to U.S. strategy for the region and President Obama’s call, in a 2011 much-noted speech to Australia’s parliament, for “free societies, free governments, free economies, [and] free people.” \nCommunist Party General Secretary Xi Jinping, whom many hoped would be a reformer, has instead pursued a classic communist agenda. In April, a memo from the Communist Party’s Central Committee to its cadres warned of the perils of “Western constitutional democracy,” “universal” human rights, media independence, and “nihilist” criticisms of the Party’s past rule. \nXi’s cosmetic anti-corruption campaign is another sign of the direction of Chinese governance. Xi has told senior cadres to tone down visible excesses, such as ostentatious 10-course banquets. But, at the same time, he is using corruption prosecutions as a way to eliminate rivals and shore up his own power and the Party’s control. \nXi and his fellow Communist leaders are worried, first and foremost, about keeping control. Since Xi consolidated his power in March by becoming China’s president, dozens of activists have been arrested, including anti-corruption activists associated with the New Citizens’ Movement whose “crime” has been to seek disclosure of officials’ wealth. \nDuring interrogation by police, one of the leaders of the movement, Xu Zhiyong, was told that the authorities feared their efforts to achieve the rule of law and transparency would lead to “chaos and instability.” \nThat is also how the Party views the freedom of speech movement advanced by the Internet and social media. \nAccording to a decision from China’s politically supervised Supreme Court, a message that is reposted more than 500 times or viewed more than 50,000 times could be considered illegal. And there is an ongoing crackdown on popular bloggers. \nAmong the first victims of this new crackdown was a Chinese teen from northwest China who was detained for posting questions online about the suspicious death of man who fell from the upper floor a karaoke club. Local security officials claimed the teen’s post were “seriously disruptive of social order.” \nWhile the U.S. is preoccupied with the Middle East, China’s leaders are pursuing an agenda directly at odds with the advance of democracy and stability -- America’s chief objectives in the region. \nNone of this is meant to suggest that the administration should once again try and turn its back on the Middle East. But President Obama has laid out an agenda for Asia that risks being undermined by China’s recent behavior both at home and abroad. \nMoreover, with repeated assurances from both the president and members of his national security team that the U.S. was “rebalancing” its efforts in Asia, the president has implicitly drawn a “red line” of sorts for our friends and allies in the region. \nA failure to fulfill the pledge of meeting the Chinese challenge either by inaction, inattention or by simply canceling trips will be just as serious when it comes to American credibility as failing to respond effectively to Syria’s use of chemical weapons. \nBeing a global leader, with global interests, requires more than handling today’s front-page news. The United States has to be able to carry out effective policies in two vital regions of the world at the same time -- if it doesn’t want to face even more difficult problems in the days ahead. \nEllen Bork is director of Democracy and Human Rights at the Foreign Policy Initiative. \nGary Schmitt co-directs the Marilyn War Center for Security Studies at the American Enterprise Institute . For more, visit aei.org . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:10:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}