{"organizations": ["Supreme Court"], "uuid": "4ac251307c7e645bb4cf77c2656b92c835c2b3e5", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/05/10/it-time-for-president-obama-and-justice-thomas-to-talk/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422550513179.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/10/it-time-for-president-obama-and-justice-thomas-to-talk.html", "country": "", "title": "It's time for President Obama and Justice Thomas to talk | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "It's time for President Obama and Justice Thomas to talk | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "4ac251307c7e645bb4cf77c2656b92c835c2b3e5"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/10/it-time-for-president-obama-and-justice-thomas-to-talk.html", "ord_in_thread": 0, "title": "It's time for President Obama and Justice Thomas to talk | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clarence Thomas", "Thomas", "Obama"], "text": "President Obama, Supreme Court Justice Clarence Thomas (AP) \nPresident Barack Obama is the most powerful black man in America. \nSupreme Court Justice Clarence Thomas is the second most powerful black man in America. \nI know both men. It is fair to describe Justice Thomas as an introvert. It is fair to say President Obama is very reserved, often criticized for being too “cool,” and never showing anger. \nDespite their common reserve it is shocking to hear Justice Thomas say he has never had a conversation with President Obama. \n[pullquote] \n“I shook hands with him at the inauguration to be polite but I’ve had no in depth conversation,” Justice Thomas said in April during an interview that originated from Duquesne Law School and was nationally televised on C-Span. \nThese two black men occupy center stage in this era of American history. They are the face of black liberalism and the face of black conservatism. \nAnd as a matter of history, there has never been a black president and black man serving on the Supreme Court at the same time. \nNeither man had a role in the civil rights movement of the 50s and 60s. Both are highly educated lawyers. Thomas graduated from Yale Law School and Obama from Harvard Law School. Both chose public service work and turned away from seeking top pay in American law firms that to this day remain highly segregated. \nBoth men struggled with absent fathers, an all too common affliction in black America, and were largely raised by grandparents. \nBoth men have been the targets of bitter attacks by white critics. Thomas has been maligned by white liberals as a puppet of fellow conservative Justice Antonin Scalia and for alleged sexual harassment. \nWhite conservative critics similarly mock President Obama. They allege he is not Christian, supposedly not being born in the U.S., and even a socialist. \nWith so much in common it is incredible that these two have never had dinner, held a private conversation, or debated. \nIn his interview Justice Thomas did deliver what one critic called a “subtle jab” by saying he knew the first black president would fit the bill for liberal elites. \nThe Justice said the first black president had to be someone “approved by the elites and the media because anybody that they didn’t agree with, they would take apart… And that will happen with virtually -- you pick your person, any black person who says something that is not the prescribed things that they expect from a black person will be picked apart. You can pick anybody, don’t pick me, pick anyone who has decided not to go along with it; there’s a price to pay. So, I always assumed it would be somebody the media had to agree with.” \nOn the other hand liberals say Justice Thomas is under control of conservative elites and refuse to see him as his own man, an independent jurist. \nIn a 2008 interview with Rev. Rick Warren, then-candidate Obama said, \"I would not have nominated Clarence Thomas…I don't think that he was a strong enough jurist or legal thinker at the time for that elevation. Setting aside the fact that I profoundly disagree with his interpretations of a lot of the Constitution.\" \nThe two obviously have their differences. But the lack of contact between two major black leaders of their time is unprecedented. \nFrederick Douglass, the former slave who became a leading abolitionist and pressured President Lincoln to end slavery, met with Sojourner Truth. \nDouglass and Truth did not get along. \nHe viewed her as “uncultured.” She viewed him as lacking spiritual faith. After listening to a Douglass speech she got up and famously asked “Is God Gone?” \nW.E.B. DuBois, an integrationist and one of the founders of the NAACP, spoke with Booker T. Washington, a man who viewed racial integration as secondary to creating stronger black institutions, especially segregated schools for blacks. \nAt times the two had major disagreements, especially over what white America owed black people coming out of slavery. But they acknowledged each other as sincerely trying to improve life for their fellow black Americans. DuBois called Washington “the greatest Negro leader since Frederick Douglass and the most distinguished man to come out of the south since the Civil War.” \nDr. Martin Luther King Jr. and Supreme Court Justice Thurgood Marshall spoke several times, even though Marshall viewed King as not much more than a good speaker. \nJustice Marshall saw King as stirring up racial confrontations that interfered with Marshall’s legal struggle to get equal rights under law accepted by white judges, juries and legislators in Congress. But the two knew each other. Marshall even warned King about FBI wiretaps. \nMalcolm X, an advocate of black power who never subscribed to non-violence, met the apostle of non-violent protest, Dr. King. Their one meeting took place by chance while they were in Washington to watch Congressional debate over the 1964 Civil Rights Act. \nThere is a famous picture of them at the U.S. Capitol. The “Yin and Yang deep in the soul of black America,” as one writer described the pair, never had an extended conversation. \nBut Malcolm X did make a trip south to speak in support of King while King was in jail. He told King’s wife he came because “if the white people realize what the alternative is, perhaps they will be more willing to hear Dr. King.” \nYet now, at the start of the 21st Century, the two most powerful black voices in the nation are silent to each other. \nAt a time of dynamic racial change in the country and as black people face major issues --- from family breakdown, to a growing internal divide along class lines as well as the crippling failure of schools and high rates of incarceration -- this pair of brilliant men act as if the other does not exist. \nIt is time to bring Justice Thomas and President Obama together for a conversation. I propose to set it up and moderate a conversation with these American leaders on Fox News Channel. Let’s urge them to do it. \nJuan Williams is a co-host of FNC's \"The Five,\" where he is one of seven rotating Fox personalities. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}