{"organizations": ["U.N.", "Republican", "Congress", "General Assembly", "U.N. General Assembly", "Israeli Cabinet", "Likud", "Palestinian Authority", "Jerusalem Fund Aish Ha Torah", "Washington Institute", "Brookings Institution", "State", "White House", "House", "Knesset", "United Nations", "U.S. House Government Reform Committee", "U.S. Congress", "Zionist Union"], "uuid": "142a43d6182b8a9a9cb4ffe53fa8b769df07d43d", "thread": {"site_full": "edition.cnn.com", "main_image": "", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss\r", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/05/07/football/pele-hospitalized-brazil/index.html", "country": "US", "title": "No Obama reset with Netanyahu's new coalition", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "No Obama reset with Netanyahu's new coalition", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "b2d115c072e45157dfdfc98d656536f1475febd9"}, "author": "", "url": "http://edition.cnn.com/2015/05/07/politics/benjamin-netanyahu-coalition-obama/index.html", "ord_in_thread": 0, "title": "No Obama reset with Netanyahu's new coalition", "locations": ["United States", "Iran", "Gaza", "West Bank", "Entebbe Airport", "Israel", "London", "Caesarea", "California", "Jordan", "Judean Desert", "Middle East", "Tel Aviv", "Washington", "U.S", "Madrid", "Uganda", "Sayeret Matkal", "Israeli", "Likud-Beiteinu", "Near East Policy", "Egypt", "New York", "U.S.", "U.S. Middle East", "Beverly Hills", "Egyptian", "Sharm El-Sheikh", "Jerusalem"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sachs", "Barack Obama", "Hassan Rouhani", "Bill Clinton", "Avner", "Madeleine Albright", "Benjamin Netanyahu", "David Makovsky", "John Kerry", "Annan", "Elyakim Rubinstein", "Shimon Peres", "Hillary Clinton", "Miriam", "Mahmoud Abbas", "Netanyahu", "David Levy", "Abbas", "Hassan", "Kofi Annan", "Yonatan", "Douglas", "Natan Sachs", "Arafat", "Hussein", "Kirk Douglas", "Tzipi Livni", "Aaron David Miller", "Abdullah II", "Saeb Erakat", "Yasser Arafat", "Makovsky", "Ariel Sharon", "Obama", "Avigdor Lieberman", "Hosni Mubarak", "David Cameron", "Sara", "Isaac Herzog", "Yitzhak Shamir", "Zalman Shazar", "Nachum Braverma", "Sorin Hershko", "Shamir", "Herzog", "Noa"], "text": "Netanyahu forms new coalition government in Israel 02:41 Washington (CNN) Israeli Prime Minister Benjamin Netanyahu has finally got his government. But a last minute shakeup is leaving him with a brittle coalition that could pull him further to the right on the very issues that have been at the center of Israel's tensions with the United States. Netanyahu announced a 61-member coalition cobbled together hours before the deadline to form a new government Wednesday night -- the narrowest majority possible in the 120-member Israeli parliament, the Knesset. READ: Obama and Netanyahu: A clash of world views, not just personalities Netanyahu called the coalition a \"beginning\" on Wednesday, signaling that he would look to broaden the nascent government. But for now -- and likely the foreseeable future -- Netanyahu is stuck with a slapdash majority that could set him up for more confrontation with the Obama administration on issues like settlement building and the Israeli-Palestinian peace process. That's because, to make a coalition deal before the deadline expired, Netanyahu had to concede more power to the right-wing Jewish Home party. The faction is one of the strongest proponents of settlement-building and annexing parts of the West Bank, territory on which Palestinians hope to establish their own independent state, and the party will now control several key ministries. The other parties joining Netanyahu's Likud, all on the right, range from a center-right group of Likud defectors focused on economic issues to religious parties. The Jewish Home's big influence won't help Netanyahu's efforts to mend relations with the White House. Ties, never strong between the Israeli leader and his American counterpart, soured this spring after the prime minister warned of the dangers of Obama's negotiations with Iran in a speech to Congress, made a disparaging comment about Israeli Arabs in the final days of his campaign and even refuted his support for a two-state solution -- a disavowal he quickly walked back after surging to victory on the wings of strong right-wing support. Policies that anger the White House? The question now is whether Netanyahu can hold his coalition together without increasing settlement activity and angering the Obama administration, or if an emboldened right wing will bring him further to their side. Because the coalition is so narrow, any member of the ruling coalition can threaten to bring down the government if he or she jumps ship and joins the opposition. \"I don't see the coalition fundamentally altering what is already an extremely tense and corrosive relationship between the prime minster and the president,\" said Aaron David Miller, a former U.S. Middle East negotiator who served in Democratic and Republican administrations. \"But the continuation of what I call this cold war or this kind of soap opera with very little predictability... that's going to continue.\" He pointed to the role of Jewish Home as a particular source of added tension. Jewish Home is among those in the new coalition making the prospect of an Israeli-Palestinian peace deal -- long a central aim of the White House -- much less likely. With so many in the new Israeli government skeptical of the need to pursue negotiations, the Palestinians are also less likely to return to the negotiating table. They are already ratcheting up their efforts to make a press for statehood at the United Nations -- a press the U.S. has indicated would become increasingly difficult to stave off unless Israel takes new steps toward a peace agreement. The Palestinian Authority leadership quickly seized on news of the coalition's makeup to make its case that Israel is not a willing peace partner and that Palestinians need to intensify their efforts to forge a state through international organizations. \"Congratulations Israel, your new government has ensured that peace is not on their agenda. This new right-wing, extremist government is not a partner for peace,\" chief Palestinian negotiator Saeb Erakat said in a statement. \"We call on the international community to safeguard the two-State solution by stop treating Israel as a state above the law, support Palestinian rights and diplomatic initiatives.\" Netanyahu's life in pictures 38 photos Netanyahu's life in pictures 38 photos Israeli Prime Minister Benjamin Netanyahu speaks in Jerusalem during a weekly Cabinet meeting in November 2013. Click through to see more photos from his life and career. Hide Caption 1 of 38 Netanyahu's life in pictures 38 photos Netanyahu, right, sits with a friend at the entrance to his family home in Jerusalem on July 1, 1967. The Israeli prime minister was born October 21, 1949. Hide Caption Netanyahu's life in pictures 38 photos Netanyahu, right, with a friend in the Judean Desert on May 1, 1968. Hide Caption 3 of 38 Netanyahu's life in pictures 38 photos Netanyahu serves in the Sayeret Matkal, an elite commando unit of the Israeli army, in 1971. He spent five years in the unit. Hide Caption 4 of 38 Netanyahu's life in pictures 38 photos Netanyahu shakes hands with Israeli President Zalman Shazar during a November 1972 ceremony honoring the Sayeret Matkal soldiers who freed hostages in a hijacking earlier that year. Hide Caption Netanyahu's life in pictures 38 photos Netanyahu and his first wife, Miriam, in June 1980. Hide Caption Netanyahu's life in pictures 38 photos Netanyahu and his daughter, Noa, in June 1980. Hide Caption 7 of 38 Netanyahu's life in pictures 38 photos Netanyahu speaks in July 1986 with Sorin Hershko, one of the Israeli soldiers wounded in Operation Entebbe. It was the 10th anniversary of Operation Entebbe, a dramatic rescue of Jewish hostages at Uganda's Entebbe Airport. Netanyahu's brother, Yonatan, was killed leading Operation Entebbe in 1976. Affected by his brother's death, Netanyahu organized two international conferences on ways to combat terrorism, one in 1979 and another in 1984. Hide Caption Netanyahu's life in pictures 38 photos From 1984 to 1988, Netanyahu was Israel's ambassador to the United Nations. Hide Caption 9 of 38 Netanyahu's life in pictures 38 photos Netanyahu talks to Israeli Prime Minister Yitzhak Shamir on a stroll in New York's Central Park in November 1987. Hide Caption 10 of 38 Netanyahu's life in pictures 38 photos Netanyahu, as Israel's deputy foreign minister, goes through some papers as Government Secretary Elyakim Rubinstein recites morning prayers on a flight from New York to Washington in April 1989. Hide Caption Netanyahu's life in pictures 38 photos Shamir speaks with Netanyahu at a Middle East peace conference in Madrid in October 1991. Hide Caption Netanyahu's life in pictures 38 photos Netanyahu celebrates after being elected chairman of the right-wing Likud party on March 21, 1993. Hide Caption 13 of 38 Netanyahu's life in pictures 38 photos Netanyahu and former foreign minister David Levy sit in the Knesset during the vote for a new Israeli President on March 24, 1993. Hide Caption 14 of 38 Netanyahu's life in pictures 38 photos Netanyahu meets with King Hussein of Jordan, center, and Crown Prince Hassan in December 1994. It was Netanyahu's first visit to Jordan. Hide Caption 15 of 38 Netanyahu's life in pictures 38 photos Netanyahu shakes hands with outgoing Israeli Prime Minister Shimon Peres before taking the office himself in June 1996. Hide Caption 16 of 38 Netanyahu's life in pictures 38 photos Netanyahu meets with Palestinian leader Yasser Arafat for the first time on September 4, 1996, at an Israeli army base at the Erez Checkpoint in Gaza. Hide Caption Netanyahu's life in pictures 38 photos Netanyahu meets with U.S. Secretary of State Madeleine Albright in Washington in February 1997. Hide Caption 18 of 38 Netanyahu's life in pictures 38 photos Netanyahu spends the day on the beach with his wife, Sara, and son Avner in Caesarea, Israel, on August 16, 1997. Hide Caption 19 of 38 Netanyahu's life in pictures 38 photos Actor Kirk Douglas holds the King David Award, presented to him by the Jerusalem Fund Aish Ha Torah during a dinner in Beverly Hills, California, on November 17, 1997. Douglas was honored for his inspirational commitment to Israel and the Jewish people and in recognition of his new book \"Climbing the Mountain.\" Netanyahu is on the left. To the right is Rabbi Nachum Braverma, director of the Jerusalem Fund Aish Ha Torah. Hide Caption 20 of 38 Netanyahu's life in pictures 38 photos Netanyahu looks through binoculars during a tour of the West Bank with the Israeli Cabinet on December 28, 1997. Hide Caption 21 of 38 Netanyahu's life in pictures 38 photos Netanyahu and U.N. Secretary-General Kofi Annan meet in Annan's office in New York on May 15, 1998. Hide Caption 22 of 38 Netanyahu's life in pictures 38 photos From left, Arafat, King Hussein, U.S. President Bill Clinton and Netanyahu sign an interim Middle East peace agreement in October 1998. Hide Caption 23 of 38 Netanyahu's life in pictures 38 photos Netanyahu thanks a crowd of supporters in Tel Aviv, Israel, at a Likud party meeting in May 1999. The outgoing Prime Minister announced that he was quitting the Knesset and stepping down as party leader 10 days after being defeated in elections. Hide Caption 24 of 38 Netanyahu's life in pictures 38 photos Netanyahu testifies before the U.S. House Government Reform Committee on September 20, 2001. The committee was conducting hearings on terrorism following the September 11 attacks. Hide Caption 25 of 38 Netanyahu's life in pictures 38 photos Netanyahu, as Israel's foreign minister, laughs with Israeli Prime Minister Ariel Sharon at the start of a Likud convention in Tel Aviv on November 12, 2002. Hide Caption 26 of 38 Netanyahu's life in pictures 38 photos Netanyahu and his wife, Sara, are seen at a polling station in Jerusalem on August 14, 2007. He was re-elected as head of the Likud party. Hide Caption 27 of 38 Netanyahu's life in pictures 38 photos Netanyahu shakes hands with Israeli President Shimon Peres in February 2009 after Netanyahu won backing from the Israeli parliament to become Prime Minister again. A close election between Netanyahu and rival Tzipi Livni had left the results unclear until the parliament's decision. Hide Caption 28 of 38 Netanyahu's life in pictures 38 photos From left, Egyptian President Hosni Mubarak, Netanyahu, U.S. President Barack Obama, Palestinian President Mahmoud Abbas and Jordan's King Abdullah II walk to the East Room of the White House to make statements on the Middle East peace process on September 1, 2010. Hide Caption Netanyahu's life in pictures 38 photos Obama meets with Netanyahu at the White House in September 2010. Hide Caption 30 of 38 Netanyahu's life in pictures 38 photos U.S. Secretary of State Hillary Clinton looks on as Abbas and Netanyahu shake hands in Sharm El-Sheikh, Egypt, on September 14, 2010, during a second round of Middle East peace talks. Hide Caption 31 of 38 Netanyahu's life in pictures 38 photos British Prime Minister David Cameron welcomes Netanyahu to 10 Downing Street in London on May 4, 2011. Hide Caption 32 of 38 Netanyahu's life in pictures 38 photos Netanyahu address a joint session of the U.S. Congress on May 24, 2011. He said that he was prepared to make \"painful compromises\" for a peace settlement with the Palestinians, but he repeated that Israel will not accept a return to its pre-1967 boundaries. Hide Caption 33 of 38 Netanyahu's life in pictures 38 photos Netanyahu uses a diagram of a bomb to describe Iran's nuclear program while delivering an address to the U.N. General Assembly on September 27, 2012. Netanyahu exhorted the General Assembly to draw \"a clear red line\" to stop Iran from developing nuclear weapons. Hide Caption 34 of 38 Netanyahu's life in pictures 38 photos Netanyahu and Avigdor Lieberman of the Likud-Beiteinu coalition party greet supporters as they arrive onstage on election night in January 2013. The Likud-Beiteinu won 31 seats in the Knesset. Hide Caption 35 of 38 Netanyahu's life in pictures 38 photos Netanyahu speaks at the U.N. General Assembly on October 1, 2013. He accused Iranian President Hassan Rouhani of seeking to obtain a nuclear weapon and described him as \"a wolf in sheep's clothing, a wolf who thinks he can pull the wool over the eyes of the international community.\" Hide Caption 36 of 38 Netanyahu's life in pictures 38 photos In December, Netanyahu called for early elections as he fired two key ministers for opposing government policy. Hide Caption 37 of 38 Netanyahu's life in pictures 38 photos Netanyahu is greeted by members of Congress as he arrives to speak in the House chamber on Tuesday, March 3. Hide Caption 38 of 38 EXPAND GALLERY The right-wing bent of the new government could change, though, and there is already talk that Netanyahu could convince left or center-left parties to join his coalition. Netanyahu has historically preferred a more moderate government in his dealings with the international community, often giving politicians on the center and left a prominent foreign policy role. Netanyahu may look to bring Isaac Herzog, who has been the leader of the opposition and heads the center-left Zionist Union, into the fold -- he's keeping the plum foreign ministry position vacant for now, so it could be doled out to a new coalition partner -- but it's unclear if Herzog will want to join the coalition or instead capitalize on Netanyahu's fragile government as chief antagonist. Herzog would be a boon not only in smoothing over relations with the U.S. administration, but also in staving off sanctions from European countries and otherwise blunting the Palestinian push on the international stage. But even if the Zionist Union did join Netanyahu's Likud-led government -- likely pushing out Jewish Home -- ongoing tensions between Netanyahu and Obama aren't going to suddenly evaporate, according to David Makovsky, who previously served a stint on Secretary of State John Kerry's negotiating team. \"It's hard to believe that at the end of the seventh year of an administration, there's suddenly going to be an epiphany,\" said Makovsky, now a fellow at the Washington Institute for Near East Policy. Still, he said, the heavily right-leaning coalition \"certainly isn't going to improve\" relations between the two countries. Natan Sachs of the Brookings Institution agreed that ultimately the incoming coalition -- or even a future one including Herzog -- won't result in big changes in Israel's ties to the U.S. An intimate U.S.-Israel relationship \"America has dealt with Israel intimately for decades now, and that included governments that were just as right-wing as this one,\" Sachs said. While the hardline members of Netanyahu's budding coalition will look to ramp up settlement activity, several experts said it's unlikely they'll be able to produce sweeping changes in that area without full buy-in from Netanyahu. On the other hand, since some settlement-building has continued under Netanyahu, the White House won't be up in arms over a slight increase so long as it doesn't go too far. And while the new coalition will feature controversial ministers known for making inflammatory statements about the Palestinians, the peace process and even African migrants, it won't be the first time Netanyahu's cabinet has been a source of controversy or provocative comments. Netanyahu's previous foreign minister, Avigdor Lieberman, who was no stranger to controversy, will now be in the opposition. Beyond that, relations between the Israeli government and the White House have sunk so low in recent months that it seems unlikely that there will be a new decline. While a narrow, right-wing coalition will make for an even more intractable peace process -- something American presidents have often revived in the waning years of their tenure -- there's already little hope for any inroads on that front. Either way, the peace process is taking a backseat as the Obama administration's foreign policy team focuses on cinching a nuclear deal with Iran. \"By and large we're going to see continuity -- which means by and large a very fraught relationship,\" Sachs said. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-08T03:17:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}