{"organizations": [], "uuid": "a2df1b8d236988a76e43265eba743e3a61fc7c6b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_25.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/241867-obama-difficult-path-toward-palestinian-statehood", "country": "US", "title": "Obama: 'Difficult path’ toward Palestinian statehood", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: 'Difficult path’ toward Palestinian statehood", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:58:00.000+03:00", "replies_count": 0, "uuid": "a2df1b8d236988a76e43265eba743e3a61fc7c6b"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/241867-obama-difficult-path-toward-palestinian-statehood", "ord_in_thread": 0, "title": "Obama: 'Difficult path’ toward Palestinian statehood", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: 'Difficult path’ toward Palestinian statehood By Jordan Fabian - 05/12/15 08:58 PM EDT President Obama said Tuesday he sees a \"difficult path forward\" for a two-state solution between Israel and Palestine. The president said he will \"never give up on the hope\" of Israeli-Palestinian peace but that there are \"serious questions about overall commitment\" to establishing a Palestinian state next to Israel. \"It’s no secret that we now have a very difficult path forward,\" Obama said in an interview with Arabic-language newspaper Asharq Al-Awsat. \"As a result, the United States is taking a hard look at our approach to the conflict.\" ADVERTISEMENT Obama's comments come just days after Israeli Prime Minister Benjamin Netanyahu formed a new conservative government. The coalition includes the Jewish Home Party, which supports expanding settlements in the West Bank and opposes a two-state solution. The president previously said it would need to \"reassess” the U.S.-Israel relationship in the wake of Netanyhau’s pre-election promise to oppose a two-state solution as long as he is in power. Netanyahu later walked back his comments. Obama said he would look to both the Israelis and Palestinians to show they are serious toward working toward a lasting peace. \"We look to the new Israeli government and the Palestinians to demonstrate — through policies and actions — a genuine commitment to a two-state solution,\" he said. \"Only then can trust be rebuilt and a cycle of escalation avoided.\" Both sides will need to address reconstruction and development in Gaza after last year's conflict and better integrating the territory with the West Bank, among other issues. The president spoke to the newspaper ahead of a summit with leaders from Persian Gulf monarchies who are concerned about the U.S.'s nuclear negotiations with Iran and the threat posed by Islamic State militants. Obama said he would speak to Gulf leaders about deepening security cooperation and sell them on a nuclear pact with Iran. \"Our meeting is rooted in our shared interest in a Gulf region that is peaceful, prosperous, and secure,\" Obama said. \"I’ve made it clear that the United States is prepared to use all elements of our power to secure these interests.\"", "external_links": [], "published": "2015-05-13T03:58:00.000+03:00", "crawled": "2015-05-13T05:44:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}