{"organizations": [], "uuid": "8c9c80c981ec5c5d2e1551f725d9a2920c5947e7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/amtrakcrash_051315getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/transportation/243471-obama-to-fill-chief-safety-regulator-roles-for-railroads-pipelines", "country": "US", "title": "Obama to fill chief safety regulator roles for railroads, pipelines", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to fill chief safety regulator roles for railroads, pipelines", "spam_score": 0.0, "site_type": "news", "published": "2015-05-29T22:36:00.000+03:00", "replies_count": 0, "uuid": "8c9c80c981ec5c5d2e1551f725d9a2920c5947e7"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/transportation/243471-obama-to-fill-chief-safety-regulator-roles-for-railroads-pipelines", "ord_in_thread": 0, "title": "Obama to fill chief safety regulator roles for railroads, pipelines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to fill chief safety regulator roles for railroads, pipelines By Timothy Cama - 05/29/15 03:36 PM EDT \nPresident Obama has chosen officials to fill the long-vacant roles leading federal agencies that oversee the safety of railroads and pipelines and of hazardous materials. \nThe top posts at both of the Department of Transportation (DOT) agencies have been vacant for months, even through high-profile disasters involving oil trains, Amtrak, oil pipelines, rapid transit and other forms of transportation. ADVERTISEMENT It has led to repeated criticisms from members of Congress, who accused Obama of putting transportation safety on the back burner.\nSarah Feinberg, currently the deputy administrator at the Federal Railroad Administration, will be nominated to take the top position in that agency. \nFeinberg has worked at DOT since 2013, and has acted as its administrator since January, when Joseph Szabo left. She previously worked at the White House, Facebook Inc. and Bloomberg LP, among other places. \nObama wants the Pipeline and Hazardous Materials Safety Administration (PHMSA) post to be filled by Marie Therese Dominguez. \nDominguez has worked since 2013 as the principal deputy assistant secretary of the army for civil works, the No. 2 official at the Army Corps of Engineers. She previously worked at agencies such as the National Transportation Safety Board, the Federal Aviation Administration and the United States Postal Service. \nCynthia Quartermann left the PHMSA post in October. \nBoth women will be subject to Senate confirmation. \nSen. John Thune (R-N.D.), chairman of the Commerce, Science and Transportation Committee, has said he is eager to get leaders into the agencies, and has signaled to Transportation Secretary Anthony Foxx he would work quickly on the confirmation process for nominees. Tags:", "external_links": [], "published": "2015-05-29T22:36:00.000+03:00", "crawled": "2015-05-29T23:08:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}