{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "90148782656ac8ffbddaa2d308e0b427bc9f1b07", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/061113/0/0/061113_reilly_rand_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/12/sorry-mr-obama-constitution-is-not-negotiable.html", "country": "", "title": "Sorry, Mr. Obama, the Constitution is not negotiable | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Sorry, Mr. Obama, the Constitution is not negotiable | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "90148782656ac8ffbddaa2d308e0b427bc9f1b07"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/12/sorry-mr-obama-constitution-is-not-negotiable.html", "ord_in_thread": 0, "title": "Sorry, Mr. Obama, the Constitution is not negotiable | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nIn the United States, we are supposed to have a government that is limited with its parameters established by our Constitution. This notion that the federal government can monitor everyone’s phone data is a major departure from how Americans have traditionally viewed the role of government. \nIf this is acceptable practice, as the White House and many in both parties now say it is, then there are literally no constitutional protections that can be guaranteed anymore to citizens. In the name of security, say our leaders, the Constitution has become negotiable. \nThis is what the White House is saying when it defends the National Security Agency’s gathering of Verizon’s client data en masse, or what President Obama calls a “modest encroachment” on our rights, as he assures us that “Nobody is listening to your phone calls.” \n[pullquote] \nPerhaps he can also assure us that nobody at the Internal Revenue Service is targeting political dissidents. \nPerhaps he can assure us that nobody at the Justice Department is seizing reporters’ phone records. \nSorry, Mr. President, but “trust me” is not good enough. \nPresident Obama says, “You can't have 100 percent security and also then have 100 percent privacy and zero inconvenience.” But we couldn’t have 100 percent security even if we turned America into a total police state—something too many seem eager for—because there’s no such thing as a risk free society. \nWhen balancing liberty against security, the American tradition has always been to err on the side of liberty. Targeting potential terror suspects by obtaining a warrant is an “inconvenience” the Founders’ intentionally put upon the government in order to protect the privacy of citizens. Now this president turns this core constitutional principle on its head. \nThere are also Republicans who seem to want more power for government and less for citizens. One senator, a particularly zealous defender of the surveillance state, has said that he would be fine with “censoring the mail” if “necessary” to keep us safe. \nThis senator would open citizens’ mail, detain them indefinitely if he decided they were dangerous, claw his way through their trash, peek in their bedrooms if he decided they were an enemy, and then if they dared to ask for a lawyer, he would bark: \"Shut up! You don’t get a lawyer!\" \nSuch arrogance and tone deafness! \nA government as omnipotent as this may be powerful enough to spy on all of its citizens all of the time, but doesn’t seem to be able to even stop terrorists like the Boston Marathon bombers and the “underwear bomber” – both of whom set off warnings before they were noticed. \nInstead of monitoring billions of phone calls and spying on law-abiding Americans, perhaps we should have been done more targeted monitoring of the Boston bombing suspects, one of whom traveling to Chechnya, largely undetected. \nClutching desperately for relevance, some Republican Senators point wildly at the Boston Marathon bombing and grit out, \"See, I told you so! America is too part of the battlefield.” \nDuh! No one is arguing that our enemies won’t attack us here and that we shouldn't defend ourselves. Constitutionalists simply argue that we can defend the homeland and the Bill of Rights simultaneously, and to relinquish concrete liberties for an elusive security is a fool's errand. \nI can remember not so long ago, when the war caucus—and we don’t need to name any names—were all saying “we have to fight them over there so we don’t have to fight them here.” \nNow, they are saying we have to give up our liberties to fight them here? Who is winning this battle? \nRegardless, anytime we give up our liberty—we lose. \nNational security is the federal government’s top priority. We have always balanced liberty with common sense security precautions. There are unquestionably exceptions to every rule. \nBut those who continue to defend the National Security Agency’s actions are essentially saying that something that would be controversial even as an exception—blanket phone trolling by the government—is now the new rule. They are saying it’s OK to spy on citizens’ phone data without a warrant, not just one time or a few times, but all the time. \nThey are saying that suspending the Bill of Rights is now the new normal. \nIn my world, the Constitution still applies. \nRepublican Rand Paul represents Kentucky in the United States Senate. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}