{"organizations": ["House"], "uuid": "73526bc8349ded5d0a04efa5bb2922c25436683a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2906966/images/o-BOEHNER-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/03/john-boehner-hillary-clinton-trade_n_7199668.html", "country": "", "title": "John Boehner Says Obama Needs Hillary Clinton To Help Pass Trade Deal", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "John Boehner Says Obama Needs Hillary Clinton To Help Pass Trade Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-05-03T21:48:00.000+03:00", "replies_count": 0, "uuid": "73526bc8349ded5d0a04efa5bb2922c25436683a"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/03/john-boehner-hillary-clinton-trade_n_7199668.html", "ord_in_thread": 0, "title": "John Boehner Says Obama Needs Hillary Clinton To Help Pass Trade Deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Barack Obama", "Mark Wilson", "Boehner John Boehner", "John Boehner"], "text": "John Boehner Says Obama Needs Hillary Clinton To Help Pass Trade Deal Posted: Updated: 17 minutes ago House Speaker Boehner John Boehner (R-Ohio) says President Barack Obama needs Hillary Clinton to step in and help persuade Democrats to pass a trade deal. | Mark Wilson via Getty Images reddit \nWASHINGTON -- House Speaker John Boehner (R-Ohio) said Sunday that 2016 Democratic presidential candidate Hillary Clinton needs to step it up and help President Barack Obama pass a trade deal in Congress. \n\"The fact is, the president needs her help in order to get Democrats, those in the House and Senate, to get this passed,\" Boehner said in an interview on NBC's \"Meet The Press.\" \n\"She can't sit on the sidelines and let the president swing in the wind here,\" he said. \nObama has been lobbying congressional Democrats for weeks to give him \"fast-track\" authority, which would let him negotiate a massive trade deal -- known as the Trans-Pacific Partnership -- that Congress could only approve or disapprove in an up-or-down vote, versus amending it. \nRepublicans and some Democrats are supportive, but many liberal Democrats are opposed out of fear that the deal would outsource U.S. jobs. In particular, House Democrats may have the votes to sink the whole thing if Obama can't get them on board. \nClinton has been mum on the issue, and Boehner says it's time for her to start talking. \nWhen asked by NBC's Chuck Todd if he thinks Clinton needs to be more engaged, Boehner replied, \"I do.\" \n\"Hillary Clinton was for trade promotion authority. Hillary Clinton is for the trade bill with the Asians. She just won't say so,\" he said. More: ", "external_links": [], "published": "2015-05-03T21:48:00.000+03:00", "crawled": "2015-05-03T23:32:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}