{"organizations": [], "uuid": "404348a573337b2d94d107cb001d9fbd2026a15b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/2obamabarack0526getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/243261-legal-setback-clouds-fate-of-obamas-immigration-actions", "country": "US", "title": "Legal setback clouds fate of Obama’s immigration actions", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Legal setback clouds fate of Obama’s immigration actions", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T00:28:00.000+03:00", "replies_count": 0, "uuid": "404348a573337b2d94d107cb001d9fbd2026a15b"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/243261-legal-setback-clouds-fate-of-obamas-immigration-actions", "ord_in_thread": 0, "title": "Legal setback clouds fate of Obama’s immigration actions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Legal setback clouds fate of Obama’s immigration actions By Jordan Fabian - 05/27/15 05:28 PM EDT \nThe fate of President Obama’s controversial deportation-relief program has been thrown into question following a legal setback that has pro-immigration groups increasingly nervous. In a split decision earlier this week, a three-judge panel from the 5th Circuit Court of Appeals handed a victory to Obama’s opponents when they refused to lift a hold on his executive actions, which could allow millions of undocumented immigrants to live and work in the U.S. without fear of deportation. The decision made it more likely the court battle will spill into 2016, the final year of Obama’s presidency.“I think it’s a real concern that this litigation delay is going to be protracted and that this could very well push into next year,” said Marshall Fitz, vice president of immigration policy at the Center for American Progress, which has close ties to Obama.In a sign that the administration is now resigned to a lengthy legal battle, the Justice Department announced Wednesday it would not make an emergency request to the Supreme Court to lift the hold on his order. The DOJ is instead choosing to focus on its appeal of the injunction itself, a proceeding not expected at the 5th Circuit until July. Advocates say remain confident the Obama administration will eventually prevail in a series of legal challenges related to a lawsuit brought by 26 states against the programs. But they worry the longer the fight drags out, the harder it might be to convince immigrants to sign up for the programs. Marielena Hincapié, executive director of the National Immigration Law Center, said the intent of the legal challenge is to “delay, confuse and instill fear in our communities.”She said groups would continue to encourage eligible immigrants to prepare to apply for the programs, but the court case makes that task tougher.If uncertainty continues to surround the program, it may be difficult to convince immigrants to come out of the shadows and hand over their personal information to the government. “We acknowledge it will be harder challenge for us to make sure that our communities are well informed,” she said. Not all immigration watchers agree. David Leopold, the former president of the American Immigration Lawyers Association, believes potential applicants won’t be deterred by the legal wrangling because the benefits are enormous for immigrant families.“This delay is not a welcome delay but I don’t think it’s going to discourage people from applying at all,” he said. “People who have been living in this country for 10, 15 years are not about to give up and leave.”The 5th Circuit denied the Obama administration’s emergency request to lift a Texas judge’s order blocking the program from taking effect until it decides the injunction on the merits. In their decision, the judges wrote administration was unlikely to succeed on their appeal of the injunction. The hold applies to a pair of new deferred deportation programs announced by Obama last November: one for parents of U.S. citizens and legal residents and an expansion of his 2012 initiative that applies to immigrants brought to the country illegally as children, known as DREAMers. On Wednesday, Justice Department spokesman Patrick Rodenbush said the \"best way\" to win the case is \"to focus on the ongoing appeal on the merits of the preliminary injunction itself.”\"The Department has determined that it will not seek a stay from the Supreme Court,\" Rodenbush said. Oral arguments in the case are expected to take place at the New Orleans court on July 6. Whichever side loses that decision will likely appeal to the Supreme Court. And U.S. District Judge Andrew Hanen, who issued the injunction in February, still has not ruled on the suit itself, which argues Obama overstepped his constitutional authority.The White House and immigrant-rights advocates argue Obama acted within the law and remain confident they will succeed in court. They say legal precedent favors the administration’s argument that the states have no standing in the case, because the federal government has the sole responsibility to enforce immigration law. The 5th Circuit sided with the president in April when it tossed out a separate lawsuit challenging Obama’s 2012 deferred action program.The judges ruled that the plaintiffs in Crane v. Johnson, the state of Mississippi and a group of Immigration and Customs Enforcement (ICE) agents, lacked the authority to sue because they could not prove they were harmed by Obama’s program. “It’s a partisan political attack masquerading as a legal complaint, and at some point, a judge is going to figure that out,” Leopold said of the lawsuit.But with just 20 months left in Obama’s presidency, his administration faces a ticking clock to resolve the legal issues surrounding the program. Hanen’s injunction was issued 48 hours before the government was to begin accepting applications for Obama’s expanded deportation relief program for young undocumented immigrants.“There is a deep amount of frustration and this court case will add to the confusion that exists,” said Fitz, who formerly practiced immigration law. “The litigation around this is confusing for everybody, no more so that for the community it affects. Many people who were standing there, paperwork in hand, are wondering what’s next.”Advocates say they are not waiting for the courts to prepare immigrants to apply for the programs in case the hold is lifted. Activist groups are holding a series of forums to educate eligible immigrants about the initiatives, including one in Salinas, Calif. on Sunday. The American Immigration Council this week hosted a meeting with consular officials to encourage their citizens to step forward and apply if the programs are allowed to proceed. “We continue to urge people to prepare,” said Debbie Smith, associate general counsel for the Service Employees International Union. “We know it takes people a long time to get the documentation together. It’s disappointing, it’s frustrating but we do continue to urge people to prepare because we feel ultimately this will go forward.”", "external_links": [], "published": "2015-05-28T00:28:00.000+03:00", "crawled": "2015-05-28T00:41:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}