{"organizations": [], "uuid": "3658fbd0b3ceb393252cd1d685ae7b7a02f61658", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/immigration_111513getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/news/242616-conservatives-press-case-for-immigration-reform", "country": "US", "title": "Conservatives press case for immigration reform", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Conservatives press case for immigration reform", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T03:40:00.000+03:00", "replies_count": 0, "uuid": "3658fbd0b3ceb393252cd1d685ae7b7a02f61658"}, "author": "Mike Lillis", "url": "http://thehill.com/homenews/news/242616-conservatives-press-case-for-immigration-reform", "ord_in_thread": 0, "title": "Conservatives press case for immigration reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Conservatives press case for immigration reform By Mike Lillis - 05/19/15 08:40 PM EDT Outside conservative groups are pressuring GOP leaders to take up targeted immigration reforms ahead of the 2016 elections. The immigration issue has sharply divided Republicans, and GOP leaders have largely shied away from it in recent years, if only to avoid highlighting that internal discord, a concern that’s particularly pronounced heading into a high-stakes presidential election year. ADVERTISEMENT But conservatives off Capitol Hill are warning that a failure of Congress to tackle immigration head-on will allow Democrats to attack the GOP majority for doing nothing to fix a system that both parties agree is broken. The conservatives are calling on Republican leaders to pass piecemeal reforms, beginning with stronger border security measures, that might preclude those attacks and improve the GOP’s standing with Hispanic voters. “Make no mistake about it, this is a great crisis. And there’s absolutely no excuse for members of Congress to sit on their hands and do nothing,” Alfonso Aguilar, a Republican who headed the Office of Citizenship under former President George W. Bush, said Tuesday during a forum on immigration reform in Washington. “It’s time for Republicans to lead,” added Aguilar, who now heads the Latino Partnership at American Principles in Action (APIA), a conservative policy group. “This Congress has a unique opportunity to show that Republicans can tackle the toughest issues of our time.” Aguilar unveiled a five-part plan that APIA is urging Republicans to pursue immediately, including construction of hundreds of miles of double-layer fencing at the southern border; tougher enforcement of laws barring illegal immigrants from working; and better tracking tools to prevent visa overstays. “This Congress should definitely pass legislation in this session — now — to address these problems,” Aguilar said. The final two pieces of the plan — improvements to the federal guest- worker program and the creation of a path to legal status for people in the country illegally — would come only after the others are established and the elections have passed. None of the five would be implemented while President Obama is in office. Some of the issues are already on Republicans’ radar. Sen. Ron Johnson (R-Wis.), chairman of the Homeland Security Committee, said he’s weighing “dozens of little bills” that address the immigration issue. But he also suggested that many Republicans — particularly those calling for the mass deportation of illegal immigrants — have damaged the GOP brand among Hispanics. “We’ve got to take off our legislative blinders ... and realize that we’ve got to sell our ideas to the American public,” said Johnson, a freshman senator who’s facing a tough reelection battle next year. “It starts with recognizing and describing the reality and admitting you have a problem,” he added. “Of the 11 or 12 million people in this country illegally, 8.1 million of them are working. [We need to] figure out a way to make those people pay a price for their illegal activity, but also recognize the fact that … we’re not going to mass deport them.” Across the Capitol, Rep. Raúl Labrador (R-Idaho), a former immigration lawyer, said he’s also working on as many as a dozen separate immigration bills. Labrador, a Tea Party favorite who was a part of the bipartisan House group that unsuccessfully sought a reform compromise, said he’s hoping his proposals will guide the GOP presidential contenders heading into 2016. “In the next six months I’m going to lay out a vision for the Republican Party — what things we need to do — the three, four, five, six, maybe 12 bills that we need to do — and show why they’re important and will fix the immigration problem,” Labrador said. “And hopefully one or two — or maybe all of the candidates — will get behind something like that. “When we have a vision, then people follow that vision.” Poll results from the last two election cycles reveal much of the reason behind the conservatives’ focus on immigration policy. In 2008, Obama won a resounding 67 percent of the Hispanic vote; four years later, the figure rose to 71 percent. And those voters could play an outsized role in important battleground states such as Florida, Colorado, Nevada and Virginia that could decide the White House in 2016. Top Democrats say they’re ready to press their party’s advantage again next year if GOP leaders don’t move on sweeping immigration reforms. “In 2016, will the reluctance of Republicans ... [to move] comprehensive immigration reform legislation be a topic of conversation and discussion that will wake up many parts of America?” Rep. Ben Ray Luján (N.M.), head of the Democratic Congressional Campaign Committee, said Tuesday. “Yeah, absolutely.” Earlier in the month, Democratic presidential hopeful Hillary Clinton took aggressive steps to court the Hispanic vote by endorsing both a pathway to citizenship for illegal immigrants and Obama’s recent executive actions halting deportations for millions of those bearing the same status. The immigration issue has been much more difficult for the Republican presidential contenders, who face pressure to shift to the right during primary season. Sen. Marco Rubio (R-Fla.), who once endorsed comprehensive immigration reforms that included a citizenship option, has shifted his focus to tougher enforcement. And Wisconsin Gov. Scott Walker (R), another supporter of broad reforms, suggested recently that immigration has eroded middle-class jobs. Alex Nowrasteh, an expert in the economics of immigration at the libertarian Cato Institute, lamented the Republicans’ rhetoric, saying Walker’s argument in particular “doesn’t really make a lot of sense.” “It’s a misanthropic argument that people are somehow bad for the economy,” Nowrasteh said during Tuesday’s immigration forum. “It would be odd if a low-skilled worker from Mexico who doesn’t speak English very well who works in a low-skill construction job or agriculture would decrease the wage of an American accountant.” Labrador, for his part, is warning his fellow Republicans to resist policy stands based on political considerations. “What they’re going to learn is that, if they do this for political reasons, they’re going to end up losing … because the other side is always going to be able to make more promises than we will,” Labrador said. “If we make it about politics, we lose; if we make it about policy, we can fix the system.”", "external_links": [], "published": "2015-05-20T03:40:00.000+03:00", "crawled": "2015-05-20T04:26:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}