{"organizations": [], "uuid": "f448e4be4ed695bf217902e8367a07eb51ecafaf", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/laura-murraytjan/headshot.jpg", "site_section": "http://www.huffingtonpost.com/tag/immigration-reform/feed", "section_title": "Immigration Reform on Huffington Post", "url": "http://www.huffingtonpost.com/laura-murraytjan/why-obamas-executive-acti_b_7242206.html", "country": "US", "title": "Laura Murray-Tjan: Why Obama's Executive Actions Prove That Immigration Law Is Doomed to Complexity", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Laura Murray-Tjan: Why Obama's Executive Actions Prove That Immigration Law Is Doomed to Complexity", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T14:12:00.000+03:00", "replies_count": 0, "uuid": "f448e4be4ed695bf217902e8367a07eb51ecafaf"}, "author": "Laura Murray-Tjan", "url": "http://www.huffingtonpost.com/laura-murraytjan/why-obamas-executive-acti_b_7242206.html", "ord_in_thread": 0, "title": "Laura Murray-Tjan: Why Obama's Executive Actions Prove That Immigration Law Is Doomed to Complexity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nSomeone recently asked me what makes immigration law so complicated, and whether it has to be that way. I paused, contemplating polarized congressional debates, hastily crafted compromises, and the messy legislation that results. But Obama's executive actions , crafted by a single administration, are among the best examples of unnecessary complexity. His own team failed to harmonize two relatively simple programs, either because the drafters did not notice the discrepancies or could not agree on how to resolve them. \nOne of the programs , dubbed Deferred Action for Parental Accountability (DAPA), was announced on November 20, 2014. It would allow some undocumented parents a temporary reprieve from deportation. The other program , created June 15, 2012, is known as Deferred Action for Childhood Arrivals (DACA). It spares some undocumented immigrants who came here as children from deportation for a short period of time. Currently, twenty-six states are challenging DAPA in federal court, and the immigrant community is waiting with bated breath to learn whether the program will be allowed to go forward. In the meantime, the two programs illustrate what goes wrong in the drafting process. \nCriminal convictions are, appropriately, bars to obtaining deferred action under DAPA and DACA. The frustration is that different categories of convictions are bars under the two programs. For example, a \"felony\" prevents obtaining deferred action under both DAPA and DACA. But \"felony\" is defined differently under each program. Under DAPA, a conviction is a felony if the state where the individual was convicted labels it a felony. Rhode Island labels possession of cocaine a felony, but Massachusetts does not. DACA defines \"felony\" by the potential sentence. A crime is a felony if it is punishable by more than one year's imprisonment. Under that definition, possession of cocaine is a felony in both states. Why did the Obama administration define \"felony\" differently under DAPA and DACA? I have no idea. \nLet's move on to misdemeanors. A \"significant misdemeanor\" is a bar under both programs. But first, what is a \"misdemeanor\"? Under DACA, it's an offense with a maximum term of imprisonment of one year or less, but more than five days. DAPA, by contrast, provides no definition. Does this mean that potential DAPA applicants should assume that any offense that is not a felony is a misdemeanor? Sorry, I don't know. \nThen, if an offense is a misdemeanor, what makes it \"significant\"? The answer reveals perhaps the silliest discrepancy between the two programs. Under DAPA, a misdemeanor is \"significant\" if the applicant was sentenced to ninety days or more in prison. Under DACA, however, the time period is more than ninety days. Why the one day difference? My guess is that it was an oversight. \nI could continue, but you get the idea. Heated emotions and political pressure defeat logic. Drafters spit out rules that are inexcusably messy and confusing. Everyone, from immigrants to the Supreme Court , gets tripped up. I don't disagree with the many who argue that the immigration system should be dismantled and rebuilt. The problem is that, unless emotions cool, it's unlikely that any new system will be an improvement. More:", "external_links": [], "published": "2015-05-08T14:12:00.000+03:00", "crawled": "2015-05-08T22:05:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}