{"organizations": [], "uuid": "bfed9e851f02ba82ad76f6de1cf00ca27c28adbb", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_020215getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/240744-obama-library-to-be-located-in-chicago-reports-say", "country": "US", "title": "Obama library to be located in Chicago, reports say", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama library to be located in Chicago, reports say", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T03:25:00.000+03:00", "replies_count": 0, "uuid": "bfed9e851f02ba82ad76f6de1cf00ca27c28adbb"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/240744-obama-library-to-be-located-in-chicago-reports-say", "ord_in_thread": 0, "title": "Obama library to be located in Chicago, reports say", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama library to be located in Chicago, reports say By Jordan Fabian - 04/30/15 08:25 PM EDT The Obama presidential library will be located in Chicago, according to media reports. The University of Chicago reportedly beat out three other finalists that submitted bids to build the library — the University of Illinois at Chicago, Columbia University in New York and the University of Hawaii in Honolulu — according to NBC News . An official announcement is expected in mid-May, CBS 2 Chicago reported. ADVERTISEMENT The foundation overseeing the creation of the library did not respond to a request for comment. The Windy City, where the president and first lady lived and worked before Obama was elected to the Senate in 2004, was long considered the front-runner to land the library. Chicago Mayor Rahm Emanuel, Obama's former chief of staff, has lobbied hard for the library to be located in his city. The president has deep ties to the University of Chicago. He taught at the university's law school for 12 years. His former senior adviser, David Axelrod, runs the Institute of Politics at the University of Chicago and attended college there. The site selection had been delayed over concerns that the University of Chicago's bid proposed two sites that required the acquisition of public park land. The announcement was further pushed back in March due to Chicago's runoff mayoral election, which Emanuel won. The Illinois state legislature last week passed a bill that would allow the library to legally be built on park land. Tags: Thousands of new Lerner emails... Congressional committees say an inspector general found roughly 6,400... Baltimore mom praised for smacking... \"I don't want him to be a Freddie Gray,\" Toya Graham said. Faith leaders demand that liberal... Scott Lively slammed Justices Kagan and Ginsburg for officiating same-sex... Brent Budowsky: Holy war against... OPINION | Republicans lead a party that looks like little more than an... Internet up in arms over '... An activist was seemingly plucked off the streets in full view of news... Dems hammer Japanese prime... Honda said Abe's \"refusal to squarely face history\" is an insult to so-... GOP unveils budget deal that seeks... The deal would approve more than $5 trillion in spending cuts over a... Baltimore teen disciplined by mom... \"I understand how much my mama really cares about me,” Michael Singleton... Sanders to launch presidential bid The independent senator will enter the Democratic fray Thursday to... Obama accidentally crashes WH... The president walked in on some of the journalists who cover him having... Young voters want a Democrat in... A poll of millennials shows a Democrat has wide support among 18-29-year-... Senators clash over Iran votes Democrats are warning that all bets are off if controversial amendments... Justice Kennedy doesn't reveal... The Supreme Court's most frequent swing vote sent mixed messages Tuesday. Dem to bring Korean 'comfort woman... Rep. Mike Honda (D-Calif.) has the Japan government of failing to own up... Senators vote to block EPA’s use... A Senate committee voted Tuesday to prohibit the Environmental Protection... Reid: 'Journalism doesn't exist' Reid hailed a man who peddled a false story about the minority leader... How Jeb Bush will win in 2016 Bush will find only one path to victory in 2016: through his brother,... Paul blames 'breakdown in the... '16 GOP hopeful says there are \"root, cultural causes\" for violence but \"... Carson slams rioters: 'It makes no... “Reacting out of anger seldom leads to anything helpful,” the possible... Sanders: ‘I am running for... The Vermont Independent told the AP he was all-in for 2016 on Wednesday.", "external_links": [], "published": "2015-05-01T03:25:00.000+03:00", "crawled": "2015-05-01T03:54:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}