{"organizations": [], "uuid": "9d4186f2e35cc12f662bacf641708cf16f955ed8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2930560/images/o-POPE-FRANCIS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/pope-francis/feed", "section_title": "Pope Francis on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/08/pope-francis-abortions_n_7244630.html", "country": "US", "title": "Pope Francis To Send Out Priests To Forgive The 'Sin' Of Women Who Have Had Abortions", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Pope Francis To Send Out Priests To Forgive The 'Sin' Of Women Who Have Had Abortions", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T22:11:00.000+03:00", "replies_count": 0, "uuid": "9d4186f2e35cc12f662bacf641708cf16f955ed8"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/08/pope-francis-abortions_n_7244630.html", "ord_in_thread": 0, "title": "Pope Francis To Send Out Priests To Forgive The 'Sin' Of Women Who Have Had Abortions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  A mere two weeks after he was announced as pontiff, Francis washed and kissed the feet of 12 prisoners incarcerated in Rome as part of the traditional Holy Thursday rite. The unorthodox component of the ceremony was the inclusion of two women, one of whom was a Muslim. This show of acceptance and compassion was just a hint at what was to come, as the pope has continued to make statements about the importance of interfaith understanding as well as the importance of a greater role for women in the church. Francis sent personal Eid al-Fitr holiday greetings to Muslims around the world, rather than relying on his office to do so in a show of care and good will that hasn't happened since Pope John Paul II sent a similar personal message in 1991. Soon after he became pope, Francis tweeted, \"The pope must serve all people, especially the poor, the weak, the vulnerable,\" and he's made sure to personally do so by comforting and greeting the sick after his weekly general audiences in St. Peter's Square. He moved many hearts, as pictures of him tenderly embracing and kissing some severely disfigured men showed his human concern for all people, especially the marginalized. Pope Francis refused to live in the luxurious papal apartments located in the Apostolic Palace and prefers to live in more modest accommodations to show his personal commitment to humility and encourage other leaders to follow suit. He's also gained notice for his unusual choice of a car -- a humble Ford Focus with a starting sticker price of only about $16,000. He can rarely be seen in the ostentatious vestments that he could certainly wear as pope and prefers his usual garments of a simple white hat and robe. He's always done so -- when he still lived in Argentina, he gave up his chauffeur and took the bus to work. Arriving at World Youth Day, Pope Francis had rock-star appeal, as thousands of young people swarmed his car after it took a wrong turn. Though the mob of excited youth alarmed his security staff with the frenzy of their excitement, \"the pope was happy, with his hand out the window waving,\" said a Vatican spokesman. World Youth Day was a great success, and this pope seems particularly in tune with the younger generation. Pope Francis has given a 17-year-old boy with Down Syndrome the ride of his life – sort of. Francis invited Alberto di Tullio up onto his open-top Mercedes at the end of his general audience Wednesday, letting him spin around on the pontiff's white chair while tens of thousands of people looked on. Read more Four homeless people, one of them bringing his dog, helped Pope Francis celebrate his 77th birthday at the Vatican Tuesday. Read more here Meet Nathan de Brito, the little boy who broke past barriers to run into Pope Francis' arms on Friday in order to tell him something that moved the pontiff to tears. They embraced on the Popemobile as de Brito confided to Pope Francis, \"Your Holiness, I want to be a priest of Christ, a representative of Christ.\" Read more here In this photo provided by the Vatican paper L'Osservatore Romano, Pope Francis, left, and Pope emeritus Benedict XVI pray together in Castel Gandolfo Saturday, March 23, 2013. Pope Francis has traveled to Castel Gandolfo to have lunch with his predecessor Benedict XVI in a historic and potentially problematic melding of the papacies that has never before confronted the Catholic Church. The Vatican said the two popes embraced on the helipad. In the chapel where they prayed together, Benedict offered Francis the traditional kneeler used by the pope. Francis refused to take it alone, saying \"We're brothers,\" and the two prayed together on the same one. (AP Photo/Osservatore Romano, HO) This adorable little boy was on top of the world when he made friends with Pope Francis by wandering up onto the stage during the Pontiff's address to a crowd of families. Read more Pope Francis' compassionate nature was poignantly captured in this image of him tenderly comforting a sick man by kissing him on the head. Read more Pope Francis is winning Twitter. The tweeting Pope upped the ante yesterday by posing for an incredible selfie at the Vatican on Wednesday. Read more Pope Francis boards a plane at Rome's Fiumicino international airport, Monday, July 22, 2013. It's wheels up on Pope Francis' first trip abroad as pontiff. A special Alitalia flight carrying Francis, his entourage and journalists who will cover him on his week-long visit to Brazil took off 10 minutes behind schedule Monday from Rome's Leonardo da Vinci airport. Keeping to his example that the Catholic church must be humble, Francis carried his own black hand luggage. He even kept holding it with his left hand while he used his left to shake hands with some of the VIPs who turned out to wish him well and while he climbed the stairs to the jet's entrance. Among the dignitaries was Italian Premier Enrico Letta. (AP Photo/Riccardo De Luca) In this Sunday, March 31, 2013 file photo, Pope Francis hugs 8-year-old Dominic Gondreau, who has cerebral palsy, after celebrating his first Easter Mass in St. Peter's Square at the Vatican. Gondreau is the son of Dr. Paul Gondreau, a faculty member at Providence College in Providence, R.I. Read more here  Share", "external_links": [], "published": "2015-05-08T22:11:00.000+03:00", "crawled": "2015-05-09T06:21:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}