{"organizations": [], "uuid": "a3187081f68ccb930ca8a7d3b37280faa77a45a9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/05/26/mr-obama-climate-change-didnt-create-isis-boko-haram/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1432647388507.jpg?ve=1&tl=1", "site_section": "http://feeds.foxnews.com/foxnews/opinion", "section_title": "FOX News", "url": "http://www.foxnews.com/opinion/2015/05/26/mr-obama-climate-change-didnt-create-isis-boko-haram.html", "country": "US", "title": "Mr. Obama, climate change didn't create ISIS, Boko Haram", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Mr. Obama, climate change didn't create ISIS, Boko Haram", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T16:33:00.000+03:00", "replies_count": 0, "uuid": "a3187081f68ccb930ca8a7d3b37280faa77a45a9"}, "author": "Cal Thomas", "url": "http://www.foxnews.com/opinion/2015/05/26/mr-obama-climate-change-didnt-create-isis-boko-haram.html", "ord_in_thread": 0, "title": "Mr. Obama, climate change didn't create ISIS, Boko Haram", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  livefyre Email Print U.S. President Barack Obama walks through an honor cordon as he arrives for the 134th Commencement Exercises of the United States Coast Guard Academy in New London, Connecticut May 20, 2015. REUTERS/Kevin Lamarque - RTX1DTBS (Reuters) \nI didn't attend my commencement ceremony at American University in Washington, D.C. I chose instead to receive my degree in the mail. I didn't want to listen to a boring speaker, likely unaffiliated with the school or anyone in it, drone on in Washington's notorious summer heat. \nToo bad graduates of the U.S. Coast Guard Academy did not have the same option. They had to endure a commencement address by President Obama on \"climate change.\" \nLinking the rise of Islamic terrorism to a warming planet, the president told the grads, \"Understand, climate change did not cause the conflicts we see around the world. Yet what we also know is that severe drought helped to create the instability in Nigeria that was exploited by the terrorist group Boko Haram. It's now believed that drought and crop failures and high food prices helped fuel the early unrest in Syria, which descended into civil war in the heart of the Middle East.\" \nReally? Are young girls and women being raped and forced into slavery because religious fanatics can't grow crops on arid land? Marie Harf , a State Department spokeswoman, recently claimed that lack of jobs is what turns people into terrorists. Which is it? \nIf \"climate change\" made terrorism possible, how does the president explain violent jihadism dating back to the time of the Prophet Muhammad, long before carbon was a concern, or even a footprint? If unemployment causes terrorism, millions of jobless Americans would be taking up arms. \nIf \"climate change\" made terrorism possible, how does the president explain violent jihadism dating back to the time of the Prophet Muhammad, long before carbon was a concern, or even a footprint? If unemployment causes terrorism, millions of jobless Americans would be taking up arms. \nNo amount of evidence will dissuade a climate change cultist that he is wrong, but for students who might Google the subject for a term paper, let's try. \nResponding to the president's address, Marc Morano, who runs climatedepot.com (with numerous links to scientific studies, including data from NASA, NOAA, and other credible sources) said this: \"It is hard to even take today's speech by Obama seriously on either a logical, scientific or political level. The speech was so farcical in its claims that it hardly merits a response. It is obvious that the climate establishment is seeking new talking points on 'global warming' to change the subject from the simple fact that global temperatures are not cooperating with their claims.\" \nDon't you love farce? \nAccording to Remote Sensing Systems (RSS) data, \"Since December 1996, there has been no global warming at all. ... A new record length for the Pause: 18 years 5 months. ... The discrepancy between prediction and observation continues to widen.\" \nIn fact, extreme weather has failed to follow the alarmist predictions of climate change cultists. Data readily available and linked to scientific studies through climatedepot.com has found no trends, or declining trends when it comes to the frequency of hurricanes, tornadoes, droughts, floods and wildfires. \nWhat about the multiyear drought in California, you might ask? According to NOAA , in 2014 rainfall in California returned to its normal pattern, though reservoirs will take a while to replenish. Republican presidential candidate Carly Fiorina calls the most recent drought \"a manmade disaster. With different policies over the last 20 years, all of this could be avoided.\" Appearing on Glenn Beck’s radio program, Fiorina added that the \"tragedy\" of California is that the state has \"suffered from droughts for millennia\" and still \"liberal environmentalists have prevented the building of a single new reservoir or a single new water conveyance system over decades during a period in which California's population has doubled.\" \nFrancesco Femia , co-founder of the think tank Center for Climate and Security, speaking with Moyers and Company's John Light, claims \"climate change\" contributed to the civil war in Syria. Various liberals back him up. \nThe Coast Guard Academy graduates deserved better from their command-in-chief. At least Kermit the Frog -- who \"spoke\" at Southampton College on Long Island in 1996 -- was entertaining. President Obama's address was just more hot air on a subject many Americans believe doesn't hold up to scrutiny. For them, Islamic terrorism, not droughts, ice or tornadoes, presents a far greater clear and present danger. \nCal Thomas is America's most widely syndicated op-ed columnist. He joined Fox News Channel in 1997 as a political contributor. His latest book is \" What Works: Common Sense Solutions for a Stronger America \" is available in bookstores now. Readers may email Cal Thomas at tcaeditors@tribune.com.", "external_links": [], "published": "2015-05-26T16:33:00.000+03:00", "crawled": "2015-05-26T16:56:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}