{"organizations": ["Defense Bill Immigration Hawks"], "uuid": "b1e037a1847fd2cb15b1ea6d8bd0da868904cee4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2918968/images/o-IMMIGRATION-DEFENSE-BILL-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/06/immigration-defense_n_7222016.html", "country": "", "title": "Immigration Hawks Say 'Amnesty' Amendment Threatens Passage Of Defense Bill", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Immigration Hawks Say 'Amnesty' Amendment Threatens Passage Of Defense Bill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T19:56:00.000+03:00", "replies_count": 0, "uuid": "b1e037a1847fd2cb15b1ea6d8bd0da868904cee4"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/06/immigration-defense_n_7222016.html", "ord_in_thread": 0, "title": "Immigration Hawks Say 'Amnesty' Amendment Threatens Passage Of Defense Bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Scott Applewhite", "Mo Brooks"], "text": "Immigration Hawks Say 'Amnesty' Amendment Threatens Passage Of Defense Bill Posted: Updated: 3 hours ago Rep. Mo Brooks (R-Ala.) is a strident opponent of President Barack Obama's immigration policies. (AP Photo/J. Scott Applewhite, File) | ASSOCIATED PRESS reddit \nWASHINGTON -- Immigration hard-liners in the House made it clear Tuesday that they're willing to put up a fight over even the smallest measures friendly to undocumented immigrants. \nThe potential revolt is over an amendment to the National Defense Authorization Act from Rep. Ruben Gallego (D-Ariz.) that was approved by the House Armed Services Committee last week. The amendment asks the secretary of defense to consider allowing undocumented young people with work permits under the Deferred Action for Childhood Arrivals program , or DACA, to join the military. \nIt was approved in a 33-30 vote in committee, with support from all Democrats and six Republicans. \nThe amendment doesn't require the Defense Department to change its policy -- rather, it simply asks the secretary to review it. But that was enough to raise the hackles of the most stringent foes of DACA. \nOn Tuesday, 25 House Republicans, led by Rep. Mo Brooks (R-Ala.), signed a letter to Rules Committee Chairman Pete Sessions (R-Texas) with the vague threat that failing to strip the amendment from the bill would jeopardize the passage of the entire legislation. They ask Sessions to remove the amendment in his committee, which determines the terms of debate before bills go to the House floor. The letter was first reported by Breitbart . \n\"If the Rules Committee does not strike Rep. Gallego’s controversial DACA provision, we will offer an amendment to strike the language,\" the lawmakers wrote in the letter, which Brooks' office provided to HuffPost . \"This controversial immigration language greatly increases the risk of the NDAA’s failure to pass the House. The Rules Committee has the power, and indeed the duty, to prevent such a threat to our national security.\" \nThe letter notes that the House has voted multiple times to do away with DACA, which allows undocumented immigrants who came to the U.S. as children years ago to stay and work legally for two years. A planned expansion of the program is currently stalled in the courts. \nA spokeswoman for Brooks said his amendment to remove Gallego's DACA measure has 12 co-sponsors, and more may be added. \nImmigration matters have repeatedly threatened must-pass bills in the House. Most recently, a standoff emerged when some House Republicans insisted that any funding bill for the Department of Homeland Security should end deportation relief programs, and Senate Democrats refused to vote on any bill that would block those policies. DHS only narrowly avoided a shutdown. \nRep. Steve King (R-Iowa) issued a statement last week saying he is ready to fight over what he called an \"amnesty amendment\" to the NDAA. \n\"This will bring about a major fight among those of us who have given our oath to support and defend the Constitution and mean it and those who simply gave their oath,\" King said. \"This is a dark day both for those that defend the Rule of Law and those that seek to keep the United States safe.\" \nIn the Senate, no immigration measures are planned for the NDAA, Senate Armed Services Committee Chairman John McCain (R-Ariz.) told The Hill on Tuesday . \nGallego issued a statement Wednesday saying the measure in question \"shouldn't be a controversial issue.\" He noted that the House Republicans sent their letter on the same day a judge ruled in Arizona that DACA recipients should be allowed to receive in-state tuition. \n“On the same day that a judge in Arizona ruled in favor of in state tuition for dreamers, the extreme right of the Republican Party vowed to continue their attack against immigrant communities -- including against talented, brave and patriotic dreamers who want to serve in our military and fight for our freedom and the values we hold dear,\" Gallego said in the statement. \"A bipartisan group of members in the House Armed Services Committee passed this amendment and there is no reason to strike it from NDAA other than to appease the fringe of the GOP.\" More: ", "external_links": [], "published": "2015-05-06T19:56:00.000+03:00", "crawled": "2015-05-06T22:09:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}