{"organizations": [], "uuid": "6b8b44a4ab26459b3a09684e5a57b71f9102295b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/08/obama-mccain-and-graham-make-huge-mistake-in-egypt/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422603525860.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/08/obama-mccain-and-graham-make-huge-mistake-in-egypt.html", "country": "", "title": "It's Obama, McCain, Graham who made 'huge mistake' in Egypt | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "It's Obama, McCain, Graham who made 'huge mistake' in Egypt | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "6b8b44a4ab26459b3a09684e5a57b71f9102295b"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/08/obama-mccain-and-graham-make-huge-mistake-in-egypt.html", "ord_in_thread": 0, "title": "It's Obama, McCain, Graham who made 'huge mistake' in Egypt | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print U.S. Senators John McCain, left, and Lindsey Graham, right, talk during a press conference in Cairo, Egypt, Tuesday, Aug. 6, 2013. The two senior U.S. senators have urged Egypt's military-backed government to release detained members of the Muslim Brotherhood before starting negotiations. Tuesday's comments came after McCain and Graham met with top military and civilian leaders in Cairo as part of a flurry of international efforts to resolve a standoff with supporters of the ousted president Mohammed Morsi. (AP Photo/Amr Nabil) A supporter of Egypt's ousted President Mohammed Morsi cries while praying outside Rabaah al-Adawiya mosque, where protesters have installed a camp and hold daily rallies at Nasr City in Cairo, Egypt, Sunday, Aug. 4, 2013. (AP Photo/Khalil Hamra) (AP2013) Previous Next \nOn their current trip to Cairo, Senators John McCain (R-Ariz.) and Lindsey Graham (R-S.C.), two of President Barack Obama’s most persistent critics on everything in foreign policy from Syria to Benghazi, have found common cause with him at last. \nAll three fear that the anti-American (and generally anti-human) Muslim Brotherhood (MB), whom they mistakenly see as “moderate,” will disappear from the halls of power in Egypt, our most important Arab ally. They also evidently worry that the MB’s leading figures, such as now-deposed (and arrested) President Mohamed Morsi—who had awarded himself powers greater than any previous ruler in Egypt’s history—will not be free to plot a return to power in an ancient nation that he had nearly destroyed in only one year. \nEchoing earlier White House warnings, the two senior senators suggested that we may cut off our $1.6 billion in annual (mainly military) aid, the very tie that binds our countries together, as it has for more than thirty preciously peaceful years. Not to comply with their demands, McCain and Graham said August 6, would be—as Graham put it--a “huge mistake.” \n[pullquote] \nThe White House, McCain and Graham have warned that the aid may be cut if the MB’s leaders are not freed from detention—they have been under arrest since President Mohammed Morsi was overthrown July 3 by the military in response to the historically huge popular demonstrations at the end of June. (Morsi has since been charged for having been part of a 2011 prison break alleged to have been carried out by Hamas.) More On This... Egypt presidency says diplomacy with Muslim Brotherhood has failed \nThey further demand that the MB be brought into the new transitional government of technocrats appointed by the quietly charismatic (and mysteriously Islamist, but apparently independent) strongman minister of defense, General Abdel-Fattah al-Sisi--who had himself been appointed by Morsi. That new government, headed by Adly Mansour (a Supreme Constitutional Court justice) as interim president and respected economist Dr. Hazem Beblawi as prime minister, claims it has reached out to the MB, which refuses to respond to its overtures. Meanwhile, the Islamists are gathered in two major squares in Cairo, waiting for the security forces to clear them away—and for the chance to be martyred when they do. \nIn response to McCain and Graham's warnings, Mansour denounced what he called “unacceptable interference in internal politics.” In this, even a nation infamous for its political xenophobia can be forgiven for seeing a not-so hidden hand attempting to steer the ship of state. \nBut by blundering this way, Obama, McCain and Graham are joining the departing U.S. ambassador in Cairo, Anne Patterson—widely mocked (with gross inaccuracy) as a hayzaboon , or old crone, for reportedly hectoring Egyptians not to rise up against the elected government (which had turned itself into an Islamist dictatorship)—on a list of new Ugly Americans. She unfortunately gave this advice shortly before the largest demonstrations ever seen in human memory were directed against her suspected client, Morsi. (Reflecting heightened paranoia, her possible successor, Ambassador Robert Ford—who had previously served in Algeria, Bahrain, Iraq and Syria—is under considerable Twitter fire in Egypt, bizarrely accused of having caused the strife that has recently plagued those countries.) \nAnd by going this route, Obama, McCain and Graham are risking one of America’s most crucial alliances. They would do so for a not-so-beautiful friendship with a far from benign band of brothers that actually wants to conquer and rule the world (not just the Middle East) in a revived Islamic caliphate. (It is the same risk that Obama took when, after brief vacillation, he abruptly dumped our country’s long-term “friend,” Hosni Mubarak, in 2011, knowing that Islamists like the MB would likely be the only force capable of winning many votes in the new “democracy.”) \nThe Brother’s goals are hardly secret, despite eight decades of adroit, religiously-sanctioned lying, or taqiyya about their intentions. But they were elected, and so, it is said, we ought to support them. Then again, the U.S. cut off aid when Hamas, the MB’s Palestinian branch, won parliamentary elections in 2006--because they refused to renounce terrorism, recognize the State of Israel, and accept agreements that the previous government had signed. \nThe MB undoubtedly believes that to get what it wants in the short-term—to halt the flow of American cash and equipment to its enemies in the military--is to continue to boycott the bogus “reconciliation” process. (Already, Obama has suspended the scheduled shipment of four F-16s last month, in a move that angered millions of Egyptians.) \nIf an aid stoppage should last, that could lead to the collapse of the transitional government and Morsi’s reinstatement as president—the MB’s irreducible demand. Hence they have resisted the senators’ calls to dialogue with the new regime. There is no obvious reason for the Brotherhood to change this strategy. \nThe estimated eight-to-twelve billion dollars quickly coughed up by Saudi Arabia and the United Arab Emirates to cover emergency imports of diesel fuel and wheat and to rebuild depleted hard-currency reserves are surely crucial for now. But if the military—Egypt’s most prestigious institution and itself a pillar of the economy—should have nowhere else to go, Russia and China are always waiting in the wings, and would love to have a presence on both the Nile and Suez. \nRefusing to recognize that popular will can mean more than just elections, America’s “huge mistake” begins. Given that the ratio of MB opponents to supporters is now perhaps seven-to-one, added to the resentment that most Egyptians feel against any effort to tie vital aid to the tyrannical MB, and the wildly-popular al-Sisi’s own fury at the Brotherhood for pushing him (and most Egyptians) into such a place, it is likely Morsi’s side that will fail. \nAnd with it, our own. \nRaymond Stock, a Shillman-Ginsburg Writing Fellow at the Middle East Forum and a former Assistant Professor of Arabic and Middle East Studies at Drew University, spent twenty years in Egypt, and was deported by the Mubarak regime in 2010. He is writing a biography of 1988 Egyptian Nobel laureate in literature Naguib Mahfouz (1911-2006) for Farrar, Straus & Giroux, and is a prolific translator of his works, most recently \"Before the Throne\" (Anchor Books/Random House, July 2012). ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}