{"organizations": ["Senate", "Joint Chiefs of Staff", "Islamic State", "Reuters", "Obama Nominates New Top U.S. Military Officers Obama Nominates New Top U.S. Military Officers Reuters"], "uuid": "de569047cee96e543ae57fff3979f81696d7bc63", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2915722/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/05/obama-joint-chiefs_n_7215038.html", "country": "", "title": "Obama Nominates New Top U.S. Military Officers", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Nominates New Top U.S. Military Officers", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T21:41:00.000+03:00", "replies_count": 0, "uuid": "de569047cee96e543ae57fff3979f81696d7bc63"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/05/obama-joint-chiefs_n_7215038.html", "ord_in_thread": 0, "title": "Obama Nominates New Top U.S. Military Officers", "locations": ["U.S.", "WASHINGTON", "Asia Pacific"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dunford", "Barack Obama", "Joseph Dunford", "Paul Selva"], "text": "Obama Nominates New Top U.S. Military Officers Reuters reddit WASHINGTON, May 5 (Reuters) - President Barack Obama on Tuesday nominated Marine General Joseph Dunford as the next chairman of the Joint Chiefs of Staff, praising him as a leader who helped shape the changing role of U.S. troops in Afghanistan.Obama urged the Senate to quickly confirm Dunford and his new pick for vice-chairman, Air Force General Paul Selva. He said he would rely on their advice on the fight against Islamic State militants, \"rebalancing\" U.S. military posture in the Asia Pacific region, and investing in cyber defenses. \nPresident Barack Obama nominates Marine Gen. Joseph Dunford Jr. (C) as the next chairman of the Joint Chiefs of Staff and U.S. Air Force Gen. Paul J. Selva (R) to be Vice Chairman, during an event in the Rose Garden at the White House May 5, 2015 in Washington. If confirmed by the U.S. Senate, Gen. Dunford will replace outgoing Chairman Gen. Martin Dempsey. (Photo by Mark Wilson/Getty Images) \"I know Joe. I trust him. He's already proven his ability to give me his unvarnished military advice based on his experience on the ground,\" Obama said, describing the general as \"tireless.\"\"His staff has been known to carry around a voice recorder to keep up with his commands and new ideas,\" Obama said.Dunford will replace Army General Martin Dempsey, who is expected to step down in September.Obama said Selva, the commander of the U.S. Transportation Command, was military adviser to then-Secretary of State Hillary Clinton during the early years of his presidency.\"He's been committed to the partnerships that are a core principle of our national security strategy, whether it's supplying our joint force around the world in operations large and small, to supporting and keeping safe our diplomats and embassy personnel overseas,\" Obama said. (Reporting by Roberta Rampton; Editing by Grant McCool) Also on HuffPost:   ST. PAUL, MN - JUNE 3: Democratic presidential candidate Sen. Barack Obama (D-IL) (R) and his wife Michelle Obama bump fists at an election night rally at the Xcel Energy Center June 3, 2008 in St. Paul, Minnesota. Obama clinched the Democratic presidential nomination following today's primaries in South Dakota and Montana, although his rival Sen. Hillary Clinton (D-NY) has not yet conceded the race. (Photo by Scott Olson/Getty Images) President Barack Obama acknowledges the crowd as he exchanges fist bumps with the audience after speaking at Hyde Park Academy, Thursday, Feb. 14, 2013, in Chicago. (AP Photo/M. Spencer Green) President Barack Obama fist-bumps custodian Lawrence Lipscomb in the Eisenhower Executive Office Building following the opening session of the White House Forum on Jobs and Economic Growth, Dec. 3, 2009. (Official White House Photo by Pete Souza) President Barack Obama does a fist bump with Ethan Gibbs, the son of Press Secretary Robert Gibbs, after arriving by Marine One on the South Lawn of the White House, Washington, DC, April 19, 2009. President Barack Obama returned from the Fifth Summit of the Americas held in Trinidad and Tobago. (Photo by Aude Guerrucci/AFP/Getty Images) SPRINGHILL, WV- MAY 12: Democratic presidential hopeful Sen. Barack Obama (D-IL) (L) bumps fists with Iraq war veteran Paul Scott after playing a game of pool during a stop at Schultzie's Bar & Hot Spot May 12, 2008 in Springhill, W.Va. Sen. Obama and Sen. Hillary Clinton (D-NY) continue to battle for the Democratic presidential nomination. (Photo by Mark Wilson/Getty Images) WASHINGTON - JULY 8: Los Angeles Mayor Antonio Villaraigosa (L) gives a 'fist bump' to presumptive Democratic presidential nominee Sen. Barack Obama (D-IL) during the national convention of the League of United Latin American Citizens (LULAC) at the Washington Hilton July 8, 2008 in Washington, DC. Obama has been recently criticized for moving to the political center after calling for a slowing of withdrawal of troops from Iraq, supporting a proposed wiretap law and government funding of faith-based programs. (Photo by Chip Somodevilla/Getty Images) CHANTILLY, VA- OCTOBER 22: Democratic presidential nominee U.S. Sen. Barack Obama (D-IL) fists bumps with Ethan Gibbs the son of Robert Gibbs the campaign communication director as he arrives at Dulles International Airport October 22, 2008 in Chantilly, Virginia. Obama continues to campaign with election day less than two weeks away. (Photo by Joe Raedle/Getty Images) U.S. Democratic presidential candidate Illinois Senator Barack Obama (right) and North Carolina Governor Mike Easley bump fists at Sen. Obama's surprise appearance at a North Carolina Democratic Party dinner October 4, 2008 at the The Grove Park Inn in Asheville, North Carolina. (Photo by STAN HONDA/AFP/Getty Images) BAGHDAD, IRAQ - APRIL 7: In this handout provide by the White House, U.S. President Barack Obama (L) receives a fist-bump from a U.S. soldier as he greets hundreds of U.S. troops during his visit to Camp Victory on April 7, 2009, in Baghdad, Iraq. Obama is serving as the 44th president of the U.S. and the first African-American to be elected to the office of president in the history of the United States. (Photo by Pete Souza/White House via Getty Images) WASHINGTON - APRIL 8: In this handout provide by the White House, U.S. President Barack Obama (L) holding a football, offers a fist-bump, to senior staff member Pete Rouse (R), during a meeting with senior advisors in the Oval Office of the White House on April 8, 2009, in Washington, DC. Obama is serving as the 44th president of the U.S. and the first African-American to be elected to the office of president in the history of the United States. (Photo by Pete Souza/White House via Getty Images) U.S. President Barack Obama gives a student a fist bump while touring the Wind Turbine Manufacturing and Fabrication Lab at Lorain County Community College, in Elyria, Ohio, January 22, 2010. Obama is visiting Ohio to tour local businesses and hold a town hall meeting on jobs and the economy. (Photo by SAUL LOEB/AFP/Getty Images) U.S. President Barack Obama bumps fists with a school children after reading Christmas book 'The Polar Express' to an audience of elementary school children at the Richard England Clubhouse and Community Center in Washington, DC, on December 21, 2009. (Photo by JEWEL SAMAD/AFP/Getty Images) US President Barack Obama fist-bumps with a supporter after speaking at a fundraiser for Senator Michael Bennet Feb. 18, 2010, at the Fillmore Auditorium in Denver. (Photo by MANDEL NGAN/AFP/Getty Images) U.S. President Barack Obama (R) fist bumps with Marvin Nicholson as he plays golf at Farm Neck Golf Club in Oak Bluffs on Martha's Vineyard, Massachusetts, on August 26, 2010. The U.S. First Family is vacationing on the Island until Aug. 29. (Photo by JEWEL SAMAD/AFP/Getty Images) WASHINGTON, DC - APRIL 25: U.S. President Barack Obama gives a fist bump to a young boy during a 'Let's Move' tennis clinic during the White House Easter Egg Roll on the South Lawn of the White House April 25, 2011 in Washington, DC. About 30,000 people are expected to attend the 133-year-old tradition of rolling colored eggs down the White House lawn. (Photo by Chip Somodevilla/Getty Images) U.S. President Barack Obama gives a young boy a fist bump as he greets guests after speaking about the economy at Shaker Heights High School in Shaker Heights, Ohio, a suburb of Cleveland, on Jan. 4, 2012. Obama announced plans to appoint Richard Cordray as acting head of the Consumer Financial Protection Bureau in a recess appointment, bypassing Congress and setting up a bitter election-year legal showdown with Republicans. (Photo by SAUL LOEB/AFP/Getty Images) President Barack Obama fist bumps service members after he addressed troops at Bagram Air Field, Afghanistan, Wednesday, May 2, 2012. (AP Photo/Charles Dharapak) U.S. President Barack Obama (L) asks for a fist bump from a young girl as he speaks with patrons outside the Kozy Corner restaurant in Oak Harbor, Ohio, July 5, 2012, where he made an unannounced visit to speak with supporters while on a bus tour of Ohio and Pennslyvania. (Photo by JIM WATSON/AFP/GettyImages) WASHINGTON, DC - JULY 18: U.S. President Barack Obama gives a fist bump to Baylor University basketball guard Terran Condrey while welcoming the 2012 NCAA Women’s Basketball champions in the East Room of the White House July 18, 2012, in Washington, DC. The Baylor Lady Bears became the first NCAA basketball team to complete a 40-0 season by defeating Notre Dame 80-61 in the NCAA women's championship. (Photo by Chip Somodevilla/Getty Images) Point guard Odyssey Sims gets a fist bump from President Barack Obama at a ceremony honoring the 2012 NCAA Women's basketball champions Baylor University Bears in the East Room at the White House in Washington, Wednesday, July 18, 2012. (AP Photo/Charles Dharapak) U.S. President Barack Obama (L) fist bumps with supporters after delivering remarks during a campaign event at Truckee Meadows Community College in Reno, Nevada, August 21, 2012. (Photo by JIM WATSON/AFP/GettyImages) President Barack Obama pounds fists with a supporter after speaking at a campaign event at The Memorial Athletic and Convocation Center at Kent State University Wednesday, Sept. 26, 2012, in Kent, Ohio. (AP Photo/Tony Dejak) U.S. President Barack Obama fist-bumps with a woman during a lunch visit to the West Tampa Sandwich Shop and Restaurant in Tampa, Florida, September 8, 2012, during the first day of a 2-day bus tour across Florida. (Photo by SAUL LOEB/AFP/GettyImages) U.S. President Barack Obama (L) fist bumps a supporter after speaking at a campaign rally in Nashua, New Hampshire, on October 27, 2012. (Photo by JIM WATSON/AFP/Getty Images)  Share ", "external_links": [], "published": "2015-05-05T21:41:00.000+03:00", "crawled": "2015-05-05T23:27:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}