{"organizations": [], "uuid": "1abb947ed6771c6606283d8d90086a85980999ed", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/pope-francis/feed", "section_title": "Pope Francis on Huffington Post", "url": "http://www.huffingtonpost.com/donald-kerwin/the-long-journey-of-faith-communities-on--immigration_b_7295372.html", "country": "US", "title": "Donald Kerwin: The Long Journey of Faith Communities on Immigration", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Donald Kerwin: The Long Journey of Faith Communities on Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-05-18T15:38:00.000+03:00", "replies_count": 0, "uuid": "1abb947ed6771c6606283d8d90086a85980999ed"}, "author": "Donald Kerwin", "url": "http://www.huffingtonpost.com/donald-kerwin/the-long-journey-of-faith-communities-on--immigration_b_7295372.html", "ord_in_thread": 0, "title": "Donald Kerwin: The Long Journey of Faith Communities on Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nFor more than a decade, the U.S. immigration debate has been dominated by the legislative battle over comprehensive immigration reform (CIR). In the last few years, the debate has shifted to the scope of the President's discretion on how to enforce the law and, in particular, who to target and who to leave alone. \nStates and localities have also grappled with strategies to integrate immigrants (on the one hand) and to assist in federal immigration enforcement (on the other). Faith communities have presented a remarkably united front on these issues, advocating for the full participation of immigrants in our nation's life, the creation of communities unified by shared values, and the conversion of hearts and mind that would facilitate more visible reforms. These struggles have resonated on moral and intellectual grounds. A substantial unauthorized population is inevitable if the underlying legal immigration system -- which has not been overhauled for 50 years -- continues to leave millions of family members of US citizens and lawful permanent residents (LPRs) in multi-year visa backlogs and reserves only 5,000 visas for less-credentialed workers. \nConversely, an earned legalization program and reform of the legal immigration system would contribute to a more manageable enforcement load and, thus, potentially to a more effective and humane enforcement system. The inter-connectedness of these systems is the strongest argument for CIR, but does not preclude a graduated approach to reform. \nAs it stands, it would be difficult to find a faith community not confronted with divided families or an immigrant family untouched by the system's corrosive, day-to-day pressure. In a Catholic parish in suburban Washington DC, for example, the pastor has taken to praying, after the baptismal blessing, that the child's family never be divided by the immigration system. \nReligious groups have been particularly energized by the callous, even sacrilegious view of immigrants as illegals, criminals and threats, advanced by anti-immigrant politicians, media outlets and advocacy groups. \nTo people of faith, nobody can be illegal. If this were possible, then God -- who created us all -- would be a terrible transgressor. And who are these criminals? Faith-based groups know that they include: \n• Most of the 4.4 million family members of US citizens and LPRs whose visa petitions have been approved, but who are stuck in visa backlogs. \n• 3.9 million parents of US citizens and LPRs who would be potentially eligible for a reprieve from removal and employment authorization under the Deferred Action for Parents of Americans and Lawful Permanent Residents (DAPA) program. \n• 1.9 million persons who have resided in the United States for 20 years or more, and 6.6 million for 10 years or more. \n• 1.5 million persons brought to the United States as children who would qualify for the expanded Deferred Action for Childhood Arrivals (DACA) program. \n• 5.2 percent (a disproportionately large share) of the US workforce, including those we entrust to care for our children and elderly, to pick our crops, to prepare our food, to tend our lawns, and to build our homes. \nThey are family members, friends, co-religionists and colleagues. They are people with whom our lives are inextricably bound. A parish priest in El Paso articulates this insight beautifully with the Spanish phrase: \"Tu eres mi otro yo.\" You're my other self. That's how faith communities see immigrants and each other. \nFaith-based groups have been pilloried for supporting \"amnesty,\" a word market-tested to inflame people against reform and to cement the idea that unauthorized immigrants are criminals. Since the rest of us benefit from the low-cost services and goods provided by unauthorized immigrants and their immense contributions to the Social Security and Medicare programs -- people of faith occasionally ask: who should be forgiving who in this debate? But even accepting the word's premise, what's offensive about a term that connotes forgiving and forgetting transgressions? Don't Christians view themselves as the beneficiaries of the greatest of all amnesties? Isn't that the Easter message? And weren't the sabbatical and Jubilee years in Hebrew Scripture --which restored all members of the community to membership and a full share of the community's goods- amnesties of a sort? \nIn March, the House Judiciary Committee reported out of committee a bill titled the Comprehensive Mass Deportation Act. Among other measures, it would criminalize unlawful presence. It has never been a crime simply to be without immigration status -- to breathe or eat or walk or sleep without papers. The Committee wanted to make a symbolic point, but what point? For faith communities, symbols mediate deeper realities. In this case, the bill sends a sign that certain people fall totally outside the law's protections and bounds, It is an instrument of derision and marginalization. Its champions remind us that immigrants not only symbolize who we are, they also expose who we are -- for better and worse. \nAt present, broad reform legislation appears to be years away and the DAPA and expanded DACA programs have been stalled in court. What should faith communities do during this lull? First, they should redouble their work. They do not need Congress or the courts to pursue a legalization program. Faith-based groups have long been assisting hundreds of thousands of persons per year to become LPRs and citizens, to reunify with close family members, to secure protection from persecution, torture, trafficking and domestic violence, and to gain a foothold in our nation. To paraphrase St. Francis, they have been preaching the Gospel, sometimes using words. \nIn the short term, even if DAPA and expanded DACA were delayed for an extended period, there would still be: \n• 14 or 15 percent of the U.S. unauthorized population according a recent study who are eligible for an immigration benefit or relief which would put them on a path to citizenship. \n• 500,000 people who are eligible for DACA who have not come forward, and another 80,000 to 90,000 who are aging into the program each year. \n• 236,000 unauthorized parents of adult USCs who, as a result, are potentially eligible for family-based visas. \n• Nearly nine million LPRs who, based on their years in LPR status, qualify for citizenship. \nAll of this work would benefit DAPA, expanded DACA, and (one day) a legalization program. \nFaith communities can also take solace in being on the right and, ultimately, the winning side of this struggle. The United States has 41 million foreign-born residents and another 17 million minor children of immigrants. Between 2012 and 2050, the second generation is projected to grow from 36 to 81 million . Ultimately immigrants and their children will not be denied full membership in the United States. Nor will they forget those who helped or thwarted them on their journeys. \nFinally, faith communities can play their historic role in promoting the integration and well-being of immigrants and their children. They have a lot to teach the nation on this score. Many see integration as a process of assimilation into a dominant culture. Faith communities see the need to humanize both native and immigrant cultures, and to build unity based on shared values. \nMany good people think that immigrants should be welcomed into the nation, their communities and their institutions. They should be, but as Cardinal Tagle, the Archbishop of Manila, recently put it: \"No country is a host. God is the host. Everybody else is a traveler, steward or guest.\" Hospitality is not a matter of one group welcoming others, it is about building a home for all. \nSome see integration as something that happens to immigrants. Faith communities know that immigrants integrate, not institutions. They also know that integration often occurs through the pursuit of civic, religious and social values; that is, through the building of just communities. Some see integration solely in socio-economic terms. Faith communities support the development of persons in all of their dimensions, including the spiritual. Some argue that integration should only be a priority for legal immigrants, but faith communities see integration as a process of creating communities in which all can flourish and nobody is left behind. \nIn immigrants, faith communities see self-sacrificing, hardworking people who have always been a source of religious and civic renewal in our nation. Pope Francis - who will soon be addressing Congress -- articulated this vision of immigrants and community in his 2014 Message for World Day of Migrants and Refugees . He said: \n[M]igrants and refugees do not only represent a problem to be solved, but are brothers and sisters to be welcomed, respected and loved. They are an occasion that Providence gives us to help build a more just society, a more perfect democracy, a more united country, a more fraternal world and a more open and evangelical Christian community. Migration can offer possibilities for a new evangelization, open vistas for the growth of a new humanity foreshadowed in the paschal mystery: a humanity for which every foreign country is a homeland and every homeland is a foreign country. \nNot a burden, a gift. More:", "external_links": [], "published": "2015-05-18T15:38:00.000+03:00", "crawled": "2015-05-18T23:18:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}