{"organizations": [], "uuid": "adc4566e36cff829a6f9883330719244ecc1932b", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/hillary%20dreamers%20latino.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/22/clinton-new-hire-hails-from-group-that-repeated-clashed-with-her-on-immigration/", "country": "", "title": "Clinton's new hire hails from group that's repeatedly clashed with her on immigration | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Clinton's new hire hails from group that's repeatedly clashed with her on immigration | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "adc4566e36cff829a6f9883330719244ecc1932b"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/22/clinton-new-hire-hails-from-group-that-repeated-clashed-with-her-on-immigration/", "ord_in_thread": 0, "title": "Clinton's new hire hails from group that's repeatedly clashed with her on immigration | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton"], "text": "Fox News Latino \nOne of Hillary Clinton’s most recent hires is part of a group that has heckled and interrupted the presidential candidate’s speeches and is known for confronting lawmakers at public events about their stance on immigration. \nClinton’s new hire, Lorella Praeli, is United We Dream’s director of policy and advocacy, and is a former undocumented immigrant who received her legal permanent residence – more commonly referred to as the “green card” – several years ago. She is expected to begin her job as the campaign’s Latino outreach director in June. \nUnited We Dream is an assertive and media-savvy organization of former and current undocumented immigrants who were brought to the United States as minors, and have been pushing for the immigration laws to change to allow them and their relatives to legalize their status. \nThey are also known for their in-your-face confrontations of politicians, and – as in the case of Clinton’s speech in Maryland last year – when she stood at a podium last fall to stump for Lt. Gov. Anthony G. Brown, the Democratic gubernatorial nominee – of trying to seize the spotlight and headlines from them. \nAfter the hiring was announced, United We Dream made a point to say that they will continue putting pressure on Clinton, even though one of their own will begin working for her. \n\"As Dreamers and families who continue to be undocumented, we have dedicated ourselves to our communities not a party and we we will continue to hold accountable all the presidential candidates,\" they said in a statement. \nThe hiring of Praeli underscores how a group that had long been criticized and brushed off by both sides of the immigration debate – even immigration advocates complained they were too provocative and radical – is becoming an influential force in the U.S. \n“It shows the evolution of the youth movement,” said Mario Carrillo, the communications manager for United We Dream. “We’ve never been afraid of holding any politician accountable.” \nBut critics say the appointment shows Clinton is kowtowing to a group that doesn’t have the best interest of the country in mind. \n\"Hiring Lorella Praeli is a clear signal that Ms. Clinton is actually serious about her promise to double down on Obama’s executive action with regard to amnesty,\" said Bob Dane, communications director for the Federation for American Immigration Reform. \"If she does that, any remaining vestige of immigration enforcement will disappear faster than her State Department emails.\" \nCarrillo, who is a U.S. citizen but was undocumented as a child, said that this is a great step for Praeli. \n“We have people in prominent roles in presidential campaigns” as well as other jobs, he said, referring to members of his organization as well as young people in the immigration movement in general. \nLast year, members of United We Dream met with Homeland Security Secretary Jeh Johnson to talk to him about the impact that deportations have had on families in the United States, and to push for an expansion of a 2012 initiative by President Barack Obama that suspended deportation for undocumented immigrants brought as minors, and for scaling back the detention of immigrants, among other things. \nToward the end of the year, Obama announced executive actions expanding the 2012 initiative to include more youths and undocumented parents of U.S. citizens and legal permanent residents. \nLast summer, United We Dream led the criticism of Hillary Clinton after she suggested that unaccompanied minors from Central America who had approached the U.S.-Mexico border in growing numbers – saying they were fleeing violence – should be returned to their countries. \n“She has been inconsistent,” Carrillo, 30, said of Clinton, “starting with the debates of the [2008] presidential cycle. It was unclear where she stood on driver’s licenses for undocumented immigrants. And even last year, when we had the crisis of children fleeing violence crossing the border, she made statements that went very much against what we believe in.” \nAt the Maryland event, as security removed one group of United We Dream hecklers, another group started yelling at Clinton, and when they were removed, yet another group picked up where they had left off. \nThe demonstrators told reporters that they wanted to start putting pressure on her in the hope that she would articulate, in clear terms, where she stood on various aspects of immigration reform. \nYoung undocumented immigrants and their supporters also heckled Clinton when she was in North Carolina stumping for Sen. Kay Hagan, who drew the ire of many Latinos and immigrant advocates by voting against the Dream Act, a measure that would have given undocumented immigrants brought to the United States as minors a chance to legalize their status if they meet a strict set of criteria. \nIn North Carolina and in Maryland, Clinton spoke about immigration after Dreamers, as they're called, began heckling. \nIn recent weeks, members of United We Dream met with Clinton before her speech in Nevada, which she visited shortly after announcing her candidacy for president. \nBefore Clinton's speech, Cristina Jimenez, managing director United We Dream, said in a press release, “Our message to Hillary Clinton, and any candidate, is that we expect them to promote existing deportation relief programs and pledge to expand deportation protections should they be elected. Simply declaring support for immigration reform in Congress is not enough.” \nIndeed, in Clinton's speech, the candidate vowed to go even further than Obama in offering protections from deportation for undocumented immigrants. \nProponents of stricter immigration policies have criticized Clinton for her support of Obama's executive action and for offering leniency to undocumented immigrants. \n\"… If her campaign genuinely wants to improve the lives of Hispanics and win their votes, amnesty and abusing executive power is not the way to do it,\" said Dane, of FAIR. \"Her campaign should understand that enforcing our laws (as Congress intended) and reducing immigration will create a tighter labor market where fewer people are competing for jobs, wages rise and people move up, especially newly arrived legal immigrants.\" \nImmigrant youth groups, meanwhile, lauded Clinton's Nevada speech on immigration, but tempered the praise with the warning that they do not want a president who is long on rhetoric and short on fixing the immigration system and curbing deportations. \n\"Hillary has just shared some great new rhetoric,\" said Cesar Vargas and Erika Andiola, co-Directors of the Dream Action Coalition, in a statement after her speech. \"As a community, however, we have certainly been burned before: President Obama’s rhetoric has always been kind on immigration, but he has still deported more than 2 million immigrants...Now we need to see if she will stay consistent and follow up?\" \nElizabeth Llorente can be reached at elizabeth.llorente@foxnewslatino.com. Follow her on https://twitter.com/Liz_Llorente \nLike us on Facebook ", "external_links": [], "published": "2015-05-22T03:00:00.000+03:00", "crawled": "2015-05-22T23:32:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}