{"organizations": ["Treasury Department", "Senate", "Congress"], "uuid": "ee7620a41c7bb59ac7a7bd4dba67b45ce534165f", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/19/politics/hillary-clinton-trade-issues-iowa-trip/index.html", "country": "", "title": "Hillary Clinton finds problems with Obama TPP trade proposal - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Hillary Clinton finds problems with Obama TPP trade proposal - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T07:25:00.000+03:00", "replies_count": 0, "uuid": "ee7620a41c7bb59ac7a7bd4dba67b45ce534165f"}, "author": "", "url": "http://www.cnn.com/2015/05/19/politics/hillary-clinton-trade-issues-iowa-trip/index.html", "ord_in_thread": 0, "title": "Hillary Clinton finds problems with Obama TPP trade proposal - CNNPolitics.com", "locations": ["Pacific Rim", "Mexico", "U.S.", "Canada", "Massachusetts", "Australia", "Iowa", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Hillary Clinton", "Bernie Sanders", "Barack Obama", "Elizabeth Warren", "Obama"], "text": "Hillary Clinton's 'evolving' policies 05:24 Cedar Falls, Iowa (CNN) Hillary Clinton took aim Tuesday at two core components of a massive free trade pact that President Barack Obama is negotiating — signaling some agreement with the deal's liberal critics. The Democratic front-runner in the 2016 presidential race said she wants to see rules included in the Trans-Pacific Partnership that would penalize countries for driving down the value of their currencies in order to give their exports a price advantage in the U.S. market. And she said she's concerned about a provision that would give \"corporations more power to overturn health and environmental and labor rules than consumers have.\" \"I think that is a problem,\" Clinton said during a roundtable event in Iowa, when one woman participating in the event asked her about the deal. It's as close to staking out a clear position on the trade deal that Clinton has come — though she left wiggle room Tuesday. \"I want to judge the final agreement. I have been for trade agreements; I have been against trade agreements,\" she said. RELATED: Bernie Sanders challenges Hillary Clinton's trade record Her comments come as the Senate prepares to vote on trade promotion authority, a measure that would allow Obama to finalize the Pacific Rim deal and submit it to Congress for a vote with limited debate and no amendments. That authority, negotiators say, is crucial to getting other countries to sign off on a final deal. Those two items are central to the critique that trade unions, environmental and public health groups have made against the 12-country Pacific Rim pact, which would link 40% of the world's economy, including Japan, Australia, Canada and Mexico. Currency manipulation is not part of the talks. U.S. trade negotiators have instead said currency issues are best left to the Treasury Department, and that including them in the trade talks could be a deal-breaker for other countries. Democrats are pushing to amend the trade promotion authority bill to force Obama to address currency in the trade deal. The amendments being pushed, Clinton said, have \"some merit.\" What is part of the negotiations, though, is a wonky item known as an \"investor-state dispute settlement\" mechanism. It would give corporations the right to challenge, to an independent, international arbiter, whether countries' rules and regulations meet their free trade obligations. Democratic Sen. Elizabeth Warren of Massachusetts has raised that issue as the key reason she wants to see the Trans-Pacific Partnership rejected. ", "external_links": [], "published": "2015-05-20T07:25:00.000+03:00", "crawled": "2015-05-20T07:28:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}