{"organizations": [], "uuid": "4ae86f582d882ad53cb5081272d0819237531203", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2952954/images/o-OBAMA-TEA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/14/dan-pfeiffer-obama_n_7286986.html", "country": "", "title": "Former Obama Adviser Wishes Obama 'Could Sit In Everyone's Living Room' To Connect With Them", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Former Obama Adviser Wishes Obama 'Could Sit In Everyone's Living Room' To Connect With Them", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T01:56:00.000+03:00", "replies_count": 0, "uuid": "4ae86f582d882ad53cb5081272d0819237531203"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/14/dan-pfeiffer-obama_n_7286986.html", "ord_in_thread": 0, "title": "Former Obama Adviser Wishes Obama 'Could Sit In Everyone's Living Room' To Connect With Them", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Former Obama Adviser Wishes Obama 'Could Sit In Everyone's Living Room' To Connect With Them Posted: reddit \nBefore he entered politics, President Barack Obama worked as a community organizer on Chicago’s South Side. Much of his work involved individual interactions with local residents. Later, his 2008 and 2012 presidential campaigns tied much of their success to the same type of grassroots organizing and personal contact with voters. \nLongtime Obama adviser Dan Pfeiffer thinks this kind of retail politics could help Obama fight through the partisan vitriol that he has faced throughout his presidency. \n“He often says that the reason he won the Iowa caucuses was he got to go sit in everyone’s living rooms and basically be there every morning with the campaign there for a year and a half,” he said in an interview at the SkyBridge Alternatives, or SALT, Conference in Las Vegas last week. “If he could do that for the country, go and sit in everyone's living room and meet people, he doesn’t think that he would get a lot more votes than he did, but people would feel differently about him, and [he could] break through the Fox News, right-wing caricature -- you know, the America-hating, Kenyan-born socialist schtick.” \nHe stressed that even if people disagreed with his policy positions, they could at least respect his personality. “He is a very good, decent person who really likes people,” he said. “It would drain some of the vitriol out of our politics.” \nThe former White House communications director also discussed the burdens Obama has faced as the first African-American president, particularly when weighing how to respond to the numerous instances of police brutality against young black men. \n“I’m not sure there’s a lot more he can do,” he said. “It makes it harder sometimes for an African-American president. Like if he gets involved in a situation too early, like in Ferguson or somewhere else, it could inflame the other side in ways that are not constructive, so he has to be very careful where he chooses to do that.” \nThe black community in particular has frequently criticized Obama for not taking a firm stance on criminal justice reform and racial injustice in the wake of the deaths of Michael Brown, Eric Garner, Tamir Rice and many others. But when Obama did speak out against the death of Trayvon Martin in 2012, saying that “if I had a son, he’d look like Trayvon,” his very personal and heartfelt remarks were politicized by right-wing critics, epitomizing the political dilemma that Pfeiffer described. Newt Gingrich, then a GOP presidential candidate, accused Obama of only empathizing with black people rather than the whole country. \n“Is the president suggesting that if it had been a white who had been shot, that would be OK because it didn’t look like him?” Gingrich said. Also on HuffPost:   President Barack Obama holds a beer during a visit to Gator's Dockside restaurant in Orlando, Florida, on September 8, 2012 during the first day of a 2-day bus tour across Florida. AFP PHOTOS/SAUL LOEB Obama picks up a beer during a visit to Gator's Dockside restaurant in Orlando, Florida, September 8, 2012 during the first day of a 2-day bus tour across Florida. AFP PHOTO / Saul LOEB Obama drinks a beer at Gator's Dockside restaurant in Orlando. AFP PHOTO / Saul LOEB Obama gets a beer and a pork chop as he visits the Iowa State Fair in Des Moines on August 13, 2012 during an unannounced stop on his three-day campaign bus tour. AFP PHOTO/Jim WATSON Obama has a beer with Mike Cunningham III and other workers at the beer stand at the Iowa State Fair, Monday, Aug. 13, 2012. (AP Photo/Carolyn Kaster) Obama drinks a beer as he sits with his wife Michelle, daughter Malia, and Vice President Joe Biden, as the U.S. Senior Men's National Team and Brazil play during a pre-Olympic exhibition basketball game at the Verizon Center on July 16, 2012 in Washington, D.C. (Photo by Patrick Smith/Getty Images) Obama shares a beer with Suzanne Woods (R) and Jennifer Klanac (L) during at Ziggy's Pub and Restaurant Amherst, Ohio, July 5, 2012, during an unannounced visit while on a bus tour of Ohio and Pennslyvania. AFP PHOTO/Jim Watson Obama raises his glass while drinking Guinness at The Dubliner pub on March 17, 2012 in Washington. Obama went to the bar to celebrate St. Patrick's Day. AFP PHOTO/Brendan SMIALOWSKI Obama drinks a Guinness beer at The Dubliner pub on March 17, 2012 in Washington. AFP PHOTO/Brendan SMIALOWSKI Obama holds up a bottle of beer as he delivers a case of White House brewed beer to the fire fighters at Fire Station No. 14, during an unscheduled stop, Tuesday, Sept. 4, 2012, in Norfolk, Va. (AP Photo/Pablo Martinez Monsivais) In this July 16, 2012 file photo, Obama sips his beer as he watches Team USA and Brazil during the first half of an Olympic men's exhibition basketball game, in Washington. (AP Photo/Alex Brandon, File) In this July 5, 2012 file photo, Obama has a beer as he talks with patrons as he stops for a beer at Ziggy's Pub and Restaurant in Amherst, Ohio. (AP Photo/Susan Walsh, File) Obama stops for a beer at The Pump House, a pub and grill, Tuesday, Aug. 14, 2012, in Cedar Falls, Iowa, during a three day campaign bus tour through Iowa. (AP Photo/Carolyn Kaster) Obama clinks beer glasses with unemployed construction workers as they sit down for a discussion at the Harp and Celt Restaurant and Irish Pub in Orlando, Florida, October 11, 2011. AFP PHOTO / Saul LOEB The Obamas sip Guinness at a pub as they visit Moneygall village in rural County Offaly, Ireland, where the President's great-great-great grandfather Falmouth Kearney hailed from, on May 23, 2011. Obama landed in Ireland on May 23, 2011 for a visit celebrating his ancestral roots, kicking off a four-nation European tour. AFP PHOTO/ JEWEL SAMAD In this July 30, 2009 file photo, Obama and Vice President Joe Biden have a beer with Harvard scholar Henry Louis Gates Jr., second from left, and Cambridge, Mass., police Sgt. James Crowley in the Rose Garden of the White House in Washington. (AP Photo/Alex Brandon, File)  Share ", "external_links": [], "published": "2015-05-15T01:56:00.000+03:00", "crawled": "2015-05-15T01:56:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}