{"organizations": ["Weihergasse", "National Forest Therapy Center", "Hammam & Spa", "MGM Grand", "Umhlanga Rocks", "Oyster Box Spa", "University of Eastern Finland", "Avicenna", "Global Spa", "Psammotherapy Middle Eastern", "CNN", "Trout Point Lodge"], "uuid": "4f4cff645de5b06e1a7b27b0b7e079c4a2f96666", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/07/travel/new-spa-treatments/index.html", "country": "", "title": "Marijuana and forest bathing: New spa trends - CNN.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Marijuana and forest bathing: New spa trends - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T05:17:00.000+03:00", "replies_count": 0, "uuid": "4f4cff645de5b06e1a7b27b0b7e079c4a2f96666"}, "author": "", "url": "http://www.cnn.com/2015/05/07/travel/new-spa-treatments/index.html", "ord_in_thread": 0, "title": "Marijuana and forest bathing: New spa trends - CNN.com", "locations": ["United States", "England", "Amsterdam", "Newfoundland", "Fogo Island", "Bassenthwaite Lake", "Durban", "Park Hyatt Manhattan", "South Africa", "S. Las Vegas Blvd.", "East Kemptville", "Netherlands", "Cumbria", "Las Vegas", "Finland", "Lighthouse Road", "Tucson", "New York City", "New York", "Fogo Island Inn", "Canada", "Bern", "North Karelia", "Arizona", "MGM Las Vegas", "Nova Scotia", "Umhlanga", "Colorado", "Middle Eastern", "Japan", "E. Rockcliff Road", "South Korea"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Laura Powell", "Spa Nalai", "Keswick", "Joe Batt", "Mark Liponis", "Mia Kyricos", "Cleopatra"], "text": "Blissful nothingness – Fogo Island Inn in Newfoundland, Canada proudly promotes silence in its marketing material. Hide Caption 8 of 9 9 photos Stay Well Rooms at MGM Las Vegas – Stay Well Rooms at the MGM Grand in Las Vegas are designed to enhance rejuvenating sleep. This mirror even provides \"wake up\" light therapy. Hide Caption (CNN) Walking in the woods, cannabis day spas and rolling around in sand. These are just a few of the hottest trends in wellness according to SpaFinder Wellness 365 , which claims to be the world's largest spa media and marketing company. But which trends will turn out to be fads and which will stick? Strange as they sound, it's worth remembering that some pretty odd wellness practices have come and gone through the ages. Cleopatra indulged in milk baths and mud treatments -- variations of which can still be enjoyed today. For some reason, though, bloodletting and leeches didn't manage to survive the test of time. Distinguishing a useful practice from snake oil is a far easier exercise in today's wellness world. \"Science is now able to analyze wellness practices to prove which can be helpful and which are not,\" says Dr. Mark Liponis, corporate medical director for Arizona-based Canyon Ranch . \"As a result, there will be a greater adoption of therapies when science confirms their value.\" Marijuana day spas Liponis points out that numerous studies are being conducted on the benefits of marijuana, such as its usefulness in stress management and symptom alleviation. SpaFinder's 2015 Report on Global Spa and Wellness Trends notes that cannabis wellness is experiencing a high. For decades, Amsterdam, with its \"coffee shops,\" has been Cannabis tourism central. A recent visitor survey noted that 16.5% of visitors admit that coffee shops/soft drugs is one of the main reasons for visiting, although marijuana use is a legal gray area in the Netherlands. Given recent decriminalization laws in the United States, cannabis tourists may be trading out a Dutch treat for a Rocky Mountain high. Colorado has been ahead of the pack in terms of legalizing recreational usage, to the point where \"bud and breakfast\" inns, luxury cannabis tours and the \"the world's first cannabis day spa\" have sprouted up. Although state tourism officials deny the correlation, Colorado has been experiencing an increase in tourism since the law was enacted. According to SpaFinder, a 2014 study discovered that out-of-state visitors account for 44% of marijuana sales in larger cities and up to 90% in mountain resorts. Forest bathing Forest bathing, an import from Japan, has nothing to do with water and you don't have to get naked to do it. Basically, it's a wander through the woods, with all senses keenly open to the sights, sounds and smells therein. The Japanese government coined the term in 1982 ... a translation of \"shinrin-yoku,\" meaning \"taking in the forest atmosphere.\" Since then, the government has funded forest-therapy studies, showing impacts ranging from lowering blood pressure to alleviating depression. Research like this has made forest bathing a pillar of preventive medicine in highly urbanized Japan. But now, walking in the woods for wellness is taking root around the world. According to the SpaFinder study, South Korea is developing a multimillion dollar National Forest Therapy Center. In Canada, the Trout Point Lodge ( 189 Trout Point Road, East Kemptville, Nova Scotia; +1 902 482 8360 ) is a center for forest bathing, as is Armathwaite Hall in England ( Bassenthwaite Lake, Keswick, Cumbria; +44 17687 76551) . Um, didn't this used to be called hiking? Psammotherapy Middle Eastern and Islamic health traditions date back more than two millennia. The hammam experience is the ritual the world knows best. The deep-cleansing practice of scrubbing, soaping and pummeling is now gaining steam beyond its traditional borders. For example, there's an authentic hammam circuit at the Hammam & Spa Oktogon in Bern ( Weihergasse 3, Bern;. +41 31 311 31 01 ). In South Africa, guests can experience a Turkish-style hammam at Oyster Box Spa in Umhlanga, Durban ( 2 Lighthouse Road, Umhlanga Rocks, Durban; +27 31 514 5000 ). The latest Middle Eastern trend to go West is psammotherapy. This is the therapeutic application of warm sand to alleviate aches and pains. As far back as 1000 AD or so, the Persian philosopher Avicenna wrote about sand's anti-inflammatory properties. Back in the day, people just dug a hole in the sand and enveloped themselves in it. Nowadays, it's done with less messy sand tables. In August 2014, Spa Nalai at the Park Hyatt Manhattan ( 153 West 57th St., New York; +1 646 774 1234 ) became the first place in New York City to offer psammotherapy sand table massages. Silent treatments Silence may be golden, but its value is largely underrated these days. \"In the past, luxury was defined by cushy bathrobes and the thread count of sheets,\" says SpaFinder chief brand officer Mia Kyricos. \"But today's noise-saturated world, silence, solitude, space -- these are the true definitions of luxury.\" Finland is tapping into the rising demand for quiet with an entire tourism campaign centered around the tagline \" Silence, please .\" Researchers at the University of Eastern Finland are even studying ways to make silence a tourism asset in the sparsely populated North Karelia region. Finland is far from the only place where silence is a virtue. Fogo Island Inn ( Joe Batt's Arm, Newfoundland; +1 709-658-3444 ), which opened two years ago in Newfoundland, Canada, proudly promotes silence in its marketing material, boasting of \"miles and miles of blissful nothingness.\" Sleep helpers Of course, silence is just one element in getting a good night of sleep. Staying well means sleeping well. But in today's 24/7 world, something's gotta give, and that something is usually sleep. At Canyon Ranch ( 8600 E. Rockcliff Road, Tucson, Arizona; +1 520 749 9000 ) in Arizona, there's an actual lab where visitors can be monitored with sensors to diagnose sleep patterns. Still, most places promoting \"sleep therapy\" are not hooking snoozers up to machines. It's more about comfort, environment and special lighting. For example, Stay Well Rooms at the MGM Grand in Las Vegas ( 799 S. Las Vegas Blvd., Las Vegas; +1 702-891-1111 ) are specifically designed to enhance rejuvenating sleep. Features include blackout shades; energizing light therapy, which exposes guests to short periods of blue-shaded lighting to increase energy; and a dawn simulator, which gradually awakens the body through light and sound. Clearly, there's a yawning gap in the sleep market in Vegas. Due to demand, Stay Well at MGM Grand has quadrupled its room count from 42 to 171 in less than two years. Journalist Laura Powell was one of CNN's original travel reporters. Her focus is on international travel news and trends. Read more of her work at www.dailysuitcase.com . Twitter: @dailysuitcase . ", "external_links": [], "published": "2015-05-08T05:17:00.000+03:00", "crawled": "2015-05-08T05:17:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}