{"organizations": ["Ways Legal Marijuana Could Change"], "uuid": "3910c0db5d81ce41b718c4cfef1468504b09aa77", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2856444/images/o-WEED-NICKNAMES-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/04/marijuana-food_n_7185822.html", "country": "", "title": "10 Ways Legal Marijuana Could Change The Food World In The Next 10 Years", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "10 Ways Legal Marijuana Could Change The Food World In The Next 10 Years", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T00:40:00.000+03:00", "replies_count": 0, "uuid": "3910c0db5d81ce41b718c4cfef1468504b09aa77"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/04/marijuana-food_n_7185822.html", "ord_in_thread": 0, "title": "10 Ways Legal Marijuana Could Change The Food World In The Next 10 Years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nOver the past decade, the culinary world has started to pick up a faint whiff of marijuana smoke. Famous, reputable chefs across the country have copped to their love of marijuana , and its utility in their creative processes . Because weed makes food taste better! Even science says so . \nMeanwhile, the business of edible marijuana products has become increasingly sophisticated as more states have moved to legalize marijuana for medical or recreational use. \nNational support for marijuana legalization has been growing rapidly for years , and many believe it will only continue to do so going forward. Many experts believe that more states , including California, will likely legalize recreational marijuana within the next few years. As that trend continues, it will inevitably collide with the food movement, which is also growing stronger by the day. \nSo in honor of The Huffington Post's 10th anniversary, we've come up with 10 ways that the normalization of marijuana could change the food world in the next 10 years, arranged from most to least likely. Many of these are well-founded in trends that have already become evident, and others are more speculative. If you have more ideas, or disagree with any of the ones we've come up with, say so in the comments! 1 Restaurant chains will follow Taco Bell's lead and introduce stoner-friendly dishes. Taco Bell It's no secret that people tend to enjoy fast food after smoking marijuana -- blockbuster movies have been built on this premise . But most fast food companies have been reluctant to explicitly cater to the stoned market , for fear of driving away their more conservative patrons. Taco Bell has been more open than most about its friendliness to such customers -- and has found tremendous success with this strategy, selling billions of dollars worth of reefer-friendly dishes like Doritos Locos Tacos. As the stigma around marijuana wanes over the next decade, other chains are sure to follow suit. 2 Food delivery companies will target lazy stoners. ASSOCIATED PRESS Food delivery companies like Seamless have already become famous for releasing funny ads that highlight the advantages of ordering meals delivered to your house rather than going out to eat. So far, most of these ads have focused on relatively tame obstacles to leaving your house, such as bad weather. But these companies have already branched out into racier territory by advertising on pornographic websites , so it's only a matter of time before they do the same to lazy stoners. 3 Edibles will become a major industry. ASSOCIATED PRESS Walk into any decent marijuana dispensary in Denver or Los Angeles, and you'll find a plethora of marijuana-infused edibles that go way beyond the classic brownie. Faux Sour Patch Kids, sodas, chocolate-covered blueberries, you name it. These goodies have traditionally been pretty homespun: A dispensary employee might make them, or they might be contracted out to a home baker. But increasingly, edibles are made by large companies that sell to many dispensaries , and they have sophisticated branding and packaging that would be right at home on any supermarket shelf. As legalization spreads, this will only become more common. It wouldn't even be out of the question for some food conglomerate -- a Hershey's, PepsiCo or a Unilever -- to get in on the action at some point. 4 Stoners will explore healthier types of munchies. ASSOCIATED PRESS Want to know the secret recipe for the most delicious healthy snack? Smoke weed beforehand. Though most people associate the munchies with greasy, fattening foods like nachos, jalapeño poppers, or chocolate chip cookies, the truth is that smoking marijuana makes almost every food taste better -- including raw fruits and vegetables. Seriously, if you put a platter of crudité in front someone who's high, without giving them an alluring cheesy alternative, they will glut themselves with the healthy foods. Over the past 10 years, people have been smoking more weed and becoming more health-conscious. These two trends are on a collision course that will surely lead stoners to embrace healthier choices when they have the munchies. 5 Cultivators will develop appetite-suppressing strains of marijuana. Alex Wong via Getty Images This one sounds crazy. After all, didn't those first four changes all rely on the assumption that marijuana makes people ravenously hungry? Yes. And it does. Usually. But there are actually a few chemicals that naturally occur in cannabis plants that seem to suppress rather than increase appetite, notably tetrahydrocannabivarin , or THCV. So weed cultivators have started to explore the idea of crafting a new strain of marijuana that not only doesn't give you the munchies, but actually gives you a kind of reverse munchies, nipping hunger in the bud, so to speak. If done right, this could even be a promising treatment for obesity at some point in the future. 6 Restaurant menus will highlight stoner-friendly dishes. Oliver Propst/500px For years now, pioneering chefs like Roy Choi and David Chang have explicitly credited marijuana and its taste-heightening properties with fueling their creativity . They've created countless dishes that taste amazing when you're sober but even more amazing when you're stoned. So in the future, if marijuana were more socially acceptable, they might start highlighting these dishes on their menus. Maybe they'll create special \"Stoner's Menus,\" analogous to children's menus, or put little marijuana leaf icons next to certain dishes, like the symbols some restaurants already use to point out dishes that are spicy, vegan or gluten-free. After all, everything has a way of sounding delicious when you're in a certain state, so some guidance would be much appreciated. 7 Restaurants will serve weed-infused foods. Oliver Propst/500px This one isn't new, strictly speaking. In 2010, after Colorado legalized medical marijuana, a man named Steve Horwitz opened a cannabis-focused restaurant called Ganja Gourmet , where he served marijuana-infused foods to certified medical marijuana patients, even allowing them to spoke joints while they dined. But it was shut down in 2011 after the City of Denver passed a law banning on-site consumption of marijuana . Horwitz, however, thinks it's only a matter of time before he and others in the marijuana industry return to the model he pioneered back in 2010. \"It was the future of cannabis about 10 years too soon,\" he told The Huffington Post. \"It's not going to happen in 2016, but maybe by 2020, we'll have legal marijuana in the whole country and we'll start to see more marijuana restaurants open up.\" A whole corps of talented chefs around the country have already started preparing for such a future by developing recipes for truly delicious marijuana-infused foods, and famed cannabis cook Matt Grey is even writing a 200-page cookbook of all-gourmet dishes containing marijuana. The most likely scenario would be that only special marijuana-focused restaurants would ever serve their patrons salads with weed-infused vinaigrettes or cannabis-laced cheesecakes -- at least in the immediate future. But maybe, years from now, \"normal\" restaurants will get in on the action as well. 8 Professional marijuana sommeliers will help pair foods with strains of weed. Shutterstock / Minerva Studio These last three predictions are verging on science fiction territory; the marijuana legalization movement would have to accelerate rapidly for any of them to happen in the next 10 years. But the movement already has a great deal of momentum, so none of them are out of the question. The first, and most urgently wished-for , is the mainstreaming of weed sommeliers . These trained experts in marijuana -- employed by either dispensaries or restaurants -- could point people to specific strains of marijuana that, because of their psychotropic effects or their aromatic qualities, could pair particularly well with certain foods. But for the position to really be effective in restaurants, patrons would have to be allowed to smoke or otherwise consume marijuana on the premises. 9 Restaurants and bars will serve marijuana-infused alcoholic tinctures. SHUTTERSTOCK / BOCHKAREV You already know that marijuana can be easily infused into fats and oils. Less well-known, though, is the fact that it can also be infused into alcohol. A few stoners have already taken to infusing their own marijuana tinctures , which are sometimes called \"the green dragon,\" a reference to absinthe's nickname, \"the green fairy.\" It's not totally inconceivable that at some point, marijuana laws would be relaxed enough to allow restaurants and bars to make and serve such tinctures as well. Horwitz, however, doesn't see it happening soon. \"There's so much regulation right now that it seems very unlikely,\" he said. \"Restaurants already have to apply for a liquor license if they want to serve alcohol. And even if the laws at some point allow on-site consumption, they would probably still have to apply for a marijuana license if they wanted to serve marijuana, and I can't see a restaurant that has a liquor license being approved for a marijuana license as well. They'll probably have to choose one or the other.\" There are also serious concerns with intoxicated driving. But hey, stranger things have happened. 10 Smoking sections, or at least vaping sections, will make a comeback. ASSOCIATED PRESS Remember smoking sections? Those parts of restaurants and bars where you were allowed to smoke inside? They're a distant memory across most of the country; not even bar-happy New Orleans has them anymore . And marijuana can expose bystanders to harmful secondhand smoke , just like tobacco. So the pendulum would have to swing very far indeed for marijuana smoking sections to pop up in many restaurants. Perhaps a more likely scenario would be the rise of vaping sections open to those inhaling marijuana using vaporizers and inhaling nicotine using electronic cigarettes. The vapor they exhale does contain some odor and chemicals, but at much lower levels than traditional smoke, so some people are in favor of their spread. On the other hand, more and more cities have started to ban the use of electronic cigarettes at indoor public places like restaurants , so this, too, seems like a long shot. Also on HuffPost: ", "external_links": [], "published": "2015-05-05T00:40:00.000+03:00", "crawled": "2015-05-05T00:40:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}