{"organizations": [], "uuid": "19b4547b9913125b9dd8c63b771b6601ada9fae2", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/10/politics/barack-obama-mothers-day/index.html", "country": "", "title": "Obama calls moms to wish them a happy Mother's Day - CNNPolitics.com", "performance_score": 4, "site": "cnn.com", "participants_count": 0, "title_full": "Obama calls moms to wish them a happy Mother's Day - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-10T16:19:00.000+03:00", "replies_count": 0, "uuid": "19b4547b9913125b9dd8c63b771b6601ada9fae2"}, "author": "", "url": "http://www.cnn.com/2015/05/10/politics/barack-obama-mothers-day/index.html", "ord_in_thread": 0, "title": "Obama calls moms to wish them a happy Mother's Day - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Obama calls moms to wish them a happy Mother's Day Updated 1413 GMT (2113 HKT) May 10, 2015 Politicians and their moms 13 photos Whether they have passed away or are still with us today, these mothers have helped shape some of the most influential people of our time. Hide Caption 1 of 13 Politicians and their moms 13 photos President Barack Obama's mother, Ann Dunham, passed away on November 7, 1995. In a tribute to his mother, he said \"Had I known she would not survive her illness, I might have written a different book,\" referencing \"Dreams from My Father,\" his 1995 autobiography. \"Less a meditation on the absent parent, more a celebration of the one who was the single constant in my life.\" Hide Caption 2 of 13 Politicians and their moms 13 photos Hillary Clinton's mother, Dorothy Howell Rodham, passed away on November 1, 2011, at age 92. In \"Living History\" Clinton wrote that her mother taught her to stand up for herself. After young Hillary was bullied, Rodham told her: \"You have to face things and show them you're not afraid.\" Clinton wrote that her mother \"watched from behind the curtain as I squared my shoulders and marched across the street. I returned a few minutes later, glowing with victory.\" Hide Caption 3 of 13 Politicians and their moms 13 photos Former President George W. Bush recounted his parents' differing discipline styles and said that when he was caught stealing toy soldiers at the age of 6, his father made him apologize to the store owner. \"There was no harsh follow-up,\" Bush said. But his mother might have handled things differently. \"One time she caught me urinating in the hedges and washed my mouth out with soap,\" he said. Hide Caption 4 of 13 Politicians and their moms 13 photos Barbara Bush has always been an advocate for her younger son, Jeb. But amid speculation that he might run for president, the former first lady said, \"There are other people out there that are very qualified and we've had enough Bushes.\" But in February 2015 she changed her mind, calling into one of her son's fundraisers: \"Just listening in. Anyway ... what do you mean too many Bushes? ... I've changed my mind.\" Hide Caption 5 of 13 Politicians and their moms 13 photos On Mother's Day 2014, House Speaker John Boehner posted a heartfelt tribute to his mother, Mary Ann Boehner, who passed away in 1998. Boehner wrote: \"They say behind every great man is a great woman. Well, behind an Ohio barkeeper and his 12 kids, there is a saint.\" Hide Caption 6 of 13 Politicians and their moms 13 photos Reflecting on her mother in an interview with CNN's State of the Union, House Minority Leader Nancy Pelosi said: \"My mother was so spectacular. She knew women were capable of more things. Every day I think, if she lived now, what she would be?\" Hide Caption 7 of 13 Politicians and their moms 13 photos Supreme Court Justice Sonia Sotomayor was raised in an East Bronx housing project and grew up to became the first Hispanic to serve in the nation's highest court. And on the day of her swearing in she thanked her mother, Celina Báez: \"I have often said that I am all I am because of her, and I am only half the woman she is.\" Hide Caption 8 of 13 Politicians and their moms 13 photos While reflecting on growing up in the segregated South, former Secretary of State Condoleezza Rice recounted a time when she went to a department store with her mother to buy an Easter dress and was told she'll have to try it on in a storage room. \"My mother said, looking [the saleswoman] dead in the eye, 'Either she tries this dress on in the fitting room or we don't buy it,'\" said Rice. Hide Caption 9 of 13 Politicians and their moms 13 photos Betty Douglas, the mother of U.S. Rep. Paul Ryan, was a familiar face on the campaign trail in 2012, when he was the GOP candidate for vice president, supporting her son each step of the way. Ryan's father died of a heart attack in 1986. Ryan said his mother gave him a \"big nudge\" to take a job in politics because \"she was worried I would become a ski bum.\" Hide Caption 10 of 13 Politicians and their moms 13 photos Vice President Joe Biden's mother, Jean Biden, passed away at 92 on January 8, 2010. In his 2008 acceptance speech as Obama's running mate, Biden said \"My mother's creed is the American creed: No one is better than you. You are everyone's equal, and everyone is equal to you.\" Hide Caption 11 of 13 Politicians and their moms 13 photos World-renowned neurosurgeon Dr. Ben Carson announced his presidential bid in April 2015 but took time away from the campaign trail to be with his ailing mother. Reflecting on his mother in 2013, Carson said , \"Not only did she tell us to turn off the TV and start reading books, but she was always sort of struggling to try to learn how to read, herself.\" Hide Caption 12 of 13 Politicians and their moms 13 photos Sen. Marco Rubio, a presidential candidate, is the son of Cuban immigrants. In an interview with Time magazine in 2013, Rubio said that his mother, Oriales Garcia, left him a voice message, asking him in Spanish, \"Don't mess with the immigrants, my son ... They're human beings just like us, and they came for the same reasons we came.\" Hide Caption It's not the voice you'd expect to hear on the other end of the phone. \"Hi. This is Barack Obama. Your President.\" In celebration of Mother's Day weekend, Obama surprised three mothers with individual phone calls this to wish them a Happy Mother's Day, according to a White House official. The mothers, from Minnesota, Arizona and Florida, had all written the President letters over the course of the year. \"I know how tough it is to raise kids and do right by them, and if it hadn't been for my mother, I certainly wouldn't be here,\" Obama said on a phone call with one of the mothers, referring to his own mother, Ann Dunham, who passed away in 1995. \"You are doing the most important work there is.\" JUST WATCHED I wish my mother knew ... 01:55 PLAY VIDEO Stephanie Tarr, a waitress from Coon Rapids, Minnesota and mother of two boys, was one of the mothers to receive a phone call. She wrote to the President to thank the first family for what they do \"each day for our country and normal families like us throughout America,\" according to a White House official's description of the letter, which included mentions of the minimum wage and affordable preschool as issues most important to her. \"Not uh ... no way,\" Stephanie Tarr responded as she was greeted with the President's voice, seemingly in disbelief who was on the other end of the phone. \"It's me! Give me a test,\" the President replied. \"Ask me about anything,\" Dawn Miller, a corrections officer from Tucson, Arizona, also wrote to the President and received a phone call from Obama this week, in calls he made from the Resolute Desk in the Oval Office. According to a White House official, Dawn wrote to the President about her 22-year-old son. His job didn't offer health insurance, but he was still able to receive treatment through his mother's insurance thanks to the Affordable Care Act after being bitten by a rattlesnake. \"I decided since it was Mother's Day, I should call letter-writers and moms and say 'thank you' for being great moms,\" he said. The last mother the President called, Patricia Church of Ormond Beach, Florida, has raised four children, one of whom is a Marine based out of Camp Lejeune. JUST WATCHED The impact of where you grow up 03:02 PLAY VIDEO She wrote to the President on the night of his State on the Union address and expressed the challenge of raising children as a single mother. According to a White House official, she concluded her letter by saying, \"Mr. President, I know you are far too busy to talk to or meet me and I understand that. But I hope and pray you will at least be able to read my words ...\" Obama thanked Dawn on the phone call for her son's service. \"I was so proud of everything you've done raising four kids and you know serving our country,\" he said. \"Those boys are going to turn out good because of you.\" Barack Obama's presidency 50 photos President Barack Obama attends the 2014 Nuclear Security Summit in March 2014 in the Hague, Netherlands. As his presidency winds down, here's a look at some key moments of his administration. Hide Caption 1 of 50 Barack Obama's presidency 50 photos Michelle Obama brushes specks from the coat of then-Sen. Obama inside the Old State Capitol in Springfield, Illinois, just before he announced his candidacy for president of the United States in February 2007. Their daughters Malia, left, and Sasha wait in the foreground. Hide Caption 2 of 50 Barack Obama's presidency 50 photos Obama appears on \"Meet the Press\" with Tim Russert, right, in Des Moines, Iowa, in November 2007. Hide Caption 3 of 50 Barack Obama's presidency 50 photos Obama shakes hands with supporters after addressing a rally in Concord, New Hampshire, in January 2008. Hide Caption Barack Obama's presidency 50 photos Obama gives a speech at the National Constitution Center in Philadelphia in March 2008. Hide Caption Barack Obama's presidency 50 photos Obama speaks at the 2008 Democratic National Convention in Denver, Colorado. Hide Caption 6 of 50 Barack Obama's presidency 50 photos Obama stands on stage in Chicago, Illinois, with his family after defeating Republican presidential candidate John McCain on November 4, 2008. Hide Caption 7 of 50 Barack Obama's presidency 50 photos Left to right: Presidents George H. W. Bush, Obama, George W. Bush, Bill Clinton, and Jimmy Carter pose for photos in the Oval Office in January 2009. Hide Caption 8 of 50 Barack Obama's presidency 50 photos Obama is sworn in by Chief Justice John Roberts as the 44th President of the United States on the West Front of the Capitol in Washington on January 20, 2009. Hide Caption 9 of 50 Barack Obama's presidency 50 photos As retired military officers stand behind him, Obama signs an executive order to close down the detention center at Guantanamo Bay in January 2009. Hide Caption 10 of 50 Barack Obama's presidency 50 photos Obama and Vice President Joe Biden look at solar panels as they tour the solar array at the Denver Museum of Nature and Science on February 17, 2009. That same day, Obama signed the American Recovery and Reinvestment Act. Hide Caption 11 of 50 Barack Obama's presidency 50 photos A soldier hugs Obama during his surprise visit to Camp Victory just outside Baghdad, Iraq, in April 2009. Hide Caption 12 of 50 Barack Obama's presidency 50 photos Obama bends over so the son of a White House staff member can pat his head during a visit to the Oval Office in May 2009. The boy wanted to know if Obama's hair felt like his. Hide Caption 13 of 50 Barack Obama's presidency 50 photos Obama kisses Sonia Sotomayor's cheek after announcing her as his nominee for justice on the Supreme Court in May 2009. Hide Caption 14 of 50 Barack Obama's presidency 50 photos Palestinian security forces in Jenin, West Bank, listen to Obama speak from Cairo University in Egypt in June 2009. The Palestinian Authority hailed as a \"good beginning\" Obama's speech to the Muslim world in which he reiterated his support for a Palestinian state. Hide Caption 15 of 50 Barack Obama's presidency 50 photos Obama and first lady Michelle Obama meet with Pope Benedict XVI in Vatican City in July 2009. Hide Caption 16 of 50 Barack Obama's presidency 50 photos Obama hosts the Apollo 11 astronauts, from left to right, Edwin \"Buzz\" Aldrin, Michael Collins and Neil Armstrong in the Oval Office on July 20, 2009, the 40th anniversary of the moon landing. Hide Caption 17 of 50 Barack Obama's presidency 50 photos Police Sgt. James Crowley, second right, of Cambridge, Massachusetts, speaks with Harvard Professor Henry Louis Gates Jr., second left, alongside Obama and Biden as they share beers on the South Lawn of the White House in July 2009. In an effort to curb controversy, the so-called \"Beer Summit,\" was held after Crowley arrested Gates at his own home which sparked tensions and racial furor. Hide Caption 18 of 50 Barack Obama's presidency 50 photos Obama salutes during the transfer of Sgt. Dale R. Griffin at Dover Air Force Base in Dover, Delaware, in October 2009. Obama traveled to the base to meet the plane carrying the bodies of 18 U.S. personnel killed in Afghanistan on October 26, including Griffin. Hide Caption Barack Obama's presidency 50 photos Obama walks along the Great Wall of China in November 2009. Hide Caption 20 of 50 Barack Obama's presidency 50 photos Obama delivers a speech after receiving the Nobel Peace Prize in Oslo, Norway, in December 2009. Hide Caption 21 of 50 Barack Obama's presidency 50 photos Presidents Obama, Clinton, and Bush walk to the Rose Garden to speak about relief efforts for earthquake-stricken Haiti in January 2010. Hide Caption 22 of 50 Barack Obama's presidency 50 photos First daughters Sasha and Malia Obama play in the snow with their father in the Rose Garden during a snowstorm that hit Washington in February 2010. Hide Caption 23 of 50 Barack Obama's presidency 50 photos Obama's signature on the Affordable Healthcare Act is seen at the White House in March 2010. Hide Caption 24 of 50 Barack Obama's presidency 50 photos Obama throws out the opening pitch before a baseball game between the Philadelphia Phillies and the Washington Nationals on Opening Day at Nationals Park in Washington in April 2010. Hide Caption 25 of 50 Barack Obama's presidency 50 photos Obama and daughter, Sasha, swim at Alligator Point in Panama City Beach, Florida, in August 2010, in an effort to encourage people to come back to the Gulf Coast after the devastating oil spill. Hide Caption 26 of 50 Barack Obama's presidency 50 photos Obama laughs as he makes a statement on his birth certificate in April 2011. Obama said he was amused over conspiracy theories about his birthplace, and said the media's obsession with the \"sideshow\" issue was a distraction in a \"serious time.\" Hide Caption 27 of 50 Barack Obama's presidency 50 photos Obama, Biden, Secretary of State Hillary Clinton and members of the national security team receive live updates in the Situation Room of the White House on the mission to capture or kill Osama bin Laden on May 1, 2011. Hide Caption 28 of 50 Barack Obama's presidency 50 photos U.S. Marines of Regiment Combat Team 1 watch from Camp Dwyer in Afghanistan as Obama announces the death of Osama bin Laden on May 2, 2011. Hide Caption 29 of 50 Barack Obama's presidency 50 photos Obama enjoys a pint of Guinness in his ancestral home of Moneygall, Ireland, in May 2011. Hide Caption 30 of 50 Barack Obama's presidency 50 photos Obama, left, and first lady Michelle Obama, right, meet with Prince William, Duke of Cambridge and Catherine, Duchess of Cambridge, at Buckingham Palace in London in May 2011. Hide Caption 31 of 50 Barack Obama's presidency 50 photos Obama and Missouri Gov. Jay Nixon walk together in May 2011 during a tour of the devastation of Joplin, Missouri, after it was hit by tornado with winds over 200 mph. Hide Caption 32 of 50 Barack Obama's presidency 50 photos Obama delivers remarks to troops and military families at Fort Bragg, North Carolina, on December 14, 2011, marking the exit of U.S. soldiers from Iraq. Hide Caption 33 of 50 Barack Obama's presidency 50 photos Obama pays for a dog toy as he shops with his dog Bo at a Petsmart in Alexandria, Virginia, in December 2011. Hide Caption 34 of 50 Barack Obama's presidency 50 photos Obama sits on the famed Rosa Parks bus at the Henry Ford Museum in Dearborn, Michigan, in April 2012. Hide Caption 35 of 50 Barack Obama's presidency 50 photos British Prime Minister David Cameron, Obama, German Chancellor Angela Merkel, and others watch the overtime shootout of the Champions League final soccer match between Chelsea and Bayern Munich in the Laurel Cabin conference room at Camp David, Maryland, during a G8 Summit in May 2012. Hide Caption 36 of 50 Barack Obama's presidency 50 photos Obama sits in his chair during a Cabinet meeting in the Cabinet Room in July 2012. This image was tweeted by his official Twitter account in August 2012 in response to Clint Eastwood's \"empty chair\" speech at the Republican National Convention. The tweet simply said, \"This seat's taken.\" Hide Caption 37 of 50 Barack Obama's presidency 50 photos Obama casts a shadow in this picture as he accepts the 2012 Democratic nomination for president during the final day of the Democratic National Convention in Charlotte, North Carolina, in September 2012. Hide Caption 38 of 50 Barack Obama's presidency 50 photos Republican presidential candidate Mitt Romney and Obama participate in the first presidential debate of the 2012 election in Denver, Colorado, in October 2012. Hide Caption Barack Obama's presidency 50 photos Obama celebrates on stage in Chicago after defeating Romney on Election Day November 6, 2012. Hide Caption 40 of 50 Barack Obama's presidency 50 photos Obama pauses during his speech at a memorial service in Newtown, Connecticut, for the victims and relatives of the Sandy Hook Elementary School massacre in December 2012. Hide Caption 41 of 50 Barack Obama's presidency 50 photos Hundreds of thousands gather at the U.S. Capitol building as Obama is inaugurated for his second term on January 21, 2013. Hide Caption 42 of 50 Barack Obama's presidency 50 photos Israeli President Shimon Peres, left, and Prime Minister Benjamin Netanyahu, right, stand with Obama during an arrival ceremony for Obama at Ben Gurion International Airport in Tel Aviv, Israel, in March 2013. Hide Caption 43 of 50 Barack Obama's presidency 50 photos Obama adjusts an umbrella held by a Marine during a news conference with Turkish Prime Minister Recep Tayyip Erdogan in the Rose Garden of the White House in May 2013. Hide Caption Barack Obama's presidency 50 photos Jay Leno interviews Obama on \"The Tonight Show\" in August 2013. Hide Caption 45 of 50 Barack Obama's presidency 50 photos White House press secretary Jay Carney fields questions from reporters during a daily press briefing at the White House in September 2013 after Obama's push for Congressional approval for limited military strikes against the Syrian government. Hide Caption 46 of 50 Barack Obama's presidency 50 photos Actor and comedian Zach Galifianakis interviews Obama during his appearance on \"Between Two Ferns,\" a digital video series with a laser focus on reaching people aged 18 to 34. The President urged young people to sign up for the new health care plan in the video posted on the website Funny or Die. Hide Caption 47 of 50 Barack Obama's presidency 50 photos Obama walks to the Oval Office on August 7, 2014, the same day he announced the beginning of air strikes on ISIS. Hide Caption 48 of 50 Barack Obama's presidency 50 photos Obama speaks to the nation from the Cabinet Room of the White House about normalizing diplomatic relations with Cuba in December 2014. Hide Caption 49 of 50 Barack Obama's presidency 50 photos Left to right: House Majority Leader Rep. Kevin McCarthy, House Minority Leader Rep. Nancy Pelosi, and Speaker of the House Rep. John Boehner listen as Obama speaks during a meeting in the Cabinet Room of the White House on January 13, 2015. Hide Caption ", "external_links": [], "published": "2015-05-10T16:19:00.000+03:00", "crawled": "2015-05-10T16:19:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}