{"organizations": [], "uuid": "ee4eeaece35044a2c287eb91057117c59ea40fb9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051115getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/243324-court-sets-july-hearing-on-obamas-immigration-actions", "country": "US", "title": "Court sets July hearing on Obama's immigration actions", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Court sets July hearing on Obama's immigration actions", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T19:49:00.000+03:00", "replies_count": 0, "uuid": "ee4eeaece35044a2c287eb91057117c59ea40fb9"}, "author": "bgoad@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/243324-court-sets-july-hearing-on-obamas-immigration-actions", "ord_in_thread": 0, "title": "Court sets July hearing on Obama's immigration actions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Court sets July hearing on Obama's immigration actions By Jordan Fabian - 05/28/15 12:49 PM EDT A federal appeals court said Wednesday it has set a date to hear an expedited appeal of a lower court order that put President Obama’s deportation relief programs on hold. The 5th Circuit Court of Appeals will hear oral arguments on July 10 in New Orleans in the Obama administration’s attempt to lift a preliminary injunction from U.S. District Judge Andrew Hanen of Texas, which blocked several executive actions from taking effect. The hearing will present a major test for the administration, which is seeking to end the legal limbo surrounding its immigration programs. ADVERTISEMENT A three-judge panel from the 5th Circuit handed Obama a defeat this week, when it denied an emergency request from the administration to lift the hold on the president’s executive actions. The Department of Justice announced it would not bring that request to the Supreme Court, and instead would focus on its appeal of Hanen’s injunction, which will be considered at the July hearing. The Texas judge’s injunction stemmed from a lawsuit brought by 26 states against Obama's programs, arguing he overstepped his constitutional authority. The appeal to be heard in July centers on the merits of the case. The Obama administration argues the president acted within the law and that the states do not have standing to bring the suit, because the federal government has sole power to enforce immigration law. Judges Jennifer Elrod and Jerry Smith ruled the injunction should remain in effect because the states had made a compelling case that the programs would cause them to suffer harm and that the federal government is unlikely to succeed on appeal. But the administration believes focusing on the merits of the case gives the government its greatest chance of success.", "external_links": [], "published": "2015-05-28T19:49:00.000+03:00", "crawled": "2015-05-28T20:14:41.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}