{"organizations": [], "uuid": "cc7fcb8f9e3ab166b5ac6bdc8dcb15302b4e40ee", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com/thumb/2015/05/05/obama-golf_300x169.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/05/05/obama-ya-sabe-que-hara-despues-de-la-presidencia-jugar-domino", "country": "", "title": "Obama ya sabe qué hará después de la presidencia... ¡jugar dominó!", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama ya sabe qué hará después de la presidencia... ¡jugar dominó!", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "cc7fcb8f9e3ab166b5ac6bdc8dcb15302b4e40ee"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/05/05/obama-ya-sabe-que-hara-despues-de-la-presidencia-jugar-domino", "ord_in_thread": 0, "title": "Obama ya sabe qué hará después de la presidencia... ¡jugar dominó!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Obama ya sabe qué hará después de la presidencia... ¡jugar dominó! Después de dejar la Casa Blanca, Obama tendrá décadas para avanzar partes de la agenda que él mismo está desarrollando Por Kevin Liptak Martes, 05 de mayo de 2015 a las 20:05 Después de que el actual presidente de Estados Unidos deje su oficina en 2017, Obama (izq.) seguirá trabajando en el progama que desarrolla (GettyImages/Archivo ). Lo más importante Obama comienza a dar indicios de su deseo por cimentar un legado Su legado incluye una libreria al sur de Chicago y algunos cargos como el del general Joseph Dunford Temas relacionados Así que voy a volver a hacer el tipo de trabajo que yo estaba haciendo antes, tratando de encontrar formas de ayudar a las personas, ayudar a los jóvenes a obtener una educación, y ayudar a las personas conseguir trabajo Barack Obama, presidente de EU \"Se trata de una crisis\": Obama sobre protestas \nWASHINGTON (CNN) — Cuando el presidente Barack Obama se sentó en el programa nocturno de David Letterman, bromeó acerca de que los dos estarían jugando dominó cuando estén jubilados. \nDespués de que el actual presidente de Estados Unidos deje su oficina en 2017 —10 años antes de alcanzar la edad de jubilación federal— Obama seguirá teniendo décadas para avanzar partes de la agenda que él mismo está desarrollando. \nY mientras sus ayudantes insisten en que Obama está más concentrado que de costumbre en su trabajo de dirigir al país, sus decisiones como presidente están empezando a dar indicios de su deseo para cimentar un legado para él mucho después de que se aparte de la Casa Blanca. \nEl lunes, Obama volvió a lanzar la iniciativa My Brother´s Keeper, como una organización no lucrativa, con millones de dólares comprometidos con las empresas privadas y una lista de miembros integrantes del consejo de alto perfil. Él dijo que el trabajo en el programa en establecer tutorías e incrementar el acceso a una buena educación seguiría siendo su enfoque \"para el resto de mi vida”. \nLee: Las bromas de Obama en la cena de corresponsales de la Casa Blanca \nLa biblioteca presidencial de Obama —la personificación psicológica de su legado— ha encontrado un hogar en el sur de Chicago, indicaron fuentes la semana pasada, con un fondo de 500 millones de dólares para arrancar el proyecto. \nIncluso las opciones de contratación de Obama comienzan a dar trazo de lo que el presidente actual espera otorgar a su sucesor: su elección para presidente de los Jefes de Estado Mayor, el general Joseph Dunford, ha ayudado a orquestar la reducción de tropas en Afganistán, un proceso prolongado que el presidente espera pueda continuar cuando el próximo comandante en jefe lo tome. \nSi Dunford es confirmado por el Senado, su mandato de dos años se extenderá más allá de la propia fecha de salida de Obama lo que significa que va a asesorar a quienquiera que ocupe la Oficina Oval. \nMientras Obama comienza a alcanzar los hitos de un presidente de segundo plazo, ha estado más dispuesto a discutir el próximo capítulo de su vida. \n\"Voy a dejar de ser presidente en un par de años, y yo seguiré siendo un hombre muy joven\", dijo Obama a una multitud de estudiantes en una biblioteca en Washington la semana pasada. \n\"Así que voy a volver a hacer el tipo de trabajo que yo estaba haciendo antes, tratando de encontrar formas de ayudar a las personas, ayudar a los jóvenes a obtener una educación, y ayudar a las personas conseguir trabajo, y tratar de llevar los negocios a los barrios que no tienen suficientes empresas. Ese es el tipo de trabajo que realmente me gusta hacer”. \nOficiales de la Casa Blanca insisten por ahora, que el presidente está principalmente interesado en gobernar durante “el último cuarto” de su presidencia. Las decisiones que ya se tomaron durante sus seis años de gobierno —firmar el Obamacare, matar a Osama bin Laden— ya destacan como elementos duraderos de su legado. \nEn su segundo mandato, Obama le ha dado vuelta a la acción ejecutiva sobre temas controvertidos para avanzar en sus temas del programa, incluyendo la protección de millones de inmigrantes indocumentados de la deportación y la promulgación de nuevas regulaciones para las plantas de energía en un intento por hacer frente al cambio climático. \nDos elementos importantes a su legado de política exterior han involucrado naciones atractivas que una vez fueron consideradas hostiles por los Estados Unidos. \nSu encuentro con Raúl Castro, presidente de Cuba, a principios de abril marcó un hito en las relaciones de deshielo entre Washington y La Habana, y los negociadores continúan trabajando con Irán en lograr un acuerdo para evitar que Teherán obtenga un arma nuclear. \nPero incluso con esas cuestiones —así como la lucha contra ISIS, negociar un nuevo acuerdo comercial con Asia y el resto de las tareas diarias que mantienen un presidente ocupado— que ocupan la mayor parte de su tiempo, Obama ha sido capaz de sacar tiempo para su planes post-presidenciales. Encuentra este artículo con: obama, casa blanca, presidente, estados unidos, Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n\\r\\n \\r\\n\", \"commentCount\": 0, \"next\": \"0\", \"nextTS\": 0, \"hasMore\": false, \"statusCode\": 200, \"errorCode\": 0, \"statusReason\": \"OK\", \"callId\": \"c2cf15dca3744e49bb278373a51fcbdd\", \"time\": \"2015-05-07T06:42:10.793Z\" } Video ", "external_links": [], "published": "2015-05-05T03:00:00.000+03:00", "crawled": "2015-05-07T09:42:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}