{"organizations": [], "uuid": "76a373bd753b81f1db253b0f22aa7a5a2dec090b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2951934/images/o-MARIJUANA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/hpl/feed", "section_title": "Hpl on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/29/bible-christianity-marijuana_n_7461290.html", "country": "US", "title": "The Christian Case For Legalizing Marijuana", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The Christian Case For Legalizing Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-05-29T17:13:00.000+03:00", "replies_count": 0, "uuid": "76a373bd753b81f1db253b0f22aa7a5a2dec090b"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/29/bible-christianity-marijuana_n_7461290.html", "ord_in_thread": 0, "title": "The Christian Case For Legalizing Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nTexas State Rep. David Simpson (R), a staunch Tea Party member and conservative Christian, made headlines earlier this month when he put forth \"the evangelical argument for total legalization of cannabis.\" \nIn an interview with The Daily Beast , Simpson quoted Timothy 4:4, which reads “everything God created is good.\" Under Simpson's reading of the text, all God's creations, marijuana included, are good. \nWhile some use religion as the basis for their opposition to the drug, early Judaism and Christianity scholar Stewart Felker told HuffPost Live on Tuesday that there are merits to Simpson's Christian case for marijuana legalization. \n\"Christianity itself was not born out of a hyper-puritanical mindset,\" Felker told host Josh Zepps . \nAlthough the Bible contains \"negative statements about alcohol in excess,\" it tolerates alcohol in moderation, Felker continued. Since drug use is not explicitly referenced in the Bible, Felker said its take on alcohol \"lays the groundwork\" for an interpretation of its stance on drug usage. \n\"There is no prohibition against alcohol in the Bible, and it is spoken of very positively in the New Testament, for example,\" he said. \"So, by analogy, at the very least this lays the groundwork for an ethical theory that may have legal consequences if you're the type of person to do that.\" \nWatch the full HuffPost Live conversation about religion and drugs here . \nSign up here for Live Today, HuffPost Live's new morning email that will let you know the newsmakers, celebrities and politicians joining us that day and give you the best clips from the day before! Related on HuffPost:", "external_links": [], "published": "2015-05-29T17:13:00.000+03:00", "crawled": "2015-05-29T22:34:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}