{"organizations": [], "uuid": "97b726f119669423a8e4e6770ecb01c8620e8625", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2943460/images/o-SHERROD-BROWN-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/12/sherrod-brown-elizabeth-warren-trade_n_7269998.html", "country": "", "title": "Sherrod Brown Says Obama Was 'Disrespectful' To Elizabeth Warren In Trade Spat", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Sherrod Brown Says Obama Was 'Disrespectful' To Elizabeth Warren In Trade Spat", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:56:00.000+03:00", "replies_count": 0, "uuid": "97b726f119669423a8e4e6770ecb01c8620e8625"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/12/sherrod-brown-elizabeth-warren-trade_n_7269998.html", "ord_in_thread": 0, "title": "Sherrod Brown Says Obama Was 'Disrespectful' To Elizabeth Warren In Trade Spat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Alex Wong", "Elizabeth Warren", "Obama", "Sherrod Brown"], "text": "Sherrod Brown Says Obama Was 'Disrespectful' To Elizabeth Warren In Trade Spat Posted: Updated: 42 minutes ago Sen. Sherrod Brown said President Barack Obama has been \"disrespectful\" to Sen. Elizabeth Warren in the way he's talked about her as they've sparred during a trade fight. | Alex Wong via Getty Images reddit \nWASHINGTON -- Sen. Sherrod Brown (D-Ohio), a leading critic of President Barack Obama's trade agenda, accused the president on Tuesday of being \"disrespectful\" to Sen. Elizabeth Warren (D-Mass.) amid debate on the issue and said her gender may have something to do with it. \nObama and Warren, typically allies, have clashed in recent days over the massive pending Trans-Pacific Partnership deal. The president said in a Saturday interview that Warren is \"absolutely wrong\" to oppose it, and he suggested her criticisms are purely political: \"The truth of the matter is that Elizabeth is, you know, a politician like everybody else.\" \nBrown said Tuesday that Obama's characterization of Warren was inappropriate. \n“I think the president was disrespectful to her by the way he did that. I think that the president has made this more personal than he needed to,\" Brown told Capitol Hill reporters. \"I think by calling her 'another politician' -- I'm not going to get into more details -- I think referring to her as first-name when he might not have done that for a male senator, perhaps -- I've said enough.\" \nIt's not the first time Obama has referred to senators by their first names in a public forum, though. He gave a shout-out to \"Sherrod\" at a 2012 AFL-CIO convention in Ohio. He's also referred to Sen. Charles Schumer (D-N.Y.) as \"Chuck\" during at least two public events, once in 2013 at a Brooklyn gathering and once in 2014 at a Democratic fundraiser in New York. \nBrown's remarks came just after Democrats blocked a bill to give the president fast-track authority on trade deals, a stunning defeat for Obama by his own party. Despite an intense lobbying effort by the White House, even pro-trade Democrats opposed the legislation because they say it lacks teeth for enforcing labor and environmental regulations. Other Democrats have raised concerns about losing U.S. jobs overseas and the unraveling of 2008 financial reforms. The bill isn't dead though; it's likely to come back up after more talks on both sides. \nThe Ohio senator said he knows that Obama disagrees with Democratic critics of the bill, but said it's not helpful when the president states publicly that they don't know what they're talking about. \n\"When he said that a number of us -- not just Senator Warren -- don’t know what we’re talking about, we're fighting the last war, a number of those phrases he used, I assume he wished he hadn’t said them because he shouldn’t have said them,\" said Brown. \nSome other Democrats shrugged off Obama's criticisms of Warren. \n\"What you're getting into is personality stuff,\" said Sen. Bernie Sanders (I-Vt.), a 2016 candidate for the Democratic presidential nomination. \"No one cares about clashes between the president and Elizabeth Warren. They care about, is this going to create jobs?\" \nRep. Rosa DeLauro (D-Conn.), a vocal House critic of the trade deal, said she wasn't surprised by Obama going after Warren. She recalled that it was no walk in the park for Democrats who went up against President Bill Clinton to oppose the 1994 North American Free Trade Agreement. \n\"President Clinton called those of us who opposed NAFTA 'thugs,'\" said DeLauro. \"That we were wrong-headed, that we didn't know what we were talking about.\" \nShe added, \"We did know what we were talking about then. Elizabeth Warren knows what she's talking about now.\" Also on HuffPost: ", "external_links": [], "published": "2015-05-13T03:56:00.000+03:00", "crawled": "2015-05-13T03:56:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}