{"organizations": [], "uuid": "5d881955cc9094edcb705e663577a319d4eba4e9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/LIZWARREN.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/13/obama-accused-making-disrespectful-and-sexist-comments-toward-warren/", "country": "US", "title": "Obama accused of making 'disrespectful' and 'sexist' comments toward Warren", "performance_score": 1, "site": "foxnews.com", "participants_count": 17, "title_full": "Obama accused of making 'disrespectful' and 'sexist' comments toward Warren | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 27, "uuid": "42ebb12fa997cc2195bb77ee44c655ed8588944d"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/13/obama-accused-making-disrespectful-and-sexist-comments-toward-warren/#post-0", "ord_in_thread": 0, "title": "Obama accused of making 'disrespectful' and 'sexist' comments toward Warren", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print FILE - In this Feb. 24, 2015, file photo, Sen. Elizabeth Warren, D-Mass., is seen on Capitol Hill in Washington. (AP Photo/Susan Walsh, File) \nPresident Obama is facing criticism from his liberal base over what they say are “disrespectful” and even sexist comments about Massachusetts Sen. Elizabeth Warren, who has led the opposition against a White House-backed trade bill.\n“I think the president was disrespectful to her about the way he did that,” Sen. Sherrod Brown, D-Ohio, told reporters Tuesday, a few days after Obama referred to Warren, who is a Democrat, as “Elizabeth” and “a politician.” Shortly after that, Senate Democrats successfully blocked the trade bill, which would give the president expanded authority to negotiate a trade pact. \n“I think the president has made this more personal than he needed to,” Brown also said, arguing Obama would not have referred to a male senator by his first name. \nOn Wednesday, White House Press Secretary Josh Earnest told MSNBC that Brown was a “stand-up guy” and said he was confident that Brown would “find a way to apologize” after reviewing his comments.\nBrown made his comments as the liberal-leaning group the National Organization for Women said Obama’s remarks had sexist overtones. \n“I think it is sexist,\" NOW President Terry O'Neill told The Hill newspaper. \"I think the president was trying to build up his own trustworthiness on this issue by convincing us that Senator Warren's concerns are not to be taken seriously. But he did it in a sexist way.\" \nWarren, a populist and Wall Street reformer, argues that many of the details of the Trans-Pacific Partnership -- a 12-nation pact Obama is pursuing -- remain secret and that corporations, not the courts, will decide the regulations.\nObama told Yahoo in a story published Saturday: “The truth of the matter is that Elizabeth is, you know, a politician like everybody else. And you know, she’s got a voice that she wants to get out there. And I understand that.” \nO'Neill also said the “subtext” of Obama's comments are “ 'the little lady just doesn't know what she's talking about'. …  I think it was disrespectful.\" \nAdvertisement\nTrending in Politics 1 Salmon fund? ‘Aquatic plant’ control? Earmarks soar despite supposed ban, report finds 2 Clinton facing new ethics questions on role in Boeing deal 3 China reportedly warns US against ssending ships, aircraft to South China Sea 4 House votes to block EPA from implementing new water-regulation plan 5 Clinton's top campaign lawyer challenges Ohio voting laws See all Trends Advertisement", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-13T19:06:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}