{"organizations": [], "uuid": "49c1b466fd39e335512dc93780440f2ed8d3f4ac", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2912380/images/o-OBAMA-LETTERMAN-RETIREMENT-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/05/05/obama-show-letterman-piensa-retiro_n_7211912.html", "country": "", "title": "Obama a Letterman: 'Estaba pensando que usted y yo podríamos jugar juntos al dominó'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama a Letterman: 'Estaba pensando que usted y yo podríamos jugar juntos al dominó'", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T18:34:00.000+03:00", "replies_count": 0, "uuid": "49c1b466fd39e335512dc93780440f2ed8d3f4ac"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/05/05/obama-show-letterman-piensa-retiro_n_7211912.html", "ord_in_thread": 0, "title": "Obama a Letterman: 'Estaba pensando que usted y yo podríamos jugar juntos al dominó'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama a Letterman: 'Estaba pensando que usted y yo podríamos jugar juntos al dominó' Publicado: reddit Late Show With David Letterman \nNUEVA YORK (AP) — El presidente de Estados Unidos, Barack Obama, se imagina un futuro de partidas de dominó con el jubilado David Letterman. \nObama bromeó el lunes sobre unos futuros más tranquilos para ambos durante su octava visita al \"Late Show\", señalando que los estadounidenses han crecido con el veterano cómico durante sus 33 años de programa. \n\"Después de un duro día en la oficina o al llegar a casa del trabajo, saber que usted estaba ahí para darnos un poco de alegría y un poco de risas, significó mucho\", dijo Obama. \"Usted es parte de nosotros. Nos ha dado un gran regalo y le adoramos\". \nLetterman está terminando su estancia en el programa de CBS con varios invitados destacados, antes de su última emisión el 20 de mayo. \nEn honor de la visita de Obama, Letterman enumeró las \"10 mejores preguntas que tipos estúpidos hacen al presidente\", que incluía \"¿Será un invitado en uno de mis últimos programas?\" y \"¿Nos muestra su certificado de nacimiento?\". La número uno, en honor de un reciente aterrizaje no autorizado en la finca del Capitolio, era: \"¿Cuándo me devolverá mi girocóptero?\". \nLetterman devolvió el cumplido de Obama elogiando su \"muy divertida\" intervención en la Cena de Corresponsales de la Casa Blanca el mes pasado. \"Soy un tipo bastante divertido\", dijo Obama. \nTambién comentaron el tema más serio de los disturbios en Baltimore, y el presidente dijo que demasiadas minorías tienen una relación de desconfianza con la policía. \nLetterman preguntó si el racismo era un factor. Obama comentó que era un factor residual tras un pasado de esclavismo, leyes de Jim Crow y discriminación, aunque señaló que la sociedad ha avanzado mucho. \"Yo soy una prueba de eso\", dijo ante el aplauso del público en el estudio. \nEl presentador comentó que Obama le había dicho durante un descanso para publicidad que pensaba tomarse un mes libre tras dejar el cargo. El presidente señaló que él y la primera dama esperaban participar en causas que les interesan \"de una forma diferente\", como el cambio climático, así como ayudar a jóvenes desfavorecidos y a las familias militares. \nPero sobre todo, Obama dijo que, como Letterman, estaba deseando vivir lejos de la atención pública. \n\"Estaba pensando que usted y yo podríamos jugar juntos al dominó\", comentó Obama. \"Podríamos ir al Starbucks local y contarnos historias\". \n___ \nNedra Pickler está en Twitter como https://twitter.com/nedrapickler Relacionado en HuffPost Voces: ", "external_links": [], "published": "2015-05-05T18:34:00.000+03:00", "crawled": "2015-05-05T19:02:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}