{"organizations": ["UN"], "uuid": "b5c3a25863e307389be49a63f84804dfbd41320c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/100113/0/0/100113_hn_danon_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/01/netanyahu-sounds-alarm-about-iran-in-un-speech-will-obama-listen.html", "country": "", "title": "Netanyahu sounds alarm about Iran in UN speech -- but will Obama listen? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Netanyahu sounds alarm about Iran in UN speech -- but will Obama listen? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "b5c3a25863e307389be49a63f84804dfbd41320c"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/01/netanyahu-sounds-alarm-about-iran-in-un-speech-will-obama-listen.html", "ord_in_thread": 0, "title": "Netanyahu sounds alarm about Iran in UN speech -- but will Obama listen? | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Netanyahu", "Obama"], "text": "Republicans, stand and fight or risk getting nothing from government shutdown \n[pullquote] \nThe Israeli Prime Minister pointed to a series of inconvenient facts about Iranian intentions and actions that the Obama administration has either rejected or ignored in its quest for peace in our time. \nWhen the Iranian regime’s stooges chant “death to the Jews” they mean it. Rouhani is “acceptable” inside Iran because he’s a loyal follower of its Supreme Leader. \nThere was nothing democratic about Rouhani’s election, which came after 99% of candidates were banned from running. \nRouhani is no innocent; he was national security advisor while his regime murdered Israelis and Americans around the world. \nAfter his appointment, the Iranian nuclear weapons program has continued unabated. His rhetoric may be “soothing,” but there is no substantial difference with his predecessor, Ahmadinejad. \nIn Netanyahu’s words: “I wish I could believe Rouhani, but I don't. Because facts are stubborn things.” \nHis problem, however, is that President Obama is even more stubborn. The Israeli leader may have thought that the facts would speak for themselves. He quoted Iran’s obvious lie only last week that “it has never chosen deceit and secrecy.” \nActually, in both 2002 and 2009, Iran was caught red-handed secretly building nuclear facilities. \nNetanyahu quoted from Rouhani’s own published playbook: he had fooled the West by manufacturing “a calm environment” while his nuclear program proceeded full steam ahead. \nThe Israeli prime minister spelled out exactly what Iran really wants from its so-called “charm offensive.” It wants “to retain sufficient nuclear material and infrastructure to race to the bomb at a time of its choosing.” \nAnd he tried to make the point as plain as possible. He quipped that Rouhani thinks “he can have his yellow cake and eat it too.” \nWhat he didn’t say, was that Rouhani has invited Obama to tea and the president of the United States has accepted. \nAfter setting out the facts, the Israeli leader tried to sound the alarm to those beyond Israel. He cautioned that “a nuclear-armed Iran will make the specter of nuclear terrorism a clear and present danger” and that “a nuclear-armed Iran will not be another North Korea, but another fifty North Korea's.” \nAnd yet Netanyahu knew full-well that his U.N. warnings had fallen on deaf ears year-after-year. So he concluded with a summary of what Israel intends to do if nobody listens. \nFirst, his country takes Iranian promises to wipe Israel off the map seriously. Such words are not “bluster.” “The world may have forgotten this lesson. The Jews have not.” \nAnd second, “Israel will not allow Iran to get nuclear weapons. If Israel is forced to stand alone, it will stand alone.” The Jewish people are defenseless no longer. \nIt was a powerful moment. But it was just a moment. \nU.N. delegates went to lunch. The country went back to thinking about gridlock in Washington. And the Iranian centrifuges continued spinning. \nWith business as usual all around, there are very few mysteries left in this saga. What will President Obama do to Israel to attempt to prevent Netanyahu from making good on his promise to stop Iran and defend the Jewish state? And will it work? \nAnne Bayefsky is director of the Touro Institute on Human Rights and the Holocaust. Follow her on Twitter @AnneBayefsky . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:09:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}