{"organizations": [], "uuid": "0ce48e072d80a7efd0981e6817f891640b768145", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/05/14/congress-cannot-let-obama-negotiate-free-trade-agreement-without-tough-new-rules/_jcr_content/image.img.jpg/0/0/1431617765172.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/politics/index.html", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/opinion/2015/05/14/congress-cannot-let-obama-negotiate-free-trade-agreement-without-tough-new-rules.html", "country": "US", "title": "Congress cannot let Obama negotiate a free trade agreement without tough new rules", "performance_score": 0, "site": "foxnews.com", "participants_count": 4, "title_full": "Congress cannot let Obama negotiate a free trade agreement without tough new rules | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T03:00:00.000+03:00", "replies_count": 3, "uuid": "5fa852b26da5a1b149ba1017ad9378c7f8e3552b"}, "author": "Peter Morici", "url": "http://www.foxnews.com/opinion/2015/05/14/congress-cannot-let-obama-negotiate-free-trade-agreement-without-tough-new-rules.html#post-0", "ord_in_thread": 0, "title": "Congress cannot let Obama negotiate a free trade agreement without tough new rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Peter Morici\n FoxNews.com livefyre Email Print Congress should not permit President Obama to negotiate a free trade agreement with Pacific nations without tough new rules to stop currency manipulation and other cheating on trade deals.\nTrade agreements eliminate tariffs and lower regulatory barriers to commerce—for example, restrictions on U.S. banks and information technology for companies operating in foreign markets.\nThose arrangements should offer consumers a wider range of less expensive imported goods, boost exports and increase American incomes by moving workers from lower paying jobs—such as assembling cell phones—to higher paying employment—designing new devices and software.\nA Trans-Pacific Partnership offers great economic potential and would strengthen U.S. security ties with Asian allies, but it only makes sense with enforceable disciplines on currency manipulation and unfairly subsidized foreign goods. Too often, free trade disappoints.\nThe president implemented a trade pact with South Korea in March 2012 promising big gains. Bilateral imports are up $15.5 billion but exports only $3 billion—killing more than 100,000 manufacturing jobs.\nWhen imports grow more than exports, economists expect the value of the dollar to fall against foreign currencies—that raises prices for foreign goods, lowers prices for U.S. products sold abroad and creates good-paying jobs. Frustrating those free market adjustments, principal U.S. competitors—China, Japan, Germany, and South Korea—pursue monetary and exchange rate policies explicitly intended to keep their currencies cheap against the dollar.\nSince last summer the value of the dollar is up 16 percent. That’s enough, for example, to kill virtually all of the good paying jobs promised by the President’s proposed Trans-Pacific Partnership establishing free trade with 11 other Asian nations—including long-time currency manipulator Japan.\nAlso, governments target industries—such as autos and information technology—and compel U.S. firms to move factories and R&D abroad to sell in their markets. That steals jobs that should stay in America.\nAlready, U.S. imports exceed exports by more than $500 billion annually—directly destroying 4 million jobs.\nCurrency manipulation is illegal under World Trade Organization rules, but Obama has ignored pleas from industry, members of congress and both liberal and conservative economists to effectively address the problem.\nSimilarly, U.S. trade laws permit the Commerce Department and U.S. International Trade Commission to impose tariffs on subsidized imports that destroy jobs. But those ignore currency manipulation and have been weakened in recent years permitting many Asian exporters to evade enforcement.\nRepublicans and Democrats in Congress have proposed fixes to trade enforcement laws, but the White House wants to block a provision that would require the Commerce Department to consider currency manipulation in its calculations of foreign subsidies.\nModern trade agreements liberalize the treatment of foreign goods and services by altering domestic regulations for product standards, the environment and the like. Foreign leaders won’t negotiate with an American president if Congress can alter his commitments during the ratification process. Hence, Congress has granted presidents since Gerald Ford Trade Promotion Authority, which binds the House and Senate to put trade deals to a simple up or down vote.\nThe Senate is about to vote on a bill that would grant Obama TPA to negotiate the Trans-Pacific Partnership that does not require the president to seek tough rules to stop currency manipulation and relegates strengthening U.S. trade enforcement laws to a separate bill, which the president could veto even if Congress grants him TPA.\nPresidents Reagan and Clinton were forceful advocates of worker interests in international trade and from 1980 to 2000 the economy accomplished 3.4 percent growth and annual family incomes rose $9,900.\nThe same cannot be said about both the recent Bush and Obama administrations and since 2000, U.S. GDP growth has averaged 1.8 percent and family incomes are down about $4,600.\nA Trans-Pacific Partnership offers great economic potential and would strengthen U.S. security ties with Asian allies, but it only makes sense with enforceable disciplines on currency manipulation and unfairly subsidized foreign goods.\nCongress should require the president to agree to those in exchange for approving Trade Promotion Authority to finalize the Trans-Pacific Partnership trade pact.\nPeter Morici served as Chief Economist at the U.S. International Trade Commission from 1993 to 1995. He is an economist and professor at the Smith School of Business, University of Maryland, and a widely published columnist. He is the five time winner of the MarketWatch best forecaster award. Follow him on Twitter @PMorici1 .\n+ Follow FoxNewsOpinion on Facebook\nADVERTISEMENT\nTRENDING IN OPINION 1 Obama needs to keep out of newsrooms 2 School freaks out over boys baseball storage shed 3 Congress cannot let Obama negotiate a free trade agreement without tough new rules 4 Why men won't marry you 5 The unhinged Left: Liberal reaction to Kirsten Powers' book See all Trends Opinion Newsletter Don't miss a minute of opinion. Sign up for our newsletter now\nYour subscription has been submitted. American Innovation More →\nHow IBM's Watson supercomputer is battling cancer with advanced genomics Want to control a swarm of robots? Georgia Tech has the answer Art and technology battle autism through MSSNG project Fox Nation ABC News' George Stephanopoulos Discloses $75K Contribution to Clinton Foundation, Will Not Moderate Presidential Debates May 14, 2015\nActor Leaves Hollywood to Join Militia to Fight ISIS ... May 14, 2015\nRove: Clintons Misstep, Obama Lashes Out … The Democrats' Baffling Behavior May 14, 2015\nHillary's Campaign Already Showing Signs Of Trouble As Unfavorable Rating Soars May 14, 2015\nMalkin: The First Lady's Moving (But Untrue) Stories of Racial Slights May 14, 2015\nAdvertisement", "external_links": [], "published": "2015-05-14T03:00:00.000+03:00", "crawled": "2015-05-14T22:52:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}