{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "7a1e908b3b3f80b568cd1049f4f47e3f7457d365", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/10/04/obama-needs-to-park-campaign-bus-and-lead/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422641538587.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/04/obama-needs-to-park-campaign-bus-and-lead.html", "country": "", "title": "Obama needs to park the campaign bus -- and lead | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama needs to park the campaign bus -- and lead | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "7a1e908b3b3f80b568cd1049f4f47e3f7457d365"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/04/obama-needs-to-park-campaign-bus-and-lead.html", "ord_in_thread": 0, "title": "Obama needs to park the campaign bus -- and lead | Fox News", "locations": ["Rockville", "Md."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print FILE -- Oct. 3, 2013: President Obama speaks about the government shutdown and debt ceiling during a visit to M. Luis Construction, which specializes in asphalt manufacturing, concrete paving, and roadway reconstruction, in Rockville, Md. (AP Photo/Charles Dharapak) \nEvery successful president compromises. Even the men whose images we print on our currency and whose ideals we teach to schoolchildren understood when political reality and real leadership dictated deal-making. Unfortunately this notion seems completely lost on the current occupant of the Oval Office. On Thursday, President Obama again reiterated not only a refusal to compromise, but also a refusal even to negotiate seriously. \nHe staged a public event in which he insulted his counterpart in negotiations, House Speaker John Boehner, and said Boehner was in thrall of “extremists” who had a peculiar “obsession” with ObamaCare. \n[pullquote] \nThis was not what was needed from a leader amid a country in a government slimdown and possibly facing temporary debt default later this month. \nThis also isn’t how real presidents act. For example, most agree that Ronald Reagan was one of the more idealistic modern presidents. But even Reagan said: “there are some people so imbued with their ideology that if they can’t get everything they want, they’ll jump off the cliff with the flag flying. As governor, I found that if I could get half a loaf, instead of stalking off angrily, I’d take it.” Liberal idealists like Franklin Roosevelt and Lyndon Johnson had the same ability. The initial versions of Social Security and Medicare -- respectively their two signal domestic achievements -- reflected numerous compromises with their political opposition. Of course, they all came to the White House with something President Obama lacked: experience governing. Reagan and Roosevelt each served terms as governor. Johnson had a long tenure in the Senate including as majority leader. But Obama came to office with just two years of experience in the Senate before he began his campaign in 2006 (and had published two autobiographies about his greatness). Obama still could have learned, in nearly six years as president, that leadership requires compromise. More On This... Obama admin. employing 'Make It Hurt' strategy? \nHe also could have taken the unsubtle hint Bill Clinton gave him in re-nominating Obama at the 2012 Democratic Convention. \nIn a speech that had appropriately partisan red meat for the occasion Clinton nonetheless stressed: “the politics of constant conflict may be good, but what is good politics does not necessarily work in the real world. What works in the real world is cooperation.” Clinton probably privately grasps what Obama evidently does not: that ObamaCare is unpopular with voters, as is unsustainable deficit spending. That is why voters elected a Republican House of Representatives in 2010 and 2012, and why some compromise by each party in our divided government is now necessary. Clinton understood from his tenure that for government to work he would have to compromise on some issues -- which he did to resolve government shutdowns. \nReagan -- who for six years faced a nearly identical situation as Obama with a Senate controlled by his party and a House controlled by the opposition -- also knew leadership required compromise. Importantly, that compromise is what enabled opposition politicians, who were also chosen by the will of the American people, to go back to their constituents and say that they too had won something; they too had done what they were elected to do. Obama’s country needs him to be a leader now -- not a campaigner. Instead, he says imperiously there will be no compromise on his unpopular healthcare law and no negotiations over his demand for the ability to rack up more debt. Unfortunately for Obama, the lore of government shutdowns as told in Washington is looking more and more suspect. \nThe lore has held that Republicans, who supposedly lost the government shutdown fights of the mid-1990s, will always lose them to a president who has the bigger bully pulpit. But as with phony doom-and-gloom predictions about sequester budget cuts, this may turn out to be another Washington truism that just isn’t true. Obama will then be left with a choice that grows starker with each passing day. He can either figure out how to compromise like his predecessors, or continue down the path to becoming the most churlish and immature president in American history. \nChristian Whiton is the president of the Hamilton Foundation . He was a State Department senior advisor in the George W. Bush administration and a policy advisor on the Giuliani and Gingrich presidential campaigns. He is author of \" Smart Power: Between Diplomacy and War \" (Potomac Books 2013). ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:10:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}