{"organizations": [], "uuid": "d7eddb14b6ee5040ed455be73b4d1febafbb755e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2996360/images/o-NOTE-OBAMA-TWITTER-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/education/news.xml", "section_title": "Education News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/26/five-year-old-letter-obama-twitter_n_7445296.html?utm_hp_ref=education&ir=Education", "country": "US", "title": "Obama Tweets Back To Girl's Awesome Letter About World Peace, Marriage Equality", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Tweets Back To Girl's Awesome Letter About World Peace, Marriage Equality", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T01:44:00.000+03:00", "replies_count": 0, "uuid": "d7eddb14b6ee5040ed455be73b4d1febafbb755e"}, "author": "Cameron Keady", "url": "http://www.huffingtonpost.com/2015/05/26/five-year-old-letter-obama-twitter_n_7445296.html?utm_hp_ref=education&ir=Education", "ord_in_thread": 0, "title": "Obama Tweets Back To Girl's Awesome Letter About World Peace, Marriage Equality", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  US President Barack Obama fist bumps with a statue of a gorilla at a pub in Denver, Colorado, on July 8, 2014. AFP PHOTO/Jewel Samad (Photo credit should read JEWEL SAMAD/AFP/Getty Images) US President Barack Obama (L) fist bumps a supporter after speaking at a campaign rally in Nashua, New Hampshire, on October 27, 2012. AFP PHOTO/Jim WATSON (Photo credit should read JIM WATSON/AFP/Getty Images) US first lady Michelle Obama fist bumps after an interview before the start of Democratic National Convention at the Time Warner Cable Arena September 3, 2012 in Charlotte, North Carolina. The AFP PHOTO/Brendan SMIALOWSKI (Photo credit should read BRENDAN SMIALOWSKI/AFP/GettyImages) US President Barack Obama (L) asks for a fist bump from a young girl as he speaks with patrons outside the Kozy Corner restaurant in Oak Harbor, Ohio, July 5, 2012, where he made an unannounced visit to speak with supporters while on a bus tour of Ohio and Pennslyvania. AFP PHOTO/Jim Watson (Photo credit should read JIM WATSON/AFP/GettyImages) WASHINGTON, DC - APRIL 25: (AFP OUT)U.S. President Barack Obama gives a fist bump to a young boy during a 'Let's Move' tennis clinic during the White House Easter Egg Roll on the South Lawn of the White House April 25, 2011 in Washington, DC. About 30,000 people are expected to attend the 133-year-old tradition of rolling colored eggs down the White House lawn. (Photo by Chip Somodevilla/Getty Images) US President Barack Obama fist bumps with Niko Letterlough, 7, who said he wants to play a game of foosball with Obama and would let him win, after reading Christams book 'The Polar Express' to an audience of elementary school children at the Richard England Clubhouse and Community Center in Washington, DC, on December 21, 2009. AFP PHOTO/Jewel SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) WASHINGTON - APRIL 8: In this handout provide by the White House, U.S. President Barack Obama (L) holding a football, offers a fist-bump, to senior staff member Pete Rouse (R), during a meeting with senior advisors in the Oval Office of the White House on April 8, 2009 in Washington, DC. Obama is serving as the 44th President of the U.S. and the first African-American to be elected to the office of President in the history of the United States. (Photo by Pete Souza/White House via Getty Images) CHANTILLY, VA- OCTOBER 22: Democratic presidential nominee U.S. Sen. Barack Obama (D-IL) fists bumps with Ethan Gibbs the son of Robert Gibbs the campaign communication director as he arrives at Dulles International Airport October 22, 2008 in Chantilly, Virginia. Obama continues to campaign with election day less than two weeks away. (Photo by Joe Raedle/Getty Images) ST. PAUL, MN - JUNE 3: Democratic presidential candidate Sen. Barack Obama (D-IL) (R) and his wife Michelle Obama bump fists at an election night rally at the Xcel Energy Center June 3, 2008 in St. Paul, Minnesota. Obama clinched the Democratic presidential nomination following today's primaries in South Dakota and Montana, although his rival Sen. Hillary Clinton (D-NY) has not yet conceded the race. (Photo by Scott Olson/Getty Images)  Share", "external_links": [], "published": "2015-05-27T01:44:00.000+03:00", "crawled": "2015-05-27T08:59:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}