{"organizations": ["Fox News Latino"], "uuid": "51f1926ac5ad7711de336218054f1d24f832685c", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Praeli%20Clinton%20Outreach.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/20/hillary-clinton-appoints-dreamer-immigration-activist-lorella-praeli-as-latino/", "country": "", "title": "Hillary Clinton's new Latino outreach director is a former Dreamer, immigration activist | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Hillary Clinton's new Latino outreach director is a former Dreamer, immigration activist | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "51f1926ac5ad7711de336218054f1d24f832685c"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/20/hillary-clinton-appoints-dreamer-immigration-activist-lorella-praeli-as-latino/", "ord_in_thread": 0, "title": "Hillary Clinton's new Latino outreach director is a former Dreamer, immigration activist | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Mike"], "text": "Hillary Clinton's new Latino outreach director is a former Dreamer, immigration activist Published May 20, 2015 Fox News Latino (Photo by Mike Windle/Getty Images for VH1) \nDemocratic presidential frontrunner Hillary Clinton named former Dreamer and outspoken immigration activist Lorella Praeli as her campaign’s Latino Outreach Director, her campaign confirmed to Fox News on Wednesday. \nPraeli, a Peruvian who was undocumented for almost 13 years, will be the Clinton campaign’s main link between the candidate and the Latino community across the country, including on issues related to immigration and Latino rights. \n\"We are thrilled to have Lorella Praeli, a Dreamer, join our team because of her courage and perspective in the fight for Latino families across the country,\" Amanda Renteria, Hillary for America National Political Director, said in a press release. \"Her experiences and relationships will be valuable in developing the coalition to ensure the Latino community has a voice in this campaign and in this country.\" \nRenteria seemed to indicate that the campaign appointed a former Dreamer to the position to make a statement. \n\"Bringing Lorella into our campaign is the next step in making sure families aren't living in fear of deportation, all students have the chance to go to college, and that any comprehensive immigration reform ensures full and equal citizenship,\" she said. \nPraeli was a Dreamer advocate for many years but received a green card in 2012. Her sister is a recipient of DACA, the presidential order that suspends deportation for at least two years, and her mother remains undocumented, although she is likely eligible for the Deferred Action for Parents of Americans (DAPA) policy. Praeli still considers herself a Dreamer even though she has permanent residency in the U.S. \nPraeli, who most recently worked as the advocacy and policy director for the immigrant rights group United We Dream, worked on developing the organization’s political strategy for all elements of Comprehensive Immigration Reform, and implementation of the 2012 Deferred Action for Childhood Arrivals (DACA) policy. \nPraeli lost her right leg in a car accident in Peru when she was 2 and when she was 10, her family decided to move to the United States, so that Praeli could get better access to prosthetic care and have more opportunity as a disabled child. She went on to graduate summa cum laude with a bachelor’s degree in political science and sociology from Quinnipiac University \nThe appointment of Praeli to Latino Outreach Director continues Clinton’s moves to try and reel in the Hispanic vote early in her campaign. \nEarlier this month, Clinton said that any immigration overhaul must include a path to \"full and equal citizenship.\" \n\"This is where I differ with everybody on the Republican side. Make no mistake, not a single Republican ... is clearly and consistently supporting a path to citizenship. Not one,\" Clinton said, adding, \"When they talk about legal status, that is code for second-class status.\" \nClinton's pitch to Latino voters came as two of her potential Republican rivals, former Florida Gov. Jeb Bush and Florida Sen. Marco Rubio, have courted Hispanics and talked about ways to overhaul the immigration system. \nFox News special events producer Serafin Gomez and The Associated Press contributed to this report. \nLike us on Facebook ", "external_links": [], "published": "2015-05-20T03:00:00.000+03:00", "crawled": "2015-05-21T11:30:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}