{"organizations": [], "uuid": "f4d5f83a8541cb18ca41089a8a5f3bc413f80c30", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2930192/images/o-CARLY-FIORINA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/marijuana/feed", "section_title": "Marijuana on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/08/carly-fiorina-marijuana_n_7243908.html", "country": "US", "title": "Carly Fiorina Wouldn't Enforce Federal Marijuana Ban In States With Legalization", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Carly Fiorina Wouldn't Enforce Federal Marijuana Ban In States With Legalization", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T20:50:00.000+03:00", "replies_count": 0, "uuid": "f4d5f83a8541cb18ca41089a8a5f3bc413f80c30"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/08/carly-fiorina-marijuana_n_7243908.html", "ord_in_thread": 0, "title": "Carly Fiorina Wouldn't Enforce Federal Marijuana Ban In States With Legalization", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nFormer Hewlett-Packard CEO and Republican presidential candidate Carly Fiorina said on Thursday that as president, she would not enforce the federal ban on marijuana in states that have legalized the substance. \nMarijuana has long been classified as illegal under federal law, but Colorado, Washington, Alaska, Oregon and the District of Columbia have legalized recreational use, and other states are considering legalization between now and the start of the next presidential administration. Under President Barack Obama, the Department of Justice has largely refrained from enforcing the federal ban, but a future president might not necessarily continue that approach. \n\"I believe in states’ rights. I would not as president of the United States enforce federal law in Colorado where Colorado voters have said they want to legalize marijuana,\" Fiorina told the editorial board of The Des Moines Register in an interview. \"As I think I’ve tried to convey, I don’t think that overreacting to illegal drug use is the answer.\" \nSeveral of Fiorina's likely rivals for the Republican nomination have come out in favor of states' rights on the issue, such as Sen. Rand Paul (Ky.), Sen. Ted Cruz (Texas) and former Florida Gov. Jeb Bush, while others have said they'd enforce the federal law, including Sen. Marco Rubio (Fla.) and New Jersey Gov. Chris Christie. \nFiorina stopped short of advocating for outright legalization, which none of the declared or likely presidential candidates have indicated that they favor. \n\"I’m a states' rights advocate. I respect Colorado’s right to do what they did. Okay? They are within their rights to legalize marijuana, and they are conducting an experiment that I hope the rest of the nation is looking closely at,\" Fiorina said. \"You’re asking my personal opinion. My personal opinion is the legalization of marijuana does not help us. Are they within their rights? Yes.\" \nAsked more specifically why she opposed legalization, Fiorina, a breast cancer survivor, moved the conversation in a personal direction. \n\"Somehow we’ve sent this message to young people -- I know it’s not what the law says, but the message is real clear to young people if you look at a place like Colorado -- we’ve sent the message that pot is just no big deal. And it’s just not true,\" she said. \"I remember being a cancer patient and my doctors asking me whether I wanted access to medicinal marijuana, and my answer was no.\" \n\"My doctor said ‘I’m really glad, because marijuana is now a chemically complex compound. We don’t understand it, we don’t know what’s in it, we don’t know how it interacts with other things,'' Fiorina continued. \nAlthough Thursday's comments appear to be the first time Fiorina has directly addressed the issue of enforcing the federal marijuana prohibition, her opposition to legalization is consistent with her previous stances. During Fiorina's failed 2010 bid for a U.S. Senate seat from California, her only prior run for elected office, her campaign website stated , \"Carly opposes the legalization or decriminalization of drugs, including marijuana.\" That same year, she opposed Proposition 19, an ultimately unsuccessful ballot initiative that would have legalized recreational use of marijuana in the state. (A similar ballot initiative will likely appear before California voters again in 2016.) \nStill, Fiorina argued on Thursday for changes to criminal justice policies related to drug use and to a culture that often stigmatizes treatment. \n\"We know that we don’t spend enough money on the treatment of drug abuse. When you criminalize drug abuse, you’re actually not treating it. We had a daughter who died of addictions, so this lands very close to home for me,\" Fiorina said, referring to her stepdaughter Lori, who died in 2009 at age 34. \"When we are criminalizing abuse, it is a cost to society. We’re not helping the people who need help.\" \nAdvocates for marijuana reform celebrated the news. \n\"It's quickly becoming a consensus position in both parties that states should be able to set their own marijuana laws without federal interference and harassment,\" said Tom Angell, president of Marijuana Majority. \"While it'd be great to have a president who personally supports legalization or acknowledges marijuana's medical benefits, what's most important is whether a candidate plans to spend federal resources overturning duly enacted state laws when they get into the Oval Office.\" \n\"Thankfully, rapidly increasing voter support for reform is forcing most of the candidates to say the right things about respecting local marijuana policies,\" Angell added. \nFiorina, who officially entered the race on Monday, spoke with the editorial board during a campaign stop in Iowa, which holds the nation's first contest of the primary and caucus season. The state has not legalized medical marijuana, as 23 states and the District of Columbia have, nor has it decriminalized the substance, as 17 states and the District have. \nAs of Friday, Fiorina is polling 12th among Republican contenders in Iowa with 2.0 percent support, and 14th nationally with 0.6 percent, according to HuffPost Pollster. About 53 percent of Americans now support marijuana legalization, a figure that has trended significantly upward in the past several years. More:", "external_links": [], "published": "2015-05-08T20:50:00.000+03:00", "crawled": "2015-05-09T01:00:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}