{"organizations": [], "uuid": "8df66fbba66cb4bad70aac3e9dcb91c47d61fff6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2919314/images/o-MARTIN-OMALLEY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/hillary-clinton/feed", "section_title": "Hillary Clinton on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/06/martin-omalley-hillary-clinton-immigration_n_7223264.html", "country": "US", "title": "Martin O'Malley Takes Thinly Veiled Dig At Hillary Clinton's Immigration Record", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Martin O'Malley Takes Thinly Veiled Dig At Hillary Clinton's Immigration Record", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T15:03:00.000+03:00", "replies_count": 0, "uuid": "8df66fbba66cb4bad70aac3e9dcb91c47d61fff6"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/06/martin-omalley-hillary-clinton-immigration_n_7223264.html", "ord_in_thread": 0, "title": "Martin O'Malley Takes Thinly Veiled Dig At Hillary Clinton's Immigration Record", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As Hillary Clinton Tries To Boost Immigration Record, Martin O'Malley Touts His Own Posted: reddit Win McNamee via Getty Images \nWASHINGTON -- Hillary Clinton received raves from immigration reform supporters on Tuesday by coming out in favor of broad deportation relief. For former Maryland Gov. Martin O'Malley, a potential Democratic opponent in the presidential primary, it was a chance to subtly point out that her record on immigration hasn't always been so strong. \nO'Malley spokeswoman Lis Smith put out a statement not long after Clinton's immigration remarks touting the former governor's record. It didn't mention Clinton, but the subtext was clear. \nClinton said last year that unaccompanied minors apprehended on the border \"should be sent back.\" O'Malley argued against their quick deportation, saying it would be tantamount to sending children \"back to certain death.\" \n\"Governor O'Malley stood up when it mattered,\" Smith said. \"When most leaders in the Democratic and Republican Parties were saying that we should close our border to children fleeing violence in Central America, he defied them and said that we could not send children 'back to certain death.' He was criticized for that position, but leadership is about forging public opinion, not following it.\" \nO'Malley has an extensive record on measures meant to help immigrants. Last year, he called for lawyers to help represent the unaccompanied minors in deportation proceedings. He also announced the state would limit law enforcement participation in a controversial immigration program. In 2011, O'Malley signed the so-called Maryland Dream Act , which allows undocumented immigrants to receive in-state tuition. \nO'Malley also signed a law in 2013 expanding access to driver's licenses for undocumented immigrants. The driver's license issue recently gave O'Malley another opportunity to take a jab at Clinton. \nDuring her 2008 presidential campaign, she opposed allowing unauthorized immigrants to obtain driver's licenses. This time around, she supports the policy . \n\"I’m glad Secretary Clinton’s come around to the right positions on these issues,\" said O'Malley said after Clinton switched positions to support driver's licenses for the undocumented and a constitutional amendment allowing same-sex marriage. \"I believe that we are best as a party when we lead with our principles and not according to the polls.\" More:", "external_links": [], "published": "2015-05-06T15:03:00.000+03:00", "crawled": "2015-05-06T19:31:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}