{"organizations": [], "uuid": "7ce061560852814d73d197a0511e44e4f3da6c21", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2904364/images/o-CHUCK-SCHUMER-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/02/chuck-schumer-currency-trade-china_n_7192708.html", "country": "", "title": "Chuck Schumer Warns Obama His Trade Agenda Is Dead Without A China Currency-Manipulation Crackdown", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Chuck Schumer Warns Obama His Trade Agenda Is Dead Without A China Currency-Manipulation Crackdown", "spam_score": 0.0, "site_type": "news", "published": "2015-05-02T14:53:00.000+03:00", "replies_count": 0, "uuid": "7ce061560852814d73d197a0511e44e4f3da6c21"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/02/chuck-schumer-currency-trade-china_n_7192708.html", "ord_in_thread": 0, "title": "Chuck Schumer Warns Obama His Trade Agenda Is Dead Without A China Currency-Manipulation Crackdown", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chuck Schumer"], "text": "Chuck Schumer Warns Obama His Trade Agenda Is Dead Without A China Currency-Manipulation Crackdown Posted: reddit \nWASHINGTON -- President Barack Obama can just about kiss his trade agenda goodbye if he doesn't allow Congress to pass a measure cracking down on China and other nations that manipulate the value of their currency, Sen. Chuck Schumer (D-N.Y.) said in an interview with The Huffington Post. \nSchumer, likely the next leader of Senate Democrats, has railed for years against the Chinese practice of keeping the value of its currency artificially low, which makes its products cheaper and American products more expensive. The imbalance is estimated by some to have cost more than 3 million U.S. jobs. \nWith Obama pushing Congress to give him so-called fast-track authority to pass massive new trade agreements with Pacific nations and Europe, Schumer and a bipartisan group of lawmakers are using the opportunity to try and force the White House to get tough on China's monetary policy. They managed to add a currency manipulation measure to one of four bills passed by the Senate Finance Committee last month that would advance Obama's trade agenda. \nBut most Democrats oppose granting any president fast-track authority, since it would allow the White House to pass trade deals through Congress with no amendments and none of the procedural blockades usually thrown up in the Senate. If they didn't like the eventual trade pacts, there would be little they could to halt them. \n\"What we’ve got now is a tough currency bill that doesn’t require the OK of the administration because both the Bush administration and this administration have refused in this instance to protect the American workers by citing China for currency manipulation, even though everyone knows they're doing it,\" Schumer said. \nWhite Houses current and past have opposed such legislation. When Schumer and the others advanced their measure in the Finance Committee, they were unable to attach it directly to the bill granting fast track, or Trade Promotion Authority, as it is formally known. Instead, they added it to a bill on customs and extra enforcement. \nThe move advanced their effort, but it leaves it more vulnerable to a presidential veto, which would doom it. \nBut Schumer said that unless Obama promises not to veto it, the president's broader trade push will be is serious jeopardy. \n\"We are going to tell folks that unless the administration says they won’t veto it, they’re going to lose a lot of votes on TPA, on the regular trade bill,\" Schumer said, noting that his currency measure is likely to pass because numerous Republicans are all in favor of it. \n\"The good news about currency manipulation is it’s one of those areas where there’s bipartisan support,\" he said. \"Our big problem has been the president’s veto threat.\" \nThe White House declined to make any promises about currency manipulation, referring The Huffington Post to statements press secretary Josh Earnest made earlier this week, when he was asked if the president would veto a fast-track bill with a currency provision added to it. \nEarnest did not answer, but pointed to administration efforts to get China and other manipulators to stop. Officials also warned in a hearing last month that if a currency measure is part of the trade legislation, a number of trading partners would probably back out, leaving those nations closer to China than the United States. The White House released a detailed report Friday arguing the benefits of trade . \nBut Schumer and other opponents are skeptical, and he said he's told the administration so in clear terms. \n\"I said I know you think this helps you geopolitically, but to me, the number one problem facing America is the decline of middle-class incomes, how difficult it is for average Americans -- everyday families -- to stay in the middle class or get to the middle class,\" Schumer said. \"And if your trade bills make it harder, I ain’t for ‘em.\" \nHis warning notwithstanding, Schumer was unwilling to say Obama's trade push was doomed. \n\"It’s going to be hard [for him to succeed], but when a president goes all out, never underestimate him,\" Schumer said. Other Democrats have complained that they've never seen Obama push as hard at any other initiative, including cherished goals like raising the minimum wage . \nThe New York senator also noted that while most GOP leaders are for the trade bills, many tea party-aligned members are not. \n\"Part of it depends on a whole bunch of Republicans who are against it, too. Maybe their leadership will get them,\" Schumer said. \"Let’s put it like this: It’s hardly a slam-dunk, but it’s not certain it won’t pass.\" \nSchumer said he's likely to oppose fast-track either way. \"But at least with currency manipulation, we’ll get something good out of trade that will help American workers.\" More: ", "external_links": [], "published": "2015-05-02T14:53:00.000+03:00", "crawled": "2015-05-02T14:53:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}