{"organizations": [], "uuid": "2b271886db7184e068d39c82aa5534c3a409f284", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2932284/images/o-MICHELLE-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/black-voices/news.xml", "section_title": "Black Voices News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/09/michelle-obama-tuskegee-commencement_n_7249232.html?utm_hp_ref=black-voices&ir=Black+Voices", "country": "US", "title": "Michelle Obama: I Faced Certain Questions Because Of 'Fears And Misperceptions' Around My Race", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Michelle Obama: I Faced Certain Questions Because Of 'Fears And Misperceptions' Around My Race", "spam_score": 0.0, "site_type": "news", "published": "2015-05-10T01:00:00.000+03:00", "replies_count": 0, "uuid": "2b271886db7184e068d39c82aa5534c3a409f284"}, "author": "Sam Levine", "url": "http://www.huffingtonpost.com/2015/05/09/michelle-obama-tuskegee-commencement_n_7249232.html?utm_hp_ref=black-voices&ir=Black+Voices", "ord_in_thread": 0, "title": "Michelle Obama: I Faced Certain Questions Because Of 'Fears And Misperceptions' Around My Race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sasha, Malia, Michelle & Barack Obama of   President Barack Obama leans over to talk with his daughter Sasha as they sit with first lady Michelle Obama and Malia and watch the performances at the National Christmas Tree lighting ceremony, Thursday, Dec. 4, 2014, on the Ellipse near the White House in Washington. President Barack Obama, joined by his daughters Malia and Sasha, speaks at the White House on Nov. 26, 2014, during the presidential turkey pardon ceremony, an annual Thanksgiving tradition. (AP Photo/Jacquelyn Martin) President Barack Obama bike rides with daughter Malia and first lady Michelle Obama on Aug. 15, 2014, on the Manuel F. Correllus State Forest bike path outside of West Tisbury, Mass., during the Obama family vacation on the island of Martha's Vineyard. President Barack Obama -- with first lady Michelle Obama, and their daughter Malia -- waves as they arrive at the White House in Washington, Sunday, Jan. 4, 2015, from a family vacation in Hawaii. President Barack Obama eats shave ice with daughter Malia Obama at Island Snow, Thursday, Jan. 1, 2015, in Kailua, in Hawaii during the Obama family vacation. President Barack Obama, his daughter Sasha, the first lady Michelle Obama and their other daughter Malia disembark Air Force One after arriving at Joint Base Pearl Harbor-Hickam for their annual family Christmas vacation Friday, Dec. 19, 2014, in Honolulu. The first family -- Malia Obama, Sasha Obama, President Barack Obama, and first lady Michelle Obama -- join performers Aloe Blacc, Darius Rucker and Rita Ora on the stage during the taping of the annual 2014 Christmas in Washington presentation at the National Building Museum in Washington, Sunday, Dec. 14, 2014. President Barack Obama, first lady Michelle Obama and daughters Malia and Sasha arrive at Joint Base Pearl Harbor-Hickam in Honolulu on December 19, 2014, at the start of their annual Christmas vacation in Hawaii. Malia Obama, Sasha Obama, President Barack Obama, and first lady Michelle Obama speak onstage at TNT Christmas in Washington 2014 at the National Building Museum on December 14, 2014 in Washington, DC. First lady Michelle Obama and her daughters Sasha and Malia walk across the tarmac before boarding Air Force One prior to their departure from Andrews Air Force Base, Saturday, Aug. 30, 2014. The first family traveled to Westchester County, N.Y., to attend the wedding ceremony of White House chef Sam Kass and MSNBC host Alex Wagner. Malia Obama participates in a service project at the Boys & Girls Club of Greater Washington to celebrate Martin Luther King, Jr. Day of Service on Monday, Jan. 19, 2015, in Washington. President Barack Obama and first lady Michelle Obama walk with their daughter Malia across the South Lawn of the White House in Washington, Sunday, Aug. 24, 2014, following their arrival on Marine One. President Barack Obama waves to reporters as he walks with his daughter Malia on the South Lawn of the White House in Washington, Tuesday, Aug. 19, 2014. President Barack Obama speaks with Col. John C. Millard, Commander, 89th Airlift Wing, accompanied by his daughters, Malia and Sasha, and first lady Michelle Obama, upon their arrival at Andrews Air Force Base in Md., on Saturday, Aug. 30, 2014, en route to Westchester County, N.Y., to attend the wedding ceremony of White House Chef Sam Kass and MSNBC host Alex Wagner. President Barack Obama walks from Marine One with Vice Commander of the 89th Airlift Wing at Andrew Air Force Base Col. Preston Williamson IV, followed by his daughter Malia Obama, first lady Michelle Obama and Christine Williamson, to board Air Force One at Andrews Air Force Base, Md., Saturday, Aug. 9, 2014. en route to a family vacation on the Massachusetts island of Martha's Vineyard. (AP Photo/Jacquelyn Martin) President Barack Obama walks out of the White House with his daughter Sasha toward Marine One, Friday, Dec. 19, 2014. First lady Michelle Obama, Malia Obama, Sasha Obama and President Barack Obama react as they light the 2014 National Christmas Tree during the National Christmas Tree lighting ceremony at the Ellipse near the White House in Washington, Thursday, Dec. 4, 2014. President Barack Obama, with daughters Malia and Sasha and first lady Michelle Obama, watch musical performances at the National Christmas Tree lighting ceremony, Thursday, Dec. 4, 2014, on the Ellipse near the White House in Washington. President Barack Obama and his daughter Sasha Obama leave the White House for their holiday vacation December 19, 2014, in Washington. Malia Obama and Sasha Obama speak onstage at TNT Christmas in Washington 2014 at the National Building Museum on December 14, 2014 in Washington. First daughters Sasha Obama, left, and Malia Obama look back for their parents as they walk out of the White House in Washington, Saturday, Aug. 30, 2014, and head to Marine One. Marine Commandant Gen. James Amos, President Barack Obama, Sasha Obama and first lady Michelle Obama look on during the Marine Barracks Evening Parade, on Friday, June 27, 2014, in Washington. First lady Michelle Obama walks with her daughters Sasha and Malia and her mother Marian Robinson on their way to see pandas at the Giant Panda Research Base in Chengdu in southwest China's Sichuan province Wednesday, March 26, 2014. First lady Michelle Obama dances with performers during her visit to an ancient city wall with her daughters Malia and Sasha in Xi'an, in northwestern China's Shaanxi province, Monday, March 24, 2014. First lady Michelle Obama shares a light moment with her daughters Malia and Sasha as they visit the Mutianyu section of the Great Wall of China in Beijing, Sunday, March 23, 2014. President Barack Obama and his daughter Sasha make burritos at D.C. Central Kitchen as part of a service project in honor of Martin Luther King, Jr. Day, Monday, Jan. 20, 2014, in Washington. President Barack Obama and first lady Michelle Obama share a laugh during the National Prayer Breakfast in Washington, Thursday, Feb. 5, 2015. President Barack Obama, first lady Michelle Obama, their daughters Sasha and Malia and other family members watched the Oregon State University vs. University of Akron college basketball game at the Diamond Head Classic at the Stan Sheriff Center in Honolulu, on December 22, 2013. President Barack Obama and daughters Sasha and Malia purchase books at Politics and Prose bookstore for 'Small Business Saturday' on November 29, 2014 in Washington, DC. First lady Michelle Obama hugs her daughters Malia and Sasha when they watch a performance during their visit to an ancient city wall in Xi'an, in northwestern China's Shaanxi province, Monday, March 24, 2014. President Barack Obama kisses first lady Michelle Obama for the 'Kiss Cam' while attending the Olympic men's exhibition basketball game between Team USA and Brazil, Monday, July 16, 2012, in Washington.  Share", "external_links": [], "published": "2015-05-10T01:00:00.000+03:00", "crawled": "2015-05-10T08:03:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}