{"organizations": [], "uuid": "360c50dbc907934fd9fd1c72eaf489fee4c5da78", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/lynchlorettaobamabarack_111114getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/243409-obama-to-meet-with-lynch-following-fifa-arrests", "country": "US", "title": "Obama to meet with Lynch following FIFA arrests", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama to meet with Lynch following FIFA arrests", "spam_score": 0.0, "site_type": "news", "published": "2015-05-29T03:50:00.000+03:00", "replies_count": 0, "uuid": "360c50dbc907934fd9fd1c72eaf489fee4c5da78"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/243409-obama-to-meet-with-lynch-following-fifa-arrests", "ord_in_thread": 0, "title": "Obama to meet with Lynch following FIFA arrests", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama to meet with Lynch following FIFA arrests By Jordan Fabian - 05/28/15 08:50 PM EDT President Obama will meet Friday with Attorney General Loretta Lynch following a blockbuster indictment of nine officials from FIFA, international soccer’s powerful governing body. The arrests Wednesday brought Lynch worldwide attention just one month after she was sworn in as Obama’s top law enforcement official. Lynch played a central role in the years-long investigation. It was spearheaded by the U.S. attorney’s office for the Eastern District of New York, which Lynch led for five years before being tapped as attorney general. The White House has declined on multiple occasions to comment on the FIFA arrests, saying it does not want to interfere with the investigation. ADVERTISEMENT The meeting also comes as Obama looks to Lynch to defend two major pieces of his domestic legacy from legal threats. The president’s deportation relief programs face an uncertain future after a federal appeals court declined to lift a court order blocking them from taking effect. In a sign the administration is resigned to a lengthy legal battle, the Justice Department decided not make an emergency request to lift the order. Instead, it will focus on appealing the legal merits of the injunction, a process that may take longer but the administration believes will result in a more certain legal outcome for the programs. The department is also fighting a lawsuit brought by House Republicans challenging Obama’s use of executive authority when it comes to implementing his signature healthcare law. Next month, the Supreme Court is expected to hand down a ruling in the King v. Burwell case, which will decide whether health insurance subsidies are allowed in states that did not set up their own exchanges. Observers worry Obamacare could could unravel if the high court rules against the administration. Lynch has also helped lead the administration’s response to tensions between law enforcement and minority communities following a string of police-related deaths of young black men in cities across the country. This week, the city of Cleveland agreed to reform its embattled police department after a Justice Department probe into its use of excessive force. The issue was thrust into the national spotlight following the shooting of 12-year-old Tamir Rice by a police officer last November, although the specific incident was not part of the review. Lynch also launched a similar investigation into the Baltimore police department earlier this month following the death of Freddie Gray, 25, while in police custody. Obama and Lynch will meet one day after the Justice Department indicted former House Speaker Dennis Hastert (R-Ill.) on charges of illegally hiding financial transactions and lying about it to federal investigators.", "external_links": [], "published": "2015-05-29T03:50:00.000+03:00", "crawled": "2015-05-29T05:32:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}