{"organizations": [], "uuid": "42decf406f77893f1ebfcc3e0d72738e00c38445", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051215_kf_tedbush.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/transcript/2015/05/13/ted-cruz-responds-to-jeb-bush-stance-on-immigration-iraq/", "country": "US", "title": "Ted Cruz responds to Jeb Bush's stance on immigration, Iraq", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Ted Cruz responds to Jeb Bush's stance on immigration, Iraq | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "42decf406f77893f1ebfcc3e0d72738e00c38445"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/05/13/ted-cruz-responds-to-jeb-bush-stance-on-immigration-iraq/", "ord_in_thread": 0, "title": "Ted Cruz responds to Jeb Bush's stance on immigration, Iraq", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com Email Print\nThis is a rush transcript from \"The Kelly File,\" May 12, 2015. This copy may not be in its final form and may be updated.\nMEGYN KELLY, HOST: Well, as Brit Hume just laid out, in the 24 hours since our interview with Jeb Bush, much of the political media has obsessed over one answer, ignoring other news that could have a much bigger impact on 2016. Including what the governor said about leadership, common core and immigration. Listen.\n(BEGIN VIDEO CLIP)\nJEB BUSH, FORMER FLORIDA GOVERNOR: There are very few other options that I can see. The option of self-deportation or making things so harsh is not really -- I don't think that's practical. And rounding people up door to door isn't practical either. But a practical solution of getting to fixing the legal system is also allowing for a path to legalize status. Not necessarily citizenship.\nCommon core means a lot of things to different people. So they could be right based on what's in front of them. I respect people having a view, but the simple fact is we need higher standards. They need to be state driven. The federal government should play no role in this, either in the creation of standards, content or curriculum. That's what I believe.\nIf I show my heart, show that I care about people, show my passion for the things that need to get fixed, show my leadership style because -- this isn't like running for the Senate, you know, where you can just vote for me and, you know, kind of the words just go into the ether because you know nothing is going to happen.\n(END VIDEO CLIP)\nKELLY: Earlier I spoke with Senator Ted Cruz, the first Republican to enter the 2016 race for president.\nSenator, good to see you tonight. So, what did you think of the Jeb Bush interview?\nSEN. TED CRUZ, R-TEXAS, PRESIDENTIAL CANDIDATE: Well, Megyn, it's great to be with you, it's always great to join you. You know, look, I'm a fan of Jeb Bush. I'll give him credit for candor and consistency, he is running based on his views, his views are different from that of a lot of Republican primary voters. But he's honest about it, and I think we're going to have a clear straight-up debate about what's the right direction for the Republican Party to go and what's the right direction for the country to go.\nKELLY: What about that? Because looking at the records, most of the candidates have little nits that they can be hit with on, you know, position changes. You actually don't have many. And I'll say that, because I've looked at your record pretty closely. And Jeb Bush doesn't. Because he stands by, you know, even the most controversial things. Do you believe he deserves credit for that?\nCRUZ: I think it is important for someone to stand by what they believe. And you know what I've tried to do in the Senate has been really simple, it's been tell the truth, and do what I said I would do, if I'm with you, I'm really with you, if I'm not with you, I'm not with you. And I think people respect that.\nKELLY: Obviously we spent a lot of time on immigration and common core, which are the two big issues probably for him as he acknowledges with some on the GOP base. Honest subject of immigration, which you've been passionate about yourself. What he said to me was, I pressed him for example on, you know, when you were governor of Florida, you supported in state tuition rates for the children of illegal immigrants. And he said, look, what are you going to do with a kid who happens to be here illegally, thanks to his parents, who is valedictorian of his high school and can't go to college without that rate? You're going to say no? And the he put it to me was, there's a point at which we are over the line. We have to show those kids some respect. What's your answer to that?\nCRUZ: Well, you know, there are awful lot of candidates in the 2016 field who have supported amnesty or have gone back and forth on the issue. My position has been consistent and clear. I think amnesty is wrong. I think it is unfair.\nKELLY: But this isn't an amnesty exactly. This is a different thing. It is a benefit for an illegal immigrant child. Maybe a little less controversial than amnesty, but it's still controversial.\nCRUZ: Well, but if you grant in state tuition to students who are here illegally, that comes at the expense of American citizens or it comes at the expense of legal immigrants who follow the rules to come here, you know, there's a finite number of slots, and a finite number of dollars. And often the people that get left behind in this immigration debate are legal immigrants, are people like my dad who in 1957 fled Cuba, he came on a student visa, came here legally, and I think most American people outside of Washington agree that we need to secure the borders, we need to stop illegal immigration. Amnesty is wrong.\nKELLY: He says that too.\nCRUZ: And -- but that amnesty's wrong, and this is where, you know, I disagree with the many 2016 candidates who have embraced a pathway to citizenship.\nKELLY: Common core, he's going to stand on that and defend that as raising American standards and education, you see it a bit differently.\nCRUZ: I do. I believe we should repeal every single word of common core. And the reason is simple. I think education is far too important for it to be governed by unelected bureaucrats in Washington. It should be at the state level.\nKELLY: But it is. But it is. The response to that is that the governor's got together to push this through?\nCRUZ: But Megyn, that's not how it works, the Obama administration has used race to the top money, federal money to force states to adopt common core standards.\nKELLY: But can't they bail out if they don't want to be a part of it?\nCRUZ: Well, sure, they can, but there are a lot of dollars connected to it, and the federal government, you know, it's sort of like the drug dealer that goes to the junior high and gets a kid hooked by saying, just try it once, the federal government does that to the states with dollars, and there are so many strings attached.\nKELLY: Let's talk about the Iraq war discussion. You know, I asked him knowing what we know now, would you have authorized the invasion. He answered a different question than the one that I asked, and now he's come out and said, I didn't, you know, I misheard. So, let me just ask you the question, knowing what we know now, would you have authorized the invasion of Iraq?\nCRUZ: Of course not, I mean, the entire predicate of the war against Iraq was the intelligence that showed they had weapons of mass destruction and that there was a real risk they might use them. Now, I would note, there was a bipartisan consensus, both republicans and democrats looking at that intelligence concluded it was a real threat. We now know that intelligence was false.\nKELLY: Uh-mm.\nCRUZ: And without that predicate, there's no way we would have gone to war with Iraq, and we know that now.\nKELLY: And I know, I mean, do you defend the decision to go in by President Bush at the time given the information he was given?\nCRUZ: Well, listen, at the time I wasn't serving in the Senate, so I didn't see the classified briefings, I didn't see the intelligence. And so, I don't want to second guess based on what I lack of complete information.\nKELLY: You said that before, you've said that before, you don't want to do a hypothetical, because you didn't see the Intel. But let me ask you this, because Governor Bush said something else that I thought would be controversial. Specifically he said, nation building is a good sentiment. I was asking whether if he subscribes to his brother's foreign policy. The Bush doctrine. And he said, Jeb Bush, \"nation building is a good sentiment. Exporting our values is a good sentiment. But the core of my foreign policy,\" he said, \"will be peace and security.\" You have said something very different about what you called the Cruz doctrine. What is the difference?\nCRUZ: Well, to be fair, I don't claim to have any doctrines and certainly don't hope to, but, you know, I think foreign policy ought to be dictated by the vital National Security interest of the United States. If and when military action is required, number one, we should be reluctant to use military power. America always has been, you know, it's worth noting, the biggest country Reagan ever invaded was Grenada, but if and when we're required to use military force it should be with a clearly defined objective, it should be with overwhelming force, and then we should get the heck out. It is not the job of our soldiers, and sailors and airmen and marines, to transform for a nation for the democratic Utopias, it is the job to hunt down and kill terrorists who want to murder Americans before they can carry out Jihad.\nKELLY: Uh-mm. I want to ask you, you got hit by BuzzFeed recently, a Washington Post columnist Jennifer Rubin picked it up, she's not a liberal. For your attendance at committee meetings in the U.S. Senate saying that you have missed too many. And suggesting that this has been a dereliction by you, because you're not doing -- Jennifer Rubin wrote, there comes a point at which the taxpayers are not getting their money's worth, because you've missed 21 for 135 roll call votes this year. I want to give you the chance to respond.\nCRUZ: Well, look, it's not a surprise, that \"The Washington Post\" is criticizing me, that's not the first time --\nKELLY: But Jennifer Rubin --\nCRUZ: I promise you it won't be the last. What is the simple reality is, anyone who is running for president. You have to be out campaigning in Iowa, New Hampshire, South Carolina, you have to be listening to the people, you have to be meeting the people, hearing their questions, that's the way our system works, it's a great system. That takes time, if you look at every senator who has even run for president, consistently they end up having to missed a lot of committee meetings, a lot of votes, because to do the job responsibly of running for president, you need to look voters in the eyes and answer their questions.\nKELLY: And here's my last question to you. Because we're out of time. Speaking of looking people in the eyes and answering questions, there was a big dust up between you and Mark Halperin this week, he asked you some ridiculous questions about your Cuban heritage and whether you would speak in Spanish. And basically it seemed to many like he was trying to test your Cuban heritage, and then he came out and apologize because there was a dust up, and in what some are now calling your finest moment, you were quick to come to his defense, and really took the classy route. I want to give you the chance to tell the audience what you said, in response to what could have been an opportunity for you to stump on the neck of a journalist who was since in trouble.\nCRUZ: Well, thank you, Megyn. I thought it was much to do about nothing. And I mentioned Mark Halperin is serious and fair-minded journalist. And he took some grief for some silly questions that he asked me, and he offered an apology, and I said it was neither. It wasn't needed because offense wasn't taken, I don't think it was intended. But I certainly appreciated the apology. And I'm proud of my Cuban heritage, I'm proud of my father's journey from oppression to freedom. I'm proud of my Irish Italian heritage. And I'll tell you Megyn, if you care sometime, Heidi and I we'll have you over to the house and I'll let my dad fix some picadillo and Cuban flan and you can test the food we put on the table.\nKELLY: Well, I'm going to test you on the Italian. Arrivederci Senator Cruz, it's good to see you.\nCRUZ: Ciao.\n(LAUGHTER)\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\nthe-kelly-file The Kelly File , hosted by Megyn Kelly, airs on Weekdays at 9PM ET on Fox News Channel.\nMore on this show Advertisement\nAdvertisement", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T02:07:03.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}