{"organizations": [], "uuid": "896d8ce6ce26ff01230caedfab89d7eddff602b9", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/warwire/feed", "section_title": "Warwire on Huffington Post", "url": "http://www.huffingtonpost.com/h-a-goodman/dick-cheneys-1994-gulf-wa_b_7340618.html", "country": "US", "title": "H. A. Goodman: Dick Cheney's 1994 Gulf War Interview Proves Why Jeb Bush Can't Blame Obama or Intelligence Failures", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "H. A. Goodman: Dick Cheney's 1994 Gulf War Interview Proves Why Jeb Bush Can't Blame Obama or Intelligence Failures", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T15:12:00.000+03:00", "replies_count": 0, "uuid": "896d8ce6ce26ff01230caedfab89d7eddff602b9"}, "author": "H. A. Goodman", "url": "http://www.huffingtonpost.com/h-a-goodman/dick-cheneys-1994-gulf-wa_b_7340618.html", "ord_in_thread": 0, "title": "H. A. Goodman: Dick Cheney's 1994 Gulf War Interview Proves Why Jeb Bush Can't Blame Obama or Intelligence Failures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nContrary to popular belief, Dick Cheney wasn't always the neoconservative who advocated we topple Saddam Hussein and bring democracy and freedom to Iraq. In fact, George H. W. Bush's Secretary of Defense is seen here in a 1994 interview and quoted in Military.com explaining why after the Gulf War, the U.S. had no choice but to keep Saddam Hussein in power: \nAt the conclusion of the operation, it was decided that U.S. forces would stop short of invading Iraq and pushing on to Baghdad. As Cheney explained at the time: \"Because if we'd gone to Baghdad we would have been all alone. There wouldn't have been anybody else with us. There would have been a U.S. occupation of Iraq. None of the Arab forces that were willing to fight with us in Kuwait were willing to invade Iraq. Once you got to Iraq and took it over, took down Saddam Hussein's government, then what are you going to put in its place? That's a very volatile part of the world, and if you take down the central government of Iraq, you could very easily end up seeing pieces of Iraq fly off.\" Ironically enough, this scenario played out during his later tenure as Vice-President, as Operation Iraqi Freedom led to a new government in Iraq, with the danger of a fragmented country constantly looming. \nUnfortunately, \"we were all alone\" in Iraq and mired within a counterinsurgency war by the time the Maliki government asked the U.S. to leave Iraq in 2011 . Because other leaders in the region knew that removing Saddam would lead to chaos, \"None of the Arab forces that were willing to fight with us in Kuwait were willing to invade Iraq.\" Like Cheney, all the Arab nations allied with the U.S. back then knew that Saddam's fall would lead to a Vietnam-like quagmire of competing Sunni and Shia factions. \nAfter all, as Cheney argued after a victorious Gulf War that left the Iraqi dictator in power, once Saddam's regime was gone, \"what are you going to put in its place?\" \nLike all counterinsurgency conflicts, the greater power's occupation of a fledgling state failed to dissuade Shia leaders like Nouri al-Maliki from arresting and murdering Sunni political rivals, thus making democracy impossible and ethnic cleansing a tragic inevitability. With ISIS now 70 miles west of Baghdad , Cheney's belief that we'd have a \"U.S. occupation\" leading to a situation where \"pieces of Iraq fly off\" serves as an enlightening backdrop to Jeb Bush's recent Fox Interview . \nBush recently stated that knowing what we know now, he still \"would have invaded\" Iraq. While the GOP presidential candidate blames \"faulty intelligence\" for the Iraq invasion, it's important to revisit the predictions of Dick Cheney shortly after America's Gulf War victory. Like Cheney predicted, George W. Bush's Iraq invasion resulted in mayhem: a Shia and Sunni civil war , al-Qaeda's entry and eventual defeat, and the emergence of yet another genocidal terrorist group named ISIS. The truth is that people like Cheney always knew Iraq would be a quagmire, and although many neoconservative historians and politicians suffer from a convenient form of amnesia (including Dick Cheney, who can't seem to remember his own words), blaming Obama is merely an attempt at whitewashing history. \nWhile President Obama was an attorney in Chicago from 1993-2004, Cheney and other Republicans were responsible for our first military incursion into Iraq and refused to enter Bagdad during the Gulf War for a number of reasons. In fact, as a member of the American Enterprise Institute think tank in 1994, Cheney is quoted in a Telegraph article explaining that a \"quagmire\" would have resulted from the removal of Saddam Hussein: \nMr Cheney, then a fellow of the American Enterprise Institute think tank, told the C-Span network that Syria and Iran would get involved in Iraq. \n\"It's a quagmire if you go that far and try to take over Iraq,\" he said. The administration of President George Bush senior had judged that removing Saddam was not worth \"many more\" American lives than the 146 lost in repelling him from Kuwait, he said. \nWhile Cheney ignored his own warning and Iran began funding Shia militias in Iraq , \"many more\" Americans indeed lost their lives in a \"quagmire\" that turned into a deadly counterinsurgency conflict. \nAccording to a USA Today article titled How the IED changed the U.S. military , \"Somewhere between more than half to two-thirds of Americans killed or wounded in combat in the Iraq and Afghanistan wars have been victims of IEDs.\" Fighting battles against rival insurgent groups (Sunni, Shia, al-Qaeda, ISIS, and other groups all vied for power in Iraq) who shared the same goal of targeting U.S. soldiers, 4,491 Americans died and 32,223 Americans have been wounded during the Iraq War. Harvard University estimates that the U.S. will spend $6 trillion for both Iraq and Afghanistan while the nature of counterinsurgency fighting results in our enemies making $30 IED's . \nLike Cheney, Colin Powell recalls in a PBS interview why removing Saddam was never part of the equation and why President George H. W. Bush actually allowed the Sunni Iraqi dictator to take vengeance upon his Shia rivals: \nQ: Saddam took terrible retribution against the Shi'ites and then the Kurds, and George Bush had encouraged people to rise up. Shouldn't you have helped them? \nPowell: That is a good question. I don't know who we would have been helping. I mean the Shi'ites...it wasn't so much a revolution as it was some sort of spontaneous uprising. I don't think any of us knew who they were or who they were being led by. The only issue that came up is, should we do something about the Iraqi helicopters that are being used to suppress them. \nAnd it had never been one of our objectives to get involved in this kind of civil uprising between factions within Iraq and the Iraqi government. And so it was not clear what purpose would have been achieved by getting ourselves mixed up in the middle of that. \nLike Cheney, Powell clearly states that \"it had never been one of our objectives to get involved in this kind of civil uprising between factions within Iraq and the Iraqi government.\" We knew in the early 1990's that there would be \"civil uprisings\" with the removal of Saddam and that we wouldn't have known \"who we would have been helping\" in a post-Saddam world. \nAs for \"faulty intelligence,\" as if the notion that Saddam owning WMD was the first time George W. Bush and his team ever contemplated invading Iraq, an influential neoconservative group named The Project for a New American Century wrote an open letter to President Bill Clinton in 1998 advocating the invasion and removal of Saddam Hussein: \nThe only acceptable strategy is one that eliminates the possibility that Iraq will be able to use or threaten to use weapons of mass destruction. In the near term, this means a willingness to undertake military action as diplomacy is clearly failing. In the long term, it means removing Saddam Hussein and his regime from power. That now needs to become the aim of American foreign policy. \nThe \"only acceptable strategy\" for neoconservatives as early as the Clinton years influenced George W. Bush to invade Iraq, not merely \"faulty intelligence.\" Furthermore, even if intelligence reports were inaccurate, it is incumbent upon any president to make the right decisions , not blame the CIA or other intelligence agencies for their blunders. \nPresidents, not the CIA or other intelligence services, decide the direction of foreign policy. While Obama might not be perfect, our counterinsurgency conflict in Iraq was the consequence, oddly enough, of ignoring Dick Cheney's 1994 warnings. Now that we know Jeb Bush would still have invaded Iraq, even with the knowledge of its catastrophic outcome, Americans have another warning from a leading Republican of what the future holds with a new Bush administration. \nAlso, the idea (espoused by those who claim to support the troops by keeping Americans perpetually in Iraq) that Obama could have left 10,000 U.S. soldiers in Iraq, as if their presence would have deterred ISIS or brought peace to warring Shia and Sunni militias, is \"mostly false\" and ignores history. Sunni and Shia leaders in Iraq never cared about U.S. national interest, they focused upon bolstering their own power at the expense of ethnic rivals, and both al-Qaeda and ISIS have used this rift to their advantage. Like Cheney once said, our decision resulted in a \"quagmire,\" and any attempt at blaming Obama or intelligence failures ignores not only recent history, but also the words of the Iraq War's leading architect. \nFollow H. A. Goodman on Twitter: www.twitter.com/HAGOODMANAUTHOR More:", "external_links": [], "published": "2015-05-20T15:12:00.000+03:00", "crawled": "2015-05-20T20:06:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}