{"organizations": [], "uuid": "d68610ccf4672b1eee56d030c51d5681eb33b238", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/09/23/will-obama-fall-for-rowhani-deception/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422633283291.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/23/will-obama-fall-for-rowhani-deception.html", "country": "", "title": "Will Obama fall for Rowhani's deception? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Will Obama fall for Rowhani's deception? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "d68610ccf4672b1eee56d030c51d5681eb33b238"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/23/will-obama-fall-for-rowhani-deception.html", "ord_in_thread": 0, "title": "Will Obama fall for Rowhani's deception? | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print FILE -- May 2, 2013: Iranian President Hasan Rouhani delivers a speech during his campaign for the presidential election in Tehran, Iran. The U.N. has slotted the new moderate-leaning president to address the global gathering of leaders on Sept. 24 -- just hours after U.S. President Barack Obama is scheduled to wrap up his speech. (AP/Vahid Salemi) \nHe’s been portrayed by the mainstream media as the anti-Ahmadenijad—a pragmatic moderate who’s set to strike a grand bargain with the United States and save the world from a looming military showdown over Iran’s nuclear weapons program. \nBut as Iranian president Hassan Rowhani takes center stage at the U.N. General Assembly this week, full of reassuring smiles and promises of peace, the Obama administration would be wise to keep a peculiar-sounding Arabic word in mind. \nThat word is taqiyya (pronounced ta-kee-ah). Translated into English, it means “deception.” \nTaqiyya has long been a favorite tactic utilized by radical Shia Islamists—like those that comprise the current Iranian regime—to confound their enemies and lull them into a false sense of security, even complacency. \n[pullquote] More On This... Iran's Rowhani and Obama at UN -- get ready for US credibility to go from bad to much worse \nIf President Obama ends up meeting with Rowhani on Tuesday when both men speak before the General Assembly (an encounter White House officials have hinted may take place), expect nothing less than a full-on taqiyya-fest. \nTaqiyya means that Hassan Rowhani can promise Western interviewers that Iran has no intention of developing nuclear weapons, while at the same time, his government enriches uranium at breakneck speed—so fast, in fact, that a senior Israeli minister said recently that Iran would be capable of producing a nuclear weapon within the next six months. \nTaqiyya means that Rowhani can go before the U.N. General Assembly and proclaim that Iran wants peace with all nations, even as the Iranians actively work towards the destruction of Israel—a goal that would be imminently attainable if Iran’s mullahs were to acquire nuclear weapons—and play a key role in destabilizing Syria and Iraq. \nTaqiyya also means that Rowhani can tell President Obama that Iran desires dialogue and an easing of tensions with the United States, while at the same time, other members of his government, including Supreme Leader Ali Khamenei, repeatedly threaten the United States and vow to never abandon Iran’s pursuit of a nuclear bomb. \nIn other words, taqiyya means that Rowhani can say say one thing while his masters back in Tehran do the exact opposite. \nThis was precisely the plan when Ayatollah Khamenei—the ultimate authority and decision maker in Iran—chose the media-savvy, Western-educated Rowhani to succeed the incendiary Mahmoud Ahmadenijad as the regime’s face to the world. \nKhamenei wagered that the new president would charm the socks off Western elites—who have zero appetite for confrontation and are desperate for a way out of the Iranian nuclear crisis—and he was exactly right. \nWhile Rowhani talks Western leaders to death, the Iranians can continue developing weapons of mass death. \nOf course, the whole notion of Hassan Rowhani as a moderate flies in the face of his radical track record. \nThis is the same Hassan Rowhani who was a close associate and disciple of Ayatollah Ruhollah Khomeini, the godfather of Iran’s brutal Islamic revolution and the man who practically patented the phrases “Death to America” and “Death to Israel.” \nRowhani has held various top positions in Iran’s totalitarian regime over the past four decades—including a two-year stint as Iran’s top nuclear negotiator. \nIn 1999, he oversaw a bloody government crackdown on Iran’s pro-democracy student movement. \nJust last month, he called Israel a “wound” on the Muslim word that “needs to be removed” (Iran’s state-controlled media later tried to walk the statement back: too honest) and in a recent interview with NBC’s Ann Curry, refused to say whether or not he believed the Holocaust really happened. \nAll of this makes little difference to President Obama. He’s spent the past four-and-a-half years making failed overtures to the Iranian regime in hopes of striking a “grand bargain” that would see Iran forsakeits nuclear obsession. \nNow that Rowhani is on the scene, Obama administration officials seem to have convinced themselves that a deal could be within reach. \nAnd just as Russian president Vladimir Putin bailed Obama out of a potential disaster in Syria (at least temporarily), Obama is counting on Rowhani to help him avert an unpleasant moment of reckoning on Iran’s nuclear weapons program. \nLet the taqiyya commence. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:14:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}