{"organizations": [], "uuid": "a01900a2b05275f280816659336d80eb54f8258a", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/obamamom.png", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/video/in-the-news/241634-obama-makes-surprise-calls-on-mothers-day", "country": "US", "title": "Obama surprises US moms with special phone call", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama surprises US moms with special phone call", "spam_score": 0.0, "site_type": "news", "published": "2015-05-11T21:51:00.000+03:00", "replies_count": 0, "uuid": "a01900a2b05275f280816659336d80eb54f8258a"}, "author": "Judy Kurtz", "url": "http://thehill.com/video/in-the-news/241634-obama-makes-surprise-calls-on-mothers-day", "ord_in_thread": 0, "title": "Obama surprises US moms with special phone call", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama surprises US moms with special phone call By Judy Kurtz - 05/11/15 02:51 PM EDT \nDawn Miller says she had no idea when she answered her phone last week that President Obama would be on the line. \nThe lady told me, “This is the White House calling, I’m going to connect you.” ADVERTISEMENT The next thing the Tucson, Ariz., resident knew, she was chatting with the commander-in-chief.\n“It’s funny because when I heard his voice I was like, ‘Get out of here.’ I just couldn’t speak, I couldn’t believe it,” Miller says. \nMiller, a training manager at a correctional officer academy, was one of three moms selected by the White House to receive personal calls from Obama last week in honor of Mother’s Day. \nShe had written to Obama after her then-22-year-old son was bitten by a rattlesnake a year-and-a-half ago. “You know that’s something you can never prepare yourself for, right? I was able to cover him on my insurance until he’s 26 due to the Affordable Care Act,” Miller says, which prompted her to pen a letter telling her story and mail it to 1600 Pennsylvania Ave. \n“I never thought that the president would make a phone call to me! I never thought that that would happen. So when it did happen, to say the least, I was very shocked,” Miller recalls. \nPart of her call is featured on a Mother's Day-themed video released by the White House. “The one that’s stuttering and stammering, that would be me. Which is really funny because I’m never at a loss for words,” Miller tells ITK. “He said, ‘Ask me a question, ask me anything.’ So what are you supposed to ask the president of the United States? What his favorite color is? What his birthday is?” \nIn the lunchroom getting ready for her shift at work, Miller says her co-workers were equally skeptical. “When the call came through I was like, ‘Excuse me, guys. I need to step outside. This is the White House calling.’ And they were like, ‘Yeah, right.’ Like if they could throw food at me they probably would’ve.” \nBefore putting Obama on speakerphone for her crew at work, Miller says, “I said, ‘The president wants to speak to you guys,’ and somebody actually said, ‘The president of what?’” \nAfter Mlller and her colleagues realized Obama was the real deal, she says he turned the conversation towards her son. “He said, ‘If I could offer your son some advice — something along the lines of those things have rattles for a reason, you know. I was like, oh, the president’s got jokes!” \nAnd the executive mansion resident gave his presidential seal of approval to her son’s musical taste, when Miller told him that he didn’t hear the rattlesnake because he wearing headphones while listening to rapper Kendrick Lamar. “The president complimented my son on his taste of music and said that he’s a fan of Kendrick Lamar as well.” \nBut the 50-year-old mom of two quips that there are a couple of people who might not have appreciated her surprise phone call from Obama quite as much: her son and 13-year-old daughter. “They felt like they got ripped off a little bit because they’re like well what are we supposed to do to compete with that?” \nMiller has a bit of advice in case anyone out there gets a surprise call straight from the Oval Office: “I would tell them sit down,” she says with a big laugh, “I was seriously shocked and I got shaky.” And be wary of putting one’s face too close to the phone: “I’m looking at my iPhone and I’m like, ‘Don’t you hit that red button.’ I was so afraid I was going to hang up on the president.”", "external_links": [], "published": "2015-05-11T21:51:00.000+03:00", "crawled": "2015-05-11T22:53:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}