{"organizations": ["Obama White House", "Fox News Facebook", "Twitter"], "uuid": "23295257dc9764aca829dfc93eb42697152194f9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/07/11/obama-white-house-falsely-blames-ambassador-patterson-for-morsi-mess/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422587246537.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/11/obama-white-house-falsely-blames-ambassador-patterson-for-morsi-mess.html", "country": "", "title": "Obama White House falsely blames Ambassador Patterson for Morsi mess | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama White House falsely blames Ambassador Patterson for Morsi mess | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "23295257dc9764aca829dfc93eb42697152194f9"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/11/obama-white-house-falsely-blames-ambassador-patterson-for-morsi-mess.html", "ord_in_thread": 0, "title": "Obama White House falsely blames Ambassador Patterson for Morsi mess | Fox News", "locations": ["Ramadan", "Egypt", "Cairo", "Nasr City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mohammed Morsi", "Patterson", "Morsi"], "text": "Facebook 0 Twitter 0 livefyre Email Print July 10, 2013: Supporters of ousted Egypt's President Mohammed Morsi shout slogans during a demonstration after the Iftar prayer, evening meal when Muslims break their fast during the Islamic month of Ramadan, in Nasr City, Cairo, Egypt. (AP) \nIn Josh Rogin’s and Eli Lake’s Daily Beast column this week, current and former “Obama administration officials” anonymously attempt to shift blame for President Obama’s failed engagement with Egypt’s Muslim Brotherhood to career foreign service officer and current U.S. Ambassador to Egypt Anne Patterson. \nWhile such spin from the White House and its political allies is not surprising given America’s rudderless Middle-East policy, the Obama administration’s latest effort is both a red herring and disrespectful to one of our nation’s finest diplomats. \nI personally saw Ambassador Patterson’s commitment to U.S. national security policy at the UN where she served as a deputy and acting Chief of Mission during the Bush administration. It was President Obama’s demand that Patterson engage the Muslim Brotherhood. For administration staffers to now suggest that it was Patterson’s policy is ridiculous. \nPatterson was relentless in standing up to America’s adversaries at Turtle Bay and took on anyone who stood in the way of America’s priorities. \nSuch conduct was to be expected from Patterson, who had previously been America’s Ambassador to Columbia, during which time she was under constant threat from drug lords and leftist guerrillas. \nIn subsequent assignments, Patterson served as Assistant Secretary of State for International Narcotics and Law Enforcement, where she ran America’s efforts to eradicate Afghanistan’s poppy plantations and cut off the Taliban’s narco-profits, and as Ambassador to Pakistan, during the past several years where a fragile Pakistan also changed leadership. \nPatterson is no neophyte. She certainly understands that it is not in America’s interest to have an Islamist party in charge of Egypt. \nI am sure she would have been happier if Washington had done more to support the secularists, moderate Muslims and Christians in Egypt, who longed for a rule-of-law based society after the fall of US ally Hosni Mubarak. But that was not the administration’s policy in Egypt or in the region. \nWhen the Green Revolution was unfolding on the streets of Tehran, there was silence from the White House and the Mullahs’ tightened their grip in Iran. \nWhen the moderate opposition to Assad was desperate for our support in Syria, little was forthcoming from this Administration. Moderates were sidelined there as they were in Egypt. \nOnce the Muslim Brotherhood gained power in Cairo, Patterson, as the implementer of the White House’s foreign policy had to deal with that reality. \nThe U.S. ambassador is the president’s representative in a foreign land. It is the president’s policy that our ambassadors implement. \nIt was President Obama’s demand that Patterson engage the Muslim Brotherhood. For administration staffers to now suggest that it was Patterson’s policy is ridiculous. \nNo one should be surprised by the course this administration chose. Then-Senator Obama made it clear in his 2008 debate clash with Hillary Clinton that he believes America \"has to talk to its enemies.\" Indeed, at the same time that the administration was engaging the Muslim Brotherhood in Cairo, it was setting up peace talks with the Taliban in Qatar, to the apparent chagrin of our ally President Hamid Karzai in Kabul. \nNow that a large swath of the Egyptian people, backed by the Army, has removed President Morsi and the Muslim Brothers from office, unnamed administration officials believe that the Arkansas-born Patterson, who has excelled under presidents from both political parties and is respected on both sides of the aisle, should be the scapegoat. That cannot be allowed to happen. \nRobert C. O'Brien is a partner in a national law firm in Los Angeles. He served as a U.S. Representative to the U.N. and advised Republican presidential candidate Governor Mitt Romney on foreign policy matters. Robert's website is www.robertcobrien.com . Follow him on Twitter @robertcobrien . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:15:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}