{"organizations": [], "uuid": "5da0c69d9e9643f94873bbfa76f8338ab17c450e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2965572/images/o-MAXINE-WATERS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/college/news.xml", "section_title": "College News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/18/defense-against-repayment_n_7309914.html?utm_hp_ref=college&ir=College", "country": "US", "title": "Defrauded Student Loan Borrowers Face Potential Obama Administration 'Boondoggle'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Defrauded Student Loan Borrowers Face Potential Obama Administration 'Boondoggle'", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T06:02:00.000+03:00", "replies_count": 0, "uuid": "5da0c69d9e9643f94873bbfa76f8338ab17c450e"}, "author": "Shahien Nasiripour", "url": "http://www.huffingtonpost.com/2015/05/18/defense-against-repayment_n_7309914.html?utm_hp_ref=college&ir=College", "ord_in_thread": 0, "title": "Defrauded Student Loan Borrowers Face Potential Obama Administration 'Boondoggle'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Defrauded Student Loan Borrowers Face Potential Obama Administration 'Boondoggle' Posted: Updated: 1 hour ago WASHINGTON, DC - JUNE 28: U.S. Rep. Maxine Waters (D-CA) listens during a discussion June 28, 2013 on Capitol Hill in Washington, DC. Rep. Waters held the discussion on 'A Way Forward For Housing Finance Reform: Finding Sustainable Solutions to Ensure Access, Affordability, and Taxpayer Protection Part II.' (Photo by Alex Wong/Getty Images) | Alex Wong via Getty Images reddit \nDefrauded student loan borrowers seeking relief from the Obama administration are confronting an Education Department process that a senior House Democrat compared to the government’s bungled response to the mortgage robo-signing crisis that shook the U.S. housing market. \nIn the case of robo-signed mortgage documents, bank regulators at the Office of the Comptroller of the Currency and Federal Reserve in 2011 created a time-consuming process to evaluate each borrower’s claim. Banks spent more than $2 billion to process the claims without a single dollar going to aggrieved borrowers before regulators aborted the plan in 2013 in favor of cash payouts and mortgage assistance. \nTo Rep. Maxine Waters (D-Calif.), the top Democrat on the House Financial Services Committee, the Education Department’s likely approach to student loan borrowers who have been defrauded seems doomed to repeat the mistakes. Like in the robo-signing case, borrowers stand to lose. \nFederal law and U.S. Department of Education rules give borrowers the right to have their federal student loans canceled if they were defrauded by their schools into taking out the debt. The so-called defense against repayment provision is buried in borrowers’ loan contracts with the federal government. \nThe Education Department faces more than 1,000 such claims from former students of Corinthian Colleges Inc., the bankrupt for-profit chain that once ranked among the nation’s largest with more than 120 colleges and more than 110,000 students. \nFederal and state authorities have sued the company, alleging it misled prospective students into enrolling with false job placement and graduation rates. Former students seeking to have their federal debts wiped have cited these lawsuits to show that they were duped into taking out federal student loans. Corinthian has denied the allegations. \nBut the Education Department has been slow to process the claims or to tell distressed borrowers their options, leaving many in limbo as interest on their debt accumulates and the prospect of default looms. \nIn fact, the Education Department and one of its loan contractors already has improperly denied at least two applications by erroneously claiming no such right exists. And the department has been silent in the face of numerous requests for information by borrower advocates, Senate Democrats and state attorneys general. \nOn Monday, after nearly five months of waiting, the New York Legal Assistance Group filed a lawsuit against the department to compel the release of documents related to the defense against repayment provision. \n“The department’s failure to produce any of the requested records is part and parcel of its stonewalling of students, legislators, and attorneys general on the whole issue of borrower defense to repayment,” said Eileen Connor, a lawyer at the New York group. \nTo Waters, who battled bank regulators over the adequacy of the robo-signing review, only to watch them scrap the plan amid mounting costs and little relief for defrauded borrowers -- a “boondoggle,” she said -- the Education Department’s response thus far is “distressingly” similar. \n“Students -- many of whom are single mothers, veterans, and low-income people struggling with massive debt -- will reportedly be required to submit to the department individual applications answering complex legal questions,” Waters wrote in an opinion piece published Monday by The Hill, a Washington newspaper. “Without the ability to afford an attorney, these students will likely have a difficult time documenting how they were misled by their Corinthian school and legally proving the losses they incurred.” \nThe Huffington Post in April reported that the Education Department was considering imposing new hurdles for student loan borrowers seeking to get out of their debts by claiming their schools swindled them. The department was considering hiring an outside party to rule on claims made by aggrieved borrowers. \nGroups of Senate Democrats and state prosecutors have asked the department to instead use evidence compiled by state and federal regulators as the basis for determining the validity of aggrieved borrowers’ applications, rather than forcing each borrower to prove that they were defrauded. \nOn Monday, the Education Department seemed to provide evidence to back up Waters’ assertion when it posted 14 job openings for lawyers to adjudicate borrowers’ debt relief applications. Among the duties described in the job listing, which was up for only a few hours before the department pulled it down, were research into state laws, analysis of individual claims and determinations of borrower injury. \nDenise Horn, an Education Department spokeswoman, said the job announcement was “premature.” \n“Our administration is committed to making sure student who have been defrauded receive every penny of debt relief that they are entitled to and to making it as easy as possible for students who were defrauded or whose schools have closed, and we will hold institutions accountable,” Horn said in a statement. “While no final decisions have been made about how to accomplish that, we are clear that it will require some additional staff in our department.” \nWaters said she hopes Education Secretary Arne Duncan ultimately will give cheated borrowers the relief they’re entitled to under federal law. \n“The foreclosure and the student debt crises are similar in a lot of ways -- in both, we saw the targeting of minority communities and service members; high-pressure sales tactics mixed with financial products that many families didn't understand; poorly regulated industries run amok while regulators allowed clear problems to grow; and, in the end, we saw devastating harm caused to both families and to the taxpayer,” Waters said. \nShe added, “But this time, the Department of Education has the chance to do better. Now is the time for them to heed that lesson and provide broad-based relief to students.” Also on HuffPost:   ST. PAUL, MN - JUNE 3: Democratic presidential candidate Sen. Barack Obama (D-IL) (R) and his wife Michelle Obama bump fists at an election night rally at the Xcel Energy Center June 3, 2008 in St. Paul, Minnesota. Obama clinched the Democratic presidential nomination following today's primaries in South Dakota and Montana, although his rival Sen. Hillary Clinton (D-NY) has not yet conceded the race. (Photo by Scott Olson/Getty Images) President Barack Obama acknowledges the crowd as he exchanges fist bumps with the audience after speaking at Hyde Park Academy, Thursday, Feb. 14, 2013, in Chicago. (AP Photo/M. Spencer Green) President Barack Obama fist-bumps custodian Lawrence Lipscomb in the Eisenhower Executive Office Building following the opening session of the White House Forum on Jobs and Economic Growth, Dec. 3, 2009. (Official White House Photo by Pete Souza) President Barack Obama does a fist bump with Ethan Gibbs, the son of Press Secretary Robert Gibbs, after arriving by Marine One on the South Lawn of the White House, Washington, DC, April 19, 2009. President Barack Obama returned from the Fifth Summit of the Americas held in Trinidad and Tobago. (Photo by Aude Guerrucci/AFP/Getty Images) SPRINGHILL, WV- MAY 12: Democratic presidential hopeful Sen. Barack Obama (D-IL) (L) bumps fists with Iraq war veteran Paul Scott after playing a game of pool during a stop at Schultzie's Bar & Hot Spot May 12, 2008 in Springhill, W.Va. Sen. Obama and Sen. Hillary Clinton (D-NY) continue to battle for the Democratic presidential nomination. (Photo by Mark Wilson/Getty Images) WASHINGTON - JULY 8: Los Angeles Mayor Antonio Villaraigosa (L) gives a 'fist bump' to presumptive Democratic presidential nominee Sen. Barack Obama (D-IL) during the national convention of the League of United Latin American Citizens (LULAC) at the Washington Hilton July 8, 2008 in Washington, DC. Obama has been recently criticized for moving to the political center after calling for a slowing of withdrawal of troops from Iraq, supporting a proposed wiretap law and government funding of faith-based programs. (Photo by Chip Somodevilla/Getty Images) CHANTILLY, VA- OCTOBER 22: Democratic presidential nominee U.S. Sen. Barack Obama (D-IL) fists bumps with Ethan Gibbs the son of Robert Gibbs the campaign communication director as he arrives at Dulles International Airport October 22, 2008 in Chantilly, Virginia. Obama continues to campaign with election day less than two weeks away. (Photo by Joe Raedle/Getty Images) U.S. Democratic presidential candidate Illinois Senator Barack Obama (right) and North Carolina Governor Mike Easley bump fists at Sen. Obama's surprise appearance at a North Carolina Democratic Party dinner October 4, 2008 at the The Grove Park Inn in Asheville, North Carolina. (Photo by STAN HONDA/AFP/Getty Images) BAGHDAD, IRAQ - APRIL 7: In this handout provide by the White House, U.S. President Barack Obama (L) receives a fist-bump from a U.S. soldier as he greets hundreds of U.S. troops during his visit to Camp Victory on April 7, 2009, in Baghdad, Iraq. Obama is serving as the 44th president of the U.S. and the first African-American to be elected to the office of president in the history of the United States. (Photo by Pete Souza/White House via Getty Images) WASHINGTON - APRIL 8: In this handout provide by the White House, U.S. President Barack Obama (L) holding a football, offers a fist-bump, to senior staff member Pete Rouse (R), during a meeting with senior advisors in the Oval Office of the White House on April 8, 2009, in Washington, DC. Obama is serving as the 44th president of the U.S. and the first African-American to be elected to the office of president in the history of the United States. (Photo by Pete Souza/White House via Getty Images) U.S. President Barack Obama gives a student a fist bump while touring the Wind Turbine Manufacturing and Fabrication Lab at Lorain County Community College, in Elyria, Ohio, January 22, 2010. Obama is visiting Ohio to tour local businesses and hold a town hall meeting on jobs and the economy. (Photo by SAUL LOEB/AFP/Getty Images) U.S. President Barack Obama bumps fists with a school children after reading Christmas book 'The Polar Express' to an audience of elementary school children at the Richard England Clubhouse and Community Center in Washington, DC, on December 21, 2009. (Photo by JEWEL SAMAD/AFP/Getty Images) US President Barack Obama fist-bumps with a supporter after speaking at a fundraiser for Senator Michael Bennet Feb. 18, 2010, at the Fillmore Auditorium in Denver. (Photo by MANDEL NGAN/AFP/Getty Images) U.S. President Barack Obama (R) fist bumps with Marvin Nicholson as he plays golf at Farm Neck Golf Club in Oak Bluffs on Martha's Vineyard, Massachusetts, on August 26, 2010. The U.S. First Family is vacationing on the Island until Aug. 29. (Photo by JEWEL SAMAD/AFP/Getty Images) WASHINGTON, DC - APRIL 25: U.S. President Barack Obama gives a fist bump to a young boy during a 'Let's Move' tennis clinic during the White House Easter Egg Roll on the South Lawn of the White House April 25, 2011 in Washington, DC. About 30,000 people are expected to attend the 133-year-old tradition of rolling colored eggs down the White House lawn. (Photo by Chip Somodevilla/Getty Images) U.S. President Barack Obama gives a young boy a fist bump as he greets guests after speaking about the economy at Shaker Heights High School in Shaker Heights, Ohio, a suburb of Cleveland, on Jan. 4, 2012. Obama announced plans to appoint Richard Cordray as acting head of the Consumer Financial Protection Bureau in a recess appointment, bypassing Congress and setting up a bitter election-year legal showdown with Republicans. (Photo by SAUL LOEB/AFP/Getty Images) President Barack Obama fist bumps service members after he addressed troops at Bagram Air Field, Afghanistan, Wednesday, May 2, 2012. (AP Photo/Charles Dharapak) U.S. President Barack Obama (L) asks for a fist bump from a young girl as he speaks with patrons outside the Kozy Corner restaurant in Oak Harbor, Ohio, July 5, 2012, where he made an unannounced visit to speak with supporters while on a bus tour of Ohio and Pennslyvania. (Photo by JIM WATSON/AFP/GettyImages) WASHINGTON, DC - JULY 18: U.S. President Barack Obama gives a fist bump to Baylor University basketball guard Terran Condrey while welcoming the 2012 NCAA Women’s Basketball champions in the East Room of the White House July 18, 2012, in Washington, DC. The Baylor Lady Bears became the first NCAA basketball team to complete a 40-0 season by defeating Notre Dame 80-61 in the NCAA women's championship. (Photo by Chip Somodevilla/Getty Images) Point guard Odyssey Sims gets a fist bump from President Barack Obama at a ceremony honoring the 2012 NCAA Women's basketball champions Baylor University Bears in the East Room at the White House in Washington, Wednesday, July 18, 2012. (AP Photo/Charles Dharapak) U.S. President Barack Obama (L) fist bumps with supporters after delivering remarks during a campaign event at Truckee Meadows Community College in Reno, Nevada, August 21, 2012. (Photo by JIM WATSON/AFP/GettyImages) President Barack Obama pounds fists with a supporter after speaking at a campaign event at The Memorial Athletic and Convocation Center at Kent State University Wednesday, Sept. 26, 2012, in Kent, Ohio. (AP Photo/Tony Dejak) U.S. President Barack Obama fist-bumps with a woman during a lunch visit to the West Tampa Sandwich Shop and Restaurant in Tampa, Florida, September 8, 2012, during the first day of a 2-day bus tour across Florida. (Photo by SAUL LOEB/AFP/GettyImages) U.S. President Barack Obama (L) fist bumps a supporter after speaking at a campaign rally in Nashua, New Hampshire, on October 27, 2012. (Photo by JIM WATSON/AFP/Getty Images)  Share", "external_links": [], "published": "2015-05-19T06:02:00.000+03:00", "crawled": "2015-05-19T08:39:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}