{"organizations": [], "uuid": "83d3c32d6349b7fda45eff3c42ab5a2907e53d51", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/072513/0/0/072513_fff_detroitruling_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/29/why-obama-doesnt-dare-speak-about-detroit.html", "country": "", "title": "Why Obama doesn't dare speak about Detroit | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Why Obama doesn't dare speak about Detroit | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "83d3c32d6349b7fda45eff3c42ab5a2907e53d51"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/29/why-obama-doesnt-dare-speak-about-detroit.html", "ord_in_thread": 0, "title": "Why Obama doesn't dare speak about Detroit | Fox News", "locations": ["Detroit"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Doom in Detroit \nYet President Obama keeps saying that he wants to tax the wealthy and businesses much more across the country to redistribute income to the middle class, the poor, and government. \nDetroit tried that (with most of the money going down the government spending rat hole instead of to its citizens). \n[pullquote] \nDetroit stands as an extreme example of how an Obama tax system of “spreading the wealth” (actually, confiscating it) inevitably means that since there is not enough rich and business people’s money to create a utopia of income equality -- government must inevitably tax middle income people, too. \nWorse, most of the money ends up in government’s coffers where it gets misspent and siphoned to special interests—instead of in the pockets of citizens whose spending and investing stimulates economic and job growth. \nHere's how that works: Insure that unions and government workers get generous pension, health and other benefit packages that government can’t fund, long-term, in exchange for their votes and political activism. \nAccording to the Cato Institute’s Michael Tanner, “Fully 99.6% of [Detroit’s] retiree health-care liabilities are unfunded” and…“unfunded obligations account for $9.2 billion of Detroit’s $18 billion debt.” \nShortly before President Obama delivered his nearly 8,000-word “economic success” speech at Knox College in Galesburg, Illinois last week (without once mentioning the word “Detroit”) Moody’s downgraded the credit rating of Obama’s home city of Chicago, Illinois by three notches. This was largely because Moody’s calculated Chicago’s unfunded liabilities at $36-billion—nearly double of what the Windy City reported. \nLooking at other cities across the country, Moody’s estimates that cities are using accounting gimmicks to disguise their true unfunded government pension liabilities, which Moody’s says are three times as bad as those cities are reporting. But if President Obama would dare to talk about this in Detroit (or in Chicago, for that matter), he would alienate unions and government workers who are among his biggest backers. \nInstead, government officials strive to sell the power of big government to be the savior when it comes to major economic and social problems. \nDetroit’s mayors over the past 30 years tried various forms of government intervention to invigorate the city but clearly that failed. As Steve Malanga recently wrote in The Wall Street Journal, as early as the 1970’s, when Coleman Young was Detroit’s mayor, “the increasingly distressed city became a fiscal ward of the state and federal governments…by the late 1970s federal grants paid the salaries of up to one-third of Detroit's workforce.” \nAs Detroit continued to demonstrate over the years, government bailouts only forestall problems that only responsible individuals must solve. \nMr. Obama did dare to speak of his economic vision in Detroit, in 2007, just a few months after he declared his first bid for the presidency. \nAt the Detroit Economic Club, Obama said, “I believe in America's great cities. I believe in America's great Midwestern cities. We have not had an urban agenda over the last six years. We need to restore an urban agenda.” \nHe cited as his top priorities: education, “innovative ways that the federal government can spark economic development,” and then touched on the topics of affordable housing and jobs. \nObama added that, “Obviously, the marketplace is the best engine of job growth.” \nIn the six years since Obama spoke those words—and six months into his second term as president—President Obama is still campaigning as if big government can fix major economic and social problems in all the areas he cited as his priorities when he spoke at the Detroit Economic Club. \nBut the Obama administration’s role in bailing out Detroit’s auto industry didn’t “save Detroit”—certainly not the city. \nWhile Obama pushes for even more big government taxing and spending, here’s what we see: \n- Failed schools, especially in the minority neighborhoods of big cities. \n- Real GDP growth that is limping along at barely over one percent. \n- When it comes to affordable housing and job growth, Obama is long on claiming credit and short on producing results. \nWhile the Obama playbook continues to play out in Detroit and elsewhere, the president continues to speak as if he and his administration are on the right track. \nIf the president ever does dare to speak in Detroit, expect from him what he accuses his critics of: “an endless parade of distractions, political posturing and phony scandals.” \nCommunications consultant Jon Kraushar is at www.jonkraushar.net . He is a consultant to corporate and political leaders including Steve Forbes. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:16:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}