{"organizations": ["Fox News"], "uuid": "300c29469c80ddbe8cde440ac7c73e9a1880e2b1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/10/10/is-obama-locked-in-victim-mentality/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422644634900.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/10/is-obama-locked-in-victim-mentality.html", "country": "", "title": "Is Obama locked in a victim mentality? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Is Obama locked in a victim mentality? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "300c29469c80ddbe8cde440ac7c73e9a1880e2b1"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/10/is-obama-locked-in-victim-mentality.html", "ord_in_thread": 0, "title": "Is Obama locked in a victim mentality? | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Shutdown extension ahead? \nSeeing Barack Obama as someone who has a victim mentality would explain a lot. That mentality relies on believing one has been harmed, that one was not responsible for the injuries that occurred, that one could not have prevented what happened and that the person’s suffering makes that person morally right and deserving of sympathy. \nAs a young boy, Obama was, indeed, helpless. \nHe was helpless to stop his father from abandoning him. \nHe was helpless to stop his mother from leaving him with his grandparents. \nHe was helpless to stop his white grandmother and caretaker from communicating to him her fears of black people. \nI’m not sure the president ever got over it. \nThe president’s victim mentality could contribute to dissolving the will of countless Americans who might otherwise see themselves as capable of summoning internal resolve and creativity to surge out of poverty. \nTrue victims can’t surge out of anything, because they are hostage to forces outside their control. They await justice and restitution. \nThey don’t, ultimately, see themselves as able to stamp out poverty; they see themselves as the rightful recipients of food stamps. \nThey don’t, ultimately, see themselves as able to take control of their health; they see themselves as the rightful recipients of free health insurance. \nThey don’t, ultimately, see themselves as someone worth hiring and worthy of investing themselves with education and training; they see themselves as worthy of 99 weeks of unemployment checks. \nAnd the president’s victim mentality could have already gone global. \nThe apology tour that the president embarked upon after being elected to his first term in office, apologizing for America’s supposed predatory behavior toward others, turned his victim mentality viral -- offering a pandemic of helplessness to anyone who wanted to claim that the ills of its nation were due to a monstrous pathogen called the United States of America. \nA victim mentality would explain why the president immediately allies with anyone else he thinks might be a victim, too. \nThis explains the seemingly bizarre statements he made castigating local police in Cambridge, Massachusetts for detaining a distinguished Harvard professor and man of color who they understandably considered possibly to be an intruder. \nIt explains him thinking that if he had a son that his son would look and act just like Trayvon Martin, an alleged drug user and burglar who was shot and killed by George Zimmerman, an older man of a different race. \nIn fact, the president went further to suggest that, were he 35-years younger, he could be Treyvon Martin. \nIf the president sees himself as a 17-year-old being held at gunpoint by an older man, then it is too much to expect him to govern effectively. \nIf he sees himself as having been taken hostage by kidnappers who want to blow him up, it is too much to expect him to hear any truths these “kidnappers” might want to share. \nVictims aren’t expected to lead. They expect to be rescued. \nThat would seem to be our problem as a nation right now. \nDr. Keith Ablow is a psychiatrist and member of the Fox News Medical A-Team. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:11:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}