{"organizations": [], "uuid": "01c8b1e2e920bd54c7411646d5d7b20cf486bb6e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_may_26_0.jpg", "site_section": "http://thehill.com/taxonomy/term/25213/feed", "section_title": "The Hill: Technology Video", "url": "http://thehill.com/policy/national-security/243097-obama-turns-up-patriot-act-pressure-this-needs-to-get-done", "country": "US", "title": "Obama turns up Patriot Act pressure: 'This needs to get done'", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama turns up Patriot Act pressure: 'This needs to get done'", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T19:52:00.000+03:00", "replies_count": 0, "uuid": "01c8b1e2e920bd54c7411646d5d7b20cf486bb6e"}, "author": "dweaver@thehill.com (Jordan Fabian)", "url": "http://thehill.com/policy/national-security/243097-obama-turns-up-patriot-act-pressure-this-needs-to-get-done", "ord_in_thread": 0, "title": "Obama turns up Patriot Act pressure: 'This needs to get done'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama turns up Patriot Act pressure: 'This needs to get done' By Jordan Fabian - 05/26/15 12:52 PM EDT \nPresident Obama on Tuesday slammed the Senate for failing to extend key provisions of the Patriot Act that are set to expire on June 1. \nSpeaking to reporters in the Oval Office, Obama called for the Senate to “work through” the Memorial Day recess to find a solution for renewing government surveillance powers that were passed in the aftermath of 9/11. ADVERTISEMENT “This needs to get done,” Obama said during an Oval Office meeting with NATO Secretary-General Jens Stoltenberg.\nObama said the Senate should take another look at the House-passed USA Freedom Act, which would renew portions of the Patriot Act while placing new limits on the National Security Agency’s (NSA) bulk collection of phone records. \n\"The House of Representatives did its work and came up with what they’ve called the USA Freedom Act, which strikes an appropriate balance; our intelligence communities are confident that they can work with the authorities that are provided in that act; it passed on a bipartisan basis and overwhelmingly. It was then sent to the Senate. The Senate did not act,\" Obama said. \n\"And the problem we have now is that those authorities run out at midnight on Sunday. So I strongly urge the Senate to work through this recess and make sure that they identify a way to get this done.\" \nThe Senate tried and failed to approve the USA Freedom Act in a vote early Saturday morning, leaving lawmakers at an impasse ahead of the deadline. \nBoth the House and Senate are away from Washington, though Senate Majority Leader Mitch McConnell (R-Ky.) has vowed to call his chamber back for a rare Sunday session to try to find a path forward. \nIn the meantime, the White House has begun to wind down the NSA program while repeatedly warning that letting the surveillance powers lapse would threaten national security. \nObama on Tuesday noted that the expiring portions of the Patriot Act include other powers that are used by the FBI and law enforcement officials to conduct terrorism investigations. \n“You have a whole range of authorities that are also embodied in the Patriot Act that are non-controversial, that everybody agrees are necessary to keep us safe and secure. Those also are at risk of lapsing. So this needs to get done,\" the president said. \nFBI Director James Comey last week warned that the debate over NSA surveillance was overshadowing other authorities set to expire. He noted that Section 215 of the Patriot Act — which the NSA has relied on to operate its bulk phone records collection program — also allows the FBI to collect records from hotels, rental car companies and libraries. \n“If we lose that authority — which I don’t think is controversial with folks — that is a big problem,” he said. With quick action in Congress increasingly unlikely, the administration is considering asking for a court order to extend some of the Patriot Act programs, such as court-approved roving wiretaps and increased surveillance of people who pose potential lone-wolf terror threats, according to The Wall Street Journal. \nWhite House press secretary Josh Earnest on Tuesday shot down extending the Patriot Act authorities through executive action, saying the “powers can only be renewed by Congress.\"The USA Freedom Act, which passed the House on a 338-88 vote, would end the NSA’s collection of phone metadata while requiring the agency to obtain a court order to gather data and store records with phone companies. \nThe bill came three votes short of passing the Senate on Saturday. Legislation that would have temporarily renewed the surveillance programs also came up short. \nMcConnell had been pushing for a “clean” extension of the Patriot Act — without any changes. \nHe argues that changes to the NSA phone records program would weaken the government’s ability to identify terrorist threats. \nObama said the Senate needs to \"work through whatever issues\" are standing in the way of a legislative fix. \n\"Make sure we don’t have on midnight Sunday night, this task still undone, because it’s necessary to keep the American people safe and secure,\" Obama said. \n— This story was updated at 1:18 p.m.", "external_links": [], "published": "2015-05-26T19:52:00.000+03:00", "crawled": "2015-05-26T21:00:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}