{"organizations": ["Fox News Top IRS", "IRS"], "uuid": "6a4a4c0284935c5d5570de9376c317181b02ca54", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/052213/0/0/052213_lerner_statement_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/22/chicago-style-politics-on-full-display-in-irs-and-other-obama-scandals.html", "country": "", "title": "Chicago-style politics on full display in IRS and other Obama scandals | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Chicago-style politics on full display in IRS and other Obama scandals | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "6a4a4c0284935c5d5570de9376c317181b02ca54"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/22/chicago-style-politics-on-full-display-in-irs-and-other-obama-scandals.html", "ord_in_thread": 0, "title": "Chicago-style politics on full display in IRS and other Obama scandals | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Top IRS Official Pleads The Fifth \nHowever, the union solicits contributions from members to campaign against the Tea Party, and AFI-CIO affiliated unions educate their members that Republicans and conservatives groups are the enemies of progress. \nIn that kind of an environment is it any surprise that card carrying union members at the IRS thought it was just fine to target advocates of limited government? \nHardly! \nThat’s union politics. But the president doesn’t have to encourage it beyond what his responsibilities as chief executive require, yet he does. In 2009, the president signed an executive order to allow the union to have pre-decisional involvement in all IRS workplace matters. \nNow the president acts with such great surprise that workers paying dues and making political contributions to an organization that targets the Tea Party and conservative groups are harassing the same in their work. \nThe president is not uninformed or incompetent—he is cynical and corrupt. \nWe did not know that he was so lacking in moral fiber and self restraint when we elected him, because as a senator both in Illinois and Washington, he spent most of his time running for higher office—we never observed him exercising discretion and dealing with tough choices as a legislator or executive. \nHaving chosen him in haste, the nation can repent at its leisure. He won’t be impeached and convicted, but I expect that he will continue to abuse his powers. And he sets the tone for his administration. He didn’t have to tell Attorney General Holder to pursue sweeping subpoenas of the Associated Press or name a Fox News correspondent as a conspirator in investigations of leaks—actions that will intimidate a free press. Or for the Secretary for Health and Human Services to shake down private executives for “donations” to non-profits led by former Obama administration officials. Or for the Secretary of State to cover up the ineptitude that led to the death of a U.S. ambassador and several diplomats at the hands of terrorists in Libya. It’s just how they do business in Chicago, and now sadly in the nation’s capital. All with a wink, a smile and a denial from the president of the United States. \nPeter Morici served as Chief Economist at the U.S. International Trade Commission from 1993 to 1995. He is an economist and professor at the Smith School of Business, University of Maryland, and a widely published columnist. He is the five time winner of the MarketWatch best forecaster award. Follow him on Twitter @PMorici1 . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:19:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}