{"organizations": [], "uuid": "005b56443da8b608f808d64eeb0c64e9d1909add", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/assets/0/0/clintonhillinternal.jpg", "site_section": "http://feeds.latino.foxnews.com/home/feed", "section_title": "FOX News", "url": "http://latino.foxnews.com/latino/politics/2015/05/08/hillary-clinton-says-shed-go-further-than-obama-on-immigration-wh-doubts-it/", "country": "IL", "title": "White House casts doubt on Hillary Clinton's immigration pledge", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "White House casts doubt on Hillary Clinton's immigration pledge", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T15:15:00.000+03:00", "replies_count": 0, "uuid": "005b56443da8b608f808d64eeb0c64e9d1909add"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/08/hillary-clinton-says-shed-go-further-than-obama-on-immigration-wh-doubts-it/", "ord_in_thread": 0, "title": "White House casts doubt on Hillary Clinton's immigration pledge", "locations": ["New York"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Hillary Rodham Clinton", "Matthews"], "text": "White House casts doubt on Hillary Clinton's immigration pledge Published May 08, 2015 Fox News Latino :Nov. 21, 2014, file photo, Hillary Rodham Clinton is seen in New York. AP Photo/Bebeto Matthews, File \nIn a campaign stop in Nevada this week, Hillary Clinton went beyond pledging to protect President Barack Obama’s controversial executive action on immigration and vowed to do more on behalf of those who are here illegally. \nOn Tuesday, Clinton said: \"I will fight for comprehensive immigration reform and a path to citizenship for you and for families across our country. I will fight to stop partisan attacks on the executive actions that would put Dreamers ... at risk of deportation.\" \n\"If Congress refuses to act, as president I will do everything possible under the law to go even further,” she said. \nBut the very next day, White House Press Secretary Josh Earnest cast some doubt on Clinton’s promise, saying that Obama went as far as the law would allow him to when he established an initiative suspending deportation for three years for undocumented immigrants brought as minors, and allowing them to obtain work permits and federal benefits. \nAlthough Earnest urged reporters on Wednesday to go to Clinton’s campaign staff with questions about her vow on immigration, several media outlets quoted the White House spokesman as saying: “The president was determined to use as much authority as he could” when he announced his executive actions in November. \nObama said then that he had consulted with the Office of Legal Counsel to make sure that the various forms of relief he wanted to extend to undocumented immigrants – both younger one and older ones who had children who are U.S. citizens or legal permanent residents – were all legally and constitutionally defensible. \nMany of his Republican critics, however, have accused the president of making an end-run around Congress and acting unilaterally. \nObama said he was forced to take such executive action after Congress repeatedly failed to pass a comprehensive immigration reform bill. \nHe had to scrap a part – extending deportation relief to undocumented parents of the undocumented immigrants given relief – he'd reportedly planned to include in the order after legal advisers told him it would be hard to defend in court. \nNow, much of his 2014 executive action is on hold while the 5th U.S. Circuit Court of Appeals considers a request from the U.S. Department of Justice to reverse a Texas judge's decision temporarily blocking Obama's order. Oral arguments are scheduled for the week of July 6. \nThe Associated Press contributed to this report. \nLike us on Facebook", "external_links": [], "published": "2015-05-08T15:15:00.000+03:00", "crawled": "2015-05-08T15:09:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}