{"organizations": [], "uuid": "dc034f2913ed9aabf537fe66bcbe92b9388f18fd", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2785486/images/o-ABORTION-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/parents-pregnancy/feed", "section_title": "Parents Pregnancy on Huffington Post", "url": "http://www.huffingtonpost.com/anna-spargoryan/the-only-person-who-judges-me-for-my-abortion-is-me_b_7266286.html", "country": "US", "title": "Anna Spargo-Ryan: The Only Person Who Judges Me For My Abortion -- Who Matters  -- Is Me", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Anna Spargo-Ryan: The Only Person Who Judges Me For My Abortion -- Who Matters  -- Is Me", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T15:15:00.000+03:00", "replies_count": 0, "uuid": "dc034f2913ed9aabf537fe66bcbe92b9388f18fd"}, "author": "Anna Spargo-Ryan", "url": "http://www.huffingtonpost.com/anna-spargoryan/the-only-person-who-judges-me-for-my-abortion-is-me_b_7266286.html", "ord_in_thread": 0, "title": "Anna Spargo-Ryan: The Only Person Who Judges Me For My Abortion -- Who Matters  -- Is Me", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nI have a recurring dream wherein I am staring into a mirror and shouting at myself. \nI have run the gamut of pregnancy experiences: children, miscarriage and abortion. Having children and miscarriages and saying \"those things were really hard\" is completely acceptable. They are hard. Childbirth is hard, parenting is hard, losing a baby is hard -- they are physically and emotionally devastating in their various ways. \nOn the other hand, it seems we are allowed to speak about abortions in one of two ways: our insurmountable regret, or our complete lack of doubt. \nI have spent the past six years tormenting myself for being in this in-between place of, \"I'm sad about my abortion. I don't think I was powerful and in control. But I don't regret it either.\" \nI had my children young. I am like newly mulched earth and could get pregnant alone in a field. I already want to justify this to you, to tell you that we were using birth control. This is me: I'm a woman who has been pregnant by accident four times, one time after using a condom and taking the morning after pill when I realized I was about to ovulate. But it doesn't matter. I know that about myself. \nI should have been more careful -- more and more and more layers of careful. \nWhen I found out I was pregnant with my first daughter, I was 19 and living with a guy I had known for three months. I had been working in a new job for six weeks. \nThat would have been the time to have an abortion, right? \nI could have gone down the road and had a little sleep and it would have been over. I didn't -- and I'm glad, of course, because I love my daughter (now 11) very much, obviously -- but there begins my compounded and fraught relationship with my reproductive system. \nI was so angry with it, for a while. I went through puberty when I was 10. No one had explained to me yet what a period was, but I had a little pack from DOLLY magazine with a pad and a tampon and a brochure. \nI kept hoping it would go away. I peeked into my undies at recess and lunch and cried when the smear of blood had grown. None of the other girls in my class had theirs yet. We went on school camp and they went through my toiletries bag and teased me about bringing pads with me. I didn't understand my body and I was so mad with it. \nI told my boyfriend, who was 20 at the time, that I was pregnant, and he didn't speak to me for three days. We hung in the house like old coats, silent and loose. I had been a person in the world, and now I was two people in the world. \nI went to the doctor and he said, \"Do you want a referral to a clinic?\" \nI told my mother and she said, \"Are you going to fix it?\" \nIt didn't occur to me for one minute to have an abortion, then, when I was 19 and barely knew my co-conspirator. \nSometimes I look at the photos of me in the hospital with my newborn daughter. She is perfect. She has a little round head and tiny fists and she is frowning and pursing her lips. And I'm there, in green sheep pyjamas, holding this porcelain doll, and I am a child. A confused, tired, child. \nI have had children my whole adult life. I'm 32 years old now and I have never been able to just try to figure out what I'm doing without considering another person. I've been a mother since before I knew how to be a human. \nSo, because I am terrible, I repeated all my same mistakes. I had known my new boyfriend for three months, and I had been in my new job for six weeks. \nAnd then, I was pregnant. \nI have irregular cycles and I ovulated early, which is not an excuse but we were using condoms and it should have been fine. \nIt should have been fine . \nIt doesn't even matter that it should have been fine, because it wasn't, but it should have been. \nI looked at the children I already had but still didn't understand. They were still so new, and I was still so new, and the collection of cells I had been harvesting were so, so new and I just couldn't keep compounding the newness of everything before I had managed to figure out how to do any of it. I couldn't perpetuate the cycle I had somehow broken into. And I absolutely couldn't rationalize trying to love another child before I'd figured out how to love the ones I already had. \nSo I had an abortion. \nIt was horrible. Not because there were picketers -- there weren't. Or because it was painful -- it wasn't. But because I was just so sad. It was an obvious decision and also not at all obvious. I would have wanted to love my child as much as I had ever loved anyone, but I wasn't sure I would have been able to. \nI had no money, no family support and was effectively squatting in my marital home because I couldn't afford to leave. Everything was terrible. Having an abortion became part of the mix of terrible. When I think about that time, I can't feel my body. \nI read a quote this morning in a piece about Nicki Minaj's abortion: \nI don't feel these things. I don't feel like I can't write about my experience, or that I need to write about it in order to validate my experience. My experience was valid. The people who care about me are supportive of the decisions I made. They were the right decisions. Those people believe in me. \nNo one who loves me is critical of the decisions I made then. They don't say to me, \"Anna, I still can't believe you did that to your unborn child.\" They don't say, \"Wow, you made some really bad decisions.\" The only person who does that is me. The only person who stands in front of a mirror and screams into it is me. \nThe person who needs to forgive me is me . \nThere is a grief process associated with abortion. For most people, there is a period of sadness and relief together. For some, there is just relief. For others, there is regret, or remorse. Sometimes it's short, and sometimes it isn't. \nAt the beginning of my book there's a dedication. It's not to my partner, or my kids, or my parents, or myself. It's the only way I know how to forgive myself -- to create something permanent (or with at least one print run) that gives some meaning to the experience I had, without dismissing it or dismissing my perpetually correct decision. It says: \nFor the person I knew infinitely, and momentarily. \nA version of this post originally appeared on Medium . \nFollow Anna Spargo-Ryan on Twitter: www.twitter.com/annaspargoryan More:", "external_links": [], "published": "2015-05-12T15:15:00.000+03:00", "crawled": "2015-05-12T19:31:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}