{"organizations": ["IRS", "Fox News Reaction", "Inc."], "uuid": "a66ce478bd8ecd73ee6bc109a7f3c2f0cb9e64e4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/051613/0/0/reporter_emanuel_051613.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/17/obama-is-failing-as-ceo-america-inc.html", "country": "", "title": "Obama is failing as CEO of America, Inc. | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama is failing as CEO of America, Inc. | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "a66ce478bd8ecd73ee6bc109a7f3c2f0cb9e64e4"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/17/obama-is-failing-as-ceo-america-inc.html", "ord_in_thread": 0, "title": "Obama is failing as CEO of America, Inc. | Fox News", "locations": ["America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Reaction to Obama's answers on IRS scandal \nCabinet secretaries and agency heads took their cues from the boss – at State, Justice and the IRS senior management would have had us believe they were unaware of what was happening in Benghazi, with the Associated Press, or at the Cincinnati Office of the IRS. And the president only learns about many problems when reported in the news? \nMr. Obama simply has been too busy giving speeches, raising money, and trying to turn every event to political advantage to keep tabs on his managers, as any good CEOs would do. \nCEOs periodically meet with their principal managers – in groups and where necessary individually – to probe their tactics, offer assistance from their own wealth of experience, and discern areas where managers may be planting problems that will burgeon into crisis. \nFailing at this, the president has managed to continence management failures that cost the lives of Americans abroad, weaken our national security, rock public confidence in government, and threaten our constitutionally guaranteed liberties. \nMr. Obama has a lot in common with one predecessor, Jimmy Carter – both failed as CEOs. The man from Plains is a decent and ethical man but micromanaged too much, whereas Mr. Obama acquired his moral compass in the Windy City and simply can’t manage at all. \nAmericans should not be surprised. Mr. Obama came to Washington with profound campaign skills but virtually no record as a legislator or manager. He spent seven years in the Illinois Senate as a virtual non-participant, bored and seeking higher office, and his four years in the U.S. Senate running for president. \nAmericans turned to him, because they were justifiably disappointed with President Bush and tagged John McCain with the blame. \nPrior to his presidency, Americans never observed Mr. Obama running anything, other than a campaign. He had not been a governor or a congressional committee chair. In military terms, we made him a five star general before even serving as a lieutenant. \nBy his own actions, he is arrogantly ambitions but sadly incompetent. He has corrupted the foundations of our Republic, and for that he gets a failing grade. \nPeter Morici served as Chief Economist at the U.S. International Trade Commission from 1993 to 1995. He is an economist and professor at the Smith School of Business, University of Maryland, and a widely published columnist. He is the five time winner of the MarketWatch best forecaster award. Follow him on Twitter @PMorici1 . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:19:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}