{"organizations": ["University of Central Missouri", "Fox News Facebook", "Twitter"], "uuid": "170986fba703e670798a25392b44c8bfdc7aff44", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/07/29/mr-obama-here-how-to-really-boost-incomes-and-fight-inequality/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422594269681.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/29/mr-obama-here-how-to-really-boost-incomes-and-fight-inequality.html", "country": "", "title": "Mr. Obama, here's how to really boost incomes and fight inequality | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mr. Obama, here's how to really boost incomes and fight inequality | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "170986fba703e670798a25392b44c8bfdc7aff44"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/29/mr-obama-here-how-to-really-boost-incomes-and-fight-inequality.html", "ord_in_thread": 0, "title": "Mr. Obama, here's how to really boost incomes and fight inequality | Fox News", "locations": ["Warrensburg", "Mo."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print July 24, 2013: President Barack Obama speaks about the economy, at the University of Central Missouri in Warrensburg, Mo. (AP) \nSlow growth and increasing inequality are ripping the social fabric of America—vanquishing the dreams of working families, saddling the young with onerous student debt and frustrating retirement plans. President Obama is stirring passions proposing government initiatives he hopes will stifle House Republican efforts to curb federal spending, but those can only end in tears. Early in his first term, he pushed through more than $4 trillion in deficit spending on stimulus, broader Medicaid benefits, alternative energy projects and other industrial policies. Through last fall, growth was an anemic 2.1 percent and has since slowed by half. \n[pullquote] \nHe blames sequestration, which subtracted about $45 billion from government spending. However, his rhetoric ignores $200 billion in higher taxes he demanded from Congress in January, and the doubling of the trade deficit on oil and with China to $540 billion since the recovery began. \nSequestration will remove about 1 million jobs, while higher taxes and the trade deficit will cost Americans more than 10 times as many. \nInstead of forcefully confronting Chinese for cheating on trade in ways recommended by liberal and conservative economists alike, Obama merely pleads with Beijing. The Middle Kingdom responds with criminal activity—pirated commercial technology costs U.S. companies at least $300 billion a year and American workers about 5 million jobs. Oil and gas production is up on private and state lands in South Dakota and elsewhere, but the president keeps drilling locked down on federally-controlled reserves off the Atlantic and Pacific Coasts, and in the Eastern Gulf and Alaska. Oil imports could be eliminated, but instead the president promotes alternative energy projects—similar to Solyndra—that enrich his political friends. Government subsidized electric cars are a bust, whereas private investments in more fuel-efficient internal combustion engines and hybrids are delivering big gains. Ford—which received no bailout money—is rolling out one eye-popping high MPG model after another. ObamaCare mandates are driving up health care costs for large businesses on full time employees. No surprise, since January 833,000 more Americans have reported working part-time, while 97,000 fewer have full-time positions. Income inequality is getting worse. The pay of ordinary workers is stagnating, while CEO compensation at large companies increased 16 percent last year. Top executives have accomplished a compensation cartel by serving on each other’s boards of directors and tying up votes in shareholder elections through proxies. They vote one another outlandish salaries and block accountability to investors. The Justice Department is charged with protecting Americans against such anti-competitive behavior but is too busy intimidating reporters, slow-walking investigations of IRS abuses and harassing Texas election officials for discriminatory conduct that has been dead 50 years. Wall Street’s big banks have exploited Dodd-Frank to scarf up smaller banks that cannot cope with the avalanche of new regulations, and thereby monopolized the CD market in many cities. Even as mortgage rates have risen, the elderly are not being offered decent returns that once helped finance their retirements. Increasingly, they work in grocery stores and wait on tables, competing down the wages of the younger working poor. Don’t look for the Justice Department to investigate CD rate rigging. Democrats raise too much campaign money on Wall Street for Attorney General Holder to take an interest. A roll-back of recent tax increases, tough responses to Chinese cheating on trade and theft of intellectual property, developing more domestic oil, scrapping ObamaCare, and a Justice Department that investigates monopoly behavior that hurts ordinary Americans would raise incomes and combat inequality. The last thing American families need is more of the same failed Obama policies. \nPeter Morici served as Chief Economist at the U.S. International Trade Commission from 1993 to 1995. He is an economist and professor at the Smith School of Business, University of Maryland, and a widely published columnist. He is the five time winner of the MarketWatch best forecaster award. Follow him on Twitter @PMorici1 . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:16:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}