{"organizations": ["Obama Getty", "Google Maps", "Google"], "uuid": "1a9039a1cf136eb7fb38ead6fa341fdb9a78cf18", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/google_012110getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/technology/242938-google-maps-changes-algorithm-to-battle-racist-slurs-targeting-obama", "country": "", "title": "Google Maps changes algorithm to battle racist slurs targeting Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Google Maps changes algorithm to battle racist slurs targeting Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "1a9039a1cf136eb7fb38ead6fa341fdb9a78cf18"}, "author": "", "url": "http://thehill.com/policy/technology/242938-google-maps-changes-algorithm-to-battle-racist-slurs-targeting-obama", "ord_in_thread": 0, "title": "Google Maps changes algorithm to battle racist slurs targeting Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David McCabe", "Obama"], "text": "Google Maps changes algorithm to battle racist slurs targeting Obama Getty Images By David McCabe - 05/22/15 11:55 AM EDT \nGoogle says it has made changes to its Google Maps program so users are no longer directed to the White House, when they search for terms containing racial slurs. \nIn a blog post on Thursday, a Google executive said Maps users saw the White House, when they searched for certain phrases involving the N-word because of a problem with the way Maps takes chatter from around the Web and uses it to match places to search terms. ADVERTISEMENT “Building upon a key algorithmic change we developed for Google Search, we’ve started to update our ranking system to address the majority of these searches — this will gradually roll out globally and we’ll continue to refine our systems over time,” said Jen Fitzpatrick, a vice president of engineering and product management.\n“Simply put, you shouldn’t see these kinds of results in Google Maps, and we’re taking steps to make sure you don't,” she said. \n“Certain offensive search terms were triggering unexpected maps results, typically because people had used the offensive term in online discussions of the place,” Fitzpatrick explained. “This surfaced inappropriate results that users likely weren’t looking for.” \nThis week, The Huffington Post and The Washington Post both noted instances in which searching for phrases involving the N-word showed Maps users the White House. It quickly became clear that other searches involving racial slurs led to nongovernmental institutions, like historically black college Howard University. \nGoogle quickly promised to investigate and address the issue, and it appeared on Friday morning that the company had begun to eliminate the problems. \nSearches for two of the racist phrases — “n house” and “n king” — by two Hill reporters using different computers yielded a message that indicated no results could be found. The same was true of the phrase “f--- n ,” which The Washington Post reported had been leading users to the U.S. Capitol. \nBut even though it appears that some of the search terms might have been eliminated from Google Maps, other racist searches still yielded troubling results. The Washington Post was the first to note on Thursday that if a user searched for “c--n house” in Maps, it lead them to the White House. That was still true on Friday morning. \nGoogle has also struggled recently with what is essentially online vandalism in Maps. For some time, users have been able to edit maps using a program called Map Maker, which has been occasionally misused. \nSometimes the results have been humorous. In April, it was discovered that someone had placed a marker for “Edwards Snow Den” — a reference to NSA leaker Edward Snowden — on the executive mansion. Tags: ", "external_links": [], "published": "2015-05-22T03:00:00.000+03:00", "crawled": "2015-05-22T21:27:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}