{"organizations": ["White House"], "uuid": "0d70474d10d83ba294f3ccbe4219b37675d890a9", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150518171042-latino-economy-620xa.png", "site_section": "http://rss.cnn.com/rss/money_latest.rss", "section_title": "Latest financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/05/19/news/economy/latino-voters-2016-economy-immigration/index.html", "country": "US", "title": "What Latinos voters care about more than immigration", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "What Latinos voters care about more than immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T15:02:00.000+03:00", "replies_count": 0, "uuid": "0d70474d10d83ba294f3ccbe4219b37675d890a9"}, "author": "", "url": "http://money.cnn.com/2015/05/19/news/economy/latino-voters-2016-economy-immigration/index.html", "ord_in_thread": 0, "title": "What Latinos voters care about more than immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Patrick Gillespie"], "text": "By Patrick Gillespie @Pat_Gillespie Winning the White House in 2016 could very well hinge on which candidate connects the best with Latinos. \nOver 11 million Latinos voted in the last presidential election. Their numbers have only grown since, especially in key battleground states such as Colorado, Florida, Virginia and Arizona. Just last week, Hillary Clinton hired a spokesperson specifically to handle Hispanic issues. \nImmigration remains a litmus test issue, but the top concerns of Latino voters are the economy and education, according to Pew Research Center. \nIt's clear why economics matters: Latinos lost the most wealth during the recession of any race in America. They work many low-wage jobs, yet they are also becoming an engine of small business growth in the U.S. The majority of Hispanic workers are now U.S.-born citizens, not immigrants crossing the border. \nThe policies presidential candidates take toward the Latino economy could hold huge weight over who becomes the next Commander-in-Chief. President Obama won 71% of the Latino vote in 2012, helping him defeat Mitt Romney. \nHere's a look at the Latino economy. \nRelated: Beware the annual Cinco de Mayo #FAIL \n1. Latinos lost the most during the recession: Hispanic households lost 66% of their net worth between 2005 and 2009, according to Pew. For many Hispanics, their wealth came from their homes, and they tend to live in areas that were hardest hit during the housing crash. \nIn 2007, median Hispanic household wealth was $23,600. It dropped to $13,700 -- about $10,000 less -- by 2013. By comparison, the net worth of white households was over $140,000 in 2013. \nRebuilding that wealth is a key issue for Hispanics in the U.S., experts say. \n\"The recession really impacted Hispanic's wealth more than it did to anyone else and it hasn't quite recovered,\" says Mark Lopez, director of Pew's Hispanic research. \nRelated: China's big chess move against the U.S.: Latin America \n2. Latinos want better paying jobs: The U.S. Hispanic workforce has surged over the past two decades, surpassing the size of the black workforce. Latino unemployment is now 6.9% -- well above the national average of 5.5%, although below that of black Americans . \nMany Latinos, particularly women, face a job quality issue. Half of all Latino jobs are concentrated in just four areas: retail, restaurants, construction and business services, Pew reports. Retail and restaurants tend to have low-wage positions, and there's a million fewer construction jobs today than in May 2008. \nHispanic women are bearing the brunt of bad wages. They work more minimum wage jobs than any other demographic. \nAbout 5.7% of Latina women who earn an hourly wage make the minimum wage or less -- more than anyone else -- according to U.S. Census data. Experts say a lack of educational opportunities for Hispanic women, combined with family obligations, helps explain their high numbers in low wage jobs. \nMinimum wage laws are a major topic of debate nationwide. It could be a key economic issue for the candidates to address, along with small business growth. \nRelated: How Colombia went from murder capital to tech powerhouse \n3. Latino businesses are growing : Hispanic-owned businesses have grown by 43% to 3.2 million since President Obama started his run for office in 2007. That's the most of any demographic and double the national average for small business growth, according to Geoscape, a data analytics firm in south Florida and Census data. \nHispanic households with small business owners, whether self-employed or running a company, tend to make more money than the average Latino households. \nHow candidates appeal to small businesses could also influence the Latino vote, experts say. \n\"Economics matter to everyone, and certainly to Latinos,\" says Cesar Melgoza, CEO of Geoscape. Latinos' business growth \"is indicative of the nature of Hispanic businesses as an engine of growth in the U.S.\" \nRelated: Black unemployment finally falls below 10% \n4. Why education is key: Education was the second most important issue to Hispanics in the 2012 election (behind the economy). It's risen to No. 1 in some recent polls. \nIt makes sense: Latinos have the highest birth rate in America, 80 births per 1,000 women of childbearing age. That compares with 64 for blacks, 59 for whites and 56 for Asians. \nThe Hispanic population has increased by more than 50% since 2000, according to Pew. \nThat's a lot of people seeking a better education. Latinos who have the same education as whites -- such as a college degree -- are paid almost $200 less per week, according to Labor Department data. \nLike jobs, some Latinos arguably have a quality-of-education problem. Many earn degrees from community colleges, making it hard to compete against graduates from more elite universities, experts say. \n\"Continuing to have educational opportunities is something that's equally as important as jobs,\" says Domino Perez, director of the Center for Mexican American Studies at the University of Texas.", "external_links": [], "published": "2015-05-19T15:02:00.000+03:00", "crawled": "2015-05-19T15:25:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}