{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "f6eaf5d78abe305c08a0ef712ba7006b55aa4558", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/051313/0/0/051313_hn_obamadefense_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/15/president-obama-press-how-to-heal-dysfunctional-relationship.html", "country": "", "title": "President Obama & the press -- how to heal a dysfunctional relationship | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "President Obama & the press -- how to heal a dysfunctional relationship | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "f6eaf5d78abe305c08a0ef712ba7006b55aa4558"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/15/president-obama-press-how-to-heal-dysfunctional-relationship.html", "ord_in_thread": 0, "title": "President Obama & the press -- how to heal a dysfunctional relationship | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nBefore I went to work covering the White House as a journalist, I worked in the mental health field for 20 years. And yes, I think that what I learned in mental health gives me a good perspective as I now cover politics and policy. \nIn each field, interventions are often needed! And this White House is a case in point. \nRight now, for sure, the Obama administration is having plenty of problems: There’s the Benghazi talking points leak, the IRS revelations of looking at Tea Party groups, and, finally, the AP phone records being looked at by the Justice Department. Whew! \n[pullquote] \nEach of these is an important concern in its own right, but I see them as part of a pattern of communication dysfunction. If the president and his team could communicate better, they could govern better. \nI should say immediately that I voted for President Obama twice. So I am not coming at my criticisms and concerns from the ideological right. \nIndeed, I want to see Barack Obama succeed, just as I want to see the United States of America succeed. That’s why I hope for the much-needed intervention. \nThe key point here comes from my experience with “family systems theory.” \nFamily systems theory says that people behave in set patterns; those patterns can be mapped, and they are predicable. \nFamilies have clear messages and rules which are never articulated but are nevertheless understood by family members. \nAll families have boundaries. How they are formed or violated says much about the family system. \nFinally, those family rules are usually set by the heads of the families. \nThe White House press staff and the White House press corps can be thought of as a family system; they all must, like it or not, live under the same roof. And yes, the White House “family” has a head--that would be White House Press Secretary Jay Carney. \nTo put it bluntly, Carney and his team have put in place “rules” that guarantee that the White House will not be a happy family. \nThe first such “rule” is disregard for the press corps. Not everyone likes reporters, but they are human beings, and they have feelings. And yet Carney & Co. routinely keep the pressies waiting past published times for events. \nIn addition, in their decisions as to who gets to ask questions, they show a further contempt for the press corps. Perhaps most flagrantly, at least lately, on May 10th, Carney held a special “deep background” briefing on Benghazi held for certain selecct members of the White House Press corps--the rest of us were excluded. \nIf a family therapist would take the chronic lateness and the preference of certain members of the press who are allowed to have a voice it would be clear that the system is anything but open. It is what would call it a “closed” system, and that means trouble. \nYet as with any dysfunctional relationship, the pain has a way of feeding back to all family members. It’s not just the White House press corps that suffers, it’s also the White House press staff. \nHowever, the big loser is the president himself, and his policies. His messaging has been thrown off by what is being done in his name. \nIndeed, we can see how the dysfunctionality of the White House-White House press corps relationship has poisoned the whole of the administration’s policy efforts. Because, after all, policymakers, inside and outside of the White House, take their cues from the “head of household.” And that person, of course, is Jay Carney’s boss, the president of the United States. \nEven if the IRS folks were career staff or Bush era holdovers you do not need to be Dr. Freud to understand that the implicit message is that it is OK to limit what is said, to edit what is said or even to allow political thought and considerations to be a part of official actions. \nIt is well known that reporters have been given access or not depending on the kinds of stories that are written or broadcast. \nIf the message from the top is that signaling out groups (the IRS actions) or monitoring the press was unacceptable (the AP phone records) my guess is that this would not have happened. \nSeeing this this from a family systems perspective, we only need to look at the overall actions to determine what rules this system has been operating under. \nBoundaries have been violated. Gregory Hicks from the State Department testified before Congress last week that he was criticized for his management style only after he talked to a Member of Congress--before that he received nothing but compliments. That’s not a healthy signal to send. \nMoreover, the Associated Press’s phone records were taken by the Justice Department. The Benghazi talking points were rewritten and rewritten, seemingly with the goal of obscuring the truth. Indeed, we can see that Beth Jones, Assistant Secretary of State violated the boundaries of her job, so did the IRS, so did the Justice Department. \nThe system is crying out for help, for openness, for respect of boundaries and for new rules. \nThe president needs to show leadership, and he needs to start with better and more honest communication. That means answering all the press corps' questions, even from the smaller news outlets, even if the answers are in writing. It means not editing out what people want to say and acknowledging different viewpoints and perspectives. \nIt is the only way to heal this very dysfunctional system. I hope the president makes this much-needed intervention. \nEllen Ratner joined Fox News Channel as a contributor in October 1997. Currently, Ratner serves as chief political correspondent and news analyst for \"Talk Radio News Service\" where she analyzes events, reports breaking news, and provides lively interviews with newsmakers in government and entertainment. She is founder of \" Goats for the Old Goat .\" Over the last three years, donations have been made to acquire goats for liberated slaves who were returning to South Sudan. More than 7,000 goats have been donated to the people of South Sudan to provide sustainable sustenance for their families and a means to begin their lives again. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}