{"organizations": [], "uuid": "39a0c9a5835088f9eb7a848edeb3eefa4fbf5731", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/politics/index.html", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/05/17/immigration-courts-reportedly-have-445000-pending-cases/", "country": "US", "title": "Immigration courts reportedly have 445,000 pending cases", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "Immigration courts reportedly have 445,000 pending cases | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "39a0c9a5835088f9eb7a848edeb3eefa4fbf5731"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/17/immigration-courts-reportedly-have-445000-pending-cases/", "ord_in_thread": 0, "title": "Immigration courts reportedly have 445,000 pending cases", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 17, The already backlogged federal immigration courts have reportedly reached an all-time high with more than 445,000 pending cases.\nThe Los Angeles Times, citing the Transactional Records Access Clearinghouse at Syracuse University, reports that as of April, the backlog hit 445,706, which is a nearly 30 percent increase since Oct. 1, 2013.\nImmigration courts have been overwhelmed since the influx of more than 68,500 unaccompanied children and about as many family units crossing the southern border, most of them from Central America.\nDuring the surge, unaccompanied children’s cases were expedited in courts in Los Angeles and other large cities.\nDespite the surge, the unaccompanied children’s cases only make up 16 percent of the total as of April. The juvenile case backlog is still 68 percent larger than it was last June, when the backlog reached 41,641 juvenile cases, the Times reports.\nThe backlogged cases for Central Americans have skyrocketed. Guatemalans’ cases are up 63 percent, 92 percent for Salvadorians and 143 percent for Hondurans.\nThe report found that California, Texas and New York led the nation with the largest immigration backlogs, followed by Florida and New Jersey.\nLouis Ruffino told the Los Angeles Times that more than 233 judges across the nation are heading immigration cases and 68 more are going to be hired. Ruffino also said that Miami judges have also been hearing Texas immigration cases via videoconferencing.\nDenise Gilman, who directs an immigration clinic at the University of Texas law school in Austin, told the paper that “there is no ability of the court to keep up. We really are in a vicious cycle.”\nGilman has a Honduran client who suffered a heart attack recently after waiting two years for his asylum case to be heard.\nJonathan Ryan, executive director of the San Antonio-based legal advocacy group Raices, says the federal government was not addressing the cases that make up a majority of the backlog after it expedited unaccompanied minors’ cases.\n “We see people coming into our office every day whose lives are being negatively impacted by this,” Ryan told the paper.\nSome judges believe the backlog is expected to get worse.\nSan Francisco-based Judge Dana Leigh Marks told the Los Angeles Times that they’re “waiting for the tsunami to come.”\nMarks said 100 immigrants judges were expected to retire this year alone. Many immigration judges handle more than 3,000 cases a year, which would push hearings back to 2019.\nClick for more Los Angeles Times\nAdvertisement\nTrending in Politics 1 Army's elite Delta Force kills top ISIS official, Abu Sayyaf, in daring Syria raid 2 Mitt Romney lasts 2 rounds with Evander Holyfield in charity boxing match 3 As Senate Dems move to back Obama trade deal, Clinton takes heat for staying on sidelines 4 US, China refuse to budge over South China Sea activity 5 Amtrak crash reignites Capitol Hill debate over infrastructure spending, burden of sequester See all Trends Advertisement", "external_links": [], "published": "2015-05-17T03:00:00.000+03:00", "crawled": "2015-05-17T10:58:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}