{"organizations": [], "uuid": "ba4111c3bb21c304299e49bd08a9d1fbc3f13add", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thornberrymac_031815fr.jpg", "site_section": "http://thehill.com/taxonomy/term/1131/feed", "section_title": "The Hill: House", "url": "http://thehill.com/policy/defense/242986-gop-rep-to-obama-dont-play-politics-on-defense", "country": "US", "title": "Armed Services chief to Obama: Don't 'play politics' on defense", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Armed Services chief to Obama: Don't 'play politics' on defense", "spam_score": 0.0, "site_type": "news", "published": "2015-05-23T13:00:00.000+03:00", "replies_count": 0, "uuid": "ba4111c3bb21c304299e49bd08a9d1fbc3f13add"}, "author": "ckulat@thehill.com (Mark Hensch)", "url": "http://thehill.com/policy/defense/242986-gop-rep-to-obama-dont-play-politics-on-defense", "ord_in_thread": 0, "title": "Armed Services chief to Obama: Don't 'play politics' on defense", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Armed Services chief to Obama: Don't 'play politics' on defense By Mark Hensch - 05/23/15 06:00 AM EDT \nRep. Mac Thornberry (R-Texas) urged President Obama on Saturday to drop his veto threat against a defense spending bill. \nThornberry argued that Obama should reconsider using executive power on the $612 billion 2016 National Defense Authorization Act (NDAA) given it passed overwhelmingly in the House last week and has majority Senate support going forward. \n“The House bill authorized exactly the amount the president requested to keep America safe,” Thornberry said in the GOP’s weekly address. “But he wants more money for domestic programs and he has threatened to veto the defense bill unless he gets it.” ADVERTISEMENT “Look, we’re always going to have our differences, but it’s wrong for anyone to play politics with defense,” said Thornberry, the House Armed Services Committee chairman.\n“The world is too dangerous, and the men and women who serve are too precious for that,” he added. \nThornberry additionally called on Obama to reflect on the value of America’s troops as the nation heads into Memorial Day on Monday. \n“We carry a debt to those who served, and especially to those who have fallen, to focus on just on doing what’s right for the country and what’s right for the troops, and we honor them best by building on their sacrifice to pass along to the next generation a country that is even stronger, even more prosperous and even freer than we’ve enjoyed,” he said. \nThe Texas Republican also argued that reinforcing U.S. armed forces was essential for countering global threats and reassuring U.S. allies abroad. \n“The world today is full of turmoil,” he said. “Freedom and decency are still under assault.” \n“ISIS, for example, poses a grave and direct threat to our security and our way of life,” Thornberry said of the terrorist Islamic State in Iraq and Syria (ISIS). \n“No one knows how to solve all the problems in the world,” he said. “But one thing we know for sure — the world is a safer, better place when the United States is militarily strong,” Thornberry said. “And a weakened America invites great danger.” \nThe House defied Obama’s veto threat on May 15 with a 269-151 vote overwhelmingly approving the NDAA. \nThe Senate, meanwhile, could vote on its version of the legislation by early next month. \n“Schedule permitting, the committee is ready to go to the floor in June,” a Senate Armed Services Committee aide told The Hill on Monday. \nObama has vowed he would strike down the bill over its circumnavigation of spending caps. \nThe bill maintains ceilings on defense spending first imposed in a 2011 budget deal that introduced sequestration spending limits. \nIt eludes those caps, however, by increasing funding to the Pentagon’s war fund. \nThe proposed legislation authorizes roughly $523 billion in base Defense Department spending. An additional $90 billion is listed for the war fund, formally known as the Overseas Contingency Operations fund. \nShould the NDAA reach the Senate floor in June, it could pass faster than most previous iterations of the bill. \nCongress has passed an NDAA before the Dec. 31 deadline for 53 consecutive years. Tags:", "external_links": [], "published": "2015-05-23T13:00:00.000+03:00", "crawled": "2015-05-23T16:32:06.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}