{"organizations": [], "uuid": "534061619d11f2b45e1bb8e9802936637f649c2d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/Boehner_new.jpg", "site_section": "http://feeds.foxnews.com/foxnews/politics", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/03/boehner-tells-clinton-dont-let-obama-swing-in-wind-over-asia-pacific-trade-deal/", "country": "US", "title": "Boehner tells Clinton don’t let Obama 'swing in the wind' over Asia-Pacific trade deal", "performance_score": 2, "site": "foxnews.com", "participants_count": 6, "title_full": "Boehner tells Clinton don’t let Obama 'swing in the wind' over Asia-Pacific trade deal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-03T03:00:00.000+03:00", "replies_count": 6, "uuid": "d093ab971ca315b7067953720edb2395771a8f2f"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/03/boehner-tells-clinton-dont-let-obama-swing-in-wind-over-asia-pacific-trade-deal/#post-0", "ord_in_thread": 0, "title": "Boehner tells Clinton don’t let Obama 'swing in the wind' over Asia-Pacific trade deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FoxNews.com   livefyre Email Print FILE: Dec. 11, 2014: House Speaker John Boehner speaks at a news conference on Capitol Hill, in Washington, D.C.  (AP) \nHouse Speaker John Boehner said Sunday that Hillary Clinton, the 2016 Democratic presidential frontrunner, needs to support the trade legislation that President Obama wants to help get enough Democratic votes for passage.\nThe Ohio Republican, in a wide-ranging interview with NBC’s “Meet the Press,” said the GOP indeed controls the House and Senate but that he and Obama “needs her help” to give the president negotiating authority to complete an Asia-Pacific trade deal.\n“We can't do this by ourselves,” Boehner said. “Every president over the last 50 years has had this (authority.) There is no reason why President Obama shouldn't have it either because trade is good for our country.”\nClinton as secretary of state from 2009 to 2013 supported such legislation. But as a presidential candidate she appears noncommittal -- amid liberal Democrats and labor unions saying the pact would cost American jobs and lower environmental standards.\n“Hillary Clinton was for trade promotion authority,” Boehner added. “Hillary Clinton is for the trade bill with the Asians, she just won't say so.”\nHe also said Clinton \"can't sit on the sidelines and let the president swing in the wind.\"\nBoehner said that improving public education and fixing the tax code to encourage more investments that lead to jobs and other economic opportunities are two ways to help cities such as Baltimore, where the recent death of a black male in police custody and years of urban plight sparked rioting last week.\nAnd he appeared open to the use of federal money to pay for body cameras for police officers.\n“I think most departments around the country are moving toward body cameras,” Boehner told NBC. “I think the states if they want to require it, (I’d be) more than happy to do so. We've got a lot of police grants that we already have on the books that can be used for this.”\nThe Associated Press contributed to this report. \n \n \n ", "external_links": [], "published": "2015-05-03T03:00:00.000+03:00", "crawled": "2015-05-04T02:32:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}