{"organizations": ["Obama Library Hawaii"], "uuid": "e8e9e98e95e886d5dd5e88ec39434dc81fde521a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2944036/images/o-OBAMA-SHAKA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/13/hawaii-loses-obama-library_n_7271648.html", "country": "", "title": "Hawaii Gets Consolation Prize After Losing Out On Obama Library", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Hawaii Gets Consolation Prize After Losing Out On Obama Library", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T17:01:00.000+03:00", "replies_count": 0, "uuid": "e8e9e98e95e886d5dd5e88ec39434dc81fde521a"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/13/hawaii-loses-obama-library_n_7271648.html", "ord_in_thread": 0, "title": "Hawaii Gets Consolation Prize After Losing Out On Obama Library", "locations": ["Hawaii"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["CATHY BUSSEWITZ"], "text": "Hawaii Gets Consolation Prize After Losing Out On Obama Library | By CATHY BUSSEWITZ reddit \nHONOLULU (AP) -- The Barack Obama Foundation has selected Chicago as its home, but the group still plans to collaborate in some way with the University of Hawaii. \nUniversity of Hawaii President David Lassner said Tuesday that it's clear that the foundation wants to have a presence in Hawaii, and that the university will be working with the foundation over the next few months to figure out what the relationship will be. Hawaii had submitted a bid to build the presidential library in the Honolulu neighborhood of Kakaako. \n\"This is an incredible opportunity for our students, faculty and staff and the entire state and will only enrich the educational experience here at the University,\" Lassner said at a news conference. \"While we're not building that magnificent facility at Kakaako that we proposed, I think that there will be decades of benefit to the state as a result of putting in the proposal, getting on the radar and clearly attracting the attention of the president, that he wants to be doing something here related to his legacy and with the University of Hawaii, very specifically.\" \nMaya Soetoro-Ng, Obama's sister and a member of the foundation's board of directors, said Hawaii presented a compelling plan, and that the foundation plans to develop joint programs with the University of Hawaii and other local partners. \nThe foundation also intends to have a presence at Columbia University in New York, according to a news release from the Hawaii Presidential Center Initiative. \nObama's policy of pivoting attention to the Asia-Pacific region and the fact that the island chain has direct flights throughout the region helped the state, said Gov. David Ige. \n\"Our location in the Pacific, his early years spent here really did shape his thinking in a lot of different ways,\" Ige said of the president. Earlier on HuffPost:   A Santa figurine with a sign that says \"Hawaii or Bust\" stands on the tarmac in front of Air Force One before President Barack Obama and first lady Michelle Obama and their daughters Sasha and Malia board, Friday, Dec. 20, 2013, in Andrews Air Force Base, Md., en route to Hawaii for their annual family vacation. A staff member put the stature there to photograph it before departure. (AP Photo/Carolyn Kaster) Malia Obama walks to a motorcade vehicle as she arrives with the first family on Air Force One at Joint Base Pearl Harbor-Hickam, in Honolulu, Friday, Dec. 20, 2013. The first family will be spending their annual winter vacation in Hawaii and return to Washington on Jan. 5, 2014. (AP Photo/Carolyn Kaster) Sasha Obama walks to a motorcade vehicle as she arrives with the first family on Air Force One at Joint Base Pearl Harbor-Hickam, in Honolulu, Friday, Dec. 20, 2013. The first family will be spending their annual winter vacation in Hawaii and return to Washington on Jan. 5, 2014. (AP Photo/Carolyn Kaster) President Barack Obama, right, waves while escorting the first lady Michelle Obama, left, to meet various well wishers after disembarking Air Force One at Joint Base Pearl Harbor-Hickam, Friday, Dec. 20, 2013, in Honolulu. The first family will be spending their annual winter vacation in Hawaii and return to Washington on Jan. 5, 2014. (AP Photo/Eugene Tanner) KAILUA, HI - DECEMBER 23: U.S. President Barack Obama reacts to his missed putt on the 18th hole with golf friends Marvin Nicholson, Bobby Titcomb and Eric Whitaker during a round of golf at Mid Pacific Country Club on December 23, 2013 in Kailua, Hawaii. The first family is enjoying holiday vacation in Hawaii until January 5, 2013. (Photo by Cory Lum-Pool/Getty Images) US President Barack Obama plays golf at Mid-Pacific Country Club in Kailua, Hawaii, 23, 2013. The first family is in Hawaii for their annual holiday vacation. AFP PHOTO/Jewel SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) US President Barack Obama plays golf at Mid-Pacific Country Club in Kailua, Hawaii, 23, 2013. The first family is in Hawaii for their annual holiday vacation. AFP PHOTO/Jewel SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) KAILUA, HI - DECEMBER 23: U.S. President Barack Obama lines up his putt on the 18th hole with golf friends Marvin Nicholson, Bobby Titcomb and Eric Whitaker during a round of golf at Mid Pacific Country Club on December 23, 2013 in Kailua, Hawaii. The first family is enjoying holiday vacation in Hawaii until January 5, 2013. (Photo by Cory Lum-Pool/Getty Images) US President Barack Obama waves a shaka to a crowd after buying 'shave ice' from Island Snow at Kailua Beach Center in Kailua, Hawaii, on December 31, 2013. The First Family is in Hawaii for their annual vacation. AFP PHOTO/Jewel SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) HONOLULU, HI - DECEMBER 31: U.S. President Barack Obama greets well-wishers outside of Island Snow at Kailua Beach Center on December 31, 2013 in Honolulu, Hawaii. The First Family is in Hawaii for the winter holidays. (Photo by Kent Nishimura-Pool/Getty Images) President Barack Obama holds his shave ice as he exits Island Snow to greet people waiting outside, Tuesday, Dec. 31, 2013. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama walks past a pineapple decal on the window as holds his shave ice as he exits Island Snow to greet people waiting outside, Tuesday, Dec. 31, 2013. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) Malia Obama holds a shave ice as she exits Island Snow, Tuesday, Dec. 31, 2013. Malia Obama was at Island Snow with family and friends including her father President Barack Obama. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) People swim along the southeast coast of Oahu near Kalanianaole Highway seen from the media motorcade vehicle as President Barack Obama and the first family drive from Hanauma Bay Nature Preserve Park, a popular snorkeling spot, Tuesday, Dec. 31, 2013, in Honolulu, en route to Kailua, Hawaii,. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama and the first family drive in a motorcade along the southeast coast of Oahu on Kalanianaole Highway en route to Hanauma Bay Nature Preserve Park, a popular snorkeling spot, Tuesday, Dec. 31, 2013, in Honolulu. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama is seen through the window of his motorcade vehicle as he is driven through the Kailua, Hawaii, neighborhood where he is spending his annual holiday vacation with his family, Monday, Dec. 30, 2013, en route to Makiki Valley Loop Trail in Honolulu to hike with family and friends. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) A member of Marine Corps Base Hawaii security holds back traffic for President Barack Obama's approaching motorcade while on base in Kaneohe Bay, Hawaii, as he is driven back to his vacation home after a morning workout, Sunday, Dec. 29, 2013. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama speaks to members of the military and their families as first lady Michelle Obama stands left in Anderson Hall at Marine Corps Base Hawaii, Wednesday, Dec. 25, 2013, in Kaneohe Bay, Hawaii. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama and first lady Michelle Obama arrive to speak to members of the military and their families in Anderson Hall at Marine Corps Base Hawaii, Wednesday, Dec. 25, 2013, in Kaneohe Bay, Hawaii. The first family is in Hawaii for a family holiday vacation. (AP Photo/Carolyn Kaster) First lady Michelle Obama looks out from the stage as President Barack Obama speaks to members of the military and their families in Anderson Hall at Marine Corps Base Hawaii, Wednesday, Dec. 25, 2013, in Kaneohe Bay, Hawaii. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama speaks to members of the military and their families in Anderson Hall at Marine Corps Base Hawaii, Wednesday, Dec. 25, 2013, in Kaneohe Bay, Hawaii. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama speaks to members of the military and their families as first lady Michelle Obama stands with him in Anderson Hall at Marine Corps Base Hawaii, Wednesday, Dec. 25, 2013, in Kaneohe Bay, Hawaii. The first family is in Hawaii for a family holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama is seen through the tinted window of his motorcade vehicle as he is driven through the Kailua, Hawaii, neighborhood where he is spending his annual holiday vacation with his family, Tuesday, Dec. 24, 2013, en route to Marine Corps Base Hawaii in Kaneohe, Hawaii, to play golf. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) Kyrstin Lavelle, 10, holds her book for photographers to see with President Barack Obama's autograph and comment that reads \"To Kyrstin Dream Big Deams\" on Marine Corps Base Hawaii in Kaneohe, Hawaii, Tuesday, Dec. 24, 2013. Kyrstin and her family met President Obama outside the base workout facility as he entered. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama sits with longtime friend Bobby Titcomb during the Oregon State University versus University of Akron college basketball game at the Diamond Head Classic at the Stan Sheriff Center in Honolulu, Sunday, Dec. 22, 2013. Michelle Obama's bother, Craig Robinson, is the coach of Oregon State. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) From left, Malia Obama, Sasha Obama, first lady Michelle Obama, President Barack Obama, and Bobby Titcomb attend the Oregon State University versus University of Akron college basketball game at the Diamond Head Classic at the Stan Sheriff Center in Honolulu, Sunday, Dec. 22, 2013. Michelle Obama's bother, Craig Robinson, is the Coach of the Oregon State. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama, right, enjoys some popcorn and watches Oregon State play Akron along with the first lady Michelle Obama, right center, his daughters Sasha Obama, left center and Malia Obama, far left, in the first half of an NCAA college basketball game at the Diamond Head Classic Sunday, Dec. 22, 2013, in Honolulu. (AP Photo/Eugene Tanner) From right, President Barack Obama, looks to a yawning first lady Michelle Obama as Sasha Obama puts her head down during the final minutes of the Oregon State University versus University of Akron college basketball game at the Diamond Head Classic at the Stan Sheriff Center in Honolulu, Sunday, Dec. 22, 2013. Michelle Obama's bother, Craig Robinson, is the coach of Oregon State. The first family is in Hawaii for their annual holiday vacation. Akron won 83-71. (AP Photo/Carolyn Kaster) President Barack Obama plays golf at the Mid Pacific Country Club, Wednesday, .Jan. 1, 2014 in Lanikai on the island of Oahu, in Hawaii. (AP Photo/Marco Garcia) President Barack Obama calls out a greeting to people watching him along the 18th green at Mid-Pacific County Club in Kailua, Hawaii, Wednesday, Jan. 1, 2014. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) President Barack Obama smiles as he walks onto the 18th green to putt at Mid-Pacific County Club in Kailua, Hawaii, Wednesday, Jan. 1, 2014. The first family is in Hawaii for their annual holiday vacation. (AP Photo/Carolyn Kaster) HONOLULU, HAWAII - JANUARY 4: (AFP OUT) U.S. President Barack Obama greets well-wishers before boarding Air Force One on January 4, 2014 at Joint Base Pearl Harbor-Hickam in Honolulu, Hawaii. The President and daughters Sasha and Malia are returning to Washington, DC from Hawaii where they spent the winter holiday, while the First Lady is remaining in Hawaii. (Photo by Kent Nishimura/Getty Images) HONOLULU, HAWAII - JANUARY 4: (AFP OUT) U.S. President Barack Obama, and daughters Malia (L) and Sasha (C) are greeted by PACOM Commander Admiral Sam Locklear and his wife Pam Locklear before boarding Air Force One on January 4, 2014 at Joint Base Pearl Harbor-Hickam in Honolulu, Hawaii. The President and daughters Sasha and Malia are returning to Washington, DC from Hawaii where they spent the winter holiday, the First Lady is remaining in Hawaii. (Photo by Kent Nishimura/Getty Images) HONOLULU, HAWAII - JANUARY 4: (AFP OUT) U.S. President Barack Obama greets well-wishers before boarding Air Force One on January 4, 2014 at Joint Base Pearl Harbor-Hickam in Honolulu, Hawaii. The President and daughters Sasha and Malia are returning to Washington, DC from Hawaii where they spent the winter holiday, while he First Lady is remaining in Hawaii. (Photo by Kent Nishimura/Getty Images)  Share ", "external_links": [], "published": "2015-05-13T17:01:00.000+03:00", "crawled": "2015-05-13T17:36:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}