{"organizations": ["Facebook", "Fox News Obama", "Twitter"], "uuid": "318004a0467908ef04a30b8577c320e8a1bf3744", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051115_otr_panel.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/05/14/obama-seeks-to-reassure-gulf-leaders-amid-specter-iran-possible-nuclear-race/", "country": "", "title": "Obama seeks to reassure Gulf leaders amid specter of Iran, possible nuclear race | Fox News", "performance_score": 3, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama seeks to reassure Gulf leaders amid specter of Iran, possible nuclear race | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T13:02:00.000+03:00", "replies_count": 0, "uuid": "318004a0467908ef04a30b8577c320e8a1bf3744"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/14/obama-seeks-to-reassure-gulf-leaders-amid-specter-iran-possible-nuclear-race/", "ord_in_thread": 0, "title": "Obama seeks to reassure Gulf leaders amid specter of Iran, possible nuclear race | Fox News", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama seeks to reassure Gulf leaders amid specter of Iran, possible nuclear race Published May 14, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama will welcome leaders from six Persian Gulf nations to Camp David Thursday in an attempt to reassure them about their security amid the backdrop of a possible nuclear deal between the West and Iran, as well as reports that some Arab nations will try to match whatever enrichment regime Iran agrees to. \nThe New York Times reported late Wednesday that Saudi Arabia and other small Arab states were expected to make the case to Obama that they should be allowed to enrich whatever amount of nuclear material Iran is permitted to under the terms of a permanent deal that is due to be agreed on by the end of June. \n\"We can’t sit back and be nowhere as Iran is allowed to retain much of its capability and amass its research,\" one Arab leader due to meet with Obama told The Times Monday. The paper also reported that Prince Turki bin Faisal, the longtime Saudi intelligence chief, told a conference in South Korea \"whatever the Iranians have, we will have, too.\" \nThe most likely supplier of any components for a nuclear project would be Pakistan. In March , Pakistan Prime Minister Nawaz Sharif visited Saudi Arabia one day before U.S. Secretary of State John Kerry traveled to the kingdom. Riyadh provided financial support for Pakistan's nuclear program, which succeeded in producing a nuclear weapon in 1998. \nIn February, the chairman of Pakistan's Joint Chiefs of Staff Committee visited Saudi Arabia, amid some speculation that Saudi Arabia's rulers had reconfirmed a supposed secret arrangement for Pakistan to supply Saudi Arabia with warheads should Iran achieve a nuclear weapon. \nAnother possible complication will be the absence from Thursday's summit of Saudi King Salman. On Sunday, Saudi Arabia announced that the king was skipping the summit, just two days after the White House said he was coming. \nThe White House and Saudi officials insist the king is not snubbing Obama. But Salman's conspicuous absence comes amid indisputable signs of strain in the long relationship between the U.S. and Saudi Arabia, driven not only by Obama's Iran overtures, but also the rise of Islamic State militants and a lessening U.S. dependency on Saudi oil. \n\"There have been disagreements under this administration and under the previous administration about certain policies and development in the Middle East, but I think on a set of core interests, we continue to have a common view about what we aim to achieve,\" said Ben Rhodes, Obama's deputy national security adviser. \nCrown Prince Mohammed bin Nayef and Deputy Crown Prince Mohammed bin Salman were representing Saudi Arabia instead. They held a separate meeting with Obama before the other leaders arrived. \nThe president made no mention of Saudi skepticism of the Iran talks as he opened the meeting, but acknowledged the region is in the midst of a \"very challenging time.\" \nThe Saudi king isn't the only head of state sending a lower-level representative to the summit. The heads of the United Arab Emirates and Oman have had health problems and were not making the trip. \nThe White House says a nuclear accord could clear the way for more productive discussions with Iran about its reputed terror links. The U.S. has criticized Iran's support for Hezbollah, as well as terror attacks carried out by Iran's Quds Force. However, the Gulf nations fear that an influx of cash will only facilitate what they see as Iran's aggression. \nIn 2011, the Obama administration accused Iran of plotting to kill the Saudi ambassador to the United States in Washington. \nThe Saudis are also particularly concerned about the situation in Yemen, where Houthi rebels with ties with Iran have ousted the U.S.- and Saudi-backed leader. \nFor more than a month, a Saudi-led coalition has tried to push back the Houthis with a relentless bombing campaign. On Tuesday, a five-day humanitarian cease-fire went into effect, though the pause in fighting was already at risk. A jet fighter from the Saudi coalition on Wednesday struck a military convoy belonging to Shiite rebels and their allies in southern Yemen. \nSaudi officials cited the cease-fire as one of the reasons why King Salman needed to stay in Riyadh and not make the trip to the United States. \nBahrain's royal court announced Wednesday that rather than travel to Washington, King Hamad bin Isa Al Khalifa would be attending a horse show and meeting with Queen Elizabeth II. \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-05-14T13:02:00.000+03:00", "crawled": "2015-05-14T13:07:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}