{"organizations": [], "uuid": "1bdb955674ffaee8657979aecb362f96f4348041", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2899108/images/o-ABORTION-CAPE-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/04/30/abortion-clinic-north-dakota_n_7155136.html", "country": "", "title": "When It Comes To Abortion Rights, North Dakota Is The 'Canary In The Coal Mine'", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "When It Comes To Abortion Rights, North Dakota Is The 'Canary In The Coal Mine'", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T05:41:00.000+03:00", "replies_count": 0, "uuid": "1bdb955674ffaee8657979aecb362f96f4348041"}, "author": "", "url": "http://www.huffingtonpost.com/2015/04/30/abortion-clinic-north-dakota_n_7155136.html", "ord_in_thread": 0, "title": "When It Comes To Abortion Rights, North Dakota Is The 'Canary In The Coal Mine'", "locations": ["North Dakota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When It Comes To Abortion Rights, North Dakota Is The 'Canary In The Coal Mine' Posted: reddit \nA lison is about to have an abortion. It’s not the first time she’s been to the Red River Women’s Clinic in Fargo, North Dakota. She came here a week ago but went home. \n“I wasn’t prepared last week,” she said. “As soon as I saw the ultrasound machine I just started bawling. The woman at the clinic looked at me and said, ‘I’ve been doing this for 20 years and I can tell you’re not ready. You should go home to think about it. No one’s going to be mad at you.’” \nAfter a week of considering her options, Alison returned to the clinic for a surgical abortion. She decided that as a single mother with two children and a tumultuous relationship with the father, she doesn’t have the resources to support another child. But Alison had to handle the ordeal alone. “Where I’m from, abortion is not an option,” she said. “Everybody’s stuck in a time where you don’t talk about abortion, you don’t have abortion, you pretend abortion doesn’t exist.” \n'He Came Off As Prince Charming' \nR ed River Women’s Clinic, located on a busy corner of downtown Fargo, is the only option for women in North Dakota who want to terminate their pregnancies. The clinic has just three full-time staff members, and about 15 others who work on Wednesdays, the one day a week Kromenaker and her staff see patients. On these days, the clinic treats an average of 25 women. \nMore than 40 years after Roe v. Wade, these women and others in North Dakota are still fighting to maintain their right to choose. Numerous bills have been introduced in an effort to criminalize abortion in the state, including a November 2014 personhood measure that proposed giving a fetus legal rights from the moment of conception. Measure 1 offered the following amendment to the state constitution: “The inalienable right to life of every human being at any stage of development must be recognized and protected.” Although the bill was defeated, Tammi Kromenaker, director of the Red River Women’s Clinic, doesn’t think the battle is over. \"We don't know what the state legislatures will do this year,” she said. “I’ll believe it when I see it.” \nNorth Dakota is one of four states with just one remaining abortion clinic. According to a study by Operation Rescue , an anti-abortion organization, 75 percent of surgical abortion facilities operating in the U.S. have closed since 1991. The same study shows that in 2014, the number of abortion clinics declined by 73, to just 793. Of those, 511 perform surgical abortions. There are 62 million women of childbearing age in the United States -- that’s about 78,000 women per clinic. \n“North Dakota is like the canary in the coal mine,” said Nancy Northup, President of the Center For Reproductive Rights, which represents the Red River Women’s Clinic in its legal battles with the state. “The most extreme laws are tested out in North Dakota, and whatever the anti-choice movement push at the state level eventually shows up in the halls of Congress.” \n“Folks that live in states that protect their rights, like New York and California, should wake up to see what’s happening in North Dakota, because it’s coming to their federal government,” she added. \nNorth Dakota bans abortions past 20 weeks of pregnancy, requires minors to obtain consent from both parents, and limits public funding for abortion to cases of rape, incest, or when the mother’s life is in danger. A ban on abortion after six weeks of pregnancy, before most women even know they’re pregnant, is currently pending in the Eighth Circuit Court of Appeals. Ohio, Texas and Alabama have proposed similar bans that have not passed. \nThe trend toward harsher abortion restrictions has spread across the U.S. Alabama has brought a fetal heartbeat ban back to the legislature , and Kansas recently became the first state to ban a commonly used second-trimester abortion procedure , dilation and evacuation. \nNorthup called the pending six-week ban in North Dakota “the most radical early limit on abortion” in the country. “It is blatantly unconstitutional,” she said. \nAccess is restricted not only by law but by distance. Women living in the northwest corner of the state have to drive seven to eight hours to reach the clinic. \n“It’s a tremendous financial burden to drive a car, to take a day off work,” said Warren Christensen, a clinic volunteer. “There are some stories of women who are basically prepared to sleep in their car overnight because they can’t afford to get a hotel.” \nThe RRWC does have a nonprofit funding assistance program called the Women In Need fund, but not all women are guaranteed assistance. And abortion isn’t cheap. A surgical abortion costs $575 to $975 at the clinic, depending on the stage of pregnancy. \nSome women who can’t make the trip or pay for the abortion resort to other methods. “We’ve had a few women over the years who said, ‘What would happen if I drank some bleach? Or what would happen if I threw myself down some stairs?’” said Kromenaker. “I’ve even had women say, ‘Well, I’ll just take a hanger and deal with it myself.’” \nKromenaker believes the clinic meets the state’s current need. But it’s hard to predict how the demand would change if women had access to funding and more clinics. \n“I am sure there are women in North Dakota who give up before they even try,” said Northup. \nShe believes that enabling women to obtain medical abortions from local health care providers and through telemedicine would help. \nKromenaker adds that the problem begins with sex education. “I would encourage the legislature to go several steps back and help [women] not get pregnant in the first place,” she said. “There’s a huge amount of misinformation that goes on.” \n“I was told birth control is for sluts,” said Caitlin O'Connell, who became pregnant as a teenager. O’Connell, a former RRWC patient, grew up in Fargo and serves as a patient escort for the clinic. \n\"All I remember from my fifth-grad sex ed is that girls get their periods, don’t wear white pants,” said Laura Paterson, another former patient and clinic volunteer. Paterson believes that had her sex education been more thorough, she could have made safer sex choices. \n'It Was Kind Of An Uneducated Oops' \nT he North Dakota Health Content and Achievement Standards , written in 2008, only require that educators “explain the relationship between sexual behavior and personal health (e.g., STD/STI, pregnancy, HIV/AIDS)” and make sure their students are able to “compare the short and long term impacts of alternative choices (e.g., pop vs. water, smoking vs. nonsmoking, wearing a seatbelt vs. not wearing a seatbelt, abstinence vs. sexual activity) in health-related situations.” The document also outlines abstinence as an example of enhancing health. It makes no mention of condoms or birth control. \nResearch shows abstinence programs do not delay sexual activity for teens. A federally funded 2007 report conducted by Mathematica Policy Research for the U.S. Department of Health and Human Services found that “youth in the [abstinence] program group were no more likely than control group youth to have abstained from sex and, among those who reported having had sex, they had similar numbers of sexual partners and had initiated sex at the same mean age.” According to the report, $87.5 million in federal and state funding is given annually to abstinence-only programs across the country. \n“What we need to have for the health and well-being of girls and women is comprehensive sexual and reproductive programs, so that women and girls understand how their reproductive systems work, understand how to get the health care they need and how to make good decisions around their reproductive health,” said Northup. \n'I Would've Committed Suicide' \nCompounding the issue, the stigma around abortion in North Dakota “is amazingly pervasive,” Kromenaker said. \nThe anti-abortion movement has set up shop next door to the clinic. A visitation chapel owned by the Diocese of Fargo holds Mass on Wednesday mornings, and afterward, its members stand outside the clinic with signs and pamphlets. \nAlthough Rachelle Sauvageau, director of the office that runs the visitation chapel, declined an interview for this piece, she allowed a quick look around. The prayer room’s windows overlook the clinic. A bulletin board outside the room holds anti-abortion flyers and a slip of paper with photos of the clinic doctors and their names, instructing readers to “pray for the abortionists next door.” \nCommunity members who protest outside the clinic refer to themselves as “sidewalk advocates” or “sidewalk counselors.” They hold signs reading “Babies are killed here,” and pace back and forth holding rosaries. \nRRWC has a team of sidewalk volunteers whose job is to get women into the clinic safely. Christensen, a physics professor and single dad who has been escorting patients at the clinic for two years, says he feels a responsibility to help the women. “I’m a white male who’s a big guy and I have a good job; it’s hard to get any more privileged than that,” he said. “This is a situation where people are being bullied essentially, so I feel like I have to do this.” “Most of the protesters are men,” Alison pointed out. “They don’t know what it’s like to be in this position.” \nKromenaker says she’s hopeful abortion access in North Dakota will improve in the future. But in the meantime, women like Alison face countless obstacles. \n“Women in this country aren’t free,” Alison said. “How can you be free when you have someone telling you what you can and cannot do with your own body?” \n'I Took My Pregnancy Test At Taco Bell' Also on HuffPost: ", "external_links": [], "published": "2015-05-01T05:41:00.000+03:00", "crawled": "2015-05-01T05:41:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}