{"organizations": [], "uuid": "9848c5b31c16151915730fb8810bb435a04284e8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/politics/index.html", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/05/14/senate-puts-obama-supported-trade-bill-back-on-track-after-deal-with-dems/", "country": "US", "title": "Senate puts Obama-supported trade bill back on track, after deal with Dems", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "Senate puts Obama-supported trade bill back on track, after deal with Dems | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "9848c5b31c16151915730fb8810bb435a04284e8"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/05/14/senate-puts-obama-supported-trade-bill-back-on-track-after-deal-with-dems/", "ord_in_thread": 0, "title": "Senate puts Obama-supported trade bill back on track, after deal with Dems", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Associated Press Email Print In a burst of bipartisanship, the Republican-controlled Senate put President Obama's trade agenda back on course on Thursday, clearing the way for likely approval within days for legislation allowing the administration to negotiate global deals that Congress could support or reject but not change.\nThe 65-33 vote to resurrect the measure capped two days of political intrigue in which Democrats on both sides of the legislation initially joined forces to block action, then reached agreement with Republicans for votes on other enforcement measures to protect workers who lose jobs as a result of exports.\nOne of those provisions, to crack down on suspected currency manipulation by China and other U.S. trading partners, was incorporated into a separate bill that passed the Senate earlier in the day on a vote of 78-20. It would require the imposition of tariffs on products from countries found to have artificially set the level of their currency, a practice that makes it harder for U.S. firms to compete and results in the loss of jobs in this country.\nThe White House announced its opposition to the currency provision, saying it would undermine existing efforts to respond to China and other alleged violators and \" lead to other countries pursuing retaliatory measures that could hurt our exporters.\" But it did not threaten a veto. And Sen. Chuck Schumer, D-N.Y., a prominent sponsor of the proposal, predicted it might eventually prove essential in persuading enough skeptical House Democrats to swing behind the trade bill itself to assure final passage.\nThe measure would provide so-called \"fast-track\" authority to Obama at a time when the administration is seeking to negotiate separate trade deals with 12 nations that border the Pacific Ocean, and also with European Union countries.\nAn initial attempt Tuesday to begin debate on the trade bill was foiled by Democrats, who complained that Senate Republicans would not agree in advance to allow votes on the currency manipulation and other related measures at the same time.\nSenate Majority Leader Mitch McConnell, R-Ky., disputed charges that he had reneged on an earlier agreement, and he noted pointedly that while Republicans were cooperating with the president, Democrats were causing him grief.\n\"President Obama has done his country a service by taking on his (political) base and pushing back on some of the more ridiculous rhetoric we've heard,\" he said a few hours before the day's votes.\nNot everyone sounded as pleased.\nSen. Bernie Sanders, a Vermont independent running for the Democratic presidential nomination, said the legislation would lead to a trade deal like others in recent years that have \"cost us millions of decent-paying jobs and have led us to a race to the bottom where American workers are forced to compete against workers in low-wage countries who are making pennies an hour.\"\nAcross the Capitol, Speaker John Boehner said the House will consider the legislation once the Senate finishes. \"Republicans are going to do our part. Ultimately, however, success is going to require the Democrats putting aside politics and doing what's best for our country,\" he said.\nHe spoke at a news conference shortly after House Democratic Leader Nancy Pelosi of California told reporters that the bill's fate would mark a test of leadership for Boehner -- a standard she did not set for Obama.\nPelosi has yet to say how she will vote on the bill, but she has said repeatedly she and her party wants to \"find a path to yes.\" In a news conference and a written statement issued later in the day, she called for a change to limit the bill's duration to three years, rather than a maximum of six currently envisioned.\n\"While three years in the Trade Promotion Authority bill may be appropriate for foreseeable trade agreements, there is unease with a process that would provide carte blanch for agreements unknown, for countries to be determined, for a time in perpetuity,\" she said.\nA shorter bill would permit Obama to exercise so-called \"fast track\" authority on deals under negotiation with Pacific Ocean nations and the European Union. But it would require his successor to return to Congress for a renewal of the power for any future agreements.\nIronically, Pelosi's proposal would erase one of the bill's selling points with rank-and-file House Republicans, who are highly reluctant to grant new authority solely to Obama and who hope he is replaced by a member of their own party.\nThe currency provision was part of a bill designed to enforce trade deals.\nAlso included was a requirement for the Customs and Border Protection agency to \"address concerns that honey is being imported into the United States\" illegally.\nAdvertisement\nTrending in Politics 1 Senate panel probes ObamaCare aid confusion, as customers learn they owe IRS 2 ABC’s Stephanopoulos gave $50G to Clinton Foundation without disclosing it, apologizes 3 House speaker decries 'stupid question' about Amtrak funds 4 Amtrak union blames management for deadly crash 5 House members push for IRS Clinton probe See all Trends Advertisement", "external_links": [], "published": "2015-05-14T03:00:00.000+03:00", "crawled": "2015-05-14T22:53:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}