{"organizations": [], "uuid": "87c15866d2f01b4264bc4264e300ad594fecc0a2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/trade_050515getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/senate/241158-democratic-candidates-slam-obama-trade-agenda", "country": "US", "title": "Democratic candidates slam Obama trade agenda", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Democratic candidates slam Obama trade agenda", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T13:00:00.000+03:00", "replies_count": 0, "uuid": "87c15866d2f01b4264bc4264e300ad594fecc0a2"}, "author": "Scott Wong", "url": "http://thehill.com/homenews/senate/241158-democratic-candidates-slam-obama-trade-agenda", "ord_in_thread": 0, "title": "Democratic candidates slam Obama trade agenda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Democratic candidates slam Obama trade agenda By Scott Wong - 05/06/15 06:00 AM EDT \nDemocratic Senate hopefuls are running hard against President Obama’s trade agenda. \nSwing-state Democrats are sounding the alarm that Obama’s free trade proposals, backed by their GOP opponents, would ship U.S. manufacturing jobs overseas and lead to greater unemployment at home. \nNo other issue, they say, presents such a stark contrast between Democratic challengers and vulnerable Republican incumbents in 2016 than trade. ADVERTISEMENT In a four-minute YouTube video, Democrat Jason Kander, who is challenging Sen. Roy Blunt (R-Mo.), blasted the Trans-Pacific Partnership (TPP) as a “bad deal for Missouri.”\nA progressive group led by former Sen. Russ Feingold (D-Wis.), who is polling ahead of GOP Sen. Ron Johnson in Wisconsin, called the TPP “ruinous for our middle class.” \nAnd former Ohio Gov. Ted Strickland (D) said trade policy would be one of the “major defining issues” in his race against GOP Sen. Rob Portman, who served as the top trade official under former President George W. Bush. \n“The people of Ohio are sick and tired of trade deals which result in jobs and the economy being injured. … That’s why this is going to be a major issue between Sen. Portman and myself,” Strickland said in a phone interview Tuesday. \nThe Senate is gearing up for a vote on trade promotion authority, also called fast-track, that if approved would prevent the Congress from amending the TPP deal with 11 countries bordering the Pacific Ocean. The legislation would also greatly increase the chances that Obama could conclude negotiations on the pact. \nPortman voted for the fast-track bill in committee but says he still wants to see language barring Chinese currency manipulation before he supports it on the Senate floor. \nStill, he hit back at Strickland, accusing the former governor of impeding the growth of the Buckeye State’s export industry. \n“What he’s talking about is killing jobs in Ohio. If you’re not for exports, you’re not for jobs. Our state is a big exporting state,” Portman told The Hill. “He’s taking a radical position by saying we shouldn’t be expanding markets for our farmers and our workers. \n“It’s a great sound bite … but the reality is Ohioans want more exports, and they just want it to be fair.” \nSenate Majority Leader Mitch McConnell (R-Ky.) hopes to hold a vote on fast-track as early as this month. \nThe trade fight has made for unusual alliances in the Senate, where McConnell on Tuesday praised Obama’s efforts to win Democratic support for the bill. \nSenate Democratic Leader Harry Reid (Nev.), who for years blocked House Republican bills from getting to Obama’s desk, this week vowed to prevent a vote on fast-track. \nIn the House, Obama may have as few as 12 Democratic votes in favor of fast-track, though the administration is working to improve those numbers. \nAnd across the country, Democrats are plotting to use their opposition to Obama’s trade agenda as a way of getting elected to the Senate. \n“Forget party or the politician. In this cycle, trade deals like TPP are political landmines — support them and your political career likely goes bye-bye,” said one Democratic strategist who advises members of Congress and works on labor issues. “It’s a simple matter of trust: Voters don’t trust trade deals, and they don’t trust politicians when they say ‘trust us, this trade deal is different.’ ” \nThe partisan divide over trade is particularly acute in states across the Rust Belt and Midwest, which have lost factories and shed hundreds of thousands of manufacturing jobs in recent decades. \nJohnson, a former plastics manufacturer who could be the most vulnerable Senate Republican up for reelection next year, has argued that new trade deals will boost American exports and good-paying jobs. But he has taken some heat at home for his support for TPP, including at a town hall event last weekend in New London, Wis. \n“Trust me, I realize free trade is not a popular thing,” Johnson says in a video of the event shared by a Democratic tracker. “It’s always easy to show the plant that shut down and when another plant has opened up in China. … What’s a more difficult case to make is the benefit we all have by being able to purchase cheaper products.” \nIn Pennsylvania, Sen. Pat Toomey (R), the former head of the free-market, free trade Club for Growth, voted for fast-track authority in the Finance Committee. But one Democratic challenger, Allentown Mayor Ed Pawlowski, said he’d fight the Pacific trade deal to protect jobs in the Keystone State. \nThe other Democrat in the Senate primary, former Rep. Joe Sestak, hasn’t weighed in yet but opposed most trade deals when he was in Congress, including the North and Central American free trade agreements. \nRep. Patrick Murphy (D-Fla.) doesn’t have a top-tier GOP opponent yet in his quest to replace Sen. Marco Rubio (R-Fla.). But he too has come out strongly against the TPP, saying he’s opposed to “any trade deal that fails Florida jobs, labor standards, or the environment.” \nIn Maryland, Reps. Chris Van Hollen (D) and Donna Edwards (D) are opposed to fast-track, and Edwards has promised to turn Van Hollen’s past support for some trade deals against him. The two are vying to succeed retiring Sen. Barbara Mikulski (D). \nKander, Missouri’s 34-year-old Democratic secretary of State, took to YouTube to blast the Obama administration for negotiating the Pacific trade deal “in secret.” He argued that Missouri’s auto industry has been doing fine without a new trade pact, adding about 20,000 auto manufacturing or related jobs in the past five years. \nKander also cited other statistics from American Automotive Policy Council — a jab at Blunt, whose son, former Gov. Matt Blunt, serves as president and the top lobbyist for the auto group. \nIn an interview, Blunt made clear he has no plans to run from the tricky trade issue. Opening up new trade with Pacific markets will boost Missouri exports of corn, soybeans, rice, livestock and other products, he said, and mean more construction jobs as demand for ports and processing plants increase. \nTrade is “ good for where we live, and I don’t think it’s particularly troublesome,” Blunt said in an interview Tuesday. “World feed needs are going to double in the next 55 years, and the Mississippi River Valley is the biggest contiguous piece of agricultural ground in the world. The Mississippi River is the trade artery of that great piece of agricultural ground. \n“Whether its production or processing, these are great opportunities, and now is the time to more fully open the door to these opportunities,” Blunt said. \nRead more from The Hill:", "external_links": [], "published": "2015-05-06T13:00:00.000+03:00", "crawled": "2015-05-06T13:58:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}