{"organizations": ["Fox News", "UN"], "uuid": "64d1566c9d55ab1c7cea52590431f01c510b8e05", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/09/18/iran-rowhani-and-obama-at-un-get-ready-for-us-credibility-to-go-from-bad-to/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422633283291.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/18/iran-rowhani-and-obama-at-un-get-ready-for-us-credibility-to-go-from-bad-to.html", "country": "", "title": "Iran's Rowhani and Obama at UN -- get ready for US credibility to go from bad to much worse | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Iran's Rowhani and Obama at UN -- get ready for US credibility to go from bad to much worse | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "64d1566c9d55ab1c7cea52590431f01c510b8e05"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/18/iran-rowhani-and-obama-at-un-get-ready-for-us-credibility-to-go-from-bad-to.html", "ord_in_thread": 0, "title": "Iran's Rowhani and Obama at UN -- get ready for US credibility to go from bad to much worse | Fox News", "locations": ["Iran", "US", "Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rowhani", "Obama"], "text": "If the US is 'wrong' on Syria, what would it mean for Iran? \n[pullquote] \nIran is the leading state sponsor of terrorism, on the verge of acquiring the world’s most dangerous weapon, and the single greatest threat to the national security of the United States. \nIn theory, President Obama could play it straight – instead of getting played. \nHe could challenge Rouhani’s bona fides directly. \nHe could point to the sham Iranian election in which 686 candidates registered, eight were approved, and every woman disqualified. \nHe could describe the horrific human rights abuses suffered by Iranians today, detail the nuclear centrifuges still spinning their way to weapons of mass destruction under its new president, and spell out Rouhani’s hand in training Syrian President Assad’s murderous thugs. \nBut he will not. President Obama will mount the podium and demonstrate that the past is prologue. \nHere’s President Obama at the General Assembly in 2009: “I am committed to diplomacy that opens a path to greater prosperity and a more secure peace for [Iran] if…[it] lives up to [its] obligations.” \nIn 2010: “The United States… seek[s] a resolution to our differences with Iran, and the door remains open to diplomacy should Iran choose to walk through it.” \nIn 2011: “There's a future of greater opportunity for the people…if the…[Iranian] government meet[s its] international obligations.” In 2012: “America wants to resolve this issue through diplomacy, and we believe that there is still time and space to do so. But that time is not unlimited.” \nAs an added bonus, President Obama’s U.N. cue cards routinely include “international law is not an empty promise” and a non-compliant Iran will be held “accountable.” \nDespite the repetition, however, the speechifying has not been easy-going. \nIn 2009, the President and Secretary Clinton had to divert our attention from Iranian democracy-seekers dying in the streets of Tehran while begging for U.S. support. \nThen there were Ahmadinejad’s inconvenient recurring rants, espousing genocide, denying the Holocaust, and suggesting 9/11 was an inside job. \nAll Rouhani has to do is to appear slightly more polished, and the White House will embrace him as another one of those “lifelines” an adversary just happen to toss Obama’s way. \nThe endgame for Rouhani’s U.N. performance is simple: buy time. There is every indication that Obama is prepared to sell. \nU.N. Ambassador Samantha Power said on September 5, 2013: “the United States hopes that the inauguration of President Rouhani creates an opportunity for Iran to act quickly to resolve the international community’s serious concerns about Iran’s nuclear intentions…” Evidently, she is oblivious to the fact that Iran’s intentions are to acquire nuclear weapons. \nAll the president wants, pleaded Power, is a sign. She said: “We would welcome a constructive sign that Iran may be prepared to engage substantively and seriously with the international community. If Iran chooses to do so, then it will find a willing partner in the United States.” \nPresident Obama himself addressed the nation on September 10, 2013 with these words: “Iran must decide whether to ignore international law by building a nuclear weapon, or to take a more peaceful path” – willfully blind to the reality that Iran has decided – to build a bomb. \nAnd that’s not all. Before Syria vividly exposed the pathology of Obama’s UN engagement syndrome, it must have seemed to the White House like a good idea to have the UN host a “high-level meeting on nuclear disarmament” during 2013’s opening days. \nNow nuclear proliferator Rouhani will speak a second time on September 26, 2013. \nThe subject? The elimination of nuclear weapons. \nThe script? Israel and the United States must walk the plank first. \nSpeaking in Jerusalem on September 15, 2013, Secretary Kerry made another unscripted statement that President Obama was quickly forced to realign with his foreign policy. Said Kerry: “We cannot have hollow words in the conduct of international affairs.” To which the president replied: Yes, we can. \nAnne Bayefsky is director of the Touro Institute on Human Rights and the Holocaust. Follow her on Twitter @AnneBayefsky . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}