{"organizations": ["Fox News Latino Paraguay"], "uuid": "0acd32b4253a2e357c16e8da4db8870a68cf100f", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/paraguay%20abortion%20latino.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/news/2015/05/11/paraguay-split-over-whether-pregnant-10-year-old-should-be-allowed-abortion/", "country": "", "title": "Paraguay split over whether pregnant 10-year-old should be allowed abortion | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Paraguay split over whether pregnant 10-year-old should be allowed abortion | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-11T18:30:00.000+03:00", "replies_count": 0, "uuid": "0acd32b4253a2e357c16e8da4db8870a68cf100f"}, "author": "", "url": "http://latino.foxnews.com/latino/news/2015/05/11/paraguay-split-over-whether-pregnant-10-year-old-should-be-allowed-abortion/", "ord_in_thread": 0, "title": "Paraguay split over whether pregnant 10-year-old should be allowed abortion | Fox News Latino", "locations": ["Asuncion", "Paraguay"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gilberto Benitez Zarate"], "text": "Paraguay split over whether pregnant 10-year-old should be allowed abortion Published May 11, 2015 Fox News Latino Gilberto Benitez Zarate hounded by the press after being arrested on May 9, 2015 in Asuncion. NORBERTO DUARTE/AFP/Getty Images \nThe Paraguayan 10-year-old who became pregnant after she was raped by her stepfather has become the center of a debate about abortion in a devoutly Catholic country. \nThe case is dividing a nation over whether the girl should be allowed an abortion – even though she’s five months pregnant. In Paraguay, all abortion is banned in all cases except for when the mother’s life is in danger. \nThe girl’s mother was detained and released after allegedly knowing about the sexual abuse and doing nothing to stop it. The stepfather, who was arrested this weekend after a nationwide manhunt, has denied the allegations. \nParaguay’s Congress has been discussing the issue recently, with some members calling for the country to decriminalize abortion. \n\"The country is divided in two,\" said Msgr. Claudio Gimenez, president of the country's Episcopal Conference, during a homily. \"Some want to legalize abortion, the killing of an innocent who still is in a period of gestation. And for the other side, those who oppose that idea.\" \nSen. Esperanza Martinez, a former health minister, complained that the debate about whether the girl is physically able to bear a child overlooks her own mental and physical wellbeing. \nFor officials, Martinez said during a Senate session, \"This girl became a uterus. She became a birth canal.\" \nAbout 600 girls 14 or under become pregnant each year in the country of 6.8 million people. in In the U.S. thousands of children also give birth each year, according to the Centers for Disease Control. \nAmnesty International has asked authorities to allow an abortion to protect the Paraguayan girl, or at least to create a medical panel to assess her health. But the current health minister, Antonio Barros, told a news conference that the girl was in good health at a Red Cross hospital and that the pregnancy was too advanced. \nPolice Commissioner Luis Rojas said the stepfather had been placed in isolation to prevent other inmates from attacking him. \nIncludes reporting by The Associated Press. \nLike us on Facebook ", "external_links": [], "published": "2015-05-11T18:30:00.000+03:00", "crawled": "2015-05-11T19:38:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}