{"organizations": ["Heritage Foundation", "National Review Institute", "KPCC", "Clear Creek Amana High School", "Iowa Faith and Freedom Coalition", "Grace Church", "U.S. Senate", "CNN", "Hewlett-Packard"], "uuid": "e4b2fa88c627570cc37598a36a40b59ee770e243", "thread": {"site_full": "edition.cnn.com", "main_image": "", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss\r", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/05/05/us/boston-bombing-tsarnaev-court/index.html", "country": "US", "title": "Fiorina: Clinton \"pandering\" on immigration", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Fiorina: Clinton \"pandering\" on immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T03:43:00.000+03:00", "replies_count": 0, "uuid": "a70028e0dfba70d1059b14a36320311850af52be"}, "author": "", "url": "http://edition.cnn.com/2015/05/05/politics/carly-fiorina-hillary-clinton-immigration/index.html", "ord_in_thread": 0, "title": "Fiorina: Clinton \"pandering\" on immigration", "locations": ["Las Vegas", "Waukee", "Nashua", "Washington", "Texas", "Garland", "Moraga", "Iowa", "Los Altos Hills", "New Hampshire", "California", "U.S.", "Tiffin", "Pasadena", "Irvine"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Fiorina", "Kara Tribby", "Erin Burnett", "Mary", "Gabriel Lerner", "Obama", "Carly Fiorina", "Randy Shandobil", "Clinton", "Frank Fiorina", "Carson", "Boxer", "Joe Koberna", "Barbara Boxer"], "text": "Carson and Fiorina jump into 2016 race 02:04 PLAY VIDEO RELATED: Clinton calls for 'path to full and equal citizenship' \"The people who worked hard to earn citizenship the right way are totally committed to this country,\" Fiorina told CNN's Erin Burnett immediately after Clinton spoke extensively about her own immigration platform in Las Vegas. \"I think it isn't fair to say to people who've worked hard to earn the privilege of citizenship that 'Never mind. Never mind that you played by the rules. People who didn't get to have the same privileges that you do'.\" Fiorina, the only female candidate in the Republican field, also swatted away the notion that her general election argument would center only on her common gender with Clinton, though she acknowledged that would neutralize one potential Clinton attack. Carly Fiorina's political career 15 photos Carly Fiorina's political career 15 photos Former business executive Carly Fiorina speaks to guests gathered at the Point of Grace Church for the Iowa Faith and Freedom Coalition 2015 Spring Kickoff on April 25, 2015, in Waukee, Iowa. Hide Caption 1 of 15 Carly Fiorina's political career 15 photos Fiorina prepares to speak to guests gathered at the Point of Grace Church for the Iowa Faith and Freedom Coalition 2015 Spring Kickoff on April 25, 2015, in Waukee, Iowa. Hide Caption 2 of 15 Carly Fiorina's political career 15 photos Fiorina speaks to guests gathered at the Point of Grace Church for the Iowa Faith and Freedom Coalition 2015 Spring Kickoff on April 25, 2015, in Waukee, Iowa. Hide Caption 3 of 15 Carly Fiorina's political career 15 photos Fiorina greets guests at the Johnson County Republicans Spaghetti Dinner at Clear Creek Amana High School on April 24, 2015, in Tiffin, Iowa. Hide Caption 4 of 15 Carly Fiorina's political career 15 photos Fiorina, right, poses for a selfie with Joe Koberna at the Johnson County Republicans Spaghetti Dinner at Clear Creek Amana High School on April 24, 2015, in Tiffin, Iowa. Hide Caption 5 of 15 Carly Fiorina's political career 15 photos Fiorina speaks at the First in the Nation Republican Leadership Summit April 18, 2015, in Nashua, New Hampshire. Hide Caption 6 of 15 Carly Fiorina's political career 15 photos Fiorina speaks during a forum on Capitol Hill March 16, 2015, in Washington. Fiorina spoke about what she calls the War on Women in politics. Hide Caption 7 of 15 Carly Fiorina's political career 15 photos Fiorina delivers remarks at a discussion called \"Welcoming Every Life: Choosing Life after an Unexpected Prenatal Diagnosis, focusing on caring for children with Down Syndrome,\" organized by the Heritage Foundation and the National Review Institute in Washington on January 20, 2015. Hide Caption 8 of 15 Carly Fiorina's political career 15 photos Fiorina concedes defeat to her rival Sen. Barbara Boxer, D-California, during a news conference at her Irvine campaign headquarters on November 3, 2010, in Irvine, California. Hide Caption 9 of 15 Carly Fiorina's political career 15 photos Fiorina, left, watches election results with granddaughter Kara Tribby, 7, in her hotel room at the Hyatt Regency Irvine, November 2, 2010, in Irvine, California. Hide Caption 10 of 15 Carly Fiorina's political career 15 photos Fiorina, left, puts on headphones before participating in a radio debate with incumbent U.S. Sen. Barbara Boxer, D-California, in Washington, as co-moderator Gabriel Lerner, metro editor of La Opinion, does the same at local public-radio affiliate KPCC studios September 29, 2010, in Pasadena, California. Hide Caption 11 of 15 Carly Fiorina's political career 15 photos Fiorina arrives for a news conference after participating in a debate with U.S. Sen. Barbara Boxer, D-California, in a radio debate hosted by La Opinion and public radio station KPCC on September 29, 2010, at the KPCC studios in Pasadena, California. Hide Caption 12 of 15 Carly Fiorina's political career 15 photos Boxer, left, and Fiorina, center, greet moderator Randy Shandobil, right, after a debate on the campus of Saint Mary's College September 1, 2010, in Moraga, California. Hide Caption 13 of 15 Carly Fiorina's political career 15 photos Fiorina, left, smiles with her husband Frank Fiorina, right, after casting their ballots at a polling place June 8, 2010, in Los Altos Hills, California. Hide Caption 14 of 15 Carly Fiorina's political career 15 photos Fiorina greets supporters after announcing her candidacy for U.S. Senate at Earth Friendly Products packaging plant on November 4, 2009, in Garden Grove, California. Hide Caption 15 of 15 EXPAND GALLERY Instead, she pointed to her tenure as chief executive at Hewlett-Packard, saying that experience distinguished her from the \"professional political class.\" But her record there is not all rosy. Fiorina was eventually forced out as CEO, and she oversaw 30,000 job losses as head of the tech giant. \"The only way you succeed as a technology company is by leading, not by lagging,\" Fiorina said, striking back at unflattering media coverage of her ouster and pointing to less covered parts of her accomplishments. And, she added, she took no pleasure in any of those firings. \"The worst thing a CEO can do is to have to say to someone, 'You don't have a job,'\" she said. \"Everyone had to manage through tough times. And I think that's honestly what distinguishes leadership.\" She also weighed in on the attack in Garland, Texas, this week at an event showcasing controversial cartoons of Mohammed. \"It clearly was provocative, just like white supremacists demonstrating is provocative,\" Fiorina said. She offered praise for how Obama characterized the gathering that provoked the violence. \"I'm very pleased that the President came out and called this what it is, which is an attempted act of terror,\" Fiorina said.", "external_links": [], "published": "2015-05-06T03:43:00.000+03:00", "crawled": "2015-05-06T04:08:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}