{"organizations": [], "uuid": "ca0b75b2d3bd04979311e4dce42bca6cc82fc148", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/hannity_obama_051115.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/transcript/2015/05/12/ann-coulter-reacts-to-michelle-obama-taking-on-race-in-graduation-speech/", "country": "US", "title": "Ann Coulter reacts to Michelle Obama taking on race in graduation speech", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Ann Coulter reacts to Michelle Obama taking on race in graduation speech | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "ca0b75b2d3bd04979311e4dce42bca6cc82fc148"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/transcript/2015/05/12/ann-coulter-reacts-to-michelle-obama-taking-on-race-in-graduation-speech/", "ord_in_thread": 0, "title": "Ann Coulter reacts to Michelle Obama taking on race in graduation speech", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 12, 2015 FoxNews.com Email Print\nThis is a rush transcript from \"Hannity,\" May 11, 2015. This copy may not be in its final form and may be updated.\n(BEGIN VIDEO CLIP, TUSKEGEE, ALA., MAY 9)\nFIRST LADY MICHELLE OBAMA: Back when my husband first started campaigning for president, folks had all sorts of questions of me. What kind of first lady would I be? What kinds of issues would I take on? Would I be more like Laura Bush or Hillary Clinton or Nancy Reagan? And the truth is, those same questions would have been posed to any candidate's spouse. That's just the way the process works.\nBut as potentially the first African-American first lady, I was also the focus of another set of questions and speculations, conversations sometimes rooted in the fears and misperceptions of others. Was I too loud or too angry or too emasculating?\n(CHEERS AND APPLAUSE)\n(END VIDEO CLIP)\nHANNITY: That was more of Michelle Obama's commencement address from this weekend. Joining us now with reaction is author, columnist Ann Coulter. How are you?\nANN COULTER, AUTHOR AND COLUMNIST: Fine, thank you. And you?\nHANNITY: How do you react to that just overall?\nCOULTER: Well, I liked your first four guests on it, but now we're going to get the black perspective on this.\nHANNITY: Is that yours?\nCOULTER: That's right.\nHANNITY: With the blond hair? OK.\nCOULTER: I think she's just letting out her Reverend Wright now. You know, a week before this -- I'm really glad you played the segment of her saying it was the first time in her life she's proud of her country, and then she's indignant that people might think she doesn't love her country.\nLast week, she was claiming museums discriminate against -- aren't welcoming to minorities. What do they have to do, be even freer? What are museums doing?\nAnd you know, I think it is what you were saying, this is -- and I wrote a book about this. This is exactly as I predicted. We had finally got rid of a lot of this racial demagoguery in response to the O.J. verdict, and Obama and his enablers and the left-wing media have brought it back in order to gin up and keep a certain segment of the black community angry and voting against Republicans.\nBut I think they've opened up a beast they're not going to be able to control now. And who -- who is victimized the most by the predator class among -- in the black community? Of course, other blacks. Law-abiding blacks don't like this.\nAs I've written before, talk to any prosecutor. They -- the jurors they seek are married blacks or blacks with jobs. This nonsense about, Oh, the peaceful protesters -- no, I want a milk carton ad for, has anyone seen a peaceful protester in Baltimore, as if, you know, workaday blacks are rushing out to protest Freddie Gray. No, they aren't!\nHANNITY: Let's go back...\nCOULTER: This all comes from illegitimacy. It is to cover up their problem in subsidizing illegitimacy, and that is the most unfortunate part of this. By keep -- by harping on white racism, white racism, white racism, no one notices, oh, the black illegitimacy rate before the Great Society programs was about 20 percent...\nHANNITY: Much lower. Much lower.\nCOULTER: Twenty percent! It's above 70 percent now. And that just breeds a predator class. In my book, \"Mugged\" I Quote: d a liberal institute, the Urban Institute. They said if you take out the factor of illegitimacy, the defense in the black and white and black crime rate disappears. This is all a question of illegitimacy creating a predator class that mostly is attacking hard-working black people with jobs.\nHANNITY: The comment that she made -- not just once, she made it a few times, which is that, you know, For the first time in my adult life, I'm proud of my country, this is...\n(LAUGHTER)\nHANNITY: Wow. I can't believe it. But I feel in many ways that this -- I got the sense, this is my own interpretation, this is built-up frustration. And you're right, Reverend Wright, you know, being friends with Bill Ayers and Bernadine Dohrn, fairly radical people, and I also got the sense that there's no great love or appreciation for us now. They're having a tough second term, like most presidents do.\nCOULTER: Right.\nHANNITY: And it seems...\nCOULTER: Distract from it all by constantly crying racism.\nHANNITY: Yes.\nCOULTER: I mean, yes, America does owe -- owe black America for slavery, for the Democratic policies of Jim Crow. I think we're -- we've -- we're making it up now. When, you know, you're getting admitted to Princeton when you can't read, is that enough yet? That is...\n(CROSSTALK)\nHANNITY: In other words, there are different standards, but you have to read to get into Princeton. OK. I get your point.\nCOULTER: The Great Society programs are what destroyed the black community, and the left doesn't want us to notice that.\nHANNITY: There's now $40 trillion -- the amount of money we're talking about that has been spent -- here's an interesting number that we learned in Baltimore, $1.8 billion in Obama stimulus money went to the city of Baltimore and obviously didn't help Baltimore.\nCOULTER: Right. And as has been reported on FOX, frequently, what, it's, like, the second or third most spent on the public schools.\nHANNITY: Right.\nCOULTER: No, this doesn't have to do with more government spending. It doesn't have to do with white racism.\nHANNITY: But that's where Obama goes.\nCOULTER: Right.\nHANNITY: That's where he goes. Now she is now come out with a -- this was a speech that was destined -- she wanted to make this statement, and she made it in a forceful way. What is the politics...\nCOULTER: She has been saying this forever, though!\nHANNITY: No, not like this.\nCOULTER: Her Princeton thesis was on, you know, how blacks were treated at Princeton. This -- she's a one-note Charlie!\nHANNITY: She's been hiding her views in many ways, not being this outspoken, but now they've decided -- between Ferguson and Baltimore and Trayvon and Cambridge police, he is taking on all these high-profile racial cases.\nCOULTER: Right...\n(CROSSTALK)\nHANNITY: ... and being wrong.\nCOULTER: Right. Right.\nHANNITY: OK. Now she's decided to make a statement on the heels of him making a statement about Baltimore.\nCOULTER: Right.\nHANNITY: Why are they doing it now?\nCOULTER: Well, I think they have been doing it all along, more the left has been doing it. I mean...\nHANNITY: But not them directly.\nCOULTER: Not as much. No, that's right. It was mostly on Obama's behalf. But you're right. There are the failures of his administration. And of course, the other thing the left -- by which I mean the entire non- FOX media -- is pushing for here is to repeal the crime-fighting policies that are the greatest public policy success in our lifetimes. You remember New York pre-Giuliani. I remember it.\nHANNITY: Absolutely.\nCOULTER: Oh, my gosh. This nonsense about, Oh, so many blacks are in prison. Well, how did they get there? In addition to the peaceful Baltimore protester I want to put on a milk carton, \"Have you seen this,\" I want to see the innocent person in prison!\nHANNITY: Here's the sad thing. If you look at the average, it's about 123 blacks that are killed by cops every year. There are thousands of examples, nobody knows the names of people, black-on-black...\nCOULTER: Right.\nHANNITY: ... crime, murdered, including children that he never talks about!\nCOULTER: Right. Right.\nHANNITY: Why not?\nCOULTER: No, and in fact...\nHANNITY: Those people's lives are just as important...\nCOULTER: Right.\nHANNITY: ... as Michael Brown and Freddie Gray and Trayvon Martin.\nCOULTER: This is why Pat Buchanan is so great. He had a column in response to the Baltimore thing saying if Freddie Gray had been beaten up, mugged and killed by another black in the streets of Baltimore...\nHANNITY: We'd never know his name.\nCOULTER: ... we wouldn't know his name.\nHANNITY: That's sad!\nCOULTER: Yes.\nHANNITY: Who do you like for president?\nCOULTER: I would like Mitt Romney with Scott Walker...\nHANNITY: OK, Mitt Romney's not running. Keep going.\nHANNITY: I think he's going to jump back in when...\nHANNITY: He's not going to jump back in.\nCOULTER: The only possible candidate...\nHANNITY: He's not going to jump back in.\nCOULTER: ... who isn't a joke right now is Scott Walker. And I would rather have Mitt Romney answering questions about the Fed and trade with China. And you'll see. Ann's going to be right. You'll apologize.\nHANNITY: Ann is -- you're going to be wrong! I will bet you any amount of money he's not getting in!\nCOULTER: We'll see.\nHANNITY: That's your...\n(LAUGHTER)\nHANNITY: Is that -- you're living in the past that much?\nCOULTER: I think Republican primary voters will realize, Oh, my gosh, we were lied to by idiots who said they were speaking on our behalf. Mitt Romney was not only the most articulate but the most conservative candidate we ever had. I love Scott Walker, but I would really prefer for him to be Mitt Romney's vice president for a few years.\nHANNITY: All right, so you're not going to get your way. You going to support whoever the nominee is?\nCOULTER: If it's Scott Walker.\nHANNITY: And if it's somebody else?\nCOULTER: I'll take a long vacation.\n(LAUGHTER)\nHANNITY: You're that rigid now?\nCOULTER: It's not that I'm that rigid. I'm sick of fighting for losing causes! If it's not Scott Walker or Mitt Romney, I think we lose and welcome President Hillary.\nHANNITY: I don't think she's going to win. Not this time. All right...\nCOULTER: Well, as long as we run Mitt Romney with Scott Walker.\nHANNITY: What's the title of your new book, can you say?\nCOULTER: Oh, I thank you for asking, and I'll be back here...\nHANNITY: What's the title?\nCOULTER: \"Adios, America: The Left's Plan to Turn Our Country Into a Third\"...\nHANNITY: All right, don't say any more.\nCOULTER: ... \"World Hellhole,\" and I'm -- my first interview...\nHANNITY: \"A Third World Hellhole\"?\nCOULTER: Hellhole -- will be right here on June 1st.\nHANNITY: I can see...\nCOULTER: But I'll see you again before that.\nHANNITY: ... you've decided to take a step back and be less controversial.\nCOULTER: Exactly!\n(LAUGHTER)\nHANNITY: All right, Ann Coulter, thank you.\nContent and Programming Copyright 2015 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2015 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.\nhannity Hannity , hosted by Sean Hannity, airs on Weekdays at 10PM ET on Fox News Channel.\nMore on this show Advertisement\nAdvertisement", "external_links": [], "published": "2015-05-12T03:00:00.000+03:00", "crawled": "2015-05-13T01:28:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}