{"organizations": [], "uuid": "88d94d128ee9de8dd0105ab51670163b5b256730", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2951080/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/05/14/obama-lideres-golfo-persico_n_7283114.html", "country": "", "title": "¿Qué intenta Obama con los líderes del Golfo Pérsico?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "¿Qué intenta Obama con los líderes del Golfo Pérsico?", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T20:25:00.000+03:00", "replies_count": 0, "uuid": "88d94d128ee9de8dd0105ab51670163b5b256730"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/05/14/obama-lideres-golfo-persico_n_7283114.html", "ord_in_thread": 0, "title": "¿Qué intenta Obama con los líderes del Golfo Pérsico?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "reddit \nEl conflicto de Yemen y el papel que juega Estados Unidos en la seguridad del Medio Oriente figuran entre los temas de conversación entre Obama y los líderes del Golfo Pérsico . \nEste miércoles 13 de mayo, el presidente estadounidense sostuvo un encuentro en la Casa Blanca con los mandatarios de Baréin, Kuwait, Omán, Catar, Arabia Saudita y Emiratos Árabes Unidos. \nLa agenda de trabajo de este jueves se trasladó a la residencia presidencial de Camp David, en Marylan, de acuerdo con un comunicado enviado a los medios de comunicación por el vocero de la Casa Blanca, Josh Earnest. \nSegún los expertos, con esta cumbre, Obama intenta tranquilizar a los líderes del Golfo acerca de su seguridad en la región en medio de un posible acuerdo nuclear entre Occidente e Irán . \nSegún el analista internacional, Wilfredo Amr Ruiz, en entrevista con el programa \"Prohibido callarse\" , el reto de Obama es difícil pues muchos países árabes han cambiado su postura en relación con Estados Unidos. \n\"Ese amigo y aliado incondicional [Arabia Saudita] esperando la anuencia y el permiso entre comillas de Estados Unidos para cualquier acción radical política ya no es así desde que está el nuevo rey saudí [...] Vemos que ha cambiado las políticas de su predecesor, como por ejemplo estos ataques militares, con solo unas horas de notificación previa a Estados Unidos, no lo hubiera hecho el anterior rey como ha sido con el caso de Yemen. Le han dado un portazo en la cara al presidente Obama. Muchos monarcas del Medio Oriente han enviado a delegaciones que se envían a casos de funerales, de protocolo, y no delegaciones con realmente el poder de decisión\", dijo Amr Ruiz. Pool/ABACA USA El presidente Barack Obama le da la bienvenida a Mohamed bin Zayed Al Nayhan, príncipe heredero de Abu Dhabi, este miércoles 13 de marzo en la Casa Blanca, a raíz de la cumbre convocada por el mandatario estadounidense en Camp David. Pool/ABACA USA Obama con Salman bin Hamad Al-Khalifa, príncipe coronado del Reino de Bahréin. Douliery Olivier/ABACA USA Obama espera por los líderes del Golfo Pérsico para la cumbre en Camp David. Douliery Olivier/ABACA USA Obama en la foto oficial con su alteza Sheikh Tameem bin Hamad Al Thani, Emir de Catar. Douliery Olivier/ABACA USA El presidente Barack Obama con el príncipe de Arabia Saudita, Mohammed bin Nayef bin Abdulaziz Al Saud. Douliery Olivier/ABACA USA Obama con Salman bin Hamad Al-Khalifa, príncipe coronado del Reino de Bahréin. Más: ", "external_links": [], "published": "2015-05-14T20:25:00.000+03:00", "crawled": "2015-05-14T23:05:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}