{"organizations": ["NSA"], "uuid": "44b502349885dcba30998859c2b14cde3c24e8c9", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/06/07/progressives-must-hold-obama-accountable-for-nsa-phone-records-collection/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422574319776.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/07/progressives-must-hold-obama-accountable-for-nsa-phone-records-collection.html", "country": "", "title": "Progressives must hold Obama accountable for NSA phone spying | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Progressives must hold Obama accountable for NSA phone spying | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "44b502349885dcba30998859c2b14cde3c24e8c9"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/07/progressives-must-hold-obama-accountable-for-nsa-phone-records-collection.html", "ord_in_thread": 0, "title": "Progressives must hold Obama accountable for NSA phone spying | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "\nThe problem with hyper-partisanship is that those on both sides constantly defend their own camp and attack the other with little regard for history, logic or ideology. \nRepublicans condemn the individual mandate in health care reform while Democrats rationalize drone warfare. \nConservatives who ran up the deficit under Republican presidents call deficit spending reckless when led by Democrats. And progressives who in previous decades were leading skeptics about the “big brother” power of government cow in complacency to defend the creeping and creepy expansion of government intrusion in our lives. \nConservatives, progressives, Democrats, Republicans — we’ve all fallen into the trap of turning a blind eye to our own side’s abuses while fairly blindly hurling accusations at the other. This stops now. \nWednesday night, hours after it was revealed that the National Security Agency has been collecting phone records of a large swath of the American public for apparently at least seven years, the Progressive Change Campaign Committee launched a petition to immediately investigate and release all its findings to the public. \nI whole-heartedly back that call. Those of us who opposed the strategy and scope of the Patriot Act when it originated under President Bush must just as firmly denounce it use and abuse under President Obama. \nNot all Democrats have remained silent. I, and many others, have already called recent developments, particularly the secret subpoenaing of broad records from AP and Fox News reporters, deeply disturbing. And the fantastic reporter Glenn Greenwald of the Guardian, who broke the story about our government collecting Verizon phone records and Internet data, is a progressive. \nNor should we ignore that, in a letter to Attorney General Eric Holder last year, Democratic Senators Mark Udall (Colorado) and Ron Wyden (Oregon) wrote , “We believe most Americans would be stunned to learn the details of. . .these secret court opinions. As we see it, there is now a significant gap between what most Americans think the law allows and what the government secretly claims the law allows.” Udall told the Denver Post Thursday that it did everything short of leaking classified information” to bring attention to what the NSA was doing. \nBut the willingness to critique President Obama has often been understandably tempered by a fear of playing into the Republican desire to blow up concerns into controversies and bring down the Obama administration by any means necessary. \nFlagrant overreach laced with conspiracy theories, from Fast and Furious to Benghazi, reveal that Republicans are no longer invested in leading the role of legitimate oversight but the circus act of political destruction. \nThose who generally support President Obama’s ideas and objectives are understandably wary to simultaneously criticize the president when he falls short on our ideals, lest our critiques be used as extra bricks in the partisan campaign to sink his ship. \nAll of these concerns are legitimate. I, and no one on the left, wants our substantive critiques of the Obama administration to inadvertently play into the viciously anti-Obama agenda of the right which is fueled by a deep hatred for the president that has deeper and darker origins than policy differences alone. \nYet still, there are moments where we are called on to be citizens first, and partisans second. \nProgressives don’t want to bring down the president, but we do want to hold him accountable. And it is the job of we, the people, to hold our government accountable. \nThe recent revelations about the scale and scope of government surveillance on the American people should concern all of us, Democrats and Republicans alike. \nThe fact that the collection of vast phone records that apparently began under President Bush and was continued by President Obama may be a sufficiently bipartisan offense to coalesce a bipartisan opposition. Let’s hope that Americans of all political stripes can join together to demand transparency and accountability from our government and ensure that the desire to protect our safety is never a justification for attacking our liberties. \nSally Kohn joined the Fox News Channel in 2012 as a contributor. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}