{"organizations": ["Fox News Benghazi", "IRS", "Facebook", "AP", "Twitter"], "uuid": "f3045023af553b79dd3e13182b9f9a860de7997e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/051413/0/0/ff_johnson_051413.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/14/benghazi-irs-ap-scandals-will-buck-ever-stop-with-obama.html", "country": "", "title": "Benghazi, IRS, AP scandals -- will buck ever stop with Obama? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Benghazi, IRS, AP scandals -- will buck ever stop with Obama? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "f3045023af553b79dd3e13182b9f9a860de7997e"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/14/benghazi-irs-ap-scandals-will-buck-ever-stop-with-obama.html", "ord_in_thread": 0, "title": "Benghazi, IRS, AP scandals -- will buck ever stop with Obama? | Fox News", "locations": ["Benghazi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Benghazi, IRS, AP scandals -- will buck ever stop with Obama? Published May 14, 2013 Facebook 0 Twitter 0 livefyre Email Print \nThe first question for White House spokesman Jay Carney at Tuesday's press briefing went right to the heart of the growing crisis facing President Obama: \nIn the matters of the Benghazi terror attack, the IRS targeting conservative groups, the Justice Department going after AP phone records, “…doesn’t responsibility for setting tone, setting direction ultimately rest with the president?” \nThat question of “where the buck stops” harkens back to another Democrat who occupied the Oval Office some 60 years ago, “Give ‘em Hell” Harry Truman but the answer is as relevant today. \n[pullquote] \nBenghazi may not be \"Obama's Watergate,\" as Sen. Lindsay Graham has called it, but what we have is an administration that is adrift and leaking more controversy and unanswered questions every day. More On This... Benghazi, IRS -- son of Watergate? \nOn Libya, a detailed examination of the record shows that the White House has had no consistent message on what happened on September 11. In fact, they changed their message from day to day -- and it's clear that the administration's actions in the days and weeks after the Benghazi tragedy was all political maneuvering. \nThe White House has been caught not telling the full story, and modifying the narrative for political ends. \nBut that’s just a piece of the troubling picture emerging from the West Wing. \nWe have Attorney General Eric Holder -- he who managed to dodge full responsibility for the “Fast & Furious” gun-walking debacle in the president's first term -- revealing Tuesday that he had recused himself from the investigation into Justice Department gathering of phone records from more than “20 separate telephone lines assigned to the AP and its journalists in April and May of 2012.” \nThe bipartisan response to Monday's disturbing challenge to press freedom was swift. Speaker Boehner's office said Monday, “they better have a damned good explanation.” And Senate Judiciary Committee Chairman Patrick Leahy, a Democrat, acknowledge he’s “very troubled” by the allegations. \nThen there is the very serious matter of the IRS singling out conservative Tea Party and Patriot groups, among others, for special scrutiny when they sought to apply for tax-exempt status. The president says he's “outraged” -- but also said Monday that he knows nothing about this news. \nBut “newly obtained documents” show the current IRS chief knew about the agency's targeting of Tea Party groups as early as May 2012, and other officials in Washington were clued in more than a year before tha t, as the scandal continued to spread. Perhaps even more telling is White House spokesman Jay Carney’s acknowledgement to reporters Tuesday that the administration is getting its information on these matters from news reports. \nAgain, who’s in charge here? \nAnd finally there's what appears, from the public record that has emerged so far, to be the prevarication, without any clear explanation, from the administration on Benghazi: \nOn November 28th, 2012, Carney stated that the State Department had only changed one word of Susan Rice's talking points -- we now know this not to be the case. We also know that within hours of the attack, the White House, the State Department and the FBI received emails saying that an Islamic group had claimed credit -- even going so far as to identify Ansar al-Sharia as the group. \nThis epidemic of evasions, and most likely falsehoods, only raises more questions. The White House, the State Department, Hillary Clinton and any additional officials involved have committed a serious breach of trust with regard to the American people, and moreover, their actions are an insult to the American citizens who died in Libya that night, on the 11th anniversary of the 9/11 attacks. \nWhat’s next? \nJust months into his final four years in office, President Obama is facing a credibility crisis, one that threatens his fundamental abilities to govern. \nCongress needs to get to the bottom of not only Benghazi, but these other scandals so that the American people can regain some semblance of trust in a government that is seemingly run amok. \nPerhaps it's time for the president to gather his inner circle to lay down the law -- clean house if and when necessary -- and to assure the American people that regardless of where these investigations may lead, ultimately: “The buck stops here.” ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}