{"organizations": ["GOP", "Tea Party"], "uuid": "e6beae13b6202436d4fc3a24fcf52e11a2ca8f59", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/ryanpaul_012015gn.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/homenews/house/242992-gop-turns-to-tea-party-to-win-trade-powers-for-obama", "country": "", "title": "GOP turns to Tea Party to win trade powers for Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "GOP turns to Tea Party to win trade powers for Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-24T14:20:00.000+03:00", "replies_count": 0, "uuid": "e6beae13b6202436d4fc3a24fcf52e11a2ca8f59"}, "author": "", "url": "http://thehill.com/homenews/house/242992-gop-turns-to-tea-party-to-win-trade-powers-for-obama", "ord_in_thread": 0, "title": "GOP turns to Tea Party to win trade powers for Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scott Wong", "Obama Greg Nash", "Obama"], "text": "GOP turns to Tea Party to win trade powers for Obama Greg Nash By Scott Wong - 05/24/15 06:00 AM EDT \nHouse Ways and Means Chairman Paul Ryan (R-Wis.) and GOP leaders have turned to some unlikely allies to rally support for a key trade bill: Tea-Party conservatives, including some prominent names from the raucous House Freedom Caucus. \nSpeaker John Boehner (R-Ohio) recently tapped Rep. Tom McClintock to give the weekly GOP address , in which the conservative Californian declared: “Trade means prosperity.” ADVERTISEMENT At the monthly “Conversations with Conservatives” event, Rep. Tim Huelskamp (R-Kansas) informed his colleagues he’s an unequivocal “yes” on granting President Obama so-called “fast-track” trade powers.\nAnd both McClintock and Rep. Matt Salmon (R-Ariz.) huddled with reporters in a leadership office last week to talk up the virtues of legislation to help pass Obama’s trade agenda. \nSalmon, typically a source of heartburn for leadership, denounced some of the conservative “Pat Buchananites” he runs with as “protectionists.” Those who warn Obama can’t be trusted on trade are making a weak argument, he said, because Congress has given Republican presidents the same authority. \nFinally, Salmon pointedly challenged critics who’ve complained about the secrecy of the process to head down to a classified briefing room in the Capitol’s basement to read details of a major 12-nation trade deal, known as the Trans-Pacific Partnership (TPP). \n“I’ve read every jot and tittle … 123 pages,” Salmon told reporters during the press briefing, while seated next to House GOP Conference Chairwoman Cathy McMorris Rodgers (R-Wash.), the No. 4 leader. “To go out there and rail against it when you haven’t even looked at it is insane.” \nSalmon, who chairs the Foreign Affairs subcommittee on Asia and the Pacific, didn’t stop there. In a closed-door GOP conference meeting the following morning, he was the first one to step to the open microphone, making an impassioned plea in support of fast track and the trade deal as Ryan looked on. \n“I can't believe Republicans — the party of free trade — are coming out against this,” Salmon told his colleagues, according to sources in the room. \nThere are just as many House conservatives who have their doubts about handing President Obama broader trade powers, referred to in Washington parlance as Trade Promotion Authority or TPA. \nBut the aggressive lobbying effort by these conservative lawmakers is seen as a positive sign for TPA following weeks of chatter that the bill was on life support in the lower chamber. \n“I’m as conservative as any of them. Salmon’s a great spokesman, I’m a great spokesman. McClintock’s a great spokesman. That’s the reason I think we’re gonna see it pass,” said Rep. Roger Williams (R-Texas), a member of Majority Whip Steve Scalise’s GOP vote-counting team who’s bullish that TPA will be sent to Obama’s desk. “I think it looks good.” \nAfter clearing several tough procedural hurdles, the fast-track bill is slated to pass out of the Senate this weekend. But the House won’t take up the measure until early June, after the chamber returns from its weeklong Memorial Day recess. \nTPA specifically would give Obama the ability to send trade pacts to Congress for fast-track approval, meaning lawmakers could cast an up-or-down vote but not amend the agreement. \nScalise’s whip team won’t disclose how many of the 245 possible GOP votes they’ve locked up so far. But one leadership ally, Rep. Charlie Dent (R-Pa.), told The Hill the target is roughly 190 Republican votes and 30 Democratic votes. \n“Every week, we’re starting to move in the right direction and pick up a lot of these members we normally don’t get for big initiatives,” said a GOP aide who is familiar with the TPA whip count. “Even if there is opposition from the Tea Party/Freedom Caucus side, it has been relatively muted.” \nPart of the reason there hasn’t been more organized, vocal conservative opposition to the trade bill is because Republicans typically are big boosters of free-trade, open-market principles. So for many GOP critics, coming out against the trade legislation has been a tricky endeavor. \n“I’m a free trade guy,” Rep. Mark Meadows (R-N.C.), a Freedom Caucus member, said before explaining that he’s still “undecided” on TPA as he works to add trade-preference language for Israel back into the bill. \nWhile Freedom Reps. John Fleming (R-La.) and Dave Brat (R-Va.) are firmly opposed to TPA, others members — including Chairman Jim Jordan (R-Ohio) and Reps. Raul Labrador (R-Idaho), Ken Buck (R-Colo.) and Justin Amash (R-Mich.) — say they are “leaning no.” \n“I have supported all previous trade agreements we voted on in the House. I will support future trade agreements ... but TPA is a process bill and I want to have a good grasp of the process before I would support it,” Amash told The Hill. “I am a ‘lean no’ because I don’t have enough information about the process, but I am not a firm no.” \nThe split among conservatives is a good omen for Ryan and GOP leaders, who likely wouldn’t be able to move the bill if there was united Tea-Party opposition in the conference. \nThe divide was evident at last week’s “Conversations with Conservatives” discussion, where Huelskamp and Rep. Thomas Massie (R-Ky.) recalled how they recently sat together in a classified briefing room, poring over sections of the trade deal Obama is negotiating with 11 other Pacific Rim nations. \nThey had to check their cell phones at the door, and they couldn’t take any notes. When they emerged from the belly of the Capitol, Huelskamp was a “yes,” Massie a “lean no.” \n“It’s very hard to interpret for us when we’re not allowed to take notes, reference other agreements that we don’t have with us,” Massie said about the security measures taken to ensure the trade deal remains a secret. “It’s a lot of effort for one congressman to understand what’s in that room and what’s in that document without being well versed in the trade agreements.” \nAfter being briefly interrupted by a vote series, Huelskamp said he was finally able to finish reading details of the trade pact. And unlike Massie, he liked what he saw. \n“I think it promotes markets, promotes less government,” said Huelskamp, whose central and western Kansas district is rich in agriculture. “I certainly represent an area that is willing and able to trade around the world. \n“The safeguards are there, the protections are there. … So I am a ‘yes.’” \n", "external_links": [], "published": "2015-05-24T14:20:00.000+03:00", "crawled": "2015-05-24T14:20:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}