{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "9f3931192ae76e7c759e1489e8213386d47bc950", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/052313/0/0/052313_sb_security_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/23/obama-thinks-won-war-on-terror-and-it-time-to-move-on.html", "country": "", "title": "Obama thinks we won the War on Terror and it's time to move on | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama thinks we won the War on Terror and it's time to move on | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "9f3931192ae76e7c759e1489e8213386d47bc950"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/23/obama-thinks-won-war-on-terror-and-it-time-to-move-on.html", "ord_in_thread": 0, "title": "Obama thinks we won the War on Terror and it's time to move on | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama delivered what was billed by the White House as a “major” speech on national security Thursday at the historic National Defense University. In short, Mr. Obama thinks the War on Terror is over, and he won it. There may be a few final details to mop about, but it's time to move on to more important things. The speech was typical of Mr. Obama: Open with a broad sweep of history from the beginning of the republic to today. \nFollow that with a laundry list of all the great things he has done to reverse the bad things his predecessor did. \nBrush failures under the rug, blame them on others, or marks them as the inevitable course of history. \n[pullquote] \nThen finish with uplifting rhetoric, adding in a dash about the greatness of America. More On This... Obama defends US drone program, renews push to close Guantanamo \nYou walk away feeling you’ve been at a great meal but are somehow still hungry. The problem is there wasn’t much meat on those bones. The only new thing the president did discuss was his drone policy and targeted killings. Even then, he didn't clarify much. \nOn the one hand, the president said drone strikes have killed “dozens of skilled Al Qaeda” fighters and taken them off the battlefield. Mr. Obama claims drone strikes are legal, effective and save American lives since we don’t have to put our boots on the ground. From that you'd assume drone killings are here to stay -- we kill bad guys at no risk to ourselves. But on the other hand the president wants to limit their use --and turn to them only if there is no chance of capturing the terrorists, and only if no civilians will be hurt. Under those circumstances it's hard to see us ever using drone strikes again. Frankly, it's a muddle. If the drone strikes have been as effective as Mr. Obama claims, why are there more terrorists in more places than before as has Al Qaeda and its affiliates have set up shop in new countries? And if Al Qaeda has spread, why limit the drone strikes? \nIt’s as if the more drone strikes we have, the larger Al Qaeda grows. Maybe they’re not connected, but it certainly adds more confusion than ever about Team Obama's drone policy. As for the rest of the speech, there was nothing new. He gave the boilerplate Obama talking points. \n- He ended the Iraq War and is winding down in Afghanistan. \n- He killed Usama bin Laden, and decimated Al Qaeda's core leadership. \n- He wants to try terrorists in civilian courts and close Gitmo, but Congress won't let him. \n- He has repaired America’s alliances and restored our standing in the world. America is safer because of Obama. So why did Mr. Obama give this speech? And why did the White House bill it as a major foreign policy address, the first one of his second term? \nWhy give a speech that focused on smaller issues like drone strikes and Gitmo, but avoided completely the bigger issues of nuclear proliferation, Iran and the Middle East? Maybe Thursday's speech wasn't so much about foreign policy as domestic politics. Maybe it was an attempt to divert attention away from the scandals of Benghazi, the IRS, the targeting of the AP and now Fox News that have dominated the headlines and threaten to derail Mr. Obama's second term agenda. \nIt wasn’t much of a success as a foreign policy speech. But it was a complete failure as a political diversion. \nKathleen Troia \"K.T.\" McFarland is a Fox News National Security Analyst and host of FoxNews.com's \"DefCon 3.\" She served in national security posts in the Nixon, Ford and Reagan administrations. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:19:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}