{"organizations": ["Stop Criticism Immigration Agency", "Immigration Agency", "Karnes County Residential Center"], "uuid": "44071c35790f07c48b2bd88f5e33a03e63f5c87e", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2948780/images/o-KARNES-DETENTION-FACILITY-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/13/immigration-family-detention_n_7279572.html", "country": "", "title": "Immigration Agency's New Family Detention Rules Fail To Stop Criticism", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Immigration Agency's New Family Detention Rules Fail To Stop Criticism", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T07:26:00.000+03:00", "replies_count": 0, "uuid": "44071c35790f07c48b2bd88f5e33a03e63f5c87e"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/13/immigration-family-detention_n_7279572.html", "ord_in_thread": 0, "title": "Immigration Agency's New Family Detention Rules Fail To Stop Criticism", "locations": ["U.S.", "Texas", "Karnes City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Drew Anthony Smith", "Drew Anthony"], "text": "Immigration Agency's New Family Detention Rules Fail To Stop Criticism Posted: Updated: 2 hours ago The Karnes County Residential Center is viewed on July 31, 2014 in Karnes City, Texas. The civil facility is being used by U.S. Immigration and Customs Enforcement (ICE) to accomodate the increase of adults with children who have been apprehended illegally crossing the Southwest border. (Photo by Drew Anthony Smith/Getty Images) | Drew Anthony Smith via Getty Images reddit \nWASHINGTON -- Immigration and Customs Enforcement attempted on Wednesday to mitigate growing complaints over its detention of women and children. But critics of the policy, including House Democrats, weren't satisfied. \nICE, part of the Department of Homeland Security, announced new standards for family detention, promising to review people held longer than 90 days and to quit using detention as a deterrent. Family detention has ballooned over the past year because of a surge in women and children crossing the border illegally. \nReps. Luis Gutierrez (D-Ill.), Lucille Roybal-Allard (D-Calif.), and Zoe Lofgren (D-Calif.) said in a statement that they appreciated the ICE efforts. But the only good response, they said, would be discontinuing the practice of \"jailing children and women.\" \n\"Unfortunately, today's plan states that DHS will continue detaining women and children, and only consider methods of making the facilities better and more humane,\" the representatives said. \"The United States government should not be in the business of holding mothers and children in detention, no matter how nice the facilities or how many stakeholder meetings the government has.\" \nAntonio M. Ginatta, advocacy director for the U.S. program at Human Rights Watch, said he was glad ICE dropped \"its argument that it has the right to detain one family to deter the next.\" But he called the other new standards \"a thin gruel.\" \n\"It's all absurd,\" Ginatta said. \"There's only one right step here: for ICE to admit its mistake and put an end to the detention of families once and for all.\" \nThe government has significantly increased its use of detention for families since a surge last year in undocumented immigrants apprehended crossing the border. Large numbers of unaccompanied minors who crossed drew most of the attention, but many family units of mostly women and children also were apprehended. Many of those women said they were fleeing abuse and violence in Central America, and are seeking asylum in the U.S. \nDHS opened two new family detention facilities in Texas -- one in Karnes City and another in Dilley -- to supplement a much smaller existing center in Leesport, Pennsylvania. The Karnes and Dilley facilities combined can hold about 3,000 people, although they are not yet full. \nExpanding family detention was a change in policy for President Barack Obama, who in 2009 shut down the T. Don Hutto Residential Center , a prison-turned-family detention center where a number of abuses were reported. \nImmigration advocates have argued that women and children who have faced traumatic experiences in their home countries should not be locked up, and instead should be released on bond as their deportation cases move forward. This week, 188 organizations focused on civil rights and human rights signed a letter to Obama, asking him to end family detention except under extreme circumstances. \n\"The writing on the wall is clear -- DHS should not detain children and their parents in jail-like facilities,\" the letter reads. \"We urge you to undo the harsh family detention policies set in place in summer 2014 and implement a more just and humane approach. Family detention should not be your legacy. Now is the time to end it once and for all.\" \nTwo lawsuits aimed at ending family detention have been filed. A judge issued a preliminary injunction in February against ICE's detention of asylum-seekers as a deterrent to other would-be unauthorized immigrants. The government is working to ensure the facilities meet standards for holding children after a separate federal court ruling. \nICE says in the new standards announced Wednesday that it will work with stakeholders and experts to hear concerns about the facilities and look into ways to improve them for detainees. The agency also promised to promote access to attorneys, who have complained that ICE is making it harder to help women and children inside. \n\"While we routinely review and evaluate our facilities to ensure that we are providing the level of care required by our Family Residential Standards, we understand the unique and sensitive nature of detaining families and we are committed to maintaining the optimal level of care,\" ICE Director Sarah R. Saldaña said in a statement. \"The measures ICE is announcing reaffirm that understanding and our commitment to ensuring all individuals in our custody are held and treated in a safe, secure, and humane manner.” Also on HuffPost: ", "external_links": [], "published": "2015-05-14T07:26:00.000+03:00", "crawled": "2015-05-14T07:27:45.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}