{"organizations": ["Pentagon", "Senate", "Republican", "Congress", "Senate Armed Services Committee", "House", "Washington Post"], "uuid": "93904a8afbce686f3f7995f48b5147aa79ccd8e8", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/guantanamobay_prison_040914getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/241217-dem-senators-push-obama-to-transfer-gitmo-detainees", "country": "", "title": "Dems push Obama to transfer Gitmo detainees | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Dems push Obama to transfer Gitmo detainees | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "93904a8afbce686f3f7995f48b5147aa79ccd8e8"}, "author": "", "url": "http://thehill.com/policy/defense/241217-dem-senators-push-obama-to-transfer-gitmo-detainees", "ord_in_thread": 0, "title": "Dems push Obama to transfer Gitmo detainees | TheHill", "locations": ["Cuba", "Calif.", "Ill.", "U.S.", "Guantanamo", "Vt.", "U.S", "Guantanamo Bay"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dick Durbin", "Kristina Wong", "Patrick Leahy", "Dianne Feinstein", "Obama"], "text": "Dems push Obama to transfer Gitmo detainees Getty Images By Kristina Wong - 05/06/15 01:46 PM EDT Three Democratic senators are urging President Obama to transfer more detainees from the U.S. military prison at Guantanamo Bay, Cuba, warning that \"time is of essence\" with only 20 more months left in his presidency. “Although onerous restrictions imposed by Congress have hindered efforts to close the detention facility, we urge you to immediately take meaningful action in order to end this unfortunate chapter in our nation’s history before you leave office,\" wrote Sens. Patrick Leahy (Vt.), Dianne Feinstein (Calif.), and Dick Durbin (Ill.) in a May 5 letter to the president. The warning comes as Congress is drafting its 2016 defense policy bill, which could hamper the administration's ability to shut down the facility and prevent the president from fulfilling a key campaign pledge. ADVERTISEMENT The Republican-controlled House next week is expected to vote on its bill, which would restore tougher requirements for any detainee release, and ban the transfer of any detainees to the U.S. or to any \"combat zone.\" The Senate Armed Services Committee will draft and vote on its version next week, before sending it to the full Senate for a vote sometime during the summer. It will likely include restrictions similar to those in a bill proposed earlier this year by some of the panel's Republican members. The facility currently has 122 detainees, nearly half of whom have been cleared for transfer. The Washington Post reported last month that Pentagon officials plan to release up to 10 prisoners, possibly in June, and all those approved for transfer by the end of 2015. The senators, who have long supported its closure, argued that the prison continues to be a \"propaganda tool for terrorists and harms our national security.\" They also argued that the costs of keeping the facility open for just 122 detainees was too high and amounted to “reckless fiscal policy.” They estimated costs as high as $3.3 million per year per detainee. They argued that it would only cost $79,000 to house a detainee at a federal Supermax prison in the U.S. They also pointed out that the rate of confirmed and suspected cases of recidivism has lowered since Obama took office. “This marked improvement over the record of the prior administration demonstrates that it is possible to transfer detainees while also protecting our national security,” they said. They also reminded the president that since Jan. 15, there have been no transfers, something they said was an “especially troubling lapse in light of how little time is left in your administration.” “Transferring the 57 cleared detainees as quickly as possible will be a momentous step toward closing Guantanamo,” they said. — Updated 2:15 p.m. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-08T08:03:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}