{"organizations": ["Senate"], "uuid": "33e1574bffb7305edd4cc7df55aa1ee4f9479f99", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/syria_refugee_011814getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/242873-senate-dems-call-on-obama-to-resettle-6k-syrian-refugees", "country": "", "title": "Senate Dems call on Obama to resettle 6K Syrian refugees | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Senate Dems call on Obama to resettle 6K Syrian refugees | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "33e1574bffb7305edd4cc7df55aa1ee4f9479f99"}, "author": "", "url": "http://thehill.com/policy/defense/242873-senate-dems-call-on-obama-to-resettle-6k-syrian-refugees", "ord_in_thread": 0, "title": "Senate Dems call on Obama to resettle 6K Syrian refugees | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Martin Matishak", "Obama"], "text": "Senate Dems call on Obama to resettle 6K Syrian refugees Getty Images By Martin Matishak - 05/21/15 04:33 PM EDT \nA group of Senate Democrats is urging the Obama administration to allow at least 6,000 Syrian refugees to settle inside the United States. \n“While the United States is the largest donor of humanitarian assistance to Syrian refugees, we must also dramatically increase the number of Syrian refugees that we accept for resettlement,” the group of 14 lawmakers — led by Senate Minority Whip Dick Durbin (D-Ill.) and Sen. Amy Klobuchar (D-Minn.) — said Thursday. \nThe group letter noted the United Nations High Commissioner for Refugees (UNHCR) wants to resettle 130,000 Syrian refugees over the next two years and has thus far submitted more than 12,000 resettlement cases to the United States for consideration. ADVERTISEMENT However, only 700 have been let into the U.S. since the Syrian conflict began nearly five years ago, “an unacceptably low number,” the senators say.\n“Following the international community’s tragic failure to shelter Jewish refugees fleeing the Nazi genocide, the United States played a leadership role in establishing the international legal regime for the protection of refugees,” they wrote. “In keeping with this history, we urge your Administration to work to accept at least 50 percent of Syrian refugees whom UNHCR is seeking to resettle, consistent with our nation’s traditional practice under both Republican and Democratic presidents.” \nOn the same day, House Homeland Security Committee Chairman Michael McCaul (R-Texas) called the resettlement effort a “serious mistake” because of the security risks it poses. \nThe U.S. could resettle around 2,000 Syrian refugees this fiscal year and potentially thousands more in fiscal 2016 under the State Department-led effort. The Department of Homeland Security would have the authority to approve the admissions. \nSenate Democrats stressed that the conflict has displaced half of Syria’s 23 million people and that countries like Lebanon, with a populace of 4.2 million, has taken in 1.2 million refugees. \nThe group urged Obama to reach out to other countries and encourage them to accept more refugees as well. \nThey said they understood the security concerns about the program. \n“We must continue to carefully screen refugee applicants for all national security and terrorism concerns, but we urge you to devote sufficient resources and staff to ensure that this process does not hinder resettlement for legitimate refugees, many of whom are living in difficult, even life-threatening, situations,” they said. \nSenators concluded by saying “it is a moral, legal, and national security imperative for the United States to lead by example in addressing the world’s worst refugee crisis of our time by greatly increasing the number of Syrian refugees who are resettled in our country.” Tags: ", "external_links": [], "published": "2015-05-22T03:00:00.000+03:00", "crawled": "2015-05-22T21:28:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}