{"organizations": [], "uuid": "d3ed6540c73f1a974dfe21292e6433338abd91c0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/washington-post/feed", "section_title": "Washington Post on Huffington Post", "url": "http://www.huffingtonpost.com/john-a-tures/evidence-shows-obama-did-_b_7243666.html", "country": "US", "title": "John A. Tures: Evidence Shows Obama Did Not Divide The USA", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "John A. Tures: Evidence Shows Obama Did Not Divide The USA", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T19:13:00.000+03:00", "replies_count": 0, "uuid": "d3ed6540c73f1a974dfe21292e6433338abd91c0"}, "author": "John A. Tures", "url": "http://www.huffingtonpost.com/john-a-tures/evidence-shows-obama-did-_b_7243666.html", "ord_in_thread": 0, "title": "John A. Tures: Evidence Shows Obama Did Not Divide The USA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nIn his response to the Baltimore protests, Texas Senator Ted Cruz, a presidential candidate, blamed Barack Obama for dividing the country. As Eoin Higgins wrote for the Huffington Post \"The thinking goes something like this: President Obama came to office promising hope and change, then cynically manipulated and exacerbated divisions in the country to pursue his radical socialist agenda.\" \nAs his assessment of Obama's response, Higgins write \"Obama has not reacted to these events and this treatment with anything more than tepid responses contextualizing black anger.\" \nA recent Ipsos survey does show a sharply divided American public; nearly a quarter of Democrats and Republicans saw the opposite party as an imminent threat. After the 2014 election, the Washington Pos t and Associated Press pronounced American politics to be hopelessly divided. \"Judging by the exit polls, people who vote for Democrats and those who back Republicans seem to be living in different countries. Those on either side of the aisle express sharply divergent views on top issues, making it difficult for lawmakers to discern a clear mandate for governing.\" \nAccording to the AP survey , the voters are split not just by party, but by region, race, gender, marriage status, income, and religiosity. You can probably guess which ones are Republican and Democratic for yourselves, and it often corresponds to the rhetoric. \nThe article goes on to talk about unsurprising divisions between Democratic voters on whether the country is headed in the right direction, the state of the economy, the chances for future generations, concerns about climate change, worries about terrorism, and the legalization of marijuana. \nOf course, the implication is that this is some new era of divisive politics. As the myth goes, people and politicians used to get along all the time, but since the election of Barack Obama and the creation of the TEA Party, we're in some new world of hyperpartisanship. \nOr so it would seem. \nBut research on the exit polls from CNN after the 2004 election show an American electorate just as divided. And Obama hadn't even been sworn in as a United States Senator. \nFor example, 63 percent of those making less than $15,000 voted for Massachusetts Senator John Kerry, while a similar percentage making more than $200,000 voted for President George W. Bush. Sixty percent of big city voters favored Kerry, while a nearly equal percentage from rural areas were for Bush. \nOn the subject of religion, nearly 60 percent of Protestants voted for Bush, while two-thirds of self-described atheists voted for Bush. More than 60 percent of those attending church more than once a week favored the president, while a similar number who never attend church backed his opponent. Bush got 77% of the pro-life vote, while Kerry took 73% of the pro-choice vote. \nIn that CNN surve y, 57 percent of married voters went with the Republican candidate, while the same percentage of non-married voters chose the Democratic candidate. Gun owners were for Bush (63%) while non-gun owners were with Kerry (57%). \nOn foreign policy, of those who felt we were safer from terrorism after 9/11, the overwhelming majority (79%) supported President Bush, while an even bigger majority (85%) of those who felt we were more in danger of terrorism supported Senator Kerry. Ninety percent of those who figured the Iraq War was going well went for Bush, while 82 percent of those who thought it was going badly went for Kerry. \nOn economic policy, if you thought the national economy was good, your family was doing better, and the country was going in the right direction, you voted for the incumbent Bush with margins exceeding 80 percent. If you felt the national economy was not going well, your family was doing worse, and the country was going in the wrong direction, you voted for Bush's opponent. \nNone of this should surprise you, of course. And there were relatively equal distributions of both groups, which is what made the 2004 election so close. But the current conclusion that America is so currently divided was a recent phenomenon, because of Barack Obama as well as the opposition that has emerged to him, just isn't supported by the survey evidence. \nJohn A. Tures is a professor of political science at LaGrange College in LaGrange, Ga. He can be reached at jtures@lagrange.edu . More:", "external_links": [], "published": "2015-05-08T19:13:00.000+03:00", "crawled": "2015-05-08T23:42:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}