{"organizations": [], "uuid": "553bf256f7cd74e958ab1f9702b670f1d8c234b4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/cornynjohn_052215gn_1.jpg", "site_section": "http://thehill.com/rss/syndicator/19109", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/senate/243009-senate-advances-fast-track-for-obama-setting-up-final-vote", "country": "US", "title": "Senate advances fast-track for Obama, setting up final vote", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate advances fast-track for Obama, setting up final vote", "spam_score": 0.0, "site_type": "news", "published": "2015-05-23T02:43:00.000+03:00", "replies_count": 0, "uuid": "553bf256f7cd74e958ab1f9702b670f1d8c234b4"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/senate/243009-senate-advances-fast-track-for-obama-setting-up-final-vote", "ord_in_thread": 0, "title": "Senate advances fast-track for Obama, setting up final vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate advances fast-track for Obama, setting up final vote Greg Nash By Alexander Bolton - 05/22/15 07:43 PM EDT \nThe Senate voted Thursday to end debate on a trade package granting President Obama fast-track negotiating authority and giving him a major second-term legislative victory. \nIt’s also a big win for Senate Majority Leader Mitch McConnell (R-Ky.) who said last month that passing trade legislation would likely be the biggest accomplishment of the 114 th Congress. ADVERTISEMENT Senators voted 61 to 38 to advance to a final vote on the trade legislation. Thirteen Democrats voted to move forward, while five Republicans voted against ending debate. Sen. Mike Enzi (R-Wy.) missed the vote. The centerpiece of the bill is fast-track, also known as trade promotion authority, which empowers Obama and future presidents to negotiate trade deals that cannot be changed by Congress. Those deals can win Senate approval with simple-majority votes instead of having to clear the 60-vote hurdle usually required of controversial legislation. \nIt paves the way for swift passage of the Trans-Pacific Partnership, the largest trade deal since the North American Free Trade Agreement, which the administration is negotiating with 11 other countries. \nThe Senate began proceedings for final passage of the bill shortly after the vote to end debate. \nOnce the Senate votes on final passage, Obama’s trade agenda heads to the House where it faces a much steeper climb, where many populist conservative Republicans are skeptical of free trade. \nSen. Elizabeth Warren (D-Mass.), who led the opposition of liberal Democrats in the upper chamber, has already met Democratic House allies such as Rep. Rosa DeLauro (D-Mass.) to build a roadblock. \nFast-track has moved in fits and starts over the past two weeks as Senate Democratic Leader Harry Reid (D-Nev.) and other pro-labor Democrats devised various obstacles to slow its momentum. \nTheir goal was to delay Senate passage until after the Memorial Day recess to give outside labor, environmental and liberal advocacy groups more time to wage a grassroots campaign to turn public opinion. \nMcConnell made clear from the start of the debate that he did want that to happen. He used the looming expiration of Section 215 of the Patriot Act and the Highway Trust Fund as a backstop to ensure Senate action by stacking votes to extend both programs after the trade bill. \nThe bills managers, Senate Finance Committee Chairman Orrin Hatch (R-Utah) and Sen. Ron Wyden (Ore.), the senior Democrat on the Finance panel, beat back several amendments that could have jeopardized its chances in the House or drawn a presidential veto. \nThe toughest vote came on an amendment sponsored by Sens. Rob Portman (R-Ohio) and Debbie Stabenow (D-Mich.) to require that future trade agreements include enforceable provisions to dissuade currency manipulation by foreign partners. It failed by 48 to 51. \nInstead, the Senate adopted an alternative authored by Hatch and Wyden. It directs the administration to hold trading partners accountable for currency manipulation and to use various tools such as reporting, monitoring and cooperative mechanisms. \nPortman criticized it for lacking “teeth.” \nObama and McConnell teamed up to defeat the Portman-Stabenow proposal. Senators and aides said Obama worked the phone to pry support away from the amendment. McConnell told reporters at the start of the week he would whip against it and any other amendments he claimed would “tank the bill.” \nSen. John Tester (Mont.), the chairman of the Democratic Senatorial Campaign Committee, said he received a call from Treasury Secretary Jack Lew Thursday night urging him to oppose Portman-Stabenow. \nZiad Ojakli, vice president of government relations at Ford, which strongly supported the currency provision, vowed “to work with lawmakers to address this critical issue as TPA moves through the legislative process.” \nHatch, Wyden and McConnell also defeated an amendment sponsored by Warren that would bar corporations from using neutral arbitration process to settle disputes with foreign governments. Warren argued the so-called Investor State Dispute Settlement process would unfairly shield corporations from local laws. \n“A provision to give corporations special rights to challenge our laws outside of our legal system should not be part of our free trade agreement,” she said before the vote. \nSen. Sherrod Brown (D-Ohio), another leader of the Democratic caucus’s “fair-trade” wing, lost a vote on his amendment to require prior congressional approval of negotiations to expand the Trans-Pacific Partnership. \n“Before President Obama or President Hillary Clinton or President Lindsey Graham decides that China should be admitted to the Trans-Pacific Partnership, this amendment assures Congress plays a role,” he said. \nThe trade package nearly derailed on Thursday because of a dispute over whether to link it to reauthorization of the Export-Import Bank, a top priority of two key pro-trade Democrats, Sens. Patty Murray (Wash.) and Maria Cantwell (D-Wash.). \nCantwell initially demanded that McConnell guarantee Senate and House passage of legislation reauthorizing the bank in exchange for her support of fast-track. \nAt one point during a pivotal vote Thursday to end debate on the Hatch-Wyden substitute amendment, which contained the meat of the trade package, McConnell appeared in trouble after five Republicans defected. \nHe swung Murray and Cantwell, and several other pro-trade Democrats as well as Sen. Lindsey Graham (R-S.C.) to yes by promising them a vote next month on an amendment reauthorizing the bank. Its charter expires on June 30. \nDemocratic Sens. Michael Bennet (Colo.), Maria Cantwell (Wash.), Tom Carper (Del.), Chris Coons (Del.), Dianne Feinstein (Calif.), Heidi Heitkamp (N.D.), Tim Kaine (Va.), Claire McCaskill (Mo.), Patty Murray (Wash.), Bill Nelson (Fla.), Jeanne Shaheen (N.H.), Mark Warner (Va.) and Wyden voted yes. \nRepublican Sens. Susan Collins (Maine), Mike Lee (Utah), Rand Paul (Ky.), Jeff Sessions (Ala.) and Richard Shelby (Ala.) voted no. \nThis story was updated at 8:01 p.m. \nTags:", "external_links": [], "published": "2015-05-23T02:43:00.000+03:00", "crawled": "2015-05-23T03:32:14.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}