{"organizations": ["House"], "uuid": "04a885674c71b5c0f32037cee23e64b708b3bfef", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/healthcare/overnights/242000-overnight-healthcare-house-easily-passes-modified-abortion-bill", "country": "", "title": "OVERNIGHT HEALTHCARE: House passes 20-week abortion ban | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "OVERNIGHT HEALTHCARE: House passes 20-week abortion ban | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "04a885674c71b5c0f32037cee23e64b708b3bfef"}, "author": "", "url": "http://thehill.com/policy/healthcare/overnights/242000-overnight-healthcare-house-easily-passes-modified-abortion-bill", "ord_in_thread": 0, "title": "OVERNIGHT HEALTHCARE: House passes 20-week abortion ban | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sarah Ferris"], "text": "OVERNIGHT HEALTHCARE: House passes 20-week abortion ban By Sarah Ferris - 05/13/15 06:32 PM EDT \nThe House easily approved a bill banning abortions after 20 weeks of pregnancy on Wednesday, just months after an intraparty dispute derailed the legislation. \nThe legislation – which also requires a 48-hour waiting period, informed consent forms and mandatory counseling for victims of rape and sexual assault before abortions – passed 242-184. Four Republicans voted in opposition and four Democrats voted in support. \nThe bill was initially scheduled for a vote in January, but was abruptly cancelled after some Republicans voiced concerns about a requirement that rape victims have to report to the police before they have the procedure. ADVERTISEMENT Several of the Republicans who had opposed the bill then, led by Reps. Renee Ellmers (N.C.) and Jackie Walorski (Ind.), voted for the bill Wednesday.\nThe bill stands almost no chance of becoming law while President Obama remains in office, though Republicans say it is part of their long game to force abortion back into the courts. Read more here . \nWHITE HOUSE HIGHLIGHTS VETO THREAT: The Obama administration on Wednesday said it was \"disgraceful\" for House Republicans to push a late-term abortion ban bill that puts up barriers for sexual assault victims. \n\"The bill continues to add a harsh burden to survivors of sexual assault, rape and incest who are already enduring unimaginable hardship,\" press secretary Josh Earnest said. Read more here . \nDRUG COMPANIES WIN IN 21ST CENTURY CURES DRAFT : The House Energy and Commerce Committee on Wednesday updated its medical cures bill to include a controversial provision that would extend exclusivity rights for some drug companies. \nAny drug that is approved to treat rare diseases would be given a longer \"exclusivity period,\" which keeps competitors from selling the same drug, according to the latest draft released Wednesday. \nWhile praise for the new version was largely positive, the National Health Council condemned the committee's decision to scrap new rules for \"dormant therapies,\" which refers to drugs that meet unmet medical needs. \nThe bill is now headed for a markup by the House Energy and Commerce health subcommittee on Thursday morning. Read more here . \nNEW PRESSURE TO KILL 'D.C.'S OBAMACARE EXEMPTION': A coalition of conservative groups want to make sure Congressional Republicans don't let up on the fight to eliminate what they call D.C.'s exemption from ObamaCare. \nHeritage Action for America and Club for Growth are among a half-dozen groups that have joined a campaign called the \"No D.C. Exemption,\" which launched Wednesday. The groups are looking to drive up support for a two-year-long investigation into how members of Congress pay for ObamaCare, which has been led almost single-handedly by Sen. David Vitter (R-La.). \nThe group was formed two weeks after Vitter's panel -- the Senate's Small Business Committee -- denied his request to subpoena documents related to the investigation. Read more here . \nThursday's schedule \nThe House Energy and Commerce health subcommittee will hold a markup on 21st Century Cures at 10 a.m. \nThe Senate Finance Committee will hold a hearing on Medicare patients with chronic conditions at 10 a.m. \nState by state \nCalifornia's Obamacare exchange slashes budget, 2016 enrollment projections \nLouisiana House passes legislation that could allow Medicaid expansion next year \nNew approach by Massachusetts cops: Heroin is a disease not a crime \nOklahoma AG admits 'inadvertent error' in lethal injection case at Supreme Court \nWhat we're reading \nTop House Republican unveils ObamaCare replacement \nSen. Cassidy maps a plan to overhaul ObamaCare \nU.S. women face harder path to abortion as states extend waiting periods \nEbola epidemic continues to slow \nWhat you might have missed from The Hill \nStudy: 17 million women could lose mammogram coverage \nSenate Dems blast House abortion bill \nPlanned Parenthood says Boehner 'hid in his office' to refuse petitions \nPlease send tips and comments to Sarah Ferris, sferris@thehill.com , and Peter Sullivan, psullivan@thehill.com . Follow on Twitter: @thehill , @sarahnferris , @PeterSullivan4 ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T02:04:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}