{"organizations": ["Fox News Latino", "Congress", "GOP", "Fox News Latino Immigration"], "uuid": "b70b9e8799a54c77ad296bdea0cbb2542ece84a4", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Immigration%202016%20campaign%20Latino.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/07/immigration-moves-front-and-center-in-presidential-campaign/", "country": "", "title": "Immigration moves front and center in presidential campaign | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Immigration moves front and center in presidential campaign | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-07T15:30:00.000+03:00", "replies_count": 0, "uuid": "b70b9e8799a54c77ad296bdea0cbb2542ece84a4"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/07/immigration-moves-front-and-center-in-presidential-campaign/", "ord_in_thread": 0, "title": "Immigration moves front and center in presidential campaign | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Rodham Clinton", "Jeb Bush"], "text": "Immigration moves front and center in presidential campaign Published May 07, 2015 Fox News Latino Jeb Bush speaks at a town hall meeting April 28, 2015. Hillary Rodham Clinton's challenge to the GOP on immigration is an early counter to Jeb Bush and other Republican White House contenders seeking Hispanic voters. Among them are GOP lawmakers who once opposed an immigration overhaul in Congress but now say they may be willing to allow millions living in the country illegally to stay. (AP Photo/Ricardo Arduengo) \nAssociated Press – \"Path to citizenship,\" \"legal status,\" \"amnesty\": These terms surround the discussion of immigration in the United States and the fate of the 11 million or so undocumented migrants in the country, and now they have taken center stage in the early stages of the 2016 presidential election. \nThe elevated focus on immigration shines new light on the growing willingness of Republican presidential contenders — including past opponents of an immigration overhaul in Congress — to let such immigrants stay in the U.S. Such a position is regarded as \"amnesty\" by the GOP's tea party wing, yet it is quietly becoming the majority view in a 2016 Republican presidential class eager to attract Hispanic voters. \nFor one, former Florida governor Jeb Bush, who has not yet officially declared that he's running for the Republican nomination, has made allowing people in the country illegally who have no other criminal record to gain legal status a centerpiece of his immigration position. \nAs he does in most public appearances, Bush cited \"11 million people that should come out from the shadows and receive earned legal status\" at last week's speech to the National Hispanic Christian Leadership Conference. Such immigrants, he said, should be required to pay taxes, work and not receive government benefits. \nHillary Rodham Clinton injected new fire into the immigration debate this week with her call to allow people in the country illegally to gain citizenship and suggesting that when politicians like Bush talk about allowing people in the country illegally to remain here, \"That is code for second-class status.\" \n\"This will be a defining issue in the election,\" Clinton campaign manager Robby Mook told CNBC on Wednesday. \nIt's unclear how much the distinction between citizenship and legal status matters to Hispanic voters, a growing slice of the electorate nationally and an important factor in presidential swing states such as Florida, Colorado and Nevada. For many, the priority is simply to avoid deportation. \nA new Associated Press-GfK poll – conducted before Clinton's comments were made – found that Republican voters in the U.S. overwhelmingly favor a candidate who would reverse President Barack Obama's unilateral action to postpone deportations. But most could see themselves voting for someone who would keep that policy in place. \nThe poll found that most Americans don't see much difference between providing people who are in the country illegally legal status and letting them gain citizenship. \n\"This country has always had open doors,\" said Dean Talmadge, a Republican from suburban Seattle. \"I don't just have a problem with immigration, as long as they are here, working and following the rules.\" \nAccording to the poll, Americans favor a path to citizenship by 53 to 44 percent. It did not make a significant difference if respondents were asked instead whether they supported a path to legal status short of citizenship: 50 percent said they favored it and 48 percent opposed. \nThe rhetoric of the GOP candidates reflects that broad support for allowing such immigrants to stay, but only Bush has made that point a focus of his message to voters. \nBush's aides view Clinton's comments as a direct criticism and a sign that Democrats are worried about losing Hispanic votes to him. Bush is fluent in Spanish and uses it in his campaign. His wife is from Mexico, and he has lived in Venezuela and Puerto Rico. \nBush wrote in his 2013 book \"Immigration Wars\" that withholding citizenship would be a suitable penalty for people who have entered the U.S. illegally. But Clint Bolick, his co-author and an adviser, said Bush would sign legislation that confers citizenship as long as he found other parts of the bill acceptable. \nOn that point, \"he's open to compromise,\" Bolick told The Associated Press recently. Bush aides said Bolick's comments accurately reflect Bush's position. \nMeanwhile Bush's GOP rival Marco Rubio has emphasized his own Cuban-American heritage and his family's humble roots. After failing to win support for his own legislation, which would have offered citizenship to immigrants in the country illegally if they met certain conditions, the Florida senator still supports giving them the opportunity to apply for permanent residency as long as they have not broken other laws. \nKentucky Sen. Rand Paul voted against Rubio's bill but says the millions of people in the country illegally cannot all be sent home. \nEven Texas Sen. Ted Cruz, a conservative favorite who has been relatively consistent in opposing what he calls \"amnesty,\" does not close the door on a pathway to legal status. He told the Hispanic Chamber of Commerce last week he did not want to discuss what would happen on that front until the border is secured. \nWisconsin Gov. Scott Walker, who had endorsed citizenship but changed his mind in March, privately told Republicans in early voting states that he still supports a process to allow legal status. On Wednesday, Walker tweeted that Clinton's \"full embrace of amnesty is unfair to hardworking Americans and immigrants who followed the law to achieve these rights.\" \nAll of the Republicans are eager to avoid the fate of 2012 presidential nominee, Mitt Romney, who earned just 27 percent of the Hispanic vote after endorsing \"self-deportation\" as a viable policy. \nEven a modest improvement for the GOP with Hispanics could present a danger for the Democratic nominee. Bush's brother, George W. Bush, won his 2004 re-election with 40 percent of the Hispanic vote. \nYet Clinton's focus on immigration also creates risks for a Republican Party whose vocal minority sometimes says \"terrible things\" that alienate Hispanics, according to Alfonso Aguilar, a Republican who worked in the last Bush administration. He now leads the American Principles Project's Latino Partnership. \n\"If the next Republican nominee can't articulate a message that goes beyond border control, Latino voters will support Hillary by default,\" Aguilar said. \"If the nominee is somebody like Marco or Jeb Bush, I think there's cause for concern for Democrats.\" \nLike us on Facebook ", "external_links": [], "published": "2015-05-07T15:30:00.000+03:00", "crawled": "2015-05-07T15:49:55.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}