{"organizations": [], "uuid": "0127c924bf5aa709659d534d518f3273d99e9e7d", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2899566/images/o-MICHELLE-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/michelle-obama/feed", "section_title": "Michelle Obama on Huffington Post", "url": "http://www.huffingtonpost.com/2015/04/30/michelle-obama-curly-hair-best-beauty_n_7182740.html", "country": "US", "title": "This Michelle Obama Hairstyle Could Be Her Best Look Yet", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "This Michelle Obama Hairstyle Could Be Her Best Look Yet", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T10:00:00.000+03:00", "replies_count": 0, "uuid": "0127c924bf5aa709659d534d518f3273d99e9e7d"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/04/30/michelle-obama-curly-hair-best-beauty_n_7182740.html", "ord_in_thread": 0, "title": "This Michelle Obama Hairstyle Could Be Her Best Look Yet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  We've never seen the Goop founder sporting a bold shade of red lipstick like this before, but we absolutely love it. The creamy lip color, combined with her shiny blonde strands, add the perfect finishing touches to her little white dress. If you've ever wondered why Bosworth was named the face of SK-II skincare products, here's your answer. Who wouldn't want to pay hundreds of dollars to achieve a luminous complexion like this? And we also can't stop staring at her thick waves and red lipstick. If anyone knows what brand of red-orange lipstick this stylish mama is wearing, please leave a note in the comments section. Richie's bronzed cheeks, golden eyeshadow and a slick updo really bring out her caramel highlights, which we love. This is how you match your makeup to your outfit. The \"Scandal\" star's raspberry lipstick has us giddy about what she'll be wearing on Sunday night at the Emmys. Rhoda may be a spokesmodel for cosmetics giant Estée Lauder, but she doesn't need a whole lot of makeup to look glamorous. Neutral shadows, thick brows and side-swept locks are just enough. The \"Skyfall\" actress is another example of natural beauty. Harris' dark brown hair color is a great shade for fall, and her nude lip color is stunning against her skin tone. Kate Bosworth wasn't the only blonde bombshell at the Bulgari Retrospective Opening in San Francisco. Swank shined with her honey blonde waves, flushed cheeks and rose lipstick. The supermodel's graphic winged liner is breathtaking, but her braided bob has us scratching our heads. It's as if she was trying really hard to look youthful yet grown-up at the same time. We couldn't miss Anna Kendrick while she was sitting front row at London Fashion Week. Her limp locks and washed-out face made for one depressing beauty look. The \"Hostages\" actress' super heavy bangs are practically hiding her gilded eyelids. While Collette's hair color is spot-on, her fringe could desperately use a trim. We don't believe that you have to wear makeup to look beautiful. However, this \"90210\" starlet must have made a last-minute decision to apply a ghostly brown eyeshadow that does her no favors. Everybody loves Patricia Heaton, but we don't love this caked-on eye makeup. It draws unwanted attention to her crow's feet, and the flipped-up hairstyle makes her look much older. Let's just ban this unflattering shade of eyeshadow. Harlech's pretty face looks lifeless, and her heavy haircut drags her facial features down. There's a lot that's wrong with this video vixen's look, including the drawn-on eyebrows, bubblegum pink lipstick and orange bronzer that weirdly matches her hair. The \"Baggage Claim\" star looks oh so pretty with her side-swept curls, rosy cheeks and red lips. What kept this bright makeup look from steering wrong was Patton's clean and simple eye makeup. Now this is a lesson on how to do minimal makeup. Hayek's thick brows, long lashes finely coated in mascara and just a touch of lip gloss make a powerful statement without trying too hard. The supermodel's strands are sleek and sexy! We love how Campbell's graduated bangs frame her face, drawing our attention to her soft, smokey eyes and flushed cheeks. This 13-year-old starlet proves that she's one to watch with her age-appropriate beauty. How cute are her glossy brown ringlets, winged-out eyeliner and shimmering lipstick? Redheads, take notes! Healy, a singer from the English-Irish girl group called The Saturdays, brings out her flaming red hair color with bronze eyeshadow, a sliver of black liner and coral lip gloss. (Her turquoise chandelier earrings are an added treat.) Faris' blonde hairstyle reminds us of one of Britney Spears' old wigs, and her pale red lipstick looks very dated. (The bright yellow gown only washes her complexion out more.) A less bulkier 'do and fresher makeup would have made a huge difference. Dear Kelly, we think it's time you say goodbye to this lavender hair dye. The hair color and cut makes the \"Fashion Police\" co-host look ten times older. We are fans of the milkmaid braid. However, Perry's too-tight plait and red lipstick are giving us scary doll head vibes. Has Paquin been drinking True Blood? This vampy look is best left on the set of her HBO show or at a Halloween party. Where do we begin? The 66-year-old actress, author and businesswoman's complexion appears unnaturally bronze, and her blonde hair is only magnifying the issue. Plus, her blue eyeshadow doesn't really support our case for bringing it back. Look at that body! (We mean Washington's hair, of course.) The 36-year-old actress' thick curls frame her face perfectly and accentuate her chestnut highlights. And her berry lip gloss is a nice pop of color. This Sports Illustrated swimsuit model's pared-down hair and makeup are quite refreshing. When your hair is cut into bouncy loose layers like Upton's, all you need is a little mascara and eyeliner. It's official! Purple lipstick is the IT shade of the season. The deep magenta color is striking against the royal's glowing complexion. The breast cancer awareness advocate is pretty in pink with her flushed cheek color and glossy lips. Hurley's lush waves and lashes add the finishing touch. We can't help but gasp over the gorgeous red carpet looks the \"Gravity\" star has been wearing these past few weeks. And this super straight hair and brown smoldering eye makeup is one of our favorites. Are you under there, Shenae? We can barely see the \"90210\" actress underneath her dark and heavy bangs hairstyle. Plus, her complexion appears a tad orange. Keys sure knows how to rock a pompadour, but she could use some help choosing the best makeup shades for her skin tone. That shade of blue-gray shadow on her lids reads harsh, and the tomato red lipstick isn't flattering at all. The \"Devious Maids\" actress' low chignon is too severe, and the way her strands are wrapped around her head makes it look like she's wearing a turban. We hate to admit this, but we prefer the blonde wig dons as Donatella Versace in the upcoming TV movie \"House of Versace\" over her naturally frizzy hair. Gershon is in desperate need of a deep conditioner. When you're lucky to have some of the best brows in Hollywood, you really don't need to do much. Belle's top knot-and-bob combo makes the young star look as though she really didn't put much thought into her appearance.  Share", "external_links": [], "published": "2015-05-01T10:00:00.000+03:00", "crawled": "2015-05-01T21:23:01.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}