{"organizations": [], "uuid": "4be3b002cb5cf4b4f036bd4bb72655472a1061d2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3001130/images/o-OBAMA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/business/news.xml", "section_title": "Business News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/27/progressive-top-trade-official_n_7453818.html?utm_hp_ref=business&ir=Business", "country": "US", "title": "Progressive Groups Call On Obama Trade Official To Disclose Communications With Wall Street Banks", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Progressive Groups Call On Obama Trade Official To Disclose Communications With Wall Street Banks", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T15:00:00.000+03:00", "replies_count": 0, "uuid": "4be3b002cb5cf4b4f036bd4bb72655472a1061d2"}, "author": "Zach Carter", "url": "http://www.huffingtonpost.com/2015/05/27/progressive-top-trade-official_n_7453818.html?utm_hp_ref=business&ir=Business", "ord_in_thread": 0, "title": "Progressive Groups Call On Obama Trade Official To Disclose Communications With Wall Street Banks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Progressive Groups Call On Obama Trade Official To Disclose Communications With Wall Street Banks Posted: reddit \nWASHINGTON -- A coalition of progressive organizations sent a letter to President Barack Obama's top trade negotiator on Thursday, asking him to disclose all of his communications with the nation's largest banks during his time in office. \nFinancial reform watchdogs are concerned that so-called \"fast-track\" trade legislation could undermine key banking regulations enacted after the 2008 financial crisis. The fast-track bill, which blocks Congress from amending trade deals negotiated by Obama and a future president, cleared the Senate last week, but faces an uphill battle in the House, where Democrats and a bloc of tea party Republicans oppose it. \nThe letter from Demand Progress, CREDO Action, MoveOn, The Other 98%, Friends of the Earth, Communications Workers of America, Daily Kos, Public Citizen and Rootstrikers targets U.S. Trade Representative Michael Froman, a former Citigroup executive who joined the Obama administration in 2009. Obama's nominee for Deputy U.S. Trade Representative, Marisa Lago, is also a Citigroup alum. Froman is currently negotiating two major trade pacts, one with 11 other Pacific nations, called the Trans-Pacific Partnership, and another with members of the European Union. \n\"Numerous legal experts and members of Congress have warned of possible risks to U.S. financial regulation that would arise from the passage of Trade Promotion Authority (TPA) and the trade agreements that could be enacted under that authority,\" the letter reads, using another name for the fast-track legislation. \"If you are looking to build trust in the Administration’s position on this issue, you can do that by promptly, voluntarily, and proactively releasing to the public records of all of your communications with representatives of the largest U.S. financial institutions.\" \nSen. Elizabeth Warren (D-Mass.) and other congressional Democrats have criticized both deals for including a process called investor state dispute settlement, which allows foreign corporations to sue governments before an international tribunal over laws and regulations they do not like. European governments have been pushing aggressively to include financial standards in the EU deal that would make bank regulations subject to ISDS challenges. Froman and the Obama administration have thus far resisted such calls, which could serve as an avenue for undermining American rules much tougher on big banks than those of its European allies. \nRep. Keith Ellison (D-Minn.) provided a statement to The Huffington Post saying the letter's call for disclosure over communications with big banks was fair game. \n\"Evidence leaked to the public reveals the biggest trade agreement in history is just another investment deal for the world's largest corporations,\" Ellison said. \"Scars from free trade agreements exist all over our country, so working Americans are right to ask if the U.S. Trade Representative is really negotiating in their best interest.\" \nFroman has a history of tension with progressive groups, who do not trust his public statements about the classified TPP deal, due to shifting explanations from Froman in private meetings. He has been sharply criticized by Democrats including Sen. Sherrod Brown (Ohio) during hearings for shielding key details about the pact from congressional staffers. \nBank reformers have zeroed in of late on the potential for trade pacts to undermine U.S. regulations, even as Obama himself has dismissed such concerns. In mid-May, Canadian Finance Minister Joe Oliver gave a speech in New York arguing that a key provision of the 2010 Wall Street reform law known as the Volcker Rule is a violation of the 1994 North American Free Trade Agreement. The Volcker Rule bars banks from trading securities for their own profit, an effort to rein in risky speculation from big firms. The blockade includes an exemption for buying and selling U.S. Treasury bonds, however, which Canada says unfairly discriminates against its own debt. \nThe secrecy standards surrounding both the EU deal and the TPP have been especially controversial during the legislative battle over fast track. The Obama administration currently treats TPP documents as classified information, making it a crime for any lawmaker who has actually seen draft texts of the deal to share details with the public. \nThe Obama administration has been negotiating both trade deals for years, and may not complete the TPP deal before leaving office. \nRead the full text of the letter here . More:", "external_links": [], "published": "2015-05-28T15:00:00.000+03:00", "crawled": "2015-05-28T15:19:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}