{"organizations": [], "uuid": "5420e0afe218260400e140a3d7af6d837bb3c1a7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/guantanamobay_prison_040914getty.jpg", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/video/in-the-news/242218-gitmo-vote-a-clear-message-to-obama-says-republican", "country": "US", "title": "Gitmo vote a ‘clear message’ to Obama, says Republican", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Gitmo vote a ‘clear message’ to Obama, says Republican", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T20:06:00.000+03:00", "replies_count": 0, "uuid": "5420e0afe218260400e140a3d7af6d837bb3c1a7"}, "author": "Molly K. Hooper", "url": "http://thehill.com/video/in-the-news/242218-gitmo-vote-a-clear-message-to-obama-says-republican", "ord_in_thread": 0, "title": "Gitmo vote a ‘clear message’ to Obama, says Republican", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gitmo vote a ‘clear message’ to Obama, says Republican By Molly K. Hooper - 05/15/15 01:06 PM EDT \nRep. Jackie Walorski (R-Ind.) says she is ecstatic that a bipartisan majority of the House voted on Thursday for her provision to restrict transfers of detainees from the Guantánamo Bay detention center in Cuba. \nWalorski's measure was included in the National Defense Authorization Act (NDAA) that was approved by the House on Friday in a vote of 269-151. While only nine Democrats crossed the aisle to vote with 234 Republicans for the Guantánamo amendment, Walorski said she considers that tally a victory. ADVERTISEMENT \"That bipartisan vote on the floor last night sends a clear message I think, not only to the president, but to all the people around him who are advising him that the American people have made up their mind,\" Walorski said in an on-camera interview with The Hill's Molly K. Hooper.\nEven thought President Obama vowed to veto the NDAA over her amendment, the Indiana Republican — a member of the Armed Services Committee — is focused on keeping the provision in the final defense bill that Congress sends to the White House. \n\"I'm going to work hard to be at the table to make sure [it is in the final product]”, Walorski said. \nWatch the clip above to hear more from Walorski about the Guantánamo fight. Past: 1 day Report: Obama lied about bin Laden... Seymour Hersh accuses Obama of rushing to take credit for the al Qaeda... Michelle Obama speaks of emotional... She discussed facing comments \"rooted in the fears and misperceptions of... Bin Laden report 'full of lies,'... Seymour Hersh’s report is “garbage,” says SEAL who claims he killed Osama... Juan Williams: The GOP's festival... OPINION | Candidates are abandoning previous positions to better appeal to... Investigative journalist defends... Seymour Hersh accuses the White House of mischaracterizing details of bin... Two years later, IRS probes drag on GOP lawmakers fuming about the status of the IRS investigation. DHS secretary: Lone wolf attackers... “We’re very definitely in a new environment,\" Jeh Johnson said. Killings of police officers on the... Fifty-one officers were killed in a felony crime in 2014, the FBI said. 113 Republicans back lawsuit... They accuse the president of \"disrupting the delicate balance of powers.\" George Zimmerman shot in Florida Police in Florida say George Zimmerman was involved in what appears to be... Immigration debate roils GOP A group of dissident Republicans in the House are clashing with their... Pressure mounts as Congress dives... The clock is fast running out on the agency’s power to collect phone... Report: Christie spent $300,000 in... A watchdog found Christie racked up an $82,000 bill at the home of the... Karl Rove surrenders to ObamaCare He correctly tells Republicans that their pledge to repeal ObamaCare is a...", "external_links": [], "published": "2015-05-15T20:06:00.000+03:00", "crawled": "2015-05-16T00:17:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}