{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "cea2b3cfe82f5d0548ccace2e0172b6127c6ada6", "thread": {"site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/13/abortion-and-fatherhood-man-take.html", "country": "", "title": "Abortion and fatherhood -- a man's take | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Abortion and fatherhood -- a man's take | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "cea2b3cfe82f5d0548ccace2e0172b6127c6ada6"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/13/abortion-and-fatherhood-man-take.html", "ord_in_thread": 0, "title": "Abortion and fatherhood -- a man's take | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nA dear friend of mine recently confessed to me that he was the father of one living daughter and four deceased children. The four were aborted, three with his consent and one without. My friend said the pain of those deaths is something he copes with on a daily basis. “The guilt and pain can be overwhelming,” he said. \nAnother friend still can’t hold back tears, even after 20 years, when he shares that he took his then-girlfriend to Planned Parenthood to erase the “mistake” they made a few months before their wedding. Now married for two decades and the parent of four other beautiful children, he recounts how his marriage was difficult and tumultuous for years until they sought counseling. The root of their conflict and strife? The abortion. \nAs we approach Father’s Day once again, more and more men are realizing the impact abortion has not only had on women, but also on themselves. And the impact is anything but positive. \n[pullquote] \nWhat’s going on here? Abortion is a women’s issue and has nothing to do with men, right? Why are men struggling with the loss of their aborted children? \nBecause, despite what the law says, fathers are fathers from conception, not from birth. \nThe landmark 1973 Supreme Court decision, Roe v. Wade, effectively stripped the father of all legal rights regarding his unborn child. Before that decision, men were fathers from the day their child came into being, at conception. \nBut, with the stroke of a pen, fatherhood jumped nine months into the future. Mothers, meanwhile, maintained their parental rights from the day of conception. So much for equal rights for men and women. \nOf course, millions of men welcomed the change. The sexual revolution was booming, and men were experiencing a new kind of empowerment we hadn’t previously enjoyed. \nWe could now sleep with anyone we wanted without any fear of responsibility if our female partner became pregnant. \nThe one thing that had kept us from expressing our rampant sexuality, fear of conception, was now of no concern. \nNot only did we no longer have to fear a pregnancy, we had no legal right to make any decision regarding the child in the womb. \nIf our partner decided to abort, well, that was her call. \nIf she asked us our opinion about an abortion, all we had to do was utter our all-too-common response, “It’s your decision, babe. I’ll support whatever you decide.” Which, of course, was our way of saying, “I don’t care enough about you or the child to have a real opinion.” \nAbortion didn’t empower women. It empowered men. \nFast forward to Father’s Day 2013. \nFifty-five million aborted babies later, it seems many men are realizing the Supreme Court got it wrong. Fatherhood doesn’t start with birth. It starts when we opt to sleep with a woman. And, despite federal law, our consciences testify that we are wired to protect and care for a child when it is conceived, not nine months later. \nThere are also an estimated 15 million fathers who, for whatever reason, lost children to elective death in the womb. Men have failed their families and their children. \nThe tide is beginning to turn, however. Men are realizing no one escapes the hell of abortion. \nWe are waking up and realizing that children are killed and women are exploited. \nWe are just now considering, though, that we victimize ourselves. \nDepression, guilt, shame, a loss of self, a loss of honor, and destroyed relationships are common male consequences of abortion. \nIn our heart of hearts, we are coming to grips with what we’re doing. We are willfully taking the lives of those we are wired to protect. \nWe are born to be fathers. Strong. Honorable. Self-sacrificing. Men of courage. Men of valor. \nWe are born to provide for the weakest among us, and that most certainly includes our own unborn children. \nFather’s Day is the embodiment of all those things we love and respect about or own fathers, grandfathers, and male role models. It’s a day to honor those men who raised us, cared for us, provided for us, and protected us. \nIf we pause to reflect, however, it is also a day to mourn. We mourn those millions of fathers who refused to provide and protect. We mourn fathers who have no legal right to do so. We mourn the loss of faithful and true fatherhood in America. And we hope, we pray, we plead, for it to return. \nBrian Fisher is the author of \" Abortion: The Ultimate Exploitation of Women \" and the co-founder and president of Online for Life, a 501(c)(3) nonprofit that uses new and emerging strategies to save the lives of innocent, unborn babies. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}