{"organizations": ["Senate"], "uuid": "cfb8eed67bd08e86e2f93a97a95e7afee219838f", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2960510/images/o-MCCONNELL-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/17/mitch-mcconnell-tpp_n_7300842.html", "country": "", "title": "Mitch McConnell Says Obama 'Has Done An Excellent Job' Pushing Trade Deal", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Mitch McConnell Says Obama 'Has Done An Excellent Job' Pushing Trade Deal", "spam_score": 0.0, "site_type": "news", "published": "2015-05-17T19:39:00.000+03:00", "replies_count": 0, "uuid": "cfb8eed67bd08e86e2f93a97a95e7afee219838f"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/17/mitch-mcconnell-tpp_n_7300842.html", "ord_in_thread": 0, "title": "Mitch McConnell Says Obama 'Has Done An Excellent Job' Pushing Trade Deal", "locations": ["Washington", "D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mitch McConnell", "Alex Wong", "Obama"], "text": "Mitch McConnell Says Obama 'Has Done An Excellent Job' Pushing Trade Deal Posted: Updated: 41 minutes ago Washington, D.C. - Senate Majority Leader Mitch McConnell (R-Ky.) returns to his office after the weekly Senate Republican Policy Luncheon May 12, 2015 on Capitol Hill in Washington, D.C. | Alex Wong via Getty Images reddit \nSenate Majority Leader Mitch McConnell (R-Ky.) said Sunday that Congress' upper chamber would give President Barack Obama expedited authority to negotiate major trade deals \"later this week,\" despite strong opposition from members of the president's party. \nThe Senate voted to open debate on trade promotion authority last week. The issue is shaping up to be the most significant intra-party battle of Obama's second term, but the president has found support for his trade agenda among the Senate's Republican leadership. Fast-track authority would allow Obama to present the Trans-Pacific Partnership (TPP) and other deals to Congress for an up-or-down vote, meaning legislators couldn't offer amendments. The TPP is a proposed free trade arrangement among 12 countries bordering the Pacific rim. \n\"The president has done an excellent job on this,\" McConnell said in an interview with ABC's \"This Week.\" \"I point out to my members who are somewhat squeamish, as you can imagine, giving the president the power of any issue, given his expansive view of his powers on so many other issues. But this is a trade promotion authority not just for President Obama, but for the next president as well. This is a six-year trade promotion authority bill that will give the next president an opportunity to enter into additional trade agreements with other countries around the world.\" \nMcConnell had previously described his coordination with the president on trade as \" an out-of-body experience .\" \nFast-track authority faces a significantly more difficult path in the House . Nearly all Democrats are opposed, as is a strong contingent of Republicans, who are hesitant to hand Obama a victory. \nAnd yet Rep. Paul Ryan (R-Wis.), the chairman of the House Ways and Means Committee, was confident Sunday that the measure would pass the lower chamber. \n\"We will have the votes,\" Ryan said on CNN's \"State of the Union.\" \"We're doing very well. We're gaining a lot of steam and momentum.\" \nPresidential candidate and former Secretary of State Hillary Clinton has so far remained quiet on TPP. While progressive groups want Clinton to come out against the trade deal , other Democrats want her to support it. \n\"I think she should take a good look at it,\" Sen. Dianne Feinstein (D-Calif.) said on ABC News' \"This Week.\" \"And I think it would be very helpful.\" Also on HuffPost: Say Cheese! Mitch McConnell Smiles of   It's not often we see Sen. Mitch McConnell (R-Ky.) crack a smile. He dons his go-to straight face most of the time. Ahead, see the rare grins of the Kentucky senator. (Photo by T.J. Kirkpatrick/Getty Images) McConnell waves as he arrives to speak at the 40th annual Conservative Political Action Conference in National Harbor, Md. (AP Photo/Manuel Balce Ceneta, File) President Barack Obama is greeted by McConnell as he arrives at the U.S. Captiol for his third day of meetings with members of Congress March 14, 2013. (Chip Somodevilla/Getty Images) McConnell leaves the Senate chamber to caucus in the US Capitol Dec. 30, 2012. (Molly Riley/AFP/Getty Images) McConnell leaves his office and walks toward the Senate floor on Capitol Hill March 22, 2013. (Drew Angerer/Getty Images) McConnell tours the stage during preparations at the Tampa Bay Times Forum Aug 26, 2012. (BRENDAN SMIALOWSKI/AFP/GettyImages) McConnell greets US President Barack Obama following Obama's address to a Joint Session of Congress about the US economy and job creation Sept. 8, 2011. (SAUL LOEB/AFP/Getty Images) McConnell smiles as he speaks to the press with fellow Republican senators John Barroso of Wyoming and John Cornyn of Texas at the Capitol Aug. 2, 2011. (NICHOLAS KAMM/AFP/Getty Images) McConnell gives the the thumbs-up as he walks to the Senate floor after a deal was reached to avert a US default at the Capitol in Washington July 31, 2011. (NICHOLAS KAMM/AFP/Getty Images) McConnell is sworn in by Vice President Dick Cheney as his wife Labor Secretary Elaine Chao holds the Bible during a swearing in reenactment ceremony at the US Capitol Jan. 6, 2009. (KAREN BLEIER/AFP/Getty Images) McConnell smiles during sound check at the Republican National Convention (RNC) in Tampa, Fla., Aug 27, 2012. (Scott Eells/Bloomberg via Getty) McConnell laughs with Louisville Mayor Jerry Abramson at the annual ham breakfast at the Kentucky State Fair in Louisville, Ky., in 2010. (AP Photo/Ed Reinke) Sen. Lamar Alexander (R-Tenn.) jokes with reporters as McConnell, laughs in the Ohio Clock Corridor following the Senate Republicans' policy lunch in June 21, 2011. (Photo By Bill Clark/Roll Call) Sen. Roy Blunt (R-Mo.), McConnell, and Sen. Marco Rubio (R-Fla.), share a laugh during news conference in the Capitol after a meeting of Senate Republicans, Feb. 8, 2012. (Photo By Tom Williams/CQ Roll Call)  Share ", "external_links": [], "published": "2015-05-17T19:39:00.000+03:00", "crawled": "2015-05-17T21:52:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}