{"organizations": ["UN", "NSC | Fox News Facebook", "Twitter"], "uuid": "2cb41abe691f474d38a2c91954851a6f8280344e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/06/06/obama-makes-mainstream-media-happy-taps-liberal-women-for-un-nsc/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422573403114.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/06/obama-makes-mainstream-media-happy-taps-liberal-women-for-un-nsc.html", "country": "", "title": "Obama makes mainstream media happy -- taps liberal women for UN, NSC | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama makes mainstream media happy -- taps liberal women for UN, NSC | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "2cb41abe691f474d38a2c91954851a6f8280344e"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/06/obama-makes-mainstream-media-happy-taps-liberal-women-for-un-nsc.html", "ord_in_thread": 0, "title": "Obama makes mainstream media happy -- taps liberal women for UN, NSC | Fox News", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Samantha Power", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print President Barack Obama stands with Samantha Power, his nominee to be the next UN Ambassador, left, Wednesday, June 5, 2013, in the Rose Garden at the White House in Washington. (AP) \nThe major media love women – only liberal, Democratic ones, of course. So much so that Obama’s new picks as national security adviser and U.N. ambassador got special treatment on all three network evening news shows the night of their nominations. \nObama’s national security pick Susan Rice and likely U.N. ambassador Samantha Power received the green light from ABC, CBS and NBC as expected of two female nominees with solid liberal credentials. \nReporters did mention Republican criticisms of Rice, but those were portrayed as “political” attacks and not one member of the GOP was quoted or given time to speak on any of the three networks. \n[pullquote] \nThe only Republican who was mentioned was long-time “maverick” Sen. John McCain who announced support for Power. More On This... Samantha Power's promotion to UN ambassador is a major disappointment \nMcCain, who spends half his life disagreeing with Republicans enough to be every reporter’s favorite Republican, was mentioned by both CBS and NBC. ABC’s report was short, or it certainly would have found a way to include him as well. \nABC anchor Diane Sawyer said the Rice pick was “being called an in-your-face appointment by President Obama.” Not so “in-your-face” to merit an actual GOP response, though. \nSawyer instead made it look like Rice was the victim of unfair attacks by the GOP , not a recipient of much-deserved criticism. \n“Rice was at the center of that firestorm from Republicans after the attack on that consulate in Benghazi.” \nActually, the firestorm erupted because Team Obama lied after four Americans were killed, including the first U.S. ambassador to be killed on duty since the 1970s. \nSawyer’s magnanimous approached continued: “She even withdrew her name from consideration as a candidate for Secretary of State.” She left out how Rice’s withdraw limited questions from Obama critics. \nABC News Chief White House Correspondent Jonathan Karl defended Rice in an online piece, claiming she “got a bad rap” over Benghazi. According to Karl, “the White House emails suggest Rice had no part in the editing process.” \nSo her Oscar-winning performance lying for the administration wasn’t really bad because someone else wrote the lies, er, lines. \nNBC Chief White House Correspondent Chuck Todd spent most of his segment detailing the “long list of impressive credentials” for both women. Todd called Benghazi ‘a political firestorm” and blamed Republicans “for trying to make her a fall woman for the president.” \nOn the CBS “Evening News with Scott Pelley,” Major Garrett admitted that the outgoing national security advisor “never invited controversy.” “The same could not be said of his replacement,” he added. Though Garrett acknowledged Rice had been criticized by Republicans, none of them appeared on air to comment. \nRice, along with parroting Obama admin lies about Benghazi, has some serious liberal chops . \nShe has worked as an aide to Michael Dukakis in his1988 presidential bid, worked for President Clinton and served as a senior fellow for the liberal stalwart, the Brookings Institution. Then she worked for Obama. \nWhen it came to Power, not a discouraging word was heard. \nObama recognized that Power has a PR problem because of loony comments she made about being willing to invade Israel and force a peace settlement. \nDuring his announcement speech , Obama credited her with “fighting the scourge of anti-Semitism.” Even her former law professor Alan Dershowitz admitted Power will benefit from her Israel bashing, saying “she will bring added credibility to her positions at the most anti-Israel location in the world other than perhaps, Tehran.” \nBut there was no mention of Power’s Israel problem on any network. \nGarrett was particularly complimentary of the former journo. “She has led efforts to alleviate suffering in places like Darfur and worked to strengthen U.S. alliances,” he said. \nTodd also portrayed Power positively, though he mentioned how she had once called Hillary Clinton “a monster.” (Points for honesty!) \nHe then detailed some of Power’s successes, adding, “she’s also the mother of two young children.” \nThe only things he left out were possible newly adopted puppies and an American flag collection. \nForget that no man or no conservative woman gets that treatment, even Rice didn’t. \nAccording to her State Department bio, “Ambassador Rice is married to Ian Cameron and has two children.” But then again, she didn’t work as a journalist. \nPower has an even more impeccable liberal resume than Rice. She’s a Pulitzer-Prize winning former journalist who wrote for Time “and contributed regularly to the New Yorker Magazine, the New York Review of Books, and the New Republic.” \nShe’s married to uber-lefty Cass Sunstein whom The New York Times called one of the potential Supreme Court “candidates who would most excite the left.” More lefty royalty for the media to ooh and ahh over. \nBoth Rice and Power show that Journalistic Washington approves of the picks, just as it regularly disapproves of conservative women like Palin or Bachmann. \nDan Gainor is the Media Research Center's Vice President for Business and Culture . He writes frequently about media for Fox News Opinion. He can also be contacted on Facebook and Twitter as dangainor. \n", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}