{"organizations": [], "uuid": "0663c96e8bfaa1e6507bc99602de2d85849cdb82", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/28/feed#", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/241422-obama-considers-protecting-nevada-land", "country": "US", "title": "Obama considers protecting Nevada land", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama considers protecting Nevada land", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T15:30:00.000+03:00", "replies_count": 0, "uuid": "0663c96e8bfaa1e6507bc99602de2d85849cdb82"}, "author": "tcama@thehill.com (Timothy Cama)", "url": "http://thehill.com/policy/energy-environment/241422-obama-considers-protecting-nevada-land", "ord_in_thread": 0, "title": "Obama considers protecting Nevada land", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama considers protecting Nevada land By Timothy Cama - 05/08/15 08:30 AM EDT \nPresident Obama is considering a controversial proposal to protect more than 1,000 square miles of rural land in southern Nevada. \nRep. Cresent Hardy (R-Nev.) said he obtained a draft document outlining the proposed Basin and Range National Monument, which he said Obama is considering establishing unilaterally under his Antiquities Act power. ADVERTISEMENT Some Nevada Democrats and conservationists have long sought to protect the land in Lincoln and Nye counties, but Republicans have pushed back.\n“I am appalled and deeply concerned about the national security implications of President Obama’s politically motivated effort to permanently tie up more than 700,000 acres of land, most of which is under one of the most heavily used military operating areas in the United States, and all of which is in Nevada’s 4th congressional district,” Hardy wrote in a statement, referring to his district. \nThe land surrounds “City,” a massive in-progress piece of art meant to resemble ancient mounds and monuments. \nObama’s national monument designation would protect the area from development, energy production and a wide range of other activities. \n“The land tells the story of a rich cultural tradition,” the White House wrote in the draft, according to the Las Vegas Sun . “From the earliest human inhabitants 13,000 years ago, to miners and ranchers in the past century and a half, to a modern artist in recent decades, the area’s residents have created and left behind noble legacies.” \nKristen Orthman, a spokeswoman for Senate Minority Leader Harry Reid (D-Nev.), fought back against Hardy. \n“Sen. Reid believes this area deserves protection — that is why he introduced legislation to do so in 2014,” she said. “But in lieu of legislation, Sen. Reid fully supports President Obama if he decides to designate this area, which he has the legal authority to do so. No area is as uniquely Nevada as is the Basin and Range.” \nObama extensively used his power to create national monuments, and has used it to protect more land and water than any previous president. \nThat has irked Republicans, who see Obama’s actions as out of line and a power grab. They’ve proposed multiple bills to remove or significantly curtail Obama’s power to create national monuments without congressional consent. Tags:", "external_links": [], "published": "2015-05-08T15:30:00.000+03:00", "crawled": "2015-05-08T22:28:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}