{"organizations": [], "uuid": "4146f4339c5fd21435d155c8b21831650b3ea203", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/083013/0/0/083013_ANR_Syria_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/30/obama-has-only-himself-to-blame-for-britains-syria-snub.html", "country": "", "title": "Obama has only himself to blame for Britain’s Syria snub | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama has only himself to blame for Britain’s Syria snub | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "4146f4339c5fd21435d155c8b21831650b3ea203"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/30/obama-has-only-himself-to-blame-for-britains-syria-snub.html", "ord_in_thread": 0, "title": "Obama has only himself to blame for Britain’s Syria snub | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nThe Obama administration is today still reeling from Thursday’s enormous setback to the Syria intervention effort, as the UK voted to reject military intervention in the war-torn nation. \nIt is difficult to overestimate just how devastating this is to the President’s foreign policy. \nBritain has stood side by side with America in almost every post-war conflict. The one major exception was the Vietnam War, arguably America’s biggest ever defeat. Put simply, America wins when it goes in with Britain, it loses when it does not. And Britain almost always stands shoulder to shoulder with its strongest ally. \nSo what happened? The Obama administration must be scratching their heads in wonder at how such a seemingly easy vote could go disastrously wrong. A relatively popular UK Prime Minister leading a Conservative Party that voted both for Afghanistan and Iraq, who seems to be on good terms with President Obama, facing off against a weak, divided left-wing opposition. To use an Americanism, it should have been a slam-dunk. \nAdditionally, unlike Iraq, where the evidence was highly contentious, it seems fairly reasonable to conclude Bashar Assad has attacked his people with chemical weapons. So why did the House of Commons say “nay” not “aye”? More On This... British Parliament votes against military action in Syria \nTo see this no vote as just about Syria does not fully explain the mentality in the UK. Instead, we must look at the state of the Anglo-American alliance. For most interventions do not directly serve British interests, but American. Britain therefore goes into battle because America is Britain’s strongest ally, and a strong America means a strong Great Britain. \nFor instance, although Britain recognized that Al Qaeda posed a serious threat to the UK, we intervened in Afghanistan because, as Tony Blair succinctly stated at the time, an attack on America was seen as an attack on Britain, such was the strength of the Special Relationship. \nWith Iraq throughout the nineties and in 2003, when America decided Hussein needed dealing with, Britain stepped up. When Clinton expressed broader foreign policy objectives and decided Milosevic needed taking care of in Serbia, Britain was there. There were other reasons too, but Britain’s attitude was “where our ally goes, we go.” \nBut not now. Why? \nThe answer lies in that Special Relationship. First re-established by President Reagan and Margaret Thatcher in the 1980’s after neglect during the Carter years, it has gone from strength to strength through multiple Prime Ministers and Presidents for decades. Then President Obama took the White House. \nObama's occasional photo ops with Cameron mask a horrifying truth underneath, that President Obama has obliterated the Anglo-American alliance since he took office, and is arguably one of the most anti-British Presidents of all time. \nWhen President Obama took office, one of his first moves was to remove a bust of Churchill that Bush had been given by Tony Blair in the wake of 9/11. It was a symbol that Britain stood by America, and Obama’s disposal of it spoke volumes. The Anglo-American alliance was a relic of the Bush era, and would be swept away. \nOther swipes, such as Obama’s false reference to BP as “British Petroleum,” his declaration that America had “no stronger ally” than France, the senior State Dept. official who said about Britain, “You’re just the same as the other 190 countries in the world. You shouldn’t expect special treatment” and the fact that not a single senior member of the Obama administration attended the funeral of Margaret Thatcher, all give indications about how Britain is seen in Obama’s America. \nYet the most galling snub to Britain comes in the form of the Falkland Islands dispute. Although British territory for centuries, and in the face of a population that consistently votes over 98% in favor of remaining British, Argentina have attempted to claim the Islands as their own. \nAfter losing a war against Britain in the 1980’s, Argentina adopted a new tactic, calling for ‘negotiations’ to the sovereignty of the Islands, hoping to at least get a chunk of the land. The Obama administration, speaking through then Secretary of State Hillary Clinton, sided against their best ally, and with Kirchner’s Argentina, demanding Britain sit down with Argentina and negotiate sovereignty of the British territory under the pretense of neutrality. \nAll this contributes to a strong signal from the Obama administration that Britain is really not that important to America anymore. \nIf that is the case, then why should Britain stick its neck out, and put British lives on the line in a conflict that does not directly serve British interests? The argument that Britain has a duty to support its ally is simply not compelling enough in the Obama era. \nLong ago President Obama decided that America didn’t need Britain anymore. As a consequence, Britain has now discovered that it doesn’t need America either. Mr. Obama is now paying for his poor judgment, and America is significantly weakened as a consequence. \nAdam Shaw is a News Editor for FoxNews.com. He can be reached here or on Twitter: @AdamShawNY . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}