{"organizations": [], "uuid": "65dbead9bb42a2517c1eb3df42c8010a0ebc9147", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2904446/images/o-MARIJUANA-BUD-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/06/heres-what-the-presidenti_n_7184508.html", "country": "", "title": "Here's Where The GOP's 2016 Presidential Contenders Stand On Marijuana Legalization", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Here's Where The GOP's 2016 Presidential Contenders Stand On Marijuana Legalization", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T19:30:00.000+03:00", "replies_count": 0, "uuid": "65dbead9bb42a2517c1eb3df42c8010a0ebc9147"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/06/heres-what-the-presidenti_n_7184508.html", "ord_in_thread": 0, "title": "Here's Where The GOP's 2016 Presidential Contenders Stand On Marijuana Legalization", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here's Where The GOP's 2016 Presidential Contenders Stand On Marijuana Legalization Posted: reddit \nWhile the federal government maintains a blanket ban on marijuana, recreational marijuana is already legal in four states and the District of Columbia. In addition, 23 states, as well as D.C., have legalized marijuana for medical purposes. \nAnd with at least 10 more states expected to consider legalization in some form by 2016, the next president of the United States will almost certainly have to reckon with the disparity between state and federal law on marijuana. \nRecreational marijuana -- which has been legalized in Colorado, Washington, Alaska and the District of Columbia, and will soon be legal in Oregon -- remains altogether illegal at a federal level under the 1970 Controlled Substances Act. The states that have legalized marijuana have only been able to do so because of federal guidance urging prosecutors to refrain from targeting state-legal marijuana operations. That guidance, however, could be reversed when a new administration enters the White House. \nHere are the positions that each of the GOP's many 2016 presidential hopefuls -- from the definitely-running to the definitely-maybes -- has taken on marijuana legalization. \nJeb Bush \nWhile presumptive presidential candidate and former Florida Gov. Jeb Bush personally embraced marijuana in high school , he has not embraced marijuana legalization during his political career. \nBut at the Conservative Political Action Conference in February, Bush gave his clearest articulation to date of how he’d handle the issue as president: by supporting states' rights. \nAsked by Fox News’ Sean Hannity whether Colorado’s legalization of marijuana was a good idea, Bush said it was a “bad idea\" and that he would have voted “no” were he living in the state at the time. But ultimately, he said, “states ought to have that right to do it.” \nMarco Rubio \nSen. Marco Rubio (R-Fla.), who announced his bid for the White House in April, has refused to disclose whether he's used marijuana in the past, so his personal experience with the plant remains unknown. But his stance on marijuana as a matter of policy is clear: He opposes legalization and decriminalization of recreational marijuana. \nRubio was recently asked about the issue in an interview on \"The Hugh Hewitt Show.\" Hewitt is a conservative radio host who has made a point to interview all the potential GOP presidential candidates and get them on the record on a number of pressing issues, including marijuana. He asked Rubio whether, as president, he would enforce federal drug laws and “shut down the marijuana trade” in states that have legalized the substance. \n“Yes,” Rubio replied. “Yes, I think we need to enforce our federal laws. I don’t believe we should be in the business of legalizing additional intoxicants in this country for the primary reason that when you legalize something, what you’re sending a message to young people is it can’t be that bad, because if it was that bad, it wouldn’t be legal.” \nIn that interview, Rubio didn’t take a direct stance on the question of states’ rights with regard to marijuana. However, a spokesman said earlier this year that Rubio \"of course\" believes states can make their own decisions about laws within their borders, which brings the senator's position closer to Bush's. \nWhen it comes to medical marijuana, Rubio's stance has been somewhat less hard-line. \n“You hear compelling stories of people who say the use of medicinal marijuana provides relief for the thing they are suffering,” Rubio told the Tampa Bay Times in 2014. “So I'd like to learn more about that aspect of it, the science of it.” \nThat same year, Rubio came out in favor of a bill in Florida that legalized the limited use of marijuana extracts for certain medical purposes. However, Rubio stops short of supporting broader medical marijuana laws that would allow cultivation, sale, production and distribution, the way medical cannabis laws in place in Colorado and California do. \nTed Cruz \nA spokesman for Sen. Ted Cruz (R-Texas) told the Daily Mail in February that when Cruz was a teenager, he “experimented” with marijuana, but that it was a “mistake” and that he never tried it again. \nAs a lawmaker, Cruz has vocally criticized President Barack Obama for permitting recreational marijuana laws to go into effect without federal intervention in the states that have legalized. But if Cruz, who announced his presidential candidacy in March, were to make it all the way to the White House, it appears that, like Bush, he’d respect the right of states to determine their own marijuana policies. \n“When it comes to a question of legalizing marijuana, I don’t support legalizing marijuana -- if it were on the ballot in the state of Texas, I would vote ‘no,’” Cruz said on \"The Hugh Hewitt Show\" in April. However, he went on to indicate that he wouldn't interfere with laws in those states that had passed recreational marijuana laws, including Colorado and Washington, which became the first two to do so in 2012. \n“But I also believe that’s a legitimate question for the states to make a determination,\" Cruz said. \"And the citizens of Colorado and Washington state have come to a different conclusion. They have decided they want to legalize it. I think it is appropriate for the federal government to recognize that the citizens of those states have made that decision.” \nRand Paul \nKentucky Sen. Rand Paul has been hesitant to go into great detail about whether he has previously used marijuana. But when asked about it late last year, he said , \"Let's just say I wasn't a choir boy when I was in college,\" adding that \"I made mistakes when I was a kid.\" \nAs a senator, the libertarian-leaning Paul has worked to reform draconian federal drug laws and is one of the original sponsors of a Senate bill that would significantly roll back federal restrictions on medical marijuana. Paul has also introduced several other bills aimed at reforming various aspects of the criminal justice system that have been warped by the war on drugs. \nPaul also backs the right of states to pass their own medical marijuana laws. \n“What I’m advocating for is allowing the federal government not to intervene with regard to medical marijuana, and that’s the only decision I’ve made, is that I would allow states to have medical marijuana, and make the decisions on medical marijuana within the state lines,” Paul told Hewitt in a recent interview. “So I’ve been opposed to people selling $300 worth of marijuana and getting 55 years in prison.\" \nWhile Paul hasn't come out in favor of recreational marijuana legalization, he appears to hold a position similar to Bush's and Cruz's, emphasizing states' rights with regard to adult-use laws on marijuana. \n\"I really haven’t taken a position with regard to Colorado’s law,\" he told Hewitt. \"I will tell you, though, that my general inclination is to try to give states more freedom to make a lot of these decisions.” \nPaul officially joined the race for the White House in April. \nChris Christie \nOf all the likely GOP contenders, New Jersey Gov. Chris Christie is the most vocal opponent of marijuana legalization in any form. \nDuring his time as governor, he has been a strong critic, saying that he believes the medical marijuana programs enacted in 23 states are a \"front\" for full recreational legalization. Last year, when asked how a President Christie would treat states that have legalized marijuana, he said, \"Probably not well.\" Speaking in March about the possibility of generating tax revenue by legalizing recreational marijuana in New Jersey, Christie said, \"Not on my watch.\" \nWhen asked by Hewitt last month if he would enforce federal drug laws in states that have legalized and regulated cannabis, Christie responded unequivocally. \n“Absolutely,” Christie said, “I will crack down and not permit it.\" Citing an \"enormous addiction problem\" in the U.S., Christie said that a clear message needs to be sent \"from the White House on down through federal law enforcement.\" \n\"States should not be permitted to sell it and profit\" from legalizing marijuana, he said. \nChristie, who has not yet announced a presidential run but has launched a political action committee, says he has never smoked pot. \nCarly Fiorina \n“I’m opposed to Prop. 19 and the legalization of marijuana,” former Hewlett-Packard CEO Carly Fiorina said in 2010, referring to the California ballot measure that sought to legalize recreational marijuana. \nFiorina made the comments during her ultimately unsuccessful campaign to unseat Sen. Barbara Boxer (D-Calif.). California voters ultimately rejected Proposition 19. \nFive years later, Fiorina’s stance doesn’t appear to have changed. In fact, her opposition may extend beyond recreational use. \nAt CPAC in February, Fiorina restated her opposition to recreational legalization, but also told a personal story about rejecting medical marijuana. \n“I remember when I had cancer and my doctor said, ‘Do you have any interest in medicinal marijuana?’” Fiorina recalled . “I did not.\" \n“And they said, good, because marijuana today is such a complex compound, we don’t really know what’s in it, we don’t really know how it interacts with other substances or other medicines,\" she continued. \nFiorina officially announced her run for the White House on Monday . \nMike Huckabee \nIt seems likely that former Arkansas Gov. Mike Huckabee, who doesn’t drink , used to oppose dancing and was once a Southern Baptist minister, has never tried marijuana. \nHuckabee, who announced on Tuesday that he is running for president, hasn't spoken in detail about the issue in some time, so his current stance isn't entirely clear. In the past, he has said that he's against increased access to any drugs, including marijuana, for recreational use. He told a medical marijuana patient in 2007 that he opposed the legalization of medical marijuana at the federal level, in part because he felt that there wasn't enough scientific information available about the plant's effects. \nMore recently, in 2014, Huckabee posted a detailed statement on his Facebook page that suggested he still opposed legalizing both recreational and medical marijuana. He wrote in the post that while Colorado's new law was generating significant tax revenue from marijuana sales, he remained concerned about the social costs of such measures. \n\"What is a young person supposed to think,\" Huckabee wrote, \"when the state says, 'Don’t do drugs…even though everyone around you is…and the same authority figures who tell you it’s bad not only condone it, but are also making a big profit off it'?\" \nJohn Kasich \nOhio Gov. John Kasich, who has said he’s considering running a presidential bid in 2016, appears to be taking a hard line on marijuana. \nDuring a recent interview with Hewitt , Kasich said he was “totally opposed” to the recreational marijuana laws in Colorado and Washington, but later appeared somewhat unsure about what he would do about those laws as president. Similarly, he struggled to explain how he'd handle conflicts between state marijuana law and federal law. \n“Would you enforce the federal law if you’re the president and shut down those markets?” Hewitt asked. “Well, I don’t, what’s the implications of that, Hugh?” Kasich replied. “I mean, the state has voted for it, you know what I mean? On what grounds would you shut them down?\" \n“Because it’s still a federal violation for them to operate that,” Hewitt said. \n“I don’t know,” Kasich said. “I’d have to think about it.” \nKasich went on to characterize the laws as a “states’ rights issue” and said he “probably would not” prosecute states for legalizing recreational marijuana, but added that he would oppose such laws in his own state. \n“I’m totally opposed to [legalizing drugs in Ohio], because it is a scourge in this country,” Kasich said. \"In my state and across this country, if I happened to be president, I would lead a significant campaign down at the grassroots level to stomp these drugs out of our country.\" \nRick Perry \nWhile former Texas Gov. Rick Perry opposed marijuana legalization in his state during his time in office, he strongly believes in states’ rights and, as president, would be unlikely to interfere with the states that have legalized. \n“I don’t agree with those decisions that were made by the state of Colorado or Washington, but I will defend it to my death, if you will, to allow them to make those decisions,” Perry told Hewitt recently . \nPerry has also been a proponent of reforming drug laws, especially for low-level nonviolent offenders. \n\"After 40 years of the war on drugs, I can’t change what happened in the past,” Perry said last year. “What I can do as the governor of the second-largest state in the nation is to implement policies that start us toward a decriminalization and keeps people from going to prison and destroying their lives, and that’s what we’ve done over the last decade.\" \nAs for personal experience with marijuana, Perry says he has never tried it . The former governor has not yet announced a run for president, but it appears likely that he will. \nGeorge Pataki \nFormer New York Gov. George Pataki seems set to announce a bid for the presidency. And if he were to win, Pataki would likely respect the rights of the states that have legalized marijuana -- especially for states that have done so via ballot initiative -- even though he personally opposes legalization. \n“I’m a great believer in the 10th Amendment,” Pataki said during an interview on “The Hugh Hewitt Show\" last month. “And I believe in both [Colorado and Washington] there were referenda where the voters approved. So I would be very strongly inclined to change the federal law to give states, when they’ve had a referenda, the opportunity with respect to marijuana to decriminalize it, except for two factors. One is we have to know that neighboring states or the rest of the country are not being subjected to illegal marijuana because of the free selling of it and marketing in those states, and second with respect to young people.” \nPataki added that he’s a “great believer” in states’ rights, which suggests that he shares the views of Perry, Cruz and Bush. \n“I think you uphold the federal law,\" Pataki continued. \"If you think it needs to be changed, you change it, but not so that you allow minors, dependency, criminality or spillover to other states to have an impact.” \nPataki has admitted to trying marijuana in his youth. \nScott Walker \nWisconsin Gov. Scott Walker has legalized the limited use of low-THC marijuana extracts for treatment against severe seizures in his state. However, he appears to still be opposed to broader legalization. \n\"From my standpoint, I still have concerns about making it legal,” Walker said last year . “I understand from the libertarian standpoint, the argument out there. I still have concerns. I'm not, unlike the president, I still have difficulty visualizing marijuana and alcohol in the same vein.\" \nThe governor says he has never used marijuana, and claims the “wildest” thing he ever did in college was drink beer. \nWalker has not yet announced his candidacy for president, but is expected to join the sprawling 2016 GOP field. \nRick Santorum \nFormer Pennsylvania Sen. Rick Santorum does not support marijuana legalization and believes that states that have legalized are in violation of federal law. \n“I think federal laws should be enforced, and I think Colorado is violating the federal law,” Santorum told Hewitt. “And if we have controlled substances, they’re controlled substances for a reason. The federal law is there for a reason, and the states shouldn’t have the option to violate federal law. As Abraham Lincoln said, you know, states don’t have the right to wrong.” \nSantorum, who is currently weighing a presidential run, has admitted to trying marijuana in college, though he says he’s “not proud” of it. \nBobby Jindal \nWhile Louisiana Gov. Bobby Jindal has said he’s open to a tightly controlled legal medical marijuana program in Louisiana, he remains opposed to recreational marijuana legalization. \n“In Louisiana, we’ve certainly supported efforts towards smarter sentencing,” Jindal told Hewitt . “You know, if there are folks we can rehabilitate and it would be more cost effective for taxpayers and better for them, I’m for that. I have said if it was tightly controlled with a doctor’s supervision, I could even be okay with medical marijuana. But I’m not for legalization.” \nWhen Hewitt asked whether Jindal would “bring the federal hammer down” on marijuana dispensaries that have opened in states that have legalized, the Louisiana governor did not come out in favor of states’ rights. \n“Yeah, look, I don’t think you can ignore federal law,” Jindal said. “Federal law is still the law of the land. It still needs to be enforced.” \nAs far as personal marijuana use goes, Jindal said he has never experimented with any drugs. He hasn’t launched a campaign for the White House yet, but is considered a potential “dark horse” candidate. \nLindsey Graham \nThere is a 91 percent chance Sen. Lindsey Graham (R-S.C.) will run for president in 2016, according to Lindsey Graham. \nGraham says he’s opposed to legalizing marijuana for recreational purposes , but has left the door open on medical marijuana. \n“When it comes to medicinal marijuana and [medical marijuana-derived] oil, I think politicians should embrace what makes sense,” Graham said. “When it comes to issues like this, I don't want to be academic in thought. This is about people. This is about families with sick children. Why should someone in my position get in the way of helping a child, if you can reasonably and logically do it?\" \nOn states’ rights, Graham’s position is unclear. However, after Washington, D.C., legalized recreational marijuana use, the South Carolina Republican didn’t show much interest in interfering. \n“To be honest, that’s pretty far down my list of priorities,” Graham said regarding an effort to block legalization in the District. \nBen Carson \nRetired neurosurgeon Ben Carson, who announced his White House bid on Sunday, has stated his opposition to recreational marijuana use in socially conservative terms. \n\"I don't think this is something we really want for our society,\" Carson said . \"You know, we're gradually just removing all the barriers to hedonistic activity. We're changing so rapidly to a different type of society, and nobody is getting a chance to discuss it because it's taboo.\" \nBeyond that, Carson's views on legalization remain unclear. The former chief of pediatric neurosurgery at Johns Hopkins University Medical School has suggested that he may be more open to medical marijuana, saying that use in “compassionate cases certainly has been proven to be useful.” \n(None of the candidates and potential candidates discussed in this story responded to The Huffington Post's request for comment about their positions on the issue.) Also on HuffPost: ", "external_links": [], "published": "2015-05-06T19:30:00.000+03:00", "crawled": "2015-05-06T21:37:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}