{"organizations": ["Senate", "Fox News Facebook", "Twitter"], "uuid": "0937318c182db02a8d46d72fbb6c56d6e8062946", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/07/25/why-is-obama-awol-on-gillibrand-bill-to-curb-military-sexual-assault/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422594511297.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/25/why-is-obama-awol-on-gillibrand-bill-to-curb-military-sexual-assault.html", "country": "", "title": "Why is Obama AWOL on Gillibrand's bill to curb military sexual assault? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Why is Obama AWOL on Gillibrand's bill to curb military sexual assault? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "0937318c182db02a8d46d72fbb6c56d6e8062946"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/25/why-is-obama-awol-on-gillibrand-bill-to-curb-military-sexual-assault.html", "ord_in_thread": 0, "title": "Why is Obama AWOL on Gillibrand's bill to curb military sexual assault? | Fox News", "locations": ["Washington", "Capitol Hill"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gillibrand", "Kirsten Gillibrand", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print FILE -- Jan. 28, 2009: Sen. Kirsten Gillibrand, (D-N.Y.), listens to testimony on Capitol Hill in Washington during a Senate Foreign Relations Committee hearing. (AP) \nSome things that happen in Washington, D.C., have come to be expected, such as hyper-partisanship in the Congress along sharp \"red\" vs. \"blue\" lines. \nNew York Sen. Kirsten Gillibrand (D) has assembled a remarkable bipartisan coalition of senators to support her modest proposal, the Military Justice Improvement Act, which would guarantee that decisions whether to investigate and prosecute allegations of unwelcome sexual contact within the military would be made outside of the chain of command where the alleged assault occurred. \nCurrently, such decisions are made by the superior officers in the chain of command directly above the alleged victim. \n[pullquote] \nThe senator’s proposal has received notable bipartisan and diverse ideological support. When is the last time you saw a list of supporters that included conservative Republican Sens. Ted Cruz (Texas), Rand Paul (Ky.), and David Vitter (La.) on the same side of an issue as well-known progressive Sens. Bernie Sanders (I-Vt.), Al Franken (D-Minn.), Barbara Boxer (D-Calif.) and Elizabeth Warren (D-Mass.)? More On This... Bill to overhaul military justice system gains support \nOne reason for this breadth of support is Gillibrand's skillfully crafted moderate and modest approach to the proposed reform. \nFor example, the proposal does not assign to a civilian authority such decisions to investigate or prosecute. Rather it would retain these decisions within the Judge Advocate General (JAG) office to be made by an experienced attorney not in the immediate chain of command above the complainant. \nNote also, the definition of the \"unwanted sexual contact\" complaints to be affected by the senator's proposal is limited to intentional unwelcome conduct. That means intent must be proved; force against the individual's will must be proved; and contact must be proved, i.e., obnoxious, harassing, or even abusive words or gestures are not subject to this proposal. \nNote also that the proposal also takes into account the needs of commanding officers by excluding 37 serious crimes unique to the military, such as going AWOL, as well as all misdemeanor type crimes, so it is not an all-or-nothing approach. \nThere is more than enough data to support the common-sense assumption that those who are victims of military sexual assault may be discouraged to report an incident, knowing that only those immediately above them in their chain of command will decide whether to investigate or prosecute. \nFor example, according to the Pentagon's own data, of the active duty women who indicated experiencing unwelcome sexual conduct, 66 percent said they felt uncomfortable making a report within their chain of command and 47 percent indicated fear of retaliation or reprisal. \nEven the top military leadership doesn't attempt to deny the obvious. The Commandant of the Marine Corps, Gen. James Amos, stated this year that victims do not come forward because \"they don't trust the chain of command.\" \nSo how is it possible that President Obama allowed his Defense Secretary, Chuck Hagel, to oppose the legislation in testimony before the Senate Armed Services Committee? \nThis is one of those instances where, try as I might, I just can't understand the opposition's reasoning. \nSix-term Michigan Democratic Sen. Carl Levin, whom I have known and admired for more than three decades (he was first elected in 1978), believes his alternative proposal approved by the committee — which requires automatic reviews of a commander's decision not to prosecute — was a reasonable compromise. \nBut, with all due respect, that to me doesn't address the reality of the perception by potential sexual assault victims of a conflict of interest or possible retaliation. The Joint Chiefs’ reason for opposition, that the proposal \"undermines good order and discipline,\" is conclusory and, respectfully, as far as I can tell, not based on facts. \nSo I hope Obama decides to support this amendment when it comes to the Senate floor. There are already 42 senators ready to support it, with another nine votes very possible, given the moderation of the proposal. \nAfter all, this purple moment when Paul and Sanders agree on something doesn't happen very often. Obama should be ready to lead and support Gillibrand’s proposal, especially when the need for a perceived independent process for protecting victims of sexual assault seems so obvious and the downside so unclear. \nMaybe, just maybe, Obama can make this moment a precedent for more purple moments in Congress in the remainder of his term. Goodness knows \"this town\" needs them. \nLanny Davis, a Washington attorney and principal in the firm of Lanny J. Davis & Associates, specializing in legal crisis management and dispute resolution, served as President Clinton's special counsel from 1996-98 and as a member of President Bush's Privacy and Civil Liberties Oversight Board from 2006-07. He currently serves as special counsel to Dilworth Paxson and is the author of the new book, \" Crisis Tales: Five Rules for Coping With Crises in Business, Politics, and Life ,\" (Simon & Schuster March 2013). Follow him on Twitter at @LannyDavis . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:15:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}