{"organizations": [], "uuid": "3033ff13db08ed325e7e1858b2ead42dc3d9096c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2946092/images/o-BARACK-OBAMA-MARCO-RUBIO-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/13/marco-rubio-barack-obama-quiz_n_7274674.html", "country": "", "title": "Who Said It: Marco Rubio Or Barack Obama?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Who Said It: Marco Rubio Or Barack Obama?", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "3033ff13db08ed325e7e1858b2ead42dc3d9096c"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/13/marco-rubio-barack-obama-quiz_n_7274674.html", "ord_in_thread": 0, "title": "Who Said It: Marco Rubio Or Barack Obama?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marco Rubio", "Barack Obama", "Win McNamee"], "text": "reddit Win McNamee via Getty Images \nWASHINGTON -- A young, fresh-faced senator full of optimism for what America can be is once again running for president. No, it's not 2008's Barack Obama, who instilled hope in a war-weary and financially rattled nation. It's Sen. Marco Rubio (R-Fla.), a 43-year-old son of Cuban immigrants who is touting his compelling family story as an example of why, to borrow a familiar phrase, \"you can make it here in America if you're willing to try.\" \nBut as he mounts his bid for the White House in 2016, Rubio is facing the same questions then-Sen. Obama faced in 2008. Is he too inexperienced -- he's only been in Washington since January 2011 -- to take on the challenges of the highest office in the land? Does he have enough executive experience, especially compared to the number of Republican governors running for office? \nGoing into his campaign, Rubio is positioning himself much like Obama -- who eventually successfully parried concerns made by then-Sen. Hillary Clinton (D) -- did so many years ago: as the agent of change and the voice of a new generation. In fact, there's some striking rhetorical similarities between the two men. See if you can spot the differences in the quiz below. Who Said It: Marco Rubio Or Barack Obama? Question 1 of 10 Yesterday is over, and we are never going back. We Americans are proud of our history, but our country has always been about the future. Barack Obama Marco Rubio Question 2 of 10 What is unique about America is that we want these dreams for more than ourselves - we want them for each other. That's why we call it the American dream. Barack Obama Marco Rubio Question 3 of 10 What bothers me most about my country today is that there are Americans like me — Americans who have worked hard and tried to do the right things to get ahead — but whose lives aren’t so blessed. Barack Obama Marco Rubio Question 4 of 10 For almost all of human history, power and wealth belonged only to a select few. Most people who have ever lived were trapped by the circumstances of their birth, destined to live the life their parents had. But America is different. Barack Obama Marco Rubio Question 5 of 10 When our fellow Americans are denied the American dream, our own dreams are diminished. And today, the cost of that dream is rising faster than ever before. Barack Obama Marco Rubio Question 6 of 10 Hard working families living paycheck to paycheck, one unexpected expense away from disaster. Young Americans, unable to start a career, a business or a family, because they owe thousands in student loans for degrees that did not lead to jobs. Barack Obama Marco Rubio Question 7 of 10 We know it won't be easy. We'll hear from the can't-do, won't-do, won't-even-try crowd in Washington; the special interests and their lobbyists; the conventional thinking that says this country is just too divided to make progress. Barack Obama Marco Rubio Question 8 of 10 My candidacy might seem improbable to some watching from abroad. In many countries, the highest office in the land is reserved for the rich and powerful. Barack Obama Marco Rubio Question 9 of 10 It is a dream lived by countless people whose stories will never be told. Americans that never made a million dollars, never owned a yacht, a plane or a second home. And yet, they too lived the American dream. Barack Obama Marco Rubio Question 10 of 10 What is unique about America is that we want these dreams for more than ourselves - we want them for each other. That's why we call it the American dream. Barack Obama You are not logged in so your score won't be recorded. Click here to login. 0:00 ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T00:35:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}