{"organizations": ["IRS", "Fox News IRS"], "uuid": "a6c91b748e078fbea8e442e6e993cc07bc2e6203", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/07/19/will-irs-scandal-lead-all-way-to-obama-white-house/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422591208419.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/19/will-irs-scandal-lead-all-way-to-obama-white-house.html", "country": "", "title": "Will IRS scandal lead all the way to Obama? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Will IRS scandal lead all the way to Obama? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "a6c91b748e078fbea8e442e6e993cc07bc2e6203"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/19/will-irs-scandal-lead-all-way-to-obama-white-house.html", "ord_in_thread": 0, "title": "Will IRS scandal lead all the way to Obama? | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Issa", "Obama"], "text": "IRS scandal takes a personal turn for Reps. Issa, Cummings \nFor the first time, congressional investigators heard not just from one of those very “line people” blamed for the scandal but also from a senior IRS attorney in Washington who was directly involved in the process at the very highest levels. \nAnd, for the first time, congressional investigators heard candor and truth. \nDid the IRS scandal originate with “line people”? No. In fact, Elizabeth Hofacre, the Ohio agent charged with processing Tea Party applications, was so frustrated with IRS actions that she asked for – and received – a transfer from her original position to escape from IRS dictates that came from Washington, D.C. \nEven worse, we now know – thanks to Carter Hull – a retired Washington tax specialist who was responsible for providing guidance on reviewing tax-exempt applications for Tea Party groups – that the scandal goes all the way to the IRS chief counsel’s office. In fact, it was the chief counsel’s office – not the “line people” that redoubled efforts to scrutinize conservatives. Here’s a key portion of Mr. Hull’s testimony: \n\"In August 2011 I attended a meeting at which the applications assigned to me were discussed. I recall that Don Spellman, David Marshall, and Amy Franklin from Chief Counsel’s office were at the meeting... I recall that Ms. Franklin or someone else from Chief Counsel’s office stated that more current information was needed for my applications and that a second development letter should be sent to the applicants. I also recall the discussion about the creation of a template development letter for Tea Party applications.\" \nThis is extraordinary, suggesting that it was the IRS chief counsel’s office, not rogue agents in Ohio, who engineered the key abuses in the targeting scandal, including the extraordinarily-intrusive questionnaires that asked conservative groups for donor lists, Internet login information, social media pages, and even the political and charitable activities of family members. \nHull went on to testify that he had not seen anything like that in almost 50 years of work at the IRS. \nTo be clear, IRS Chief Counsel William Wilkins is a political appointee, appointed by President Obama in 2009 – the top lawyer in the agency. The involvement of his office – as early as 2011 – represents a dramatic escalation of the IRS scandal. \nThe previous IRS explanation – a bureaucratic mistake, originating in Ohio – was bad enough. This explanation is much worse. With the involvement of the IRS’s top legal office more than two years ago, the questions now become eerily reminiscent of earlier Washington scandals. \nWhat was discussed at the more 100 meetings between the IRS Commissioner and White House meetings? \nWhy was President Obama’s political operative, Stephanie Cutter, included in meetings with the IRS? \nIn other words, what did the White House know, and when did it know it? \nI am the lead lawyer in the ACLJ’s lawsuit against the IRS on behalf of 41 conservative groups in 22 states. From the beginning we knew the IRS’s public story was false. We have documents showing the abuse stretched from coast-to-coast and originated from IRS offices from coast-to-coast. \nFrom my own experience as an IRS tax trial attorney, I knew that abuse so widespread could not possibly be originated or sustained from just a few “line people.” \nNow the evidence is in, and the scandal is moving up from Cincinnati and deep into the ranks of key Obama administration officials. \nHow high will it go? Could this end up at the Oval Office? The evidence will tell the tale. \nJay Sekulow is Chief Counsel of the American Center for Law and Justice (ACLJ), which focuses on constitutional law. He is a New York Times bestselling author. Jay's latest book \" UNDEMOCRATIC: How Unelected, Unaccountable Bureaucrats Are Stealing Your Liberty and Freedom \" will be published on May 19. He hosts \"Jay Sekulow Live\" -- a daily radio show which is broadcast on more than 850 stations nationwide as well as Sirius/XM satellite radio. Follow him on Twitter @JaySekulow . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}