{"organizations": [], "uuid": "077f1fbf73bcebbe2fa96bfda82559a09700a47d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2015/05/27/first-jewish-president/_jcr_content/par/featured-media/media-0.img.jpg/0/0/1432736405663.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/opinion/index.html", "section_title": "Opinion &amp; Analysis on the Latest Breaking News | Fox News", "url": "http://www.foxnews.com/opinion/2015/05/27/first-jewish-president.html", "country": "US", "title": "Barack Obama: America's first Jewish president?", "performance_score": 0, "site": "foxnews.com", "participants_count": 19, "title_full": "Barack Obama: America's first Jewish president? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T03:00:00.000+03:00", "replies_count": 18, "uuid": "509e7ede2c557c717a8daddfbad808ec22ef7cc9"}, "author": "Zev Chafets", "url": "http://www.foxnews.com/opinion/2015/05/27/first-jewish-president.html#post-0", "ord_in_thread": 0, "title": "Barack Obama: America's first Jewish president?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Zev Chafets\nPublished May 27, 2015 Facebook May 22, 2015: President Obama smiles as he speaks at Adas Israel Congregation in Washington, Friday , as part of Jewish American Heritage Month. The president addressed one of the largest Jewish congregations in Washington to highlight efforts to combat anti-Semitism, a problem he says has created an intimidating environment worldwide for Jewish families. The appearance coincides with Solidarity Shabbat, devoted to showing unity by political leaders in Europe and North America against anti-Semitism. (AP Photo/Jacquelyn Martin)\nIn March, 2013, President Barack Obama paid a state visit to Israel. At the airport he introduced Israeli Prime Minister Netanyahu to his staff. One was Benjamin Rhodes, his deputy national security advisor and speechwriter.\n“If I say anything offensive, it’s because of him,” Obama told Netanyahu in a jocular tone, according to various news reports. Bibi smiled thinly. He and Obama had a habit of offending one another and there was reason to suppose it would be different this time.\nObama told Bibi that not only was Ben Rhodes a VIP, but his brother David was the head of CBS News. “Talk about having a proud Jewish mother!”\nNetanyahu refrained from commenting on Mrs. Rhodes’ good fortune or Obama’s ploy transparent ploy: If Ben Rhodes (and his proud Jewish mother!) think my policies are kosher, who are you to say otherwise?\nObama is clearly vexed by the failure of Israelis to live up to his high expectations of them or to appreciate the deep love that his incessant criticism expresses.\nSince that visit, relations between the two leaders have grown steadily worse. This presents a problem for Obama, who rightly thinks that Bibi is encouraging Congress to block the nuclear deal with Iran, and rousing American public opinion against the president’s goal of establishing a Palestinian state in the West Bank and Gaza with eastern Jerusalem as its capital.\nLast Friday, to celebrate Jewish Heritage Month, Obama took his resentment against Netanyahu and disappointment with Israel to the Jewish public. His venue was Washington’s historic Adas Israel Synagogue. Wearing a gold colored bar mitzvah-boy skullcap, he stood on the pulpit and proudly reminded the audience that journalist Jeffrey Goldberg—a member of that very congregation--had once dubbed him, “America’s first Jewish President.”\nWhen the applause and laughter subsided, Obama admitted that it was not literally true, but he was flattered by the conceit and would be speaking as an “honorary member of the tribe.”\nObama’s speech focused on Jewish values. He began by praising American Jewry’s role in supporting the civil rights struggle of the 1960s. He lamented the recent rise of international anti-Semitism and pledged to fight it (although he refrained from actually naming the perpetrators).\nWhen he came to the subject of Israel, he grew nostalgic. As a young man, he told the audience, he had been inspired by the justice of Israel’s creation, its pioneering spirit and its wonderful values. He especially admired former Golda Meir and General Moshe Dayan—both dead for decades (and both of whom would have been horrified by Obama’s vision of a Palestinian state or his nuclear diplomacy). If there are living Israelis Obama approves of (other than Jeff Goldberg, who is a dual citizen), he didn’t mention them.\nThe president called the American-Israeli relationship “unbreakable.” And he denounced those who say that he is not a friend and supporter of the Jewish State. In fact, he loves the place. “[And] it is precisely because I care so deeply about the state of Israel -- it’s precisely because, yes, I have high expectations for Israel the same way I have high expectations for the United States of America -- that I feel a responsibility to speak out honestly about what I think will lead to long-term security and to the preservation of a true democracy in the Jewish homeland.”\nA Palestinian State is, in Obama’s view, not merely good policy but a moral imperative. “The rights of the Jewish people [to have a state] then compel me to think about a Palestinian child in Ramallah that [sic] feels trapped without opportunity. That’s what Jewish values teach me.”\nThere are some Jews who agree. But they constitute a small minority in Israel. Most Israelis do not see creating a PLO-Hamas regime within a few miles of Tel Aviv as a Jewish value—certainly not one that trumps national security and common sense.\nThat was the unmistakable meaning of the recent Israeli election and, indeed, of every Israeli election in the past twenty years. It will likely remain the prevailing sentiment as long Hamas and the Palestinian grassroots regard the Jewish state as illegitimate, and the international jihad sees Israel as a strategic target.\nObama is clearly vexed by the failure of Israelis to live up to his high expectations of them or to appreciate the deep love that his incessant criticism expresses. If only they could be more like Benjamin Rhodes or David Axelrod or that nice rabbi at the synagogue who let him hold the Torah. Instead, he gets stuck with Bibi Netanyahu. And what does he know about Jewish values?\nZev Chafets is a Fox News contributor. His latest book is \" Remembering Who We Are: A Treasury of Conservative Commencement Addresses \" (Sentinel 2015).\n ", "external_links": [], "published": "2015-05-27T03:00:00.000+03:00", "crawled": "2015-05-28T00:49:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}