{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "1b66f5077fd6bd343755fb40d65d641992ef7112", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/082813/0/0/082813_dcl_bayefsky_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/26/can-obama-act-on-syria-without-appearing-to-be-hypocrite-or-fraud.html", "country": "", "title": "Can Obama act on Syria without appearing to be a hypocrite or a fraud? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Can Obama act on Syria without appearing to be a hypocrite or a fraud? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "1b66f5077fd6bd343755fb40d65d641992ef7112"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/26/can-obama-act-on-syria-without-appearing-to-be-hypocrite-or-fraud.html", "ord_in_thread": 0, "title": "Can Obama act on Syria without appearing to be a hypocrite or a fraud? | Fox News", "locations": ["Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nThe Syrian problem threatens the very core of the Obama doctrine. Bashing President Bush for doing an end run around the U.N. Security Council over Iraq was Obama’s nom de guerre . \nWith Russia's leaders making it clear that they are not going to approve a Council resolution authorizing the use of force against Syria, how can the president act without appearing to be a hypocrite or a fraud? The answer is: he can’t. \nIn the case of Libya, a Security Council resolution was sufficiently general that the United States and its allies could claim there was approval for military action and the removal of Col. Muammar Qaddafi. It was March 17, 2011 and the Council authorized member states “acting nationally or through regional organizations or arrangements ... to take all necessary measures ... to protect civilians” in Libya. The Russians aren’t about to make the same mistake twice. \n[pullquote] \nRussian Foreign Minister Sergei Lavrov said on Monday that \"using force without the approval of the UN Security Council is a very grave violation of international law.\" Russian and Chinese vetoes have already been cast three times on Syria over what even former U.N. Ambassador Susan Rice called “very mild resolutions” that didn’t even contain sanctions. If France, Britain or the United States try again, they can expect a fourth nyet . More On This... Syria a prelude to a decade of war in the Middle East? \nThis leaves President Obama with a serious quandary. When President Bush asked the Security Council for the 18th resolution on Iraq, he set up the Council as the legitimatizing institution. \nFailing to get that stamp of approval then destroyed his chances of cogently arguing a resolution wasn’t necessary in the first place. \nThe dilemma is multiplied many times over for President Obama, who has said umpteen times that the U.N. is the center of his universe. As recently, as last Friday, the president told CNN: “If the U.S. goes in and attacks another country without a U.N. mandate and without clear evidence that can be presented, then there are questions in terms of whether international law supports it…” Lavrov couldn’t agree more. \nIn September 2009, President Obama bounded up to the U.N. General Assembly podium and announced: “We've re-engaged the United Nations… We have sought…a new era of engagement with the world.” He would “begin a new chapter of international cooperation” and he promised “we will work with the U.N.” In short, Gulliver marched into the UN and demanded to be tied down. \nDitto with the U.N. Human Rights Council. Having lectured for five years that this anti-American anti-Israel cesspool is the best place to handle the world’s human rights problems, how is the President going to explain that it isn’t up to the task? \nIn theory the Syria problem is right up the U.N. alley. Purpose number one of the U.N., according to its Charter, is “to maintain international peace and security.” Protecting human rights of people within a state has become a matter of international peace and security in Syria for lots of reasons. 1.8 million refugees in Lebanon, Jordan, Turkey, and Iraq, battles in Lebanon with pro-Assad Hezbollah forces, and the involvement of foreign combatants in Syria, to name a few. \nSyria is not just about saving Syrians from Syrians. In fact, it is about the international tentacles of Iran – Assad’s essential benefactor. \nHere, however, the president runs into another of his U.N. messes. Susan Rice told reporters on her way out the U.N. door in June, that together with Russia the administration had “been able to find common ground and to effect beneficial outcomes” on thwarting Iran. A Russian veto at this stage blows this U.N. accomplishments storyline to smithereens. \nSo administration lawyers have been hitting the books desperate for a legal cover. No doubt, it has been a tough slog. Until now, the self-styled human rights president has not been moved to intervene forcefully despite a death toll of 100,000 and counting. Why should another 355 who happened to die from chemical weapons, rather than torture, beheadings, sexual violence, or various other hideous endings, change the equation? \nTo compound the lawyers’ difficulties, President Obama is famously known for a 2002 speech in which he said ‘no’ to intervention in Iraq despite that fact that Saddam Hussein “is a brutal man. A ruthless man. A man who butchers his own people to secure his own power.” By then Hussein had killed thousands of his own citizens with sarin and mustard gas. So what makes Bashar Assad’s alleged offense different? \nThe likelihood is that the legal beagles will try the still fledgling, not yet legal, idea of a “responsibility to protect” or try invoking NATO action in Kosovo – a policy which might more accurately be called ‘to hell with the U.N..’ \nWhat they are unlikely to try is the most obvious and genuine legal justification for military action against Syria, absent U.N. approval: self-defense. \nIn our age of advanced weaponry, sophisticated technology and undeniable interconnectedness, “Syria” threatens the peace and security of America and our closest democratic ally, Israel. \nToday’s Syria is a toxic combination of Islamic fanatics, terrorists of all kinds, stockpiles of horrible chemical weapons, and depraved Iranian masters poised to acquire the world’s most dangerous weapon. \nA self-defense rationale isn’t available to President Obama, however, without a major foreign policy course correction. \nHe would have to acknowledge a real and sufficiently imminent Iranian threat. \nHe would have to admit his responsibility to protect Americans from Iran immediately, and not after another fake round of talks. \nAnd, he would have to support openly, and in multiple ways, Israel’s sovereign right to strike Iran as well. \nHistory suggests he will prefer legal babble and humanitarianism for everyone but Americans. \nAnne Bayefsky is director of the Touro Institute on Human Rights and the Holocaust. Follow her on Twitter @AnneBayefsky . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:14:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}