{"organizations": ["Fox News Psychiatrist"], "uuid": "0ee144dc7ce974da4bc38ec207899cf28adab8e1", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2916274/images/o-KEITH-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/05/men-veto-womens-abortions-keith-ablow_n_7216150.html", "country": "", "title": "'Men Should Be Able To Veto Women's Abortions,' Says Fox News Psychiatrist", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "'Men Should Be Able To Veto Women's Abortions,' Says Fox News Psychiatrist", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "0ee144dc7ce974da4bc38ec207899cf28adab8e1"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/05/men-veto-womens-abortions-keith-ablow_n_7216150.html", "ord_in_thread": 0, "title": "'Men Should Be Able To Veto Women's Abortions,' Says Fox News Psychiatrist", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nFox's Keith Ablow thinks getting an abortion should be a two-person decision. \n“I think men should be able to veto women’s abortions if they’re willing to care for the child after it’s born,” the psychiatrist said on Tuesday’s episode of \"Outnumbered.\" \nNone of the show’s four female panelists challenged the statement, though they did swiftly bring the conversation back to the topic at hand: actress Sofia Vergara’s ongoing legal battle with ex Nick Loeb over frozen embryos the couple had created while still together. Vergara has said she wants the embryos to remain frozen, but Loeb wants the right to bring them to term without her consent should he choose to. \nAblow’s musings on abortion veto rights weren’t really relevant to this conversation, since Vergara and Loeb’s embryos are frozen rather than inside the body of a pregnant woman. \nHowever, Ablow had plenty of thoughts on Vergara and Loeb, too. \n“If he wants to bring these embryos to term, good for him,\" he said. \"If he wants to parent, if he wants to have them adopted, good for him.\" \nIn a 2011 opinion piece , Ablow said that if a man gets a woman pregnant, he should be able to stop her from getting an abortion. Additionally, he wrote that the pregnant woman should be legally penalized for “psychological suffering and wrongful death” if she has one anyway. \n“If a man has participated in creating a new life and is fully willing to parent his child (independently, if necessary), why should he not have any control over whether that life is ended?” he asks in the piece, as if unaware of which person’s body a fetus resides inside for nine months. ", "external_links": [], "published": "2015-05-06T03:00:00.000+03:00", "crawled": "2015-05-06T10:41:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}