{"organizations": [], "uuid": "bc49479036ae2e453c715d677c2a8bffb6547afa", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2995384/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/26/obama-nsa-legislation_n_7443466.html", "country": "", "title": "Obama Urges Senate To Reach Deal On Surveillance Legislation", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Urges Senate To Reach Deal On Surveillance Legislation", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T20:45:00.000+03:00", "replies_count": 0, "uuid": "bc49479036ae2e453c715d677c2a8bffb6547afa"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/26/obama-nsa-legislation_n_7443466.html", "ord_in_thread": 0, "title": "Obama Urges Senate To Reach Deal On Surveillance Legislation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama Urges Senate To Reach Deal On Surveillance Legislation Reuters reddit \nWASHINGTON, May 26 (Reuters) - President Barack Obama on Tuesday urged the U.S. Senate to resolve its impasse over legislation authorizing collection of Americans' telephone records.The National Security Agency program is set to expire on June 1 unless Congress agrees to extend the program temporarily or replace it with an alternative passed by the U.S. House of Representatives.Obama, in remarks to reporters in the Oval Office, urged senators to work through a congressional recess to address the issue. (Reporting by Jeff Mason; Editing by Bill Trott) Also on HuffPost:   This June 9, 2013, file photo provided by The Guardian in London shows Edward Snowden, who worked as a contract employee for the National Security Agency, in Hong Kong. (AP Photo/The Guardian, Glenn Greenwald and Laura Poitras, File) In this image made from video released by WikiLeaks on Oct. 11, 2013, former National Security Agency systems analyst Edward Snowden speaks during a presentation ceremony for the Sam Adams Award in Moscow. (AP Photo) A frame grab made from AFPTV footage, reportedly taken on Oct. 9, 2013, shows U.S. intelligence leaker Edward Snowden speaking during his dinner with a group of four retired U.S. intelligence workers and activists at a luxurious room in an unidentified location. (AFPTV/AFP/Getty Images) In this image made from video released by WikiLeaks on Oct. 11, 2013, former National Security Agency systems analyst Edward Snowden smiles during a presentation ceremony for the Sam Adams Award in Moscow. (AP Photo) In this image made from video released by WikiLeaks on Oct. 11, 2013, Edward Snowden (center) receives the Sam Adams Award in Moscow. (AP Photo) This photo, taken June 9, 2013, in Hong Kong, provided by The Guardian in London shows Edward Snowden, who worked as a contract employee for the National Security Agency. (AP Photo/The Guardian) This handout file photo taken on July 12, 2013, and made available by Human Rights Watch shows NSA leaker Edward Snowden during his meeting with Russian activists and officials at Sheremetyevo airport, Moscow. (AP Photo/Tatyana Lokshina, Human Rights Watch HO, file)  Share ", "external_links": [], "published": "2015-05-26T20:45:00.000+03:00", "crawled": "2015-05-26T20:45:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}