{"organizations": [], "uuid": "4539be1590e1170fe5088462da2f67d81d43d92c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/28/feed#", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/overnights/242438-overnight-energy-obama-looks-to-change-endangered", "country": "US", "title": "OVERNIGHT ENERGY: Obama moves to overhaul Endangered Species Act", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "OVERNIGHT ENERGY: Obama moves to overhaul Endangered Species Act", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T00:55:00.000+03:00", "replies_count": 0, "uuid": "4539be1590e1170fe5088462da2f67d81d43d92c"}, "author": "dhenry@thehill.com (Devin Henry)", "url": "http://thehill.com/policy/energy-environment/overnights/242438-overnight-energy-obama-looks-to-change-endangered", "ord_in_thread": 0, "title": "OVERNIGHT ENERGY: Obama moves to overhaul Endangered Species Act", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OVERNIGHT ENERGY: Obama moves to overhaul Endangered Species Act By Devin Henry - 05/18/15 05:55 PM EDT \nOBAMA'S ENDANGERED SPECIES OVERHAUL BEGINS: The Obama administration announced the first of what it promises will be a handful of changes to the Endangered Species Act (ESA) on Monday, promising to give states more input on future listings under the law. \nOfficials from the agencies that oversee the ESA said Monday that they will soon require input from state wildlife agencies on any petition for a new ESA listing. ADVERTISEMENT The move is designed to give states more control over the implementation of the law. Officials said it is the first step in a year-long effort to make the ESA \"more nimble, transparent and ultimately more effective,\" as U.S. Fish and Wildlife Service Director Dan Ashe put it in a statement. \nRepublicans on Capitol Hill have increasingly looked to overhaul the ESA, saying it has become too much of a hindrance for landowners and users. Top GOP committee chairmen have been looking for ways to reform the law this session. \nRead more here . \nON TAP TUESDAY I: Senate Republicans will hold two separate hearings on the Environmental Protection Agency's \"waters of the United States\" rule. \nThe Senate Environment and Public Works' fisheries, water and wildlife subcommittee will hear testimony on a bill from Sen. John Barrasso (R-Wyo.) to overhaul the EPA's proposed rule, which would allow the agency to redefine which streams, ponds and waterways are under its jurisdiction. A representative from New Belgium Brewing Company is scheduled to testify, alongside local officials from Vermont, Kansas, Colorado and Maryland. \nThe Senate Small Business and Entrepreneurship Committee is scheduled to consider the regulation's impact on small businesses. Charles Maresca, the director of interagency affairs at the Small Business Association's Office of Advocacy, will be among the witnesses. \nON TAP TUESDAY II: The Senate Energy and Natural Resources Committee will consider proposed energy supply legislation. More than two-dozen bills are on the agenda . \nRest of Tuesday's agenda ... \nInterior Secretary Sally Jewell and Idaho Gov. Butch Otter (R) will announce a strategy for dealing with sagebrush and rangeland wildfires in the western United States. \nThe House Energy and Commerce Committee will hold a hearing on energy reliability and security bills. Michael Bardee, the director of the Office of Electric Reliability at the Federal Energy Regulatory Commission, is scheduled to testify. \nThe House Natural Resources Committee is scheduled to hold a hearing on state management of the greater sage grouse . \nThe Senate Appropriations Committee's energy and water development subcommittee will mark up the 2016 energy and water development funding bill. \nAROUND THE WEB: \nA NASA study says a key section of the Antarctic ice shelves is likely to melt within the next few years, NBC reports . \nThe University of Oxford will not divest its endowment fund from fossil fuels, but it has said it will not invest any more money in coal and tar sands, the Guardian reports . \nThe rise of bio-mass fuels and natural gas means the non-petroleum share of fuel in the U.S. transportation sector is its highest since 1954 , according to the Energy Information Administration. \nIN CASE YOU MISSED IT: \nCheck out Monday's stories ... \n-Green group: Voters like EPA water rule -IMF study : Governments provide $5.3T in energy subsidies -Obama pushes to give states bigger role in species protection -Regulators seek climate rule 'safety valve' to protect electric grid -Kansas set to repeal renewable energy mandate -Germany to weaken emissions rules for power plants -Week ahead: Lawmakers dig into energy overhaul -GOP plots new course on Endangered Species Act reform \nPlease send tips and comments to Timothy Cama, tcama@thehill.com ; and Devin Henry, dhenry@thehill.com . Follow us on Twitter: @Timothy_Cama , @dhenry , @thehill", "external_links": [], "published": "2015-05-19T00:55:00.000+03:00", "crawled": "2015-05-19T03:44:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}