{"organizations": ["House Foreign Relations Committee", "House Republican", "House Foreign Affairs Committee", "Senate", "GOP", "Congress", "Senate Foreign Relations Committee", "White House", "House of Representatives", "House", "Hezbollah", "Obama Administration"], "uuid": "2e239fe775af0c2bc64510fbccfe619b56d7edc5", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/141125164236-iran-nuclear-talks-flag-missile-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_topstories.rss", "section_title": "CNN.com - Top Stories", "url": "http://edition.cnn.com/2015/05/14/us/philadelphia-amtrak-train-derailment/index.html", "country": "US", "title": "House sends Iran nuclear deal bill to Obama", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "House sends Iran nuclear deal bill to Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-05-14T23:32:00.000+03:00", "replies_count": 0, "uuid": "4c9e4b32a3f57bf945b9e6dbef1e6ccd8e406665"}, "author": "", "url": "http://edition.cnn.com/2015/05/14/politics/iran-nuclear-program-bill-congress/index.html", "ord_in_thread": 0, "title": "House sends Iran nuclear deal bill to Obama", "locations": ["Iran", "Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ed Royce", "Bob Corker", "Kerry", "Eliot Engel", "Tom Cotton", "Sen Ben Cardin"], "text": "Iranian Foreign Minister fires back at Sen. Tom Cotton 00:31 Washington (CNN) The House of Representatives approved legislation Thursday that allows Congress to review any deal on Iran's nuclear program negotiated by the Obama Administration. The measure passed with an overwhelming bipartisan vote 400-25. The bill, which was passed by the Senate last week 98-1, now goes to the President for his signature. Initially the White House resisted efforts to give Congress a role in weighing in on an agreement. But once it became apparent that both Republicans and Democrats had a veto-proof majority, the White House said it would support a compromise crafted by Senate Foreign Relations Committee Chairman Bob Corker, R-Tennessee and the top Democrat on the panel, Sen Ben Cardin, D-Maryland. During the House debate on the bill Republicans emphasized that they were deeply skeptical that the Administration could reach a significant deal with Iran, a country they said repeatedly engaged in state sponsored terrorism. \"I fear that the agreement that is coming will be too short, sanctions relief will be too rapid, inspectors will be too restricted, and Iran's missile program will be plain ignored,\" Rep. Ed Royce, R-California, the Chairman of the House Foreign Affairs Committee said on the House floor. Even Democrats expressed doubt that the Obama Administration could get the kind of agreement they could back. \"I agree with Secretary Kerry when he says that no deal is better than a bad deal. The question is, we want to make sure a bad deal isn't sold as a good deal. And that's why it's important for Congress to be engaged,\" Rep. Eliot Engel, the top Democrat on the House Foreign Relations Committee said on the House floor. A group of House conservatives pressed House Republican leaders to allow some changes to the Senate bill, arguing it didn't go far enough to ensure that the lifting of sanctions didn't mean Iran could funnel money to terror groups. But their effort was turned down because leaders believed any effort to reopen the compromise would unravel it and leave Congress with no role. Instead, as a gesture to these conservatives, GOP leaders allowed a vote on a separate measure that would impose sanctions on any foreign banks who do business with Hezbollah, the Lebanese militant organization. A similar House bill passed unanimously last year, but was never considered by the Senate. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-05-14T23:32:00.000+03:00", "crawled": "2015-05-14T23:44:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}