{"organizations": [], "uuid": "2521dd5637c6a1ee37a8ac9e96b821f1c280bad9", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150508100552-nike-factory-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_news_international.rss", "section_title": "World business news - CNNMoney.com", "url": "http://money.cnn.com/2015/05/08/news/nike-jobs-obama-trade/index.html", "country": "US", "title": "Nike to create 10,000 U.S. jobs if Obama trade deal gets OK 8,", "performance_score": 0, "site": "cnn.com", "participants_count": 21, "title_full": "Nike to create 10,000 U.S. jobs if Obama trade deal gets OK - May. 8, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T19:46:00.000+03:00", "replies_count": 20, "uuid": "8c1ecad90f7cbe48f5ba5581ffe739e155633aeb"}, "author": "Ben Rooney", "url": "http://money.cnn.com/2015/05/08/news/nike-jobs-obama-trade/index.html#post-0", "ord_in_thread": 0, "title": "Nike to create 10,000 U.S. jobs if Obama trade deal gets OK 8,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The best Nike ads ever Nike said it could create 10,000 manufacturing and engineering jobs in the United States if a major free trade deal with nearly a dozen Pacific Rim countries is approved. President Obama will travel to Nike's headquarters in Oregon Friday to rally support for the Trade Promotion Authority and the Trans-Pacific Partnership.\nThe U.S. government has been negotiating the Trans-Pacific Partnership since 2009 with 11 other nations, including Japan, Australia, New Zealand, Malaysia, Chile, Canada and Mexico.\nThe deal hopes to wipe out trade tariffs to bring down the cost of importing and exporting, which would help make U.S. businesses more competitive overseas.\nNike ( NKE ) said if the trade agreement is approved, it would pave the way for 10,000 new manufacturing and engineering jobs in the United States. Over the next decade, the company said the trade deal could also indirectly lead to as many as 40,000 jobs along the supply chain.\nRelated: Donald Trump slams Pacific free trade deal\n\"Our employees and our business depend on free trade and the ability to reach athletes and consumers around the world,\" said Nike CEO Mark Parker.\nNike said the deal would encourage free trade and help it innovate. The deal would also eliminate certain tariffs Nike has to pay on footwear imports.\nThe U.S. government estimates an agreement would add $223 billion per year to the global economy by 2025.\nBut critics argue that the trade pact will hurt American workers and business.\nSenator Bernie Sanders, a Vermont Independent who is a candidate for President in 2016 election, called on Obama to cancel his trip to Nike.\nRelated: Obama steps in with outsourcer at Nike\nSanders said Nike has used free trade deals to send tens of thousands of jobs to Vietnam and other low-cost countries.\n\"Nike epitomizes why disastrous unfettered free-trade policies during the past four decades have failed American workers, eroded our manufacturing base and increased income and wealth inequality in this country,\" Sanders wrote in a letter he sent to the president Wednesday.\nRelated: This is Nike's secret weapon\nMeanwhile, members of the AFL-CIO labor group were planning to protest Obama's visit, according to a spokesman.\nThe president of the union's Oregon chapter, Tom Chamberlain, wrote in the Salem Statesman Journal that the trade agreement is a gift to big companies at the expense of middle class families.\n\"We don't need another trade deal that benefits multinational corporations, their shareholders and executives,\" said Chamberlain. \"We need to be more concerned about American work boots than sneakers made in Asia for pennies on the dollar.\n-- CNNMoney's Alanna Petroff contributed to this report\nCNNMoney (New York) May 8, 2015: 11:46 AM ET", "external_links": ["http://www.statesmanjournal.com/story/opinion/readers/2015/05/06/trans-pacific-partnership-a-us-job-killing-trade-deal/70902058/", "http://i2.cdn.turner.com/money/dam/assets/150407124601-nike-air-jordan-1024x576.jpg"], "published": "2015-05-08T19:46:00.000+03:00", "crawled": "2015-05-09T00:39:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}