{"organizations": ["EDT U.S. Immigration and Customs", "Government Reform Committee", "Department of Homeland Securities"], "uuid": "7419618bf0356b55e96cff5d4e70c64a8b236e3c", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2920812/images/o-IMMIGRANT-DETENTION-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/07/immigration-dilley_n_7225334.html", "country": "", "title": "Immigration Attorneys Allege ICE Is Making It Tougher To Help Women In Detention", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Immigration Attorneys Allege ICE Is Making It Tougher To Help Women In Detention", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "7419618bf0356b55e96cff5d4e70c64a8b236e3c"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/07/immigration-dilley_n_7225334.html", "ord_in_thread": 0, "title": "Immigration Attorneys Allege ICE Is Making It Tougher To Help Women In Detention", "locations": ["Washington", "D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sarah Saldana"], "text": "Immigration Attorneys Allege ICE Is Making It Tougher To Help Women In Detention Posted: Updated: 05/07/2015 8:59 am EDT U.S. Immigration and Customs Enforcement Director Sarah Saldana testifies before the House Oversight and Government Reform Committee about the Department of Homeland Securities policies regarding apprehension, detention and release of illegal immigrants, March 19, 2015, in Washington, D.C. (Photo by Chip Somodevilla/Getty Images) | Chip Somodevilla via Getty Images reddit \nWASHINGTON -- Immigration attorneys working on behalf of women and children apprehended crossing the border illegally say that while detention facilities have improved since last summer, they and their clients still face serious problems -- including ones that hinder their ability to help. \nImmigration advocates were alarmed last year by conditions at a temporary family detention facility in Artesia, New Mexico, that was holding many of those migrants. This year, as women and children are crossing at lower rates, the new, permanent detention facilities that house them are far nicer. \nBut pro bono attorneys say new problems are preventing their efforts to aid families that may have been fleeing violence. \n\"It's a nicer deportation mill,\" said Laura Lichter, a former president of the American Immigration Lawyers Association who has been involved pro bono work. \"It's still a shit-show, it's just different shit now.\" \nLichter and other attorneys contend that Immigration and Customs Enforcement is intentionally making it difficult for pro bono lawyers to work efficiently at a new family detention facility near Dilley, Texas -- something ICE officials deny. \nThe South Texas Family Residential Center in Dilley, operated by the private prison company Corrections Corporation of America and referred to as \"Dilley\" by immigration advocates, opened in December and could eventually hold as many as 2,400 people. Dilley is one of two new family detention facilities, built in response to last year's influx of women and children crossing the border illegally. The numbers are smaller this year, but still relatively high. Border agents apprehended 13,911 family units , mostly women with children, from the beginning of October 2014 through the end of March. \nImmigration attorneys have stepped in to provide legal services for the families. The Catholic Legal Immigration Network, the American Immigration Council, the Refugee and Immigrant Center for Education and Legal Services, and the American Immigration Lawyers Association teamed up to create the CARA Family Detention Pro Bono Project. Altogether, the group says it has had 70 volunteers from the project at the Dilley facility since the end of February and they have assisted more than 550 women. \nSome of those volunteers have complained that ICE isn't allowing them to bring in materials that would help clients, even though the same items were allowed at the temporary facility in Artesia. They said that they have been unable to bring in cell phones or normal-sized printers and scanners, and instead have to use portable printers that break from overuse. \nThose tools are important because the attorneys are dealing with a large number of cases that require documents, conversations with other attorneys who are offsite, and contact with families of the women in custody who can provide information. \n\"It's almost worse [than Artesia] if you have to talk about how to effectively represent them when you can't have the technology you need,\" said attorney Megan Kludt, who was at the Dilley facility last month. \nLichter said attorneys have been held up while entering the facility and told they can't bring in items they know are allowed. A dispute over whether she could bring a laptop and a tablet, versus one or the other, made her more than 45 minutes late to the court on Wednesday, she said. \nICE officials said they are not trying to impede the pro bono lawyers' efforts. An official noted that phones are available for lawyers' use and other legal services are available at the facility. \n\"U.S. Immigration and Customs Enforcement (ICE) is committed to facilitating access to legal service providers to the utmost extent possible,\" ICE press secretary Gillian M. Christensen said in a statement. \"ICE is continuing to determine if any enhanced accommodations for legal service providers may be possible while balancing the best interests of all involved.\" \nThe lawyers said Dilley does offer some substantial improvements over Artesia. The facilities at Dilley have more space to meet with clients, including rooms they can use for privacy, since women are often sharing stories of violence and abuse. Although it can be frustrating when detention center staff take a long time to bring out the women to meet with their attorneys, Kludt said, it could be a good thing if it means the families are able to roam more freely. \nEven if the facilities are nicer, attorneys and immigration activists say the system itself is broken. Family detention has increased dramatically since the increase in apprehensions last year, even though previous family centers were shut down amid reports of mistreatment and abuse. \nMore than 500 people protested outside of the Dilley facility earlier this week to call for an end to family detention. There have also been protests, including a hunger strike by the women inside , at another family detention center in Karnes City, Texas. \nA judge issued a preliminary injunction in February saying the government could not hold asylum seekers for the purpose of deterring others. \nLichter said the bond hearings she has witnessed to get women and children out of detention are some of the most contentious she has seen in her time as an immigration attorney. Even those granted bond often can't afford it, she said. \n\"$15,000 for someone who has basically fled from Central America -- it might as well be a billion,\" Lichter said. \"It's just not reachable.\" Also on HuffPost: ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-08T12:31:22.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}