{"organizations": [], "uuid": "c8103dd0767e301dfadc56a7c6882a0bcdf182d9", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/05/02/WE01211009/3588982/OluAsekun2jpg-3588982_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1238732", "country": "", "title": "WORLD EXCLUSIVE INTERVIEW:Olu Asekun, Nigeria’s Most Celebrated Immigration Lawyer in North America turns 50…Says ‘If God calls me Home now, I’m Fulfilled touching Peoples’ Lives Daily’ - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "WORLD EXCLUSIVE INTERVIEW:Olu Asekun, Nigeria’s Most Celebrated Immigration Lawyer in North America turns 50…Says ‘If God calls me Home now, I’m Fulfilled touching Peoples’ Lives Daily’ - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-05-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "c8103dd0767e301dfadc56a7c6882a0bcdf182d9"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1238732", "ord_in_thread": 0, "title": "WORLD EXCLUSIVE INTERVIEW:Olu Asekun, Nigeria’s Most Celebrated Immigration Lawyer in North America turns 50…Says ‘If God calls me Home now, I’m Fulfilled touching Peoples’ Lives Daily’ - CNN iReport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nWORLD EXCLUSIVE INTERVIEW: Olu Asekun, Nigeria’s Most Celebrated Immigration Lawyer in North America turns 50…Says ‘If God calls me Home now, I’m Fulfilled touching Peoples’ Lives Daily’ *To FG: ‘Buhari should Enforce Rule of Law, Creates Certification Boards for Professions’ *Honored with chains of Excellence Awards by American Legal System *Recalls Evergreen Moments at Nigerian Law School *Explains: ‘There’s a huge difference in American Visa issued on Nigerian Passport and Legal Stay in USA. Visa is not a Legal Stay in America’ *Reveals: ‘America’s Success story is built on Rule of Law answerable to by the Rich and Poor’ *Highlights Problem facing Nigerian Legal Practice, Need for Continual Legal Education *Confesses: ‘Law practice is the only profession in the world that touches every aspects of life’ *Nostalgia: His Seven American Legal Wonders to clients *PLUS: Message to Nigerian women planning to come to US to have their Babies *Why he remains ‘Otunba Agbeleshona of Ijebu-Igbo and Otunba Fiwajoye of Irolu’ *Confirms: Adewale Ayuba, Fuji Star having LIVE Performance for him in Texas May 23, 30 *His words: “Everyday of my life, God is using me to touch lives, and my 50 years Birthday celebration is my only way of Openly appreciating God in return” OTUNBA Olu Asekun, a serial, award-wining Nigerian-American lawyer is a first class attorney, with specialty in Immigration in United States. He is well read, very proficient and conversant in every aspect of American and Nigerian legal system. A high Chief from Ijebu-Igbo area of Ogun State, Nigeria and author of famous books in United States. This very calm, humble, honest and soft-spoken ‘Birthday-boy’ with arrays of law degrees as: LLM BL, JD has just reached a golden age of 50 years. Driving through his office location at 607, E. Abram Street, Suite 9, Arlington, Texas, he flung his chamber opened for iReport in this rare interview where he poured out his mind on a wide range of issues bothering on Law practice in Nigeria/America, Why visitors to America need to know their Status of Validity, his Seven American Legal Wonders to clients; and Legal Agenda Setting for Nigeria’s In-coming President, General Muhammadu Buhari to move the country forward. BY GEORGE ELIJAH OTUMU in Texas editor@nigeriastandardnewspaper.com How do you feel today being 50 years old? Well, we give God the glory since 50 is a major landmark in everyone’s life. I thank God for His mercies, for His protection in my personal life, professional career. I thank God for all that He has done. We give him all the glory for good health, not forgetting His wisdom, knowledge and understanding to successfully practice law here in United States of America. Law practice is a profession I enjoy doing. And I know that if I come back into this world again, I will still be a lawyer. Can you mention few of the highpoints of your legal career in America? In America, I am specialized in Immigration Law. Of course there had been few cases, looking back, I thank God. In my own situation, I termed these outstanding legal successes as ‘Seven Wonders of the World’. Kindly illuminate on this Seven Legal Wonders of the World Yeah, there are some of my clients’ cases that ordinarily you will believe they are lost cases-nothing would come out of them, but in contrast, they eventually came out as miracles and testimonies to the goodness of God’s name alone. Personally accessing the case from the outside, as human, I would not have expected the outcome come out so successfully, like I said God glories His name. I mean, there are cases that if somebody had sought my earlier opinion, I would have said it was not possible. But, today, not only was it possible, but some of them are landmarks in American judicial system. There was a case of a client who was convicted of aggravated felony. In America, under the American law, having a felony is a bad omen to citizenship, talk-less of aggravated felony, which is like a senior brother to felony. Here is a client referred to me by a pastor of my church. Fortunately or unfortunately, the pastor boasted so much that by the time I met this guy, saw his case, I knew pastor was just talking out of ignorance. After looking at the case, I was so fearful that I could not even charge the guy my legal fees because I thought it would be seen as exploitation; been something I knew was not going to be approved. I told him I was going to give it my shot and how much I was going to charge him, with a caveat that he will only pay me if the case was approved. And that if his case was not approved, he would not have to pay me. He agreed. We started, expected, I filed the first application; it was denied. I made series of appeals, it was denied. After filing everything without any success, I decided to file a lawsuit against Immigration, which was really unprecedented in American legal history. I thank the good God that at the end of the day, one thing led to the other, that client is now a United States citizen. Coming all the way from Nigeria originally, what factors inspired you into specializing in Immigration Law in United States? Actually, the whole passion into Immigration Law was coincidental. I mean, I did not leave Nigeria with the intention of practicing Immigration Law here, but like I said, it was coincidental having published various books including the famous: ‘God versus Science,’ A handbook for Aliens to Remain Legal in USA’ amongst others. My book: ‘God versus Science’ is a true testimony of my journey from Nigeria into how I started my law practice here in America. The book contained how I decided to live in America, since it was not originally part of my plans. When I left Nigeria as a lawyer, I was not planning to live in the US. In actual fact, I think in 1996, I won a Visa lottery, which I did not eventually use on the long run. You can imagine, for me to later come into America with a visiting visa and eventually become a Permanent Resident in America. It was not planned at all. How did your full practice of Immigration Law began in America? My practice of Immigration Law in America started as my personal discovery efforts to see I could stay legal here in the US then. So, I began researching into what I could do to fulfill this heart desire of mine. My very first move: I took my Nigerian passport and went to Immigration office. At that time, the Immigration office used to have a long queue. Then, if you want to go to Immigration office, you have to be there as early as 2:00am. I had no specific thing in mind to tell Immigration officials. When it was my turn around 9:00am in the morning, the officer asked me, how could we help you? I told them, I was there to ask for a Green Card. They asked me, if I had a pending application with them or on what ground, I sounded affirmative. I replied them that that was why I was there in their office, they should tell me on what ground I could get my own Green Card. They all started laughing. Those officers called other officers and began to laugh at me. Like I said, it was a challenge and that was the beginning. I left the place and started researching, and I wanted to see how I could stay legal here in America. That was the origin of my decision to practice Immigration law in United States. In the course of my research, I discovered a lot of innocent mistakes people make all over the world. I wrote a book on Immigration in 2005, ‘A handbook for Alien to Remain Legal in United States’, the reason I wrote the book was to point out some of the common errors or mistakes that people make. For example: This happens every time, even today. You will see people with Two years American Visa coming into US, when you ask them when their status is expiring, they will say they still have two years Visa. Forgetting that Visa has nothing whatsoever to do with your legal stay in America. Actually, a lot of people till today, still don’t know the difference between a Visa and Legal Stay in US. Visa is not a legal stay, Visa is just an authorization document given authority to the airline to bringing you into US without facing penalty for bringing illegal persons into America. So, the moment, airplane touches the ground at the airport, Visa work expires. I can tell you that a lot of people lack this little knowledge. Still in the course of my research, I realized that there a lot of issues that get people into trouble, that they did not know anything about. In one of my Seven Wonders of my legal works, I have a client who was ordered removed by an Immigration Judge in 1998, where as legally he had 90 days to file a motion in the court to re-open the case, if he wants the court to re-consider his case. If that time he did not even know he had the legal rights to file for that motion, you can imagine in 2005, when she was arrested. Of course, they were trying to implement the removal order of 1998, but by the time I came on the scene; statutorily it was impossible because the law permits you to file within 90 days, and here we are talking several years after. Of course what do you expect when I was filling a motion on this client’s behalf six or seven years after? She was going to be denied, she was denied. We filled a motion to re-consider, she was denied. I filled an appeal at the Board of Immigration Appeal, she was denied. The case originated from Michigan, we ended up at the 10th Circle. So, I filled another appeal, the only thing in that judgment was that in the ruling of the United States Court of Appeal in the 10th Circle, they stated that they agreed with every argument that I made; however they don’t have the capacity or legal authority to approve the case because it was a discretionary form of relief. Filling to re-open a case of this nature was a discretionary process that could only be given by Board of Immigration Appeal, since they had the discretionary power to either grant it or decline it. It was not a situation where the court could force them to exercise their discretionary power. In their opinion, the court in 10th Circle wrote: “We call the attention of US Government to this case. This is one case we believe warrant favorable response of discretion.” I capitalized on that ruling, I made copies of that judgment, I sent copies to the office of Attorney General to US, White House, Chief Counsel and all over the places. At the end of the day, within few weeks thereafter, the government contacted me to see what they could do to help in the matter. I mentioned in my motion for the case to be opened, they agreed and re-opened the case. Today, my client is a Permanent Resident. Will you say you are fulfilled in life? Looking back, I think very few people can say this, which is, in my professional life, I think I have lived a fulfilled life. I have been able to help a lot of people here in the US, outside the US. Professionally, I strongly believe God has used to touch enough people daily. So, if by the end of today, God says it is time to come home, I believe I have lived a fulfilled life. How many years have you spent in Nigerian and American Law practice? Well, I have only practice Immigration Law in America for 12 years, while I earlier practiced in Nigeria for 10 years. If there is a re-incarnation, will you still return as an Immigration lawyer in America? Yes, I will say that because of the ability to help people and put smiles on their faces. Comparatively, what are the differences in law practice in America and Nigeria? There is a major difference between being a lawyer in Nigeria and being a lawyer in America. Nigerian legal practice is very sound, it was fashioned along the British system. However, there is one major problem I noticed in Nigerian legal practice: lack of continue legal education. In America, you have to keep, constantly upgrade yourself. You have to keep up with the changing circumstances. Everybody knows that law is not static, it changes all the time. The problem in Nigeria is, once you finished from the University, went to Law School and you are called to the Bar; your legal practice license is permanent. No one or system checks on you whether you are outdated or still in form in modern law practice. There is really no form of check. The last time I practiced law in Nigeria was 2001, now, if by tomorrow, I travel to Nigeria, bring out my wig and gown, I can go to court and represent clients. Nobody is going to challenge me because there is no requirement or continued legal education. Even if I have no clue what the new law is, I can still call myself a lawyer; that cannot happen here in America. Every year in America, there is a minimum number of hours you have to take in continuing legal education practice for your license to remain valid. It is mandatory, otherwise, you will loose your license. You have to keep up, by knowing what you are doing. Another thing in Nigeria: it is difficult for an enlighten client to know who to contact in case the lawyer handling his case is not following due process or misbehavior. Here in America, Legal Ombudsman or Complaint zones are common knowledge. It is circulated everywhere in US. For instance, if I mishandle a client’s case, he could report in Nigeria to Council of Legal Education, but here in America, you can be reported to be Bar of the State where that lawyer is licensed. If you go on internet now, Google my name, every information about me will come out; including the State I am licensed and my law practice license number. You don’t have this accessibility in Nigeria. That is why in Nigeria, when you misplaced your clients form, or mishandles your clients case, the client suffers. Nothing happens to the lawyer, except for high-profile clients who are able to navigate the process, knows who to contact. Of course, Nigeria has provision for it, but it is not just active. There are so many laws in Nigeria that are inactive. Here in America, they system keeps you on your toes. A single mistake as a lawyer can cost you your license. What legal agenda setting do you have for Nigeria’s In-coming President, General Muhammadu Buhari that will help the nation’s judicial system in a timely, speedy dispensation of justice? The good thing about General Buhari’s administration is that his Vice, Yemi Oshibajo is a professor of law. He is someone I respect so much. I believe Oshibajo would be able to replicate what he did in Lagos State, nationally. When he was the Attorney General of Lagos State, he was the one that realized that to keep Nigeria moving, there was the need to fix the judiciary. And I believe that is what General Buhari needs to replicate at the federal level. Once you fix the judiciary, by paying the judges very well, take out all the corrupt judges, and institutionalized the rule of law. Let me tell you that the success story of America today is built on rule of law. The fact that everybody act as check to another person, with nobody here above the law is a beautiful mantra. If President Barack Obama violates the law today, he will answer for it. As I am talking to you, the current governor of Chicago is in jail. He was a serving governor when he was sentenced. In Nigeria, you and I know that the governors would claim immunity with no one to arrest, talk-less of prosecuting them. Even if their house of assemblies decide to impeach them, they will bribe everybody and still remains in power. An apt description is what is presently happening in Ekiti State. Here in America, both the rich and poor are answerable to the same law. If Buhari is able to enforce the rule of law, every other thing will follow. If you are entering into a contract and you know that whatsoever you agree upon will be implemented, every person will sit up. There are fears in certain circles that if Buhari should compel Rule of Law mantra, he may be confronted or assassinated by corrupt politicians I don’t think this is about Buhari. This is not about probing. What I am saying is enforcing the rule of law. It is about ensuring the institution work unhindered the way it ought to work. It is not about the personality of Buhari. Whether Buhari remains the president or not, as long as the institution is working the way it is designed to work without any interference, everyone will enjoy it. The way it is today, a lot of people don’t respect agreement in Nigeria. Before I left Nigeria, even now, it is still happening. I have seen Nigerian people in power disobeying court order. I still remember, Odigie Oyegun, the current Chairman of All Progressives Party, APC-there was a case when I was in the Nigerian Law School, he was a Permanent Secretary then. He disobeyed court order flagrantly. These are the same set of people claiming to be advocates of democracy. How can you be an advocate of democracy when you disobey a court order? Whether the court order is right or wrong, once the order has been given, you have to obey. Then you can go to the court and challenge it. That is why we have appellate procedure. If you disagree with the ruling, go file an appeal. If you still disagree, you can go as far as the Supreme Court. You cannot just sit in your office and disregard a court ruling. Nigeria is not going to work as long as that mindset is there. Looking holistic at your American legal practice journey, is there any legal trend you think Nigerians at home or Nigerians in Diaspora may learn from? The only issue I observed as a trend among Nigerians is a lot of people-pregnant women from Nigeria comes to the US to have their babies. I have seen a lot of them being returned home at the American point of entry. And the process is very simple: in America, once you have your child, the baby automatically becomes a US citizen, with all the rights and privileges of being a citizen. Everybody wants to enjoy that same privilege but unfortunately, so many people, especially countries that share borders with US, come in; exploit the situation, incur a lot of medical bills, travel back home without paying those bills. Of course, these bills go back to the tax payers. There are lots of people coming from Nigeria with genuine intention of paying their bills. But there is no way for Custom and Border Control, CBD, officer to determine who will pay and those that would not pay. At the end of the day, everybody is affected. This is part of what we are saying, if Nigeria is okay, they don’t need to come to the US to have children. When Nigeria was good, I know people who live in the US here, became pregnant, went back to Nigeria to have their babies. In Nigeria, all medical facilities are not maintained, few that are maintained are private hospitals, whose payments are through the roof. Is there any philosophy that kind of shape your legal practice career? My Dad, though late now used to work as a Court Registrar. I used to go with him during holidays to court and see what was going on. There was a quote that I came across as a young boy and it stuck with me. I think is from Sir Edmund Burke, which says: “The study of law renders man acute, dexterous, eloquent, prompt in attack, ready in defense and full of resources”. I came across it and it became part of me. I believe it is a legacy I would want to live for my children. Did you have premonition as a young boy you would embrace law as a professional career? That is another comparison you want me to make between my experience in Nigeria and America. Unfortunately, the way the Nigerian system is designed don’t identify gifts in children. These are things they do right here. In America, right from the childhood, once they are able to see a gift in you, they identify it by saying this person will be good in this profession. That does not mean they don’t make mistakes in career choices. There are lots of people that had been written off and they turned out to do well in their respective professions. Also, a lot of people that were projected to do well, turned out to fail. Truth of the matter was during my youthful days, my siblings(brothers, sisters) since I came from a polygamous home since my father had three wives; always chastised me by saying I argued too much. Right from my childhood, I have always want to make my position very clear on every issue. When I expressed my position on the right track, they would shout me down, claiming I argued too much. I could not have called those scenarios encouragement for me. Rather, they were shutting me up, shouting me down. The turning point like I earlier said for me, was that vacation job at the court with my Dad. Certainly being an outstanding and successful Nigerian, of course you must have been offered several chieftaincy titles. Can you tell us how many of them you have as at today? Well, the point is, I stopped accepting some of these chieftaincy titles. Of course from my town where I came from, I accepted ‘Otunba Agbeleshona of Ijebu-Igbo and Otunba Fiwajoye of Irolu’. There had been series of others, but did not accept them. Here in US, it is unconstitutional to accept chieftaincy titles. When you have titles, they consider a privilege position, they don’t like it since their system gives you equal position to the other person. If your kids so determine to go into law practice in US, will you allow them? To be sincere, it is only God that can determine how every child will turn out in future. Sincerely speaking, if I have a say, it is my wish that my children study law: reason is simple. From the quotation I gave you earlier, law broadens one’s mind, it is only profession anywhere in the world that is attached to every aspects of life. There is no aspect of life you can undertake without a lawyer. If you look at people that are ruling the entire world, they had law background; even though they may not practice the profession. Everybody knows Obama as a lawyer, but not everyone knows Mitt Romney is a lawyer. The Clintons (man and wife) are lawyers too. Law gives you a broad knowledge, confidence, exposes you to things that you don’t ordinarily know. It sharpens the way you think, gives you a higher edge over every other profession. How are you preparing for your 50th Birthday celebration? I commit everything into God’s hand. I just feel that this once time, I need to enjoy myself. That is why I have invited Adewale Ayuba, a Fuji musician from Nigeria to come and celebrate the day with me. Tell us about the venues and dates It is going to happen on May 23rd at Aristal Events Center in Mansfield, Texas. Time from 6:00pm till dawn. That would be an exclusive party since the location is very small. On Friday, May 22, at RCCG Household of Faith on New York Avenue, there will a Thanksgiving Service by 6:00pm-8:00pm. Also, there will be a live concert at Peoples Convention Center, Irving on May 30 by 6:00pm till dawn open to everybody. TAGS: ", "external_links": [], "published": "2015-05-02T03:00:00.000+03:00", "crawled": "2015-05-03T10:15:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}