{"organizations": [], "uuid": "9917a14cc127cf0e5d16a4291f316676e1bd5b89", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051215_hn_dembattle_640.jpg", "site_section": "http://feeds.foxnews.com/foxnews/latest", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/05/13/hill-showdown-set-in-trade-battle-between-senate-dems-obama/", "country": "US", "title": "'SHOCKING' DEFEAT Dems block key plank of Obama trade agenda", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "'SHOCKING' DEFEAT Dems block key plank of Obama trade agenda", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T07:19:00.000+03:00", "replies_count": 0, "uuid": "9917a14cc127cf0e5d16a4291f316676e1bd5b89"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/politics/2015/05/13/hill-showdown-set-in-trade-battle-between-senate-dems-obama/", "ord_in_thread": 0, "title": "'SHOCKING' DEFEAT Dems block key plank of Obama trade agenda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate Dems block key plank of Obama trade agenda Published May 13, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama suffered a defeat at the hands of his own party on Tuesday, as Senate Democrats blocked a key component of the president's trade agenda. \nAfter fierce lobbying on both sides of the issue, the bid to start debate -- on expanding the president's authority to negotiate trade deals -- failed on a 52-45 vote. It needed 60 votes to advance. \nThe president's supporters will likely try again, but the vote nevertheless marks a stinging rebuke of a major Obama priority by members of his own party. Republicans mostly had aligned with Obama on the issue and, after the failed test vote, urged Obama's fellow Democrats to drop their resistance. \n\"What we just saw here is pretty shocking,\" Senate Majority Leader Mitch McConnell, R-Ky., said, accusing congressional Democrats of standing with \"special interests.\" \nAt issue is Obama's push for so-called \"fast track\" authority -- which would let him negotiate trade deals that Congress can reject or ratify, but not amend. In the short-term, he wants to use this to pursue a broad trade pact with Japan and other Pacific nations. \nBut many Democrats aligned with labor unions in warning about the impact on U.S. jobs, and openly opposed the White House. Senate Minority Leader Harry Reid, D-Nev., recently told reporters he's a \"hell no\" on the proposal. And Obama and Sen. Elizabeth Warren, D-Mass., for days have traded jabs on the matter, with the president calling Warren's claims \"absolutely wrong.\" More on this... Democrats divided over multi-nation trade deal \nSeveral Democrats later said Obama erred by pointedly criticizing Warren, most recently in an interview with Yahoo News. Democratic senators said they also are tired of seeing the Democratic president cozy up to Republicans on trade. \nThe issue indeed has left Obama oddly aligned with Republicans, while trying to sway enough Democrats to join in support. With 54 Republicans in the Senate, the White House needed a handful of Democrats on board. \nBut labor unions, liberal groups and others vehemently oppose the legislation. It faces \"poison pill\" amendments, showdowns over \"currency manipulation\" and, eventually, similar confrontations in the House. \nLobbying for and against the legislation hit overdrive this week. Key groups scheduled almost hourly events on Capitol Hill ahead of Tuesday afternoon's vote. Obama devoted much of the weekend to trade, visiting a Nike plant in Oregon. Obama maintains that U.S. goods and services need better access to the 95 percent of world consumers who live in other countries. \nIf Obama can ultimately get the trade measure passed, he's likely to ask Congress to approve the Trans-Pacific Partnership being negotiated with 11 other countries, including Japan, Vietnam, Canada and Mexico. Other free-trade proposals could follow. \nBut several Democrats say they will back fast track only if Republican leaders clear a path for three other trade measures. One, to renew the African Growth and Opportunity Act, is uncontroversial. \nThe second calls for Trade Adjustment Assistance, which provides federal aid to workers displaced by trade agreements. Republicans don't like it, but reluctantly acknowledge it's the price for winning even modest Democratic support. \nThe third bill, involving Customs enforcement, is the stickiest. It includes a measure to take actions against countries that keep their currency artificially low, which makes their exports more attractive. The Obama administration opposes the \"currency manipulation\" measure, saying it could invite international challenges to the Federal Reserve's policies meant to boost the economy. \nSome Democrats also want to force Republicans to deal first with a surveillance measure that Democrats consider more pressing. That strategy suggests Obama might have better luck on trade in a month or so. \nFox News' Chad Pergram and Kara Rowland and The Associated Press contributed to this report. Advertisement", "external_links": [], "published": "2015-05-13T07:19:00.000+03:00", "crawled": "2015-05-13T07:50:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}