{"organizations": [], "uuid": "5548cd819ea38fce36595abb62fb9b740ceb8a9e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/09/16/bush-ended-financial-crisis-before-obama-took-office-three-important-truths/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422632404662.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/16/bush-ended-financial-crisis-before-obama-took-office-three-important-truths.html", "country": "", "title": "Bush ended financial crisis before Obama took office -- three important truths about 2008 | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Bush ended financial crisis before Obama took office -- three important truths about 2008 | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5548cd819ea38fce36595abb62fb9b740ceb8a9e"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/16/bush-ended-financial-crisis-before-obama-took-office-three-important-truths.html", "ord_in_thread": 0, "title": "Bush ended financial crisis before Obama took office -- three important truths about 2008 | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\n[pullquote] \nHere, we offer three of our observations that are central to understanding the crisis and its lessons. \nFirst, the principal cause was not a specific U.S. policy but instead a global economic phenomenon. \nThe financial crisis was caused principally by unprecedented capital flows into the United States (and other developed economies). \nTraditionally, “rich” countries loaned funds to poorer (aka developing) countries, but in the mid-2000s that pattern reversed. Oil producers, Japan, and especially China invested heavily in the United States. This investment boom caused the price of risky assets, especially mortgages and mortgage-backed securities, to fall dramatically, fueling a massive expansion of mortgage lending and a large boom in housing supply. \nWhen this boom ended and housing prices began to decline in 2006, default rates increased and financial assets based on mortgages plummeted in value. Many of the biggest banks had invested too heavily in these assets and began to fail. The major deregulatory moves, which occurred at the end of the Clinton administration, were not a major factor. \nSecond, the TARP worked. \nIn September 2008 we, on behalf of President Bush, were part of a team that asked Congress to write a $700 billion check on behalf of taxpayers to bail out the failing largest banks. President Bush didn’t want to do this. We didn’t want to do this. Congress didn’t want to do it (and said no the first time). Our reservations were based on the potential cost to taxpayers and the moral hazard created by bailing out failing institutions and some of their creditors. Even today this program is famously unpopular, but the evidence is that it worked. \nThe biggest banks all made the same, too-highly leveraged, bad bet: that housing prices would increase forever. \nWhen this bet proved wrong, the banks began to fail, threatening to collapse the entire financial system and push the global economy into another Great Depression. \nIn the third week of that September, we saw the fledgling stages of a global financial panic. Had we not done the TARP (and several other coordinated policy moves), it is likely that the panic would have spread, with devastating effects, to the entire nation. \nThe TARP was a temporary recapitalization of these big (and some medium-sized) banks. It was designed to be a temporary investment, to buy time to allow the financial system to stabilize and the banks to raise private capital. \nThis happened as designed, and taxpayers recouped all but $5 billion of the original investment. (The Obama administration subsequently wasted billions more on unrelated programs, but that’s a different story.) TARP was as necessary and effective as it was unpopular. \nThe third observation is about who did what. \nIt was President Bush’s task to stop the financial panic that was occurring in the autumn of 2008. He and his administration succeeded. \nPresident Obama faced a different set of challenges, which included addressing the severe macroeconomic recession that flowed from the financial crisis, beginning the cleanup of the financial system after the crisis, and proposing, enacting, and implementing financial reforms. \nThe weak recovery continues and the effects of new legislation and regulatory actions that occurred during the Obama presidency remain uncertain. \nAll the major financial sector rescue policies were created and implemented during the last five months of the Bush administration. \nThe Bush team put Fannie Mae and Freddie Mac into conservatorship, proposed, enacted, and implemented the TARP and its main component, the Capital Purchase Program. \nTreasury guaranteed money market mutual funds. The FDIC expanded its guarantee of deposit insurance and created new guarantees for small business accounts and interbank loans. \nThe Fed created new mechanisms for commercial paper and began paying interest on bank reserves. Fed, the Treasury, and FDIC took specific actions (many of which were loans and “bailouts”) for AIG, Citigroup, Goldman Sachs, Morgan Stanley, Washington Mutual, American Express, CIT, General Motors, and Chrysler. \nPresident Bush hosted the first G-20 Summit in Washington. All of these actions, which constitute the overwhelming bulk of the policy response to the financial crisis, took place before Mr. Obama became president. Many believe some of these were unwise policy moves, but there is no dispute about who did them. The financial crisis ended before President Obama took the oath of office. \nKeith Hennessey, a lecturer at the Stanford Graduate School of Business, was director of the National Economic Council from 2007 through 2009. \nEdward P. Lazear, a Stanford Graduate School of Business professor and Hoover Institution fellow, was chairman of the Council of Economic Advisers from 2006-2009. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}