{"organizations": ["ISIS", "CNN"], "uuid": "5a27c658fdb1a616d0fb68182c97a0e7f04f7c8e", "thread": {"site_full": "ireport.cnn.com", "main_image": "http://i.cdn.turner.com/ireport/sm/prod/2015/05/19/WE01214655/3601537/bush200720140911105150jpg3408055-3601537_lg.jpg", "site_section": "", "section_title": "", "url": "http://ireport.cnn.com/docs/DOC-1242725", "country": "", "title": "Iraq, ISIS, Obama and Hillary, Oh my - CNN iReport", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Iraq, ISIS, Obama and Hillary, Oh my - CNN iReport", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "5a27c658fdb1a616d0fb68182c97a0e7f04f7c8e"}, "author": "", "url": "http://ireport.cnn.com/docs/DOC-1242725", "ord_in_thread": 0, "title": "Iraq, ISIS, Obama and Hillary, Oh my - CNN iReport", "locations": ["Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joecutlas", "Hillary", "Obama"], "text": "Iraq, ISIS, Obama and Hillary, Oh my By Joecutlas | Posted 4 hours ago \nCNN PRODUCER NOTE The Islamic State’s capture of the Iraqi city of Ramadi is sparking renewed criticism of Obama administration policies in the region -- from the decision to withdraw virtually all U.S. troops in 2011 to the current anti-ISIS strategy that relies mostly on airstrikes. The fall Sunday of Ramadi, just 70 miles from Baghdad, marks the second time in roughly a year that the extremist group has taken control of a major Iraqi city -- after the United States spent nearly eight years at war in the country. The administration repeatedly has defended its strategy for halting the Islamic State’s deadly advances in Iraq and Syria but acknowledged on Monday that the Ramadi takeover was indeed a major loss. “No denying it is a setback,” said White House spokesman Eric Schultz, while reiterating the administration expected a long, hard battle and has no plans to change its strategy. read the rest of this report at Fox News: http://www.foxnews.com/politics/2015/05/18/islamic-state-capture-ramadi-renews-concerns-about-us-foreign-policy-left/?intcmp=latestnews It would appear that those unheeded words offered up by then President George W. Bush have come back to haunt this Obama administration time and again as this President's failed foreign policies continue to 'blow up' in our faces with the ever expanding threat of 'Islamic Terrorism' wreaking havoc and death on a global scale as we speak. Don't even get me started on this Presidents policies in Yemen, Iran, and North Korea. I hope every freedom loving American will also keep in mind, Benghazi, brought to us by then Secretary of State Hillary Clinton as she continues her bid for the Presidential nomination from the Democrat Party in 2016. Can America really afford four more years of the same failed Progressive Foreign Policies? TAGS: ", "external_links": [], "published": "2015-05-19T03:00:00.000+03:00", "crawled": "2015-05-19T16:55:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}