{"organizations": [], "uuid": "55d8583e2a573e806f707d9009135b455a6b7923", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_111214getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/241018-obama-hints-at-post-presidential-plans", "country": "US", "title": "Obama hints at post-presidential plans", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama hints at post-presidential plans", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T13:00:00.000+03:00", "replies_count": 0, "uuid": "55d8583e2a573e806f707d9009135b455a6b7923"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/241018-obama-hints-at-post-presidential-plans", "ord_in_thread": 0, "title": "Obama hints at post-presidential plans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama hints at post-presidential plans By Jordan Fabian - 05/05/15 06:00 AM EDT \nWith the clock ticking in the fourth quarter of his presidency, President Obama is laying the groundwork for his life after he leaves the White House. \nAs his administration scrambles to hammer out a nuclear deal with Iran and complete legacy items, including a sweeping 12-nation trade agreement, signs that Obama is pondering his future are beginning to emerge. \nLast week, reports surfaced indicating that Obama has decided to locate his presidential library in his hometown of Chicago. ADVERTISEMENT On Monday, the president is participating in a launch event in New York for a private foundation that will build on the work of My Brother’s Keeper, a White House initiative supporting young men and boys of color.\nAnd even Obama’s own remarks about his post-presidential plans have taken on a more serious tone compared to 2013, when he joked he could deliver “SportsCenter” Top 10 lists after he retires. \nSpeaking at the kick-off event for the nonprofit My Brother’s Keeper Alliance at Lehman College, Obama said he would work to combat racial and economic inequalities long after he leaves office. \n“This will remain a mission for me and for Michelle not just for the rest of my presidency, but for the rest of my life,” he said. \nDespite the hints about Obama’s plans, the White House has stressed the president remains focused on accomplishing as much as he can in his final 20 months in office. \n“People at this point expect the president to pay attention to international events and keep his pulse on domestic problems,” said Brandon Rottinghaus, a political science professor at the University of Houston who studies the presidency. “He can’t devote too much time to this; he needs to show people he is still on the job. But at the same time, he needs to start thinking about what his legacy is.” \nThe president’s focus on young minority men appears to figure prominently into both Obama’s current agenda and his post-presidential legacy. \nProblems plaguing minority communities, such as drugs and poverty, have dominated the national discussion during parts of Obama’s second term, as he has been forced to confront violent unrest in response to police-related deaths of black men, most recently in Baltimore. \nThe My Brother’s Keeper initiative was part of the president’s response to the death of Trayvon Martin in 2012. It has received $500 million in financial commitments from companies and foundations to support early education, job training and violence prevention programs. \nIts private spinoff has already received $80 million in pledges from corporations and it could allow the president to keep up the initiative’s work after he leaves office. \nObama has said a lack of educational opportunities and jobs for black and Hispanic men must be addressed to rebuild trust in the police. The president said Monday a sense of “unfairness, of powerlessness” helped fuel protests in Ferguson, Mo., Baltimore and New York. \n“America’s future depends on us caring about this,” he added. “If we don’t we will just keep going through the same cycles of periodic conflict.” \nBut the president said last week he is “under no illusion” that the Republican Congress is ready to pass new spending programs to address urban communities. \nEstablishing a legacy on race has proven challenging for Obama, and there may be work left to be done after a new president is sworn in. \nDuring a conversation with students at a Washington, D.C., library last Thursday, the president hinted that he might return to his roots as a community organizer after he leaves office. \n“I’ll be done being president in a couple of years, and I’ll still be a pretty young man,” said Obama, who will be 55 when he leaves office. “So I’ll go back to doing the kinds of work that I was doing before, just trying to find ways to help people. ... That’s the kind of work that I really love to do.” \nThe White House has been coy about the president’s plans once he leaves office. \nAsked if the president sees the My Brother’s Keeper Alliance as a vehicle for his post-presidency, White House spokesman Josh Earnest said, “I wouldn’t make that commitment at this point.” \n“I do think you can expect the president will continue to be involved in these issues, but at this point, I would not commit to any sort of involvement by the former president” in the group’s day-to-day activities, he said. \nThe Barack Obama Foundation, created in 2014, has been charged with establishing his philanthropic work for when he leaves office and setting up his presidential library. \nThe My Brother’s Keeper Alliance is helmed by Joe Echevarria, a former Deloitte LLP CEO who helped run the White House initiative. Singer John Legend and former NBA star Alonzo Mourning, both Obama supporters, will serve on the group’s board. \n“One strategy is to have people who can be trusted and follow through on the president’s objectives,” said Rottinghaus. “The president himself doesn’t have to do much at this point.” \nBut the process of preparing for the post-presidency could leave a mark on a president’s legacy. Bill Clinton found himself in hot water in 2001 after it was revealed the wife of Marc Rich, who received a controversial pardon on his last day in office, donated $400,000 to Clinton’s library. \nThe Clintons have also faced conflict-of-interest questions about undisclosed donations from foreign governments to the Clinton Foundation. \nObama is already facing questions about donations to the My Brother’s Keeper Alliance, given that his campaign had refused to accept donations from registered lobbyists. \nThe Obama Foundation does not take contributions from registered lobbyists or foreign governments and discloses all donations over $200, according to its website. \nEarnest said the Obama administration won’t be involved in fundraising for the My Brother’s Keeper Alliance, but that he is “confident that the members of the board are well aware of the president’s commitment to transparency.”", "external_links": [], "published": "2015-05-05T13:00:00.000+03:00", "crawled": "2015-05-05T13:57:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}