{"organizations": [], "uuid": "6e15713d6dbfa7e2b3d529eb725ad795f3f15f0f", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/04/politics/joe-arpaio-obama-immigration-executive-action-lawsuit/index.html", "country": "", "title": "Second round for Arizona sheriff's case against Obama immigration orders - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Second round for Arizona sheriff's case against Obama immigration orders - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T11:07:00.000+03:00", "replies_count": 0, "uuid": "6e15713d6dbfa7e2b3d529eb725ad795f3f15f0f"}, "author": "", "url": "http://www.cnn.com/2015/05/04/politics/joe-arpaio-obama-immigration-executive-action-lawsuit/index.html", "ord_in_thread": 0, "title": "Second round for Arizona sheriff's case against Obama immigration orders - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Second round for Arizona sheriff's case against Obama immigration orders By Jeremy Diamond , CNN Updated 1833 GMT (0133 HKT) May 4, 2015 Maricopa County Sheriff Joe Arpaio speaks with a reporter outside city jail in this May 3, 2010. Washington (CNN) A federal appeals court on Monday heard the latest series of arguments in an Arizona Sheriff's challenge to President Barack Obama's executive orders on immigration. The attorney representing Maricopa County's controversy-prone Sheriff Joe Arpaio urged the U.S. Court of Appeals for the District of Columbia to reverse a district judge's December ruling and allow the case to proceed. Arpaio, known for his feisty, public battle against illegal immigration, is looking to reverse President Barack Obama's executive orders allowing illegal immigrants who came as children to the U.S. or undocumented parents of legal residents to stay in the U.S. Attorney Larry Klayman urged the three-judge panel Monday not to consider the case as a political dispute, but rather one about \"whether the law is being enforced or not\" -- which both conservatives and liberal should support, he said. But while Klayman argued Monday that the case is anything but political in nature, the attorney laid out the case against Obama's executive orders in the same terms Republicans have slammed Obama's immigration actions. Like Republicans, Klayman repeatedly drew on Obama's past comments that he is \"not the emperor\" and did not have the power to stave off deportation through executive action to argue that Obama changed his stance for political expediency. Klayman also argued that Obama \"usurped\" the power of Congress and that the two orders -- known as DACA and DAPA -- amounted to rule-making and not simply a change in policy. \"We have a republic here and if you don't like the law, you don't get to just change it,\" Klayman argued Monday. \"(Obama) has put himself above Congress.\" Arpaio's case is not the only challenge to Obama's executive action on immigration. In a separate case, 26 states are fighting in court to block Obama's executive orders. In an attempt to veer from the political, Klayman, who has said he believes Obama is \"an illegal alien\" who should be deported, argued that he was pro-immigration and even pointed out that his ex-wife is Latina. Klayman added that he has never heard Arpaio -- whom he considers a friend -- ever say anything negative about Latinos or immigrants. A U.S. District Court rules two years ago that Arpaio and his officers engaged in racial profiling against Latino drivers. The federal judges on Monday focused most of their questioning on determining whether Arpaio had standing to pursue his case against Obama. Klayman argued that Arpaio's jails have been burdened because of Obama's executive actions, claiming that Obama's executive orders are preventing undocumented criminals in Maricopa County jails from being deported. While Obama's orders prevent undocumented immigrants convicted of \"serious crimes\" from seeking relief from deportation, Klayman argued that those convicted of lesser crimes would be allowed to stay in the U.S. The judges on Monday repeatedly pressed Klayman on establishing a direct link between inmates in Arpaio's jails and Obama's specific immigration orders and seemed unsatisfied with Klayman's responses. Deputy Assistant Attorney General Beth Brinkman, who argued the government's case, insisted that as a third party, Arpaio did not have standing to pursue his case. Brinkman also leaned on Supreme Court case precedent to argue that disagreements over immigration policies should be worked out between the legislative and executive branches, and not decided by the courts. Klayman rebutted that Maricopa County, which is the 4th largest in the country, is larger than 24 states. ", "external_links": [], "published": "2015-05-05T11:07:00.000+03:00", "crawled": "2015-05-05T11:07:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}