{"organizations": ["Boeing", "Pentagon", "ABC", "U.S. Air Force", "The Wall Street Journal", "Air Force"], "uuid": "66def53be8840b9d43d4494f4b4f001d18546cec", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/04/politics/obama-air-force-one-tune-up/index.html", "country": "", "title": "'Air Force One' returns to Obama after 18-month tune up - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "'Air Force One' returns to Obama after 18-month tune up - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T07:34:00.000+03:00", "replies_count": 0, "uuid": "66def53be8840b9d43d4494f4b4f001d18546cec"}, "author": "", "url": "http://www.cnn.com/2015/05/04/politics/obama-air-force-one-tune-up/index.html", "ord_in_thread": 0, "title": "'Air Force One' returns to Obama after 18-month tune up - CNNPolitics.com", "locations": ["United States", "Arizona", "United States of America", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James", "Jonathan Karl", "George W. Bush", "Wallace", "Deborah Lee James", "Obama"], "text": "The first Air Force One is wasting away in the desert 03:25 PLAY VIDEO RELATED: The first Air Force One is wasting away in the Arizona The maintenance done on the aircraft was routine and there was nothing wrong with the plane, according to Wallace. The lengthy process is described as normally cosmetic and preventive, but may include upgrades as well. Information of what was done to the plane received by the President on Monday was not immediately available. The aircraft the President has been using for the past 18 months, VC-25, Tail #29000 is now headed to Texas for a similar maintenance, according to Wallace. During the George W. Bush administration, both of the aircrafts used as Air Force One were worked on for a similar period of time. The maintenance would have included a pretty thorough inspection including parts being completely torn down and replaced, interior technology upgrades and the possible removal of paint to look for any cracking in the body. Both planes the President currently uses will reach the end of their 30-year service life in 2017, and according to The Wall Street Journal, the U.S. Air Force has set aside $1.65 billion between 2015 and 2019 for two replacement jets. In January, the Pentagon announced it had chosen Boeing's 747-8 to replace the two aging planes Obama currently uses. Air Force Secretary Deborah Lee James said in a statement that the plane, one of Boeing's largest, is the only aircraft \"manufactured in the United States [that] when fully missionized meets the necessary capabilities established to execute the presidential support mission, while reflecting the office of the President of the United States of America consistent with the national public interest.\" It will undertake the modifications necessary to make the plane ready for presidential flights, including the addition of sophisticated communication equipment and living quarters for the President and his staff. James said that \"parts obsolescence, diminishing manufacturing sources and increased down times for maintenance\" are all persistent issues that contribute to the need for a new fleet. On Monday, ABC Reporter Jonathan Karl tweeted from aboard the newly tuned up Air Force One, \"#Obama has flown 1.1 million miles on Air Force One, or 2364 hours in the air. That's equivalent of 98 days on the plane! #AF1 @WNTonight.\" #Obama has flown 1.1 million miles on Air Force One, or 2364 hours in the air. That's equivalent of 98 days on the plane! #AF1 @WNTonight — Jonathan Karl (@jonkarl) May 4, 2015 Air Force One consists of 4,000 square feet of floor space along three levels. The President enjoys his own suite with a large office, bathroom and conference room. The aircraft also includes a medical suite and two food galleys capable of feeding up to 100 people. ", "external_links": [], "published": "2015-05-05T07:34:00.000+03:00", "crawled": "2015-05-05T07:35:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}