{"organizations": [], "uuid": "6a7f5eb7b1fe6215834cce089de56696ee2456f5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3001124/images/o-BOATING-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/abortion/feed", "section_title": "Abortion on Huffington Post", "url": "http://www.huffingtonpost.com/david-a-grimes/regulating-abortion-and-boating-a-modest-proposal_b_7337960.html", "country": "US", "title": "David A. Grimes: Regulating Abortion and Boating: A Modest Proposal", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "David A. Grimes: Regulating Abortion and Boating: A Modest Proposal", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T17:51:00.000+03:00", "replies_count": 0, "uuid": "6a7f5eb7b1fe6215834cce089de56696ee2456f5"}, "author": "David A. Grimes", "url": "http://www.huffingtonpost.com/david-a-grimes/regulating-abortion-and-boating-a-modest-proposal_b_7337960.html", "ord_in_thread": 0, "title": "David A. Grimes: Regulating Abortion and Boating: A Modest Proposal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThe recent avalanche of state abortion regulations (for the sole purpose of improving safety ) has had the desired salutary effect. Indeed, thanks to the Republican Party's preoccupation with gynecology , the risk of death from abortion has over the past decade gone from one death per 100,000 procedures to one death per 100,000 procedures. (The challenge was considerable, since getting lower than one is tough.) After the bevy of new restrictions, abortion today is safer than an injection of penicillin (as it was before the new regulations). Emboldened by their dramatic success in improving abortion safety, Republican-led state legislatures should now direct their medical expertise to non-gynecologic public health threats. \nDanger in an abortion clinic? \nAccording to the Centers for Disease Control and Prevention, over the past decade the average number of deaths in the U.S. from legal abortion has been about 10 per year . Induced abortion and miscarriage remain the safest possible conclusions of pregnancy. In my home state of North Carolina, no abortion-related death has occurred in decades. \nPhoto courtesy of National Park Service \nDanger on the high (and low) seas \nIn North Carolina, 16 persons have died in boating accidents in the first few months of 2015. In 2014, 26 persons died in boating accidents in the state. Most fell overboard and drowned, and most of these deaths could have been prevented had life jackets been worn. \nNationwide, 610 persons died in boating accidents in 2014, for a boating risk of death of 5.2 deaths per 100,000 registered boats. Many of these deaths were preventable. Among drownings for which information was available, 84 percent of victims were not wearing a life jacket. \nTime for new laws! \nAs these federal statistics reveal, each year about 60 times more Americans die from boating than from abortion. While the risks are not directly comparable, having a boat is clearly more dangerous than having an abortion. Hence, more boating regulations are needed. Modeled after the highly successful abortion regulation blitz, the following is a tongue-in-cheek legislative agenda for the Republican Party . \nBoaters' Right to Know Act \nBecause of the dangers involved, women must receive state-mandated counseling about boating safety before launching. A script written by part-time politicians in the state capital will advise boaters of the risks, benefits, and alternatives of boating. The state-scripted counseling must include the following: Boating causes long-lasting psychological distress related to leaving terra firma (dubbed the \"post-nautical stress syndrome\"). \nGovernment-issued nautical charts are unreliable; the earth is indeed flat, and boats routinely fall off the edge. Wearing a life jacket increases the risk of breast cancer from friction with the chest. \nCrisis Boating Centers \nState-mandated counseling will refer potential boaters to information centers sponsored by golfing organizations opposed to boating. Proceeds from state-sponsored license plates saying \"Choose golf\" will subsidize these centers, which provide both on-site and Internet information about boating. \nUltrasound requirement \nAll boats must have an ultrasound transducer (sonar). The boat operator must provide a narrated description of the contours of the bottom of the river, lake, or ocean to women passengers before launching. \nHospital proximity \nBoats can only be operated on waters within 30 miles of a hospital in the rare event that hospitalization of a passenger or crew member is needed. \nMandatory waiting periods \nBecause women boaters are flighty and irresponsible, a mandatory waiting period is required. A three-day wait sounds about right. For example, if a woman decides after work on Friday to take her children fishing, she could receive the obligatory state counseling about risk and then cast off from the dock... on Monday evening. She has the entire weekend to reflect on whether fishing was a prudent plan for her family. \nLicensure \nOnly Coast Guard-licensed captains can operate boats (despite decades of evidence that such extensive training and experience are unnecessary ). \nFacilities \nSince ambulatory surgical centers are (incorrectly) thought to be safer than abortion clinics, similar upgrades are needed for boating: Only Coast Guard-inspected vessels may be used for recreational boating. \nBoats must be at least 40 feet long and 14 feet wide, with a canvas or hard top for sun protection. \nAll boats must be equipped with a chart plotter, autopilot and radar. Only diesel engines are allowed, since this fuel is less flammable than gasoline used in outboard engines. \nInsurance \nWith state regulation of abortion coverage in health insurance as a model, states will determine which private insurance carriers can underwrite boat insurance policies. Insurance companies need legislative help. \nPolitics and public health \nAs Groucho Marx aptly noted, \nPolitics is the art of looking for trouble, finding it everywhere, diagnosing it incorrectly and applying the wrong remedies. \nFollow David A. Grimes on Twitter: www.twitter.com/drdavidagrimes More:", "external_links": [], "published": "2015-05-27T17:51:00.000+03:00", "crawled": "2015-05-27T22:52:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}