{"organizations": [], "uuid": "a9007ea5ccaf40acafdcb2c64962aff8d94918a2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/isis_4.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/defense/243187-obama-aide-us-must-adapt-its-strategy-in-iraq-to-combat-isis", "country": "", "title": "Obama aide: US must adapt its strategy in Iraq to combat ISIS | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Obama aide: US must adapt its strategy in Iraq to combat ISIS | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "a9007ea5ccaf40acafdcb2c64962aff8d94918a2"}, "author": "", "url": "http://thehill.com/policy/defense/243187-obama-aide-us-must-adapt-its-strategy-in-iraq-to-combat-isis", "ord_in_thread": 0, "title": "Obama aide: US must adapt its strategy in Iraq to combat ISIS | TheHill", "locations": ["US", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jesse Byrnes", "Obama"], "text": "Obama aide: US must adapt its strategy in Iraq to combat ISIS By Jesse Byrnes - 05/27/15 11:04 AM EDT \nThe United States is focused on training and equipping local Iraqi forces but must \"adapt\" its strategy to combat Islamic militants in that country, White House communications director Jen Psaki said Wednesday. ADVERTISEMENT \"We need to adapt our strategy, too, and adapt to the type of equipment we're providing as well as time goes on and as ISIL adapts,\" Psaki said on CNN's \"New Day,\" using an alternate acronym for the Islamic State in Iraq and Syria (ISIS).\nThe Obama administration has faced renewed scrutiny over its strategy to degrade and ultimately destroy the terrorist group since ISIS militants seized Ramadi, the capital of Iraq's Anbar province, earlier this month. \nThat routing prompted Defense Secretary Ashton Carter to criticize the Iraqi troops as having \"no will to fight\" ISIS, which drew the ire of Iraqi defense officials and Prime Minister Haider al-Abadi over the weekend. Al-Abadi said he was surprised by Carter's comments and suggested he was \"fed with the wrong information.\" \nPsaki noted Carter's remarks were \"consistent with what he was seeing and hearing from the ground.\" \n\"The Iraqis themselves have acknowledged there were some command issues, there were some issues on the ground,\" Psaki reiterated on CNN, adding, \"It's something they want to adapt to as well.\" \n\"There are going to be ups and downs here. We need to continue to adapt,\" she added. \nOn Tuesday, the White House similarly stood by Carter's comments, with spokesman Josh Earnest citing a \"breakdown in some military command and planning\" in the U.S.-backed Iraqi army. \nThe Pentagon announced last week it would send 2,000 anti-tank weapons to Iraq as early as this week. Iraqi defense officials have called for additional U.S. supplies to combat ISIS. \nSome Republican lawmakers have called for additional U.S. troops to train and assist Iraqi security forces. \nIn Syria, where ISIS has also taken large swaths of land in recent months, the U.S. is relying on airstrikes along with other nations to defeat the group. Tags: ", "external_links": [], "published": "2015-05-28T03:00:00.000+03:00", "crawled": "2015-05-28T17:26:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}