{"organizations": ["Fox News Nothing"], "uuid": "5b11215a5427db2c63a553b8cba72edf85a0a85e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/050913/0/0/050913_an_benghazihearing_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/10/clinton-obama-and-what-should-have-happened-as-benghazi-unfolded.html", "country": "", "title": "Clinton, Obama and what should have happened as Benghazi unfolded | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Clinton, Obama and what should have happened as Benghazi unfolded | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5b11215a5427db2c63a553b8cba72edf85a0a85e"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/10/clinton-obama-and-what-should-have-happened-as-benghazi-unfolded.html", "ord_in_thread": 0, "title": "Clinton, Obama and what should have happened as Benghazi unfolded | Fox News", "locations": ["Benghazi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Obama"], "text": "Nothing to see here: media's Benghazi bias \nOn September 14, 2012, Hillary Clinton should have made clear that Al Qaeda related groups were responsible for the attacks in Libya; instead she doubled down on the YouTube video. And White House spokesman Jay Carney lied again, telling reporters “we were not aware of any actionable intelligence indicating that an attack on the U.S. mission in Benghazi was planned or imminent.” \nReally? On September 11? With cables begging for increased security? With Al Qaeda leader Ayman Zawahiri calling for revenge attacks for the killing of senior Al Qaeda leader Abu Yahya al Libi – “the Libyan”? Really? \nAnd most of all, what shouldn’t have happened was Obama administration ambassador to the United Nations Susan Rice hitting the Sunday shows to speak about “spontaneous” demonstrations in Benghazi. What, terrorists, where? \nMuch has been made of the forensic work being done by Rep. Darrell Issa, and he has been accused repeatedly of flogging a dead horse. \nYes, he has uncovered clear evidence that talking points were edited in order to diminish the appearance of an Al Qaeda terrorist attack. \nYes, he has uncovered whistle blowers within State who were ignored in the nominally “independent” review of what transpired in Benghazi. But this, apparently, is not enough. \nHere’s the problem the press and Obama’s allies fail to grasp: There was no obvious reason to cover up what happened in Benghazi. And because there was no obvious reason, it appeared that the administration was aware of something it wished to hide from the American people in a thicket of lies, half-truths and deliberate omissions. We should expect that the Congress of the United States would wish to get to the bottom of such a cover up. \nThe simple facts of the Benghazi attack are clear, and the mistakes that were made in that first day are even forgivable because mistakes are made in the fog of battle. But when such mistakes are made, serious leaders admit them and move on. \nWhat would have happened if the president of the United States had stepped into the Rose Garden on September 12 and said: “Yesterday, a number of statements were made with which I am not comfortable. We are uncertain about what happened yesterday in Benghazi. We are investigating aggressively, and we will share our findings when we have them.” \nWhy not? In part because of naked politicking and a desire to avoid undercutting the I-killed-Usama-Al-Qaeda-is-on its-heels meme of the election. In part, because, apparently, the Obama administration cannot admit fault. \nWhat would have happened if Hillary Clinton had said, “I am deeply disturbed that requests for better security for Benghazi were not taken seriously, and I will get to the bottom of this and heads will roll”? What would have happened if requests for additional security hadn’t been dismissed? If those at the scene and with knowledge of the attack had been interviewed by investigators and not intimidated? \nThe answer, clearly, is that there would be little reason for an investigation. There would be little reason for hearings and lawyers. Because the administration would have been honest and up front from the get-go about mistakes that were made. But they didn’t and they weren’t and it should come as no surprise to anyone that those who choose to hide the facts, intimidate their critics and otherwise cover up a story are going to be investigated. Should we not expect that? And applaud it? \nDanielle Pletka is Vice President for Foreign and Defense Policy Studies at AEI, the American Enterprise Institute . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}