{"organizations": ["National Security Reuters", "National Security Obama", "Military"], "uuid": "d913076c7943b5e4b1108f7c49acdf26ab0d82e6", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2972694/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/20/obama-climate-change_n_7341638.html", "country": "", "title": "Obama: Climate Change Poses Risk To U.S. Military, National Security", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama: Climate Change Poses Risk To U.S. Military, National Security", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T17:26:00.000+03:00", "replies_count": 0, "uuid": "d913076c7943b5e4b1108f7c49acdf26ab0d82e6"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/20/obama-climate-change_n_7341638.html", "ord_in_thread": 0, "title": "Obama: Climate Change Poses Risk To U.S. Military, National Security", "locations": ["US", "U.S.", "Camden", "New Jersey"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["NICHOLAS KAMM", "Barack Obama", "Obama"], "text": "Obama: Climate Change Poses Risk To U.S. Military, National Security Reuters Updated: 2 hours ago US President Barack Obama addresses youth and law enforcement from the Camden community in Camden, New Jersey, on May 18, 2015. AFP PHOTO/NICHOLAS KAMM (Photo credit should read NICHOLAS KAMM/AFP/Getty Images) | NICHOLAS KAMM via Getty Images reddit \nBy Roberta RamptonWASHINGTON, May 20 (Reuters) - Rising seas, thawing permafrost and longer wildfires caused by warmer global temperatures threaten U.S. military bases and will change the way the U.S. armed services defend the country, President Barack Obama is set to say on Wednesday.In his commencement address at the United States Coast Guard Academy in New London, Connecticut, the White House said Obama will underscore the risks to national security posed by climate change, one of his top priorities for action in his remaining 19 months in office.\"You are part of the first generation of officers to begin your service in a world where the effects of climate change are so clearly upon us,\" Obama is set to tell the 224 graduating cadets, according to excerpts from his prepared remarks.\"Climate change will shape how every one of our services plan, operate, train, equip, and protect their infrastructure, today and for the long-term,\" Obama will say.The Pentagon is assessing the vulnerability to climate change of its 7,000 bases, installations and facilities, many of which are on the coast, the White House said.Obama is set to highlight damage to the navy and air bases at Norfolk, Virginia, from increasing floods, to Alaskan facilities built on thawing permafrost, and to military training areas in western states from wildfires.\"Climate change poses a threat to the readiness of our forces,\" he is expected to say.He will also discuss the risks to global security from climate change and large weather-related disasters that can fuel political instability and tensions, the White House said.Obama has been trying to build support for an international agreement to cut greenhouse gas emissions. Global talks on the deal are slated for Paris in December.This summer, his administration will finalize regulations to cut carbon emissions from power plants, a step that has been fought by Republicans who control Congress.He has also said he will make a decision before he leaves office on the long-stalled Keystone XL crude oil pipeline from Canada, a ruling he has said hinges in part on whether the TransCanada Corp project would boost carbon emissions. (Editing by Paul Tait) Also on HuffPost: ", "external_links": [], "published": "2015-05-20T17:26:00.000+03:00", "crawled": "2015-05-20T18:06:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}