{"organizations": [], "uuid": "0fe162cc2224b9dfa6d6b62cd1fc8763521a165b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/ewrewrer3453543.jpg", "site_section": "http://www.foxnews.com/leisure/index.html", "section_title": "Lifestyle News | Latest Autos | Food &amp; Drink | Real Estate | Fox News", "url": "http://www.foxnews.com/leisure/2015/05/18/marijuana-k-cups-and-coffee-pods-hit-store-shelves/", "country": "US", "title": "Marijuana-infused coffee pods hit store shelves", "performance_score": 2, "site": "foxnews.com", "participants_count": 7, "title_full": "Marijuana-infused coffee pods hit store shelves | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-18T03:00:00.000+03:00", "replies_count": 7, "uuid": "e36df999d4f81ce820634b397510ac87f0bac1a1"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/leisure/2015/05/18/marijuana-k-cups-and-coffee-pods-hit-store-shelves/#post-0", "ord_in_thread": 0, "title": "Marijuana-infused coffee pods hit store shelves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 18, livefyre Email Print Cannabis infused coffee is available in loose grounds and convenient single-serving pods. (Fairwinds Manufacturing)\nCannabis-infused coffee is now available in convenient single-use pods for those who want a little more buzz to their a.m. jolt.\nSeattle-based Uncle Ike’s Pot Shop now sells pods of premium Catapult coffee at a steep $10 per pod. Each pod works in standard, single-serve coffee makers and contain 10 mg of THC, marijuana’s psychoactive ingredient. The shop previously sold loose grounds infused with marijuana but the pods are “quickly becoming big sellers,” said the shop.\n“I liken it to a Red Bull and vodka,” Jennifer Lanzador, Uncle Ike’s sales manager, told Yahoo. “I had more energy, but I still had the relaxation you get from cannabis.”\nFairwinds Manufacturing, the Vancouver company that actually makes the pods for Uncle Ike’s, reported that the pods now account for 60 percent of company sales.\nFairwinds isn't the only company making cannabis-infused coffee.\nHouse of Jane in California has four types of cannabis K-cups: medium roast, dark roast, decaf and mocha café. It also sells marijuana infused coffees, teas and creamers—one of which recently won a best-edible award at one of the world’s largest medical marijuana trade shows HempCon. It is also working on cannabis-infused “Frappuccino”—the drink will not be sold at Starbucks but the team hopes to capitalize on the popularity of the well-known creamy beverage during the hot summer months.\nEd Rosenthal, whose brand is well known for marijuana growing guides and a line of pre-rolled joints, has a line of coffees called Ed Rosenthal’s Select Coffee & Tea.\n“Ed’s been wanting to come up with a new product that’s not the standard candy bar,” Rosenthal’s CEO Ross Franklin told Yahoo.\nEmily Paxhia, co-founder of Poseidon Asset Management, a California asset manager focusing on marijuana-related investments, says that coffee will give cannabis-infused edibles a wider appeal.\n“The more that cannabis can be consumed in forms that are familiar to broader populations, the more interesting it’s going to become to a mass market,” Paxhia said.\n Annual 3 4 Five 5 Long lost Cord found after a half-century See ", "external_links": [], "published": "2015-05-18T03:00:00.000+03:00", "crawled": "2015-05-18T23:26:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}