{"organizations": [], "uuid": "24e94acfcb430fbc672766e50500b9e9ae32e46f", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/clintonhillaryroundtable_050815getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/homenews/administration/241517-hillarys-immigration-move-has-risks-rewards", "country": "", "title": "Hillary’s immigration move has risks, rewards | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Hillary’s immigration move has risks, rewards | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "24e94acfcb430fbc672766e50500b9e9ae32e46f"}, "author": "", "url": "http://thehill.com/homenews/administration/241517-hillarys-immigration-move-has-risks-rewards", "ord_in_thread": 0, "title": "Hillary’s immigration move has risks, rewards | TheHill", "locations": ["Jordan Fabian"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary"], "text": "Hillary’s immigration move has risks, rewards Getty Images By Jordan Fabian - 05/09/15 10:48 AM EDT \nHillary Clinton has thrilled immigration activists with her embrace of a pathway to citizenship for illegal immigrants. \nIt’s also thrilled Democrats, who think Clinton has taken a smart political step to solidifying support among Hispanics for their party in next year’s presidential election. ADVERTISEMENT They argue the GOP’s restrained response to Clinton shows Republicans are worried about the issue, particularly given the nation’s rising Hispanic population.\n“It’s definitely a very aggressive approach in attempting to court the Hispanic vote,” said Mercedes Viana Schlapp, who served as a Spanish-language spokesperson for President George W. Bush. \nIn part because they have backed immigration reform in the past, Republicans hope former Florida Gov. Jeb Bush and Sen. Marco Rubio (Fla.) could make inroads with Hispanics. But even some GOP critics of Clinton such as Schlapp acknowledge that Clinton may have made the party’s task more difficult. \nClinton’s comments amounted to a taunt against Bush and Rubio, whose support for legal status for undocumented workers falls short of Clinton’s new demands. She said their position “is code for second-class status.\" \n“We are very happy with what she said,” said Lynn Tramonte, deputy director of America’s Voice, a left-leaning immigration advocacy group. “I don’t think she would make all these commitments if she wasn’t going to follow up on them. She knows we are going to hold her accountable.” \nThe risks for Clinton are mostly long-term, and will only be an issue if she achieves her goal of reaching the White House. \nSome Democrats privately fear Clinton may have promised too much. \nDuring her appearance this week in Nevada, Clinton said she would push Congress to pass a comprehensive immigration bill with “full and equal” citizenship for immigrants living in the U.S. illegally. \nThat will be difficult to do with Republicans expected to retain control of the House. \nObama found himself in hot water with immigration activists during his first term when he failed to deliver on his 2008 campaign pledge to take on immigration reform during his first year in office. But some Democrats say Clinton may avoid the same fate. \n“The issue back in 2008 was committing to a timeline,” said Jose Parra, a former senior adviser to Senate Minority Leader Harry Reid (D-Nev.) “So many things are out of the control of the president. She was smart not to offer up a timeline.” \nAnother risk involves Clinton’s pledge to take executive action if Congress does not act — which could put her in conflict with Democrats down the ballot. \nIn 2014, Obama delayed his own executive actions until after the election at the behest of vulnerable Senate Democrats. \nOf course, that maneuver did not work, with Democrats taking a pounding in the 2014 midterms and losing the Senate. \nThere are also questions about how far Clinton can expand on Obama’s actions. She suggested parents of young immigrants who brought to the U.S. illegally, known as “Dreamers,” and those with “deep ties and contributions to our communities” could lobby the government for deportation relief. \nBut the White House said this week that Obama’s executive actions were all he could do under the law. Press secretary Josh Earnest said whether broader executive actions are illegal “will be something for future presidents and ultimately future courts to decide.” \nOf course, Team Clinton doesn’t have to worry about these risks for now. \nAnd the early signs show Clinton’s moves could pay off with Hispanics, who were a key part of Obama’s winning coalitions in 2008 and 2012. \nA new NBC News/Wall Street Journal poll showed Clinton leading Bush among Latino voters 66-28 percent and ahead of Rubio 63-32 percent. Most pollsters believe a Republican needs to win 40 percent of the Latino vote to win the White House. \nObservers in both political parties say Republicans won’t build credibility with Latino voters until they can articulate concrete policy proposals on immigration. \n“If anything, it’s Republicans who are the ones who need to figure out what they would do to address the undocumented population,” said Parra. “They keep trying to dance around the issue.” \n“They need to talk about their plans for immigration reform,” said Schlapp. “You need to answer the question of what you are going to do with the 12 million” immigrants living in the U.S. illegally. \n", "external_links": [], "published": "2015-05-09T03:00:00.000+03:00", "crawled": "2015-05-09T19:02:09.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}