{"organizations": [], "uuid": "1af46b197320fbdf09fbe9fc88e0e7e8805e93e7", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/waterpipe05282015getty.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/energy-environment/243299-democrats-buck-obama-on-water-rule", "country": "", "title": "Dems buck Obama on water rule | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Dems buck Obama on water rule | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T19:47:00.000+03:00", "replies_count": 0, "uuid": "1af46b197320fbdf09fbe9fc88e0e7e8805e93e7"}, "author": "", "url": "http://thehill.com/policy/energy-environment/243299-democrats-buck-obama-on-water-rule", "ord_in_thread": 0, "title": "Dems buck Obama on water rule | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Timothy Cama", "Obama"], "text": "Dems buck Obama on water rule Getty Images By Timothy Cama - 05/28/15 10:24 AM EDT \nDozens of congressional Democrats are joining Republicans to back legislation blocking the Obama administration’s new rule to redefine its jurisdiction over the nation’s waterways. \nThe Environmental Protection Agency (EPA) and the Army Corps of Engineers made the regulation final Wednesday in an attempt to clarify that small streams, wetlands, headwaters and tributaries are covered by the Clean Water Act and the rules that go along with it. \nOpponents labeled the rule as a massive “power grab” by the Obama administration that could give federal officials authority over every creek and puddle. ADVERTISEMENT Three moderate Democrats in the Senate and 24 in the House have joined the GOP in opposition, but leave them far from the two-thirds majorities they would need for a veto-proof vote to overturn the rule.\nBut their support offers a bipartisan vote against the water regulation if they decided to use the Congressional Review Act or another legislative strategy to show opposition to Obama’s action. \nDemocratic Sens. Heidi Heitkamp (N.D.), Joe Manchin (W.Va.) and Joe Donnelly (Ind.) signed on this month with Sen. John Barrasso (R-Wyo.) and 26 other Republicans as co-sponsors of the Federal Water Quality Protection Act. Heitkamp, Manchin and Donnelly are often skeptics of the Obama administration’s environmental agenda. \nIn rolling out the final rule Wednesday, the administration questioned the motives of opponents. \n“The only people with reason to oppose the rule are polluters who want to threaten our clean water,” said Brian Deese, Obama’s top environmental adviser. \nThe Senate bill would overturn the water rule and give the EPA specific instructions and a deadline for writing it in a way that senators hope would cover fewer bodies of water and impede less on private and state property rights. \n“It’s frustrating that after so much time, the EPA today decided to finalize this rule instead of conducting more consultations and releasing a revised rule as our legislation would require,” Heitkamp said in a Wednesday statement. \n“For the past several months, I’ve been working on a bipartisan bill to fix this issue by actually taking into account the needs of our farmers and ranchers, and giving them clarity without adding more federal regulations,” she said. \nIn his own statement, Manchin accused the EPA of “once again dangerously overreaching its boundaries by expanding the definition of water sources it can regulate.” \nHe said the rule “will certainly have a significant impact on West Virginia’s economy, hindering businesses, manufacturing and energy production.” \nThe two dozen House Democrats joined all 237 Republicans present earlier this month to pass the Regulatory Integrity Act, sponsored by Reps. Bill Shuster (R-Pa.) and Bob Gibbs (R-Ohio), to overturn the rule. \nThe Democrats included moderate members of the Blue Dog Coalition like Reps. Jim Cooper (Tenn.), Gwen Graham (Fla.) and Sanford Bishop (Ga.). \nThe group also included representatives of states with heavy agriculture, like Reps. Tim Walz (Minn.) and Henry Cuellar (Texas). \nFarmers and ranchers have been among the most vocal opponents of the water rule, saying it would mandate expensive permits and federal review for common agricultural tasks like digging ditches and spraying fertilizer. Tags: ", "external_links": [], "published": "2015-05-28T19:47:00.000+03:00", "crawled": "2015-05-28T19:47:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}