{"organizations": [], "uuid": "d007663c9a903d5dc1e323adf161444a14cabfe3", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Opinion/0/0/660-Obama-WH%20walking-AP.jpg", "site_section": "http://www.foxnews.com/opinion/index.html", "section_title": "Opinion &amp; Analysis on the Latest Breaking News | Fox News", "url": "http://www.foxnews.com/opinion/2015/04/30/long-list-unsolved-problems-obama-will-leave-behind/", "country": "US", "title": "The long list of unsolved problems Obama will leave behind", "performance_score": 0, "site": "foxnews.com", "participants_count": 11, "title_full": "The long list of unsolved problems Obama will leave behind | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-04-30T03:00:00.000+03:00", "replies_count": 12, "uuid": "6df45a8563c51f8ba113cbc9374c63b7b80ca7ce"}, "author": "Karl Rove", "url": "http://www.foxnews.com/opinion/2015/04/30/long-list-unsolved-problems-obama-will-leave-behind/#post-0", "ord_in_thread": 0, "title": "The long list of unsolved problems Obama will leave behind", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Karl Rove\nPublished April 30, 2015 The Wall Street Journal Facebook 0 Twitter 0 livefyre Email Print April 2, 2015: President Obama walks back to Oval Office from the Rose Garden of the White House in Washington. (AP Photo/Pablo Martinez Monsivais)\nAt last Saturday’s White House Correspondents’ Dinner, President Obama declared he was determined to “make the most of every moment” left in office, saying he had been working on a “bucket list” that included executive action on immigration and climate regulation. Aware that his critics believe he’s often acted lawlessly, Mr. Obama joked that the title for his list rhymes with “bucket.”\nRegardless of what items Mr. Obama checks off, he will leave to his successor a staggering array of domestic problems, some he ignored and many he made worse.\nAfter this president’s six years in the White House the country is adrift, thanks to leadership that has been mistaken, insufficient or absent.\nSlow economic growth will be at the top of the list of problems. The pattern of American history has been that the more severe the recession, the stronger the recovery. Until now. In Mr. Obama’s recovery, average annual growth has been the slowest since the U.S. began compiling reliable economic statistics near the 20th century’s beginning—a feeble 2.9%. This year is off to an even slower start, with GDP growing 0.2% in the first three months.\nThe number of jobs also will be on that list. It took from June 2009 to April 2014—nearly five full years—to get back to having the same number of people working as when the recession began in December 2007. That’s a longer period of time to return to the starting point than in any recession in U.S. history. Meantime, roughly 14.7 million people came of age without a job available. The last time the job participation rate was this low was 1978. A third of Americans between 18 and 31 last year were living with their parents, the highest percentage in at least four decades.\nTo continue reading Karl Rove's column in the Wall Street Journal, click here .\nKarl Rove joined Fox News Channel (FNC) as a political contributor in February 2008. He also currently serves as a columnist for the Wall Street Journal.\nAdvertisement\nTrending in Opinion 1 ‘We will not obey’: Christian leaders threaten civil disobedience if Supreme Court legalizes gay marriag 2 The long list of unsolved problems Obama will leave behind 3 Fool of the Week: Boston bombers' mom 4 Hero of Baltimore riots: A mom 5 IRS scandal: Thousands of lost Lois Lerner emails reappear. Will Congress keep the pressure on? See all Trends Opinion Connect Thought-provoking headlines from our top opinion contributors\nThank you! Your subscription has been submitted. Fox Nation MSNBC's Alex Wagner: 'Half-Black' Obama 'Doubling Down' On Using Thug April 30, 2015\nBaltimore Police, Sharpton Wall Off Fox News Reporter Trying to Ask Mayor Questions ... April 30, 2015\nOPINION: Al Sharpton's Baltimore ", "external_links": ["https://platform.twitter.com/widgets/follow_button.1389999802.html#_=1390944151618&id=twitter-widget-0&lang=en&screen_name=fxnopinion&show_count=false&show_screen_name=true&size=m", "http://global.fncstatic.com/static/managed/img/Opinion/fn-americas-talking.jpg", "http://www.facebook.com/plugins/like.php?href=https%3A%2F%2Fwww.facebook.com%2Ffxnopinion&width&layout=button_count&action=like&show_faces=true&share=false&height=21", "http://www.wsj.com/articles/the-messes-obama-will-leave-behind-1430349131", "http://online.wsj.com/home-page"], "published": "2015-04-30T03:00:00.000+03:00", "crawled": "2015-05-01T04:02:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}