{"organizations": [], "uuid": "b7c5c787d8bbb93758d50eda9e39b18637d7f5e2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/womens-health/feed", "section_title": "Womens Health on Huffington Post", "url": "http://www.huffingtonpost.com/christopher-purdy/abortion-yeah-we-do-that-a-look-into-a-new-model-of-abortion-care-in-the-us_b_7163530.html", "country": "US", "title": "Christopher Purdy: 'Abortion. Yeah, We Do That.' -- A Look Into a New Model of Abortion Care in the US", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Christopher Purdy: 'Abortion. Yeah, We Do That.' -- A Look Into a New Model of Abortion Care in the US", "spam_score": 0.0, "site_type": "news", "published": "2015-05-07T20:29:00.000+03:00", "replies_count": 0, "uuid": "b7c5c787d8bbb93758d50eda9e39b18637d7f5e2"}, "author": "Christopher Purdy", "url": "http://www.huffingtonpost.com/christopher-purdy/abortion-yeah-we-do-that-a-look-into-a-new-model-of-abortion-care-in-the-us_b_7163530.html", "ord_in_thread": 0, "title": "Christopher Purdy: 'Abortion. Yeah, We Do That.' -- A Look Into a New Model of Abortion Care in the US", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nOne of every three women in the United States will have an abortion in her lifetime. Despite the fact that abortions are a common experience, women are increasingly unable to obtain these services due to abortion restrictions that are closing these clinics and make abortion care harder to find. \nChanges in the way medical care is provided have been driven by technology and innovation as well as the expectations of consumers requesting care that is more personalized, convenient, comfortable and digital. Information about medical problems and solutions is only a click or screen tap away. Medical providers have adapted to begin to provide faster, more convenient basic services to customers -- as evidenced by the advent of urgent care and walk in clinics at pharmacies and retail chain stores. \nEven the \"standard\" hospital or physician's office of 10 years ago looks very different from healthcare environments today as natural and cultural contexts are blended with high performance facilities. Design trends are moving away from an institutional look and embracing a more natural, sustainable design while maximizing views and comfortable natural light. \nIn addition, medicine is no longer the rarified domain of universities and hospitals. It has exploded into everyday life through advertising and promotions -- from TV commercials for medications, to print ads for cancer treatment centers, to billboards for mammography suites. \nIt seems perfectly logical, therefore, that the field of reproductive health should equally adapt to these new expectations and methodologies in the way we provide services. Just as health care in general has changed -- so should abortion care. Carafem has been established with this idea in mind. \nWhen we launched carafem, our first question was how to provide the best quality abortion care possible for women. Young women between the ages of 18-29, who account for over half of all abortions, have a shared expectation that the services they seek will be current, digital and flexible to align with their busy lives. They look for providers that speak confidently and non-judgmentally about solutions to their healthcare needs, and who can provide them with service that makes them feel valued. Carafem seeks to address this, and is now offering more personalized health care. \nThis means changing the way services are provided: offering same day and next day one-hour appointments with weekend and evening times, guaranteeing quality one-on-one time with a clinician, offering 24/7 telephone, online chat and text opportunities to ensure full communication and connection and emphasizing integrated technology, like electronic health records and secure patient online portals to enhance the client experience and understanding. Being more efficient reduces costs, savings that we can pass along to clients. This all results in better quality care. \nOne important way to change the way abortion care is provided is to focus on the abortion pill , which can be used through the first ten weeks of a pregnancy. Carafem provides medication (mifepristone and misoprostol) that is provided in the health center, that women then use in the privacy of their own home to end an early pregnancy. We educate, prepare and support each woman throughout the process with tools provided in a variety of formats and languages. These drugs have been used safely and effectively around the world for over 20 years but are not as well known in the USA. The abortion pill (also known as \"medication abortion\" accounts for just 23 percent of all abortions even though 90 percent of abortion clients are eligible for this method. \nBy focusing on the abortion pill, carafem is able to use the newest technology and proven medical best practices based on scientific evidence to streamline visits, reducing time in the health center, lessening total cost of service, and giving women the ability to take control of their abortion process. With these focused visits, carafem is able to emphasize quality assurance and client satisfaction. \ncarafem's services are: \n• professional: our team has decades of experience in the provision of abortion care. • convenient: carafem has convenient hours and the office visit will take around 60 minutes. • affordable: The out-of-pocket full cost of service is $400, $100 less than the national average for the abortion pill. • client-centered: We treat each woman with respect and compassion. • caring: Our team listens and understands. We provide accurate, holistic information and advice in a clear, non-judgmental manner. • modern: We have leveraged the newest technology and evidence based practices such as digital learning tools, fully electronic health records, a secure client online portal, and 24/7 staff who answer the phone or use online chats and texts to answer questions or to make appointments. • advertised: We boldly and clearly inform women about the availability of our services • online: Everything you need to know is at carafem.org \nCenters are small and inviting . Great care has been paid to reduce the anxiety that comes with receiving medical care. At carafem, there are no harsh medicinal smells, no institutional hospital-like equipment in view. Staff are friendly and sit side by side with clients and not across the desk behind a computer screen. Tests are performed only as necessary and almost all within the same room, so clients can relax and listen and ask questions. carafem staff welcome women to bring a partner or supportive friend to their visit. Our primary focus is to decrease anxiety and help clients to relax and learn about their desired treatment plan. \nAnother initiative to update the abortion experience and modernize the conversation around abortion is through carafem's advertising campaign. We are dedicated to lifting the curtain off abortion care and openly talking about women's options in their reproductive lives. This is aimed at addressing the deeply entrenched stigma associated with abortion care. That is why we advertise on public transportation and online, and have a strong web presence. \nMillions of women around the world choose this medical service every year. In addition to normalizing and de-stigmatizing this service, we seek to update the quality of care so our clients can have a comfortable and efficient visit. We've listened to women for decades, and they tell us it's time for a change. More:", "external_links": [], "published": "2015-05-07T20:29:00.000+03:00", "crawled": "2015-05-08T00:42:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}