{"organizations": ["Statehouse"], "uuid": "54ced8d2be37694dd6348e48f1de5a3af97bb4f3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2969772/images/o-LEE-BRIGHT-SOUTH-CAROLINA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/19/south-carolina-abortion_n_7333144.html", "country": "", "title": "Republican Filibusters Abortion Ban Because He Opposes Rape and Incest Exceptions", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Republican Filibusters Abortion Ban Because He Opposes Rape and Incest Exceptions", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T05:45:00.000+03:00", "replies_count": 0, "uuid": "54ced8d2be37694dd6348e48f1de5a3af97bb4f3"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/19/south-carolina-abortion_n_7333144.html", "ord_in_thread": 0, "title": "Republican Filibusters Abortion Ban Because He Opposes Rape and Incest Exceptions", "locations": ["S.C.", "Columbia", "R-Spartanburg"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lee Bright", "Brad Hutto"], "text": "Republican Filibusters Abortion Ban Because He Opposes Rape and Incest Exceptions Posted: Updated: 3 hours ago Sen. Lee Bright, R-Spartanburg, right, holds onto the microphone as Sen. Brad Hutto, D-Orangeburg, objects to the disruptions during the last day of the legislative session as they were dealing with the governors budget vetoes at the Statehouse in Columbia, S.C. Bright is fighting against an abortion ban because he disagrees with rape and incest exceptions. | ASSOCIATED PRESS reddit \nA Republican state senator in South Carolina is filibustering a ban on abortions after 20 weeks of pregnancy because he opposes the bill's exceptions for rape and incest victims. \nSouth Carolina State Sen. Lee Bright (R) started his filibuster on the Senate floor Thursday, postponing the vote on the abortion bill as well as another bill that would repair the state's roads. He argued before his colleagues that rape is not a good enough excuse to exempt women from the abortion ban. \n\"We're not talking about a woman that was assaulted that goes into the emergency room -- which, I would argue, that child still has a right,\" Bright said. \"We're talking about somebody that had 20 weeks.\" \nBright said he worried that women would falsely claim they were raped in order to qualify for the exemption. “After 20 weeks if you wanted to get an abortion you could go and say you were raped and you could have the abortion,\" he said. \"You wouldn’t be denied. There's no police report.\" \nSouth Carolina's House of Representatives passed a version of the same bill earlier this year, sponsored by State Rep. Wendy Nanney (R). That bill included exceptions for the life of the mother, but none for rape and incest victims or severe fetal anomalies. Senate Republicans tried to include the latter exceptions in amendments to their bill, before the whole thing was blocked by Bright. They believed it would make the bill more palatable to moderates. \n“I’m not comfortable with the exceptions,\" State Sen. Larry Grooms (R) told colleagues . \"But if we can’t save them all, let’s save what we can.\" \nThe U.S. Congress had similar drama over its version of the 20-week abortion ban earlier this year. Republican leaders in the House had scheduled a vote on the bill in January, but they had to cancel it after a group of Republican women rebelled against the bill over its narrow rape exception. The women, led by Rep. Renee Ellmers (R-N.C.), objected to the fact that rape victims had to file a police report in order to qualify for the exemption. House Republicans later tweaked the rape exception and passed the bill earlier this month . \nTen other states have already passed bans on abortion after 20 weeks of pregnancy, which is two to four weeks earlier than the fetus would be viable outside the womb. The Supreme Court ruled in Roe v. Wade that states cannot block women from having an abortion before viability, so the 20-week ban is likely to invite legal challenges. \nThe South Carolina Senate is scheduled to adjourn June 4, and Bright has threatened to continue his filibuster up to that date. \nBright held a press conference Tuesday morning with a group of women who were conceived from rape. He said he is willing to jeopardize his GOP colleagues' careers in order to block the bill from passing with rape and incest exceptions. \n\"If these babies aren't allowed to survive, these politicians shouldn't be allowed to survive their elections,\" he said. \nUPDATE : 6:05 p.m. -- Bright backed down late Tuesday afternoon, and the South Carolina Senate passed the 20-week abortion ban with rape and incest exceptions. The lawmaker said that anti-abortion activists believe the exceptions he objects to will be stripped from the bill's final version after the Senate conferences with the House. \n“This is on their backs now,” Bright told The State , a South Carolina newspaper. Also on HuffPost: ", "external_links": [], "published": "2015-05-20T05:45:00.000+03:00", "crawled": "2015-05-20T05:45:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}