{"organizations": ["Fox News Latino", "Republican"], "uuid": "c99a787e9ab8a65541427dec6de3fe141a15d198", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/health/0/0/jeb%20bush%20con%20bandera.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/11/jeb-bush-says-gop-voters-are-open-minded-on-immigration/", "country": "", "title": "Jeb Bush says Republican voters are open-minded on immigration | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Jeb Bush says Republican voters are open-minded on immigration | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T00:56:00.000+03:00", "replies_count": 0, "uuid": "c99a787e9ab8a65541427dec6de3fe141a15d198"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/11/jeb-bush-says-gop-voters-are-open-minded-on-immigration/", "ord_in_thread": 0, "title": "Jeb Bush says Republican voters are open-minded on immigration | Fox News Latino", "locations": ["New Hampshire"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush"], "text": "Jeb Bush says Republican voters are open-minded on immigration Published May 11, 2015 Fox News Latino Jeb Bush in the Nation Republican Leadership Summit in New Hampshire, on April 17, 2015. Getty \nFormer Florida Gov. Jeb Bush rejects the popular notion that his support for a path to legal status for some undocumented immigrants is a surefire way to doom his shot at being the GOP presidential nominee. \nIn an extensive interview with Fox News host Megyn Kelly that is scheduled to air Monday night, Bush – who has strongly suggested he is moving toward announcing a run for the White House, but has yet to do so – said he believes that undocumented immigrants brought to the country as minors should be able to legalize their status. \n“There’s got to be a point where we fix this system so that legal immigration is easier than illegal immigration,” Bush said in excerpts of the interview that were released earlier, “and show some respect for people — a kid that might have been here 10 years, that might be a valedictorian of their high school, to say, no, no, no, you’re not allowed to go to college, I just think, there’s a point passed which we’re over the line.” \nKelly noted that such stances on giving breaks to immigrants here illegally are the sort that give pause to people who otherwise generally like Bush. \n“This is another area … where folks say 'I like Jeb Bush, but how can he ever get through the GOP primary with this position on immigration?’” Kelly said. “You know that there’s a core wing of the party for whom this will be a deal breaker.” \nBush characterized that view as misguided. \n“I don’t know that,” he said, “I’ve been traveling over the last three months. I get a sense that a lot of people can be persuaded, to be honest with you.” \nThen, in what could have been a swipe at potential rivals in his party who have launched their presidential campaigns and have expressed mixed message on various aspects of immigration, Bush said he would not take a hard-line approach just to appease a certain segment of voters. \n“Here’s the deal, Megyn, if I go beyond the consideration of running to be an actual candidate,” Bush said, “Do you want people to just bend with the wind, to mirror people’s sentiment whoever is in front of you? ‘Oh, yes, I used to be for that but now, I’m for this.’ Is that the way we want to elect presidents?\" \nAbout foreign policy, Bush said that he too would have authorized the invasion on Iraq – as his brother George W. Bush did as president then – if he’d had the same information on the nation presented to him as was put forth then. \n“I would have, and so would have Hillary Clinton, just to remind everybody,” Bush said, “and so would have almost everybody that was confronted with the intelligence they got. \nKelly asked: “You don’t think it was a mistake?” \nBush said it was the intelligence reports about Iraq that was flawed. \n“In retrospect, the intelligence that everybody saw, that the world saw, not just the United States, was faulty,” Bush said. “ And in retrospect, once we invaded and took out Saddam Hussein, we didn’t focus on security first. And the Iraqis, in this incredibly insecure environment turned on the United States military because there was no security for themselves and their families.” \n“By the way, guess who thinks that those mistakes took place as well? George W. Bush,” Bush said. “So just for the news flash to the world, if they’re trying to find places where there’s big space between me and my brother, this might not be one of those.” \nThe interview will air on Fox News cable channel on Monday at 9 p.m. eastern time. \nLike us on Facebook ", "external_links": [], "published": "2015-05-12T00:56:00.000+03:00", "crawled": "2015-05-12T01:08:23.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}