{"organizations": ["Liberty University", "Religious Freedom Jeb Bush Attacks Obama Administration"], "uuid": "943cdb78f7a39ca4712d95c8b8205065915769dd", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2931896/images/o-JEB-BUSH-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/09/jeb-bush-religious-freedom_n_7247922.html", "country": "", "title": "Jeb Bush Attacks Obama Administration For Failing 'Easy Calls' On Religious Freedom", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Jeb Bush Attacks Obama Administration For Failing 'Easy Calls' On Religious Freedom", "spam_score": 0.0, "site_type": "news", "published": "2015-05-09T18:41:00.000+03:00", "replies_count": 0, "uuid": "943cdb78f7a39ca4712d95c8b8205065915769dd"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/09/jeb-bush-religious-freedom_n_7247922.html", "ord_in_thread": 0, "title": "Jeb Bush Attacks Obama Administration For Failing 'Easy Calls' On Religious Freedom", "locations": ["Lynchburg", "Virginia", "Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush", "Jeb Bush Attacks Obama", "Drew Angerer"], "text": "Jeb Bush Attacks Obama Administration For Failing 'Easy Calls' On Religious Freedom Posted: Updated: 28 minutes ago Potential Republican presidential hopeful and former Florida Gov. Jeb Bush waits onstage prior to delivering the commencement address at Liberty University on May 9, 2015, in Lynchburg, Virginia. | Drew Angerer via Getty Images reddit \nFormer Florida governor and likely GOP presidential candidate Jeb Bush offered a defense of Christian principles and attacked the Obama administration for failing to preserve religious freedom during his commencement address at Liberty University, a Christian school in Lynchburg, Virginia. \nBush accused the Obama administration of using \"coercive federal power\" to infringe on the religious rights of Americans. \n\"What should be easy calls, in favor of religious freedom, have instead become an aggressive stance against it. Somebody here is being small-minded and intolerant, and it sure isn’t the nuns, ministers, and laymen and women who ask only to live and practice their faith,\" he said, according to remarks released ahead of the speech. \"Federal authorities are demanding obedience, in complete disregard of religious conscience -- and in a free society, the answer is 'no.'” \nLast year, the Supreme Court ruled 5-4 that the Obama administration could not require closely held corporations to provide contraception to employees if the employers objected on religious grounds. \nBush converted to Catholicism -- his wife's religion -- two decades ago following a tense period in his marriage. Bush has said in the past that he believes the faith of leaders should shape their decision-making. \n\"[S]ome moral standards are universal. They do not bend under the weight of cultural differences or elite opinion. Wherever there is a child waiting to be born, we say choose life, and we say it with love,\" Bush said on Saturday. \"Wherever women and girls in other countries are brutally exploited, or treated as possessions without rights and dignity, we Christians see that arrogance for what it is. Wherever Jews are subjected to the oldest bigotry, we reject that sin against our brothers and sisters, and we defend them.\" \nLiberty University was founded by Jerry Falwell, a former Southern Baptist pastor and religious commentator. Sen. Ted Cruz (R-Texas) announced his presidential campaign at the school in March. Also on HuffPost:   Former Florida Gov. Jeb Bush waves while being introduced before speaking at the National Automobile Dealers Association convention in San Francisco, Friday, Jan. 23, 2015. (AP Photo/Jeff Chiu) Former Florida Gov. Jeb Bush pauses for a photo as he greets people in the audience after speaking during the Conservative Political Action Conference (CPAC) in National Harbor, Md., Friday, Feb. 27, 2015. (AP Photo/Carolyn Kaster) Former Florida Governor Jeb Bush takes a selfie with an Iowa resident after speaking at a Pizza Ranch restaurant on March 7, 2015 in Cedar Rapids, Iowa. (Photo by Scott Olson/Getty Images) Former Florida Governor Jeb Bush speaks to reporters after an event at a Pizza Ranch restaurant on March 7, 2015 in Cedar Rapids, Iowa. (Photo by Scott Olson/Getty Images) Former Florida Gov. Jeb Bush and his son, Texas Land Commissioner George P. Bush, sit on a campaign bus during an interview Tuesday, Oct. 14, 2014, in Abilene, Texas. (AP Photo/LM Otero) Former Florida Gov. Jeb Bush gestures during an education forum in Nashville, Tenn., on Wednesday, March 19, 2014 with U.S. Sen. Lamar Alexander (R-Tenn). (AP Photos/Erik Schelzig) Victoria Sheard of Dallas receives a kiss on the cheek from former governor Jeb Bush during a book autograph session after a speaking engagement at the Dallas Council of World Affairs Wednesday, April 24, 2013. (AP Photo/Tony Gutierrez) Former Florida Governor Jeb Bush attends a luncheon hosted by the Chicago Council on Global Affairs on February 18, 2015 in Chicago, Illinois. (Photo by Scott Olson/Getty Images) 2012 Republican presidential candidate and former Massachusetts Gov. Mitt Romney is seated with former Florida Gov. Jeb Bush as they fly on Romney's campaign plane to Miami, Florida, on Wednesday, Oct. 31, 2012. (AP Photo/Charles Dharapak) Former Florida Gov. Jeb Bush reacts in front of golfer Phil Mickelson after making a putt in The Barclays Pro-Am golf tournament at Bethpage State Park in Farmingdale, N.Y., Wednesday, Aug. 22, 2012. (AP Photos/Henny Ray Abrams) President Barack Obama is introduced by former Florida Gov. Jeb Bush before speaking at Miami Central Senior High School in Miami, Friday, March 4, 2011. Education Secretary Arne Duncan is at center. (AP Photo/Pablo Martinez Monsivais) Former first lady Barbara Bush greets her son, former Florida Gov. Jeb Bush, with a kiss as she arrives a the 2010 Presidential Medal of Freedom ceremony, Tuesday, Feb. 15, 2011, in the East Room of the White House in Washington. (AP Photo/Carolyn Kaster) President George H. W. Bush -- with his son, former Florida Gov. Jeb Bush -- enters the West Wing of the White House to meet with President Barack Obama on Saturday, Jan. 30, 2010, in Washington. (AP Photo/Alex Brandon) Governor Rick Scott (left) greets supporters as Jeb Bush embraces Rep. Mario Diaz-Balart (R-Fla.). (Carl Juste/Miami Herald/TNS via Getty Images) Then-President George W. Bush jokes with his brother, then-Florida Gov. Jeb Bush, on Monday, Nov. 6, 2006, in Pensacola, Fla., where Bush was drumming up support for local Republican candidates. (AP Photo/Mari Darr~Welch) Former President George H.W. Bush, then-President George W. Bush and then-Florida Gov. Jeb Bush pose in front of the aircraft carrier George H.W. Bush after participating in the christening ceremony in Newport News, Va., Saturday, Oct.. 7, 2006. (AP Photo/Lawrence Jackson)  Share ", "external_links": [], "published": "2015-05-09T18:41:00.000+03:00", "crawled": "2015-05-09T18:43:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}