{"organizations": [], "uuid": "a84f64053886065d1ef9acc6c5a71a8ce9ce5029", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/052115_an_mckelway_640.jpg", "site_section": "http://feeds.feedburner.com/foxnews/latest\r", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/05/21/us-sending-1000-rockets-to-boost-iraqi-forces-in-isis-fight/?intcmp=latestnews", "country": "US", "title": "As key cities fall to ISIS, Obama under pressure to overhaul strategy", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "As key cities fall to ISIS, Obama under pressure to overhaul strategy", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T23:27:00.000+03:00", "replies_count": 0, "uuid": "a84f64053886065d1ef9acc6c5a71a8ce9ce5029"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/politics/2015/05/21/us-sending-1000-rockets-to-boost-iraqi-forces-in-isis-fight/?intcmp=latestnews", "ord_in_thread": 0, "title": "As key cities fall to ISIS, Obama under pressure to overhaul strategy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama urged to ‘scrap’ parts of anti-ISIS playbook as Iraqi, Syrian cities fall Published May 21, 2015 Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama came under increasing pressure Thursday to overhaul his military strategy for combating the Islamic State in the wake of recent gains by the terror group in both Iraq and Syria, as the president and his top military official suggested the Iraqis themselves are going to have to do more. \nThe White House has said no formal strategy review is under way, after ISIS fighters seized Ramadi over the weekend. Since then, ISIS fighters seized the ancient Syrian site of Palmyra as well. While U.S. engagement in Syria is far less robust than in Iraq, the developments in both countries show ISIS expanding its territory and power. \nWhite House Press Secretary Josh Earnest acknowledged Thursday that Ramadi and Palmyra both count as a \"setback.\" While he stressed the president won't support a large-scale military deployment, congressional critics still want to see a major change in strategy. \n\"To win this fight, the president is going to have to scrap his policies that aren't working, lay out a broad overarching strategy to defeat these savage terrorists,\" House Speaker John Boehner said Thursday. \nBoehner suggested this could include more engagement with Islamic leaders to address radicalization, more engagement with U.S. allies in the region overall, a better anti-ISIS strategy on social media and an end to \"artificial constraints on our commanders.\" \nHe did not elaborate, but others have. \nMichael O'Hanlon, senior fellow at the Brookings Institution, wrote in USA Today that the U.S. needs to \"make adjustments,\" including by allowing more American boots on the ground in Iraq -- and the presence of some special forces in Syria. \n\"At the military level, we need to put Americans in more forward locations on the battlefield. They should be in position to call in airstrikes and perhaps even help Iraqis with some raids .... A few thousand more G.I.s may be required to do so, beyond the 3,000 already now in [Iraq],\" he wrote. \nSyria, he continued, is \"worse than ever.\" He called for accelerating the train-and-equip program for Syrian opposition fighters, while also deploying \"limited numbers\" of special forces from the U.S. and its allies. \nThe current U.S. strategy for Iraq consists of coalition airstrikes, assistance to local forces fighting ISIS on the ground and outreach to the Iraqi government to prod them to be more \"inclusive.\" Syria is far more complicated than Iraq, as the Obama administration is not working alongside the central Assad government. \nAdministration officials have so far pushed back on calls for a comprehensive review. State Department spokeswoman Marie Harf said Thursday that \"we have a strategy which we believe is the right one.\" \nThe administration, meanwhile, is putting renewed pressure on the Iraqis. \nGen. Martin Dempsey, chairman of the Joint Chiefs of Staff, attributed the Ramadi takeover not to ISIS' fighting prowess, but an Iraqi commander's decision to retreat. \n\"The [Iraqi Security Force] was not driven out of Ramadi; they drove out of Ramadi,\" he told The Wall Street Journal . (A Pentagon spokesman later said they believe Iraqi forces thought because of the weather, they would not receive air support, and that contributed to their decision to leave.) \nIn an interview with The Atlantic , Obama also said the situation in Ramadi shows how the training of Iraqi forces is not happening quickly enough in the Sunni parts of the country, like Anbar Province, where Ramadi is located. He suggested training would have to accelerate, while putting some onus on Sunni tribes. \n\"There's no doubt that in the Sunni areas, we're going to have to ramp up not just training, but also commitment, and we better get Sunni tribes more activated than they currently have been,\" Obama said. \nObama, echoing top officials in his administration, called the Ramadi defeat a \"tactical setback\" but said, \"I don't think we're losing.\" \nThe Wall Street Journal also reported that, while the administration could boost training and supplies for Sunni tribes, Iraqi officials would be expected to entice those fighters to join with the Shiite-led government. Dempsey told the Journal the key is not just military success, but Baghdad's ability to \"draw the various groups back together.\" \nAmid the deliberations, the U.S. is \"expediting\" the shipment of 2,000 AT-4 anti-tank rockets to Iraq as early as next week, Pentagon spokesman Col. Steve Warren said. \nWarren said the rockets would not be going directly to Sunni tribes. \"As is the case with all of our deliveries, they are going to the government of Iraq.\" \nWarren could not say if the shoulder-fired rockets would ultimately wind up in Anbar to help the Sunni tribes repel ISIS. \nThe State Department had earlier confirmed the sped-up shipments. While it's unclear exactly where they will end up, the rockets are intended to help combat the kinds of suicide-truck bombs ISIS used to great effect in Ramadi. A senior State Department official said that in Ramadi, the fighters used armored vehicles that were \"totally impervious to a lot of weapons.\" Those vehicles were used to blow up buildings and helped ISIS take the city. \nIraqi Prime Minister Haider al-Abadi earlier requested the rockets on his visit to Washington. \nThe senior State Department official acknowledged this was one of his \"main demands.\" \nFox News' Lucas Tomlinson contributed to this report. Advertisement", "external_links": [], "published": "2015-05-21T23:27:00.000+03:00", "crawled": "2015-05-21T23:59:42.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}