{"organizations": [], "uuid": "194aad475feef2904ef6ddc0939ad970153cb802", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/obamabarack_051915getty.jpg", "site_section": "http://thehill.com/taxonomy/term/1132/feed", "section_title": "The Hill - Administration", "url": "http://thehill.com/homenews/administration/242617-obama-faces-high-stakes-on-trade-bill", "country": "US", "title": "Obama faces high stakes on trade bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama faces high stakes on trade bill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T13:00:00.000+03:00", "replies_count": 0, "uuid": "194aad475feef2904ef6ddc0939ad970153cb802"}, "author": "bstreeter@thehill.com (Jordan Fabian)", "url": "http://thehill.com/homenews/administration/242617-obama-faces-high-stakes-on-trade-bill", "ord_in_thread": 0, "title": "Obama faces high stakes on trade bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama faces high stakes on trade bill By Jordan Fabian - 05/20/15 06:00 AM EDT \nPresident Obama faces enormously high stakes in the fight over trade. \nHe has made a sweeping trade deal with 12 Pacific Rim nations the centerpiece of his second-term economic agenda, even though it faces staunch opposition from his liberal base. ADVERTISEMENT If Congress blocks Obama’s push, it will be a significant setback for the White House, which will raise questions about whether Obama is a lame duck with more than a year left in his presidency.\nBut if he succeeds, he’ll be able to tout a bipartisan accomplishment that will add to his legacy. \n“The president has wanted this for years,” a White House official said. “The window is now upon us that we can get it done.” \nThe Trans-Pacific Partnership (TPP) is the biggest international trade deal since the North American Free Trade Agreement. The countries involved, which include Canada, Mexico, Australia and Japan, represent almost 40 percent of global gross domestic product. \nObama has pushed to finalize the TPP as part of his so-called pivot to Asia, which would allow the U.S. to exert economic and military influence to counter a rising China. \nTo finish the thorny negotiations, Obama needs Congress to grant him trade promotion authority, known as fast-track, which would give him the power to put a trade agreement before lawmakers for an up-or-down vote, without amendments that could kill the deal. \nTrading partners are only likely to make final concessions in the negotiations if they are certain the deal will be approved by Congress, something fast-track’s passage would make much more likely. \nObama is pressing the Senate to pass fast-track by the end of this week, which would help build momentum for a tougher vote in the House. \nHe’s been drawn into a confrontation with liberal star Sen. Elizabeth Warren (D-Mass.) and other Democrats who have derided new trade deals as job-killers and have questioned the president’s progressive bona fides for pursuing them. \nObama has upped the ante by taking on Warren, who he argues is wrong to oppose fast-track. He’s accused her of behaving like a common politician, and his attacks on her have drawn accusations of sexism from Sen. Sherrod Brown (D-Ohio) and the president of the National Organization for Women. \nThe fight with Warren risks Obama’s reputation as a progressive icon, said Julian Zelizer, professor of public affairs at Princeton University. \n“I do think it clearly has exacerbated the tensions with liberal Democrats who have had a lot of problems with the president and have felt on core economics issues, that he is more a 1990s Clintonite than he is a New Dealer, Great Society liberal,” Zelizer said. “I think it will be part of the long-term conversation about the base of his party.” \nThe White House disputes the notion Obama is bucking his base on trade. Aides point to a recent NBC News/ Wall Street Journal poll showing 43 percent of Democrats support free trade, up from 27 percent five years ago. The survey showed big increases with African-Americans and Latinos, two core Obama constituencies. \nThe White House badly wants the trade deal, which it says would bring billions of dollars in economic benefits while going further than past trade pacts to enforce labor and environmental standards in overseas markets. \n“This is probably the last big gasp of his presidency on economics,” Zelizer said. “I think it’s one that could have real long-term effects on what people think about what he did.” \nObama in November said the TPP would be a “historic achievement,” and he has placed the pact alongside his major domestic accomplishments: healthcare reform, Wall Street reform and the auto bailouts. He has bristled at critics, including Warren and labor unions, who have said the trade deal would hurt U.S. workers. \nDemocrats say it’s evident how big of a priority trade is for the Obama White House due to its aggressive outreach effort to lawmakers, an area critics say the president has not taken seriously in the past. The White House has enlisting Cabinet members, Vice President Biden and the president himself to personally sway undecided lawmakers. \n“If they have made missteps in the past with their outreach to the Hill, they have learned their lessons. They have covered all their bases this time around,” said Jim Manley, a Democratic strategist. \nWhite House officials say passage of fast-track is unlikely to lead to a breakthrough with Republicans on other issues, such as tax reform. \nAnd they also argue its failure won’t usher in the Obama lame-duck era. \nThey point to Obama’s executive power, which they expect will notch legacy-boosting achievements through the end of his second term, such as finalizing an Iran nuclear deal, normalizing relations with Cuba and reaching a major international climate agreement. \n“Regardless of outcome, we have a different approach,” the White House official said.", "external_links": [], "published": "2015-05-20T13:00:00.000+03:00", "crawled": "2015-05-20T14:21:30.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}