{"organizations": ["Fox News Latino Democratic"], "uuid": "4a685dd3e6b2c074cf5ec198cb5bed09387a4544", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Clinton%20immigration%20Vegas%20Latino.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/11/activists-use-clinton-immigration-stance-to-pressure-obama/", "country": "", "title": "Activists use Hillary Clinton's immigration stance to pressure President Obama | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Activists use Hillary Clinton's immigration stance to pressure President Obama | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "4a685dd3e6b2c074cf5ec198cb5bed09387a4544"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/11/activists-use-clinton-immigration-stance-to-pressure-obama/", "ord_in_thread": 0, "title": "Activists use Hillary Clinton's immigration stance to pressure President Obama | Fox News Latino", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Hillary Rodham Clinton", "Obama"], "text": "Activists use Hillary Clinton's immigration stance to pressure President Obama Published May 11, 2015 Fox News Latino Democratic presidential candidate Hillary Rodham Clinton in Washington, on April 22, 2015. ap \nWASHINGTON – Hillary Clinton said last week that if elected president, she would expand on the executive actions President Obama took last fall to grant legal work permits to millions of immigrants in this country illegally. \nImmigration activists were paying attention and are now trying to use her stance on immigration to pressure Obama to do more. \nThe White House insists that Obama went as far as he legally could. But Clinton said she would do more than her fellow Democrat, including extending deportation protections to the parents of so-called \"Dreamers\" — immigrants brought illegally to this country as youths. \nActivists with a group called NotOneMoreDeportation.com said Monday they are sending a letter to the White House urging Obama to follow Clinton's lead. \n\"President Obama could make the changes to the immigration enforcement system outlined by Clinton, now,\" said the letter provided to The Associated Press. \"If Hillary Clinton and the Democratic Party believe in these changes as more than talking points, they should move for President Obama to enact them immediately with the urging and vocal support of his party.\" \nImmigration is emerging as an important issue in the presidential campaign, with Clinton using it to differentiate herself from her Republican opponents, who oppose the unilateral steps Obama took. \nBut Clinton's comments also opened a split with the current president of her own party, one that immigration activists hope to use to their advantage. \nWhite House press secretary Josh Earnest, when asked about Clinton's comments, said that Obama had already gone as far as he could. \n\"The president was determined to use as much of his authority as he could to try to bring some much needed accountability to our broken immigration system. And that was reflected in the announcement that he made,\" Earnest said. \nThe activists' letter also pointed to comments Clinton made questioning conditions in immigrant detention centers, and urged Obama to end detentions of vulnerable populations including pregnant women and transgender people. \nBased on reporting by the Associated Press. \nLike us on Facebook ", "external_links": [], "published": "2015-05-12T03:00:00.000+03:00", "crawled": "2015-05-12T17:41:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}