{"organizations": ["Iran | Fox News Obama", "Facebook", "Twitter"], "uuid": "f70ffae1b66df5e89e501395786ac842ff56cd8f", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051415_an_corke_640.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/05/14/obama-pledges-unity-with-gulf-nations-against-iran/", "country": "", "title": "Obama pledges unity with Gulf nations against Iran | Fox News", "performance_score": 4, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama pledges unity with Gulf nations against Iran | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T02:15:00.000+03:00", "replies_count": 0, "uuid": "f70ffae1b66df5e89e501395786ac842ff56cd8f"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/14/obama-pledges-unity-with-gulf-nations-against-iran/", "ord_in_thread": 0, "title": "Obama pledges unity with Gulf nations against Iran | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama pledges unity with Gulf nations against Iran Published May 14, 2015 Facebook 0 Twitter 0 Email Print \nPresident Obama announced what he called enhanced and expanded security activities with Gulf state Arab partners on Thursday, calling it a \"new era of cooperation\" with these nations, including a fast-track for arms and missile defense systems and expanded joint military training. \nIn a press conference with reporters at Camp David after his meeting with the Gulf State Cooperation Council, which included representatives from Saudi Arabia, Qatar, United Arab Emirates, Kuwait, Oman and Bahrain, Obama sought to placate some of their fears about whether the U.S. is committed to helping protect their security, including the potential use of military force, in a time of \"extraordinary changes and some great challenges.\" \nHe offered assurances that an international nuclear agreement with Iran would not leave the nations of the Gulf Cooperation Council more vulnerable. \n\"I was very explicit ... that the United States will stand by our GCC partners against external attack,\" Obama pledged at the conclusion of a summit with leaders of the six-nation council. \nHe expressed his hope that their cooperation would help achieve \"the kind of peace and good neighborliness with Iran that I think so many of the countries here seek.\" \nObama and the Arab leaders met in a rare summit at Camp David, the presidential retreat in Maryland's Catoctin mountains. \nThe leaders issued a joint statement saying that in the event of aggression, the U.S. stood ready to work with the Arab nations \"to determine urgently what action may be appropriate, using the means at our collective disposal, including the potential use of military force, for the defense of our GCC partners.\" \nThe Associated Press contributed to this report. Advertisement ", "external_links": [], "published": "2015-05-15T02:15:00.000+03:00", "crawled": "2015-05-15T02:17:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}