{"organizations": ["JCS Leadership Position"], "uuid": "b0a5a6d13a6a459dfdd40344a12ed42bc15c8907", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/feeds/Military.com/2015/05/0/0/05ObamaNominatesFirstAirmanforJCSLeadershipPositionin10Years77775.jpg", "site_section": "http://www.newslookup.com/rss/us/top/tv/foxnews-main-head.rss", "section_title": "Foxnews", "url": "http://www.foxnews.com/us/2015/05/05/obama-nominates-first-airman-for-jcs-leadership-position-in-10-years/", "country": "US", "title": "Obama Nominates First Airman for JCS Leadership Position in 10 Years", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama Nominates First Airman for JCS Leadership Position in 10 Years", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T23:55:00.000+03:00", "replies_count": 0, "uuid": "b0a5a6d13a6a459dfdd40344a12ed42bc15c8907"}, "author": "", "url": "http://www.foxnews.com/us/2015/05/05/obama-nominates-first-airman-for-jcs-leadership-position-in-10-years/", "ord_in_thread": 0, "title": "Obama Nominates First Airman for JCS Leadership Position in 10 Years", "locations": ["Military.com"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama Nominates First Airman for JCS Leadership Position in 10 Years   Email Print (Military.com) \nPresident Obama's nomination of Air Force Gen. Paul Selva as vice chairman marks the first time in ten years an airman has been nominated to one of the leadership positions of the Joint Chiefs of Staff. \nGen. Richard Myers took over as the chairman of the Joint Chiefs of Staff a month after the 9/11 attacks where he helped oversee the invasions of Iraq and Afghanistan as President George W. Bush's top military advisor. He retired from the service in 2005. \nSince then an Air Force general has not been nominated as a chairman or vice chairman of the Joint Chiefs of Staff in a decade leading many Air Force leaders and defense analysts to question why not. \nMany have pointed to the lack of Air Force generals selected to lead combatant commands. Others have said the U.S. spent the past ten years fighting predominantly land wars in Iraq and Afghanistan. However, that argument would not explain the two admirals selected as vice chairman and the Adm. Michael Mullen's selection as chairman of the Joint Chiefs of Staff over the same period. \nSelva stands out even in his own service, which has historically pushed fighter and bomber pilots for top internal and joint leadership positions. Selva, an Air Force Academy graduate, is a career C-17 pilot who currently serves as the commander of U.S. Transportation Command. \nThe last Air Force general rumored to be a contender for a Joint Chiefs of Staff leadership position was Gen. Norton Schwartz, who was also a career cargo pilot and former head of TRANSCOM. He appeared to be a favorite in 2010 for the vice chairman position during his second year as the Air Force chief of staff. \nSelva's selection raised eyebrows inside political circles with the upcoming presidential election. As the assistant to the chairman of the Joint Chiefs of Staff, he served as then-Secretary of State Hillary Clinton's senior military advisor from 2008 to 2011. \nPresident Obama noted Selva's connection Clinton during his announcement of the nominations Tuesday at the White House Rose Garden. \n\"Paul also served as Secretary of State Clinton's military advisor for the first years of my presidency, so he grasps the strategic environment in which our forces operate.\" Obama said. \"He understands that our military, as powerful as it is, is one tool that must be used in concert with all the elements of our national power. \" \nThe President also highlighted Selva's time as the head of Air Mobility Command, which he led from 2012 to 2014. \n\"As leader of Air Mobility Command, he earned a reputation as a force for change and innovation. I understand that when it was time to deliver the final C-17 to the Air Force, Paul went to the cockpit and helped fly it himself,\" Obama said. \nSelva also has experience in a top command position in the Pacific – an area the Obama administration and the Pentagon have made a priority as the services direct more resources to the region. Selva served as the deputy command of Pacific Air Forces from 2011 to 2012. \nSen. John McCain, chairman of the Senate Armed Services Committee, signaled his support for Selva's nomination in statement released Tuesday. McCain will oversee the nomination hearings that Selva and Gen. Joseph Dunford, Obama's nominee as chairman of the Joint Chiefs of Staff, must pass. \n\"General Selva's extensive experience as an operational and strategic leader would be a welcome addition to the Joint Chiefs of Staff,\" McCain said. \n-- Michael Hoffman can be reached at mike.hoffman@military.com Advertisement", "external_links": [], "published": "2015-05-05T23:55:00.000+03:00", "crawled": "2015-05-06T00:25:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}