{"organizations": [], "uuid": "d593f4afd3bef1474c0927ee3f808b1e1d22d9b6", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/thehill_logo_200.jpg", "site_section": "http://thehill.com/taxonomy/term/28/feed", "section_title": "The Hill: Energy and Environment Policy", "url": "http://thehill.com/policy/energy-environment/242381-obama-pushes-to-give-states-bigger-role-in-species-protection", "country": "US", "title": "Obama pushes to give states bigger role in species protection", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama pushes to give states bigger role in species protection", "spam_score": 0.0, "site_type": "news", "published": "2015-05-18T19:15:00.000+03:00", "replies_count": 0, "uuid": "d593f4afd3bef1474c0927ee3f808b1e1d22d9b6"}, "author": "dhenry@thehill.com (Devin Henry)", "url": "http://thehill.com/policy/energy-environment/242381-obama-pushes-to-give-states-bigger-role-in-species-protection", "ord_in_thread": 0, "title": "Obama pushes to give states bigger role in species protection", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama pushes to give states bigger role in species protection By Devin Henry - 05/18/15 12:15 PM EDT \nThe Obama administration began rolling out a list of potential changes to the Engendered Species Act (ESA) on Monday, the first step in what it says will be a yearlong effort to overhaul a law that has gained the ire of congressional Republicans. \nThe Fish and Wildlife Service and the National Marine Fisheries Service announced Monday that it will soon require anyone looking for the ESA to cover a species to first solicit information from states’ wildlife agencies before sending their petition to the federal government. ADVERTISEMENT Officials said the move is designed to give states a bigger role in listing decisions under the law. \n“Consistent with the intent of the ESA that listing decisions be based on the best available science, we appreciate the Service's due recognition of, and requirement to, incorporate the data and information of state fish and wildlife agencies for the formulation of listing petitions,\" Association of Fish and Wildlife Agencies President Larry Voyles said in an Interior Department statement. \nThe proposed rule change comes amid a fight between the Obama administration and Western states over the endangered status of a handful of animals. On Friday, Colorado Gov. John Hickenlooper announced a state plan to protect the habitat of the greater sage grouse, a move designed the keep the federal government from listing the species under the ESA and stepping up regulations accordingly. \nRepublican lawmakers have taken aim at the law, viewing it as a hindrance to landowners and users affected by the listings of species on their land. Sen. Jim Inhofe (R-Okla.) and Rep. Rob Bishop (R-Utah), the chairs of the committees that oversee the Fish and Wildlife Service, have begun looking for ways to reform the law this session. \nBut Obama administration officials said Monday that they are planning an array of changes to the law on their own. The proposals, which will be rolled out over the next year, will look to provide more transparency in the listing process, encourage voluntary habitat conservation programs, focus departments’ resources and further engage the states. \n“The proposed policies would result in a more nimble, transparent and ultimately more effective Endangered Species Act,” Fish and Wildlife Service Director Dan Ashe said in a statement. Tags:", "external_links": [], "published": "2015-05-18T19:15:00.000+03:00", "crawled": "2015-05-18T20:45:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}