{"organizations": [], "uuid": "e3fc17fe20edacedade4813b1363407c6a2378f0", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/sotloffsteven_090214getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/243334-obama-meets-with-family-of-beheaded-journalist", "country": "US", "title": "Obama meets with family of beheaded journalist", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama meets with family of beheaded journalist", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T20:53:00.000+03:00", "replies_count": 0, "uuid": "e3fc17fe20edacedade4813b1363407c6a2378f0"}, "author": "Ben Kamisar", "url": "http://thehill.com/homenews/administration/243334-obama-meets-with-family-of-beheaded-journalist", "ord_in_thread": 0, "title": "Obama meets with family of beheaded journalist", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama meets with family of beheaded journalist Getty Images By Ben Kamisar - 05/28/15 01:53 PM EDT President Obama met with the family of Steven Sotloff, an American journalist whose beheading in September by the Islamic State in Iraq and Syria helped catalyze Obama’s efforts to fight the militant group. \nThe president met with the family during a trip to Miami, where he toured the National Hurricane Center and attended fundraising events. “The President expressed his and the First Lady’s condolences for Steven’s death,” Bernadette Meehan, Obama’s National Security Council spokeswoman, said in a statement. “He appreciated the chance to hear from the Sotloffs more about Steven’s work as a journalist, including his passion for bringing the stories of people who are suffering to the rest of the world in the hope of making a positive difference, including in Syria.” Islamic militants captured Sotloff in 2013 while he was on assignment in Syria. ISIS released its first beheading video depicting the killing of fellow journalist James Foley in August 2014 and threatened to kill Sotloff next. Sotloff’s death prompted criticism from his family about the administration’s efforts to save him. Barak Barfi, a family spokesman, told “CBS This Morning” that the National Security Council “bullied and hectored” the family. \"We never really believed that the administration was doing anything to help us,\" he said soon after Sotloff’s death. \"We had very limited contact with senior officials.\" The White House denied those assertions and said it is looking at ways to strengthen communication with families of U.S. hostages.", "external_links": [], "published": "2015-05-28T20:53:00.000+03:00", "crawled": "2015-05-28T22:43:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}