{"organizations": [], "uuid": "5cb5dcb2af0f9e67b3d3becb696446b3c3bec915", "thread": {"site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/opinion/index.html", "section_title": "Opinion &amp; Analysis on the Latest Breaking News | Fox News", "url": "http://www.foxnews.com/opinion/2015/05/21/internets-future-why-does-team-obama-want-to-give-control-web-to-global-multi-stakeholder-community.html", "country": "US", "title": "Internet's future: Why does Team Obama want to give control of Web to global multi-stakeholder community?", "performance_score": 0, "site": "foxnews.com", "participants_count": 7, "title_full": "Internet's future: Why does Team Obama want to give control of Web to global multi-stakeholder community? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T03:00:00.000+03:00", "replies_count": 6, "uuid": "2335b5278d06882b2ce6a66e2d82aa2f47ff8045"}, "author": "Christian Whiton", "url": "http://www.foxnews.com/opinion/2015/05/21/internets-future-why-does-team-obama-want-to-give-control-web-to-global-multi-stakeholder-community.html#post-0", "ord_in_thread": 0, "title": "Internet's future: Why does Team Obama want to give control of Web to global multi-stakeholder community?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Christian Whiton\nPublished May 21, 2015 Facebook Later this year, our own government plans to give away control of the Internet to “the global multi-stakeholder community.” It would be hard to conceive of a plan more pointless and potentially harmful.\nAt issue is ultimate U.S. government control of a key part of the Internet: its directory. Your ability to reach your bank when you enter its URL, for example, ultimately depends on an assigned web address that is unique and registered.\nThe arrangement is similar to a phone number. A single directory is ultimately how calls reach their intended recipients. Imagine if you dialed 911 and, instead of getting emergency dispatch, were connected to the local florist. Or imagine if your call went nowhere at all. That is the type of mischief that this pointless give-away could cause.\nThis registry function has been managed by Internet Corporation for Assigned Names and Numbers (ICANN) under a contract from the U.S. Department of Commerce. The arrangement has worked well, and the Internet has grown to become crucial to everyday life and commerce. The United States invented the Internet, but has ensured it can be used by all—even by our adversaries.\nWould others be so magnanimous? The “global stakeholders” to whom the Obama administration would like to give the Internet are ill-defined. Even if they begin as a group of learned and just technicians, you can bet that the world’s bad guys will work hard to get control.\nThere is some speculation that control will ultimately end up at the International Telecommunication Union—a part of the United Nations. The U.N., of course, is the place where such paragons of freedom as China, Cuba, and Russia get to sit on the Human Rights Council. It is also the global center of efforts to constrain free speech—most often under the guise of banning “defamation of religion.”\nIs your website critical of radical Islam? Does it support Israel or our other secular allies in the Middle East? What if such “hate speech” is unacceptable to future domain registrars, especially if they are not subject to our First Amendment?\nWhat if the new managers moved registry functions to Geneva or another foreign city, where we have little ability to influence their security or repair? Surely China, Russia, or Iran would relish the idea of disabling the internet in a tiff or conflict with the United States.\nThese outcomes aren’t likely but they aren’t impossible or unimaginable either. So why take the risk? Congress needs to step in before the Commerce Department’s contract with ICANN expires this fall. The House of Representatives held a hearing on the issue this month, but even the supposedly conservative witnesses offered milquetoast advice that amounts only to a delay of the give-away.\nAt a minimum, Congress needs to write a ban of any transfer into the Commerce Department’s budget law. Better yet would be switching oversight to one of the Department of Energy’s national labs , which have more acumen for national security and technology, and are also developing cyber defense skills.\nMeanwhile, this is another teachable moment about our feckless defenders in Washington. Why was it ever acceptable even to contemplate this give-away? Sure, there are foreign and domestic mavens of technology and governance who think it terribly uncouth that the Americans still ultimately control the Internet. But rather than striving to make the world safe for cocktail parties of “global stakeholders,” our representatives ought to spend more time looking out for our own interests.\nChristian Whiton is the president of the Hamilton Foundation . He was a State Department senior advisor in the George W. Bush administration and a policy advisor on the Giuliani and Gingrich presidential campaigns. He is author of \" Smart Power: Between Diplomacy and War \" (Potomac Books 2013).\n'Deeply Embarrassed' Researchers Admit MASSIVE Fraud in Gay Marriage Study May 21, 2015\nSuspect\nAdvertisement", "external_links": [], "published": "2015-05-21T03:00:00.000+03:00", "crawled": "2015-05-22T13:42:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}