{"organizations": [], "uuid": "c5601cd782688e1ea481e5544ccb8fc4ffc93223", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/gavel1.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/12/more-than-100-lawmakers-urge-court-to-rule-against-obama-immigration-order/", "country": "", "title": "More than 100 lawmakers urge court to rule against Obama's immigration order | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "More than 100 lawmakers urge court to rule against Obama's immigration order | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "c5601cd782688e1ea481e5544ccb8fc4ffc93223"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/12/more-than-100-lawmakers-urge-court-to-rule-against-obama-immigration-order/", "ord_in_thread": 0, "title": "More than 100 lawmakers urge court to rule against Obama's immigration order | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "More than 100 lawmakers urge court to rule against Obama's immigration order Published May 12, 2015 Fox News Latino Getty Images \nMore than 100 Republican lawmakers, including presidential candidates Sen. Ted Cruz and Sen. Marco Rubio, are urging a federal appeals court to stop President Barack Obama’s executive action on immigration. \nThe lawmakers argue that the president’s action, which would suspend deportation for three years for up to about 5 million undocumented immigrants because, is an overreach and unconstitutional. \nThey expressed their objections to the executive action through an amicus brief filed at the 5th Circuit Court of Appeals, in New Orleans, on Monday. The brief supports a Texas-led lawsuit – which now includes 26 states – before the court that says that Obama’s executive action goes against the balance of power and oversteps the boundaries of the president’s authority. \n“Congress has created a comprehensive immigration scheme, which expresses its desired policy as to classes of immigrants, but the class identified by the [Homeland Security Department] directive for categorical relief is unsupported by this scheme,” says the amicus brief, according to The Hill. “Instead of setting enforcement priorities, it created a class-based program that establishes eligibility requirements that, if met, grant unlawful immigrants a renewable lawful presence in the United States and substantive benefits.” \nObama’s executive action suspends deportation for undocumented immigrants brought to the United States as minors, as well as to those who are parents of U.S. citizens or legal permanent residents. The action, by extension, also allows those who receive the protection from deportation to obtain work permits and various federal benefits. \nMany critics of the executive action, which has been blocked from implementation pending a final decision, say the move is tantamount to rewarding lawbreakers. \n\"[T]he President has unlawfully granted amnesty to millions who came here illegally,\" Cruz, of Texas, said Monday in a statement. \nThe White House has countered such criticism by saying that plenty of people have filed amicus briefs that support Obama’s executive action, The Hill said. \n\"Though these individuals and groups come from different backgrounds and perspectives, they’re all in agreement that [the] President’s actions are good for public safety and good for the economy,\" The Hill quoted an administration official as saying in an e-mail. \nThe president’s action includes the Deferred Action for Parental Accountability (DAPA) program, which extends protection from deportation to the parents of U.S. citizens and permanent legal residents, and the Deferred Action for Childhood Arrivals (DACA) initiative, which protects people who are here illegally after having been brought to the United States as children. \nThe states that are part of the lawsuit say that the president’s order puts heavy burdens on them. U.S. District Judge Andrew S. Hanen, of Brownsville, Texas, in February ruled that there was enough basis to the states’ concerns to allow the case to go forward, to temporarily block the action from being implemented. \n\"President Obama’s decision to ignore the limits placed on his power and act unilaterally to rewrite our nation’s immigration laws are an affront to the Constitution,\" Rep. Bob Goodlatte said Monday in a statement quoted by The Hill. \"Such lawlessness must be stopped so that we preserve the separation of powers in the Constitution and protect individual liberty.\" \nLike us on Facebook ", "external_links": [], "published": "2015-05-13T03:00:00.000+03:00", "crawled": "2015-05-14T05:34:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}