{"organizations": ["Senate", "Jordain Carney"], "uuid": "c8f8ffcd1c49bcd72cdfb3fbc81fea0aaa4519aa", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/mcconnellmitch1_052115gn.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/finance/242795-senate-takes-key-step-toward-passing-fast-track-for-obama", "country": "", "title": "Senate takes key step toward passing fast-track for Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Senate takes key step toward passing fast-track for Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T18:23:00.000+03:00", "replies_count": 0, "uuid": "c8f8ffcd1c49bcd72cdfb3fbc81fea0aaa4519aa"}, "author": "", "url": "http://thehill.com/policy/finance/242795-senate-takes-key-step-toward-passing-fast-track-for-obama", "ord_in_thread": 0, "title": "Senate takes key step toward passing fast-track for Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Senate takes key step toward passing fast-track for Obama By Jordain Carney - 05/21/15 10:55 AM EDT \nThe Senate voted Thursday to end debate on fast-track trade legislation, handing a significant victory to President Obama and moving the bill a step closer to passage. \nA final vote could come as soon as Thursday if senators agree to limit the final 30 hours of debate allowed under Senate rules. ADVERTISEMENT Senators voted 62-38 on the bill, which will allow the president to send a sweeping Asia-Pacific trade deal to Congress for an up-or-down vote, and prevent the deal from being amended by Congress.\nDemocratic Sens. Patty Murray (Wash.), Maria Cantwell (Wash.) and Jeanne Shaheen (N.H.) were among the final Democratic \"yes\" votes. \nThey appeared to vote after Cantwell secured an agreement from Senate Majority Leader Mitch McConnell (R-Ky.) to allow a vote in June on renewing the Export-Import Bank's charter. \nThe bank, which has come under criticism from conservative Republicans, helps finance U.S. investments meant to increase trade, and has been supported in the past by Boeing. \nThe very final vote was cast by Sen. Rob Portman (R-Ohio), a former U.S. trade representative for the Bush administration who is in a tough reelection cycle. He voted yes. \nThirteen Democrats in total voted to end debate on a measure that badly divided Obama from his party. Senate Minority Leader Harry Reid (D-Nev.) and Sen. Elizabeth Warren (D-Mass.) were among his fiercest opponents. \nIf the measure is approved by the Senate, it will set up an even tougher fight for Obama in the House, where opposition to the bill is stronger from Democrats and many Republicans reflexively do not want to give him additional power. \nThe vote comes as GOP Senate leaders scramble to finish up work ahead of the week-long Memorial Day recess. \nIn addition to the trade legislation, Senate Majority Leader Mitch McConnell (R-Ky.) wants to wrap up surveillance and highway bills before senators leave town. The fight over the NSA could force a rare weekend session. \nSenators were unable to reach a deal on amendments prior to the vote. \nThe push for additional amendments was complicated Wednesday by presidential hopeful Sen. Rand Paul (R-Ky.), who took over the Senate floor for more than 10 hours on Wednesday to lambast the government's surveillance programs. \nBut, because the Senate was debating the trade legislation, the Kentucky Republican was actually blocking his Senate colleagues from coming forward and offering, debating, and, potentially, voting on amendments. \nDemocrats, however, placed the blame on the lack of amendment votes squarely on McConnell. \n“After one full day of debate, the majority leader shut down debate,” Sen. Sherrod Brown (D-Ohio), a fierce fast-track critic, said ahead of the vote. “That's an open process?” \nThe Ohio Democrat, who has been a staunch opponent of the trade bill, suggested that senators should stay potentially through the week-long Memorial Day recess to have more amendment votes on the trade legislation. \n“I doesn’t really matter about the time,” he said. \nThe other Democrats who voted to end debate were Sens. Tom Carper (Del.), Claire McCaskill (Mo.), Dianne Feinstein (Calif.), Heidi Heitkamp (N.D.), Chris Coons (Del.), Mark Warner (Va.), Michael Bennet (Colo.), Tim Kaine (Va.), Bill Nelson (Fla.) and Ron Wyden (Ore.), the ranking member of the Senate Finance Committee. \nFive Republicans voted against ending debate: Sens. Susan Collins (Maine), Richard Shelby (Ala.), Jeff Sessions (Ala.), Mike Lee (Utah) and Paul. \nSessions, who has been critical about not getting a vote on his amendment, said just before the vote that he would vote against cloture, saying that the \"fast track\" legislation meant Congress would \"suspend several of it's most basic powers for the next six years and to delegate those powers to the executive.\" \nAlexander Bolton contributed to this story. \nThis story was updated at 11:45 a.m. \n", "external_links": [], "published": "2015-05-21T18:23:00.000+03:00", "crawled": "2015-05-21T19:12:13.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}