{"organizations": ["Google Maps"], "uuid": "ed2f2dfaa110efd33cf5a058a5265e494a7c8598", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/googlewhitehouse.png", "site_section": "", "section_title": "", "url": "http://thehill.com/policy/technology/242648-google-maps-hit-with-racial-slurs-directed-at-obama", "country": "", "title": "Google Maps hit with racial slurs directed at Obama | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Google Maps hit with racial slurs directed at Obama | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "ed2f2dfaa110efd33cf5a058a5265e494a7c8598"}, "author": "", "url": "http://thehill.com/policy/technology/242648-google-maps-hit-with-racial-slurs-directed-at-obama", "ord_in_thread": 0, "title": "Google Maps hit with racial slurs directed at Obama | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David McCabe", "Obama"], "text": "Google Maps hit with racial slurs directed at Obama By David McCabe - 05/20/15 10:34 AM EDT \nGoogle has apologized and pledged to fix its Google Maps service to prevent racial slurs from being directed at President Obama and the White House. \nThe Huffington Post was the first to note on Tuesday afternoon that if users entered the phrase “n house” while searching the Washington, D.C., area, they are directed to the White House. The Washington Post later reported that a similar result occurred if users searched for \"“n king.\" ADVERTISEMENT “Some inappropriate results are surfacing in Google Maps that should not be, and we apologize for any offense this may have caused,” a company representative said in a statement to the Post . “Our teams are working to fix this issue quickly.”\nBy 10:00 a.m. on Wednesday, the searches still caused Google Maps to display the White House. \nWhile the source of the issue was not immediately clear, Google has had problems with the program in the past, stemming from the fact that users can add elements to maps in the program. \nOn May 12, Google announced it was suspending a program that lets users edit maps, after a series of pranks struck the service. \nSomeone, for example, marked the White House as the location of \"Edwards Snow Den\" — a clear reference to Edward Snowden, the National Security Agency leaker behind the release of documents that revealed the agency's domestic surveillance programs. \nClarification: This item initially reported that the Washington Post had first reported the issue with Google Maps. In fact, the Huffington Post was first to report the issues. Tags: ", "external_links": [], "published": "2015-05-21T03:00:00.000+03:00", "crawled": "2015-05-21T09:22:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}