{"organizations": [], "uuid": "167f7215bdb9ff7cd3a73bcf6239d2ee15552c62", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_020215getty.jpg", "site_section": "http://thehill.com/rss/syndicator/21684", "section_title": "TheHill - Video", "url": "http://thehill.com/homenews/administration/243115-obama-suffers-defeat-on-immigration-in-federal-court", "country": "US", "title": "Obama suffers another defeat on immigration in federal court", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama suffers another defeat on immigration in federal court", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T21:53:00.000+03:00", "replies_count": 0, "uuid": "167f7215bdb9ff7cd3a73bcf6239d2ee15552c62"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/243115-obama-suffers-defeat-on-immigration-in-federal-court", "ord_in_thread": 0, "title": "Obama suffers another defeat on immigration in federal court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama suffers another defeat on immigration in federal court By Jordan Fabian - 05/26/15 02:53 PM EDT 645X363 - Full Sharing - Additional videos are suggested upon completion \nA federal appeals court dealt President Obama a defeat on Tuesday as it declined to lift a judge’s order blocking his sweeping executive action on immigration. \nThe Fifth Circuit Court of Appeals sided with a Texas judge who issued an injunction preventing the programs from going into effect. The appeals judges ruled 2-1 that the order must stay in place. \n“Because the government is unlikely to succeed on the merits of its appeal of the injunction, we deny the motion for stay and the request to narrow the scope of the injunction,” the judges wrote . ADVERTISEMENT The court’s order makes it tougher for Obama to implement what the White House had seen as one of the signature programs of his second term, with just 20 months left to go in his administration.\nAfter Congress declined to pass an immigration overhaul last year, Obama ordered the creation of a new program that allows parents of U.S. citizens or legal resident children to apply for temporary deportation relief and work permits. \nHe also expanded a similar program, known as Deferred Action for Childhood Arrivals, that applies to immigrants who were brought to the U.S. illegally as children. \nBut Texas and 25 other states filed a lawsuit challenging those actions, arguing Obama exceeded his constitutional authority. They also said the programs would overburden state healthcare, education and motor-vehicle services. \nThe White House has long argued that the president acted within the law by using “prosecutorial discretion” to exempt certain immigrants from deportation who do not pose a public safety threat and who can contribute to their communities. U.S. District Judge Andrew Hanen in February slapped a preliminary injunction on the programs to stop them from taking effect while he considered the lawsuit. \nThe Department of Justice fought back in court, asking the Fifth Circuit for an emergency stay lifting the order in March. The administration argued the states had no standing to bring the case. \nFifth Circuit Judges Jennifer Elrod and Jerry Smith said the stay should remain in effect because the states had made a compelling case they would suffer harm if the programs went into effect. “The public interest favors maintenance of the injunction,” the judges wrote. They also said granting stays of deportation to broad groups of immigrants goes beyond the president’s “prosecutorial discretion.”“It is the affirmative act of conferring ‘lawful presence’ on a class of unlawfully present aliens,” the judges wrote. “Though revocable, that new designation triggers eligibility for federal and state benefits that would not otherwise be available.”Elrod and Smith are both Republican appointees. Judge Stephen Higginson, an Obama appointee, dissented. Immigrant-rights groups urged the Obama administration to appeal the ruling to the Supreme Court. “Today’s decision allows the lower court’s legally unsound decision blocking immigration relief to stay in place,” said Marielena Hincapié, executive director of the National Immigration Law Center. “We call upon the Justice Department to continue its efforts to get this injunction lifted by bringing the matter before the Supreme Court without delay.” \n— This story was updated at 3:41 p.m. Tags:", "external_links": [], "published": "2015-05-26T21:53:00.000+03:00", "crawled": "2015-05-26T23:08:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}