{"organizations": ["CBS"], "uuid": "6b41efa4445a69d3bf52146079c2aa22b254073c", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/politics/0/0/Obama%20Letterman%20consequences%20Latino.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/05/obama-unrest-in-black-hispanic-community-due-to-inequality-harsh-police/", "country": "", "title": "Obama forms charity for minority teens, says unrest is due to harsh police tactics | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama forms charity for minority teens, says unrest is due to harsh police tactics | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "6b41efa4445a69d3bf52146079c2aa22b254073c"}, "author": "", "url": "http://latino.foxnews.com/latino/politics/2015/05/05/obama-unrest-in-black-hispanic-community-due-to-inequality-harsh-police/", "ord_in_thread": 0, "title": "Obama forms charity for minority teens, says unrest is due to harsh police tactics | Fox News Latino", "locations": ["New York"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "John", "David Letterman", "Obama"], "text": "Obama forms charity for minority teens, says unrest is due to harsh police tactics Published May 05, 2015 Fox News Latino In this image released by CBS, President Barack Obama, left, appears with host David Letterman during a taping of \"Late Show with David Letterman,\" on Monday, May 4, 2015, in New York. (John Filo/CBS via AP) \nNEW YORK (AP) – In a deeply personal response to outbreaks of racially motivated protests, President Barack Obama on Monday blamed a lack of opportunity in minority communities and harsher treatment of black and Hispanic men by police for fueling a sense of \"unfairness and powerlessness.\" \nThe country's first black president called for a nationwide mobilization to reverse inequalities and said the cause will remain a mission for the rest of his presidency and his life. \"There are consequences to indifference,\" Obama said. \nHelping launch a foundation to assist young minorities, Obama said the catalysts of protests in Ferguson, Missouri, and in Baltimore were the deaths of young black men and \"a feeling that law is not always applied evenly in this country.\" \n\"They experience being treated differently by law enforcement – in stops and in arrests, and in charges and incarcerations,\" Obama said. \"The statistics are clear, up and down the criminal justice system. There's no dispute.\" \nThe new organization, My Brother's Keeper Alliance, is an outgrowth of Obama's year-old My Brother's Keeper initiative, which has focused on federal government policies and grants designed to increase access to education and jobs. \nWhile the effort predates the tensions in Baltimore that erupted after the death of Freddie Gray while in police custody, the significance of the new private-sector alliance has been magnified by the spotlight the riots placed on low-income minority neighborhoods. \n\"Folks living in those communities, and especially young people living in those communities, could use some help to change those odds,\" Obama said. \nObama repeatedly drove home the point during his 10-hour visit to New York, echoing the same themes from his speech at Lehman College in the Bronx to high-dollar Democratic Party fundraisers in Manhattan to an appearance on CBS' \"Late Show with David Letterman.\" \n\"For far too long, for decades, we have a situation where too many communities don't have a relationship of trust with the police,\" he told Letterman. He said he wants young minority men in particular to know \"we're going to invest in you before you have problems with the police, before there's the kind of crisis we see in Baltimore.\" \nHe tied the call for justice with an economic message for the 60 donors who paid $10,000 to see him at an expansive, art-filled Upper East Side apartment – including actor Wendell Pierce, who played a Baltimore police detective working in drug-ridden projects on \"The Wire.\" \n\"If we are going to be successful over the long haul, if we are going to win what will be a very competitive 21st Century, we've got to have everybody on the field,\" Obama said, adding the economy \"can't leave entire communities behind.\" \nObama later held a discussion with about 30 donors contributing up to $33,400. That event was closed to the media. \nDespite his criticism of inequities in criminal justice, Obama praised police officers for putting their lives on the line and singled out Brian Moore, a 25-year-old New York City police officer shot in the head over the weekend while attempting to stop a man suspected of carrying a handgun. He said police \"deserve our gratitude and our prayers, not just today but every day. They've got a tough job.\" \n\"We ask police to go into communities where there is no hope,\" he said at Lehman College. \"Eventually, something happens because of the tension between society and these communities, and the police are just on the front lines of that.\" \nObama described the plight of young minority men as a struggle he's intimately familiar with, alluding to his own youth raised by a single mother. \n\"I grew up without a dad. I grew up lost sometimes and adrift, not having a sense of a clear path,\" he said, adding that he was lucky because he was in an environment where people cared for him. \n\"Really, that's what this comes down to — do we love these kids?\" he said. \nWith high-profile names and an ambitious focus, the alliance is a possible building block for Obama's post-presidential pursuits. Obama has less than two years left in his presidency and the new institution would likely sustain its work well after he leaves the White House. \nThe White House sought to distinguish the operation of the organization from Bill and Hillary Clinton's family foundation, whose financing has attracted criticism. White House spokesman Josh Earnest said decisions about who could give to the group and the reporting of donations would be made by the board of directors. \n\"The White House will not be involved in determining what their fundraising policies should be,\" Earnest said. He said the board would be \"well aware of the priorities the president has placed on transparency.\" \nThe new alliance will be led by Joe Echevarria, the former chief executive of Deloitte, the giant accounting and consulting firm. The alliance already has obtained financial and in-kind commitments of more than $80 million from such companies as American Express, Deloittte, Discovery Networks and Fox News parent company News Corp., the White House said. \nThe alliance board is a who's who of the sports, corporate and entertainment worlds. Singer-songwriter John Legend is the alliance's honorary chairman; former Miami Heat star Alonzo Mourning is a member of the board. The alliance's advisory council will include former Secretary of State Colin Powell, former Attorney General Eric Holder and Sen. Cory Booker, a New Jersey Democrat; the mayors of Indianapolis, Sacramento and Philadelphia; and former NFL player Jerome Bettis and former NBA standout Shaquille O'Neal. \nLike us on Facebook ", "external_links": [], "published": "2015-05-06T03:00:00.000+03:00", "crawled": "2015-05-07T01:26:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}