{"organizations": [], "uuid": "4185583cf8c57770c5737eddff0c920f992f652b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/epawater_getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/243179-obama-asserts-power-over-small-waterways", "country": "US", "title": "President Obama asserts power over small waterways", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "President Obama asserts power over small waterways", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T17:05:00.000+03:00", "replies_count": 0, "uuid": "4185583cf8c57770c5737eddff0c920f992f652b"}, "author": "Timothy Cama", "url": "http://thehill.com/policy/energy-environment/243179-obama-asserts-power-over-small-waterways", "ord_in_thread": 0, "title": "President Obama asserts power over small waterways", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama asserts power over small waterways Getty Images By Timothy Cama - 05/27/15 10:05 AM EDT \nThe Obama administration asserted its authority Wednesday over the nation's streams, wetlands and other smaller waterways, moving forward with one of the most controversial environmental regulations in recent years. \nThe Environmental Protection Agency (EPA) and the Army Corps of Engineers said they are making final their proposed waters of the United States rule, which Republicans and many businesses have long panned as a massive federal overreach that would put the EPA in charge of ditches, puddles and wet areas. \n“We’re finalizing a clean water rule to protect the streams and the wetlands that one in three Americans rely on for drinking water. And we’re doing that without creating any new permitting requirements and maintaining all previous exemptions and exclusions,” EPA head Gina McCarthy told reporters Wednesday. \nMcCarthy and other Obama officials sought to emphasize that the rule is about increasing clarity for businesses and helping make it easier to determine which waterways are subject to the pollution rules of the Clean Water Act. \n“This rule is about clarification, and in fact, we’re adding exclusions for features like artificial lakes and ponds, water-filled depressions from constructions and grass swales,” she said \n“This rule will make it easier to identify protected waters and will make those protections consistent with the law as well as the latest peer-reviewed science. This rule is based on science,” she continued. \nWith the Wednesday action, the Obama administration is doubling down on an effort that has sustained repeated attacks from congressional Republicans hoping to overturn the regulations. \nIn doing so, the administration is fulfilling what it sees as a responsibility to protect the wetlands, headwaters and small water bodies that can carry pollution to the larger waterways that are more clearly protected by the Clean Water Act, like bays and rivers. Officials said the rule is necessary after a pair of Supreme Court decisions in the last decade called into question Clean Water Act protections for some small tributaries, streams and wetlands that were previously covered. \nBrian Deese, Obama’s top environmental adviser, said the rule is “is an important win for public health and for our economy,” and sought to paint its opponents as fighting clean water. \n“The only people with reason to oppose the rule are polluters who want to threaten our clean water,” he said. \nMcCarthy said the regulation will result in a modest increase in the federal government’s jurisdiction, amounting to less than a 3 percent growth. \nResponding to criticisms from farmers, ranchers, developers, manufacturers and others, she took time to list what is not covered by the waters of the United States rule. \n“It does not interfere with private property rights or address land use,” she said. “It does not regulate any ditches unless they function as tributaries. It does not apply to groundwater or shallow subsurface water, copper tile drains or change policy on irrigation or water transfer.” \nShe said the rule specifically does not interfere with agriculture, nor roll back any of the existing exemptions for farmers, ranchers or foresters. \nThose have been some of the most vocal opponents of the rule since it was proposed in March 2014, saying that the EPA wants to insert itself into their businesses. \nWhile critics are unlikely to be pleased by the new rule, the EPA’s supports applauded it. \n“The Obama administration listened to all perspectives and developed a final rule that will help guarantee safe drinking water supplies for American families and businesses and restore much-needed certainty, consistency, and effectiveness to the Clean Water Act,” Sen. Barbara Boxer (Calif.), top Democrat on the Environment and Public Works Committee, said in a statement. \nEnvironment America said the rule is an important step toward protecting drinking water for the one in three Americans whose drinking water was not sufficiently protected before. \n“Our rivers, lakes, and drinking water can only be clean if the streams that flow into them are protected,” Margie Alt, executive director of Environment America, said in a statement. “That’s why today’s action is the biggest victory for clean water in a decade.” \nThe House has voted multiple times to overturn the rule in its draft form. Senate Republicans have taken a different strategy, with a bill to overturn the rule and give the EPA specific instructions and a deadline to re-write it. \nBut the White House has remained steadfast in its push to enact the rule. On Wednesday, President Obama defended the regulation as protecting vulnerable waterways and providing clear guidance to businesses that are affected. “Too many of our waters have been left vulnerable to pollution,” Obama said in a statement, adding that the federal agencies wrote the rule to “restore protection for the streams and wetlands that form the foundation of our nation’s water resources, without getting in the way of farming, ranching, or forestry. \nThis story was last updated at 11:24 a.m.", "external_links": [], "published": "2015-05-27T17:05:00.000+03:00", "crawled": "2015-05-27T18:24:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}