{"organizations": [], "uuid": "afb7141b6a856ecd4ed2c4fa70a00fb071ce2f12", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/11/politics/seymour-hersh-obama-bin-laden-raid-lied/index.html", "country": "", "title": "Seymour Hersh: Obama lied on Osama bin Laden raid - CNNPolitics.com", "performance_score": 9, "site": "cnn.com", "participants_count": 0, "title_full": "Seymour Hersh: Obama lied on Osama bin Laden raid - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-11T15:30:00.000+03:00", "replies_count": 0, "uuid": "afb7141b6a856ecd4ed2c4fa70a00fb071ce2f12"}, "author": "", "url": "http://www.cnn.com/2015/05/11/politics/seymour-hersh-obama-bin-laden-raid-lied/index.html", "ord_in_thread": 0, "title": "Seymour Hersh: Obama lied on Osama bin Laden raid - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Report accuses Obama of lying about bin Laden killing Updated 1337 GMT (2037 HKT) May 11, 2015 The death of Osama bin Laden 13 photos Vice President Joe Biden, left, President Barack Obama, and Secretary of State Hillary Clinton, second from right, watch the mission to capture Osama bin Laden from the Situation Room in the White House on May 1, 2011. Click through to see reactions from around the world following the death of the al Qaeda leader. Hide Caption 1 of 13 The death of Osama bin Laden 13 photos President Obama edits his remarks in the Oval Office prior to making a televised statement announcing bin Laden's death. Hide Caption 2 of 13 The death of Osama bin Laden 13 photos Servicemen cheer from a lamp post as thousands of people gather at Ground Zero in New York City. Hide Caption 3 of 13 The death of Osama bin Laden 13 photos Crowds celebrate with NYPD officers in New York's Times Square early on May 2, 2011, after the death of Osama bin Laden. Hide Caption The death of Osama bin Laden 13 photos Revelers gather at the fence on the north side of the White House. Hide Caption The death of Osama bin Laden 13 photos Afghans watch television coverage in Kabul announcing the killing of bin Laden. Hide Caption 6 of 13 The death of Osama bin Laden 13 photos U.S. Marines watch the announcement of bin Laden's death at Camp Dwyer in Helmand Province, Afghanistan. Hide Caption The death of Osama bin Laden 13 photos Times Square is filled shortly after the announcement of bin Laden's death. Hide Caption The death of Osama bin Laden 13 photos Students gather to celebrate at the fence on the north side of the White House. Hide Caption The death of Osama bin Laden 13 photos A passer-by looks at newspaper headlines in front of the Newseum in Washington. Hide Caption 10 of 13 The death of Osama bin Laden 13 photos Danielle LeMack, left, Carie LeMack and Christie Coombs, who lost relatives on 9/11, pause during a ceremony to honor the victims on May 2, 2011, at the Garden of Remembrance in Boston. Hide Caption 11 of 13 The death of Osama bin Laden 13 photos A visitor photographs the fence overlooking the crash site of Flight 93 in Shanksville, Pennsylvania, on May 2, 2011. Hide Caption The death of Osama bin Laden 13 photos Pakistani media and residents gather outside the bin Laden hideout on May 3, 2011. Hide Caption 13 of 13 Watch journalist Seymour Hersh talk about his report on CNN's \"New Day\" Monday at 8 a.m. EST. Washington (CNN) Journalist Seymour Hersh is alleging President Barack Obama and his administration lied about the circumstances surrounding the 2011 killing of Osama bin Laden, an account close followers of the raid to kill the al Qaeda leader are loudly disputing. Citing an anonymous \"major U.S. source,\" Hersh writes in the London Review of Books that the Obama administration cooperated with Pakistani intelligence officials to kill the al Qaeda leader, and that the chief of staff of the Pakistani army and director general of the Inter-Services Intelligence Agency knew about the mission, contrary to Obama's claim that Pakistani officials weren't aware of the raid in advance. CNN National Security Analyst Peter Bergen immediately rebutted Hersh's allegations in a post that contradicts most of the claims in his 10,000 word report. \"Hersh's account of the bin Laden raid is a farrago of nonsense that is contravened by a multitude of eyewitness accounts, inconvenient facts and simple common sense,\" Bergen wrote Monday. RELATED: Was the bin Laden killing story a lie? The administration has said they received information on bin Laden's whereabouts by tracking his courier, and that the top military target was killed in a firefight with an elite team of Navy SEALs. But Hersh writes that the Obama administration had initially agreed to say bin Laden had been killed by a drone strike; that ISI was holding bin Laden a prisoner at the Abbottabad compound where he was killed, and that a former senior Pakistani intelligence officer told the U.S. of his whereabouts for the $25 million award being offered at the time. His source is identified as a \"retired senior intelligence official who was knowledgeable about the initial intelligence about bin Laden's presence in Abbottabad.\" JUST WATCHED ", "external_links": [], "published": "2015-05-11T15:30:00.000+03:00", "crawled": "2015-05-11T15:55:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}