{"organizations": [], "uuid": "40409b37cb80401e95c6047c2497da0a2f0ea966", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2900446/images/o-ARNE-DUNCAN-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/college/news.xml", "section_title": "College News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/04/30/education-department-corinthian-debt-relief_n_7185668.html?utm_hp_ref=college&ir=College", "country": "US", "title": "Obama Administration Considers New 'Roadblocks' For Ex-Corinthian Colleges Students Seeking Debt Relief", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Obama Administration Considers New 'Roadblocks' For Ex-Corinthian Colleges Students Seeking Debt Relief", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T04:00:00.000+03:00", "replies_count": 0, "uuid": "40409b37cb80401e95c6047c2497da0a2f0ea966"}, "author": "Shahien Nasiripour", "url": "http://www.huffingtonpost.com/2015/04/30/education-department-corinthian-debt-relief_n_7185668.html?utm_hp_ref=college&ir=College", "ord_in_thread": 0, "title": "Obama Administration Considers New 'Roadblocks' For Ex-Corinthian Colleges Students Seeking Debt Relief", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Administration Considers New 'Roadblocks' For Ex-Corinthian Colleges Students Seeking Debt Relief Posted: Updated: 3 hours ago U.S. Secretary of Education Arne Duncan speaks at the ConnectED conference in the East Room of the White House November 19, 2014 in Washington, DC. US President Barack Obama hosted school leaders and educators from across the country at the White House for ConnectED to the Future, a day-long convening to explore the potential of education technology and the innovations needed to bring Americas schools into the digital age. At the event, the President will launch his Administrations effort to as | BRENDAN SMIALOWSKI via Getty Images reddit \nThe U.S. Department of Education is considering new hurdles for student loan borrowers seeking to get out of their debts by claiming their schools swindled them. \nDays after the abrupt shutdown of for-profit chain Corinthian Colleges Inc., the department is discussing additional requirements for debt-forgiveness applications and hiring an outside party to rule on claims made by aggrieved borrowers, according to people briefed on the plans. \nDoing so would effectively ignore demands by more than a dozen Senate Democrats, nine state attorneys general and borrower advocates, who have urged widespread debt relief to defrauded student borrowers. \nThe result may be a lifetime of crippling debt for thousands of Americans who obtained questionable credentials at schools that misled them into enrolling. The department, which plans to announce its move next week, hasn’t finalized a decision and may ultimately adopt more borrower-friendly measures. \nOutstanding federal student debt has nearly doubled to $1.1 trillion since President Barack Obama and Education Secretary Arne Duncan took office in January 2009, federal data show. A greater share of Americans are late on their student loan payments than on their credit cards, home mortgages or auto loans, according to the Federal Reserve Bank of New York. \nDebt forgiveness applications are based on an obscure provision in federal law dating to the mid-1990s, and in borrowers’ loan contracts, that give them the right to seek loan discharges when they believe they’ve been defrauded by their schools. \nThe issue has recently commanded attention in Washington amid state and federal allegations that Corinthian Colleges Inc., the faltering for-profit chain, systematically duped people into enrolling and taking out federal student loans with false job prospects and fake graduation rates. \nCorinthian's shutdown this week leaves 16,000 students scrambling for options. The company once had more than 110,000 students spread across more than 120 campuses under the Everest, Wyotech and Heald brands, but it collapsed under the weight of state and federal lawsuits and investigations alleging the company defrauded its students. Corinthian denies wrongdoing. \nHundreds of former Corinthian students have filed applications in recent weeks with the Education Department to get their debts discharged under the “defense against repayment” provision. The applicants have cited pending state and federal lawsuits against the company that allege Corinthian misled students into enrolling with false job placement and graduation rates. \nSeparately, more than 100 former Corinthian students have declared a “ debt strike ” and are publicly refusing to repay their student loans until the Education Department wipes out all federal debts owed by all former Corinthian students. \nFederal law allows the department to recoup from colleges whatever losses it sustains as a result of forgiving former students’ debts. But because of Corinthian’s troubled finances, the Education Department likely would sustain losses if it were to heed the calls of borrower advocates, such as Sen. Dick Durbin (D-Ill.). \nThe Obama administration has presided over what many for-profit college advocates view as a crackdown on their industry, with rhetoric that disparages the schools and new rules meant to rein in institutions that grant credentials of questionable value yet leave students mired in debt. \nSeveral major for-profit college chains also are under investigation for potentially misleading students by advertising false job placement or graduation rates. The Education Department has funneled billions of dollars in federal financial aid in recent years to for-profit schools under state or federal investigation. If borrowers saddled with those loans win debt forgiveness, the department could face billions of dollars in losses. \nIt is against this backdrop that the Education Department plans to announce next week what borrowers need to demonstrate in order for their debts to be wiped. Department officials have told student advocates they plan to announce new details about the application process for forgiveness. \nDorie Nolt, an Education Department spokeswoman, declined to answer questions. \nPeople familiar with the department’s plans said the Education Department will require aggrieved borrowers to submit applications that effectively force them to prove that they were misled by their school and to demonstrate their losses. \nRobyn Smith, a former California deputy attorney general who now works on student loan issues for the National Consumer Law Center, said the individual application process would be burdensome for former students, since there are so few legal aid attorneys to help them. “It would be a disappointment,” she said. \nBorrower advocates, including Durbin, the National Consumer Law Center and Massachusetts Attorney General Maura Healey, have recommended that the Education Department rely on evidence compiled by state prosecutors and the federal Consumer Financial Protection Bureau to cancel former Corinthian students' debts. \nThe federal consumer bureau and state attorneys general in California, Massachusetts, and Wisconsin have filed separate lawsuits, alleging Corinthian fraudulently induced students to take out loans to attend its schools by misleading them about future job prospects. \nThe Education Department itself alleges it has uncovered evidence that Heald College, once the jewel of the Corinthian chain, misled students and accreditation agencies about graduates’ employment rates and showed a “ blatant disregard ” for the federal student loan program. The department said on April 14 that it had found 947 false job placement rates dating back to at least 2010. \nSmith, of the consumer law center, said Duncan has the authority to grant mass loan discharges of former Corinthian students’ debts. \nLaura Hanna, an organizer who works with the so-called “Corinthian 100” debt strikers, said it “absolutely makes no sense” for the Education Department to impose new forgiveness requirements, given the evidence dug up by state prosecutors, the federal consumer bureau and the department itself. \nThe department also is considering outsourcing review of debt-forgiveness applications to a third party that would rule on the claims. \nSuch a move, said Barmak Nassirian, an expert on higher education policy, would make sense in cases where the Education Department had to investigate whether a school had misled its students. There is additional merit in the idea, he said, because the Education Department would have a conflict of interest in deciding whether to cancel borrowers’ debts. For every loan it cancels, the department would lose money and effectively acknowledge it failed to properly supervise the college and protect students and taxpayers from fraud. \nBut when it comes to applications from former Corinthian students, Nassirian said, “what would be a fair process is actually being used as a delaying tactic and as a roadblock.” \n“The entire educational experience apparently was subpar and questionable and fraught with misrepresentations and lies,” Nassirian said of Corinthian. “So if you know that, what is the need for individual adjudication? I just don’t get it.” Also on HuffPost:   Japanese Prime Minister Shinzo Abe waves before he addresses a joint session of Congress at the U.S. Capitol in Washington, D.C., on April 29, 2015. Sen. Robert Menendez (D-N.J.), second from left, smiles as he rides a Senate subway with a member of the press, left, after a vote April 23, 2015, to confirm Loretta Lynch as the next U.S. attorney general. Members of the Minnesota delegation taste each other's entries during the Minnesota Congressional Delegation Hotdish Competition on Capitol Hill on April 22, 2015. Hotdish is a meal similar to a casserole. House Minority Leader Nancy Pelosi (D-Calif.) speaks while flanked by members of the Congressional Black Caucus during a news conference on Capitol Hill on April 22, 2015. Pelosi urged the Senate to immediately confirm Loretta Lynch's nomination as attorney general. Henry Singleton of New York City holds up a sign as U.S. Rep. John Lewis (D-Ga.) speaks during a rally to mark the finish of March2Justice on April 21, 2015, on the West Lawn of the U.S. Capitol in Washington, D.C. Dozens of marchers took part in an eight-day, 250-mile march from Staten Island, New York, to the nation's capital to demand congressional intervention to tackle \"the national crisis of police violence.\" Sheikh Mohammed bin Zayed al-Nahyan, Crown Prince of Abu Dhabi, second from left, speaks with Sen. John McCain (R-Ariz.), second from right, as they pose for a photo alongside Senate Majority Leader Mitch McConnell (R-Ky.), left, and Sen. Ben Cardin (D-Md.), right, prior to a meeting at the U.S. Capitol in Washington, D.C., on April 21, 2015. Capitol Hill police officers and other officials lift a gyrocopter that landed on the U.S. Capitol's South Lawn, onto a trailer on April 15, 2015. A man identified as Doug Hughes, 61, illegally landed his aircraft on the Capitol lawn, triggering street closures around the building and prompting a police investigation. Hughes is described as a mailman, and a logo appearing to be that of the U.S. Postal Service was visible on the tail fin of the aircraft. U.S. Secretary of State John Kerry is trailed by staff and security while departing a meeting with members of the U.S Senate on the proposed deal with Iran at the U.S. Capitol on April 14, 2015. Kerry met with members of the House and Senate to discuss the ongoing Iran nuclear negotiations. A large abstract painting of Senate Minority Leader Harry Reid of Nevada is visible on a wall next to a stuffed eagle in his office on Capitol Hill in Washington on March 27, 2015. Reid recently announced he will not seek re-election to another term. Senate Armed Services Committee Chairman Sen. John McCain (R-Ariz.) applauds the final comments from fellow committee member, Sen. Lindsey Graham (R-S.C.), as they conclude a news conference on Capitol Hill in Washington on March 26, 2015, to discuss the situation in Yemen. Sen. Kelly Ayotte (R-N.H.) is at right. Actor, filmmaker and founder of the Eastern Congo Initiative Ben Affleck testifies before a Senate Appropriations Subcommittee on State, Foreign Operations, and Related Programs hearing on \"Diplomacy, Development, and National Security\" on March 26, 2015. His wife, Jennifer Garner, looks on. Bill Gates testifies during the Senate Appropriations Subcommittee on State, Foreign Operations and Related Programs hearing on \"Diplomacy, Development, and National Security\" on March 26, 2015. Golf legend Jack Nicklaus, left, and Speaker of the House John Boehner (R-Ohio) wipe away tears after listening to the remarks of Nicklaus' son Jack Nicklaus II during the elder Nicklaus' Congressional Gold Medal ceremony in the U.S. Capitol Rotunda on March 24, 2015. Nicklaus was lauded by family, friends and politicians for his many sports achievements and his philanthropy. House Minority Whip Steny Hoyer (D-Md.) and House Minority Leader Nancy Pelosi (D-Calif.) lead the way down the House steps for the House Democratic Caucus media event to mark the fifth anniversary of President Barack Obama signing into law the Affordable Care Act on March 24, 2015. Conference aide SoRelle Wyckoff films a news conference in the Capitol after a meeting of the House Republican Conference using the live streaming app Meerkat on March 24, 2015. Golf legend Jack Nicklaus, center, is presented the Congressional Gold Medal by, from left, House Minority Leader Nancy Pelosi (D-Calif.), Speaker John Boehner (R-Ohio), Senate Minority Leader Harry Reid (D-Nev.) and Senate Majority Leader Mitch McConnell (R-Ky.) in the Capitol Rotunda on March 24, 2015. Joseph Clancy, director of the U.S. Secret Service, testifies during a Senate Appropriations Subcommittee hearing on Capitol Hill in on March 19, 2015. Code Pink peace activists discuss a letter to Iran's leaders written by Sen. Tom Cotton (R-Ark.) outside his office in the Russell Senate Office Building on Capitol Hill on March 19, 2015. The group organized a \"spring cleaning of Congress.\" House Minority Leader Nancy Pelosi (D-Calif.) right, prepares to take a picture in her Capitol office with Supreme Court Justices, from left, Elena Kagan, Ruth Bader Ginsburg and Sonia Sotomayor, before a reception on March 18, 2015. The justices were in the Capitol to be honored at Pelosi's annual Women's History Month reception in Statuary Hall. From left: Rep. Peter King (R-N.Y.), Speaker of the House John Boehner (R-Ohio), President Barack Obama (D) and Irish Prime Minister Taoiseach Enda Kenny depart the annual Friends of Ireland luncheon on Capitol Hill on St. Patrick's Day 2015. Dressed in colonial garb, Adam Eidinger and fellow D.C. marijuana advocates visit the office staff of Rep. Jason Chaffetz (R-Utah) at the Rayburn House Office Building on Capitol Hill on March 17, 2015, to protest the congressman's stand in regard to legalized marijuana in the District of Columbia. Legislative Director Amber Kirby Talley receives a pipe from Eidinger. Shawna Blair, of the Senate Periodical Press Gallery, holds her dog George Clooney, a 4-month-old Goldendoodle, for Kate Hunter of Bloomberg News to pet in the Capitol's Senate Press Gallery on March 13, 2015. Protesters from Code Pink hold up signs as Secretary of State John Kerry and Defense Secretary Ashton Carter arrive to testify before the Senate Foreign Relations Committee on Capitol Hill on March 11, 2015. Sen. Ted Cruz (R-Texas) speaks during the International Association of Fire Fighters Presidential Forum at the Hyatt Regency on Capitol Hill on March 10, 2015. Sen. Elizabeth Warren (D-Mass.) speaks during the International Association of Fire Fighters Legislative Conference General Session at the Hyatt Regency on Capitol Hill on March 9, 2015. Former astronaut Mark Kelly, husband of former congresswoman and handgun violence survivor Gabby Giffords, is joined by Reps. Mike Thompson (D-Calif.), Bob Dold (R-Ill.), Elizabeth Esty (D-Conn.) and Kathleen Rice (D-N.Y.) for a news conference about background checks for gun purchases in the Canon House Office Building on March 4, 2015. Rep. Sean Duffy (R-Wis.), shoots a video selfie as he heads to the House floor for votes on March 4, 2015. Former Congresswoman and handgun violence survivor Gabby Giffords (D-Ariz.) speaks during a news conference about background checks for gun purchases at the Canon House Office Building on Capitol Hill on March 4, 2015. Israeli Prime Minister Benjamin Netanyahu waves as he steps to the lectern prior to speaking before a joint meeting of Congress on Capitol Hill in Washington on March 3, 2015. House Speaker John Boehner of Ohio, left, and Sen. Orrin Hatch (R-Utah) applaud. Israeli Prime Minister Benjamin Netanyahu waves after speaking before a joint meeting of Congress on Capitol Hill in Washington on March 3, 2015. House Minority Leader Nancy Pelosi (D-Calif.) chuckles as she starts a news conference by donning dark glasses, a teasingly sympathetic gesture to Senate Minority Leader Harry Reid (D-Nev.) as he recovers from a serious injury to his right eye, suffered while exercising at his Nevada home during the holidays. (AP Photo/J. Scott Applewhite) House Speaker John Boehner (R-Ohio) responds to reporters about the impasse over passing the Homeland Security budget because of Republican efforts to block President Barack Obama's executive actions on immigration on Feb. 26, 2015, during a news conference on Capitol Hill in Washington. Code Pink protesters hold up a sign as Secretary of State John Kerry arrives on Capitol Hill in Washington on Feb. 25, 2015, to testify before a House Foreign Affairs Committee hearing. U.S. Senate Minority Leader Harry Reid (D-Nev.) (left) speaks as Sen. Charles Schumer (D-N.Y.) listens during a news briefing after the weekly Senate Democratic Policy Luncheon on Feb. 24, 2015. Reid was wearing glasses following a recent eye surgery. The socks of former NASA astronaut Buzz Aldrin are shown as he testifies before the Senate Space, Science, and Competitiveness Subcommittee on Capitol Hill on Feb. 24, 2015. Secretary of State John Kerry appears before the Senate Appropriations Subcommittee on State, Foreign Operations and Related Programs on Feb. 24, 2015, to talk about fiscal year 2016 funding for the State Department. A cardboard cutout of Las Vegas star Liberace stands outside the office of Rep. Dina Titus (D-Nev.) in the Cannon House Office Building on Feb. 18, 2015. Rep. Keith Ellison (D-Minn.) attends a rally with labor groups, including the American Federation of Government Employees, in Upper Senate Park to support federal workers and the working class, on Feb. 10, 2015. Sen. Charles Schumer (D-N.Y.) (3rd L) laughs as he talks to (L-R) Sen. Lindsey Graham (R-S.C.), Sen. Debbie Stabenow (D-Mich.), Sen. Sherrod Brown (D-Ohio) and Sen. Jeff Sessions (R-Ala.) before a news conference on currency and trade Feb. 10, 2015, on Capitol Hill. Rep. Darrell Issa (R-Calif.) walks through the basement of the Capitol with a painting of former President Ronald Reagan by artist Steve Penley on Feb. 11, 2015. The painting will be added to Issa's collection of Reagan memorabilia. Speaker of the House John Boehner (R-Ohio) holds his weekly press conference in the Capitol on Feb. 5, 2015. Sen. Tim Scott (R-S.C.) gives a group hug to students from the Richard Wright Public Charter School in Washington, D.C., during his National School Choice Forum in the Hart Senate Office Building on Feb. 9, 2015. Patriarch Filaret, head of the Ukrainian Orthodox Church of the Kyivan Patriarchate, speaks during a press conference on Capitol Hill in Washington, D.C., on Feb. 5, 2015. Delegates from the Ukrainian Parliament joined members of the House of Representatives to appeal for lethal military aid from the U.S. Senate Minority Leader Harry Reid (D-Nev.) speaks to the media as Sen. Chuck Schumer (D-N.Y.) listens, following the Senate Democrats' policy lunch on Feb. 3, 2015. The protest group CodePink disrupts a Senate Armed Services Committee hearing, carrying banners calling former Secretary of State Henry Kissinger a \"war criminal\" as he and fellow former Secretary of States George Shultz and Madeleine Albright were set to testify on U.S. national security on Capitol Hill on Jan. 29, 2015. Naomi Sherman, 4, right, along with her father, Rep. Brad Sherman (D-Calif.); mother, Lisa; and sisters, Lucy, 2, and Molly, 5, prepares to board a bus that will take House Democrats and their families to a retreat in Philadelphia on Jan. 28, 2015. Sen. Dan Sullivan (R-Alaska), left, and Rep. Don Young (R-Alaska) talk before a news conference in the Capitol's Senate studio to \"respond to the Obama administration's efforts to lock up millions of acres of the nation's richest oil and natural gas prospects on the Arctic coastal plain and move to block development of Alaska's offshore resources\" on Jan. 26, 2015. U.S. Sen. Chuck Grassley (R-Iowa), left, reacts as Sen. Patrick Leahy (D-Vt.) brings out a giant gavel while making remarks during an executive business meeting of the Senate Judiciary Committee on Jan. 22, 2015. Leahy ceremonially passed the gavel to Grassley who has taken up the chairmanship after the Republicans won the majority in the Senate. Sen. Elizabeth Warren (D-Mass.) speaks with Rep. Sheila Jackson Lee (D-Texas) as senators arrive for President Barack Obama's State of the Union address in the Capitol on Jan. 20, 2015. Rep. Linda Sanchez (D-Calif.) takes a selfie with Rep. Zoe Lofgren (D-Calif.) as Rep. John Shimkus (R-Ill.) sits nearby before President Barack Obama's State of the Union address on Jan. 20, 2015. President Barack Obama, bottom right, is greeted by Rep. Terri Sewell (D-Ala.), center, as he arrives to deliver the State of the Union address to a joint session of Congress on Jan. 20, 2015. Sen. Bernie Sanders (I-Vt.) holds a news conference on the budget on Jan. 16, 2015. Sen. Bill Cassidy (R-La.) and his wife, Laura, have their luggage inspected by a police dog before boarding a bus that will take Republican senators to a retreat in Hershey, Pa., January 14, 2015. Rep. Erik Paulsen (R-Minn.) walks by immigration protesters on his way to one of the buses outside the Rayburn House Office Building as House Republicans prepare to head to Hershey, Pa., for their retreat with Senate Republicans on Jan. 14, 2015. Sen. John McCain (R-Ariz.) fools around with colleagues upon arriving for a news conference on Guantanamo detainees in the Senate studio on Jan. 13, 2015. Rep. Luis Gutierrez (D-Ill.) speaks during a press conference on Capitol Hill on Jan. 13, 2015. House Democrats spoke about U.S. President Barack Obama's executive actions on immigration. From left, Sens. Sherrod Brown (D-Ohio), Jeff Merkley (D-Ore.), Ron Wyden (D-Ore.) and Rob Portman (R-Ohio) make symbols that spell \"Ohio\" on Jan. 13, 2015, as the result of a football bet. Ohio State beat the University of Oregon 42-20 in the NCAA national football championship. Sen. Richard Burr (R-N.C.) sanitizes his hands while talking on his cell phone outside the Mansfield Room in the Capitol on Jan. 8, 2015. Rep. Frederica Wilson (D-Fla.) walks with her family through the Will Rogers Hallway after the swearing-in of the 114th Congress on the House floor on Jan. 6, 2015. Rep. Henry Cuellar (D-Texas) holds Andrea Elena Castro, daughter of Joaquin Castro (D-Texas), second from right, before the 114th Congress was sworn in on the House floor of the Capitol on Jan. 6, 2015. Speaker of the House John Boehner (R-Ohio) leaves a church service on Capitol Hill on Jan. 6, 2015, the first day of the 114th Congress.  Share", "external_links": [], "published": "2015-05-01T04:00:00.000+03:00", "crawled": "2015-05-01T08:18:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}