{"organizations": ["Obama Administration Will Not Seek Supreme Court Stay On Immigration Block Obama Administration Will Not Seek Supreme Court", "DC", "NATO"], "uuid": "283b06bb658e1b215a3612d374a3b7f86f0f37c2", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3001620/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/27/obama-supreme-court-immigration_n_7454966.html", "country": "", "title": "Obama Administration Will Not Seek Supreme Court Stay On Immigration Block", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Administration Will Not Seek Supreme Court Stay On Immigration Block", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T00:04:00.000+03:00", "replies_count": 0, "uuid": "283b06bb658e1b215a3612d374a3b7f86f0f37c2"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/27/obama-supreme-court-immigration_n_7454966.html", "ord_in_thread": 0, "title": "Obama Administration Will Not Seek Supreme Court Stay On Immigration Block", "locations": ["United States", "Washington", "U.S.", "WASHINGTON", "DC"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jens Stoltenberg", "Dennis", "Barack Obama", "Obama"], "text": "Obama Administration Will Not Seek Supreme Court Stay On Immigration Block Reuters Updated: 4 minutes ago WASHINGTON, DC - MAY 22: U.S. President Barack Obama speaks while meeting with NATO Secretary-General Jens Stoltenberg in the Oval Office of the White House on May 26,2015 in Washington, DC. Obama said the United States is working closely with NATO in the fight against ISIL . (Photo by Dennis Brack-Pool/Getty Images) | Pool via Getty Images reddit \nWASHINGTON, May 27 (Reuters) - Despite a setback to President Barack Obama's immigration action in the Fifth Circuit Court of Appeals on Tuesday, the U.S. Justice Department will not ask the Supreme Court to stay the injunction, a Department spokesman said. \nTwenty-six states blocked the launch of the executive action, estimated to provide relief from deportation to 4.7 million undocumented immigrants, in a ruling first decided by a Texas District judge in February. \nThe Fifth Circuit will hear an appeal to the injunction in July. (Reporting By Julia Edwards; Editing by Sandra Maler) Also on HuffPost: 11 Ways Immigration Reform Helps The Economy of   Immigration reform would reduce the federal deficit by $2.5 trillion over the next 10 years, according to an April analysis by the American Action Forum, a conservative think tank. Expelling the approximately 11 million undocumented immigrants currently in the United States would cost $2.6 trillion over the next 10 years, according to CNBC. That's because it costs the government more than $8,000 to deport each person. Immigration reform would help bolster Social Security because more legal workers would mean more people contributing payroll taxes to its trust fund, according to an analysis from the Social Security administration. Undocumented workers already contribute $15 billion per year to Social Security. More than a quarter of technology and engineering firms started between 1995 and 2005 had a foreign-born owner, according to the Washington Post. One of the founders of Yahoo!, Jerry Yang, is an immigrant from Taiwan. The immigration reform bill proposed by the \"gang of eight\" senators would save $410 billion over the next decade, according to an analysis from Gordon Gray, the director of fiscal policy at the American Action Forum, a conservative think tank. The savings would come largely from a boost in GDP resulting from undocumented immigrants gaining citizenship and in turn likely making more money. Companies like Microsoft and Google have said that immigration reform would help them by allowing for more H1B visas, a special kind of visa geared toward highly-skilled immigrants. The tech giants say they can't find enough qualified people in the U.S. to fill their staffing needs. U.S.-born workers see between a 0.1 and 0.6 percent boost in wages on average with an increase in immigration, according to a January report from the Hamilton Project, an economic policy initiative of the nonpartisan Brookings Institution. That's because immigrant workers bring skills with them that complement those of native-born workers, leading to new jobs. Immigrants are more than twice as likely than native-born Americans to start new businesses, according to a White House report on immigration reform. Immigration reform would boost GDP by $1.5 trillion -- or about 1 percent -- over 10 years, according to an estimate from UCLA professor Raul Hinojosa-Ojeda cited by CNBC. Businesses owned by immigrants created 4.7 million jobs in the U.S. in 2007, according to a White House report on immigration reform. Though many critics of immigration reform argue against the cost of providing increased public benefits, analysts say higher spending is not a likely consequence. A Congressional Budget Analysis of George W. Bush's 2007 immigration reform proposal found that it would cost the government $23 billion in more public services, but bring in $48 billion in revenue, according to the Washington Post.  Share ", "external_links": [], "published": "2015-05-28T00:04:00.000+03:00", "crawled": "2015-05-28T00:04:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}