{"organizations": [], "uuid": "39a495b0a2c264fbdfb48f4190863f88cbc28a18", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/05/jimmy-carter-ghost-stalks-obama-white-house/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422600161602.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/05/jimmy-carter-ghost-stalks-obama-white-house.html", "country": "", "title": "Jimmy Carter's ghost stalks Obama White House | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Jimmy Carter's ghost stalks Obama White House | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "39a495b0a2c264fbdfb48f4190863f88cbc28a18"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/05/jimmy-carter-ghost-stalks-obama-white-house.html", "ord_in_thread": 0, "title": "Jimmy Carter's ghost stalks Obama White House | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Can Snowden survive Russia and Putin? \nAt one point his eagerness translated into a seeming breach of faith with his own country, when he was caught on tape promising Putin (via his former number two Dmitri Medvedev) even greater accommodation on missile defense once reelected. Apparently the numerous earlier rebuffs from the Russian bully – on Iran, on missile defense, on Syria etc. -- made no impression; Obama is ever hopeful. \nJimmy Carter was also unprepared to deal with Russia. NATO allies, worried about the Soviet deployment of longer-range, more capable SS-20 missiles in Europe beginning in 1976, pushed Carter to counter with U.S. cruise and Pershing missiles, to maintain strategic parity. \nWhen Carter and Brezhnev met to sign Salt II, Carter whiffed; not only did he fail to win any agreement on the SS-20s, he never even broached the NATO demands. \nHelmut Schmidt, who had spearheaded the strategy, was furious. Later, he described Jimmy Carter’s profound ignorance (and improbable optimism) about the Soviet Union: “He wasn’t aware that the Russians don’t know and never have known citizen’s rights,” the former German chancellor wrote. \nIn 1980, President Carter asked the Senate to discontinue consideration of the Salt II treaty in response to the Soviet invasion of Afghanistan, a stunning rebuke to U.S. interests. The same year, he ordered a boycott of the Moscow Olympics. \nBoth Carter and Obama came to office convinced that by dint of righteousness or personality they could win over our enemies. That it was just a matter of persuasion . \nPresident George W. Bush is widely scorned these days for attempting to export democracy to the peoples of other lands; Mr. Obama, like Carter before him, has sought kindness and justice from the likes of Hugo Chavez and Bashar-Al-Assad. Which is more naïve? \nNaivete is costly. Both the Carter and Obama administrations have been distinguished by the rare murder of an ambassador. \nEven before the Iran hostage crisis that came to symbolize the failures of his presidency, Jimmy Carter was “shocked and saddened” when the Russians, along with Afghan security forces, killed Adolph Dubs, the U.S. ambassador to Afghanistan . \nOn Obama’s watch, of course, we lost Christopher Stevens, ambassador to Libya and three others; the president called it a “shocking attack.” \nIn both cases, critics charged the White House with incompetence and carelessness for not protecting our own. \nIran has proved a testing ground for both Carter and Obama, as the despots leading that country took the measure of U.S. leadership and found it wanting. \nUnder Carter, Iran took 52 U.S. citizens hostage in one of our country’s most humiliating chapters. \nMore recently, Iran’s former president Ahmadinejad has continued to publicly spurn Obama’s efforts to rein in that country’s nuclear ambitions, at times driving a wedge between the U.S. and ally Israel. \nObama’s lack of response to the mass slaughter in Syria and scrambled interactions with Egypt harks back to Carter’s impotence in the face of the 1979 OPEC oil embargo. \nIn Egypt today, the United States is ignored by both Islamist supporters of now-deposed President Morsi and also by the military; we are blamed by both sides for the chaos in that country. That’s quite an accomplishment, given the enormous aid we have ladled out to Egypt for decades. Unimaginably, it is EU foreign policy chief Cathy Ashton who is attempting to mediate between the two factions. \nThe parallels between the Carter and Obama presidencies are not accidental. Both men were elected in what amounted to a national rejection of their predecessors. \nNeither candidate had any significant executive experience or foreign policy chops. \nCarter ran on being an honest man – not Tricky Dick Nixon. Obama ran on being likeable and eager to unite the country – not arrogant and divisive George W. Bush. \nBoth men promised change, and fulfilled that promise. Unhappily, they did not always deliver change for the better. \nThe similarities between Obama and Carter are not confined to foreign fiascos. \nDomestically, both have struggled to ignite growth and lower unemployment; both have clung to a profound belief in the powers of deficit spending and efficacy of federal meddling. \nFaced with soaring inflation, Carter imposed price controls that caused rampant confusion and slowed growth; he also introduced gasoline rationing that led the country to quite literally run out of gas. \nThe same urge to tinker bedevils Obama, who cannot understand why consumers do not line up to buy the electric cars that he has required Detroit to manufacture, or why bankrolling uncompetitive “green” energy companies are bets that go bad. \nInstead of searching for private market resolutions to problems like soaring medical costs, Obama chose to funnel even more of the economy through the federal spigot. Who today believes that ObamaCare is the best possible answer to reining in the cost of healthcare? \nOne of the few divides between the Obama presidency and that of Jimmy Carter is that Mr. Obama won reelection. Pity. \nLiz Peek is a writer who contributes frequently to FoxNews.com. She is a financial columnist who also writes for The Fiscal Times . For more visit LizPeek.com . Follow her on Twitter@LizPeek . \n", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}