{"organizations": ["Fox News Putin", "Congress"], "uuid": "24258dd274a9c3c082773c8cf432c1533fe363b1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/09/10/my-fellow-members-congress-let-vote-on-syria-strike-and-bring-obama-back-from/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422626514953.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/10/my-fellow-members-congress-let-vote-on-syria-strike-and-bring-obama-back-from.html", "country": "", "title": "My fellow members of Congress, let's vote on a Syria strike and bring Obama back from Never Never Land | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "My fellow members of Congress, let's vote on a Syria strike and bring Obama back from Never Never Land | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "24258dd274a9c3c082773c8cf432c1533fe363b1"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/10/my-fellow-members-congress-let-vote-on-syria-strike-and-bring-obama-back-from.html", "ord_in_thread": 0, "title": "My fellow members of Congress, let's vote on a Syria strike and bring Obama back from Never Never Land | Fox News", "locations": ["Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Putin is the one who really deserves that Nobel Peace Prize \n[pullquote] \nWhy? It is a religious civil war. It will escalate. There is no imminent U.S. national security interest at stake. \nTuesday night, after failing to gain virtually any support internationally or at home for his cause, the president made one last pitch to the American people. He didn't make the sale. \nThis is personal for the president. It is all about the red line he claims he never drew. \nHe is supposed to be the leader of the most powerful country in the world and his credibility is on the line. \nIn reality, his credibility is long gone. America going to war will not bring it back. As recent events have shown, because his foreign policy in the Middle East is inconsistent at best, he is no longer taken seriously. \nTuesday night, President Obama once again assured Americans that his \"unbelievably small\" limited-but-not-a-pinprick strike will not escalate into a larger war. Yet again, he is promising something he cannot guarantee. \nThe Assad regime may not have the ability to retaliate, but Hezbollah, Russia and Iran do. \nThere are several ways this could play out. They are all bad and they all lead to further escalation and America involved in another war in the Middle East. \nWhat is the goal of this mission? An American strike will not guarantee that Assad will not use chemical weapons again. Chances are he did not empty out his chest the first time. What will we do if he goes for round two, strike again? Some reports say that he has chemical weapons at 50 different sites. \nThe president also focused on the fact that Syria has violated international law. He is referring to the Chemical Weapons Convention signed by all but five nations (including Syria). Where in that treaty does it say that if the treaty is broken, the United States can retaliate unilaterally? More importantly, where are the other 188 nations now? Nowhere to be found. \nTuesday we learned of a possible second \"reset\" with Russia who has offered to help facilitate Syria surrendering its weapons to the international community. \nJust this week, Putin called our chief diplomat a liar, now we are clinging to him for a diplomatic Hail Mary? There is no telling whether Putin and Assad are serious or if President Obama is being duped. \nOf course, Russia's bargaining chip comes with strings attached: a guarantee that America will not strike militarily. \nAre you kidding me? \nPutin may allow the president to save face. In the meantime Russia is replacing the United States as the dominant force and better broker for peace in the region. The Syrian-Russian-Iran axis will be stronger than ever. Well played, Putin. \nFinally, Tuesday night the president arrogantly attempted to take credit for this possible diplomatic Hail Mary by implying that Assad would never have come to the table if it were not for his fake war drums. \nMr. President, come back from Never Never Land. \nAmericans turned off their televisions Tuesday night more confused than ever. The American people do not know still don't know what our foreign policy is in the Middle East. While the president is waiting to make a decision, Congress should go ahead and vote on whether or not to take military action in Syria. \nIt will be soundly defeated. \nMeanwhile, what's the president's next move? \nOnly time will tell. \nAs we have seen, everything can change in ten days. To this White House, \"all options on the table\" means \"I still don't know what to do.\" \nRepublican Ted Poe represents Texas' Second District in the U.S. House of Representatives. He is a member of the Foreign Affairs Committee and serves as chairman of the Subcommittee on Terrorism, Non-proliferation and Trade. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}