{"organizations": [], "uuid": "7340857564315018f5818f26a46ea8bfb69d6da0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3004252/images/o-ALLEN-PEAKE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/420/feed", "section_title": "420 on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/28/allen-peake-medical-marijuana_n_7460040.html", "country": "US", "title": "Conservative State Senator Has Made Some Real Progress In Legalizing Medical Marijuana", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Conservative State Senator Has Made Some Real Progress In Legalizing Medical Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T13:02:00.000+03:00", "replies_count": 0, "uuid": "7340857564315018f5818f26a46ea8bfb69d6da0"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/28/allen-peake-medical-marijuana_n_7460040.html", "ord_in_thread": 0, "title": "Conservative State Senator Has Made Some Real Progress In Legalizing Medical Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Conservative State Senator Has Made Some Real Progress In Legalizing Medical Marijuana Ozy | By Nick Fouriezos reddit \nThis story was originally published by Ozy . \nIt’s a crisp Thursday afternoon in the Deep South — Dallas, Georgia , to be specific, population 11,000. A movie theater is packed with some 50 people angling for a clear sight line to the screen. Presiding over the occasion, before the theater lights dim, is one 54-year-old good Southern boy Allen Peake, who styles himself as a Romney-esque business conservative (minus the Ivy League chin and head full of hair). When the silver screen finally glows, it’s what we’ve all been waiting for: a documentary touting the health benefits of medical marijuana. Confused? Don’t be. State Rep. Peake is a true conservative in all the ways that matter, from immigration to taxation. Except when it comes to toking . As far as that goes, Bible Belt-dwelling Peake leans left. And why? Empathy, he’ll tell you. Not for the stoners , but for the sick. Peake, surprisingly enough, has made some real progress in legalizing medical marijuana. Patients in Georgia now can, thanks to a bill he wedged through in April, legally possess a Gatorade bottle’s amount of cannabis oil to treat seizure disorders, cancer, sickle cell anemia and other diseases. Which has some unlikely allies singing Peake’s — and pot’s — praises, at least medically. “It’s touched my heart,” Gov. Nathan Deal told reporters while he, surprisingly, choked back tears. Peake’s success has helped Georgia become the 36th state to legalize cannabis oil this past session, and the second Southern state to extend access to patients with disorders other than seizures. I asked Peake, a nine-year veteran of the state legislature, why he’s leaning left on this issue. It’s “a personal connection,” says Peake. For him, that connection came in the form of a toddler. Brace yourself for the practiced political storytelling: Peake met Haleigh Cox, a then-4-year-old stricken by dozens of seizures a day, in a Monroe County hospital in 2014. Her best hope, doctors said? Cannabis oil. Just a week before, Peake had emphatically told a reporter that weed was a nonstarter in the Peach State. His conservatism was founded in politics and faith; the former seminarian represents Macon, once colloquially known for having the most churches per capita among all cities in the South. “I was confronted with the question that each of us have to ask — what would I do if this was my child?” wrote Peake, a father of three and grandfather of two, in an April op-ed for Macon’s Telegraph . Which is why he was ready to “spend as much political capital as possible, and whatever political risk there was to find a solution.” And Peake doesn’t have much political capital to spare. He’s not one of the “old boys” of Georgia politics, says The Atlanta Journal-Constitution ’s Jim Galloway, who has covered state politics for three decades. Rep. Allen Peake (right) kisses Haleigh Cox, 5. Source: David Goldman/AP Today Peake sports thin glasses and boasts a runner’s build (half-marathoner) with bland good looks. He began as a bookish accountant whose nighttime reading included nothing more highbrow than David Baldacci and John Grisham thrillers. He turned number crunching into a surprisingly successful chief executive position with RMS Family Restaurants, which became the 10th-largest restaurant franchise in the U.S. in the ’90s, thanks to Southern favorites like Shoney’s, Popeyes and Captain D’s. In other words: He’s not much of a marijuana maverick. This adds to a career of delicate values-juggling. Peake’s platform is compassionate conservative for the South — closed borders, legal work permits; pro-life, but with rape and incest exceptions; no gay marriage but civil unions in some cases. The thing about the history of marijuana policy, though, is that it hasn’t always been such a hot-rod issue. Georgia, in fact, had legalized cannabis research for cancer and glaucoma patients as early as 1980. The weed came from a (federally approved!) pot farm in Mississippi. But when that farm shut down two years later, thus removing a government-rubber-stamped facility from Georgia, the state found itself without a legal supply. The law might have been used, had someone spied it and run with it, though, says Sharon Ravert, executive director of Peachtree NORML, which advocates for legalization. It’s only now, amid a quietly burgeoning progressive moment in the Deep South, that groups are seizing the possibility. And there’s some national traction: a U.S. Senate bill to legalize cannabis oil was just introduced. Of course, there’s not about to be a (legal) toking renaissance in Georgia, says Morgan Fox with the Washington, D.C.-based Marijuana Policy Project. Without a legal in-state facility, Georgia probably can’t get marijuana moved across state lines — the states between Georgia and weed country (ahem, Colorado) “have some of the most draconian marijuana laws in the country,” Fox says. For now, Georgia will have to settle for getting cannabis oil while breaking federal law in the process. And that’s not exactly Wayne’s World . And all this is leaving Peake, an otherwise promising Southern legislator, with a target on his back. He was recently considered a favorite for House majority leader, the third-highest Republican in the state House. “He actually has a really good chance,” The Atlanta Journal-Constitution ’s Galloway told us before the May 11 vote. But rank-and-file Republicans rallied against Peake. He’s professed a desire to run for governor, though, which will happen “sooner rather than later,” Galloway says. There won’t be an incumbent in 2018 … and Peake’s “different direction” conservatism just might be the ticket to the hearts of libertarian-leaning millennials. Also on HuffPost:", "external_links": [], "published": "2015-05-28T13:02:00.000+03:00", "crawled": "2015-05-28T17:35:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}