{"organizations": [], "uuid": "5b118c62ceeac5c271293c68aae69808c5a9af9d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/Politics/0/0/obamamemorialdaywreath.jpg", "site_section": "http://www.foxnews.com/politics/index.html", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/05/25/obama-pays-tribute-to-fallen-heroes-at-arlington/", "country": "US", "title": "Obama pays tribute to fallen heroes at Arlington", "performance_score": 0, "site": "foxnews.com", "participants_count": 8, "title_full": "Obama pays tribute to fallen heroes at Arlington | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-25T03:00:00.000+03:00", "replies_count": 11, "uuid": "4966747a241de1e4ae51b496a9080efccd70e13b"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/25/obama-pays-tribute-to-fallen-heroes-at-arlington/#post-0", "ord_in_thread": 0, "title": "Obama pays tribute to fallen heroes at Arlington", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 25, 2015 FoxNews.com livefyre Email Print May 25, 2015: President Obama, center accompanied by Maj. Gen. Jeffrey S. Buchanan, left, Commander of the U.S. Army Military District of Washington, and Sgt. 1st Class John C. Wirth, right.\nPresident Obama paid tribute on Monday to the nation's fallen service members at Arlington National Cemetery by laying a wreath at the Tomb of the Unknowns and said Americans must “never stop trying to fully repay them” for their ultimate sacrifice.\nSpeaking to military officers, families of the fallen and a crowd of roughly 5,000 gathered under sunny skies, he noted Monday is the first Memorial Day in 14 years that has been observed without U.S. forces engaged in a major ground war.\nThe president said most Americans still don't fully understand the sacrifice of the 1 percent serving in the nation's all-volunteer military.\nHe described Arlington Cemetery as more than a resting place for heroes.\n\"It is a reflection of America itself. A reflection of our history, the wars we've waged for democracy, the peace we've laid to preserve it,\" he said. \"It is a reflection of our diversity, of people from different races and creeds who fought for the ideals that bind us as one nation.\"\nHis appearance was an annual rite for presidents at the site of the national cemetery nestled among the verdant hills overlooking the Potomac River. It came with the number of troops stationed in Afghanistan reduced to about 10,000, from a peak of over 100,000. Monday's tribute also took place against a backdrop of the increasingly complex U.S. effort to help Iraq defeat a surging Islamic State extremist group that has been gaining momentum in recent weeks, capturing Ramadi there and taking Palmyra in neighboring Syria.\nObama said the remaining troops should be removed from Afghanistan by the end of the year, but made no reference to America's participation with others in the effort to beat back Islamic State.\n\"We honor the more than 2,200 patriots who made the sacrifice in Afghanistan,\" he said there. Earlier, troops who are still stationed in that war-worn country paused for a moment of silence in honor of those who lost their lives there.\nThe Arlington observance was among a host of Memorial Day events across the country featuring parades, picnics and tributes. Presaging Monday's solemn event at Arlington was the roar of motorcycle engines throughout the capital Sunday as thousands of bikers saluted veterans with the Rolling Thunder's \"Ride for Freedom.\" That was followed by a concert of patriotic music Sunday evening and Obama's private breakfast at the White House Monday morning with representatives of veteran and military family service organizations, along with the Gold Star Mothers, Gold Star Wives and Sons and Daughters in Touch. A Memorial Day parade was set for downtown Washington Monday afternoon.\n\"Most Americans don't fully see, don't fully understand, the sacrifices of the 1 percent of the Americans who serve in this all-volunteer force,\" Obama said in his speech. \"Our Gold Star families, our military families, our veterans, they know this intimately.\"\n\"Whenever I meet with our \"Gold Star\" families, as I did this morning, I see that their hearts are still broken, but still full of love,\" he said. \"In the face of unspeakable loss, they represent the best of who we are.\"\nThe Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Budget cuts impact US ability to fight the enemy, Air Force general warns 2 ObamaCare fallout: Could the GOP be hardest hit in 2016 election? 3 Sweeping Maryland LGBT measures to take effect without new gov's signature 4 EPA under fire for social media ‘PR campaign’ pushing water regs 5 Hispanic ranchers' case against U.S. Forest Service over grazing rights heats up See all Trends Advertisement", "external_links": [], "published": "2015-05-25T03:00:00.000+03:00", "crawled": "2015-05-26T04:48:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}