{"organizations": ["Fox News Facebook", "AP", "Twitter"], "uuid": "f7a03f7a9475060b5af1a56c5e0bd889af0b91f8", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/01/will-team-obama-ignore-rule-law-and-preemptively-veto-pebble-mine/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422598084643.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/01/will-team-obama-ignore-rule-law-and-preemptively-veto-pebble-mine.html", "country": "", "title": "Will Team Obama ignore the rule of law and preemptively veto Pebble mine? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Will Team Obama ignore the rule of law and preemptively veto Pebble mine? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "f7a03f7a9475060b5af1a56c5e0bd889af0b91f8"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/01/will-team-obama-ignore-rule-law-and-preemptively-veto-pebble-mine.html", "ord_in_thread": 0, "title": "Will Team Obama ignore the rule of law and preemptively veto Pebble mine? | Fox News", "locations": ["Pebble"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Will Team Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print (AP) \nToday in Washington, a landmark environmental law is under attack. Politically motivated groups are pressing the Obama administration to ignore the National Environmental Policy Act and rush a decision on a copper mine in Alaska. \nThis lobbying and PR campaign is probably the greatest threat NEPA has faced since it became law more than 40 years ago, but public awareness is low. \nHow has this threat gone unnoticed? \nProbably because the company proposing the mine – the Pebble Partnership, where I serve as CEO – isn’t the one putting NEPA in danger. \n[pullquote] \nInstead, environmental groups are running the campaign to subvert and evade NEPA. This runs counter to many political stereotypes, I know. But the campaign is real, and if the activists win, the consequences will be felt across the nation. \nThe Pebble deposit, located on state land in southwestern Alaska, is one of the world’s largest copper reserves. \nThis mineral is essential to modern life. It is used in everything from power lines to smartphones to automobiles. The U.S. imports about 35 percent of the copper it needs. \nMy company wants to invest at least $6 billion building the Pebble mine, and we expect it will support roughly 15,000 jobs across the U.S. for three decades and perhaps much longer. \nSo far, we have spent eight years and over $500 million conducting geological, engineering and environmental studies to prepare a formal permit application to state and federal regulators. \nWhen the application is submitted, NEPA will be triggered, subjecting both our mine plan and our environmental safeguards to years of exhaustive review by regulatory agencies, environmental groups and the general public. \nMy company will have to prove that building and operating the mine won’t hurt Bristol Bay’s salmon populations and the region’s commercial fishing industry; that southwestern Alaska can have both fishing jobs and mining jobs. \nIf we can’t clear the high hurdle set by the NEPA process, we won’t get a permit, and there will be no mine. \nBut don’t take my word for it. \nThe New York-based Natural Resources Defense Council calls NEPA an “incredibly successful law” which has “helped preserve some of America’s most treasured places.” \nNRDC President Frances Beinecke hailed NEPA as the “green Magna Carta,” which has “worked well to protect our national treasures and resources.” \nThe NRDC has even fought sensible bipartisan reforms to NEPA, fearing they would put regulatory reviews on the “fast track.” NEPA “works as it stands,” Beinecke says, “and it should stay that way.” \nExcept, that is, when NEPA gets in the way of the NRDC’s agenda. \nTo block the Pebble mine, the NRDC is proposing the ultimate NEPA “fast track.” Rather than wait for my company to apply for a permit, and rely on the “green Magna Carta,” Beinecke and movie star Robert Redford are demanding the Obama administration act now by issuing what’s known as a “preemptive veto.” \nThis unprecedented and legally dubious move would completely circumvent NEPA. \nIt would prevent my company from submitting a permit application, and replace years of painstaking NEPA reviews and due process with a snap political decision. \nIn everyday terms, it would be like a teacher failing a student before they take the exam. \nFor now, the U.S. Environmental Protection Agency hasn’t rewarded the NRDC’s hypocrisy by issuing a premature veto. But the EPA did rush out a “watershed assessment” that speculates about copper mining impacts for Bristol Bay. \nInstead of waiting for our permit application, EPA simply guessed what the mine would look like, assumed my company would use century-old technology and environmental practices, and relied on so-called research from anti-mining advocacy groups like Earthworks. \nThis report is completely unscientific, but predictably, the NRDC says it’s good enough to justify premature action by the EPA. \nThis isn’t just a problem for Alaska. \nIf environmental activists can kill one project by evading the NEPA process, you can bet they will use the same strategy again and again, until it’s routine. \nIn fact, activists are already planning a Bristol Bay-style “watershed assessment” for the Great Lakes, which could be used against all kinds of construction projects in the industrial Midwest. \nThat’s because tens of thousands of other projects nationwide, including highways and housing developments, need the same kind of earthmoving permits as the Pebble mine. \nAccording to consulting firm The Brattle Group , projects that go through this permitting program are worth $220 billion a year to the U.S. economy. \nI respect people’s questions about the Pebble mine. But those questions should be answered according to science, engineering and the law – not the political demands of activist groups. \nJohn Shively is the CEO of the Pebble Partnership and led Alaska's Department of Natural Resources from 1995-2000 under former Democratic Governor Tony Knowles. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}