{"organizations": ["NSA", "Fox News", "Reuters", "New York Times"], "uuid": "a2c067d3bd82794e8dc0e96407c7025f82ce95f0", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/06/07/progressives-must-stand-with-new-york-times-against-obama/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422574295641.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/07/progressives-must-stand-with-new-york-times-against-obama.html", "country": "", "title": "Progressives, Democrats must stand with New York Times against Obama on NSA phone records collection | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Progressives, Democrats must stand with New York Times against Obama on NSA phone records collection | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "a2c067d3bd82794e8dc0e96407c7025f82ce95f0"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/07/progressives-must-stand-with-new-york-times-against-obama.html", "ord_in_thread": 0, "title": "Progressives, Democrats must stand with New York Times against Obama on NSA phone records collection | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "(Reuters) \nWe have arrived at a defining moment for the progressive movement in this nation. \nThe New York Times editorial board, which has generally given this president a lot of leeway throughout his career, wrote a scathing denunciation Friday of the Obama administration’s use of data mining, claiming that “the administration has now lost all credibility\" on the issue of balancing civil rights with national security. \nEvery progressive with even a shred of moral consistency should side with the New York Times against the White House. \nThe events of the past month – from the Associated Press subpoena to the James Rosen search warrant to the revelation that our government has been indiscriminately collecting phone records data – have forced liberals to make a choice between complacency and outrage, between keeping silent because one of our own is in the White House and calling him out on betraying the principles for which we have fought for so long. \n[pullquote] New York Times editorial board says administration has 'lost all credibility' \nConsistency has never been the fiber of political discourse but it is nonetheless a vital ingredient of credibility. \nProgressives rightly denounced the overreach of the Bush administration when it came to abuses of the Patriot Act. We should just as strongly denounce the expansion of those abuses by this administration. \nMany of us did not buy the previous administration’s excuse that overreaching infringement upon the civil rights of ordinary Americans was a necessary step in keeping those same ordinary Americans safe. We should not buy it from this administration now, simply because this president is ostensibly one of us. If this White House truly wanted to level with the American people, the president would have gone on national television to explain the necessity of these programs and the trade-offs between civil liberties and security he believes are consistent with his policies. \nThat he has failed to do this for nearly six years is evidence of the fact that there is likely no excuse for such blanket surveillance upon the American public, aside from the usual “it’s necessary to keep us safe” bromide. Once the shock of 9/11 wore off for a lot of us, it became apparent that our government was happy to use its pretext for all sorts of questionable activity. \nFrom the invasion of Iraq to the nearly unanimous passage of the Patriot Act, elected officials on both sides of the aisle did not hesitate to grab as much power as possible under the guise of national security. \nThis behavior was not limited to one political party or the other – so the criticism of this behavior should not be emanating from one party and not the other. Over the past several days, conservatives have pilloried this administration for a policy that began under the previous one with the mantra that Bush only went after terrorists, while Obama is going after regular Americans. \nThis is as ridiculous as it is false. \nNo one should give any president a blank check to vastly expand executive power based on his word that he is doing it in the national interest. \nThe phone records of millions of Americans have been collected and analyzed by both administrations without any explanation of how violating our privacy protects our security. \nAs progressives, we cannot remain silent when a president, whom we worked hard to elect and defend at every turn, betrays the very values upon which he ran five years ago. \nThe New York Times was right to call out the administration on this, just as others have been right to call out its egregious behavior towards the Associated Press and James Rosen. \nProgressives should stand with the Times on this. Otherwise, we are just rooting for the name on the jersey, and not for the values that the jersey represents. \nJulie Roginsky has extensive experience in government, politics and public relations on both the federal and state levels. She is the president of Comprehensive Communications Group, a public relations and crisis communications firm that counts Fortune 500 corporations, elected officials and non-profit organizations among its clients. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}