{"organizations": ["Immigration Executive Action Texas Court", "White House", "NATO"], "uuid": "2b956c02af4549c575a2f7d2d5b8343bcc337c3a", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2996056/images/o-BARACK-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/26/obama-executive-action_n_7444692.html", "country": "", "title": "Texas Court Refuses To Lift Hold On Obama's Immigration Executive Action", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Texas Court Refuses To Lift Hold On Obama's Immigration Executive Action", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T22:04:00.000+03:00", "replies_count": 0, "uuid": "2b956c02af4549c575a2f7d2d5b8343bcc337c3a"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/26/obama-executive-action_n_7444692.html", "ord_in_thread": 0, "title": "Texas Court Refuses To Lift Hold On Obama's Immigration Executive Action", "locations": ["US", "Washington", "DC", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jens Stoltenberg", "NICHOLAS KAMM", "Barack Obama", "Obama"], "text": "Texas Court Refuses To Lift Hold On Obama's Immigration Executive Action Posted: Updated: 14 minutes ago US President Barack Obama speaks to reporters following a meeting with NATO Secretary General Jens Stoltenberg in the Oval Office at the White House in Washington, DC, on May 26, 2015. AFP PHOTO/NICHOLAS KAMM (Photo credit should read NICHOLAS KAMM/AFP/Getty Images) | NICHOLAS KAMM via Getty Images reddit \nNEW ORLEANS (AP) — A federal appeals court refused Tuesday to lift a temporary hold on President Barack Obama's executive action that could shield as many as 5 million immigrants illegally living in the U.S. from deportation. \nThe U.S. Justice Department had asked the 5th U.S. Circuit Court of Appeals to reverse a Texas judge who agreed to temporarily block the president's plan in February, after 26 states filed a lawsuit alleging Obama's action was unconstitutional. But two out of three judges on a court panel voted to deny the government's request. \nIt wasn't immediately clear if the government would appeal, either to the full appeals court in New Orleans or to the U.S. Supreme Court. \nThe states suing to block the plan, led by Texas, argue that Obama acted outside his authority and that the changes would force them to invest more in law enforcement, health care and education. But the White House has said the president acted within his powers to fix a \"broken immigration system.\" \nU.S. District Judge Andrew Hanen sided with the states and, from his court in Brownsville, Texas, issued a temporary injunction on Feb. 16 to block the plan from taking effect while the lawsuit works its way through the courts. \nJustice Department lawyers sought a stay while they appealed the injunction. They argued that keeping the temporary hold interfered with the Homeland Security Department's ability to protect the U.S. and secure the nation's borders. They also said immigration policy is a domain of the federal government, not the states. \nBut, in Tuesday's ruling, 5th Circuit judges Jerry Smith and Jennifer Walker Elrod denied the stay, saying in an opinion written by Smith, that the federal government lawyers are unlikely to succeed on the merits of that appeal. Judge Stephen Higginson dissented. \nObama announced the executive action in November, saying lack of action by Congress forced him to make sweeping changes to immigration rules on his own. Republicans said Obama overstepped his presidential authority. \nThe first of Obama's orders — to expand a program that protects young immigrants from deportation if they were brought to the U.S. illegally as children — was set to take effect Feb. 18. The other major part, extending deportation protections to parents of U.S. citizens and permanent residents who have been in the country for some years, had been scheduled to begin May 19. \nHanen issued his injunction believing that neither action had taken effect. But the Justice Department later told Hanen that more than 108,000 people had already received three-year reprieves from deportation as well as work permits. Hanen said the federal government had been \"misleading,\" but he declined to sanction the government's attorneys. \nThe Justice Department has also asked the 5th Circuit to reverse Hanen's overall ruling that sided with the states. A decision on that appeal, which will be argued before the court in July, could take months. \nAlong with Texas, the states seeking to block Obama's action are Alabama, Arizona, Arkansas, Florida, Georgia, Idaho, Indiana, Kansas, Louisiana, Maine, Michigan, Mississippi, Montana, Nebraska, Nevada, North Carolina, North Dakota, Ohio, Oklahoma, South Carolina, South Dakota, Tennessee, Utah, West Virginia and Wisconsin. Also on HuffPost: ", "external_links": [], "published": "2015-05-26T22:04:00.000+03:00", "crawled": "2015-05-26T22:04:53.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}