{"organizations": [], "uuid": "48cab2adc5d4bda3d4fc092abe1406c4fc241fb4", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2908382/images/o-CHAFIK-CHRAIBI-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/poverty/feed", "section_title": "Poverty on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/15/abortion-morocco-chraibi_n_7283562.html", "country": "US", "title": "Fearless: Dr. Chafik Chraïbi Is Leading The Charge For Safe, Legal Abortion in Morocco", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Fearless: Dr. Chafik Chraïbi Is Leading The Charge For Safe, Legal Abortion in Morocco", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T13:08:00.000+03:00", "replies_count": 0, "uuid": "48cab2adc5d4bda3d4fc092abe1406c4fc241fb4"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/15/abortion-morocco-chraibi_n_7283562.html", "ord_in_thread": 0, "title": "Fearless: Dr. Chafik Chraïbi Is Leading The Charge For Safe, Legal Abortion in Morocco", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nChafik Chraïbi is a doctor distinguished by his courage. \nThe 59-year-old, born in Fez, Morocco, has devoted years of his distinguished career as an OB-GYN to fighting for safer abortions in his home country. Chraïbi is the president of the Moroccan Association of the Fight Against Clandestine Abortion (AMLAC), and has vocally supported the reform of Morocco’s abortion laws. \nAs Bloomberg Business reported earlier this year: \nThe current regulations punish women undergoing an illegal abortion with prison terms of as long as two years, while doctors performing the operations can be sentenced to 20 years. \nEstimates from AMLAC place the number of illegal abortions performed in Morocco at as many as 600 to 800 per day; for poorer women, these often involve potentially life-threatening methods, such as sharp objects or poison. \nChraïbi, who has worked as an OB-GYN since 1984 and served as vice president of the Royal Moroccan Society of Obstetrics and Gynecology, came under public scrutiny when he participated in French TV channel France 2's December 2014 investigative report into illegal abortions in Morocco. \nOn Jan. 27, 2015, Chraïbi was dismissed from his position as head of maternal health care at the Clinique les Orangers in Rabat, pursuant to a communique by the Moroccan Ministry of Health that condemned Chraïbi’s stance on the need for safe, legal abortions for Moroccan women. \nChraïbi’s dismissal was followed by widespread public condemnation of the Ministry of Health’s actions. A Facebook page created on Feb. 10, “Support For Professor Chafik Chraïbi,” has garnered over 15,000 likes. \nThe public outrage engendered by Chraïbi’s removal sparked a rare discussion about abortion among the Moroccan public -- leading to a proposed law that would ease restrictions on abortion in the country. \nHuffPost Morocco sat down with the outspoken doctor to discuss his life, outlook and thoughts on the next decade. \nWhat would you like to accomplish on a personal level in the next 10 years? \nI’m still hoping to succeed at a project that I have been spearheading for the past 10 years. My main objective is the legalization of abortion. I would also like to open a medically assisted procreation center to help couples that have trouble conceiving. I also yearn for a little more serenity, calm and happiness, in order to free myself of the anxiety that inhabits me. \nWhat was the biggest challenge that you faced last year? \nMaking the world aware of the gravity of the situation of unwanted pregnancies in Morocco. That was an enormous challenge. \nWho has been your role model in your adult life? \nI don’t want to be a king, but I find that Mohammed VI has done a lot for Morocco in these last 15 years. He was very brave, especially about the topic of women and individual rights. After 10 years of appealing through newspapers and communiques that I sent to the Royal Cabinet for the king to take charge of the matter of legalizing abortion, he did it. Given his position as “Commander of the Believers,” I think that it was also a testament to courage on his part. Morocco has also escaped an Arab Spring: The king was smart enough to modify the constitution right away and listen to the people. He’s someone for whom I have a lot of respect because he is so ahead of his time. One way or another, he acts before things can get worse. \nWhat is a topic that you would like the media to cover more or better? \nThe media needs to take a more active interest in the civic education of the population, notably the way that they drive, the unclean condition of the villages, the lack of respect for others, and sexual and verbal harassment. \nWho is the one living person that you admire most? \nI would have said my mother, who really influenced me, but she died. I have always had enormous admiration for my high school French teacher, who is now very old. He taught me everything. He was such an extraordinary person to me that I still have dreams about him. \nAnother person whom I truly admire is [French-Armenian singer] Charles Aznavour. He is someone who has accomplished a lot, and continues to be present, even at his age, through his songs, his poetry, through what he is doing for Armenia and for a number of humanitarian associations. He is a very discreet gentleman -- we are not aware of everything that he does, and his songs are magnificent. \nWhat advice would you give to a young man or woman that is trying to decide what to do with his or her life? \nI always tell young people that we are living in a time where there is no place for mediocrity. That means that you have to excel in your field, you have to be very good. Above all, be committed, be political, be a humanitarian. Make yourself useful. I am very proud and impressed in conferences when I see young people stand up and speak very well. You see that they have ideas, that they are expressing them. \nThe piece of advice that I often give to my students is to first of all avoid mediocrity. Average and mediocre people can’t succeed in today’s globalized world. You absolutely have to be able to integrate yourself and have a place in society. \nWhat is the one thing for which you are most grateful? \nI am very grateful for my job. The topic of abortion has caused me a lot of pain, but has also brought me a lot of satisfaction. Gynecology is a very rewarding profession, because women show a lot of appreciation for their doctor. It’s a profession that gives people a lot of happiness, and they return it as well. It’s true that it’s a stressful job, and when I’m with my medical students, I tell them it is a profession that is as thankless as it is rewarding. It’s a profession that carries with it huge responsibilities, because you’re not dealing with only one person. When you do a delivery, you’re dealing with the mother, the baby and also the family -- notably the husband. We are not entitled to make mistakes. \nHow do you keep informed? \nI keep informed first and foremost through digital publications. They play a very important role for me: I receive alerts on my cell, and I have downloaded a lot of news apps. I also stay informed through radio, especially the cultural stations. I listen to news every half-hour when I’m driving. I also receive alerts from a press agency whenever an article talks about abortion. Finally, I read news in Arabic, which is the most widely read news in Morocco, mostly to read the tone of the articles that cover the topic of abortion. \nWhat’s the cause or the problem that you would like to see resolved in the next 10 years? In the coming months, the law on abortion is going to change. What I fear is that the law might be revised only minimally, meaning that there might only be a small relaxing of the law, which would only authorize abortion in cases of rape, incest or fetal malformation. Those situations only really represent 5 to 10 percent of cases, and the current law already only covers 5 to 10 percent of cases, when life or physical health is put at risk. So what are we going to do with the remaining 80 to 90 percent? That’s the reason why I’d like, in the next 10 years, for us to legalize abortion to protect the lives and health of the mother and baby. If I don’t do it, because I don’t know if I still have the strength to keep fighting, someone else will. \nWhat is the first thing that you do when you wake up in the morning? \nI check my phone to see how many times it rang during the night because I put it on silent. I quickly glance over my emails. Besides that, I used to have a bad habit of jumping out of bed and rushing to the office to attend the staff meeting that takes place every morning at the hospital. But since having been relieved of my duties, I never step foot in that meeting. Now I take my time a bit more. \nWhat do you do to de-stress, recharge your batteries and keep a balance? \nI see my kids when I can, I try to find a balance by going out, seeing my friends, traveling -- even though I travel often for conferences. But I’m having trouble finding an activity from which I can draw a certain serenity, a certain peace. I have trouble recharging my batteries. \nFinish this sentence: In 2025, we will be … \nIn 2025, Morocco will be a completely democratic and developed country. That is what I would like us to be. It’s enough to simply want it because we already have the potential. I use models of countries like the Netherlands. For me, they are a model of freedom and extraordinary democracy. \nHow many hours of sleep do you get every night? How important is sleep to you? \nI sleep well one night out of three. All my friends know me by my even days and my odd days. One night I sleep well, and the next two nights I sleep very badly. I think that getting my seven hours of sleep is very important, but unfortunately I don’t. It’s still a big problem for me. \nWhat do you value the most? \nIt truly is children’s education. I think that it is the biggest success that we can achieve. It is a reflection of your image, and the image of everything that you have done. Civic education, work and accountability are equally important values to me. I hate hypocrisy and when people give false impressions. I prefer to just lay it all out on the table. \nThis article was originally published on HuffPost Maghreb and was translated into English. It was adapted for an American audience. More:", "external_links": [], "published": "2015-05-15T13:08:00.000+03:00", "crawled": "2015-05-15T18:06:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}