{"organizations": [], "uuid": "28f9977c04efcd24182eb386edebefcde781c981", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2910824/images/o-JOE-ARPAIO-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/04/joe-arpaio-lawsuit-obama_n_7206860.html?utm_hp_ref=politics&ir=Politics", "country": "US", "title": "Sheriff Joe Arpaio Continues Fight Against Obama On Immigration", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Sheriff Joe Arpaio Continues Fight Against Obama On Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-05-04T23:05:00.000+03:00", "replies_count": 0, "uuid": "28f9977c04efcd24182eb386edebefcde781c981"}, "author": "Elise Foley", "url": "http://www.huffingtonpost.com/2015/05/04/joe-arpaio-lawsuit-obama_n_7206860.html?utm_hp_ref=politics&ir=Politics", "ord_in_thread": 0, "title": "Sheriff Joe Arpaio Continues Fight Against Obama On Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sheriff Joe Arpaio Continues Fight Against Obama On Immigration Posted: Updated: 11 minutes ago Maricopa County Sheriff Joe Arpaio has criticized the Obama administration's immigration enforcement record. (AP Photo/Ross D. Franklin) | ASSOCIATED PRESS reddit \nWASHINGTON -- The lawyer representing Arizona Sheriff Joe Arpaio told judges on Monday that the courts needed to step up and block President Barack Obama from overstepping his authority on immigration. \nIf they didn't, conservative lawyer Larry Klayman told a three-judge panel at the U.S. District Court of Appeals, \"you're not doing your job.\" \nArpaio sued the president last November after Obama announced executive actions on immigration that could keep as many as 5 million undocumented immigrants from being deported. The policies were meant to supplement an existing program, Deferred Action for Childhood Arrivals, or DACA, that allows undocumented young people who came to the U.S. as children to stay and work on a temporary basis. \nArpaio, an opponent of unauthorized immigration who calls himself \"America's toughest sheriff\" and has been repeatedly accused of racial profiling, contends that DACA has led to more undocumented immigrants being in his jails. \nKlayman argued that the added costs to Arpaio's jails caused by DACA proved he had standing to challenge the policy. He said $9 million had been expended on holding undocumented immigrants since the creation of DACA in 2012. The case was thrown out by a U.S. district court judge in December. \nKlayman said the case was \"not about immigration per se,\" but rather the need to protect the Constitution. Both Republicans and Democrats should be concerned about Obama's overreach, he said. \n\"If you don't like the law, you don't get to change it yourself,\" Klayman said. \nThe judges -- Janice Rogers Brown, Sri Srinivasan and Nina Pillard -- seemed skeptical of Klayman's arguments about Arpaio's standing. Srinivasan and Pillard are Obama nominees, while Brown was nominated by President George W. Bush. \nThe judges asked Klayman whether ending DACA would actually resolve Arpaio's complaint about unauthorized immigrants in his jails. Pillard read aloud from the eligibility requirements for DACA, which is not open to those convicted of felonies, significant misdemeanors or three or more misdemeanors. \nKlayman was insistent that DACA was the culprit, along with a general lack of immigration enforcement -- although the latter is not part of the lawsuit. After the hearing, he said he was unsure how many of the undocumented immigrants in Arpaio's jails since 2012 had been granted DACA. \nHe said during the hearing and in his remarks to the judges that the motives weren't political. Klayman specifically said he'd never heard Arpaio say anything negative about Latinos. As for himself, Klayman said, he is pro-immigration and had been married to a Latina. \nThe judges had a number of questions for Justice Department lawyer Beth Brinkmann, who argued Arpaio lacked the standing to sue over the policies. Brinkmann said there wasn't enough evidence to show causality between DACA and the arrest of undocumented immigrants in Arpaio's district. \nOf the judges, Brown seemed the most sympathetic to Klayman's argument. While questioning Brinkmann, she cited another ruling criticizing the executive actions, and asked whether undocumented immigrants might \"self-deport\" if programs such as DACA weren't in place. Brinkmann countered that since the programs are for people with longstanding ties to the U.S., self-deportation was unlikely. \nObama's actions from November are on hold because of a separate lawsuit brought by 26 states. In that suit, the judge sided with the states, led by Texas, that allowing the executive actions to move forward would create a cost to the states because they would need to handle more drivers' licenses. The preliminary injunction is being appealed at the Fifth U.S. Circuit Court of Appeals. More:", "external_links": [], "published": "2015-05-04T23:05:00.000+03:00", "crawled": "2015-05-04T23:18:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}