{"organizations": [], "uuid": "447d10172cd6b7fbeccc1a4c7898355c514100a5", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2979274/images/o-MARCO-RUBIO-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/lv-politics/feed", "section_title": "Lv Politics on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/21/republicans-immigration-2016_n_7364578.html", "country": "US", "title": "Republicans Hope To Avoid Mitt Romney's Mistakes On Immigration", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Republicans Hope To Avoid Mitt Romney's Mistakes On Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T17:38:00.000+03:00", "replies_count": 0, "uuid": "447d10172cd6b7fbeccc1a4c7898355c514100a5"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/21/republicans-immigration-2016_n_7364578.html", "ord_in_thread": 0, "title": "Republicans Hope To Avoid Mitt Romney's Mistakes On Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Republicans Hope To Avoid Mitt Romney's Mistakes On Immigration Posted: Updated: 11 minutes ago Sen. Marco Rubio (R-Fla.) helped to draft a comprehensive immigration reform bill in 2013, but has since backed away from it. (Photo by Scott Olson/Getty Images) | Scott Olson via Getty Images reddit \nWASHINGTON -- In the summer of 2011, as then-Texas Gov. Rick Perry was preparing to announce his run for the Republican presidential nomination, top aides to former Massachusetts Gov. Mitt Romney set about figuring out how to beat him. \nThey found a potential weak spot: immigration. Perry had expressed some views, such as supporting in-state tuition for certain undocumented immigrants and opposing a border fence , that polled poorly with the GOP base. Although Romney hadn't planned to make immigration a major campaign issue, some aides thought that taking a tougher stance could help his numbers, a former staffer said. \nRomney went after Perry over the in-state tuition law, accusing him of creating a magnet for illegal immigration. Perry didn't end up being the threat the Romney campaign thought he was, and he dropped out of the race. But Romney kept up his hard-liner stance. He infamously said he was in favor of \"self-deportation\" -- that is, making life so hard for undocumented immigrants that they would leave the U.S. voluntarily. \nIn hindsight, Romney's tough talk on immigration appears to have been a mistake. \nRomney eventually won his party's nomination. But he lost the general election to President Barack Obama -- a loss partially attributed to the fact that Romney picked up only 27 percent of the Latino vote. \"Self-deportation\" became shorthand for the type of rhetoric that drives away Latino voters. \nNow, as the 2016 presidential campaign heats up, some conservatives are warning that the current slate of GOP candidates could face the same results with Latino voters if they don't take a softer stance on immigration. \n\"The Romney campaign should be a lesson to everyone running in the primaries this time,\" said the former staffer, who requested anonymity to speak frankly about the campaign. \"You have to handle the issue [of immigration] sensitively. You have to do it in a way that doesn't alienate voters in the general election -- unless you'd like to lose.\" \nImmigration isn't the top issue for most Latino voters, according to polling. But it is a personal one, because many Latinos know at least one undocumented immigrant . \n\"What you say about immigration is a matter of the heart for us,\" said Daniel Garza, executive director of the LIBRE Initiative, a group that touts conservative values to Latino voters. \"It's how we judge your character. It's how we judge your compassion.\" \nSo far, GOP candidates haven’t made immigration into a major campaign issue. \"It's not being addressed, unfortunately,\" said Sen. John McCain (R-Ariz.), who supports immigration reform. Earlier this month, Democratic candidate and former Secretary of State Hillary Clinton promised to continue the deportation relief policies that Obama announced last year, and indicated that she might even expand them. Members of the Republican field had called the president's deportation relief unconstitutional and said they would end it, but few of them spoke out about Clinton’s remarks. \nFormer Florida Gov. Jeb Bush and Florida Sen. Marco Rubio, who have advocated for reform in the past, are currently doing the best job of appealing to Latino voters, conservative operatives told HuffPost. Bush has said he wants to end Obama's deportation relief programs and replace them with broad immigration reform that would allow undocumented immigrants to stay in the U.S. Rubio has backtracked on the comprehensive reform bill he helped draft in 2013, but says he would still favor legal status for undocumented immigrants -- once border security is addressed. \nAlfonso Aguilar, director of the Latino Partnership at the pro-reform American Principles Project, said he thinks Latino voters are open to candidates who say border security must come first. Aguilar said he would even give some points to Texas Sen. Ted Cruz, an ardent opponent of so-called \"amnesty,\" based on his praise of legal immigration. \nWisconsin Gov. Scott Walker is a different case. Walker may have already hurt his standing with Latino voters by zigzagging his position on immigration -- first supporting a path to citizenship, then saying he opposed one, and later implying that even legal immigration rates are too high, according to Aguilar. \n\"I think he's already done with Latino voters because of that statement questioning immigration, whether it depresses wages,\" Aguilar said. \"I mean, that's it, he's gone off the deep end... Of the top-tier candidates, Walker is the one that has really, really, really stepped on it.\" \nOn Tuesday, Walker argued to Fox News that he wasn't actually flip-flopping, because his past statements in support of citizenship for undocumented immigrants were a) not votes and b) not made while he was a national politician working on the issue. But that doesn't mean the \"flip-flopper\" criticism won’t stick. \nNew Jersey Gov. Chris Christie opened himself up for a similar line of attack this week when he said on Fox News that he had changed his mind and now thought a path to citizenship would be \"an extreme way to go.\" \nPerhaps the most consistent voice on immigration among Republican hopefuls has been South Carolina Sen. Lindsey Graham, who worked with McCain and Rubio on the 2013 immigration bill. Graham said this week that the GOP would lose again if it didn't \"wake up\" on immigration and accept that a comprehensive approach is the only way to get Democratic votes. \nAfter the 2012 election, the Republican National Committee released a report advising the GOP to \"embrace and champion comprehensive immigration reform\" to appeal to Latinos and other voters. Some time later, RNC Chairman Reince Priebus called Romney's \"self-deportation\" line \"a horrific comment to make\" and said it hurt the party. \nPriebus said this year that Republicans are for immigration reform, but said the details of reform won't become clear until the primary. Meanwhile, the RNC has \"completely revamped\" its ground game with Latinos, said Ruth Guerra, the RNC's director of Hispanic media. \n\"With 18 months to go, we are confident that Republican presidential candidates will address and provide solutions to the biggest challenges facing our country including a real fix to our broken immigration system,\" Guerra said in an email. \"Hispanics are not monolithic and in spite of Democrats wishing otherwise, education, jobs and healthcare continue to be our top issues.\" \nStill, there's plenty of time left for this election's Republican contenders to have their own \"self-deportation\" moments. \n\"We're going to wait for the debates and then see what is said,” Garza said. Also on HuffPost:", "external_links": [], "published": "2015-05-21T17:38:00.000+03:00", "crawled": "2015-05-22T00:29:15.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}