{"organizations": [], "uuid": "8688878615b7a974a03eafc6f2a31f005a82da22", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/13/what-exactly-is-your-foreign-policy-mr-obama/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422605349359.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/13/what-exactly-is-your-foreign-policy-mr-obama.html", "country": "", "title": "What exactly is your foreign policy, Mr. Obama? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "What exactly is your foreign policy, Mr. Obama? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "8688878615b7a974a03eafc6f2a31f005a82da22"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/13/what-exactly-is-your-foreign-policy-mr-obama.html", "ord_in_thread": 0, "title": "What exactly is your foreign policy, Mr. Obama? | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama warns GOP over threats to ObamaCare \n[pullquote] \nWeren't we assured that Iran wants nuclear power only to provide electricity to its people? Have we learned nothing from past behavior? \nTyrants lie and Islamic tyrants are instructed to lie to \"infidels\" by their \"holy book\" in the pursuit of earthly objectives, even world domination, according to some interpretations of the Koran. \nAs the Times reports: \"[Iran] is fond of declaring its near self-sufficiency in uranium supplies for its disputed nuclear program. As with many announcements by Tehran, however, those claims have only a slender basis in reality. It does have substantial uranium deposits and its largest uranium mine was opened recently amid great fanfare, but deposits are of poorer quality than those found elsewhere.\" \nEnter Mugabe, whose struggling economy has recently begun to show signs of life. \"The European Union only recently lifted sanctions against 81 officials and eight companies in Zimbabwe,\" notes Times writer Michael Evans. \"These sanctions imposed in 2002 for human rights abuses and political violence remain in force ...\" Sanctions have not deterred Iran in its pursuit of a nuclear weapon. \nWhat now? \nThere is talk of a response by the \"international community,\" which is neither international in its thinking nor a community in its fight against terrorism. As usual, any response will have to come from the United States, NATO and/or Israel. \nGiven President Obama's ordered withdrawal from corrupt Afghanistan and U.S. public opinion mostly opposed to additional \"foreign entanglements,\" it falls to the president to lead. Leading is not something Obama has done well. \nConsider his failed \"outreach\" to the Muslim world and his equally ineffective \"reset\" with Russia. In 2009, then-Secretary of State Hillary Clinton produced a red button, which she and Russian Foreign Minister Sergey Lavrov, pressed. The Russian word for \"reset\" was wrongly translated as \"overloaded.\" Was that prophetic symbolism? \nCan anyone articulate this president's foreign policy and point to where it is working? \nIn a column for the Sunday Telegraph titled, \"Obama's not to be trusted on foreign policy,\" Janet Daley writes, \"But there must be at least a glimmering of doubt even in Europe -- where the Obama presidency has been given an absurdly easy ride -- that America, too, is adrift in the post-Cold War landscape: that it no longer has any clear conception of its global role.\" Endless speeches by the president are not a policy. \nIt bears restating that the Ayatollah Khomeini believed in the strength and resolve of Ronald Reagan. That is why on the day of Reagan's 1981 inauguration he released 52 American hostages held for 444 days. Strong individuals deter bullies. Strong nations deter enemies and keep the peace. \n(Readers may e-mail Cal Thomas at tcaeditors@tribune.com.) \nCal Thomas is America's most widely syndicated op-ed columnist. He joined Fox News Channel in 1997 as a political contributor. His latest book is \" What Works: Common Sense Solutions for a Stronger America \" is available in bookstores now. Readers may email Cal Thomas at tcaeditors@tribune.com. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:14:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}