{"organizations": [], "uuid": "e7ddb169ec28eb7c996a7bf435357115fc3b35e3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_020215getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/house/241668-113-republicans-back-lawsuit-against-obamas-immigration-actions", "country": "US", "title": "113 Republicans back lawsuit against Obama's immigration actions", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "113 Republicans back lawsuit against Obama's immigration actions", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T00:23:00.000+03:00", "replies_count": 0, "uuid": "e7ddb169ec28eb7c996a7bf435357115fc3b35e3"}, "author": "Mike Lillis", "url": "http://thehill.com/homenews/house/241668-113-republicans-back-lawsuit-against-obamas-immigration-actions", "ord_in_thread": 0, "title": "113 Republicans back lawsuit against Obama's immigration actions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "113 Republicans back lawsuit against Obama's immigration actions Getty Images By Mike Lillis - 05/11/15 05:23 PM EDT \nTop Republicans in Congress on Monday entered the court battle over President Obama's latest moves to ease deportations for immigrants living in the country illegally. \nTexas and 25 other states have challenged the legality of the unilateral actions, arguing that the president overstepped his executive power with programs halting deportations and granting work permits to certain groups of illegal immigrants. ADVERTISEMENT The Republicans, including Senate Majority Leader Mitch McConnell (Ky.) and House Judiciary Committee Chairman Bob Goodlatte (Va.), are siding squarely with the states, arguing Obama's executive action \"changes the law and sets a new policy, exceeding the executive’s constitutional authority and disrupting the delicate balance of powers.\"\n\"Congress has created a comprehensive immigration scheme — which expresses its desired policy as to classes of immigrants — but the class identified by the [Homeland Security Department] directive for categorical relief is unsupported by this scheme,\" the lawmakers wrote in an amicus brief filed with the 5th Circuit Court of Appeals in New Orleans. \n\"Instead of setting enforcement priorities,\" they added, \"it created a class-based program that establishes eligibility requirements that, if met, grant unlawful immigrants a renewable lawful presence in the United States and substantive benefits.\" \nThe brief was endorsed by 113 Republicans, including Sens. John Cornyn (Texas), the majority whip, and Ted Cruz (Texas), a 2016 presidential hopeful. In the House, the supporters include Reps. Trey Gowdy (S.C.); Tom Price (Ga.); Michael McCaul (Texas), head of the Homeland Security Committee; and Lamar Smith (R-Texas), the former head of the Judiciary panel. \n\"[T]he President has unlawfully granted amnesty to millions who came here illegally,\" Cruz said Monday in a statement. \nThe White House was quick to fire back, noting that hundreds of voices — ranging from states to Democratic lawmakers to businesses groups — have filed their own legal briefs supporting the executive actions.\"Though these individuals and groups come from different backgrounds and perspectives, they’re all in agreement that President’s actions are good for public safety and good for the economy,\" an administration official said in an email. \nThe court fight centers on a pair of executive actions taken by Obama shortly after November's midterm elections. \nOne, known as the Deferred Action for Parental Accountability (DAPA) program, would halt deportations and offer work permits to the parents of U.S. citizens and permanent legal residents. The other would expand Obama's 2012 program — the Deferred Action for Childhood Arrivals (DACA) initiative — to a greater number of immigrants brought to the country illegally as kids. \nAll told, the programs could defer deportation for more than 4 million illegal immigrants. \nThe states sued the administration over the programs, arguing they mark a case of executive overreach that would saddle them with exorbitant new costs. \nIn February, U.S. District Judge Andrew S. Hanen, of Brownsville, Texas, found that the states had a legitimate basis to bring their case. He also blocked the programs temporarily for what he deemed a violation of the federal law allowing public comment when new rules are established. \nHanen has yet to weigh the merits of the challenge, but his initial decision prevents the administration from moving forward with the programs, including the processing of applications. \nObama and Capitol Hill Democrats have hammered that decision, saying the executive actions are well within the president's powers and will eventually be authorized by the courts. \nThe administration has appealed Hanen's temporary injunction, arguing their case before the 5th Circuit last month. The court has yet to rule on the challenge. \nThe Republicans' amicus brief argues that the injunction should remain in place while the courts weigh the underlying case. \n\"President Obama’s decision to ignore the limits placed on his power and act unilaterally to rewrite our nation’s immigration laws are an affront to the Constitution,\" Goodlatte said Monday in a statement. \n\"Such lawlessness must be stopped so that we preserve the separation of powers in the Constitution and protect individual liberty.\" \nJordan Fabian contributed.", "external_links": [], "published": "2015-05-12T00:23:00.000+03:00", "crawled": "2015-05-12T01:24:08.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}