{"organizations": [], "uuid": "c2bc3d93ab76f9e75ac6d119263eaaebd7421917", "thread": {"site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150430114716-iphone-lock-screen-620xa.jpg", "site_section": "http://rss.cnn.com/rss/money_topstories.rss", "section_title": "Business and financial news - CNNMoney.com", "url": "http://money.cnn.com/2015/05/19/technology/apple-google-obama-phone-encryption/index.html", "country": "US", "title": "Apple and Google to Obama: Hands off our phones! - May. 19, 2015", "performance_score": 3, "site": "cnn.com", "participants_count": 8, "title_full": "Apple and Google to Obama: Hands off our phones! - May. 19, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T16:51:00.000+03:00", "replies_count": 7, "uuid": "233a9797e62c869eda3062e79aa0552552b4acc8"}, "author": "David Goldman", "url": "http://money.cnn.com/2015/05/19/technology/apple-google-obama-phone-encryption/index.html#post-0", "ord_in_thread": 0, "title": "Apple and Google to Obama: Hands off our phones! - May. 19, 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why Snowden chose John Oliver Four dozen tech companies, including Apple, Google, Facebook and Microsoft, are pleading with President Obama to keep the government out of citizens' smartphones and emails. \"Strong encryption is the cornerstone of the modern information economy's security,\" the companies wrote in the letter, which was delivered Tuesday morning. The letter was first reported by the Washington Post .\nApple ( AAPL , Tech30 ) made waves last year when it encrypted customers' iPhones, making law enforcement's task of obtaining the data on a suspect's iPhone more arduous. An iPhone's password is the only thing that can break the encryption, meaning that even if police have a warrant, they still need to enter the passcode to find out what's on the phone.\nGoogle ( GOOGL , Tech30 ) allows customers to encrypt their Android phones, but it has not followed through with its promise to encrypt Android devices by default. But Google is among many companies that have recently begun encrypting customers' online communications, including email.\nThe Obama administration has complained loudly about tech companies' encryption policies, arguing that they serve an obstacle to tracking down terrorists and other criminals , including pedophiles. The FBI has pushed tech companies to create back doors in their software, giving law enforcement a way to bypass the encryption.\nBut, in the letter to Obama, tech companies, policy experts and civil rights organizations asked the president not to support any bill that would hand law enforcement a master key to customers' communications.\n\"We urge you to reject any proposal that U.S. companies deliberately weaken the security of their products,\" the letter said. \"We request that the White House instead focus on developing policies that will promote rather than undermine the wide adoption of strong encryption technology. Such policies will in turn help to promote and protect cybersecurity, economic growth, and human rights, both here and abroad.\"\nThe letter suggests that providing a backdoor to communications will lead to security threats and undermines citizens' rights and desires for privacy.\nThe White House appears to be fighting a losing battle against encryption. Tech companies are aligned in support of it, and Congress has scoffed at the FBI's suggestion that it should be granted carte blanche access to citizens' communications in order to catch criminals.\nThe tide began to turn against government snooping in 2013, after Edward Snowden first revealed the great extent to which the National Security Agency accesses our emails, phone records and taps into phone and video chats.\nEncrypting phones and emails is a forceful response. But the truth is that law enforcement can pretty easily obtain a password to break through the encryption -- even if a smartphone owner is unwilling to give up the code.\nA four-digit code can be cracked with just 10,000 guesses on average, according to Matt Blaze, one of the nation's top encryption experts. That can take a computer a matter of seconds to achieve, giving police access despite the encryption.\nRelated: Super-sneaky malware - linked to the NSA - found in companies worldwide\nRelated: FBI lets suspects go to protect 'Stingray' secrets\nCNNMoney (New York) May 19, 2015: 8:51 AM ET", "external_links": [], "published": "2015-05-19T16:51:00.000+03:00", "crawled": "2015-05-19T17:05:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}