{"organizations": ["Fox News Obama"], "uuid": "2fad4def72ad4e0644a0e17287ea8745abd05337", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/102313/0/0/102313_hannity_care_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/24/mr-obama-it-not-software-that-problem-it-big-government-liberalism.html", "country": "", "title": "Mr. Obama, it's not the software that's the problem, it's Big Government liberalism | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mr. Obama, it's not the software that's the problem, it's Big Government liberalism | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "2fad4def72ad4e0644a0e17287ea8745abd05337"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/24/mr-obama-it-not-software-that-problem-it-big-government-liberalism.html", "ord_in_thread": 0, "title": "Mr. Obama, it's not the software that's the problem, it's Big Government liberalism | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama in wonderland -- HealthCare.gov mess isn't a 'glitch' it's a disaster \nThe ObamaCare website is just the latest illustration of how liberalism promises to fix problems if we just spend enough money, but actually leaves a bigger mess than when it started. \nThe fact is Big Government liberalism is crashing all around us, not just in America but around the world (just ask anyone living in Greece or France or Venezuela). \nWhen a computer system crashes beyond repair, it produces what software programmers call the “blue screen of death.” \nWe are now living in the era of Blue Screen Liberalism, and this website debacle epitomizes the Obama administration’s record on virtually everything else. \nFor example, unemployment. People point out that after spending $634 million, ObamaCare still can’t get a website that works. \nAfter spending almost a trillion dollars in economic stimulus, borrowing trillions more from the Chinese and others, and three waves of printing money disguised as quantitative easing, we all got an economy that so far this year barely registers growth over 1% , with the lowest employment participation rate since the 1970's–a far better guide to what’s happening to the job market than the formal unemployment rate. \nIn fact, under Obama for every three Americans over sixteen earning a paycheck there are two who aren’t even looking for work–90 million of them and counting. \nThen there’s Obama’s record on income inequality. \nAfter four years bemoaning the widening gap between rich and poor, and raising income taxes and expanding programs for the poor including food stamps, fully ninety-five percent of the income gains during the Obama years have gone to the top 1 percent of earners–that’s compared to 65% during the Bush years. \nAt the same time we’ve got 2.7 million more Americans living in poverty than in 2009, and fourteen million more on food stamps–the most in American history. \nFinally of course there’s the looming train wreck of ObamaCare itself, that was supposed to cost less than $900 million but now, according to the Congressional Budget Office, will cost double that over the next decade, or $1.8 trillion -- and don’t be surprised if that estimate doesn’t continue to roll upwards. \nAnd that’s just the beginning. The numbers of people getting kicked off their employers’ health care plans and dumped into the exchanges is going to soar once the moratorium on the employee mandate ends next year, and millions more are going to find out that the “affordable” health care options ObamaCare gives them will cost far more than they were ever told, with deductibles of $6,000 and more. \nSo forget the ObamaCare website. What we really need is a solution to Blue Screen Liberalism, one that fixes a permanently broken app for governance, namely Obama’s, and hits the \"Refresh\" button for the American dream. \nHistorian Arthur Herman is a senior fellow at the Hudson Institute in Washington, D.C. He is author of seven books, including New York Times bestseller \"How the Scots Invented the Modern World\" (2001); the Pulitzer Prize Finalist \"Gandhi and Churchill\"(2008); \"To Rule the Waves: How the British Navy Shaped the Modern World\" (nominated for the UK's Mountbatten Prize); and the highly acclaimed \"Freedom's Forge: How American Business Produced Victory in World War II,\" which The Economist magazine picked as one of the Best Books of 2012. His most recent work is \" The Cave and the Light: Plato Versus Aristotle, and the Struggle for the Soul of Western Civilization \" (Random House 2013). Follow him on Twitter@ArthurLHerman . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:11:50.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}