{"organizations": [], "uuid": "ff6dfe0b873b7c70ed21cb802a23379431c96582", "thread": {"site_full": "mexico.cnn.com", "main_image": "http://mexico.cnn.com/thumb/2015/05/27/obama_300x169.jpg", "site_section": "", "section_title": "", "url": "http://mexico.cnn.com/mundo/2015/05/27/las-acciones-migratorias-de-barack-obama-en-la-incertidumbre", "country": "", "title": "Las acciones migratorias de Barack Obama, en la incertidumbre", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Las acciones migratorias de Barack Obama, en la incertidumbre", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "ff6dfe0b873b7c70ed21cb802a23379431c96582"}, "author": "", "url": "http://mexico.cnn.com/mundo/2015/05/27/las-acciones-migratorias-de-barack-obama-en-la-incertidumbre", "ord_in_thread": 0, "title": "Las acciones migratorias de Barack Obama, en la incertidumbre", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Economía Las acciones migratorias de Barack Obama, en la incertidumbre Incluso si los tribunales fallan a favor de Obama, sus acciones migratorias entrarían en efecto dentro de meses o incluso años Por Kevin Liptak Miércoles, 27 de mayo de 2015 a las 19:07 Si una corte falla a favor de las medidas migratorias de Obama, los migrantes podrán empezar a aplicar para las deportaciones este verano (GettyImages/Archivo ). Lo más importante La administración de Obama dijo que no le pedirá a la Suprema Corte que reconozca las acciones ejecutivas migratorias Si la corte decide que la ley puede esperar, podría tomar años para que las acciones entren en vigor Aunque la Suprema Corte ha fallado a favor de Obama, todavía habría un nivel de incertidumbre entre los solicitantes inmigrantes Temas relacionados Obama aplica medida que beneficia a indocumentados ¿Cambios en el sistema de migración en EU? \n(CNN) — Meses después de que el presidente de EU, Barack Obama, anunciara nuevas acciones de alivio migratorias, emergieron nuevas dudas sobre cuándo —y si alguna vez— estas medidas tomarán efecto. \nLa administración de Obama dijo este miércoles que no le pedirá a la Suprema Corte de EU que reconozca las acciones ejecutivas controversiales, y optó por esperar a una corte más baja para decidir si las nuevas reglas pueden entrar en efecto o no. \nSi esa corte decide a favor de Obama, millones de migrantes indocumentados que puedan beneficiarse del programa podrán empezar a aplicar para las deportaciones tardías este verano. Pero si la corte decide que la ley puede esperar, podría tomar años para que las acciones migratorias entren en vigor. \nPara la frustración de Obama y sus aliados, las reglas, que incluyen una amplia lista de protecciones para la deportación y nuevas pautas de permiso de trabajo, han sido instaladas desde febrero en una batalla iniciada por gobernadores republicanos en una corte. \nSegún los cálculos de la Casa Blanca, cerca de 5 millones de inmigrantes indocumentados que habrían sido elegibles para el programa estarán en el abandono. \nLee: Corte federal de EU paraliza acciones migratorias de Barack Obama \nEn la página de la Ciudadania y Servicios Migratorios de Estados Unidos, había aplicantes potenciales que podían confirmar su elegibilidad para una deportación tardía. \nEn el sitio web de Ciudadanía e Inmigración de Servicios de Estados Unidos, donde los solicitantes potenciales pueden comprobar su elegibilidad para una deportación tardía, se lee una leyenda en letras rojas: \n\"Debido a una orden de la corte federal, (la agencia) no comenzará a aceptar solicitudes… a partir del 18 de febrero como estaba previsto originalmente”. \nNo se ofrece ningún día del comienzo del programa. \nA un año y medio de que deje la presidencia, Obama se enfrenta a un reloj de arena en la promulgación de la que muchos de sus colaboradores y simpatizantes esperaban que formaría una parte importante de su legado. \nCon la reforma migratoria legislativa, casi inconcebible, de cara a las elecciones presidenciales, surgen nuevas dudas sobre si las acciones de Obama estarán listas para cuando él deje la oficina en enero de 2017. \nEl gobierno dijo el miércoles que no le estaba pidiendo a la Corte Suprema revertir la decisión de un panel federal de apelaciones que el martes se negó a levantar un freno sobre las acciones de inmigración. \n\"El Departamento de Justicia se compromete a tomar las medidas que resolverán el litigio de inmigración lo antes posible con el fin de lograr una mayor rendición de cuentas a nuestro sistema de inmigración, dando prioridad a la deportación de los peores delincuentes, no a las personas que tienen grandes lazos con los Estados Unidos y que están criando a niños estadounidenses\", dijo Patrick Rodenbush,un portavoz del Departamento de Justicia. \n\"El departamento cree que la mejor manera de lograr este objetivo es centrarse en la apelación en curso sobre el fondo de la propia orden preliminar\". \nUn alto funcionario del gobierno dijo que, aunque la Suprema Corte ha fallado a favor de Obama –permitiendo que las acciones de inmigración vayan hacia adelante— todavía habría un nivel de incertidumbre entre los solicitantes inmigrantes en cuanto a la situación del programa. \nDado que se esperan los argumentos orales sobre el mandato original en julio, por un grupo diferente de la misma Corte de Apelaciones del Quinto Circuito, la medida cautelar podría regresar a su lugar si el panel decide detenerla. \nEl gobierno no ha descartado ir a la Suprema Corte si la orden es confirmada por el Quinto Circuito después de los argumentos de julio \nIncluso si los tribunales fallan a favor de Obama, sus acciones migratorias no entrarían en efecto sino hasta dentro de meses, sino es que años. Encuentra este artículo con: obama, acciones migratorias, corte, suprema corte Hazte fan de CNNMéxico en Facebook y síguenos en Twitter para estar actualizado de lo más relevante en México y el mundo. { \"comments\": \"\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n \\r\\n\\r\\n ", "external_links": [], "published": "2015-05-27T03:00:00.000+03:00", "crawled": "2015-05-28T11:09:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}