{"organizations": [], "uuid": "de12446e67cb71931ceac271d651f870d7f948b4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/02/make-no-mistake-mr-obama-iran-rouhani-is-no-moderate/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422577360447.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/02/make-no-mistake-mr-obama-iran-rouhani-is-no-moderate.html", "country": "", "title": "Make no mistake, Mr. Obama, Iran's Rouhani is no 'moderate' | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Make no mistake, Mr. Obama, Iran's Rouhani is no 'moderate' | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "de12446e67cb71931ceac271d651f870d7f948b4"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/02/make-no-mistake-mr-obama-iran-rouhani-is-no-moderate.html", "ord_in_thread": 0, "title": "Make no mistake, Mr. Obama, Iran's Rouhani is no 'moderate' | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print The U.S. may be hoping Iran's new president-elect, Hasan Rowhani, shown here in front of a portrait of the late Iranian revolutionary founder Ayatollah Khomeini, will be amenable to talks. (AP) (AP2013) June 16, 2013 - Photo released by the official website of the Iranian supreme leader's office, supreme leader Ayatollah Ali Khamenei, left, speaks during his meeting with President-elect Hasan Rowhani in Tehran, Iran. (AP) Aug. 2, 2013 - An Iranian cleric holding an anti-Israeli placard chants slogan, while attending an annual pro-Palestinian rally marking Al-Quds (Jerusalem) Day in Tehran, Iran. Thousands of Iranians marched in support of Muslim claims to the holy city of Jerusalem. (AP) Previous Next \nWho doesn't want the inauguration Sunday of Iran's new President Hassan Rouhani, to mark a new era of \"moderation\"? After all, his smiling face alone adorning the front page of The New York Times should come as a welcome change to the snarly, disheveled sneer of his predecessor Mahmoud Ahmadinejad. \nBut does Hassan Rouhani’s “moderation” begin or end with his smile? \nIs the charm offensive just a façade or the real thing—that could help improve the lives of the Iranian people and perhaps dial back the Middle East from the abyss of nuclear confrontation? \n[pullquote] \nDr. Samuel Johnson once described second marriages as “the triumph of hope over experience.” But baseless optimism does not an effective Iranian policy make. Facts do. More On This... Team behind Iran's new president comes with Western accent \nHere’s a look at Rouhani’s past. \nThe 64- year old president’s credentials date back to the Iranian Revolution of 1979. An early supporter of Ayatollah Ruhollah Khomeini, he followed Khomeini into in exile in Paris and returned with him to Tehran. \nA protégé of Iranian President Akbar Hashemi Rafsanjani(1989-1997), Rouhani became the Secretary of Iran’s powerful Supreme National Security Council in 1989, continuing in that position under Rafsanjani’s successor President Mohammad Khatami (1997-2005). \nHe was Iran’s top nuclear negotiator with the EU3—Britain, France, and Germany—from 2003-2005. \nThese various \"postings\" if you will, offer important insights into the man and his mission. \nFirst, when faced with 1999 student protests (which prefigured Iran’s 2009 unsuccessful “Green Revolution”), Rouhani warned “yesterday we received a decisive revolutionary order to crush mercilessly and monumentally” and led the resulting crackdown, demanding that those arrested be executed. \nSecond, he won plaudits at home as “the Diplomat Sheikh” for successfully running the negotiations clock even as Tehran’s nuclear program continued to expand and for successfully dividing the U.S. and the E.U. with a strategy admirers called “widen the transatlantic gap.” \nThese “accomplishments” along with his close personal relationship with Supreme Leader Ali Khamenei-- the real power in Iran—help account for the May 2013 purge 680 of 688 candidates for president by Iran’s Guardian Council. \nRouhani’s patron, former President Rafsanjani, who is considered a “conservative pragmatist”, and Mohammad Reza Aref, the only real reformer in the race, dropped out under pressure. \nThis left Rouhani, the eventual winner, as the only remaining “moderate” candidate in a race that U.S. Secretary of State Kerry called “hardly an election by standards which most people in most countries judge free, fair, open, accessible, accountable elections.” \nRegarding foreign policy -- and especially Iran’s potential leveraging its nuclear clout, here is what Rouhani’s mentor, “moderate” President Rafsanjani said in 2001: \n“If one day ... the Islamic world will be equipped with weapons available to Israel now ... the employment of even one atomic bomb inside Israel will wipe it off the face of the earth but would only do damage to the Islamic world.” \nSince he won election, Rouhani continues to support the embattled regime of Bashar al-Assad in Syria, declaring that Assad “has constantly been on the frontline of fighting Zionism and this resistance line must not be weakened.” \nSo now what? \nFor starters the Obama administration should signal its support for the millions of Iranians desperate for real change. \nMost important, for policymakers to remember, is that politically and legally, Supreme Leader Ali Khamenei remains the ultimate authority in Iran. It is he, not Rouhani who directly controls the country’s nuclear destiny. \nIt is telling that Khamenei and has already forbidden the future president from making any concessions to the West and who recently rejected a U.S. offer for bilateral talks made by Vice President Joe Biden. \nAnd on the nuclear threat, Israel Prime Minister Benjamin Netanyahu got it right on a recent edition of \"Face the Nation\": \n“I think we’ve spoken many times, President Obama and I, about the need to prevent Iran from getting nuclear weapons. I know that is the U.S. policy. \n\"What is important to convey to them [Iran], especially after the elections, that that policy will not change and that it will be backed up by increasingly forceful sanctions and military action. \nIn my view, there is a new president in Iran. He believes—he’s criticizing his predecessor for being a wolf in wolf’s clothing. His strategy is -- be a wolf in sheep’s clothing. Smile and build a bomb.” \nOn the eve of his inauguration, \"moderate\" Rouhani sent this message to Israel and the world: The Jewish state \"has been a wound in the body of the Islamic world for years and should be removed\". Ahmadinejad or Rouhani. It makes no difference: Tehran's nuclear zero hour spins closer and closer. \nRabbi Abraham Cooper is associate Dean of the Simon Wiesenthal Center in Los Angeles. Follow the Simon Wiesenthal Center on Facebook and on Twitter . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:14:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}