{"organizations": [], "uuid": "7faf2539975ab40718002ca16104b96dc864404e", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/08/irs-scandal-hits-3-month-mark-where-accountability-mr-obama/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422603008796.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/08/irs-scandal-hits-3-month-mark-where-accountability-mr-obama.html", "country": "", "title": "IRS scandal hits 3 month mark -- where's the accountability, Mr. Obama? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "IRS scandal hits 3 month mark -- where's the accountability, Mr. Obama? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "7faf2539975ab40718002ca16104b96dc864404e"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/08/irs-scandal-hits-3-month-mark-where-accountability-mr-obama.html", "ord_in_thread": 0, "title": "IRS scandal hits 3 month mark -- where's the accountability, Mr. Obama? | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous Next \nSaturday, August 10 marks the third month of the IRS scandal. \nOn May10, when Lois Lerner, the former Director of the IRS Exempt Organizations Division, answered a question at a legal conference – a question she arranged to have asked in advance -- she clearly had no idea what would happen next. \nWhen she admitted that the IRS had targeted conservative groups, simply because of their political beliefs, she touched off a national firestorm. Her inept attempt to apologize for the Agency’s blunder, and put it to rest, backfired. \nIn the past three months, we have learned that the Obama administration repeatedly tried to downplay this unlawful targeting scheme which is an unprecedented breach of the public’s trust by the IRS. \n[pullquote] \nWe also know that the scandal continues to expand. And we know that the Obama administration is doing very little to get to the bottom of what happened, despite the president's promise to the American people that the administration would “hold the responsible parties accountable.” \nToday, after all this time, it’s clear that the Obama administration isn't really interested in the facts about how this could happen at the IRS or about holding anyone accountable. \nIn fact, President Obama has moved on, calling the IRS targeting scheme a “phony” scandal and acting as if corrective action has been taken and problem solved. \nNot so fast. \nFrom the beginning, the facts did not square with the excuses offered up to the American public by the Obama administration. \nIt did not take long to punch holes in the IRS’ story that the scheme to target conservatives began in a small office run by just a couple of rogue agents. \nIn our lawsuit against the IRS, on behalf of 41 conservative organizations in 22 states, the evidence is very clear: documents have revealed that IRS offices coast-to-coast were involved in the scheme, including Lois Lerner herself! In fact, she sent more than a dozen letters to conservative organizations asking them intrusive and inappropriate questions. \nThe White House has also claimed that the unconstitutional targeting of conservative organizations ended in May 2012. Again, our documents clearly show that the IRS abuse continued through May of 2013 with the most recent letter dated May 6, 2013 – just four days before Lerner's admission. \nAnd we now know, thanks to the testimony of former IRS attorneys, that the office of the IRS Chief Counsel (a political presidential appointee) was involved in the scheme, too. This testimony raises important questions about President Obama’s knowledge or involvement in the scheme. \nNow, there’s new information to suggest that the IRS may have been providing taxpayer information to the Federal Election Commission, something that violates federal law and the IRS's own regulations. \nAn FEC commissioner says he has seen previously undisclosed emails between the IRS and FEC about the targeting scheme. And lawmakers are now demanding the FEC turn over records of more than five years of communications with the IRS. \nAll of this information comes as the Obama administration continues to stonewall Congress about the scandal -- providing just a fraction of the information requested. \nNoting the three month mark since the scandal began, Reps. Darrell Issa (Calif.) and Dave Camp (Mich.), chairmen of the House committees on Oversight and Ways and Means have voiced their concern, saying in a statement, “The American people demand and deserve accountability from their government, not to live in fear of being subject to an audit or other extra scrutiny for reasons unrelated to the content of their filing. So far, the IRS and this administration have provided no assurances that oversight and accountability is in place to prevent such abuses from happening again.” \nThe president did order the new Acting IRS Commissioner Daniel Werfel to conduct a 30-day review of the IRS scandal. Yes, you read that right, just a 30-day review to investigate a scheme that had been underway for years . It’s no surprise that Werfel claims the 30-day review turned up no “evidence of intentional wrongdoing by anyone in the IRS.” \nIt’s been 3 months since the American public learned about this outrageous behavior by the IRS. No one has been fired. Lerner and a handful of others are on leave and still being paid. \nAnd what has happened to the investigations underway by the FBI and Department of Justice? Three months later, not one of our clients has been contacted by investigators at the FBI or Justice Department. \nIt’s difficult to imagine how anyone could claim that a thorough investigation -- or any investigation for that matter – has been conducted without even bothering to interview the taxpayers who were targeted. \nSo, the IRS scandal continues. It’s been three months and counting. The last three months have produced many more questions and very few answers. \nWhere’s the accountability, Mr. President? \nJay Sekulow is Chief Counsel of the American Center for Law and Justice (ACLJ), which focuses on constitutional law. He is a New York Times bestselling author. Jay's latest book \" UNDEMOCRATIC: How Unelected, Unaccountable Bureaucrats Are Stealing Your Liberty and Freedom \" will be published on May 19. He hosts \"Jay Sekulow Live\" -- a daily radio show which is broadcast on more than 850 stations nationwide as well as Sirius/XM satellite radio. Follow him on Twitter @JaySekulow . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:54.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}