{"organizations": [], "uuid": "9f449ce905f6975c6fe1232ba54e7dde569edd50", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/042215_hn_Emanuel_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/05/12/hill-showdown-set-in-trade-battle-between-senate-dems-obama/", "country": "US", "title": "Senate showdown set in trade battle between Dems, Obama", "performance_score": 10, "site": "foxnews.com", "participants_count": 9, "title_full": "Senate showdown set in trade battle between Dems, Obama | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T03:00:00.000+03:00", "replies_count": 8, "uuid": "2edf02a823d4c220adbaf61f42bd5a3be5fd194b"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/12/hill-showdown-set-in-trade-battle-between-senate-dems-obama/#post-0", "ord_in_thread": 0, "title": "Senate showdown set in trade battle between Dems, Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published May 12, 2015 FoxNews.com livefyre Email Print\nPresident Obama squares off Tuesday against the liberal flank of his party as Senate lawmakers hold a key test vote on the president's trade agenda.\nMore than any issue in recent years, Obama's push for expanded powers to advance trade deals has divided Democrats, with many top-ranking lawmakers openly opposing the White House.\nSenate Minority Leader Harry Reid, D-Nev., has given reporters a firm \"hell no\" on the proposal. And Obama and Sen. Elizabeth Warren, D-Mass., for days have traded jabs on the matter, with the president calling Warren's claims \"absolutely wrong.\"\nThe test vote, expected to come sometime Tuesday afternoon, is specifically on the president's request for expanded powers to advance trade deals -- in this case, a broad pact with Pacific nations -- and will offer the first official tally of how deep the Democratic insurrection goes. Sixty votes are needed to advance the measure, and while most of the 54 Republicans are expected to vote yay, Obama still will need some Democratic help -- and many are talking tough.\n“We will hold back votes on cloture,” one senior Democratic aide told Fox News, referring to the procedural vote Tuesday afternoon.\nSenate Democratic Whip Dick Durbin, D-Ill., said most Democratic senators are inclined to vote no at this stage. Democratic lawmakers and pro-union groups argue such deals take away U.S. jobs.\nFor the administration, falling short on Tuesday’s vote would sting, and possibly build momentum for opponents. But the pro-trade forces would likely try again this year, possibly under better conditions.\nBy the same token, starting the full debate this week is no guarantee of success. Labor unions, liberal groups and others vehemently oppose the legislation. It faces \"poison pill\" amendments, showdowns over \"currency manipulation\" and, eventually, similar confrontations in the House.\nLobbying for and against the legislation hit overdrive this week. Key groups scheduled almost hourly events on Capitol Hill ahead of Tuesday afternoon's expected vote. Obama devoted much of the weekend to trade, visiting a Nike plant in Oregon and pointedly criticizing a leading Democratic foe, Warren, in an interview with Yahoo News. Obama maintains that U.S. goods and services need better access to the 95 percent of world consumers who live in other countries.\nObama seeks \"fast track\" authority that would let him present Congress with proposed trade agreements it can ratify or reject, but not amend. If successful, he's likely to ask Congress to approve the Trans-Pacific Partnership being negotiated with 11 other countries, including Japan, Vietnam, Canada and Mexico. Other free-trade proposals could follow.\nWhile Obama’s toughest resistance comes from fellow Democrats, at least some of the 54 GOP senators appear likely to oppose the president Tuesday, requiring him to hunt for even more Democratic supporters.\nSeveral Democrats say they will back fast track only if Republican leaders clear a path for three other trade measures. One, to renew the African Growth and Opportunity Act, is uncontroversial.\nThe second calls for Trade Adjustment Assistance, which provides federal aid to workers displaced by trade agreements. Republicans don't like it, but reluctantly acknowledge it's the price for winning even modest Democratic support.\nThe third bill, involving Customs enforcement, is the stickiest. It includes a measure to take actions against countries that keep their currency artificially low, which makes their exports more attractive. The Obama administration opposes the \"currency manipulation\" measure, saying it could invite international challenges to the Federal Reserve's policies meant to boost the economy.\nLate Monday, Senate leaders were sparring over how to \"package\" the four trade bills.\nMajority Leader Mitch McConnell, R-Ky., said in a Senate speech, \"It's incredibly important for American workers that we pass this bill.\"\nDemocratic opponents urged wavering colleagues to vote against McConnell on Tuesday -- even if they might support fast track in the end -- to force Republicans to deal first with a surveillance measure that Democrats consider more pressing. That strategy suggests Obama might have better luck on trade in a month or so, should he fall short in Tuesday's vote.\nFox News’ Chad Pergram and Kara Rowland and The Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 State Department OK'd most Bill Clinton speech requests within days 2 Federal judge agrees to reopen Hillary Clinton email lawsuit 3 Krauthammer on Morell: \"Most telling statement is what he says about Benghazi\" 4 It's official: Obama library will be on Chicago's South Side 5 Ex-CIA leader Morell critical of Obama administration colleagues See all Trends Advertisement", "external_links": [], "published": "2015-05-12T03:00:00.000+03:00", "crawled": "2015-05-12T17:56:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}