{"organizations": [], "uuid": "f8b2d37516c5a1b3723f529a9835639a2b6fc5f2", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/container_021115getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/senate/242615-senate-moves-closer-to-passing-obama-trade-bill", "country": "US", "title": "Senate moves closer to passing Obama trade bill", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate moves closer to passing Obama trade bill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T03:39:00.000+03:00", "replies_count": 0, "uuid": "f8b2d37516c5a1b3723f529a9835639a2b6fc5f2"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/senate/242615-senate-moves-closer-to-passing-obama-trade-bill", "ord_in_thread": 0, "title": "Senate moves closer to passing Obama trade bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate moves closer to passing Obama trade bill By Alexander Bolton - 05/19/15 08:39 PM EDT \nThe Senate is moving toward an up-or-down vote on fast-track legislation, as anti-trade Democrats have failed to muster enough support to delay it. \nSenate Majority Leader Mitch McConnell (R-Ky.) was expected to file cloture on the measure Tuesday, setting up a vote to cut off a Democratic filibuster on Thursday and final passage soon after. ADVERTISEMENT Passing fast-track through the Senate would give the bill momentum after it stumbled badly last week. President Obama is pushing hard for the legislation, even battling with members of his own party, but it remains unclear whether fast-track can clear the House.\nThe White House on Tuesday threatened to veto the bill if it included language sponsored by Sens. Rob Portman (R-Ohio) and Debbie Stabenow (D-Mich.) on currency manipulation. \nMcConnell, who has aligned himself with Obama on trade, said he would work to defeat Portman’s amendment and others he deemed poisonous to getting legislation signed into law. \nSenior Democratic aides conceded Tuesday that fast-track would likely pass by the end of the week despite efforts by Senate Minority Leader Harry Reid (D-Nev.) to extend the debate into June. \nReid has worked closely with his deputy, Sen. Charles Schumer (N.Y.), expected to become the top Senate Democrat in 2017, to demand a lengthy debate on amendments. \nSenators have offered more than 150 amendments, but only a handful will receive votes, far fewer than Reid and Schumer wanted. \nYet they are unlikely to be able to keep the caucus unified against proceeding to a final vote on Thursday because the leaders of a group of about 15 Democrats who support free trade, Sens. Ron Wyden (Ore.) and Patty Murray (Wash.), are expected to vote for cloture, Democratic staffers say. \nSenate Democrats had a lengthy debate over strategy at their weekly lunch meeting Tuesday, but left the ornate Lyndon Baines Johnson room, located just off the Senate floor, with little consensus. \n“We had a caucus today, and there was a robust discussion there,” Reid said, declining to predict whether he would have enough support to delay a quick final vote. “We’ll have to see when the vote takes place on Thursday.” \nWyden and Murray both declined to say how they would vote, but Democratic aides say they are expected to support moving to final passage before Congress’s Memorial Day recess unless McConnell completely shuts down floor consideration of amendments. \n“What I have been focused on is trying to get up and get votes on as many Democratic amendments as possible,” Wyden said. \nMurray declined to comment, noting the cloture vote “is two days away.” \nMcConnell has played up his warming relationship with Obama in recent days and they teamed up Tuesday to fight off the bipartisan amendment on currency manipulation. \nMinutes after White House press secretary Josh Earnest said the president would veto fast-track if it included the controversial currency language, McConnell drew a hard line of his own. \n“There is a veto threat from the administration if that amendment is adopted,” McConnell said of the Portman-Stabenow proposal. “We want to see a completed trade promotion authority bill that can become [law]. We’d like to send a bill to the House that’s in a form that they can take up and deal with so we’ll be working hard to keep any amendments off the bill that would defeat the bill.” \nEarnest said the Portman-Stabenow plan would undermine the independence of the Federal Reserve to set currency rules. \nIt would require that future trade agreements include enforceable currency provisions. \nThe veto threat appeared to surprise Portman, who told reporters before the lunch that his amendment had a good chance of passing. \n“Josh Earnest was asked explicitly about that and he gave an answer that indicated it is not a veto threat,” Portman said, making reference to a White House press briefing from last week. \nWyden, the senior Democrat on the Finance Committee, said the Portman-Stabenow amendment will get a floor vote and pledged to offer an alternative, with Senate Finance Committee Chairman Orrin Hatch (R-Utah), that would give colleagues political cover to vote against it. \nPortman, who is a Democratic target in the 2016 elections, said their counter proposal would “have no teeth.” \nMcConnell also signaled he would block an amendment reauthorizing the Export-Import Bank, which Sen. Maria Cantwell (D-Wash.) wants addressed. \n“It shouldn’t be on [fast-track] because that would be another undue burden to [fast-track], which has been a challenging enough exercise as you know already,” he said. \nAnother notable amendment is one sponsored by Portman and Sen. Sherrod Brown (D-Ohio), who has helped lead liberal opposition to fast-track, that would help the steel industry fight back against unfair foreign trade practices. \nIt was not scheduled for a vote at press time. \nSupporters worry that if fast-track gets mired in the Senate until June, it will give labor unions and other outside groups more time to wage a grassroots opposition campaign and diminish the bill’s momentum heading to the House. Many on Capitol Hill believe fast-track doesn’t yet have the votes to pass the lower chamber. \nSen. Elizabeth Warren (D-Mass.), who has a huge following on the left and has shown she won’t shy away from a fight with Obama, has already started to lobby House Democrats to oppose fast-track. \nThirteen Senate Democrats, including Wyden and Murray, voted last week to end a filibuster backed by Reid and Schumer and begin the trade debate, giving McConnell a pool of allies across the aisle to move to final passage this week. Tags:", "external_links": [], "published": "2015-05-20T03:39:00.000+03:00", "crawled": "2015-05-20T04:26:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}