{"organizations": [], "uuid": "e13a746ea7de74ba12eab9fb331ee18d5dae2dab", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2915016/images/o-TOM-WHEELER-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/elections-2016/feed", "section_title": "Elections 2016 on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/05/the-obama-administration-_0_n_7214008.html", "country": "US", "title": "The Obama Administration Could Limit Secretive Political Ads Before 2016. Will It?", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The Obama Administration Could Limit Secretive Political Ads Before 2016. Will It?", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T15:43:00.000+03:00", "replies_count": 0, "uuid": "e13a746ea7de74ba12eab9fb331ee18d5dae2dab"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/05/the-obama-administration-_0_n_7214008.html", "ord_in_thread": 0, "title": "The Obama Administration Could Limit Secretive Political Ads Before 2016. Will It?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Obama Administration Could Limit Secretive Political Ads Before 2016. Will It? Posted: Updated: 8 minutes ago Federal Communications Commission Chairman Tom Wheeler testifies before the House Judiciary Committee. | Chip Somodevilla via Getty Images reddit \nWASHINGTON -- Congressional Democrats are pressuring President Barack Obama's Federal Communications Commission to require super PACs and other secretive groups that buy political advertisements to disclose their major funders in those ads. Along with consumer advocates and a former FCC commissioner, some Democrats contend that the agency doesn't need congressional authorization to force super PAC donors to reveal their identities. But it's unclear whether the agency's top dog will have the appetite to act in the face of stiff Republican opposition. \nThanks to the rise of super PACs, Americans don't always know who is paying for political attack ads on TV and radio. In one particularly confusing example, a California vintner spent over $1.2 million in 2013 backing a Republican candidate behind the veil of a super PAC called \"Americans for Progressive Action.\" Prominent Democrats, including presidential contender Hillary Clinton, have promised to reform secretive campaign spending. \nLast week, House Democrats introduced the Keeping Our Campaigns Honest (KOCH) act, a not-so-subtle jab at the billionaire Koch brothers, whose political network plans to spend almost $900 million on the 2016 presidential and congressional races. The bill directs the FCC to revise its rules to force groups that fund broadcasts dealing with politics or other controversial issues of \"public importance\" to disclose the names of \"significant donors.\" The legislation, unsurprisingly, doesn't have support from the men who inspired it. \n“This is little more than an effort to limit First Amendment free speech through a regulatory agency’s actions,\" said Mark Holden, senior vice president and general counsel for Koch Industries. \"It is unconstitutional and should be dead on arrival in Congress.\" \nHolden is right that the legislation is very unlikely to succeed in the Republican-controlled Congress. But a number of consumer advocates argue that the FCC can act independently. Michael Copps, a former FCC commissioner who is now a special adviser at the citizens' lobbying group Common Cause, said that the agency has authority under the Communications Act of 1934 to enforce more disclosure in political advertisements. The law already requires that political ads disclose the \"true identity\" of sponsors. According to Copps, FCC Chairman Tom Wheeler could use the standard rulemaking process to force super PACs and similar groups to disclose their funders in attack ads. \n\"Here is something that could be done in time for the 2016 elections,\" Copps said. \"You don't have to wait for Congress to pass a law.\" \nHe added, \"I think it would be great -- it doesn't solve, obviously, the outrageous role of money in our political campaigns, but it would bring transparency.\" \nThe FCC has come under this sort of pressure before. In 2011, the Media Access Project, a now-defunct public interest group, petitioned the FCC to do exactly what Copps is suggesting. In 2013, the Government Accountability Office issued a report that urged the FCC to update its sponsorship identification rules. But the top researcher on that report declined at the time to speculate whether the FCC had the legal authority to require political donor disclosures. \nDemocrats also say the FCC could act without Congress. According to The Hill , Rep. John Yarmuth (D-Ky.), who sponsored the KOCH Act, told FCC Chairman Tom Wheeler that \"if it is not successful -- this legislation -- I would hope the FCC would look carefully at what it can do in its existing authority to provide transparency.\" \n\"It's very important for the FCC to consider this,\" Rep. Anna Eshoo (D-Calif.), a sponsor of the bill, told The Huffington Post. \"Whether they will or not, I can't tell you that.\" \nWheeler's office declined to comment for this story. \nIt's not clear whether Wheeler wants to take on this fight. He's just finished a nasty battle with Republicans over the FCC's decision in February to pass strong open Internet rules, which led some Republicans to threaten to go after the agency's funding. \n\"I don't see Wheeler acting on this on his own,\" said an industry executive who follows FCC issues and requested not to be named to preserve his working relationships. \"It would just escalate [the] actions of the Republicans on the Hill ... It's hard for me to see Wheeler wanting to escalate right now.\" \nRepublicans have previously gone after the FCC over campaign finance rules. In 2013, when Democrats pushed the agency to independently implement the requirements of the DISCLOSE Act, which similarly asked for disclosure of major donors, Republican senators wrote to the agency warning it not to \"weigh in on a partisan political dispute.\" Later that year, Sen. Ted Cruz (R-Texas) stalled Wheeler's confirmation, only relenting after Wheeler reportedly assured Cruz that implementing disclosure requirements without congressional action was \"not a priority.\" \nYet since Wheeler took over, the agency has proposed requiring radio broadcasters, as well as cable and satellite TV providers, to publicly disclose more details about airtime bought online by political candidates. And Wheeler hasn't backed down on contentious issues like net neutrality. \n\"He's demonstrated with net neutrality that he's willing to follow the facts and stand up to opposition from corporations and many Republicans ... if a certain decision is right for American consumers,\" said Kurt Walters, campaign manager at the activist organization Rootstrikers. \"My hope is that [in this case] he'll follow the facts.\" \nCopps acknowledged that \"like anything worthwhile, this would be a battle.\" But he added, \"I don't think outside of Washington, D.C., this is really a partisan issue.\" More:", "external_links": [], "published": "2015-05-05T15:43:00.000+03:00", "crawled": "2015-05-05T20:00:37.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}