{"organizations": ["Brandenburg Gate", "Coal | Fox News Facebook", "Twitter"], "uuid": "259effede2a7212343efe9634d81d6af90d43948", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/06/25/obama-declares-war-on-coal/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422581920267.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/25/obama-declares-war-on-coal.html", "country": "", "title": "Obama declares a War on Coal | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama declares a War on Coal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "259effede2a7212343efe9634d81d6af90d43948"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/25/obama-declares-war-on-coal.html", "ord_in_thread": 0, "title": "Obama declares a War on Coal | Fox News", "locations": ["Berlin", "Berlin Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Martinez Monsivais", "Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print President Barack Obama speaks in front of the iconic Brandenburg Gate in Berlin Germany, Wednesday, June 19, 2013. Obama is planning a major push using executive powers to tackle the pollution blamed for global warming in an effort to make good on promises he made at the start of his second term. \"We know we have to do more and we will do more,\" Obama said in Berlin. (AP Photo/Pablo Martinez Monsivais) (AP2013) \nSo much for the denials. An administration that throughout its 2012 election campaign denied it was waging a War on Coal has now come out and publicly declared its intention to shut down coal-fired power plants – putting hundreds of thousands of Americans out of work and sending electricity prices skyrocketing. \nThis is not what the American people voted for. \nResponding to a White House petition to end the War on Coal, the administration said : “The President has made clear that he understands that coal has played a critical role in our country’s energy portfolio for decades and will continue to be an important source of energy in the future.” \nSycophantic liberal media outlets (like The Nation and the Associated Press ) went further, repeatedly claiming that the War on Coal was a myth. The Obama campaign even ran a TV ad in Ohio claiming that Mitt Romney would be bad for coal – and trotted out former Democratic Gov. Ted Strickland to deny there was a war on coal and echo the attacks on Romney. \nYet today Obama political consultant David Plouffe took to Twitter to bang his chest : “Today's climate announcement underscores that elections matter greatly” – as if Obama had campaigned on shutting down coal plants instead of on denying his intention to do so. \nSuch denials are no longer necessary. Today a top Obama global warming adviser told The New York Times the denials were just election-year politics. Daniel Schrag said : “Politically, the White House is hesitant to say they’re having a war on coal. On the other hand, a war on coal is exactly what’s needed.” \nAnd Obama delivered. It’s right there on page 19 of his Climate Action Plan : “Going forward, we will promote fuel-switching from coal to gas for electricity production.” \nIndeed, Obama made clear in his speech that he intends to impose regulations on existing coal plants that can only be met through carbon capture and storage (technology that doesn’t exist on a commercial scale), switching to natural gas, or shutting down completely. \nCoal still produces 37 percent of U.S. electricity. A Heritage Foundation analysis found that implementing Obama’s proposed regulation on existing coal plants would destroy more than 500,000 jobs, slash the income of a typical family of four more than $1,400 a year, and increase electricity prices at least 20 percent. Price spikes could be much higher in states that depend heavily on coal-fired power plants, especially in the Midwest. President Obama once famously explained that he intended to make electricity prices “necessarily skyrocket.” \nObama intends to fight his War on Coal by issuing a Presidential Memorandum to the EPA to issue regulations under the 1970 Clean Air Act. This is despite the fact that the law’s principal author, Democrat John Dingell of Michigan, famously said: “This is not what was intended by the Congress and by those of us who wrote the Clean Air Act. We are beginning to look at a wonderfully complex world, which has the potential for shutting down or slowing down virtually all industry and all economic activity and growth.” \nRegulating existing coal plants also has the additional legal problem of arguably being pre-empted by last year’s set of War on Coal regulations under a different section of the act. \nAnd there is zero global warming benefit to go with all the economic costs, because even if all United States greenhouse gas emissions were shut down to zero tomorrow, the rest of the world would keep on puffing. Paul Knappenberger recently calculated , based on standard assumptions, that getting to zero emissions in the U.S. immediately would only reduce global average temperatures an imperceptible 0.08 degrees Celsius by 2050. Moreover, the rest of the world would replace all U.S. emissions within seven years. \nSo it’s all pain and no gain. By legally dubious means. To accomplish the opposite of what Obama promised on the campaign trail. Congress should take exception to being circumvented and step in to stop Obama’s (now-declared) War on Coal. \nYou can urge them to do so through the www.WarOnCoal.com action page. \n", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}