{"organizations": [], "uuid": "fd3392be659fd3fb95f448916eeb0bdb374503b8", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2926688/images/o-MARIJUANA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/hpl/feed", "section_title": "Hpl on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/26/charlo-greene-pot-legalization-african-americans_n_7445572.html", "country": "US", "title": "Why This Activist Wants More African Americans To Push For Legal Marijuana", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Why This Activist Wants More African Americans To Push For Legal Marijuana", "spam_score": 0.0, "site_type": "news", "published": "2015-05-26T21:30:00.000+03:00", "replies_count": 0, "uuid": "fd3392be659fd3fb95f448916eeb0bdb374503b8"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/26/charlo-greene-pot-legalization-african-americans_n_7445572.html", "ord_in_thread": 0, "title": "Why This Activist Wants More African Americans To Push For Legal Marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What It's Like Inside A Legal Weed Shop of   The photo at the top of this story is a little misleading -- that was during a party on 4/19, when there was a line out the door for $10 grams and gigantic joints whose price tags were cut to $4.20. THIS is how many of the state's bud cafes look on the outside. It's a little unnerving when you first arrive. Green Lady Marijuana, for instance, shares its building with a tire shop, and it's all next to a state patrol office. It's not seedy inside, by any means, but walking in for the first time makes some new customers feel a little guilty -- like walking into a porn shop on a main street. \"It was definitely weird the first time, heck, I can't even tell my daughter I was here,\" said one 53-year-old customer, who only gave her name as Donna. \"I feel more at ease than when I used to get marijuana illegally, but there's still that little adrenaline rush when you walk out of a store with a bag of pot cookies and a joint.\" This is where they vet customers. Employee Jasmine Hargrove, 25, told The Huffington Post that it would be a problem to let everyone else in at once. \"We like to give a more personal experience with your bud-tender -- some people are just now learning what they want,\" she said. \"Plus there is security, because we do deal with a very in-demand product and we deal with a lot of cash.\" You show a security guard your ID -- you have to be 21 to buy weed in Washington state -- and you sit in this waiting room for about 5 minutes. That's when you learn that people from all walks are buying sticky icky. Everyone from your high school friends to the suit-and-tie business man is in that waiting room. There are truffles and cookies, chocolates and popcorn. But no Funyuns, man. Not YET. There's a minor catch to the whole ordeal -- the price. You're likely paying a premium at $15-20 a gram, but customers said they'd rather have it readily available and legal than pay a few bucks less. Would you go into a legal weed shop in your area?  Share", "external_links": [], "published": "2015-05-26T21:30:00.000+03:00", "crawled": "2015-05-27T02:46:00.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}