{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "51a77617afa851186f35de2731464d7b27cd4449", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/060113/0/0/060113_ANHQ_Obama_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/03/barack-obama-is-still-amateur-president.html", "country": "", "title": "Barack Obama is still an amateur president | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Barack Obama is still an amateur president | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "51a77617afa851186f35de2731464d7b27cd4449"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/03/barack-obama-is-still-amateur-president.html", "ord_in_thread": 0, "title": "Barack Obama is still an amateur president | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nThe other day, I received an email from a conservative friend who owns a summer home in the Hamptons on the East End of Long Island, the playground of the mainstream media and the leftwing Hollywood crowd. \nIt seems that when he went to his local bookstore in the Hamptons to buy a copy of the recently released paperback edition of my book \"The Amateur: Barack Obama in the White House,\" the salesman behind the counter turned up his nose and told him, “We don’t stock that book!” \n“How can you not stock a book that was No. 1 on The New York Times best-seller list for six straight weeks?” my friend asked. \nAnd this is what the salesman replied: “Our customers would be upset if we put that book on display.” \n[pullquote] Scandals impacting Obama's push for Dems to take back House? \nAnd there, I submit, you have an example of why the liberal chattering class and its cohorts in the mainstream media have chosen to bury their heads in the sand and find excuses for Barack Obama as he tries to wriggle out of responsibility for the perfect storm of scandals—Benghazi, the IRS, and the Department of Justice’s warrants against journalists—that are bearing down on his White House and threatening to derail his second term. \nLiberals can’t handle the truth about Obama, which is that the Obama of his second term is a far different political animal than the Obama of the first term. \nRecall that on the eve of Obama’s reelection campaign, he looked into the mirror and realized he could lose. \nHe had suffered one crushing setback after another. \nHe had taken a shellacking in the 2010-midterm elections. He had barely recovered from that drubbing when the Republicans handed him a humiliating defeat over the summer of 2011 budget ceiling negotiations. Standard & Poor’s downgraded the U.S. federal government’s credit rating for the first time in history. \nOn top of all that, the economic recovery that he had been promising was just over the horizon had stalled once again (unemployment remained stubbornly stuck above 9 percent) and the president’s approval ratings were heading below 50 percent, toward what his chief political strategist David Axelrod considered the unelectable zone. \nAxelrod told Obama that he couldn’t run on his record. Nor could he run a retread of his 2008 idealistic hope-and-change campaign. If he wanted to win in 2012, he had to get down in the gutter and do whatever it took to win. \n“The 2012 campaign saw Obama transform himself into an absolute amoral politician,” said Henry Sheinkopf, the well-known political consultant. “He did everything that the other side was doing and he did it worse. The spots that the Obama campaign aired—some of them are absolute lies. It didn’t matter. The direct mail that got dropped—absolute lies. It didn’t matter. Winning was all that counted. \n“Whether you agreed with him or not, the Obama you saw in 2008 actually believed that winning for people was what was appropriate,” Sheinkopf continued. “He was going to create income equality because it was the right thing. He was going to fix the tax structure because it was the right thing. But that’s not the guy who ran in 2012. That guy had nothing to lose and everything to gain. He’s no longer the idealist. He’s a calculating, cold as steel pol.” \nAfter he won, Obama’s second term began on a note of naked hubris. \nDuring his Second Inaugural Address and his State of the Union Speech, Obama promised to transform America into a European-style nanny state through a surge of liberal programs that would require more taxes and more spending. \nAt the same time, he decided he could only achieve his goals by extending his scorched earth campaign style by stigmatizing his enemies—namely, anyone who disagreed with him. \nThis permanent campaign explains the bullying, divisiveness, and extreme partisanship that, despite Obama’s brief charm offensive, have typified the operation of the White House since Obama’s reelection. \nIt also explains how Obama set the tone for the rest of his administration, which led to the scandals that are now engulfing his White House. \nAnd so, coming off an ugly, divisive campaign, America is getting not just four more years of Obama, but four scandal-scarred worse years. \nEdward Klein is the former editor-in-chief of The New York Times Magazine. His latest book is \" Blood Feud: The Clintons vs. the Obamas \" (Regnery 2014). His previous book \" The Amateur: Barack Obama in the White House \" (Regnery 2012) was a bestseller and is no available in paperback. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}