{"organizations": [], "uuid": "886ac27c60036dad521858f276b9a63da9134ead", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/080813/0/0/stegall_fthood_080813.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/15/hasan-vs-victims-obama-white-house-betrays-ft-hood-heroes.html", "country": "", "title": "Hasan vs. victims -- Obama White House betrays Ft. Hood heroes | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Hasan vs. victims -- Obama White House betrays Ft. Hood heroes | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "886ac27c60036dad521858f276b9a63da9134ead"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/15/hasan-vs-victims-obama-white-house-betrays-ft-hood-heroes.html", "ord_in_thread": 0, "title": "Hasan vs. victims -- Obama White House betrays Ft. Hood heroes | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nThe Obama administration is turning its back on America’s heroes. \nThere are few symbols more powerful than the Purple Heart. Whether displayed next to a carefully-folded flag on a mantle, on a fraying old uniform at a veteran’s parade, or even on a license plate designating the driver as “combat-wounded,” the Purple Heart is synonymous with service and sacrifice. \nFor the families of the slain, Purple Hearts are treasured heirlooms, not only preserving the memory of the fallen but providing deep meaning to their sacrifice, a meaning that harkens back to the Gospel of John: “Greater love hath no man than this, that one lay down in his life for his friends.” \nFor the combat-wounded living, the Purple Heart is more than a symbol, entitling veterans to health care and benefits a grateful nation provides those who’ve bled in her service. \n[pullquote] Court-martial of Nidal Hasan continues \nSo it is both a moral and practical betrayal that the Pentagon has thus far denied a Purple Heart to the casualties of Nidal Hasan’s November 5, 2009 terrorist attack. Hasan murdered 13 people and wounded dozens of others that day. \nNo credible person can deny that it was, in fact, an act of terrorism. Hasan described himself as a “Mujahideen,” declared that he switched sides in the war, and even communicated with a senior Al Qaeda cleric, the now-deceased Anwar al-Awlaki, prior to the attack. \nThe National Counterterrorism Center listed the Fort Hood shooting in its 2009 report on terrorism . \nBut political correctness cares not for facts. \nIncredibly, the official military report on the Fort Hood shooting does not even mention Islam . \nJust as incredibly, the military classifies the incident not as terrorism but as a mere act of “ workplace violence ” -- a designation that the Pentagon says prevents it from presenting this treasured award to our military heroes at Fort Hood. \nThe Pentagon justifies this designation on the grounds that calling Hasan’s attack an act of terror would prejudice his right to receive a fair trial. \nAs an attorney who’s practiced for more than 30 years in both civil and criminal court, I have a one-word response: Nonsense. \nComplete and total nonsense. \nThere is a simple solution: if the judge is concerned that awarding a Purple Heart would prejudice the trial, then she should exclude evidence of the award. \nJuries are required to consider the evidence presented at trial and only the evidence presented at trial. A military jury is more than capable of discharging its duty according to the law. \nIf evidence of the Purple Heart award or terrorism designation did leak into the trial, then the judge could simply admonish the jury and remind its members that such determinations are made under different standards of evidence and have no bearing on the legal guilt of the accused. \nYet Hasan’s own actions have rendered even these simple cautions moot. Beginning with his opening statement, he confessed responsibility so clearly that a court-designated defense counsel tried to take over Hasan’s defense (Hasan is representing himself), convinced that Hasan is seeking the death penalty. \nThe stubborn refusal to award Purple Hearts is not the only way that the military is protecting Nidal Hasan’s interests over his victims. Despite the fact that he’s still an active-duty officer in the United States military, he’s been permitted to grow and maintain the jihadist beard that so many members of our armed forces have seen overseas. \nThis action is a direct insult to the uniform, to the victims, and to the court, yet we don’t even have the strength of will to impose our own uniform standards on a turncoat soldier. \nBy betraying our own soldiers and bending over backwards to accommodate their betrayer, what do we hope to accomplish? Our enemies sneer at our weakness and exploit our political correctness. In the meantime, our troops suffer the consequences. \nEven though our own government denies reality for the sake of political expediency and through political cowardice, we must never forget the heroism and sacrifice of that dreadful day. \nAs Hasan attacked unarmed soldiers, men and women on the ground responded with extraordinary bravery: shielding casualties with their bodies, rushing Hasan, and using chairs and other objects to try to interrupt his attack. As ordinary citizens, we have no medals we can bestow, but we can give them our gratitude. \nWe can also give you them voice – a united and loud call for the Obama administration – specifically Defense Secretary Chuck Hagel – to drop the pretense, embrace the truth, and honor the fallen. \nIt’s past time for Purple Hearts for the casualties and heroes of Fort Hood. \nJay Sekulow is Chief Counsel of the American Center for Law and Justice (ACLJ), which focuses on constitutional law. He is a New York Times bestselling author. Jay's latest book \" UNDEMOCRATIC: How Unelected, Unaccountable Bureaucrats Are Stealing Your Liberty and Freedom \" will be published on May 19. He hosts \"Jay Sekulow Live\" -- a daily radio show which is broadcast on more than 850 stations nationwide as well as Sirius/XM satellite radio. Follow him on Twitter @JaySekulow . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:14:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}