{"organizations": [], "uuid": "c16c7a56e3e5c7ac87fd12eee494a5918f67b95e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/blogs/clintonhillary_041615getty.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/campaign/242206-left-presses-clinton-to-choose-sides-on-obama-trade-pact", "country": "US", "title": "Left presses Clinton to choose sides on Obama trade pact", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Left presses Clinton to choose sides on Obama trade pact", "spam_score": 0.0, "site_type": "news", "published": "2015-05-17T13:00:00.000+03:00", "replies_count": 0, "uuid": "c16c7a56e3e5c7ac87fd12eee494a5918f67b95e"}, "author": "Niall Stanage", "url": "http://thehill.com/homenews/campaign/242206-left-presses-clinton-to-choose-sides-on-obama-trade-pact", "ord_in_thread": 0, "title": "Left presses Clinton to choose sides on Obama trade pact", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Left presses Clinton to choose sides on Obama trade pact Getty By Niall Stanage - 05/17/15 06:00 AM EDT \nLiberal groups are insisting that Hillary Clinton take a clear stand against the Trans-Pacific Partnership trade pact that is a crucial part of President Obama’s second-term agenda. \nThey say Clinton, whose positions on trade have zigged and zagged during a long political career, should move beyond populist generalities and let voters know where she stands. ADVERTISEMENT “This is a key test for Hillary Clinton. It is time for her to stand up and choose a side,” said Charles Chamberlain, the executive director of Democracy for America.\n“This is the first pass/fail test of her candidacy,” said Murshed Zaheed, deputy political director of CREDO Action , another liberal group. \n“It really is, ‘What side are you on?’” emphasized Jacob Swenson-Lengyel, communications lead for National People’s Action. \nThe TPP is the biggest trade deal the United States has negotiated since the North American Free Trade Agreement with Canada and Mexico. \nNAFTA was finalized by President Bill Clinton’s administration, and has been a bugbear for opponents of trade ever since. Critics of the TPP argue it is cut from the same cloth as NAFTA, and Democrats in the House and Senate are opposing Obama’s call for “fast-track” legislation that would ease negotiations over TPP and its passage by Congress. \nHillary Clinton backed the TPP as Obama’s secretary of State, but hasn’t taken a clear position on the campaign trail as she seeks to win over Democratic grassroots voters. \n“Any trade deal has to produce jobs and raise wages and increase prosperity and protect our security,” Clinton responded last month to a question lobbed by NBC’s Andrea Mitchell at a campaign stop in New Hampshire. \n“We have to do our part in making sure we have the capabilities and the skills to be competitive,” Clinton added. \nBack in 2012, Clinton praised the framework for the TPP as setting “the gold standard in trade agreements.” \nActivists on the left have a host of problems with the TPP, which would create a free-trade area between the United States and 11 other nations, most of them in Asia and Latin America. \nOne key objection is to the setting-up of a legal process by which corporations could appeal to special tribunals if they believed their rights were being infringed by the laws of a signatory nation. To many on the left, it sounds like an idea that would give corporations power to undercut national sovereignty, and reduce labor and environmental protections. \nHillary Clinton’s language on free trade has shifted markedly over the years \nIn her first memoir Living History , published in 2003, Clinton called NAFTA one of “Bill’s successes.” Yet in a presidential debate during her first White House run in 2008, she declared, “I have been a critic of NAFTA from the very beginning.” \nAs a senator, Clinton voted in favor of trade deals with Singapore, Chile, Australia, Morocco and Oman. She also backed an agreement with Peru in 2007, although she was not present in the Senate when it was voted upon. But she voted against the Central America Free Trade Agreement (CAFTA) in 2005. \nFurther complicating matters, if Clinton wants to embrace the left-wing position now, she would also have to break with the Obama administration in which she was a central figure. \n“Not being clear on where you stand is problematic,” said Chamberlain. “For Hillary Clinton specifically, here is someone who…has a history of supporting bad trade deals in the past. And you have a White House that claims Clinton backs them.” \nAdam Green, co-founder of the Progressive Change Campaign Committee, insisted that Clinton could not stay on the fence on TPP without suffering negative consequences among grassroots Democrats. And he placed her choice in a broader context. \n“On most issues, like student debt and wages, the question for Hillary Clinton will not be about which direction she goes — but whether she goes big or goes small,” he said, “Endorsing fast track or the underlying TPP would certainly be going in the wrong direction but many could say the same thing about staying on the sideline when a fight is happening.” \nBut not everyone on the left is eager to put ultimatums before Clinton, who is the prohibitive frontrunner for the Democratic presidential nomination. \nOne prominent liberal voice on free trade, Lori Wallach of Public Citizen, declined an interview request about Clinton’s stance on the TPP. \nA spokesman for the AFL-CIO also declined to speak about Clinton’s role on the issue, instead citing a speech given by the organization’s president, Richard Trumka, late last month. \nTrumka never referred to Clinton by name. But he did state that “the labor movement opposes fast track. We expect those who seek to lead our nation forward to oppose fast track. There is no middle ground, and the time for deliberations is drawing to a close.” \nLeft-wingers who have no such reticence about naming Clinton share Trumka’s sentiment in one respect. Clinton needs to speak now, they say, when the debate over TPP and fast track is still being waged, rather than waiting till the issue cools off. \n“If she comes back, three or four months later, saying she had concerns about TPP, that’s not going to matter much,” said Zaheed of CREDO. “Those are going to be empty words. This is the time for her to speak out.”", "external_links": [], "published": "2015-05-17T13:00:00.000+03:00", "crawled": "2015-05-17T13:44:31.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}