{"organizations": [], "uuid": "f3cac72e0403d659defcad356158020c70279128", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2909474/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/05/04/obama-empieza-preparar-legado_n_7204772.html", "country": "", "title": "Obama empieza a preparar su legado como presidente", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama empieza a preparar su legado como presidente", "spam_score": 0.0, "site_type": "news", "published": "2015-05-04T20:24:00.000+03:00", "replies_count": 0, "uuid": "f3cac72e0403d659defcad356158020c70279128"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/05/04/obama-empieza-preparar-legado_n_7204772.html", "ord_in_thread": 0, "title": "Obama empieza a preparar su legado como presidente", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Obama empieza a preparar su legado como presidente Publicado: reddit \nWASHINGTON (AP) — Poco a poco, el presidente de Estados Unidos, Barack Obama, trata de construir la base del legado que quiere dejar, tomando decisiones que perdurarán más allá de su presidencia. \nEn rápida sucesión, Obama decidió situar su biblioteca presidencial en su ciudad natal, Chicago, y el lunes presentará una fundación para continuar el trabajo de un programa que creó para ampliar las oportunidades educativas y de otra clase para niños y jóvenes de color. \n\"Dejaré de ser presidente en un par de años, y aún seré un hombre bastante joven; no comparado con ustedes, pero aun así bastante joven\", dijo hace poco Obama a un grupo estudiantes de escuela intermedia. \"De modo que volveré a hacer la clase de cosas que hacía antes, intentando encontrar modos de ayudar a la gente, ayudar a que la gente joven reciba una educación, y ayudar a la gente a conseguir empleos, e intentar llevar empresas a los barrios que no tienen suficientes empresas. Ésa es la clase de trabajo que de verdad me encantaría hacer\". \nEl pasado otoño, Obama se mostró más centrado que nunca en logros que construyeran un legado, después de las significativas derrotas demócratas pusieran a los republicanos al mando de las dos cámaras del Congreso por primera vez desde 2009. \nPoco después de las elecciones de media legislatura, Obama anunció unos polémicos planes para proteger a millones de personas que vivían de forma ilegal en el país de la amenaza de la deportación, aunque sus medidas han chocado con una demanda en un tribunal federal. \nTambién anunció un acercamiento histórico con Cuba, aislada durante décadas por Estados Unidos, y lideró a otras potencias mundiales para buscar un acuerdo y que Irán no desarrolle armas nucleares. \nObama también contaría con la ley de atención sanitaria de 2010 para su legado, siempre que se mantenga cuando el Tribunal Supremo falle a finales de junio en otra demanda contra una de sus piezas clave. La ley ha sobrevivido a varios intentos de los congresistas republicanos de derogar todo o parte del texto. El legado de Obama también se verá marcado por fracasos y traspiés en política nacional e internacional y por las agrias divisiones partisanas que prometió cerrar pero no ha podido reducir. \nEl lunes, Obama viajará a Nueva York para hablar en el lanzamiento de la My Brother's Keeper Alliance, una organización sin ánimo de lucro establecida para continuar el trabajo de la iniciativa del mismo nombre creada por el presidente. \nLa iniciativa emprendida el año pasado coordina a empresas, fundaciones y grupos comunitarios para invertir en educación y otros programas que ayuden a mantener en el buen camino a varones de minorías. \n\"Éste es un asunto en el que el presidente pretende seguir centrado en el futuro tras abandonar el Despacho Oval\", indicó el portavoz Josh Earnest, debido en parte a las recientes noticias sobre hombres negros muertos en encuentros con la policía en Missouri, Ohio, la ciudad de Nueva York, Carolina del Sur y Baltimore. \nAdemás de la posibilidad de retomar su trabajo como organizador en la comunidad, Obama ha mencionado un deseo de volver a las aulas tras su mandato. El presidente fue profesor de derecho constitucional en la Universidad de Chicago. \nLos ámbitos en los que los presidentes deciden trabajar tras abandonar el cargo suelen derivar de valores personales o sucesos ocurridos durante su legislatura, indicó Justin Vaughn, que enseña ciencias políticas en la Universidad del Estado de Boise en Idaho. Vaughn señaló a los planes de Obama de seguir implicado en el programa My Brother0s Keeper, y señaló que para un presidente que se manejó de forma segura y cauta cuando estaba en el cargo, \"quizá es un indicio de que le gustaría ahondar en las cuestiones que le motivaban cuando era joven\". \nLa semana pasada, Obama bromeó sobre su legado y la ley sanitaria durante una cena de gala en Washington. \n\"El hecho es, sin embargo, que en este momento mi legado empieza por fin a tomar forma. La economía está mejorando. Nueve de cada 10 estadounidenses tienen ahora cobertura de salud\", dijo. \"Hoy, gracias a Obamacare, ya no tienen que preocuparse de perder su seguro médico si pierden su trabajo. De nada, demócratas del Senado\". \n___ \nDarlene Superville está en Twitter como http://www.twitter.com/dsupervilleap También en HuffPost Voces ", "external_links": [], "published": "2015-05-04T20:24:00.000+03:00", "crawled": "2015-05-04T23:39:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}