{"organizations": ["Fox News Texas House"], "uuid": "7280f875d8073598ae85699a7252696bab3ad766", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/07/09/planned-parenthood-big-abortion-and-battle-to-save-lives-in-texas/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422585987816.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/09/planned-parenthood-big-abortion-and-battle-to-save-lives-in-texas.html", "country": "", "title": "Planned Parenthood, big abortion and the battle to save lives in Texas | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Planned Parenthood, big abortion and the battle to save lives in Texas | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "7280f875d8073598ae85699a7252696bab3ad766"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/09/planned-parenthood-big-abortion-and-battle-to-save-lives-in-texas.html", "ord_in_thread": 0, "title": "Planned Parenthood, big abortion and the battle to save lives in Texas | Fox News", "locations": ["Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Texas House schedules vote on abortion restrictions \nThat’s why Planned Parenthood President Cecile Richard, showed up in Austin last week and why I chose rally our Concerned Women for America members at the state capitol on Monday night. \nPretty terms like “women's rights” can't cover up the fact that the left is advocating that we allow babies five months and older to be aborted. \nYes, that’s right, babies aborted at five months, when the child already has all her vital organs, can hear and respond to her mother's voice, has the beginnings of eyebrows, eyelashes and fingernails and worst of all can feel pain. \nTexas's HB 2 bill, the “Unborn Pain Capable Child Protection Act” on the federal level and similar bills in other states are for better or worse very limited, common ground legislation. Across the United States pro-abortion activists are fighting people like us, pro-life activists in pitched political battles. Why? Because, bottom line, they have never met an abortion they didn't like. \nBoth President Obama and big abortion's official position is that abortion should be legal at any point in pregnancy, for any reason, any number of times, all at the taxpayer's expense. \nThey even oppose the right of a teenager’s parents to know about an abortion, and they oppose minimum health regulations on the clinics that perform abortions. So much for abortions being \"safe, legal and rare.\" To these fervent activists anything short of totally unlimited abortions is equivalent to the overturning of Roe v. Wade. \nPro-life supporters continue to ask a simple question that so-called “women’s groups” like Planned Parenthood and NARAL cannot answer: Is there any protective restriction that they are willing to support? So far, the answer is always no. \nThe outrageousness of this position was exposed recently in a Florida Senate hearing when a Planned Parenthood lobbyist refused to say that a late-term baby who is able to survive a botched abortion deserved medical care. So advocates obfuscate the question, rally their troops (or more accurately hire people via Craigslist) and look for ways to distract and intimidate. \nPro-lifers are up to the challenge of staying on topic and ratting out the complete malevolence of the opposition. \nThe bill we rally for in Texas would ban abortions after five months of pregnancy and requires abortion clinics to meet basic medical standards, such as having active admitting privileges at a hospital in case the abortion goes wrong, providing the pregnant woman with a telephone number to a physician and the name and telephone number of a nearby hospital in case complications occur after an abortion (as they commonly do). \nAdditionally, this bill does permit a woman to have an abortion up to the fifth month of her pregnancy, allows an abortion when the mother’s life is at risk or substantial physical impairment is possible, and does not stop a mother from aborting her child on the prejudice of severe fetal abnormalities. \nFor those of us who believe that life begins at conception, this bill doesn't go far enough. But please remind me again why pro-abortion activists want healthy five-month pregnant women to abort their healthy child in dirty, unsafe abortion clinics? Their “pro-woman” case just doesn’t add up. \nSince the discovery of Kermit Gosnell’s “House of Horrors” abortion clinic in Philadelphia the American people have been outraged with ineffective abortion regulations. The Gosnell trial is possibly one of the most gruesome, most tragic human rights violations of the 21st Century. Sadly, Gosnell is not alone. Investigations are finding similar tragedies have been taking place across the country. \n- Douglas Karpen and his Aaron Women’s Clinic in Houston is under investigation for performing horrific late-term procedures. \n- In Maryland, abortionist Nicola I. Riley had her license removed for numerous “botched” abortions, as reported by LifeNews. \n- Just recently a Michigan doctor has been investigated for \"botching\" abortions and for his \"filthy\" office conditions. \n- A Kentucky clinic was closed for performing \"hellish\" abortions. \n- A doctor at a Delaware Planned Parenthood clinic is being investigated for “unprofessional, incompetent and negligent conduct.” \n- At three Florida clinics, countless mothers and their children were regularly mutilated; their horrific practices involved throwing human body parts in the trash. \nSadly, the list doesn’t even end there. \nAs much as I wish that Kermit Gosnell’s crimes were an anomaly, they are not; his actions only hint at the dark evils going on inside wombs all over this nation. The differences between Gosnell and so many others like him are only geographic. \nPro-abortion activists and left loving media love to throw up the “old, white male” stereotype to suggest that male lawmakers who vote pro-life are secretly plotting to take away their rights. This, of course, ignores the fact that legions of pro-life women elected these men who advocate for life. It also ignores that the pro-life movement is overwhelmingly led by women. (Take CWA as just one example.) \nLeft-leaning – but intellectually honest – columnist Kirsten Powers said it well in her Daily Beast column, “I Don’t Stand With Wendy Davis,” writing, “Maybe we should wonder what is wrong with the women who think protecting the right to abort your baby for any reason up to the 26th week is a ‘human right.’” \nNot only Texas, but the entire country overwhelmingly supports more protective restrictions at the federal and state levels. In the midst of the Gosnell trial, Gallup found that only 26 percent of Americans want legal abortions in any circumstance, while a January 2013 Gallup poll found 80 percent of Americans want abortion outlawed in the third trimester, and 64 percent think it should be outlawed in the second trimester. \nThe Wendy Davises of the world and big abortion should enjoy their fifteen minutes of fame now. Because America’s women are watching, waiting and praying that the Texas legislature will follow the ethical sentiments of their citizens and the entire country and take this minimal step to protect the lives of women and children. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:15:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}