{"organizations": ["Fox News"], "uuid": "0474471685ab0f1b9aad571427595cf935c14543", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/052913/0/0/052913_dotcom_doj_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/29/self-flagellation-from-holder-obama-needed-when-it-comes-to-press.html", "country": "", "title": "Self-flagellation from Holder, Obama needed when it comes to the press | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Self-flagellation from Holder, Obama needed when it comes to the press | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "0474471685ab0f1b9aad571427595cf935c14543"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/29/self-flagellation-from-holder-obama-needed-when-it-comes-to-press.html", "ord_in_thread": 0, "title": "Self-flagellation from Holder, Obama needed when it comes to the press | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "\nThere is a big difference between Fox News reporter James Rosen and Daniel Ellsberg or Julian Assange. \nRosen is a reporter for a well-known news organization. The other two orchestrated leaks of information the government considered national security secrets. \nThe Obama administration’s decision to criminalize journalism by labeling Rosen as a “co-conspirator” for using flattery to seduce information from a state department source is a major failure and threat to First Amendment protections for a free American press. \nThe grievous error is the inability to distinguish between an aggressive reporter doing his job and the person who is leaking government secrets to the reporter. \nThe War on Terror heightened concern over leaks in both the Bush and Obama administrations. \nBush’s Attorney General Alberto Gonzales is reported to have reviewed the option of prosecuting journalists for making public national security information. \nIn the probe of the leak of CIA agent Valerie Plame’s identity the Bush administration also asked its own officials to sign letters permitting journalist to break the confidentiality of source-reporter relationships and reveal their sources. \nBut the Obama administration became the first to cross a very dangerous line when it listed a journalist, Rosen, as a “co-conspirator” in an affidavit in order to get a judge’s permission to go after his emails and cell phone records. \nIn all previous cases the government used its prosecutorial powers to go after the people doing the leaking or passing along information from a government source. \nRosen may have set off alarms for prosecutors by using a phony name and secret email address for his contact with his state department source. But a supervisor at FBI or among prosecutors – even the judge who approved the subpoena of Rosen’s information – needed to recognize the difference between a legitimate, scoop-hungry news reporter and a potential spy or terrorist. \nThat failure constitutes a chilling assault on freedom of the press. \nYes, there is a national security factor. The government obviously did not want North Korea to know that it had infiltrated its nuclear operations. But the problem is not the American press but government employees who decided to reveal the information despite their oath not to do so. \nArguably, even obsessive prosecution of sources can be a problem. The Obama administration has prosecuted six leakers. That is the most in history. \nIt comes at an unusual time with the spread of new government anti-terror security operations after the 9-11 terrorist attack. But punishing government officials who talk with reporters is contrary to the principle of an open government that is accountable to the American people. \nTo be fair, Attorney General Eric Holder is slowly beginning to recognize the grievous errors by the investigators and prosecutors who sent him the affidavit listing Rosen as a “co-conspirator.” And he seems to know now that by trusting that the FBI agents and Justice Department lawyers had a strong basis for their suspicions about Rosen he made a mistake in signing the affidavit. \nIn an interview with the Daily Beast website on Tuesday, Holder said “While both of these cases were handled within the law and according to Justice Department guidelines, they are reminders of the unique role the news media plays in our democratic system, and signal that both our laws and guidelines need to be updated.” \nHe added: “This is an opportunity for the department to consider how we strike the right balance between the interests of law enforcement and freedom of the press.” \nThe Daily Beast also said “Holder acknowledged that there was considerable room for improvement in how Justice handles leak cases, casting the episode as a kind of teaching moment for his department and himself.\" \nThat is a good start – as is the Obama administration’s vow to renew the push for a media shield law in Congress. \nHolder is now scheduling meetings with the heads of Washington news operations to speak with them about how to set guidelines for leak prosecutions that protects legitimate journalists. \nBut the Justice Department and the president need to publicly acknowledge the damage done to the idea of a free press and reaffirm protections for journalists who are doing their best to keep the public aware of the exercise of power by a democratic nation’s elected officials. \nThe question of how we as a country (and our legal system) deal with leakers of classified information is an unresolved and urgent problem. This is a special problem that involves the kind of life and death decisions that attend to national security. It should be kept separate from those leakers who leak to score political points, embarrass political officials personally, or reveal government negligence or corruption. \nThe government often makes the mistake of lumping such items in with national security when it chooses what to classify and what not to. \nBut if these scandals have shown us anything it is that in this post 9/11 era the nation needs to resolve this specific issue once and for all. \nJuan Williams is a co-host of FNC's \"The Five,\" where he is one of seven rotating Fox personalities. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:22:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}