{"organizations": [], "uuid": "9a1b5999ad83aa14e214638c66acce2c500795b0", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2996738/images/o-OBAMA_ORIGINAL-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/26/obama-texas-floods_n_7445996.html", "country": "", "title": "Obama Promises Quick Federal Aid For Texas Areas Affected By Floods", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Promises Quick Federal Aid For Texas Areas Affected By Floods", "spam_score": 0.0, "site_type": "news", "published": "2015-05-27T03:56:00.000+03:00", "replies_count": 0, "uuid": "9a1b5999ad83aa14e214638c66acce2c500795b0"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/26/obama-texas-floods_n_7445996.html", "ord_in_thread": 0, "title": "Obama Promises Quick Federal Aid For Texas Areas Affected By Floods", "locations": ["Vivian", "Britain", "Cape York Peninsula", "US", "Northern USA", "Queensland", "Great Lakes", "Australia", "Texas", "South Dakota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "  This ominous cloud is a super cell: a thunderstorm with a a deep, rotating updraft, called a mesocyclone. They are rare, severe storms and can change the weather up to 30 kilometres away. Eerily referred to as the \"icy finger of death, brinicles are like underwater icicles. They appear beneath sea ice when a flow of very cold water mixes with other ocean water. Sea ice is very different from ice on land: it's spongelike in texture. When it touches the sea bed, a web of ice can form that freezes everything it touches, including creatures like starfish. It's an awesome display when lightning and volcanic eruptions collide. Scientists believe that a volcano emits a large electrical charge, so an opposite charge is created to balance this out - in the form of a lightning bolt. These frost crystals are so thick that they look like snow. The interlocking shards appear when objects that are below freezing are exposed to \"supersaturated air\" (air with a high water content). On a warmer object, dew would form, but the humidity in the air produces the spikey hoar frost. The weatherbomb was the original strangely-named weather phenomena to blast Britain recently. The catacylsmic weather event - bringing strong winds and heavy rain - is officially known as an extratropical cyclone, a strong cyclone that forms after a rapid fall in pressure within a storm. The process that creates it is known as bombogenesis. This slightly mystical effect is a sundog, also known as a parhelia or mock sun. It happens when light interacts with ice crystals in the atmosphere. Two bright spots appear either side of the sun, at the same height. Sun dogs are often seen with what's called a 22º halo - a ring around the sun formed from light refracting off ice crystals at a 22º angle. Ice volcanoes erupt with icy water rather than lava, and occur when water and and ice are close together. When waves hit a shell of ice in a weak spot, a hole forms, spewing water and sleet high into the air. They regularly form around the Great Lakes in the Northern USA. Their names sound magical, and these optical phenomena are something special. They were only recently recorded using low-light television technology. They are the result of the fallout from thunderstorms: the sprite is a red flash that appears above the storm when lightning hit, while the elf is a halo which can appear even higher up when the storm generates an electromagnetic pulse - lasting for less than a thousandth of a second. The blue jet is a streak that looks like a falling star, and is in fact an electrical ejection from the core of a thunderstorm. Vortex shedding occurs when the wind hits a mechanical system - such as the lamp posts on this motorway - at a specific frequency, causing the system to “excite” . They vibrate and move, which is pretty frightening for the drivers in this case. These amusingly-named lumps form when there is a hard layer of snow covered by several more inches of dense snow. On a hill, gravity pulls the hard lump, downwards, gathering more bulk as it rolls. With the perfect density and temperature, it rolls leaving a hole in the centre. A cousin of the now doughnut, these odd-shaped natural snowballs form when high winds roll snow over open areas. When a tornado is generated over water, this is what happens. The funnel-shaped cloud is connected to a larger cloud above. Although it looks like they suck up water, they don't exactly: although a \"spray ring\" forms and some spray rises up the air tunnel. These bizarre pouches of cloud, which can look like hundreds of white balloons have been released into the sky, are a true mystery. Scientists don't know how they form, but have several theories. It could be due to a cooling of part of the cloud which causes it to drop down, an unstable cloud where \"cloudy\" air doesn't mix fully with dry air, or possibly gravity waves which move part of the cloud away. The dust devil is a strong whirlwind, which sucks up dust and debris, making it visible. The devils are smaller than tornadoes - less than 100 feet tall - and form differently. They come into being when light winds move over a hot surface and convective rolls of air are formed, meaning a desert is a common location for dust devils. As the name suggest, these are really, really big hailstones. They are sometimes called \"ice bombs\" and tend to shatter when they hit the ground. One of the largest ever recorded was seen in Vivian, South Dakota, in the US in 2010. It was 8 inches in diameter and weighed nearly 2 pounds. Lenticular clouds are stationary, lens-shaped cloud - but people often mistake them for UFOs as they also look rather like saucers. High altitudes are needed for them to appear, and they usually form at right-angles to the wind direction, when stable moist steams of air move over a formation like a mountain. These solitary clouds seem to rotate around a horizontal axis, and aren't linked to any other formations. They are are usually formed by cold, wet air flowing out of sea breezes or cold fronts. The most famous is Australia's 'Morning Glory' cloud, which appears regularly in October in Queensland thanks to the sea breezes that develop over the Cape York Peninsula. Thundersnow burst into the consciousness of the British public when storms battered us from late 2014. As the name suggests, it's snow that falls during a thunderstorm, a rare occurrence caused when cold air passes over a warm sea. Thunderstorms are produced by moist air rising, which hardly ever happens at temperatures low enough to allow snowfall.  Share ", "external_links": [], "published": "2015-05-27T03:56:00.000+03:00", "crawled": "2015-05-27T03:56:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}