{"organizations": [], "uuid": "955a6f1d08aea3edb7b4a598641b61891a4a661c", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/schakowsky_pelosi.jpg", "site_section": "http://thehill.com/component/rss-syndicator/?feed_id=2", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/house/241363-150-house-dems-back-obama-on-iran-negotiations", "country": "US", "title": "150 House Dems back Obama on Iran negotiations", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "150 House Dems back Obama on Iran negotiations", "spam_score": 0.0, "site_type": "news", "published": "2015-05-07T21:54:00.000+03:00", "replies_count": 0, "uuid": "955a6f1d08aea3edb7b4a598641b61891a4a661c"}, "author": "Mike Lillis", "url": "http://thehill.com/homenews/house/241363-150-house-dems-back-obama-on-iran-negotiations", "ord_in_thread": 0, "title": "150 House Dems back Obama on Iran negotiations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "150 House Dems back Obama on Iran negotiations By Mike Lillis - 05/07/15 02:54 PM EDT \n150 House Dems back Obama on Iran negotiationsAn overwhelming majority of House Democrats are lining up in support of President Obama's negotiations over Iran's nuclear program.One hundred and fifty lawmakers, including Minority Leader Nancy Pelosi (D-Calif.), are urging the administration to \"stay the course\" and \"exhaust every avenue\" in its bid to craft a diplomatic deal to prevent a nuclear-armed Iran.\"If the United States were to abandon negotiations or cause their collapse, not only would we fail to peacefully prevent a nuclear armed Iran, we would make that outcome more likely,\" the Democrats wrote to Obama Thursday in a letter spearheaded by Reps. Jan Schakowsky (Ill.), Lloyd Doggett (Texas) and David Price (N.C.).While the letter is addressed to the White House, the message sends a warning shot to GOP leaders that Democrats could likely sustain a presidential veto if the Republicans vote to disapprove a deal negotiated by the U.S., Iran and five other nations.Legislation sponsored by Sens. Bob Corker (R-Tenn.) and Ben Cardin (D-Md.), the leaders of the Foreign Relations Committee, empowers Congress with an up-or-down vote on any such agreement reached by the June 30 deadline — a top priority of Obama this year. The bill has gained wide-spread bipartisan support, as lawmakers on both sides of the aisle have demanded a greater voice in the high-stakes nuclear talks. But a framework agreement unveiled last month was widely criticized by conservatives on and off Capitol Hill, and Republicans are warning that they'll vote against any deal they deem insufficient to prevent Iran from building nuclear weapons.House Speaker John Boehner (R-Ohio) and other GOP leaders say they'll move quickly on tougher new sanctions in the absence of a deal they can back – sanctions that would likely sink a nuclear deal. Recent actions by Iran, particularly the seizure of a cargo vessel traveling in international waters, only underscore the need for Congress to review any deal, Boehner warned last week. “None of this should be taken lightly – or silently, as the administration would apparently have us do,\" Boehner said. \"We’re getting closer to making sure Congress can review any potential agreement with Iran. And Iran, by its words and its actions, is showing exactly why we need this type of accountability.”The measure cruised through the Senate Thursday, passing by tally of 98-1. House GOP leaders say they'll move quickly on the measure when it reaches the lower chamber.In their Thursday letter, the Democrats are pushing hard for a diplomatic victory while warning that a failure of the negotiations could lead to war. The party's wide-spread support for that message suggests that, even if Republicans reject an Iran deal, the Democrats have the numbers to sustain a presidential veto.\"War itself will not make us safe,\" the lawmakers wrote. \"We must allow our negotiating team the space and time necessary to build on the progress made in the political framework and turn it into a long-term, verifiable agreement.\"", "external_links": [], "published": "2015-05-07T21:54:00.000+03:00", "crawled": "2015-05-07T22:07:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}