{"organizations": [], "uuid": "ccda27a9e26f86663427fea5dc8d8ac8d54ced68", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150522132905-obama-adas-israel-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/05/22/health/anorexia-social-media-plea-for-help/index.html", "country": "US", "title": "Obama pitches Iran plan at", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama pitches Iran plan at", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T20:43:00.000+03:00", "replies_count": 0, "uuid": "dd0cfc228346d4c31da870024b548d231c3355ba"}, "author": "", "url": "http://edition.cnn.com/2015/05/22/politics/obama-iran-adas-speech/index.html", "ord_in_thread": 0, "title": "Obama pitches Iran plan at", "locations": ["Atlantic", "Iran", "U.S.", "Tehran", "Washington", "Israel", "Northwest Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Netanyahu", "Barack Obama", "Benjamin Netanyahu", "Obama"], "text": "Obama on Iran: 'Deal is not completed' 04:31 Washington (CNN) Seeking to reassure deeply skeptical Jewish-Americans of the deal he's attempting to strike over Iran's nuclear program, President Barack Obama on Friday strongly defended his intentions with Tehran, telling congregants at the Adas Israel synagogue in Northwest Washington that his reputation is on the line if the country ends up securing a bomb. \"This will be my name on it,\" he told the largely receptive crowd, echoing comments he made earlier in the week in an interview with the Atlantic . \"No one has a bigger personal stake in ensuring that it delivers on its promise.\" Obama was speaking at the prominent congregation to downplay any suggestion of a rift between himself and American Jews, some of whom remain apprehensive of his approach to Israel. In March, U.S.-Israel ties were strained when Prime Minister Benjamin Netanyahu visited Washington to petition against the Iranian nuclear deal. The White House accused Netanyahu of politicking ahead of general elections, and said his statements against a two-state solution with Palestinians reflected a break of longstanding Israeli policy. Obama on Friday did not avoid addressing his differences with the Israeli government, declaring specifically that Palestinians have \"a right to be a free people on their land.\" But he said those disputes doesn't reflect the \"true measure\" of the U.S.-Israel friendship. \"When I hear some people say that disagreements over policy belie a general lack of support of Israel, I must object, and I object forcefully,\" he said. Obama underscored the strength of the U.S.-Israel bond, despite recent tensions, saying \"no U.S. president, no administration, has done more to ensure Israel can protect itself.\" Obama was speaking at Adas Israel to mark Jewish American History Month, and drew ties between the American Civil Rights movement with the faith. \"May we always remember that our shared heritage makes us stronger, that our roots are intertwined,\" Obama said. \"May we always choose faith over nihilism, and courage over despair, and hope over cynicism and fear.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> More from Politics", "external_links": [], "published": "2015-05-22T20:43:00.000+03:00", "crawled": "2015-05-22T20:54:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}