{"organizations": ["Anti-Legalization Group Calls For Medical Marijuana Research Overhaul Anti-Legalization Group Calls For Medical Marijuana Research Overhaul"], "uuid": "6f3012b50b4caeb780dae5a35e4aadc4f46eef43", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3005328/images/o-MEDICAL-MARIJUANA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/28/project-sam-medical-marijuana-research_n_7461164.html", "country": "", "title": "Anti-Legalization Group Calls For Medical Marijuana Research Overhaul", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Anti-Legalization Group Calls For Medical Marijuana Research Overhaul", "spam_score": 0.0, "site_type": "news", "published": "2015-05-28T20:56:00.000+03:00", "replies_count": 0, "uuid": "6f3012b50b4caeb780dae5a35e4aadc4f46eef43"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/28/project-sam-medical-marijuana-research_n_7461164.html", "ord_in_thread": 0, "title": "Anti-Legalization Group Calls For Medical Marijuana Research Overhaul", "locations": ["United States"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["OLIVER BERG"], "text": "Anti-Legalization Group Calls For Medical Marijuana Research Overhaul Posted: Updated: 50 minutes ago A leading organization opposed to marijuana legalization released a report Thursday that seeks a major overhaul of marijuana research in the United States. (Oliver Berg/AFP/Getty Images) | OLIVER BERG via Getty Images reddit \nIn a groundbreaking move for a group of its kind, a leading organization opposed to marijuana legalization released a report Thursday that seeks a major overhaul of marijuana research in the United States, calling on the federal government to recognize the medical value of cannabis. \nFormer U.S. Rep. Patrick Kennedy (D-R.I.), co-founder of Smart Approaches to Marijuana, called his group's research recommendations a \"third way,\" positioning them between the concepts of legalization -- which the group continues to oppose -- and full prohibition, on a call Thursday. \nWhile calling full legalization of marijuana \"dangerous,\" Kevin Sabet, president and CEO of SAM, also said that \"there are so many things the government could do to offer the seriously ill experimental medications\" and help to further marijuana research to potentially unlock its medical potential, without legalizing the plant. \nSAM's plan calls for the federal government to end the federal monopoly on marijuana for research purposes by allowing for multiple facilities to grow the plant. Critics of federal policy say the lack of cannabis science in the U.S. has to do in part with the federal stranglehold on marijuana research. There's only one federally legal marijuana garden in the U.S., at the University of Mississippi. The National Institute on Drug Abuse oversees the operation, and it's the only source of marijuana for federally sanctioned studies on the drug. \nThe plan also seeks the elimination of a Department of Health and Human Services review process. \nCurrently, all marijuana research must go through a Public Health Service review -- a process established in 1999 by the federal government after a 1998 Institute of Medicine report called for more scientific research into the medical value of marijuana. \nIt's a process that no other substance classified by the government as Schedule I is subject to and one that researchers and lawmakers alike have criticized. \nUnder the Controlled Substances Act, the U.S. has five categories for drugs and drug ingredients . Schedule I is reserved for what the DEA considers to have the highest potential for abuse and no medical value. Marijuana has been classified as Schedule I for decades, alongside other substances like heroin and LSD. \nSAM is also calling for compassionate research programs for the seriously ill, relaxed Drug Enforcement Administration requirements for handling certain non-psychoactive forms of cannabis, federal-state partnerships to allow purified forms of non-psychoactive forms of cannabis to be dispensed and researched by doctors under a research program as well as enforcement action against medical marijuana businesses that are not compliant with their state laws. \nTo date, 23 states have legalized marijuana for medical purposes and 14 others have legalized the limited medical use of CBD, or cannabidiol, a compound found in the cannabis plant that doesn't produce the euphoric sensation associated with the drug but has shown medical promise. Still, the federal government continues to ban the plant. \nProponents of marijuana policy reform applauded SAM's efforts. \n\"The Marijuana Policy Project has long called for ending NIDA’s DEA-protected monopoly on the supply of marijuana available for research purposes, and we welcome Project SAM into our coalition,\" Dan Riffle, director of federal policies for MPP, told The Huffington Post. Also on HuffPost: ", "external_links": [], "published": "2015-05-28T20:56:00.000+03:00", "crawled": "2015-05-28T20:56:16.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}