{"organizations": [], "uuid": "9a7f86932345d147fdff9b12951766fe293208f4", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/chevrolet_volt_electriccar_013112getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/policy/energy-environment/242822-obama-pulls-back-electric-car-goals", "country": "US", "title": "Obama pulls back electric car goals", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama pulls back electric car goals", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T20:16:00.000+03:00", "replies_count": 0, "uuid": "9a7f86932345d147fdff9b12951766fe293208f4"}, "author": "Devin Henry", "url": "http://thehill.com/policy/energy-environment/242822-obama-pulls-back-electric-car-goals", "ord_in_thread": 0, "title": "Obama pulls back electric car goals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama pulls back electric car goals Getty Images By Devin Henry - 05/21/15 01:16 PM EDT \nThe Obama administration will not meet its goals of having 1 million electric vehicles on the road or creating a completely fuel-efficient fleet of government cars by this year, Bloomberg reported Thursday . \nObama signed an executive order in 2009 mandating the electric cars, and he said in 2011 that the government would purchase only fuel-efficient vehicles by 2015. ADVERTISEMENT But he pulled back on those goals earlier this year, issuing a new order that instead looks to reduce greenhouse gas emissions from federal vehicles.\nIndustry experts told Bloomberg that Obama’s lofty goals will go unfulfilled because consumer interest in electric vehicles has faded since he made the order. Between 2009 and 2014, consumers bought less than 300,000 plug-in vehicles. \nIn April 2011, with gas prices hovering near record highs, Obama said he was \"directing our departments and agencies to make sure 100 percent of the vehicles they buy are fuel-efficient or clean-energy vehicles” by this year. But during his presidency, only 7 percent of the 350,000 vehicles the government has purchased are fuel-efficient, Bloomberg found through a Freedom of Information Act request. \nIn March, Obama issued an executive order calling for a 30 percent reduction in the federal fleet’s greenhouse gas reductions by 2025. \nA General Service Administration official told Bloomberg that the government would keep building its clean-energy fleet. But he warned that there are supply problems — trucks are the most-purchased government vehicle, and hybrid options are limited — and that electric and hybrid cars “come with a higher acquisition cost compared to conventional vehicles.” Tags:", "external_links": [], "published": "2015-05-21T20:16:00.000+03:00", "crawled": "2015-05-22T00:54:59.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}