{"organizations": ["Obama Administration"], "uuid": "06a1cb50380d912ce32f77c4af4c65e7d1ee0a10", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2970184/images/o-HONEY-BEE-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/19/obama-bee-decline_n_7337124.html", "country": "", "title": "This Is How The Obama Administration Plans To Save Bees And Butterflies", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "This Is How The Obama Administration Plans To Save Bees And Butterflies", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T01:41:00.000+03:00", "replies_count": 0, "uuid": "06a1cb50380d912ce32f77c4af4c65e7d1ee0a10"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/19/obama-bee-decline_n_7337124.html", "ord_in_thread": 0, "title": "This Is How The Obama Administration Plans To Save Bees And Butterflies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This Is How The Obama Administration Plans To Save Bees And Butterflies Posted: Updated: 1 hour ago reddit \nWASHINGTON (AP) — A new federal plan aims to reverse America's declining honeybee and monarch butterfly populations by making millions of acres of federal land more bee-friendly, spending millions of dollars more on research and considering the use of fewer pesticides. \nWhile putting different type of landscapes along highways, federal housing projects and elsewhere may not sound like much in terms of action, several bee scientists told The Associated Press that this a huge move. They say it may help pollinators that are starving because so much of the American landscape has been converted to lawns and corn that don't provide foraging areas for bees. \n\"This is the first time I've seen addressed the issue that there's nothing for pollinators to eat,\" said University of Illinois entomologist May Berenbaum, who buttonholed President Barack Obama about bees when she received her National Medal of Science award last November. \"I think it's brilliant.\" \nEnvironmental activists who wanted a ban on a much-criticized class of pesticide said the Obama administration's bee strategy falls way short of what's needed to save the hives. \nScientists say bees — crucial to pollinate many crops — have been hurt by a combination of declining nutrition, mites, disease, and pesticides. The federal plan is an \"all hands on deck\" strategy that calls on everyone from federal bureaucrats to citizens to do what they can to save bees, which provide more than $15 billion in value to the U.S. economy, according to White House science adviser John Holdren. \n\"Pollinators are struggling,\" Holdren said in a blog post, citing a new federal survey that found beekeepers lost more than 40 percent of their colonies last year, although they later recovered by dividing surviving hives. He also said the number of monarch butterflies that spend the winter in Mexico's forests is down by 90 percent or more over the past two decades, so the U.S. government is working with Mexico to expand monarch habitat in the southern part of that country. \nThe plan calls for restoring 7 million acres (2.8 million hectares) of bee habitat in the next five years. Numerous federal agencies will have to find ways to grow plants on federal lands that are more varied and better for bees to eat because scientists have worried that large land tracts that grow only one crop have hurt bee nutrition. \nThe administration proposes spending $82.5 million on honeybee research in the upcoming budget year, up $34 million from now. \nThe Environmental Protection Agency will step up studies into the safety of widely used neonicotinoid pesticides, which have been temporarily banned in Europe. It will not approve new types of uses of the pesticides until more study is done, if then, the report said. \n\"They are not taking bold enough action; there's a recognition that there is a crisis,\" said Lori Ann Burd, environmental health director for the advocacy group Center for Biological Diversity. She said the bees cannot wait, comparing more studies on neonicotinoids to going to a second and third mechanic when you've been told the brakes are shot. \n\"Four million Americans have called on the Obama administration to listen to the clear science demanding that immediate action be taken to suspend systemic bee-killing pesticides, including seed treatments,\" Friends of the Earth food program director Lisa Archer said in statement. \"Failure to address this growing crisis with a unified and meaningful federal plan will put these essential pollinators and our food supply in jeopardy.\" \nBut CropLife America, which represents the makers of pesticides, praised the report for its \"multi-pronged coordinated approach.\" \nThe report talks of a fine line between the need for pesticides to help agriculture and the harm they can do to bees and other pollinators. \nLessening \"the effects of pesticides on bees is a priority for the federal government, as both bee pollination and insect control are essential to the success of agriculture,\" the report said. Also on HuffPost: ", "external_links": [], "published": "2015-05-20T01:41:00.000+03:00", "crawled": "2015-05-20T01:46:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}