{"organizations": [], "uuid": "aa8bbf89a2db8070b419835d955d8f470b320ae5", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/09/09/obama-syria-and-perils-red-line-declarations/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422621171393.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/09/obama-syria-and-perils-red-line-declarations.html", "country": "", "title": "Obama, Syria and the perils of 'red line' declarations | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama, Syria and the perils of 'red line' declarations | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "aa8bbf89a2db8070b419835d955d8f470b320ae5"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/09/obama-syria-and-perils-red-line-declarations.html", "ord_in_thread": 0, "title": "Obama, Syria and the perils of 'red line' declarations | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print Sept. 3, 2013: President Obama speaks to media in the Cabinet Room of the White House in Washington before a meeting with Congressional leaders to discuss the situation in Syria. From left are, National Security Adviser Susan Rice, House Speaker John Boehner of Ohio, the president, House Minority Leader Nancy Pelosi of Calif., and Senate Minority Leader Mitch McConnell of Ky. (AP Photo/Carolyn Kaster) \nAmidst a heated and confused debate on the question of U.S. intervention in Syria, President Obama made one of his infrequent appearances before the press to explain the red line he laid down more than a year ago regarding the use of chemical weapons. “First of all, I didn’t set a red line. The world set a red line,” Obama said. \nSetting aside the fact that this is, at best, a tortured locution (as the president did indeed say , “a red line for us is we start seeing a whole bunch of chemical weapons moving around or being utilized”), Obama’s attempt to rewrite his own rhetoric has obscured an important lesson: Red lines are too often idle threats that hamstring the good guys without constraining the bad. \nPredictability in international affairs is a virtue. \nThe better rogue nations understand the boundaries between acceptable and unacceptable behavior, the less likely they will transgress. \n[pullquote] What changed: Bashar al-Assad or West's perception of him? \nIt is this principle that drives the United Nations collective to sign treaties, lay down markers and otherwise insist – most often with no enforcing mechanism – that things like nuclear weapons proliferation, chemical and biological weapons production and use, and other objectionable things like torture and genocide are verboten. \nBut failure to enforce those norms is the rule rather than the exception. Bashar al-Assad has been murdering by the tens of thousands -- nominal crimes against humanity -- facing little other than verbal censure. \nIran, North Korea and others have violated numerous treaties without facing military action, at least not yet. And so, it flows naturally that most fail to take seriously the strictures of international treaties and norms. \nClearly, this happens at the country level as well. Both the United States and Israel have set numerous red lines regarding Iran’s illicit nuclear weapons programs. \nOver the last decade, those red lines have changed repeatedly, moving to accommodate Iran’s progress towards a nuclear weapons arsenal. Not surprisingly, only when faced with the specter of imminent military action, have the Iranians hesitated slightly with their onward march. \nBut there is another, more pernicious element to the red line ultimatum: The authority laying down his marker also has a problem once his imaginary tripwire is triggered. \nHe must either admit frankly that a red line has been crossed, and act accordingly, or he must enter into a silent partnership with the transgressor, insisting there is no actionable information. \nObama effectively partnered with Assad in April 2013, insisting it was not clear that chemical weapons had been used by the Syrian dictator. \nSimilarly over the years, Bill Clinton joined with then Palestinian Liberation Organization leader in insisting that the PLO was not violating U.S. law by engaging in terrorism; George Bush sided with the Government of Pakistan in insisting Islamabad was not harboring or supporting terrorists, which would have led to a cut off of aid; and Israel has silently teamed up with the Iranian regime to insist that Prime Minister Benjamin Netanyahu’s red lines on nuclear enrichment have not been crossed. (They have .) \nSo too, Obama made his pronouncement regarding Syrian use of chemical weapons in August of 2012, in the context of an election in which he was being accused of being weak on national security. \nThe remark, widely reported as being off the cuff and beyond the president’s intended talking points, had the effect of constraining Obama (and not, apparently, Assad). Once faced with the obvious and wanton use of chemical weapons by the Syrian dictator, Obama had to act or risk looking a fool. \nThe president clearly realized his dilemma when he responded to reports of 1,400 dead in the suburbs of Damascus in late August. He could not fudge the question of whether his red line had been crossed as he did after the earlier chemical weapons attack. Small wonder, then, that having tested the president once and succeeded, Assad believed he could do so again with impunity. \nIn a perfect world, a red line laid down by a credible and powerful nation or set of nations would provide a deterrent to bad actors. But this is not a perfect world, and when the will to enforce red lines is so clearly in doubt, it’s time to consider the wisdom of drawing them in the first place. \nDanielle Pletka is Vice President for Foreign and Defense Policy Studies at AEI, the American Enterprise Institute . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:19.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}