{"organizations": [], "uuid": "4e546b83385deec813a5ef7eddacad7fccd6e183", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/042215_hn_Emanuel_640.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/05/05/reid-throws-brakes-on-obama-trade-push/", "country": "US", "title": "Reid throws brakes on Obama trade push", "performance_score": 4, "site": "foxnews.com", "participants_count": 32, "title_full": "Reid throws brakes on Obama trade push | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T03:00:00.000+03:00", "replies_count": 39, "uuid": "920d3d39250e98a4a6ba6e355a5d24f9c098881c"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/05/05/reid-throws-brakes-on-obama-trade-push/#post-0", "ord_in_thread": 0, "title": "Reid throws brakes on Obama trade push", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com livefyre Email Print\nSenate Democratic Leader Harry Reid is jamming up President Obama's push for a new comprehensive trade deal, saying he'll try to block it until the Senate tackles other hot-button issues.\nThe threat comes just one week after visiting Japanese Prime Minister Shinzo Abe touted the proposed deal in an address to Congress. Both he and Obama are advocating for the 12-nation agreement known as the Trans-Pacific Partnership, which would open markets around the Pacific rim to U.S. exports.\nBefore completing the deal, however, Obama must win expanded negotiating authority from the U.S. Congress, a difficult task given opposition from liberals and labor unions who say they fear the loss of American jobs.\nIllustrating this challenge, Reid told The Huffington Post he now wants the Senate to put the trade bid on hold, until the chamber first deals with an infrastructure bill and proposed surveillance reforms.\n\"We have two very complicated issues that I think should have strong consideration before we even deal with trade,\" Reid said in the interview . He reportedly said he's spoken with Democratic colleagues about banding together to ensure those two bills are addressed before moving forward on trade.\n\"I'm not willing to lay over and play dead on trade until we have some commitment from them on surface transportation,\" he told The Huffington Post.\nWhite House Press Secretary Josh Earnest, responding to Reid on Tuesday, questioned the notion that the Senate could not tackle all those issues at once.\n\"We're setting the bar awfully low if we think the Senate can only do one thing over the next month,\" Earnest said, while citing the measure's \"strong bipartisan support.\"\nIt was no secret that Reid is opposed to Obama's push for so-called \"fast track\" authority to get streamlined approval of the trade deal. Reid recently told reporters he's not just a \"no\" on that issue, but a \"hell no.\"\nBut the Nevada senator's latest comments indicate he's willing to go a step further, and actively hold up the legislative push -- going head-to-head with a big Obama priority.\nOn Tuesday, though, Senate Republican Leader Mitch McConnell pushed back, urging his colleagues to support the trade measures.\n\"Of course we've already heard of an attempt to stand in the way of the bipartisan effort to debate this legislation. We already heard of yet another effort to make a partisan stand against a bipartisan accomplishment that would help grow opportunities for our constituents,\" McConnell said. He said he still plans to turn to the trade issue shortly.\nLast week, in a joint appearance alongside Japan's Abe, Obama touted the plan, saying it would \"help level the playing field.\"\nObama said both he and Abe are \"deeply committed to getting this done.\"\nAbe also touted the TPP in his address to Congress last week, urging all sides to \"take the lead\" in building a better market, and finish the 12-nation deal.\n\"The goal is near. Let us bring the TPP to a successful conclusion through our joint leadership,\" he said.\nFox News' Kara Rowland and The Associated Press contributed to this report.\nAdvertisement\nTrending in Politics 1 Reid throws brakes on Obama trade push 2 States wasting millions by getting sloppy on ObamaCare’s Medicaid rolls, critics say 3 Hillary flips for amnesty 4 Feds to regulate Christmas lights 5 Huckabee announces 2016 White House bid, with focus on economy and security See all Trends Advertisement", "external_links": ["http://www.huffingtonpost.com/2015/05/04/harry-reid-tpp_n_7208076.html"], "published": "2015-05-05T03:00:00.000+03:00", "crawled": "2015-05-05T22:04:35.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}