{"organizations": [], "uuid": "cc7e6fab2c18687d7f7046661e2a46fbe87da425", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/050813/0/0/050813_hn_househearing_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/09/liberal-media-spin-benghazi-scandal-to-protect-team-obama.html", "country": "", "title": "Liberal media spin Benghazi scandal to protect Team Obama | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Liberal media spin Benghazi scandal to protect Team Obama | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "cc7e6fab2c18687d7f7046661e2a46fbe87da425"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/09/liberal-media-spin-benghazi-scandal-to-protect-team-obama.html", "ord_in_thread": 0, "title": "Liberal media spin Benghazi scandal to protect Team Obama | Fox News", "locations": ["Benghazi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boehner"], "text": "Boehner calls for release of Benghazi emails as pressure grows on administration \nNBC said there was an “ obvious political undercurrent ” to the hearings and accused the GOP of going after the “most popular Democrat,” Hillary Clinton. \nThe New York Times public editor criticized her own paper’s Benghazi coverage and The Washington Post’s Twitter account inexplicably mocked those Tweeting about the case as “Chick-fil-A lovers.” AP even called it a “GOP” hearing, to make sure readers saw it as partisan. \nA Politico story about CBS showed the truly insidious nature of media bias on this story and how the network held back Emmy award-winning reporter Sharyl Attkisson. “CBS News executives see Attkisson wading dangerously close to advocacy on the issue, network sources have told Politico,” wrote Dylan Byers. So much so that Attkisson is “ in talks to leave CBS ahead of contract .” As a result, she hadn’t even reported on the Libya attack for five months . \nIt hasn’t just been CBS that has been trying to corral this story. New York Times coverage might still damage the administration even though that paper has tried to prevent it. MSNBC's sometime conservative, former Florida Republican Congressman Joe Scarborough, even Tweeted about Thursday’s Times story, saying it “should cause great concerns in the White House.” \nThat piece, “Diplomat Says Questions Over Benghazi Led to Demotion,” detailed State Department retaliation against one witness, saying “the prospects for the 2016 presidential election” could be impacted. \nOf course, the article minimized that impact. “Mr. Hicks offered an unbecoming view of political supervision and intimidation inside the Obama administration,” wrote three Times staffers. \nUnbecoming? Quite the understatement. Hey, sorry we ruined your career. That’s so unbecoming. \nPublic Editor Margaret Sullivan took her own paper to task , but also blamed Fox News for having “fomented” criticism of the Times. “In fact, what’s been written in The Times has been solid. But my sense is that, starting last fall, The Times has had a tendency to both play down the subject, which has significant news value, and to pursue it most aggressively as a story about political divisiveness rather than one about national security mistakes and the lack of government transparency,” she concluded. \nThe Washington Post’s Dana Milbank treated the testimony as if witnesses were lying. His column called the sworn comments a “yarn” and referred to our No. 2 diplomat in Libya as a “virtuoso storyteller.” Milbank pushed the standard lefty response you can expect to see at least till November, 2016: “Hicks didn’t lay a glove on the former secretary of state Wednesday.” \nIt wasn’t just the traditional media spinning for Team Obama. Lefty outlets did their darnedest to downplay the death of four Americans, including the only U.S. ambassador killed since 1979. \nOn MSNBC, NBC News Political Director Chuck Todd undercut the scandal on the May 8 “Morning Joe.” Todd called the decision to not send more special ops forces to Benghazi “very rational.” Host Rachel Maddow blasted the GOP on her May 8 show for an organized conspiracy to make Obama resign, calling it “the most ambitious thing they have done.” \nComedian Jon Stewart devoted 8 and a half minutes attacking the GOP for the hearings, even bringing up Nixon cover-ups and saying the party has “a history of hysteria.” Increasingly, his role isn’t to make jokes. It’s as Obama’s Youth Ambassador/Spinmeister. \nThe liberal propaganda site Huffington Post incredibly didn’t even mention the hearings on the front page, just an attack on Fox’s coverage. Buried on the Politics page was the approved Democratic spin: “Benghazi Hearing Reveals Incompetence, But No Cover-Up.” Instead, it found room for stories on food addiction, “the female word for blowjob,” and “ The Incredible Name Kevin Spacey Picked For His Rescue Dog .” \nOther liberal sites went even further, ignoring the hearing and the testimony entirely. The Nation, Alternet and Democracy Now had no visible coverage. That’s a far cry from how the left reacted to even something as mundane as the NRA convention , where no terrorists killed four Americans. \nIt doesn’t really matter how they spin it, the news continues to get out. But if all major news outlets do is cover for the administration, they may well succeed in protecting their 2016 candidate. \nDan Gainor is the Media Research Center's Vice President for Business and Culture . He writes frequently about media for Fox News Opinion. He can also be contacted on Facebook and Twitter as dangainor. \n", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:19:04.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}