{"organizations": ["First State Legalized Gay Marriage of   Massachusetts", "DC", "International Day Against Homophobia", "National Organization for Marriage and Family Research Council", "Catholic Church", "American Psychiatric Association", "Supreme Court"], "uuid": "dc13db50d8ee0bbf856322f16d0d4f494f802326", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2959604/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/16/obama-lgbt-rights_n_7298510.html", "country": "", "title": "Obama Says All People Deserve To Live Free Of Discrimination For International Day Against Homophobia", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama Says All People Deserve To Live Free Of Discrimination For International Day Against Homophobia", "spam_score": 0.0, "site_type": "news", "published": "2015-05-17T01:50:00.000+03:00", "replies_count": 0, "uuid": "dc13db50d8ee0bbf856322f16d0d4f494f802326"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/16/obama-lgbt-rights_n_7298510.html", "ord_in_thread": 0, "title": "Obama Says All People Deserve To Live Free Of Discrimination For International Day Against Homophobia", "locations": ["Washington", "Hollywood"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Pope Francis", "Bill Clinton", "Anne Hathaway", "Ellen DeGeneres", "Brad Pitt", "Lady Gaga", "Obama"], "text": "10 Incredible Improvements For LGBT People Since The First State Legalized Gay Marriage of   Massachusetts became the first state to welcome gay marriages in 2004. Since then, 17 states and Washington, DC have followed their lead and now allow same-sex couples to tie the knot. Only 37 percent of Americans supported marriage equality for same-sex couples in in 2003. Now, in 2014, 59 percent of individuals support this right. The Defense of Marriage Act (DOMA) passed in 1996, barring same-sex couples from marrying at the federal level. The Supreme Court struck down the core of this legislation in 2013, ensuring 1,100+ federal protections for gay couples. The American Psychiatric Association announced in December 2012 that identifying as transgender is no longer considered a disorder, 38 years after removing same-sex attraction from its list of disorders. President Barack Obama made history in 2012 when he came out in support of marriage equality for same-sex couples. The decision made him the first American sitting president in history to make such a move. Over the past ten years we've seen an explosion of support for the LGBT community in Hollywood, from LGBT celebrities themselves like Lady Gaga and Ellen DeGeneres, to non-queer allies like Brad Pitt and Anne Hathaway. President Barack Obama signed the repeal of \"Don't Ask, Don't Tell\" in September 2011, reversing President Bill Clinton's 1993 legislation that barred lesbians and gays from serving openly in the military. Transgender individuals, however, are still not allowed to openly reveal their gender identity while serving. Anti-gay organizations such as the National Organization for Marriage and Family Research Council are becoming increasingly silent and slowly losing funding. The Catholic Church has also begun to show a shifting away from anti-gay attacks, particularly with Pope Francis' iconic \"Who am I to judge?\" proclamation. In 2010, President Obama ordered that hospitals receiving Medicare and Medicaid payments must grant patients the right to designate who can visit and consult with them, enabling hospital visitation rights for same-sex couples. Couples fighting for the right to marry are continuing to legally challenge their right to marry at the state level. There are currently more than 70 active cases in approximately 30 states.  Share ", "external_links": [], "published": "2015-05-17T01:50:00.000+03:00", "crawled": "2015-05-17T01:50:29.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}