{"organizations": [], "uuid": "7661c17792b78f58a7fbf7b9b0ec1a3e863b907b", "thread": {"site_full": "latino.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn-latino/news/0/0/IMMIG%20RECROP.jpg", "site_section": "", "section_title": "", "url": "http://latino.foxnews.com/latino/opinion/2015/05/19/opinion-immigration-relief-movement-building-moment/", "country": "", "title": "Opinion: Immigration relief, a movement-building moment | Fox News Latino", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Opinion: Immigration relief, a movement-building moment | Fox News Latino", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "7661c17792b78f58a7fbf7b9b0ec1a3e863b907b"}, "author": "", "url": "http://latino.foxnews.com/latino/opinion/2015/05/19/opinion-immigration-relief-movement-building-moment/", "ord_in_thread": 0, "title": "Opinion: Immigration relief, a movement-building moment | Fox News Latino", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Daniel Altschuler", "Javier H. Valdés"], "text": "Opinion: Immigration relief, a movement-building moment By Javier H. Valdés and Daniel Altschuler Published May 19, 2015 Fox News Latino Getty Images \nGuillermo Pintado watched the television screen with rapt attention. Surrounded by several hundred of her boisterous neighbors in the Jackson Heights office of Make the Road New York—where people were crammed into every classroom, meeting space, and hallway to watch on whatever screen they could find—he felt the energy, excitement, and emotion of her community on the cusp of saying goodbye to fear. In New York City, we won a historic municipal ID program and the expulsion of ICE from Rikers Island—a victory that was part of a broader movement to end local law enforcement collaboration with ICE in jurisdictions around the country. \n- Javier H. Valdés and Daniel Altschuler \nThe date was November 20th, 2014, and he and his neighbors were gathered to watch President Obama’s immigration announcement, in which he would announce that he was taking executive action to protect as many as five million undocumented immigrants from the specter of being deported and separated from their families. Guillermo, a single parent who has three US-citizen children, was among those that the President pledged to protect. When the President concluded his remarks, cheers and chants of ¡Sí se puede! rang through the community center and, no doubt, thousands more like it around the country. \nFor millions of immigrants like Guillermo, the President’s announcement brought enormous hope—for their families, it meant a near future in which they would not fear waking up one morning to find that their mothers, fathers, or siblings had been detained or deported. But it was also a bittersweet moment: while the President’s immigration relief would protect as many as five million people, at least six million more were left without the same protection, and perhaps more vulnerable to the ramped-up activity of the Immigration and Customs Enforcement (ICE), which has continued its ferocious ramp-up since 2001 and has deported more than two million immigrants since President Obama took office. For the immigrant rights movement, this much was clear: with six million people excluded and no pathway to citizenship (which must be a part of any ultimate Congressional solution) on the table for the five million, we have a tremendous amount of work to do to continue to build our communities’ power and win the path to citizenship that immigrant families so desperately need. \nIn the immediate aftermath of the President’s announcement, the focus of many organizations across the country like ours turned to implementation. It is absolutely critical that community groups ensure that our members have all the right information about what they can, and cannot, apply for, and do not fall prey to unscrupulous con artists and notarios who would sell them a false bill of goods. We must ensure that as many eligible people as possible apply for the President’s immigration relief initiative, so that immigrant families will be protected from our still-broken immigration system—which continues to invest disproportionately in enforcement without any mechanism for providing those people who are already here with a path to citizenship. That’s why, in the same Queens office where immigrants gathered to watch the President’s speech, the next day we began information sessions and legal pre-screening for community members. (While an anti-immigrant federal judge has temporarily enjoined the policy’s implementation, we remain confident—based on the judgment of myriad legal experts—that it will be adopted soon.) \nBut, because we know that our fight will continue, social movement organizations around the country must commit to making this year be about more than just effective implementation: we must also take advantage of this time as a critical movement building moment. In recent years, immigrant rights organizations across the country have organized and mobilized in unprecedented ways. Millions of immigrants from coast to coast have organized for federal legislation providing a path to citizenship. And, while the fight for comprehensive immigration reform was unable to sway an intransigent House Republican leadership to permit a vote on the matter (that would have likely passed if brought to the floor), groups have simultaneously launched state and local campaigns that have won important policy victories. \nFor instance, in New York City, we won a historic municipal ID program and the expulsion of ICE from Rikers Island—a victory that was part of a broader movement to end local law enforcement collaboration with ICE in jurisdictions around the country. In the aftermath of the President’s executive action announcement, and with the knowledge that the Republican leaders of the Senate and the House will not likely allow a vote on any reasonable immigration reform legislation before 2017, we must focus on 2015 as a moment to expand our base and re-engage those who were disillusioned with Congress’ failure to act. Administrative relief offers the perfect opportunity for engagement. In the months to come, groups need to be out in the streets every day conducting outreach about immigration relief and where and how to apply for it. (Following the temporary injunction, we must also dispel rumors and misunderstandings about what this means, as many in our communities remain confused and frightened.) As we do that, it’s critical that we are also encouraging every new person we contact to join the movement that will continue to fight for a path to citizenship for all 11 million undocumented immigrants in this country. At Make the Road New York, we are doing that in a number of ways. First, we have included political education and an invitation to become a member in every information session that we have held since last November. Second, we have begun—and are planning to ramp up—extensive outreach into the immigrant communities where we work in New York City and Long Island to meet people where they are and to bring them into the fold. Third, we follow up with each new member to integrate them into the organization and fight alongside their neighbors on a range of issues. The results thus far have been impressive. Within the first six weeks following the President’s announcement, we increased our membership by approximately 500 people, and our offices and member committee meetings have been packed. Of course, we are not alone in this approach. To have the ultimate impact that we need (federal legislation that provides a path to citizenship for all eleven million undocumented immigrants), this movement building approach must be national in scope. That's why we’re working with national networks like the National Partnership for New Americans, the Center for Popular Democracy, and United We Dream, so that organizations like ours can share our experiences with, and learn from, our allies around the country. These next months will be critical. Even as the legal wrangling continues, our movement must be out in the streets engaging the millions of immigrants who will benefit from immigration relief—as well as those who will not. In recent years, we have grown in strength and numbers, but, to win the change we need in Washington, we must get even bigger and stronger. We know that progressive social and political change only comes through sustained pressure from bold, powerful social movements. In 2015, we must be committed to responding to the opportunity brought by President Obama’s immigration relief to become bolder and more powerful than ever. Javier H. Valdés and Daniel Altschuler are, respectively, the Co-Executive Director and Civic Engagement and Research Coordinator of Make the Road New York, the largest participatory immigrant rights organization in New York. \nLike us on Facebook ", "external_links": [], "published": "2015-05-19T03:00:00.000+03:00", "crawled": "2015-05-20T01:33:33.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}