{"organizations": ["Facebook", "Fox News Obama", "Twitter"], "uuid": "1c64d334300a169191f122143c4cab76e5e4e32d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/obamadakotasouthinternal454.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/05/08/obama-reaches-50-state-personal-milestone-with-south-dakota-visit/", "country": "", "title": "Obama reaches 50 state personal milestone with South Dakota visit | Fox News", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama reaches 50 state personal milestone with South Dakota visit | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-09T03:58:00.000+03:00", "replies_count": 0, "uuid": "1c64d334300a169191f122143c4cab76e5e4e32d"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/08/obama-reaches-50-state-personal-milestone-with-south-dakota-visit/", "ord_in_thread": 0, "title": "Obama reaches 50 state personal milestone with South Dakota visit | Fox News", "locations": ["S.D.", "Watertown", "South Dakota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama reaches 50 state personal milestone with South Dakota visit Published May 08, 2015 Facebook 0 Twitter 0 Email Print May 8, 2015: President Obama waves to supporters before leaving the Watertown Regional Airport in Watertown, S.D., where he gave a commencement address at a community college. (AP) \nWATERTOWN, S.D. – President Richard Nixon did it in less than three years. President George H.W. Bush completed it in one term. President Barack Obama has now matched their feat by visiting South Dakota, his 50th state, on Friday. \nIt took him nearly 6 1/2 years. \n\"I am thrilled to be here,\" Obama said, opening his commencement address for Lake Area Technical Institute and promoting his proposal for free community college. \"I have now been to all 50 states as president and I was saving the best for last. \n\"To the other 49, I hope you take no offense,\" he added. He's now the fourth president to set foot in every U.S. state. \nLake Area Tech is among the nation's top community colleges, recognized for rigorously preparing students and for a two-year graduation rate that's higher than the national average. Obama said community college education should be available to everyone, just like K-12 education, because the schools play such an important role in preparing students for the high-skilled, technical jobs of the future. \n\"As a country we can't afford to let any striving American be priced out of the education they need to get ahead,\" he said. \nIn just two years, community colleges like Lake Area Tech can change lives, change careers and benefit their communities, Obama said. The graduates inspired him, he said. \n\"That's why I came here today, to this little tiny school in a little tiny town,\" he said. \nObama had traveled to 46 states by the start of the year, leaving four reliably Republican states on the to-visit list. \nTrips to Idaho and South Carolina -- two of those remaining -- were quickly arranged, followed by Utah. \nObama had been to South Dakota before Friday's stop, but that came in 2008 when he was campaigning for president. Last year, he spoke in North Dakota at the Standing Rock Indian Reservation that straddles South Dakota. Advertisement ", "external_links": [], "published": "2015-05-09T03:58:00.000+03:00", "crawled": "2015-05-09T03:58:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}