{"organizations": ["Fox News Health"], "uuid": "456ad82bbc3bb99ac901b015863d96dc633b538d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/100113/0/0/amhq_obama_100113.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/01/obama-just-as-responsible-for-government-slimdown-as-republicans.html", "country": "", "title": "Obama just as responsible for government 'slimdown' as Republicans | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama just as responsible for government 'slimdown' as Republicans | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "456ad82bbc3bb99ac901b015863d96dc633b538d"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/01/obama-just-as-responsible-for-government-slimdown-as-republicans.html", "ord_in_thread": 0, "title": "Obama just as responsible for government 'slimdown' as Republicans | Fox News", "locations": ["America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Health care solution America needs is not ObamaCare -- a small business owner's perspective \nHe rewarded Wall Street bankers who supported his campaign with new lending regulations that help them acquire regional banks. \nNow, more than half of the nation’s deposits are concentrated among a handful of Manhattan casinos, middle class Americans can’t get decent rates on savings, and small businesses can’t get adequate credit. \nObama imposed other regulations in manufacturing and energy production that reward his constituents, punishing his opponents and slowing growth in an economy increasingly challenged to create enough well-paying jobs. \nPrior to the Affordable Care Act, every major piece of social legislation was accomplished by seeking a bipartisan consensus. \nInstead, Democratic leaders Pelosi and Reid wholly excluded Republicans from deliberations, and created an unpopular system that compels businesses to purchase health insurance for employees, and individuals lacking employer polices to purchase plans through government-run exchanges. \nThrough town meetings, polls and a senate election in Massachusetts, Americans expressed opposition. Yet, Democratic leaders packaged the final legislation into a budget reconciliation bill, avoiding the need to win any GOP votes in the Senate—an unprecedented maneuver for such a major piece of legislation. \nThe individual mandate also raised serious constitutional challenges, but Obama proceeded to warn Chief Justice Roberts not to mess with his law at the 2012 State of the Union Address. Caving to pressure, Roberts wrote a decision whose legal reasoning few ideologically neutral legal scholars could approve. \nMicromanaging one-sixth of the U.S. economy is proving to be a nightmare. Facing huge rate increases and burdensome regulations, businesses are dropping insurance coverage Obama promised ordinary Americans they would be able to keep. \nIn 2010, Republicans won control of the House on a platform to curb spending and repeal ACA. Obama’s 2012 reelection was hardly a mandate to implement the law without substantial changes, because Republicans again won the House on promises to repeal the law. \nCongressional Republicans behaved badly—demanding wholesale repeal of the law, when they simply don’t have the votes in the Senate and Obama is still president. \nHowever, in the more recent effort to craft a continuing resolution to keep the government funded, they have indicated significant willingness to deliver what Americans expect—compromise. \nAsking the president to postpone the individual mandate one year, as he has done for the employer mandate, and requiring the Congress to obtain their health insurance on the same terms the ACA requires for ordinary Americans are quite reasonable. The president’s refusal to accept any changes in the ACA and special treatment for politicians is tyranny. \nTerms Republicans have laid down for raising the debt ceiling—more development of offshore oil, rethinking financial reform and changes to other regulatory policies—are broadly consistent with the public sentiment for a focus on jobs creation. \nIf the debt ceiling is not raised by October 17, the United States need not default on its debt as the president threatens. \nThe Treasury continues to collect taxes, and the president will simply have to prioritize what bills he pays, what services he suspends, and place interest payments ahead of other items. \nRealizing presidents shape the public dialogue in crises, he is pressuring House Republicans to deny their obligations to constituents lest he put on them the blame for a government shutdown and perhaps a default. \nPeter Morici served as Chief Economist at the U.S. International Trade Commission from 1993 to 1995. He is an economist and professor at the Smith School of Business, University of Maryland, and a widely published columnist. He is the five time winner of the MarketWatch best forecaster award. Follow him on Twitter @PMorici1 . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:09:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}