{"organizations": [], "uuid": "e7f52154c297dbc44eaac77bac6b251b54f765a3", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/video_images/kurtz_12.jpg", "site_section": "http://thehill.com/rss/syndicator/21684#", "section_title": "TheHill - Video", "url": "http://thehill.com/video/in-the-news/240704-betty-white-tops-obama-in-dinner-date-poll", "country": "US", "title": "Betty White tops Obama in dinner date poll", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Betty White tops Obama in dinner date poll", "spam_score": 0.0, "site_type": "news", "published": "2015-04-30T23:51:00.000+03:00", "replies_count": 0, "uuid": "e7f52154c297dbc44eaac77bac6b251b54f765a3"}, "author": "The Hill Staff", "url": "http://thehill.com/video/in-the-news/240704-betty-white-tops-obama-in-dinner-date-poll", "ord_in_thread": 0, "title": "Betty White tops Obama in dinner date poll", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Betty White tops Obama in dinner date poll By The Hill Staff - 04/30/15 04:51 PM EDT \nThe Hill's In The Know columnist Judy Kurtz joins Fox 5 for a game of \"Who Would You Rather Have Over for Dinner?\" ADVERTISEMENT Spolier alert: Betty White wins, even beating out President Obama.\nWatch the full segment in the video above. Thousands of new Lerner emails... Congressional committees say an inspector general found roughly 6,400... Baltimore mom praised for smacking... \"I don't want him to be a Freddie Gray,\" Toya Graham said. Faith leaders demand that liberal... Scott Lively slammed Justices Kagan and Ginsburg for officiating same-sex... Brent Budowsky: Holy war against... OPINION | Republicans lead a party that looks like little more than an... Internet up in arms over '... An activist was seemingly plucked off the streets in full view of news... Dems hammer Japanese prime... Honda said Abe's \"refusal to squarely face history\" is an insult to so-... GOP unveils budget deal that seeks... The deal would approve more than $5 trillion in spending cuts over a... Baltimore teen disciplined by mom... \"I understand how much my mama really cares about me,” Michael Singleton... Sanders to launch presidential bid The independent senator will enter the Democratic fray Thursday to... Obama accidentally crashes WH... The president walked in on some of the journalists who cover him having... Young voters want a Democrat in... A poll of millennials shows a Democrat has wide support among 18-29-year-... Senators clash over Iran votes Democrats are warning that all bets are off if controversial amendments... Justice Kennedy doesn't reveal... The Supreme Court's most frequent swing vote sent mixed messages Tuesday. Dem to bring Korean 'comfort woman... Rep. Mike Honda (D-Calif.) has the Japan government of failing to own up... Senators vote to block EPA’s use... A Senate committee voted Tuesday to prohibit the Environmental Protection... Reid: 'Journalism doesn't exist' Reid hailed a man who peddled a false story about the minority leader... How Jeb Bush will win in 2016 Bush will find only one path to victory in 2016: through his brother,... Paul blames 'breakdown in the... '16 GOP hopeful says there are \"root, cultural causes\" for violence but \"... Carson slams rioters: 'It makes no... “Reacting out of anger seldom leads to anything helpful,” the possible... Sanders: ‘I am running for... The Vermont Independent told the AP he was all-in for 2016 on Wednesday.", "external_links": [], "published": "2015-04-30T23:51:00.000+03:00", "crawled": "2015-05-01T00:05:47.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}