{"organizations": [], "uuid": "ae5969f34f7954ce783568c4d7fb1812b7e97268", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2936340/images/o-JEB-BUSH-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/05/11/jeb-bush-critica-obama-libertad-religiosa_n_7256968.html", "country": "", "title": "Jeb Bush critica a Obama por limitar la libertad religiosa", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Jeb Bush critica a Obama por limitar la libertad religiosa", "spam_score": 0.0, "site_type": "news", "published": "2015-05-11T19:12:00.000+03:00", "replies_count": 0, "uuid": "ae5969f34f7954ce783568c4d7fb1812b7e97268"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/05/11/jeb-bush-critica-obama-libertad-religiosa_n_7256968.html", "ord_in_thread": 0, "title": "Jeb Bush critica a Obama por limitar la libertad religiosa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Jeb Bush critica a Obama por limitar la libertad religiosa Publicado: reddit \nLYNCHBURG, Virginia, EE.UU. (AP) — El exgobernador de Florida Jeb Bush condenó al gobierno de Barack Obama por usar el \"poder federal coercitivo\" para limitar la libertad religiosa, durante un discurso ante conservadores cristianos en la Universidad Liberty, previo a una posible candidatura presidencial. \nSubrayando que \"la voz cristiana\" no se escucha lo suficiente alrededor del mundo, el aspirante republicano a la Casa Blanca, criticó la administración del presidente demócrata por \"exigir obediencia sin importar en lo absoluto la consciencia religiosa\". \n\"Lo que deberían ser sencillos llamados a favor de la libertad religiosa se han convertido en una agresiva postura en contra de ella\", comentó Bush ante unas 34.000 personas que asistieron a la ceremonia de graduación. \nLa ceremonia se realizó al interior de un estadio en la Universidad Liberty, un instituto fundado por un guerrero cultural conservador, el reverendo Jerry Falwell. \n\"Alguien aquí tiene un criterio muy corto y mucha intolerancia, y no son las monjas, ministros y los laicos que solo buscan vivir y practicar su fe\", comentó. \nBush, convertido al catolicismo, se prepara para entrar en las primarias republicanas que incluyen a contendientes más populares entre los más religiosos del partido. El senador de Texas, Ted Cruz, anunció su campaña presidencial el mes pasado en Liberty University. El ex gobernador de Arkansas, Mike Huckabee, un pastor bautista, el gobernador de Louisiana, Bobby Jindal y el ex gobernador de Texas, Rick Perry, han establecido que su fe cristiana será pieza central de sus posibles campañas presidenciales. \nTodos ellos han criticado de manera agresiva las reformas de salud de Obama, que requieren que organizaciones afiliadas a la religión brinden seguros de salud a sus empleados, y eso incluye métodos de control natal. La medida es uno de varios ejemplos que, de acuerdo a los republicanos, representan ataques de Obama a la libertad religiosa. También en HuffPost Voces   Jeb Bush y su esposa Columba a su llegada a la biblioteca presidencial George W. Bush en Dallas, el 25 de abril de 2013. Jeb Bush con su hijo Jebbie y su esposa Columba mientras esperaban que las urnas cerraran el 8 de noviembre de 1994. Foto tomada en una suite en el hotel Crowne Plaza en Miami. George Bush y miembros de la familia en Washington el 1 de mayo de 1979, el día en que formalmente anunció que se postulaba para la presidencia por el Partido Republicano. El presidente George Bush con miembros de la familia durante la Convención Republicana en Houston. Bush sentado al lado de Columba, la esposa de Jeb Bush, y de la primera dama Barbara Bush. El gobernador de Florida, Jeb Bush, al centro, jura para un segundo término el 7 de enero de 2003. Junto a su esposa Columba y sus hijos: Noelle Bush y George P. Bush. El gobernador de Florida, George W. Bush, y su esposa, Columba, en Alemania con autoridades germanas con el fin de firmar acuerdos para la cooperación universitaria. 14 de noviembre de 2005. El gobernador Jeb Bush besa a su esposa Columba en un festival para la familia en Tallahassee. 26 de septiembre de 2005. Jeb Bush y su esposa Columba durante un evento para discutir el uso y control de drogas. 7 de junio de 2006. Gobernador de Florida, Jeb Bush, el segundo de la izquierda, su esposa Columba, con Luis Alberto Moreno, presidente del Banco Interaméricano, a la izquierda y el senador Mel Martínez, de pie y aplaudiendo. 6 de septiembre del 2006. Columba Bush en un discurso el 5 de septiembre de 2007. En la iglesia católica St. Jude en Miami, donde Jeb Bush y su esposa Columba asistieron a la boda de su hijo, John Ellis Bush, Jr., 29 de mayo de 2010. A su arribo al Hispanic Leadership Network. 18 de abril de 2013 en Coral Gables. El exgobernador de Florida, Jeb Bush, con su esposa Columba. Escuchando a su hijo George P. Bush. 4 de noviembre de 2014.  Compartir ", "external_links": [], "published": "2015-05-11T19:12:00.000+03:00", "crawled": "2015-05-11T21:29:38.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}