{"organizations": ["Amtrak", "Democratic Connecticut", "Northeast Corridor", "House", "CNN"], "uuid": "6ecd1abd50a2c51720cacdbb9dcfcf387e96192f", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/14/politics/amtrak-crash-funding-debate/index.html", "country": "", "title": "Obama: More spending needed on infrastructure - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Obama: More spending needed on infrastructure - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-15T02:08:00.000+03:00", "replies_count": 0, "uuid": "6ecd1abd50a2c51720cacdbb9dcfcf387e96192f"}, "author": "", "url": "http://www.cnn.com/2015/05/14/politics/amtrak-crash-funding-debate/index.html", "ord_in_thread": 0, "title": "Obama: More spending needed on infrastructure - CNNPolitics.com", "locations": ["New York City", "New York", "Washington", "Delaware", "Philadelphia", "D-Delaware", "Boston", "R-Idaho"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chris Coons", "Mike Simpson", "Coons", "Michael Nutter", "Obama", "Richard Blumenthal"], "text": "MUST WATCH Sen. Chris Coons slams House committee for Amtrak cuts 08:07 Sen. Chris Coons, D-Delaware, who rides Amtrak between his Delaware home and Washington, called Wednesday's House committee vote \"striking\" and admonished Republicans for cutting Amtrak's budget at a time when he said the public rail system needs more money to modernize its aging infrastructure. \"If we were investing anything like our competitors, we would have a modern national train system,\" Coons said Thursday on CNN's \"New Day.\" \"We have an aging infrastructure that we have to pay for.\" Coons touted Amtrak's increased ridership and revenue in recent years as a reason to invest more in the railways, particularly in the Northeast Corridor that connects Washington and Boston. Democratic Connecticut Sen. Richard Blumenthal also called for increased funding in the wake of the tragedy. But Rep. Mike Simpson, R-Idaho, rebuked Democrats on Wednesday for politicizing the deadly crash. \"Don't use this tragedy in that way,\" he said. \"It was beneath you.\" Amtrak train derails in Philadelphia 17 photos Emergency personnel work at the scene of a deadly train derailment in Philadelphia on Wednesday, May 13. An Amtrak train headed from Washington to New York City crashed Tuesday night in Philadelphia. Eight people were killed and more than 200 were injured. Hide Caption 1 of 17 Amtrak train derails in Philadelphia 17 photos Rescue crews and investigators inspect the crash site on May 13. The impact of the crash tore cars apart, sending seven of them flying from the tracks. It also left the engine a mangled mess. Hide Caption Amtrak train derails in Philadelphia 17 photos Crews work amid the wreckage on May 13. Hide Caption 3 of 17 Amtrak train derails in Philadelphia 17 photos The Amtrak information board in New York shows the derailed train as canceled on May 13. Hide Caption 4 of 17 Amtrak train derails in Philadelphia 17 photos Philadelphia Mayor Michael Nutter, at center in the maroon hat, walks with other officials to a news conference near the crash site on May 13. Hide Caption Amtrak train derails in Philadelphia 17 photos Investigators and first responders work at the scene on May 13. Hide Caption Amtrak train derails in Philadelphia 17 photos Workers stand near the wreckage on May 13. Hide Caption Amtrak train derails in Philadelphia 17 photos Police stand between two overturned train cars on Tuesday, May 12. Hide Caption Amtrak train derails in Philadelphia 17 photos Rescue workers help tend to a passenger near the crash site on May 12. Hide Caption Amtrak train derails in Philadelphia 17 photos Emergency personnel work at the scene on May 12. Hide Caption Amtrak train derails in Philadelphia 17 photos Emergency personnel work inside one of the train cars on May 12. Hide Caption Amtrak train derails in Philadelphia 17 photos A passenger is helped away from the scene of the crash on May 12. Hide Caption Amtrak train derails in Philadelphia 17 photos Passengers are helped away from the scene of the crash on May 12. Hide Caption Amtrak train derails in Philadelphia 17 photos Emergency personnel work the scene of the train wreck on May 12. Hide Caption Amtrak train derails in Philadelphia 17 photos A crime scene investigator looks inside a train car on May 12. Hide Caption Amtrak train derails in Philadelphia 17 photos Emergency workers search for the injured on the night of the crash. Hide Caption 16 of 17 Amtrak train derails in Philadelphia 17 photos Members of a local church gather items May 12 to help those affected by the derailment. Hide Caption ", "external_links": [], "published": "2015-05-15T02:08:00.000+03:00", "crawled": "2015-05-15T02:09:44.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}