{"organizations": [], "uuid": "7dc5df6272ed9cec069d2522a7a8377006b44d3c", "thread": {"site_full": "www.cnn.com", "main_image": "", "site_section": "", "section_title": "", "url": "http://www.cnn.com/2015/05/12/politics/trade-senate-democrats-divorce-obama/index.html", "country": "", "title": "Trade highlights Democrats' divorce from Obama - CNNPolitics.com", "performance_score": 2, "site": "cnn.com", "participants_count": 0, "title_full": "Trade highlights Democrats' divorce from Obama - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T14:28:00.000+03:00", "replies_count": 0, "uuid": "7dc5df6272ed9cec069d2522a7a8377006b44d3c"}, "author": "", "url": "http://www.cnn.com/2015/05/12/politics/trade-senate-democrats-divorce-obama/index.html", "ord_in_thread": 0, "title": "Trade highlights Democrats' divorce from Obama - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "ignore", "persons": [], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01\"></div> Trade highlights Democrats' divorce from Obama Updated 1140 GMT (1840 HKT) May 12, 2015 JUST WATCHED Here's why the TPP is such a big deal 03:24 Washington (CNN) If you really want to see how much clout President Barack Obama has on Capitol Hill these days, watch the Senate on Tuesday. The same liberal Democratic senators who stuck with the White House through six years of politically excruciating votes are set to break away in droves to oppose Obama's free trade efforts. Their goal is to block a bill that greases the wheels for the Trans-Pacific Partnership, an enormous 12-country trade deal that Obama wants -- badly -- to add to his legacy. And their open rebellion against their own party's president shows that lawmakers are viewing their own political fortunes as increasingly divorced from Obama's. The internal rift will be forced into the open Tuesday when the Senate casts its first procedural votes on a bill called \"trade promotion authority\" -- or \"fast track.\" JUST WATCHED W.H.: False criticism unnecessary on trade deal 01:35 PLAY VIDEO RELATED: Obama steps in with outsourcer at Nike It would allow Obama to submit trade deals to Congress for an up-or-down vote with no amendments. That's key, trade negotiators say, to getting other countries involved in the talks, like Japan, Australia, Canada and Mexico, to take their own political risks of signing off on a final agreement, knowing American lawmakers won't seek to re-open it later. Both Republican and Democratic aides remain uncertain about the vote's outcome -- suggesting there's a real chance the Senate could fall short of the 60 votes necessary to begin debate on the trade bill. If that happens, it won't mean the bill is dead. Senate Majority Leader Mitch McConnell could shelve it temporarily and bring it back up at a later date. But it would still be a worrisome sign for Obama, who often only seems able to bend Congress to his will when government shutdowns or debt ceiling breaches are at risk. \"At this point it's very questionable,\" whether 60 senators will vote to begin debate, said Sen. Dick Durbin, D-Illinois. \"Most Democrats including those who are supporting fast track really want to know what they are voting for and so far Sen. McConnell has been very furtive in his strategy.\" In public, Obama is at war with liberal firebrand Sen. Elizabeth Warren, who he said this weekend is \"absolutely wrong\" on the issue. All the while, Hillary Clinton, the Democratic front-runner to replace Obama, has been caught in the middle, offering only tepid statements that allude to liberals' concerns without taking a stand for or against the deal. JUST WATCHED Obama calls out Elizabeth Warren 04:04 PLAY VIDEO RELATED: Carly Fiorina breaks with many in GOP on Obama's trade deal Behind the scenes, though, is a simmering anger on Capitol Hill, where Senate Minority Leader Harry Reid, D-Nevada, is miffed at Obama's public criticism of Warren and has urged fellow Democrats to stall the trade bill. If Obama's tough talk is alienating Democrats, the lawmakers are concerned about alienating their base. The AFL-CIO has said it is cutting off all campaign funding to Democrats who back Obama's trade effort. The liberals' complaints are myriad: The deal includes a mechanism that allows corporations to ask an independent arbiter to determine whether countries are living up to their trade obligations; its labor and environmental provisions, while perhaps better than the North American Free Trade Agreement, aren't backed by strong enough enforcement mechanisms; the deal's text is being negotiated in private, by teams that have signed non-disclosure agreements, and lawmakers are only allowed to see the current negotiating text in a room where they can't bring staff, can't take cell phone pictures and can't print copies. Warren is giving voice to those frustrations. \"If the President is so confident it's a good deal, he should declassify the text and let people see it before asking Congress to tie its hands on fixing it,\" she told The Washington Post . White House press secretary Josh Earnest hit back on Monday, insisting that some of Warren's facts are wrong. \"The point is that if Sen. Warren is wondering what she's voting on, then she can walk over to the room that has been established on Capitol Hill, by the U.S. trade representative, and she can read the latest version of the negotiated document,\" Earnest said. JUST WATCHED Obama slammed by left for supporting trade deal 02:55 PLAY VIDEO RELATED: Obama sells trade deal to House Democrats \"So there is no need for this false criticism that the members of Congress aren't aware of what's being negotiated,\" he said. \"If they're not aware of what's being negotiated, it's because they have failed to take the responsibility to read the document.\" Whether Democrats are aligning with Obama or the leadership faction that includes Warren, Reid and the post-2016 Senate Democratic leader-in-waiting, Chuck Schumer of New York, will be publicly revealed for the first time on Tuesday. Several Democrats supported trade promotion authority in the Senate Finance Committee already. They were Ron Wyden of Oregon, Maria Cantwell of Washington, Ben Cardin of Maryland, Bill Nelson of Florida, Tom Carper of Delaware, Mark Warner of Virginia and Michael Bennet of Colorado. But those senators and others are facing pressure to insist that the Senate couple trade promotion authority with several Democratic priorities -- including Trade Adjustment Assistance, which aids workers displaced by international trade. They're also asking for a customs bill and an extension of trade preferences for African countries to be included. \"My expectation is there will be at least 41 people who say all four bills need to go together,\" said Sen. Sherrod Brown, an Ohio Democrat who opposes trade promotion authority. \"It would be a tragedy if TPA gets to the President's desk with no help for workers and with no enforcement mechanisms and that's what Sen. McConnell apparently wants to do.\" Lumping in those Democratic priorities, though, complicates the math on the Republican side, where there is much stronger ideological support for free trade. The influential conservative group Heritage Action's chief executive officer, Michael Needham, said Monday that majority Republicans should block any efforts to link the two. \"Heritage Action has always been a free trade organization, but free-market conservatives are understandably split on this president's request for fast track authority,\" Needham said. \"Including an egregiously ineffective welfare program in a bill intended to promote trade will only exacerbate the problem. Conservatives should oppose any effort to combine these two bills.\" Senate Finance Committee Chairman Orrin Hatch, the Utah Republican who sponsored the trade promotion authority measure along with Wyden and House Ways and Means Committee Chairman Paul Ryan, offered a harsh assessment of Democrats who oppose allowing the bill to move forward. \"It'd be the stupidest thing they could do, because this is the President's prime bill. I'm willing to give it to him. I'm willing to do everything in my power to get it there,\" Hatch said. But, he said, there's no compromise that could come before Tuesday's vote that would result in all four trade bills being rolled up together. \"That isn't going to happen. If it happens, it's over,\" he said. McConnell, a Kentucky Republican, is lobbying hard for the trade bill, warning on the Senate floor Monday that blocking it would be a \"mistake.\" The Kentucky Republican said it's \"already a strong bill, and we'll have an amendment process on the floor that will allow members an opportunity to advance their priorities.\" \"It's incredibly important for American workers that we pass this bill,\" McConnell said. CNN's Ted Barrett and Athena Jones contributed to this report. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01\"></div> White House News ", "external_links": [], "published": "2015-05-12T14:28:00.000+03:00", "crawled": "2015-05-12T14:41:56.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}