{"organizations": [], "uuid": "9f51159da5cc5615fd545fe4cb8f9444943e626c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/10/28/obama-vs-putin-is-cold-war-about-to-return-to-middle-east/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422657850574.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/28/obama-vs-putin-is-cold-war-about-to-return-to-middle-east.html", "country": "", "title": "Obama vs. Putin -- is the Cold War about to return to the Middle East? | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama vs. Putin -- is the Cold War about to return to the Middle East? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "9f51159da5cc5615fd545fe4cb8f9444943e626c"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/28/obama-vs-putin-is-cold-war-about-to-return-to-middle-east.html", "ord_in_thread": 0, "title": "Obama vs. Putin -- is the Cold War about to return to the Middle East? | Fox News", "locations": ["Egypt", "US", "Middle East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Putin", "Obama"], "text": "Senators push for US response to Christian attacks in Egypt \nAfter all, the Obama administration had not only helped Morsi and the MB gain power, but rewarded them with increased assistance even as they created a terror-supporting Islamist dictatorship during its year-long rule. \nAnd now, the revelation in an October 27 analysis by Mark Landler in The New YorkTimes that the Obama administration no longer views Egypt -- \"once a central pillar of U.S. foreign policy\" -- as very important can only inflame that opinion further. \nNational Security Adviser Susan Rice told Landler that the president is now fixed mainly on concluding an agreement with Iran over its nuclear program, solving the crisis in Syria and trying to get results from almost invisible ongoing Israeli-Palestinian talks (about holding real talks) quixotically pushed by Secretary of State John Kerry. \nThis “more modest approach,” as Landler called it, which resulted from a White House-only foreign policy review led by Rice last July and August -- puts at grave risk the survival of the 1979 Egypt-Israel Peace Treaty, our vital priority access to the Suez Canal and crucial anti-terrorism cooperation as well. \nEgypt's sudden demotion, after the nation served as the poster-child for the administration’s disastrous policy of promoting “democracy” by helping Islamists rise through elections in the Arab Spring, probably reflects Obama’s frustration that he cannot get his way with the country's immensely popular new leader, General Abdel-Fattah al-Sisi. \nIn contrast, Putin has been the most-outspoken world leader to defend Morsi’s removal. \nIndeed, many in Egypt--including al-Sisi--have already spoken of trading the three decades-plus alliance with America for one with Russia, while Egyptian-Russian military ties are said to have increased dramatically. \nIn an August 3 phone conversation with U.S. Secretary of Defense Chuck Hagel, al-Sisi is quoted as scolding him, \"You left the Egyptians. You turned your back on the Egyptians, and they won't forget that.” \nOn October 17, Egypt’s Foreign Minister Nabil Fahmy told CNN’s Christiane Amanpour that his country “will find other sources” for military aid if necessary, presumably meaning Russia and possibly China as well. \nPutin’s clever seizure of the initiative to prevent an armed (if “unbelievably small,” in Kerry’s words) U.S. strike on Syria in September over the use of chemical weapons near Damascus on August 21, plus his tough anti-Islamist talk, have turned many heads in the region. \nThe administration’s new Middle East doctrine conveniently justifies Obama’s eager acceptance of Putin’s proposal to send in U.N. teams to deal with Syria’s chemical weapons after he fecklessly flip-flopped over his famous “red line” on their use--which he subsequently denied having drawn in the first place. \nMeanwhile, Obama’s so far limited, but disturbing efforts to aid Morsi’s friends in the Islamist-dominated rebellion against Assad have made him look both wrong-headed and faint-hearted at the same time, in a region where Islamism (happily) may be losing its appeal, and where feebleness is fatally unattractive. \nAlso in September came the charm offensive of Iran’s new president, Hassan Rouhani, which many fear will lead to the U.S. accepting an incomplete plan to cut off Iran’s hydra-headed efforts to develop nuclear weapons in its haste just to cut a deal. \nIn mid-October, the U.S. and five other world powers spoke with the Iranians on the issue for two days in Geneva, to resume November 7--while the latest reports indicate that Iran may be only one month away from having the bomb. \nThis all echoes the forgotten rivalry of the Cold War, when the former Soviet Union was the main supplier of armaments, training and advisers to the anti-Western bloc of Egypt, Iraq, Libya, Syria, Yemen and the then-openly terrorist PLO. \nAfter Egypt switched sides following the 1973 war with Israel, the U.S. was able to impose a sort of Pax Americana, at least as far as that conflict was concerned. \nBut now, as Egypt possibly breaks toward Moscow, while Iran -- like Syria, a Russian ally -- hoodwinks Washington into letting it develop nuclear weapons in the guise of a bogus “grand bargain” -- the old order may give way to a new, unstable Pax Russiana instead. \nAnd that would be far more than a “modest” debacle—for the U.S., the region and the world. \nRaymond Stock, a Shillman-Ginsburg Writing Fellow at the Middle East Forum and a former Assistant Professor of Arabic and Middle East Studies at Drew University, spent twenty years in Egypt, and was deported by the Mubarak regime in 2010. He is writing a biography of 1988 Egyptian Nobel laureate in literature Naguib Mahfouz (1911-2006) for Farrar, Straus & Giroux, and is a prolific translator of his works, most recently \"Before the Throne\" (Anchor Books/Random House, July 2012). ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:11:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}