{"organizations": ["Fox News"], "uuid": "191589b5690cbba5c92c4be44376a679fcb0dcfa", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/08/27/mr-obama-republicans-do-have-health-care-solutions/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422615170866.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/27/mr-obama-republicans-do-have-health-care-solutions.html", "country": "", "title": "Mr. Obama, Republicans do have health care solutions | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Mr. Obama, Republicans do have health care solutions | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "191589b5690cbba5c92c4be44376a679fcb0dcfa"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/27/mr-obama-republicans-do-have-health-care-solutions.html", "ord_in_thread": 0, "title": "Mr. Obama, Republicans do have health care solutions | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "\nIn a troubling denial of reality, President Obama now claims that Republicans have no ideas when it comes to health care, saying “they don’t have an agenda to provide health insurance to people at affordable rates.” \nBut Republicans do have answers – a lot of them. \nThe real problem is the current political alignment in Washington than a lack of ideas. President Obama is singularly focused on implementing his own health care law, not working with those outside his party or in the Congress on better solutions. \n[pullquote] \nThe media also recognizes these solutions will be ignored by the White House until there is a new occupant. So even the most sophisticated MRI can’t find a lot of press coverage of GOP health care ideas. \nBut these political and communications challenges are no excuse for lethargy. Promoting our alternatives and tirelessly working to explain their merits to the American people is essential. \nSpace does not permit a full inventory of all the Republican congressional health care initiatives, so let’s just highlight a few. \nFirst, however, the principles that tie together our new, innovative, bottom-up thinking deserve mention. \n- We support expanding affordable insurance options for all Americans, but not in a one-size-fits-all way. \n- We will protect people with pre-existing conditions, so they are not denied insurance coverage through no fault of their own. \n- Health care should be as decentralized and regulated as close to the people as possible, not run by Washington mandates. \n- We believe in protecting the coverage Americans like, but also want to expand affordable individual-based options for those who seek new and more affordable plans. \n- We preserve and improve Medicare for our seniors by giving them better options and more choices. \n- We strengthen the safety net for the poor and disabled by giving governors flexibility to provide higher quality, innovative services for the most vulnerable. And we ensure medical research continues to find cures for challenging diseases like cancer, Alzheimer’s, and diabetes. \nThese principles are reflected in an assortment of specific legislative and policy proposals Republican lawmakers are working on now, and have offered for the last several years. \nRepresentative Steve Scalise of Louisiana will soon unveil a comprehensive alternative to the president’s health care law that provides tax incentives to provide cheaper insurance options, covers those with pre-existing conditions, and other measures that lower the cost of health care. \nMy colleague Dr. Tom Price of Georgia has introduced the Empowering Patients First Act, another comprehensive alternative to the Affordable Care Act based on many of the same principles. \nRepresentative Marsha Blackburn of Tennessee has offered another affordability solution to allow consumers to purchase insurance across state lines. \nThe list of ideas to make private health care more affordable and accessible could go on. \nBut our menu of health care ideas extends beyond insurance reforms. \nLast year, Senator Orrin Hatch of Utah and I proposed ways to improve Medicaid for our most vulnerable populations. Our flexibility plan allows states to experiment with managed care, streamline the waiver process, and provide states financial incentives to offer better and more innovative care models to those most in need. \nWhen it comes to Medicare, House Budget Chairman Paul Ryan of Wisconsin included long-held Republican ideas about Medicare reform in his plan that provides seniors with more choices and options to select the kind of health care plan that best fits their needs, while guaranteeing that this important safety net will be there for future generations. \nWays and Means Chairman Dave Camp of Michigan and I are working on other reforms to Medicare that simplify the current complex system of deductibles and co-payments and offer new catastrophic protection. Part of this includes medical liability reform. \nAfter more than two years of work in cooperation with Chairman Camp, the Energy and Commerce Committee in July unanimously advanced a bipartisan solution to finally fix the broken Medicare physician payment program – also known as the Sustainable Growth Rate. Our bipartisan success to put the emphasis back where it belongs – on our patients and their doctors - demonstrates the appetite for and ability to achieve success. \nWe recognize the importance of addressing health care innovation, as well as health coverage. \nWe support finding cures and treatments for stubborn diseases that rob family and friends the fullness of life, and we’ve been successful. \nLast year we enacted steps to break down barriers to health innovation, including passage of the GAIN Act. This bill will bring doctors more antibiotics to fight life-threatening infections. \nRep. Blackburn is crafting legislation to foster innovation in mobile medical applications and health information technology. The result would be improved patient care, lowered health care costs, and new American jobs. \nDespite the dire prognosis of the president, congressional Republicans have a broad assortment of new and innovative health care ideas. As the public learns more about the details and consequences of President Obama’s health care medicine, they will clearly demand a second opinion. We’re ready to provide one – or many. \nRepublican Fred Upton represents Michigan's 6th congressional district in the House of Representatives. He is chairman of the House Committee on Energy and Commerce. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:15:05.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}