{"organizations": [], "uuid": "5b400ba102733e122fa948161d7a0de4324c400b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/Marijuana%20Tour_Leff.jpg", "site_section": "http://www.foxnews.com/world/index.html", "section_title": "World News | International Breaking News, Headlines &amp; Video | Fox News", "url": "http://www.foxnews.com/world/2015/05/01/italian-army-growing-medical-marijuana/", "country": "US", "title": "Italian army growing medical marijuana", "performance_score": 2, "site": "foxnews.com", "participants_count": 2, "title_full": "Italian army growing medical marijuana | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T03:00:00.000+03:00", "replies_count": 1, "uuid": "5b9b5495ac213691c34c857c09b6825e66f963f7"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/world/2015/05/01/italian-army-growing-medical-marijuana/#post-0", "ord_in_thread": 0, "title": "Italian army growing medical marijuana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FoxNews.com livefyre Email Print April 25, 2015 - FILE photo of marijuana plants in an operation for both medical and recreational marijuana in northeast Denver, Colorado. In an effort to reduce the cost of medical marijuana for citizens who suffer from chronic pain and other conditions, the Italian military has started a cannabis farm.\nSome might say the Italian army has gone to pot. In an effort to reduce the cost of medical marijuana for citizens who suffer from chronic pain and other conditions, the Italian military has started a cannabis farm.\nThe plants are being grown in a secure room in a military-run pharmaceutical plant in Florence, the BBC reported, citing the Italian newspaper Corriere della Sera. The army expects to produce 220 pounds of marijuana per year and also plans to dry and pack the drug for distribution.\n\"The aim of this operation is to make available to a growing number of patients a medical product which isn't always readily available on the market, at a much better price for the user,\" Col. Antonio Medica told the newspaper.\nMedical marijuana can be beneficial to treat a variety of conditions, particularly managing chronic pain. Doctors can legally prescribe the drug and pharmacies can sell it in Italy, but the cost isn't covered by the state, making it unaffordable for many patients.\nMany pharmacies import medicinal marijuana from abroad - primarily from the Netherlands – but it costs up to 35 euros (about $40) per gram.\n\"We're aiming to lower the price to under 15 euros, maybe even around 5 euros per gram,\" Col Medica said.\nThe army laboratory was chosen for the project because it already had the necessary facilities and could guarantee security with a strong surveillance system in place, Italian Defense Minister Roberta Pinotti said.\nPrivate cannabis cultivation is still illegal in Italy, and selling the drug is also against the law.\n World 1 US envoy deflects insult by Turkish mayor with humor 2 Photos show purported ISIS training camp in Afghanistan 3 African troops involved with French in UN rape report scandal 4 Chinese police raid Uber offices in crackdown 5 Nepal quake death toll at 6,260 as rescue effort, recovery continues See all Trends Fox News Salutes More\nPresident Bush puts spotlight on bravery and sacrifice President Bush's W100K bike ride: Healing House panel issues subpoena in Philadelphia VA probe Advertisement", "external_links": ["http://www.bbc.com/news/blogs-news-from-elsewhere-32531376"], "published": "2015-05-01T03:00:00.000+03:00", "crawled": "2015-05-01T22:56:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}