{"organizations": ["Fox News Abortion"], "uuid": "0a994cd78e9ec6cd1eb9289e7e2bffdadb700c3d", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/05/14/gosnell-trial-revealed-horrors-abortion-media-silence/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422554217294.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/14/gosnell-trial-revealed-horrors-abortion-media-silence.html", "country": "", "title": "Gosnell trial revealed horrors of abortion, media silence | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Gosnell trial revealed horrors of abortion, media silence | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "0a994cd78e9ec6cd1eb9289e7e2bffdadb700c3d"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/14/gosnell-trial-revealed-horrors-abortion-media-silence.html", "ord_in_thread": 0, "title": "Gosnell trial revealed horrors of abortion, media silence | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gosnell"], "text": "Abortion doctor guilty verdict hardly a victory \nGosnell is a monster . He was initially charged “with killing seven babies born alive,\" along with Karnamaya Mongar a newly-arrived, 41-year-old refugee from Bhutan. \nProsecutors say Gosnell's staff gave the 90-pound woman a lethal dose of anesthesia and painkillers during a 2009 abortion,” according to the Associated Press. Some charges were dropped and he was found guilty of three counts of first-degree murder and one count of third-degree murder, as well as “ 211 counts of failing to comply with a state law that requires a 24-hour waiting period before an abortion is performed.” \nThe facts read more like a demon’s resume than a description of a man sworn to heal. One former worker testified that she saw “a late-term baby who survived an abortion ‘swimming’ in a toilet and ‘trying to get out.’” \nAnother child reportedly was big enough “that Gosnell joked it could have walked to the bus.” Child after child had life ended as scissors snipped spinal cords, decapitating them. \nYet this “house of horrors” would never have seen the light of day if the American media had their way. \nMajor outlets ignored the story until conservative anger called them out. The Media Research Center (where I work), Kirsten Powers , Fox News Channel, some in Congress and an army of conservatives on Twitter provided part of the pressure. \nEven then, news coverage was paltry – far less than outlets would devote to any story du jour from Manti Te’o and his invisible girlfriend to endless accounts of the Jodi Arias trial. \nABC was the worst. It took that network a couple years after the arrest and 56 straight days of trial to acknowledge Gosnell existed. ABC found more than three hours of air time for other court cases during that time, but waited until Gosnell was convicted before it ever admitted he was even on trial. \n“Nightline” co-anchor Terry Moran inadvertently admitted the network’s failure during the May 13 “World News with Diane Sawyer” segment. “For two months, jurors heard often shocking, grisly testimony.” Yes, two months of “shocking, grisly testimony” and only one minute and 51 seconds of news coverage at the very end. \nIn short, if you rely on ABC for your news coverage, you are out of luck. It’s that kind of timely newsgathering that would have viewers expecting to see reports on the end of WWII or the sinking of the Titanic later this week. \nThe other two members of the Big Three didn’t impress either. NBC was bad and CBS only a little better. NBC’s Savannah Guthrie asked Obama a question about Gosnell but didn’t even bother to follow it up. And when NBC finally gave an actual report on the case on May 1, it hid the awful nature of the case. The network that had reported on the smell of a decomposing body in the Casey Anthony trial called Gosnell’s crimes “too gruesome” to tell viewers. \nOther outlets were just as averse to reporting the awful story of baby murder. The Washington Post committed to the story after health reporter Sarah Kliff defended her own failure to cover Gosnell because it was a “local crime” story. \nBut it wasn’t a local crime story. It was part of a national belief in infanticide coming directly from the pro-abortion movement. Just in the time of the Gosnell trial, we’ve seen a Planned Parenthood lobbyist and an abortion doctor both show support for baby murder after the child is born. \nAbortion lobbyist Alisa LaPolt Snow told an astonished hearing that the life of a baby born after a botched abortion should be “left up to the woman, her family, and the physician.” \nThe pro-life group Live Action caught a D.C. abortion doctor in an embarrassing admission of, you know, supporting baby murder. “One video features a D.C. doctor, Cesare Santangelo, who said that in the unlikely event that an abortion resulted in a live birth, ‘we would not help it,’” reported the Post. For that reveal, he said he considers the heroes of Live Action to be “terrorists.” \nThat is the world that Kermit Gosnell introduced to America. It’s a world where the liberal fantasies of “safe, available and rare” abortions have been twisted into a convenient rationale for taxpayer-funded baby murder, even after a child is born. It’s an image the abortion community won’t be able to erase. \nDan Gainor is the Media Research Center's Vice President for Business and Culture . He writes frequently about media for Fox News Opinion. He can also be contacted on Facebook and Twitter as dangainor. \n", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:49.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}