{"organizations": ["Senate Advances Fast-Track For Obama Trade Deals Senate"], "uuid": "fd7f22a89ed3f0cc51448ede22bee9b802f1458b", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2978636/images/o-OBAMA-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/21/senate-trade-vote_n_7353138.html", "country": "", "title": "Senate Advances Fast-Track For Obama Trade Deals", "performance_score": 2, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Senate Advances Fast-Track For Obama Trade Deals", "spam_score": 0.0, "site_type": "news", "published": "2015-05-21T18:11:00.000+03:00", "replies_count": 0, "uuid": "fd7f22a89ed3f0cc51448ede22bee9b802f1458b"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/21/senate-trade-vote_n_7353138.html", "ord_in_thread": 0, "title": "Senate Advances Fast-Track For Obama Trade Deals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate Advances Fast-Track For Obama Trade Deals Posted: reddit \nWASHINGTON -- The Senate advanced President Barack Obama's trade agenda Thursday, voting to end debate on bill that would grant the administration power to fast-track massive new pacts through Congress. \nA number of senators objected to the process, complaining that they were unable to get votes on amendments they deemed essential to making sure that looming deals with 12 Pacific Rim nations and Europe live up to promises of helping U.S. workers. \nBut 62 of their colleagues disagreed and voted to halt debate anyway, setting up passage of the fast-track bill by the end of the week. \n\"I'll acknowledge that the process on the floor has not gone the way that any of us would have liked,\" said Sen. Orrin Hatch (R-Utah), the chairman of the Senate Finance Committee and lead sponsor of the measure. He nevertheless argued for passage, saying the nation’s “economic health and prestige are on the line here.\" \nThe measure nearly failed, and only advanced after about a dozen senators engaged in a tense discussion in the middle of the Senate floor while they were still several votes shy. \nFast track, formally known as Trade Promotion Authority, would allow the president to cut trade agreements with other nations, then advance them through Congress with expedited procedures that allow no amendments, filibusters or delays, guaranteeing him simple majority votes. \n\"The TPA bill is the only way Congress can effectively assert its priorities in our ongoing trade negotiations,\" Hatch said. \"It's the only way that we can ensure that our trade negotiators can reach good deals with our trading partners.\" \nBut other senators said there was no reason to hurry to give Obama such sweeping authority. \n\"We're moving to this massive bill with very little debate even on the fast-track policy. And if that's adopted and the bill -- TPP -- appears, there will be no amendments on it,\" said Sen. Jeff Sessions (R-Ala.). \"I see no reason that we have to rush this.\" Sessions added that he has not received enough assurance from the administration that the trade deals will be good for workers. \"I sent a letter to the president of the United States asking how fast-track and the vast Trans-Pacific Partnership would impact the jobs and wages of American workers. A simple question. Would it increase or reduce manufacturing jobs and wages in the United States?\" Sessions said before the vote. \"Shouldn't we know that? Is that a question improper to be asked? He's refused to answer. I think the reason he's refused to answer is because the answer is not good.\" Sen. Sherrod Brown (D-Ohio), who has led opposition to the trade deals on the Democratic side, echoed Sessions. \n\"Historically when we've done trade agreements in this town -- as bad as they've turned out to be for working families ... at least we've had open debate where we could open amendments,\" Brown said. \"The last time we had the Senate debate this there were three weeks of debate. This is about three days.\" \nSenate Majority Leader Mitch McConnell (R-Ky.) pledged that he would allow at least some amendments to get votes, although under Senate rules that will require agreement from the rest of the members. \nWith the procedural hurdle cleared, the bill is expected to pass Friday afternoon. \nHowever, it still faces an uncertain future in the House, where Democrats are nearly united in opposition, and a greater number of Republicans are reluctant to aid Obama's trade ambitions. More: ", "external_links": [], "published": "2015-05-21T18:11:00.000+03:00", "crawled": "2015-05-21T18:52:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}