{"organizations": ["Pentagon", "Defense", "Fox News Carter", "Facebook", "Twitter"], "uuid": "9d367e7aab4757b0c5c04b371b5eff624eb9eff5", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/0/0/CarterISIS660371.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/05/25/defense-secretary-carter-says-iraq-will-to-fight-at-issue-after-ramadi/", "country": "", "title": "Carter saying Iraqi forces losing 'will to fight' sparks more criticism, concern about Obama plan | Fox News", "performance_score": 1, "site": "foxnews.com", "participants_count": 0, "title_full": "Carter saying Iraqi forces losing 'will to fight' sparks more criticism, concern about Obama plan | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "9d367e7aab4757b0c5c04b371b5eff624eb9eff5"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/25/defense-secretary-carter-says-iraq-will-to-fight-at-issue-after-ramadi/", "ord_in_thread": 0, "title": "Carter saying Iraqi forces losing 'will to fight' sparks more criticism, concern about Obama plan | Fox News", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Carter", "Ash Carter", "Obama"], "text": "Carter saying Iraqi forces losing 'will to fight' sparks more criticism, concern about Obama plan Published May 25, 2015 Facebook 0 Twitter 0 Email Print May 1, 2015: In this file photo, Defense Secretary Ash Carter speaks during a news conference at the Pentagon in Washington. (AP) \nThe Iraqi forces defeated by Islamic State fighters in their takeover of Ramadi were not outnumbered and in fact showed “no will to fight,” Defense Secretary Ash Carter said Sunday, an indication that even a top-ranking administration official thinks President Obama’s plan to defeat the extremist group appears in trouble. \nThe Iraqi forces outnumbered their opposition in Ramadi, the capital of Anbar province, in the battle last weekend, Carter said on CNN's \"State of the Union.” \n“What apparently happened is the Iraqi forces just showed no will to fight,” he said. “They were not outnumbered. In fact, they vastly outnumbered the opposing force. That says to me, and I think to most of us, that we have an issue with the will of the Iraqis to fight ISIL and defend themselves.\" \nHakim al-Zamili, the head of Iraq’s parliamentary defense and security committee, immediately responded to Carter’s comments, saying U.S. military commanders are pointing fingers for their own failure to properly support the Iraqi military in the fight against the Islamic State. \nHe also said Carter's comments were \"unrealistic and baseless\" and that the U.S. military is trying to \"throw the blame on somebody else.\" \nThe fall of Ramadi, in central Iraq and about 70 miles west of the capital city of Baghdad, has sparked more questions about the effectiveness of the administration's approach in Iraq -- a blend of retraining and rebuilding the Iraqi Army, prodding Baghdad to reconcile with the nation's Sunnis and bombing Islamic State group targets from the air without committing American ground combat troops. \nThe administration has repeatedly defended its strategy toward stopping the Islamic State’s unexpected and deadly marches into Iraq and Syria, but acknowledged on Monday that the Ramadi takeover was indeed a major loss. \n“No denying it is a setback,” said White House spokesman Eric Schultz. \nThe Ramadi takeover also marks the second time in roughly 12 months that the extremist group has taken control of a major Iraq city -- after the United States spent roughly eight years at war in that country. Obama withdrew the last of U.S. military forces in 2011. \nThe first was Mosul, in a stunning defeat for Iraqi forces last summer that helped the extremist group sweep across much of Iraq’s north and western regions. \nCarter on Sunday defended the use of U.S. airstrikes as an effective part of the fight against the Islamic State, but said they are not a replacement for Iraqi forces willing to defend their country. \nHe also said the Pentagon has no plans to send troops into the region as target spotters, amid criticism from Republican lawmakers and presidential candidates and others that attack planes cannot pinpoint Islamic State sites. \nSome of those critics, including Sen. John McCain, R-Ariz., chairman of the Senate Armed Services Committee, are calling for an additional 10,000 non-combat U.S. troops in the region, among them intelligence-gathers. \nCarter also addressed the growing concern of the Iraqi forces leaving behind a large numbers of U.S.-supplied vehicles, including several tanks. \nThe Pentagon estimates that when Iraqi troops abandoned Ramadi, they left behind a half-dozen tanks, a similar number of artillery pieces, a larger number of armored personnel carriers and about 100 wheeled vehicles like Humvees. \nOver the past year, defeated Iraq security forces have repeatedly left behind U.S.-supplied military equipment, which the U.S. has targeted in subsequent airstrikes against Islamic State forces. \nObama said in an interview with The Atlantic magazine published last week that none of the Iraqi troops that fled Ramadi were trained by the U.S. military. \nHowever, multiple defense officials at the Pentagon disagree. \n\"The United States has trained all of Iraq's 'special forces' at one time or another,\" one official told Fox News. \nLast week, Centcom spokesman Col. Patrick Ryder said the 7,000 Iraqi troops trained in the past year at al-Assad airbase in Iraq by the U.S. military have not been deployed to Anbar Province. \nFox News’ Lucas Tomlinson and The Associated Press contributed to this report. \n", "external_links": [], "published": "2015-05-25T03:00:00.000+03:00", "crawled": "2015-05-25T11:38:52.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}