{"organizations": [], "uuid": "dff7bcdd099e393c60cfd498b300d3d9f5c02053", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2996078/images/o-WEED-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/05/26/marijuana-smoked-salmon-rosenbergs-bagels_n_7444508.html", "country": "", "title": "Marijuana-Infused Smoked Salmon Is The Future Of Breakfast", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Marijuana-Infused Smoked Salmon Is The Future Of Breakfast", "spam_score": 0.0, "site_type": "news", "published": "2015-05-31T11:02:00.000+03:00", "replies_count": 0, "uuid": "dff7bcdd099e393c60cfd498b300d3d9f5c02053"}, "author": "", "url": "http://www.huffingtonpost.com/2015/05/26/marijuana-smoked-salmon-rosenbergs-bagels_n_7444508.html", "ord_in_thread": 0, "title": "Marijuana-Infused Smoked Salmon Is The Future Of Breakfast", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nWhat's better than baked salmon? Salmon that gets you baked! \nTHC-infused treats are everywhere now that legal weed is becoming socially acceptable. But most of the options on the market today are sweet, likely because it's easy to cover up the taste of marijuana with chocolate. \nBut the folks at Rosenberg's Bagels in Denver are pioneers for infusing smoked salmon with THC, bringing weed over to the savory side and, more importantly, to breakfast. \n\"The flavor is really great, not that weed brownie flavor that you try to cover up with chocolate,\" Rosenberg's General Manager Nicholas Bruno (aka Nicky The Fish) told The Huffington Post. \"The dill, lemon and cannabis, everything melds perfectly with the fish.\" \nSadly, you can't buy stoner salmon at the shop and slap it on your bagel -- yet. Rosenberg's tested out the method for a 4/20 celebration video (above), and Nicky said the experiment was so successful that the lox legends plan to bring THC-infused fish to legal weed dispensaries nationwide. \nThe smoked salmon in the video was for its creators' (legal) consumption only. But the video does show you how to make your own. In the clip -- produced by The Smokers Club -- high-inducing THC was extracted from the marijuana plant with Everclear, and then most of the alcohol was burned off, leaving a cannabis oil tincture to be \"cold-smoked\" with the salmon, Nicky said. \nHe told HuffPost Weird News that weed infusions are the future of smoked fish, and we're OK with that. \n\"One day, we'd love to move forward with other fish, like trout, cod or anything we work with, and sell it at dispensaries,\" he said. \"I love fish and I love the infusion, and I want to win a Cannabis Cup for something that's not covered in chocolate.\" Related on HuffPost: ", "external_links": [], "published": "2015-05-31T11:02:00.000+03:00", "crawled": "2015-05-31T11:02:11.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}