{"organizations": ["Facebook", "Twitter"], "uuid": "605a790b1f9956f0c0ea17d1742c655b4c76738c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/xmlfeed/rss/0,4313,2,00.rss", "section_title": "FOX News", "url": "http://www.foxnews.com/politics/2015/05/22/obama-tells-people-israel-america-has-its-back/", "country": "US", "title": "Obama tells people of Israel: 'America has its back'", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Obama tells people of Israel: 'America has its back'", "spam_score": 0.0, "site_type": "news", "published": "2015-05-22T19:48:00.000+03:00", "replies_count": 0, "uuid": "605a790b1f9956f0c0ea17d1742c655b4c76738c"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/22/obama-tells-people-israel-america-has-its-back/", "ord_in_thread": 0, "title": "Obama tells people of Israel: 'America has its back'", "locations": ["America", "Israel"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Obama tells people of Israel: 'America has its back' Published May 22, 2015 Facebook 0 Twitter 0 Email Print \nPresident Obama said Friday he \"forcefully\" objects to suggestions that policy differences between his administration and the Israeli government signal his lack of support for the longtime U.S. ally. \nSpeaking at one of Washington's most prominent synagogues, Obama said the U.S. and Israel should not be expected to paper over differences on Israel's settlement building or the frozen peace process with the Palestinians. \n\"That's not a true measure of friendship,\" Obama told about 1,200 people, including members of Congress, gathered at Congregation Adas Israel. \"The people of Israel must always know America has its back.\" \nThe president's remarks come during a period of deep tension in an already prickly relationship with Israel Prime Minister Benjamin Netanyahu, particularly over Obama's bid to strike a nuclear deal with Iran. Netanyahu views Iran's disputed nuclear program as an existential threat to Israel and has lobbied vigorously against such a deal, including by addressing a joint meeting of Congress earlier this year. \nObama defended the framework deal that negotiators are seeking to finalize by the end of June, saying it would make Israel and the entire region safer. Still, he said given the high stakes, he welcomes scrutiny of the negotiations. \n\"This deal will have my name on it,\" he said. \nThe president and Netanyahu also clashed during the recent Israeli elections over the prime minister's comments on the peace process. Netanyahu said in the lead-up to the election that he no longer backed a two-state solution, though he reversed himself after his party's victory. \nObama also addressed what he called a \"deeply disturbing rise\" in anti-Semitism around the world. He said the world knows from history that this is \"not some passing fad\" and should not be ignored. \nObama's appearance coincided with Solidarity Shabbat, devoted to showing unity by political leaders in Europe and North America against anti-Semitism. \nBefore leaving, Obama visited with a group of pre-school toddlers in a room downstairs with their teachers, entering the small room clapping and stepping to the tune of their Jewish song. \n\"This looks like a pretty well-behaved group, generally before nap time anyway,\" he said. Advertisement", "external_links": [], "published": "2015-05-22T19:48:00.000+03:00", "crawled": "2015-05-22T20:25:39.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}