{"organizations": [], "uuid": "4599eb8bbcd7534261db5367ddebe9ce3c3dd8ef", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media.foxbusiness.com/thumbnails/083013/0/0/083013_fb_peters.JPG?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/30/constitution-allows-obama-to-strike-syria-without-congressional-approval.html", "country": "", "title": "Like it or not, Constitution allows Obama to strike Syria without Congressional approval | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Like it or not, Constitution allows Obama to strike Syria without Congressional approval | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "4599eb8bbcd7534261db5367ddebe9ce3c3dd8ef"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/30/constitution-allows-obama-to-strike-syria-without-congressional-approval.html", "ord_in_thread": 0, "title": "Like it or not, Constitution allows Obama to strike Syria without Congressional approval | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As support for missile strike fades, Obama has other 'red line' options on Syria \nFast forward four years. \nIn announcing the intervention in Libya, Mr. Obama told Congress that he was acting “pursuant to my constitutional authority to conduct U.S. foreign relations and as commander in chief and chief executive.” \nFast forward again to today. \nThe White House again has decided it does not need Congress’s blessing to bomb targets in Syria related to the chemical weapons attack last week, over the objections of 200 members of Congress who are demanding that Obama seek legislative approval. \nRepublican Congressman Justin Amash, for example, claims that it is “unquestionably unconstitutional and illegal” for the president to strike Syria without congressional consent – a position taken not just by isolationist Republicans like Senator Rand Paul but by anti-war Democrats like Jerrold Nadler. \nDespite his mistakes in reading his domestic powers too broadly, this time President Obama has the Constitution about right. His exercise of war powers rests firmly in the tradition of American foreign policy. \nThroughout our history, neither presidents nor Congresses have acted under the belief that the Constitution requires a declaration of war before the U.S. can conduct military hostilities abroad. \nWe have used force abroad more than 100 times but declared war in only five cases: the War of 1812, the Mexican-American and Spanish-American Wars, and World Wars I and II. \nWithout any congressional approval, presidents have sent forces to battle Indians, Barbary pirates and Russian revolutionaries, to fight North Korean and Chinese communists in Korea, to engineer regime changes in South and Central America, and to prevent human rights disasters in the Balkans. \nOther conflicts, such as the 1991 Persian Gulf War, the 2001 invasion of Afghanistan, and the 2003 Iraq War, received legislative “authorization” but not declarations of war. \nThe practice of presidential initiative, followed by congressional acquiescence, has spanned both Democratic and Republican administrations and reaches back from President Obama to Presidents Abraham Lincoln, Thomas Jefferson, and George Washington. \nCommon sense does not support replacing the way our Constitution has worked in wartime with a radically different system that mimics the peacetime balance of powers between president and Congress. \nIf the issue were the environment or Social Security, Congress would enact policy first and the president would faithfully implement it second. But the Constitution does not duplicate this system in war. Instead, our Framers decided that the president would play the leading role in matters of national security. \nThose in the pro-Congress camp call upon the anti-monarchical origins of the American Revolution for support. If the Framers rebelled against King George III’s dictatorial powers, surely they would not give the president much authority. \nIt is true that the revolutionaries rejected the royal prerogative, created weak state governors, and turned a skeptical eye toward federal power. Rejecting these failed experiments, however, the Framers restored an independent, unified chief executive with its own powers in national security and foreign affairs. \nThe most important of the president’s powers are commander-in-chief and chief executive. \nAs Alexander Hamilton wrote in Federalist 74, “The direction of war implies the direction of the common strength, and the power of directing and employing the common strength forms a usual and essential part in the definition of the executive authority.” \nPresidents should conduct war, he wrote, because they could act with “decision, activity, secrecy, and dispatch.” In perhaps his most famous words, Hamilton wrote: “Energy in the executive is a leading character in the definition of good government. . . It is essential to the protection of the community against foreign attacks.” \nThe Framers realized the obvious. Foreign affairs are unpredictable and involve the highest of stakes, making them unsuitable to regulation by pre-existing legislation. Instead, they can demand swift, decisive action, sometimes under pressured or even emergency circumstances, that are best carried out by a branch of government that does not suffer from multiple vetoes or is delayed by disagreements. \nCongress is too large and unwieldy to take the swift and decisive action required in wartime. \nOur Framers replaced the Articles of Confederation, which had failed in the management of foreign relations because it had no single executive, with the Constitution’s single president for precisely this reason. Even when it has access to the same intelligence as the executive branch, Congress’s loose, decentralized structure would paralyze American policy while foreign threats grow. \nCongress has no political incentive to mount and see through its own wartime policy. Members of Congress, who are interested in keeping their seats at the next election, do not want to take stands on controversial issues where the future is uncertain. They will avoid like the plague any vote that will anger large segments of the electorate. They prefer that the president take the political risks and be held accountable for failure. \nCongress's track record when it has opposed presidential leadership has not been a happy one. \nPerhaps the most telling example was the Senate's rejection of the Treaty of Versailles at the end of World War I. Congress's isolationist urge kept the United States out of Europe at a time when democracies fell and fascism grew in their place. Even as Europe and Asia plunged into war, Congress passed Neutrality Acts designed to keep the United States out of the conflict. \nPresident Franklin Roosevelt violated those laws to help the Allies and draw the nation into war against the Axis. While pro-Congress critics worry about a president's foreign adventurism, the real threat to our national security may come from inaction and isolationism. \nMany point to the Vietnam War as an example of the faults of the “imperial presidency.” Vietnam, however, could not have continued without the consistent support of Congress in raising a large military and paying for hostilities. And Vietnam ushered in a period of congressional dominance that witnessed American setbacks in the Cold War, and the passage of the ineffectual War Powers Resolution. Congress passed the Resolution in 1973 over President Nixon's veto, and no president, Republican or Democrat, George W. Bush or Obama, has ever accepted the constitutionality of its 60-day limit on the use of troops abroad. No federal court has ever upheld the resolution. Even Congress has never enforced it. \nDespite the record of practice and the Constitution’s institutional design, critics nevertheless argue for a radical remaking of the American way of war. They typically base their claim on Article I, Section 8, of the Constitution, which gives Congress the power to “declare War.” But these observers read the eighteenth-century constitutional text through a modern lens by interpreting “declare War” to mean “start war.” \nWhen the Constitution was written, however, a declaration of war served diplomatic notice about a change in legal relations between nations. It had little to do with launching hostilities. In the century before the Constitution, for example, Great Britain – where the Framers got the idea of the declare-war power – fought numerous major conflicts but declared war only once beforehand. \nOur Constitution sets out specific procedures for passing laws, appointing officers, and making treaties. There are none for waging war, because the Framers expected the president and Congress to struggle over war through the national political process. \nIn fact, other parts of the Constitution, properly read, support this reading. Article I, Section 10, for example, declares that the states shall not “engage” in war “without the consent of Congress” unless “actually invaded, or in such imminent Danger as will not admit of delay.” \nThis provision creates exactly the limits desired by anti-war critics, complete with an exception for self-defense. If the Framers had wanted to require congressional permission before the president could wage war, they simply could have repeated this provision and applied it to the executive. \nPresidents, of course, do not have complete freedom to take the nation to war. Congress has ample powers to control presidential policy, if it wants to. \nOnly Congress can raise the military, which gives it the power to block, delay, or modify war plans. \nBefore 1945, for example, the United States had such a small peacetime military that presidents who started a war would have to go hat in hand to Congress to build an army to fight it. \nSince World War II, it has been Congress that has authorized and funded our large standing military, one primarily designed to conduct offensive, not defensive, operations (as we learned all too tragically on 9/11) and to swiftly project power worldwide. \nIf Congress wanted to discourage presidential initiative in war, it could build a smaller, less offensive-minded military. \nCongress’s check on the presidency lies not just in the long-term raising of the military. It can also block any immediate armed conflict through the power of the purse. \nIf Congress feels it has been misled in authorizing war, or it disagrees with the president's decisions, all it need do is cut off funds, either all at once or gradually. \nIt can reduce the size of the military, shrink or eliminate units, or freeze supplies. Using the power of the purse does not even require affirmative congressional action. \nCongress can just sit on its hands and refuse to pass a law funding the latest presidential adventure, and the war will end quickly. \nEven the Kosovo war, which lasted little more than two months and involved no ground troops, required special funding legislation. \nThe Framers expected Congress's power of the purse to serve as the primary check on presidential war. During the 1788 Virginia ratifying convention, Patrick Henry attacked the Constitution for failing to limit executive militarism. James Madison responded: “The sword is in the hands of the British king; the purse is in the hands of the Parliament. It is so in America, as far as any analogy can exist.” Congress ended America’s involvement in Vietnam by cutting off all funds for the war. \nOur Constitution has succeeded because it favors swift presidential action in war, later checked by Congress’s funding power. If a president continues to wage war without congressional authorization, as in Libya, Kosovo, or Korea, it is only because Congress has chosen not to exercise its easy check. \nWe should not confuse a desire to escape political responsibility for a defect in the Constitution.A radical change in the system for making war might appease critics of presidential power. But it could also seriously threaten American national security. \nIn order to forestall another 9/11 attack, or to take advantage of a window of opportunity to strike terrorists or rogue nations, the executive branch needs flexibility. \nIt is not hard to think of situations where congressional consent cannot be obtained in time to act. Time for congressional deliberation, which leads only to passivity and isolation and not smarter decisions, will come at the price of speed and secrecy. \nThe Constitution creates a presidency that can respond forcefully to prevent serious threats to our national security. \nPresidents can take the initiative and Congress can use its funding power to check them. Instead of demanding a legalistic process to begin war, the Framers left war to politics. \nAs we confront the new challenges of terrorism, rogue nations and WMD proliferation, now is not the time to introduce sweeping, untested changes in the way we make war. \nJohn Yoo, is a law professor at the University of California at Berkeley . He served as an official in the Bush Justice Department from 2001-03 and is author most recently of \"Taming Globalization: International Law, the U.S. Constitution, and the New World Order\" (Oxford 2013). ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:43.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}