{"organizations": [], "uuid": "305ed6fbf14565e4092c59367614c6720c911e77", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack51215getty.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/241780-senate-deals-stinging-defeat-to-obama-trade-agenda", "country": "US", "title": "Senate deals stinging defeat to Obama trade agenda", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Senate deals stinging defeat to Obama trade agenda", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T21:50:00.000+03:00", "replies_count": 0, "uuid": "305ed6fbf14565e4092c59367614c6720c911e77"}, "author": "iswanson@thehill.com (Alexander Bolton)", "url": "http://thehill.com/policy/finance/241780-senate-deals-stinging-defeat-to-obama-trade-agenda", "ord_in_thread": 0, "title": "Senate deals stinging defeat to Obama trade agenda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate deals stinging defeat to Obama trade agenda Getty Images By Alexander Bolton - 05/12/15 02:50 PM EDT \nSenate Democrats on Tuesday delivered a stinging blow to President Obama’s trade agenda by voting to prevent the chamber from picking up fast-track legislation. \nA motion to cut off a filibuster and proceed to the trade bill fell short of a 60-vote hurdle, 52-45. Sen. Tom Carper (Del.) was the only Democrat to back it. \nSenate GOP Leader Mitch McConnell (Ky.) switched his vote from yes to no to reserve his ability to return to the measure at a later date. ADVERTISEMENT Fast-track is a top legislative priority for the White House, but it has run into significant Senate opposition that has been led by Sen. Elizabeth Warren (D-Mass.). \nIt faces even more opposition from Democrats in the House, and the surprise Senate failure will raise doubts about whether the legislation will make its way through Congress. \nLabor unions and other left-leaning groups have declared war on the fast-track bill, which they argue would ship jobs overseas. The Senate is generally a more pro-trade body than the House, and it has been easier to move trade agreements through the upper chamber. \nThe standoff Tuesday focused on procedure, though there is significant opposition to fast-track itself in the Democratic conference. \nSenate Democrats demanded that McConnell combine the fast-track bill with three other pieces of trade legislation, including a customs bill that would address currency manipulation. \nThe opposition included Sen. Ron Wyden (Ore.) and other pro-trade Democrats who back the fast-track bill. \n“The group is concerned about the lack of a commitment to trade enforcement, which is specifically the customs bill,” Wyden told reporters in explaining his opposition. \nMcConnell has offered to bring to the floor a package combining fast-track, which is also known as Trade Promotion Authority, and Trade Adjustment Assistance, which helps workers displaced by foreign competition. \nBut McConnell has refused to combine those bills with the customs and enforcement act, which includes language cracking down on currency manipulation, and a package of trade preferences for sub-Saharan Africa. \n“Until there is a path to get all four bills passed ... we will, certainly most of us, have to vote no,” Wyden said. \nWyden was joined by Democratic Sens. Michael Bennet (Colo.), Maria Cantwell (Wash.), Dianne Feinstein (Calif.), Claire McCaskill (Mo.), Patty Murray (Wash.), Bill Nelson (Fla.) and Mark Warner (Va.). \nThe White House downplayed the defeat, with press secretary Josh Earnest describing it as a “procedural snafu.” \n“It is not unprecedented for the U.S. Senate to encounter procedural snafus,” he said. “We're going to continue to work through these challenges.” \nEarnest dismissed the notion that the vote is a sign the president's aggressive sales pitch to Democrats on trade has fallen flat. “I would urge you to withhold judgement about the president’s persuasion ability ... until we’ve had a chance to advance this legislation,” Earnest said. \nSenate Finance Committee Chairman Orrin Hatch (R-Utah) and Wyden, the ranking Democrat on the panel, tried to hash out a last-minute agreement to allow the trade package to come to the floor but were unsuccessful. \nHatch said he would urge McConnell to pull the trade package from the floor if Democrats block it. \nIt could return in the next two weeks but Tuesday’s setback means it will be very difficult to pass trade legislation before the Memorial Day recess. \nTwo Republican presidential candidates, Sens. Ted Cruz (Texas) and Rand Paul (Ky.), voted in favor of moving to the trade bill. \nAnother, Sen. Marco Rubio (R-Fla.), missed the vote, as did Sen. Lindsey Graham (R-S.C.), who is considering a White House run. Rubio and Graham also missed Monday's votes. \n— This story was updated at 3:03 p.m. Tags:", "external_links": [], "published": "2015-05-12T21:50:00.000+03:00", "crawled": "2015-05-13T01:16:57.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}