{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "932398d83214a55e40b0f2c947a24f1bc61cf8bb", "thread": {"site_full": "www.foxnews.com", "main_image": "http://www.foxnews.com/content/dam/fox-news/logo/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/05/07/court-strikes-blow-against-obama-administration-on-union-poster-rule.html", "country": "", "title": "Court strikes blow against the Obama administration on union poster rule | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Court strikes blow against the Obama administration on union poster rule | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "932398d83214a55e40b0f2c947a24f1bc61cf8bb"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/05/07/court-strikes-blow-against-obama-administration-on-union-poster-rule.html", "ord_in_thread": 0, "title": "Court strikes blow against the Obama administration on union poster rule | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nFrom the beginning, the Obama administration has demonstrated a willingness to expand federal powers in unprecedented and highly controversial ways in order to serve its own political agenda. \nBut, in the past few months the administration has suffered two major set-backs—all because it has taken a bullish attitude in thumbing its nose at the Constitution. \nFirst, a federal court of appeal held that President Obama violated the law in making appointments to the National Labor Relations Board (NLRB) without consulting Congress as required by the Constitution. And now a federal court has struck down a pro-union rule that the Obama administration’s NLRB illegally adopted without Congressional authorization—in express violation of federal law. \n[pullquote] \nWe have seen the Obama administration take increasingly cavalier legal positions on a whole host of regulatory issues over the past four years. \nRemember that the administration pushed for enactment of the Affordable Care Act with a “vote first, ask questions later mentality.” And that nearly resulted in the Supreme Court striking down the entire health care law when the National Federation of Independent Business (NFIB) and 26 state attorney generals challenged his administration’s authority to enforce a constitutionally dubious mandate requiring individuals to buy health insurance. \nThe administration may have narrowly survived our challenge to the health care law, but NFIB is continuing to hold President Obama's feet to the fire—or to the original meaning of the Constitution as the case may be. \nEven the New York Times recently noted “an increasingly deliberate pattern by the administration to circumvent lawmakers…” But now that NFIB and other industry groups are finding success in fighting the administration’s most brazen attempts to circumvent the Constitution, the president is going to have to begin operating within the letter of the law. \nAfter all, the courts are sending him a clear message: You, Mr. President, are not above the law. NFIB’s victory Tuesday is a perfect example. \nLast year President Obama’s NLRB voted to adopt the so called “Poster Rule.” The Poster Rule would have required business owners to prominently display posters giving employees “notice” of their rights under federal labor law. But, NFIB obtained an injunction to prevent NLRB from enforcing the rule, and Tuesday succeeded in striking it down completely. \nIn court the NLRB defended its actions arguing that the Poster Rule was necessary because some employees do not know their rights. But, even if it were true that employees are ignorant of their rights—a premise we disputed all along, especially given the availability of information in the Internet age—our point has always been that President Obama and his NLRB cannot create a rule simply because it would be a convenient way to address a political issue. Moreover, as we successfully argued in striking down the Poster Rule, the Constitution prohibits federal agencies from creating rules in violation of federal statutes. \nIn the Poster Rule case the NLRB was acting without statutory authorization from Congress, and in express violation of federal statutes. And in the NLRB recess appointment cases, the President was acting beyond the powers authorized to him in the Constitution. \nThe bottom line is that our government cannot suspend or ignore constitutional rules—or lawfully enacted statutes—for expedient or pragmatic reasons. But, now President Obama and his NLRB advisors are learning this lesson the hard way. Of course, that’s what happens when you ignore the Constitution. \nKaren R. Harned, esq. is executive director of the NFIB's Small Business Legal Center. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}