{"organizations": ["Fox News Facebook", "Twitter"], "uuid": "11afdeefddabd5f9940a04c28dafc61abdc9201c", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/060613/0/0/060613_herridge_nsa_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/10/cannot-trust-obama-government.html", "country": "", "title": "We cannot trust the Obama government | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "We cannot trust the Obama government | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "11afdeefddabd5f9940a04c28dafc61abdc9201c"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/10/cannot-trust-obama-government.html", "ord_in_thread": 0, "title": "We cannot trust the Obama government | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Facebook 0 Twitter 0 livefyre Email Print \nIt is long held that the government can look at the outside of an envelope as it passes through the postal system. The government can see who is sending a letter, to whom it is being sent, and from which postal location the letter was mailed. \nThe government, in the twenty-first century, is trying to come to terms with a society that transmits information differently from the postal service. \nExtrapolating the boundaries of the mail, the government has decided to start collecting the metadata of emails and phone calls, e.g. who is contacting whom, from where, to where, the size of files, the length of phone calls, etc. \n[pullquote] \nSuperficially, it may make sense. In fact, many national security professionals on the left and right think it is necessary. The content of the messages and phone calls is not revealed, the documents themselves being transmitted are not revealed, just the metadata — the data from which the underlying phone call, email, or document passes through the series of tubes known as the Internet. We know, however, mistakes have been made in the handling and processing of the data. \nThere is one key issue here — unlike the postal service, private companies control the series of tubes through which the data travels. \nThe private companies are either complicity working with the government (most likely) or are being hacked in some way by the government (least likely). \nI do not fault the Obama administration trying to keep us safe. President Obama has used and expanded the very policies of George W. Bush that candidate Obama attacked. Amazing how the depth, seriousness, and gravity of office can change someone’s world view. \nBut I think this may go too far. I have long held that the government doing this to foreign citizens has been no problem. In fact, the New York Times leaks during the Bush administration were about programs that looked at foreigners, their calls and data, and not American citizens in the United States communicating domestically with each other. \nThe quest to keep us safe is a difficult balancing act. I neither envy the president nor have many answers I could offer him. \nMy concern is not about this president, but about those under him. Under President Obama, we have seen an Internal Revenue Service harass conservative, Jewish, and Christian groups. \nWe have seen the Department of Homeland Security label Tea Party activists, evangelicals, and veterans returning from abroad as threats. \nWe have seen the Environmental Protection Agency show favoritism to liberal groups and obstruct conservative groups. \nWe have seen a Department of Justice sell arms to Mexican drug cartels, turn a blind eye to the New Black Panthers, and target journalists. \nWe have seen a State Department bungle its handling of Benghazi and engage in a cover up of the details of just how badly they screwed up. \nWe have seen the Department of Agriculture frivolously dole out taxpayer dollars in the scandalous Pigford program. And this is not a complete list. \nThe president has maintained for five years that the buck does not stop with him. He routinely promotes, praises, or otherwise gives a pass to those who have screwed up, abused the rights of American citizens, and squandered American tax dollars. \nIf not the president — and most Americans do still hold him in high regard — his administration has abused the trust of the American people. \nFurther, for the last several years the president has been telling the American public not to worry. Terror incidents like the Ft. Hood shooting have been classified as work place violence. The War of Terror is over. \nTerrorism is now man made disaster. \nThe rhetoric of this administration for the last several years has routinely downplayed threats, trumpeted the lack of attacks, and suggested that the dark clouds of devastation have blown by — Boston bombing aside (and this program does not seem to have helped prevent that). \nIs the PRISM program working as intended and, if so, how does it really work? Or is it security theater like the TSA screenings at airports? \nWe have yet to learn that the TSA, for all its theater and prostate exams of passengers, has actually obstructed something harmful. What of the NSA? \nIf we have compromised our privacy, to what end and result have we done so that makes such a compromise necessary and worthwhile? \nI venture to say for all the elaborate burdens of the TSA, all we have done is make air travel more of a burden. \nWhy should we trust the National Security Agency? How can we be sure that this one department, unlike the largely nonpartisan IRS, is not engaging in an abuse of data? \nHow can we be sure the NSA will not leak the private details of American citizens to political groups as the IRS did? \nWith the government expanding its reach into the lives of every American with the implementation of ObamaCare, how can we be sure that the metadata that suggests someone may be having a medical issue is not flagged, leaked, or otherwise abused? \nFor now that’s a reach. But a year ago most Americans thought it was a reach to claim the IRS was willfully and maliciously targeting conservative groups. \nWe cannot trust the government. This administration has lost the respect of the American people. Compounding the problem, the Congress, which has been overseeing the program, has neither the trust nor respect of the American people. \nNeither party cares much for its own or the other party in Congress. Diane Feinstein and Saxby Chambliss telling the American people to trust them should be a big red flag that we should not trust them. They do not have our trust. \nThe coming year will see Republicans and Democrats alike fight over this issue. Rand Paul will make it a campaign issue for his presidential race. How to balance national security and privacy is no easy thing. While we should all be willing to show some sympathy, if disagreement, with Presidents Bush and Obama and the difficult balancing act they have faced and continue to face, we would not be in such a spot at this time had the present administration not so badly let its own bureaucrats misbehave. \nEven those of us who might err on the side of security over privacy must now concede it is time to consider recalibrating the balance. The constitutional rights of American citizens in the United States should be abridged only ever so carefully. \nFor conservatives, there must be one last note — the Guardian, Glenn Greenwald, and Edward Snowden should not be made heroes. \nGlenn Greenwald is not “anti anti-terror” as the New York Times portrays him. He is deeply hostile to the United States and routinely sides with every bad actor on the planet when their interests conflict with the United States. The Guardian is no better. \nEdward Snowden's act was not a courageous act. His was an act of sabotage and ego whereby he decided to be judge, jury, and executioner of an intelligence program that violated his sensibilities, but maybe not the constitution. Then he leaked it to a man and organization deeply hostile to the United States before himself fleeing to a communist nation, praising that nation’s support for free speech. \nJust as we cannot trust this administration’s honesty and candor, we surely cannot trust the Guardian, Glenn Greenwald, and Edward Snowden. That leaves American citizens in a frustrating place in need of many more answers than we have at present or are likely to get from those peddling an anti-American agenda or, frankly, from the Obama administration. \nErick Erickson is a Fox News contributor and editor of RedState.com . Follow him on Twitter @EWErickson . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:17:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}