{"organizations": [], "uuid": "ec45b9121266004873be4ae3d0a612d9e9228627", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/william-lambers/headshot.jpg", "site_section": "http://www.huffingtonpost.com/tag/syria/feed", "section_title": "Syria on Huffington Post", "url": "http://www.huffingtonpost.com/william-lambers/congress-obama-have-to-bo_b_7313768.html", "country": "US", "title": "William Lambers: Congress, Obama Have to Boost Food for Peace in Response to Wars", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "William Lambers: Congress, Obama Have to Boost Food for Peace in Response to Wars", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T14:32:00.000+03:00", "replies_count": 0, "uuid": "ec45b9121266004873be4ae3d0a612d9e9228627"}, "author": "William Lambers", "url": "http://www.huffingtonpost.com/william-lambers/congress-obama-have-to-bo_b_7313768.html", "ord_in_thread": 0, "title": "William Lambers: Congress, Obama Have to Boost Food for Peace in Response to Wars", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nThink how 50,000 hungry Syrians in the besieged town of Al Waer must be feeling right now. They have just received their first food packages in months! They have been blocked from aid because of the ongoing civil war. \nInside the boxes are wheat, rice and other rations from the UN World Food Programme (WFP). For Syrians who are exhausted, hungry and in despair that is a package filled with food and hope. \nNow who is WFP's largest donor in Syria to provide this life-saving food aid? It's the U.S. Food for Peace program. It's urgent we boost funding for Food for Peace right away to feed hungry war victims all over the globe. \nDwight Eisenhower started Food for Peace years ago, building up the heroic efforts of the Greatest Generation that saved Europe from the Nazis and also a famine. Food for Peace today is a lifeline for millions of starving people around the world. \nSyrians in the besieged town of Al Waer receiving food rations this month from the World Food Programme (WFP) and its partners. WFP's single largest donor of food aid in Syria and around the world is the US Food for Peace program. (WFP photo) \nIn the violently stormy waters of global affairs, Food for Peace is one of the few stabilizing forces. \nYet, President Obama and the Congress may reduce funding for Food For Peace. President Obama's proposal is 1.4 billion on Food for Peace funding for the next fiscal year. This is a reduction from the previous year. Congress is currently preparing its budget, which will decide what Food for Peace funding will be going forward. \nThe World Food Program USA and other charities want the Food for Peace budget to be 1.75 billion at least. The reason for this is simple. The needs are so great around the world right now. People are on the brink of starvation every day. \nThe wars in Syria, Iraq, South Sudan, Ukraine and Yemen have all escalated this year. Just recently another major disaster, the earthquake in Nepal, has caused another 3 million to need food aid. \nIt makes no sense for President Obama and Congress to reduce Food for Peace when the needs are escalating. Cutting the program creates the tragic possibility that war victims in Syria may not get that life-saving food package because the funding has run out. Already Syrian refugees in other countries are seeing reduced rations. \nFood for Peace funding must be increased with wars unfolding around the globe right now. \nIf a citizen wanted to do one great thing for the world's hungry war victims right now, they should contact President Obama and the Congress. You should urge them to boost Food for Peace to at least 1.75 billion and hopefully much more. \nIt's not an increase that will break the bank either. Food aid makes up less than one tenth of one percent of the federal budget. In fact, spending on nuclear weapons, for example, far exceeds international food aid by tens of billions of dollars each year. \nFood for Peace funding should include maximum flexibility for aid agencies like WFP and Catholic Relief Services to use local and regional sources to provide the food aid. This will make the most efficient use of Food for Peace. \nFamine is the inevitable aftermath of war, the humanitarian Herbert Hoover once said. When war strikes, we have always increased our food aid. \nWar is tragically unfolding right now across the globe. In Syria alone, the WFP immediately requires US $ 268 million to feed the hungry and displaced victims. From now until the end of the year WFP needs US $ 832 million. The U.S. has to lead the international community in seeing these needs are met. \nWe should pass some interim emergency food aid like we did after the world wars to make sure the hungry refugees are fed. The bottom line is we all need to step up our performance in helping feed the hungry. That is what wartime demands. Food for Peace is the main tool of the United States for doing so. \nSo make the call, email or tweet to your representative right away. Ask them for 1.75 billion in Food for Peace funding. Be a voice for the world's hungry. Be the voice for Food for Peace. \nFollow William Lambers on Twitter: www.twitter.com/williamlambers More:", "external_links": [], "published": "2015-05-19T14:32:00.000+03:00", "crawled": "2015-05-19T19:35:02.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}