{"organizations": [], "uuid": "c9b12332f1a3311c1e4fcbb2a391c0b5056602de", "thread": {"site_full": "voces.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3010868/images/o-CUBAN-FLAGS-facebook.jpg", "site_section": "", "section_title": "", "url": "http://voces.huffingtonpost.com/2015/05/29/cuba-vctimas-terrorismo_n_7470102.html", "country": "", "title": "Cuba: víctimas de terrorismo satisfechas con decisión de Obama", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Cuba: víctimas de terrorismo satisfechas con decisión de Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-05-30T00:58:00.000+03:00", "replies_count": 0, "uuid": "c9b12332f1a3311c1e4fcbb2a391c0b5056602de"}, "author": "", "url": "http://voces.huffingtonpost.com/2015/05/29/cuba-vctimas-terrorismo_n_7470102.html", "ord_in_thread": 0, "title": "Cuba: víctimas de terrorismo satisfechas con decisión de Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "spanish", "persons": [], "text": "Cuba: víctimas de terrorismo satisfechas con decisión de Obama | Por ANDREA RODRIGUEZ reddit \nLA HABANA (AP) — La cubana Ileana Alfonso era una adolescente cuando una bomba estalló en el avión en el que viajaba su padre. El atentado terrorista, atribuido a un grupo anticastrista, le cambió la vida. \nSeis años después, el gobierno de Estados Unidos declaró a Cuba uno de los estados patrocinadores del terrorismo, algo incompresible para muchas de las víctimas de atentados como los del avión. \n\"Una lista en la que nunca debíamos haber estado\", dijo a The Associated Press Alfonso, que ahora tiene 57 años y cuyo padre era directivo de la Federación Centroamericana de Esgrima y falleció junto a otras 72 personas en el atentado contra una aeronave de Cubana de Aviación. \nPero ahora que el Departamento de Estado sacó a Cuba de la lista de países patrocinadores del terrorismo y así facilitar el inicio de una nueva era en las relaciones entre ambos países, algunas víctimas cubanas creen que se ha hecho justicia con el país caribeño. \n\"Creo que puede ser un acto positivo a favor de la esperanza y el entendimiento y que puede contribuir a favorecer las conversaciones entre Cuba y Estados Unidos\", dijo el cineasta cubano Juan Carlos Cremata quien, como Alfonso, también perdió a su padre en el ataque al avión ocurrido en octubre de 1976. \nLa bomba en la aeronave estalló cuando regresaba de Barbados a La Habana en plena Guerra Fría. El artefacto explosivo fue plantado por grupos anticastristas coordinados por Luis Posada Carriles y Orlando Bosh, según investigaciones realizadas por el gobierno de entonces de Venezuela -donde vivían ambos- y reconocido luego por uno de los autores. \nEl argumento de Washington para incluir a Cuba en la lista fue considerarla patrocinadora del terrorismo por su apoyo a las guerrillas en América Latina, incluidas las Fuerzas Armadas Revolucionarias de Colombia (FARC), que actualmente negocian la paz con el gobierno de su país en Cuba. \nSegún cifras del presidente cubano Raúl Castro, los ataques armados de los grupos anticastristas como el del avión, tiroteos a los poblados de pescadores y asesinatos de diplomáticos dejaron 3.478 muertos y 2.099 discapacitados. \nLa salida de Cuba de la lista fue una de las más importantes demandas de la isla a Estados Unidos tras el anuncio del 17 de diciembre de Castro y su par estadounidense Barack Obama del inicio de un proceso de restablecimiento de las relaciones diplomáticas rotas en 1961. \n\"Al sacar de la lista de países promotores del terrorismo cambia la imagen oficial de Cuba en Estados Unidos, de una amenaza a la de un país en transición\", dijo el economista y analista Arturo López-Levy, profesor adjunto del Centro para Asuntos Mundiales de la Universidad de Nueva York. \"Este es un clavo grande en el ataúd de la política de 60 años de hostilidad\". \nSegún López-Levy, además de dar paso a la apertura de embajadas, la medida pondrá en juego el argumento de Cuba como un país enemigo de Washington y cuestionará las limitaciones de viajes a los estadounidenses a la isla -impuestos por su propio país_a la vez que alentará a empresarios de terceros países a invertir en la nación caribeña. \n\"El haber removido a Cuba de la lista resalta el hecho de que este instrumento es en efecto un arma política utilizada por Estados Unidos para promover sus intereses políticos\", dijo por su parte el profesor de Estudios Latinoamericanos del Pomona College en Claremont, California, Miguel Tinker-Salas. \nCastro hizo patente su molestia por pertenecer a la lista y durante la VII Cumbre de las Américas de Panamá en abril reconoció a Obama por haber tomado la decisión de sacar a la isla de ese grupo. \n\"¡País terrorista nosotros!\", expresó Castro frente a Obama. \"Los terroristas eran los que ponían los muertos. ¿De dónde venía el terror entonces? ¿Quiénes lo provocaban?\". \nCuando se conoció el 14 de abril la decisión de Obama de informar al Congreso la exclusión de Cuba de la lista, varios legisladores como el senador republicano y aspirante a la presidencia Marco Rubio, su colega demócrata Bob Menéndez y los representantes republicanos Ileana Ros-Lehtinen y Mario Díaz-Balart expresaron su oposición. \nPero pasaron 45 días sin que los congresistas se opusieran en conjunto a la medida, por lo que la eliminación de la lista quedó en efecto el viernes. \nHasta ahora las partes desarrollaron tres reuniones de negociación -la última la semana pasada- y una consulta técnica y todos esperan que en pocos días se anuncie la apertura de embajadas en ambos países, que hasta ahora cuentan con representaciones llamadas Oficinas de Intereses. \n\nLa corresponsal de The Associated Press en La Habana Anne-Marie García contribuyó con este reporte. \n\nAndrea Rodríguez está en Twitter como: www.twitter.com/ARodriguezAP También en HuffPost Voces ", "external_links": [], "published": "2015-05-30T00:58:00.000+03:00", "crawled": "2015-05-30T00:58:21.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}