{"organizations": [], "uuid": "c63974dfc99a78e58aca640a82a2742cfa7b7d48", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/", "section_title": "Fox News - Breaking News Updates | Latest News Headlines | Photos &amp; News Videos", "url": "http://www.foxnews.com/politics/2015/05/05/coal-state-officials-blast-obama-climate-change-plan/", "country": "US", "title": "Coal-state officials blast Obama climate change plan", "performance_score": 2, "site": "foxnews.com", "participants_count": 1, "title_full": "Coal-state officials blast Obama climate change plan | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "c63974dfc99a78e58aca640a82a2742cfa7b7d48"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/05/05/coal-state-officials-blast-obama-climate-change-plan/", "ord_in_thread": 0, "title": "Coal-state officials blast Obama climate change plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Associated Press Email Print The Obama administration's far-reaching plan to address climate change would cause job losses and lead to higher electricity prices and even power outages, attorneys general from two energy-producing states said Tuesday.\nWest Virginia Attorney General Patrick Morrisey and Oklahoma Attorney General Scott Pruitt told a Senate panel that the administration's plan to cut heat-trapping pollutants from coal-fired power plants would cause existing plants to retire early and prevent new ones from being completed.\n\"Make no mistake about it: finalizing this proposal would have a devastating impact on my state, other coal-producing states and citizens from across the country who will feel the impact of high electricity prices and reduced reliability of the power grid,\" Morrisey told a clean air subcommittee of the Senate Environment Committee.\nPruitt called the plan an attempt by President Barack Obama and the Environmental Protection Agency to \"expand federal bureaucrats' authority\" over the way states produce energy. EPA is attempting to \"force states into shuttering coal-fired power plants\" in an effort to drive the nation away from fossil fuels and other traditional sources of energy, Pruitt said.\nOklahoma and West Virginia are among 15 coal-reliant states that are suing the EPA to block the so-called \"Clean Power Plan,\" which would require states to cut carbon dioxide emissions by 30 percent by 2030.\nThe EPA rule is a centerpiece of Obama's efforts to reduce the pollution linked to global warming. Power plants are the largest source of greenhouse gases in the U.S., accounting for about a third of the annual emissions that make the U.S. the second-largest contributor to global warming on the planet.\nEPA Administrator Gina McCarthy and other administration officials say the plan gives states flexibility to meet broad goals set by the government. \"Each state is different, so each goal and each path can be different,\" McCarthy said when the plan was proposed last year.\nBut Sen. Shelley Moore Capito, R-W.Va., said EPA is \"dictating to states\" and \"micromanaging\" their energy-policy decisions. \"At risk is the ability that states have always had to make decisions about their electricity generation,\" she said.\nCapito, who chaired Tuesday's subcommittee meeting, said West Virginia has \"chosen to rely on coal to provide affordable and reliable electricity\" and has one of the lowest electricity rates in the nation.\n\"Other states make different choices that best serve their citizens. But under the Clean Power Plan, each state's electricity plan would have to meet EPA's criteria for reducing carbon dioxide emissions and be approved by EPA,\" she said.\nWith the economy still in recovery, \"the last thing job creators need is another expensive regulation likely to drive up energy prices,\" Capito said. \"And the last thing our families and senior citizens need is to see their electric bills continue to go up.\"\nCapito said she will introduce a bill next week to block the EPA plan, one of several proposals in Congress to delay or defeat the plan.\nAdvertisement\nTrending in Politics 1 Reid throws brakes on Obama trade push 2 States wasting millions by keeping ineligible recipients on ObamaCare’s Medicaid rolls, critics say 3 Hillary flips for amnesty 4 Feds to regulate Christmas lights 5 Lindsey Graham: 'New phase in the war' if ISIS directed Texas attack See all Trends Advertisement", "external_links": ["http://www.ap.org/"], "published": "2015-05-05T03:00:00.000+03:00", "crawled": "2015-05-05T22:27:20.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}