{"organizations": ["Fox News Catholic"], "uuid": "60b4a6291cda5823dfc085ea3020d5d691ff6dfe", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/100313/0/0/100313_an_veterans2_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/10/07/as-slimdown-drags-on-mean-spirited-petty-attacks-on-america-veterans-by-team.html", "country": "", "title": "As slimdown drags on, mean-spirited, petty attacks on America's veterans by Team Obama are an outrage | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "As slimdown drags on, mean-spirited, petty attacks on America's veterans by Team Obama are an outrage | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "60b4a6291cda5823dfc085ea3020d5d691ff6dfe"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/10/07/as-slimdown-drags-on-mean-spirited-petty-attacks-on-america-veterans-by-team.html", "ord_in_thread": 0, "title": "As slimdown drags on, mean-spirited, petty attacks on America's veterans by Team Obama are an outrage | Fox News", "locations": ["America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Team Obama"], "text": "Catholic priests in military face arrest for celebrating Mass \nOfficials say that they need to close parks and monuments throughout the country and overseas because of the shutdown – which is really a slowdown with 83 percent of the government still up-and-running – but it is likely spending more resources to close them than it has ever taken to allow the open-air sites to remain open. Whoever at the White House or NPS gave the order needs to be held accountable for such a waste of taxpayer funds when they claim that resources have become so scarce. They cannot be trusted to properly manage our national treasures. It is a mean-spirited, callous and petty maneuver to inflict the most pain on veterans and the American public as possible for their inability to do their jobs. That’s our federal government for you. Thanks a lot. Thankfully, the response to the efforts by the NPS has been bipartisan. Republican and Democratic members of Congress are all working to intervene in this egregious behavior. Last week, I watched as lawmakers warmly greeted the veterans at the World War II Memorial during the Honor Flight program, respectfully cut a ribbon joining the barricades, moved them out of the way and escorted veterans into the site. The crowds cheered and applauded, and I’m sure many tears were shed as the veterans made their way around. On a bipartisan, bicameral basis some legislators exercised their conscience and did the right thing. \nThey didn’t worry about winning or losing. \nThey weren’t worried about partisan messaging in the shutdown drama. \nThey just wanted to make sure that our nation’s veterans were treated with the respect that they deserve. \nAs the government slimdown continues this is a great example – however small it might be in the grand scheme of things – of how Washington should work. Do the right thing by letting our veterans and the American public in and keeping the politics out. \nRepublican Pete Hoekstra represented Michigan's 2nd congressional district from 1993 to 2011 in the House of Representatives. He is the former chairman of the House Permanent Select Committee on Intelligence. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:10:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}