{"organizations": [], "uuid": "b52cbcd63f6116c661787150d1ef3334ed353d43", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/reidobama_050715getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/senate/241399-trade-fight-heats-up-as-obama-reid-battle-for-votes", "country": "US", "title": "Trade fight heats up as Obama, Reid battle for votes", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Trade fight heats up as Obama, Reid battle for votes", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T00:49:00.000+03:00", "replies_count": 0, "uuid": "b52cbcd63f6116c661787150d1ef3334ed353d43"}, "author": "Alexander Bolton", "url": "http://thehill.com/homenews/senate/241399-trade-fight-heats-up-as-obama-reid-battle-for-votes", "ord_in_thread": 0, "title": "Trade fight heats up as Obama, Reid battle for votes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trade fight heats up as Obama, Reid battle for votes Getty Images By Alexander Bolton - 05/07/15 05:49 PM EDT \nPresident Obama and Harry Reid are battling one another for Democratic support ahead of an important vote on trade next week. \nReid, the Senate Democratic leader, is trying to hold his caucus together and stop Republicans from moving quickly to legislation giving Obama fast-track trade authority ADVERTISEMENT Obama sees fast-track as one of his top priorities, and the White House is hoping the Senate will move forward on the legislation before the Memorial Day recess. The authority would pave the way forward for a pact the White House is negotiating with 11 Asian and Latin American countries.\nLobbying has intensified head of a pivotal procedural vote scheduled for Tuesday. \nSenators will vote on whether to end debate on a motion to proceed to the fast-track bill, which would allow the chamber to formally begin its debate. \nSixty votes will be needed to clear the hurdle, and while the 54-member GOP conference will supply most of them, it will need some help from Democrats. \n“It’s going to be a test for the president whether he can produce enough Democrats,” said Senate Republican Whip John Cornyn (Texas). \nReid is urging Democrats to oppose proceeding to trade legislation if Republicans do not lay out a clear path for passing an extension of highway funding and NSA surveillance authority. Both policies face deadlines at the end of the month. \n“I can't imagine why the trade bill is so vitally important that it would trump the [NSA] bill, which is going to expire at the end of this month, or trump the highway bill, which authorization expires at the end of this month. I can't imagine what the rush is,” he said Tuesday. \nReid also says fast-track should not move without a promise from Republicans to move Trade Adjustment Assistance, which helps workers displaced by increased trade; a customs enforcement bill; and the African Growth and Opportunity Act (AGOA), which gives trade preferences to developing nations. \nBut White House press secretary Josh Earnest told reporters this week that there’s no reason the Senate cannot pass the highway trust fund and surveillance authority extensions along with trade legislation before June. \n“We’re setting the bar awfully low if we think the Senate can only do one thing over the course of the next month,” he said Tuesday. \nObama met Wednesday with Sens. Chris Coons (Del.), Dianne Feinstein (Calif.), Tim Kaine (Va.), Patty Murray (Wash.), Jeanne Shaheen (N.H.) and Ron Wyden (Ore.) at the White House, and urged them to back his trade agenda. \nVice President Biden followed up by placing calls on Thursday to senators. \nFeinstein said Obama laid out a compelling case for supporting fast-track. \n“It was a good lengthy discussion and a number of different aspects of this came out. I saw things that I didn’t see before,” she said. \nStill, it’s clear Obama could have his work cut out for him. Sen. Bill Nelson (D-Fla.), who supports fast-track authority, said he should be marked down as “undecided” on the question of whether the Senate should proceed to TPA. \nHe and Senate Finance Committee Chairman Orrin Hatch (R-Utah), who co-authored the fast-track bill, said they would await more input from colleagues before deciding how to vote on the motion to proceed. \nSenate Republican leaders and White House officials don’t want to leave fast-track twisting in the wind during the Memorial Day recess, which would give opponents valuable time to wage grassroots campaign to bash it. \nThey want to use a vote in the Senate to build momentum for what will be an even tougher vote in the House. \nCornyn said the GOP leadership may need votes from as many as 15 Democrats to pass fast-track after the Senate proceeds to it. \n“We're not unanimously on our side in support of it. So this is a priority for the president, and so that comes with an obligation for him to work on members of his own party to produce the votes,” he said. \nDemocratic aides backing Reid argue there’s simply not enough time to move fast-track and the NSA and highway bills by the end of the month. The Senate has two more weeks in session before the Memorial Day recess. \nOne Democratic aide predicted that addressing Section 215 of the Patriot Act, which governs the NSA’s controversial bulk data collection of telephone records, will take at least a week of work on the floor. \nWyden and Senate Finance Committee Chairman Orrin Hatch (R-Utah) say fast-track and the Trade Adjustment Assistance measure will get a vote on the same day, ensuring that both bills pass. \nBut Hatch is making no promises about AGOA or the customs enforcement measure, which includes a controversial provision penalizing trading partners that engage in currency manipulation. \n“I expect that we’ll pass both TPA and TAA and we’ll work on the others,” Hatch told reporters. \nSenate Democrats discussed their strategy at a lunch meeting Thursday. \nCoons said he wants McConnell and Obama to lay out a clear plan for passing Trade Adjustment Assistance, the customs enforcement bill and AGOA before agreeing to take up fast-track. \n“The reason there’s a lot of discussion about whether or not we would vote for the motion to proceed is around that core concern,” he said. “I don’t have clarity on that yet. I discussed it directly with the president.” \nMost Republicans who might vote against fast-track in a final vote are likely to support their leadership on the procedural motion. \nSen. Richard Burr (N.C.), the only Republican to vote against fast-track in the Finance Committee, said he would vote to proceed to the trade legislation even though he may oppose its final passage. \nSen. Shelley Moore Capito (W.Va.), another Republican undecided on whether to ultimately support the legislation, said she would also back the motion to begin floor debate. \nBut Sen. Lindsey Graham (R-S.C.) said he would not vote for the procedural motion unless he’s promised a vote on an amendment to add language addressing currency manipulation to the fast-track legislation itself. \nCornyn and Senate Republican Conference Chairman John Thune (S.D.), the second- and third-ranking members of the GOP leadership, predicted they would have enough Democrats to begin debate \nBut a senior Democratic leadership aide said that’s not yet certain. \n“We’ll see. There’s a broad feeling that we don’t need to rush into this especially with FISA and highway set to expire and no apparent path forward on either of those,” the aide said. \n—Bernie Becker and Vicki Needham contributed. Tags:", "external_links": [], "published": "2015-05-08T00:49:00.000+03:00", "crawled": "2015-05-08T01:34:58.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}