{"organizations": [], "uuid": "a14f8b8cc5ed3bd6bf73f10a68442f32af8ea9b9", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabarack_042415getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/241141-obama-uses-cinco-de-mayo-to-push-immigration-reform", "country": "US", "title": "Obama uses Cinco de Mayo to push immigration reform", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama uses Cinco de Mayo to push immigration reform", "spam_score": 0.0, "site_type": "news", "published": "2015-05-06T01:21:00.000+03:00", "replies_count": 0, "uuid": "a14f8b8cc5ed3bd6bf73f10a68442f32af8ea9b9"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/241141-obama-uses-cinco-de-mayo-to-push-immigration-reform", "ord_in_thread": 0, "title": "Obama uses Cinco de Mayo to push immigration reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama uses Cinco de Mayo to push immigration reform By Jordan Fabian - 05/05/15 06:21 PM EDT \nPresident Obama used a Cinco de Mayo party on Tuesday to plug comprehensive immigration reform even though the issue appears all but dead in this Congress. \nLawmakers have expressed little interest in tackling immigration reform this year, but Obama said “we’re not just going to stop now” in attempting to fix the nation’s immigration laws. ADVERTISEMENT “Congress still needs to step up and ultimately pass comprehensive immigration reform,” he told a group of Hispanic leaders and activists assembled at the White House. \nHe said passing a bill is “the right thing to do.” \nThe Senate approved a sweeping bill in 2013 that would have offered a path to citizenship for millions of illegal immigrants while boosting border security. \nBut the proposal never picked up traction in the House, and Speaker John Boehner’s (R-Ohio) effort to convince Republicans to pass their own bill fell on deaf ears in 2014, a midterm election year. \nObama issued a series of executive actions last fall that would have provided deportation relief and work permits to millions of immigrants living in the U.S. legally, including parents of U.S. citizens. The orders also expanded eligibility for the Deferred Action for Childhood Arrivals (DACA) program that Obama set up in 2012. \nThe president’s newest programs, however, have been frozen by a lawsuit that is pending in federal court. \nObama said the actions he took were “within my legal authority to make our immigration system fairer, smarter and more just.” \nThe president tried to give the crowd encouragement despite the obstacles that have dogged his immigration agenda. \n“Progress is not always a straight line. Sometimes we have to take this turn or that turn,” he said. “The good news is the American people are with us.” Tags:", "external_links": [], "published": "2015-05-06T01:21:00.000+03:00", "crawled": "2015-05-06T02:30:28.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}