{"organizations": [], "uuid": "0d15123d35e651425bd68640a239bfd926e895ef", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2899828/images/o-PATTY-MURRAY-facebook.jpg", "site_section": "", "section_title": "", "url": "http://www.huffingtonpost.com/2015/04/30/12-minimum-wage_n_7183780.html", "country": "", "title": "Obama And Democrats Raise Their Minimum Wage Proposal To $12", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 0, "title_full": "Obama And Democrats Raise Their Minimum Wage Proposal To $12", "spam_score": 0.0, "site_type": "news", "published": "2015-05-01T01:11:00.000+03:00", "replies_count": 0, "uuid": "0d15123d35e651425bd68640a239bfd926e895ef"}, "author": "", "url": "http://www.huffingtonpost.com/2015/04/30/12-minimum-wage_n_7183780.html", "ord_in_thread": 0, "title": "Obama And Democrats Raise Their Minimum Wage Proposal To $12", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama And Democrats Raise Their Minimum Wage Proposal To $12 Posted: reddit Mark Wilson via Getty Images \nWASHINGTON -- With fast-food workers going on strike and local governments raising their wage floors, Democrats in Congress have decided their stalled proposal to hike the minimum from $7.25 to $10.10 per hour needs to be revised. On Thursday, they introduced a bill that would boost it to $12 per hour by 2020. \nThe new bill is no more likely than its predecessor to garner support from congressional Republicans, who control both chambers and have so far staunchly opposed raising the federal wage floor. But the proposal made Thursday shows Democrats' desire to put the wage issue front and center heading into the 2016 election season, and their willingness to wager that Americans will like the idea of a more robust minimum wage hike. \n\"This is a key piece of our work to grow the economy from the middle out, not the top down,\" Sen. Patty Murray (D-Wash.), who introduced the bill in the Senate, said at a press conference Thursday. \"The truth is, for most Americans, wages have been stagnant for decades.\" \nAsked why Republicans might support $12 when they wouldn't give a vote to $10.10, Murray said the proposal is a challenge to her colleagues across the aisle. \n\"We put out what we believe is right, and we challenge them to come to us,\" Murray said. \"I invite them to support this bill and I challenge them to.\" \nSo what's changed since Democrats first proposed $10.10 more than two years ago? \nInflation, for one thing. Under the bill originally put forth more than two years ago by Sen. Tom Harkin (D-Iowa) and Rep. George Miller (D-Calif.) -- both of whom have since retired -- the minimum wage would have risen in steps to $10.10 by 2015, then been pegged to the consumer price index. \nAs that bill has languished, Democrats have fallen further behind on their original timeline. Given that the new bill wouldn't raise the minimum wage to $12 until 2020, it isn't wildly different from Democrats' original $10.10 proposal. \nStates and cities throughout the country, meanwhile, have gone ahead and raised their own minimum wages while the federal level remains stagnant. \nDue to a series of ballot initiatives that passed in November, for the first time ever a majority of the nation's states now have a minimum wage higher than the one mandated by Congress. That includes a growing number of red states , including Alaska, Arkansas, Nebraska and South Dakota, where voters all approved minimum wage measures in the fall. \nWith growing momentum on the local level, Murray recently began reaching out to her colleagues to rally support for the higher $12 proposal, as The Huffington Post reported in March . Broad backing had come together by Thursday, when Murray was joined by Senate Minority Leader Harry Reid (D-Nev.), House Minority Leader Nancy Pelosi (D-Calif.) and Rep. Bobby Scott (D-Va.), who's pushing the legislation on the House side. \nAlso in attendance was Labor Secretary Tom Perez, who said the White House is giving \"full and enthusiastic\" support to Democrats' $12 proposal. President Barack Obama, who's been stumping for a minimum wage raise for the past two years, has gradually revised upward what he thought was a suitable measure, first proposing $9, then supporting $10.10 and now $12. \nPerez pointed to the local minimum wage hikes that have passed with broad public support. \n\"The voters overwhelmingly spoke,\" Perez said of the 2014 ballot measures. \nUnder the Murray-Scott proposal, the minimum wage would first rise from its current $7.25 to $8, then a dollar a year until 2020. But instead of being tied to something like the consumer price index, it would rise according to median wage growth. The bill would also raise the so-called tipped minimum wage that applies to restaurant servers and other tipped employees. That rate remains $2.13 and hasn't been raised in more than 20 years. \nThe state and local minimum wage proposals have gotten a major boost from the fast-food workers who have periodically gone on strike in increasing numbers. Funded by the Service Employees International Union, the so-called Fight for $15 movement has shined a light on the plight of workers trying to get by on as little as $7.25 an hour. Two weeks ago, the union and its allies coordinated the largest protest yet . Also on HuffPost: ", "external_links": [], "published": "2015-05-01T01:11:00.000+03:00", "crawled": "2015-05-01T01:24:34.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}