{"organizations": ["Congress", "Fox News Should"], "uuid": "5ffea3893bd92da2ceec2df7c13420bf1ce3a0ff", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/083113/0/0/083113_obama_syria_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/08/31/five-leadership-lessons-on-syria-and-military-power-for-obama.html", "country": "", "title": "Five leadership lessons on Syria and military power for Commander-in-Chief Obama | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Five leadership lessons on Syria and military power for Commander-in-Chief Obama | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5ffea3893bd92da2ceec2df7c13420bf1ce3a0ff"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/08/31/five-leadership-lessons-on-syria-and-military-power-for-obama.html", "ord_in_thread": 0, "title": "Five leadership lessons on Syria and military power for Commander-in-Chief Obama | Fox News", "locations": ["Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Should a decision on Syria include Congress? \nIf President Obama was really serious about holding Assad accountable he should have consulted Congress before he issued a red line--not after. \nIn all likelihood he didn't because there was a good chance they would have said--no--and well they might. \nIntervening in civil wars; getting conclusive evidence about what is going on the ground; and defining clear, achievable, realistic military objectives for punitive strikes is really hard--and the White House had no good answers for addressing any of these issues. \nWhat happens to Obama's next red line, if Congress rejects this one? \nOr will Congress have to rubber stamp a stupid red line to preserve the president's credibility? Wouldn't that just encourage Obama to make more reckless red lines in the future? \nDid the White House think about any of these questions before it stated making declarations? \nLesson #3. A Shot Across the Bow Only Works if the Enemy Thinks You Are Serious About Sinking Their Ship. President Obama has already declared he won't intervene in the civil war, so any strikes will be little more than a nuisance to a regime that plans to fight to the bitter end. \nLesson #4. Victory Has a Thousand Fathers, Defeat is an Orphan. President George W. Bush had a Congressional authorization for a use of force in Iraq, a UN resolution, popular support for military interventions in Iraq and Afghanistan, and support of a broad international coalition. That mattered little when the wars did not go well. \nAll the legitimacy in the world will mean nothing--if military action does not turn out well. The president doesn't have a solid game plane for Syria, a resolution from Congress is not a \"get out of jail free card.\" \nLesson #5. Think Before You Act. In terms of salvaging the president's shattered credibility as a foreign policy leader turning to Congress won't help. \nA wise president would have built a coalition of support before the crisis--not waited for the crisis--then tried to build a coalition. And, failing that, then make it seem like military action is all up to Congress--and the president is just a bystander. \nFrom Obama's perspective, turning to Congress now may seem like a brilliant move. If Congress votes no, he has shown he has empathy with the international community--and he is still a good guy. If Congress votes yes--and it all turns out badly--he will say we are all in this together. \nBut from the standpoint of acting like the world's leader this may be the nadir of American power. \nThe reality is that every decision on how to employ the armed forces has turned out badly for Obama. \nHe ran away from Iraq--the violence there is worse now than when he came into office. \nHe wants to go to \"zero\" in Afghanistan. The Taliban can't wait for that. \nHe led from behind in Libya and that failure became a front page story after Benghazi. \nMoscow mocks him. \nBeijing ignores him. \nAll these acts as president show Obama has not learned his lessons very well. The Saturday speech just makes his shortfalls as commander-in-chief even more glaringly apparent. \nJames Jay Carafano is vice president of foreign and defense policy studies The Heritage Foundation . Follow him on Twitter @JJCarafano . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:15:32.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}