{"organizations": [], "uuid": "66ef1045dbbb25d8fc6b6523d35209786312b6d6", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/09/10/president-obama-and-power-oval-office-address/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422625708755.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/10/president-obama-and-power-oval-office-address.html", "country": "", "title": "President Obama and the power of an Oval Office address | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "President Obama and the power of an Oval Office address | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "66ef1045dbbb25d8fc6b6523d35209786312b6d6"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/10/president-obama-and-power-oval-office-address.html", "ord_in_thread": 0, "title": "President Obama and the power of an Oval Office address | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Putin is the one who really deserves that Nobel Peace Prize \nTake George Washington. When he served as our first president, he lived in a house in Philadelphia. \nHe ordered the construction of bow-shaped ends to the room where he received guests. He stood in the middle and his guests surrounded him. By encircling him, no one person was closer to the president than anyone else. \nThis was a contrast to a monarchy. \nUnlike a rectangle-shaped room, the oval shape created an equal playing field, a very republican—and democratic—idea. Oval-shaped tables in business settings carry the same symbolism. In the 1790s Washington envisioned plans for the soon-to-be built President’s House to include an oval-shaped room. \nToday that house is called the White House and that room is called the Blue Room, which is in the center of the state or main floor. In 1909 President William Howard Taft tapped the power of the oval once again. He ordered the construction of a new office, the Oval Office, in the newly built West Wing adjacent to the White House. \nIn this way he showed that he was the center of the Executive Branch of government. He did this literally, too, by asking that all executive agencies send their budgets to him first before giving them to Congress. Fast forward to the television era. For the first time Americans could see their president in the Oval Office. \nThey could see the logic behind President Kennedy’s call for tax reductions through the charts he had erected in the Oval Office for his speech. \nThey could see the tension in Jimmy Carter’s body language as he pounded the Oval Office desk more than thirty times to show his angst over the country’s decline during his “malaise” or Crisis of Confidence speech. They could hear the tenderness in Ronald Reagan’s voice as he spoke about the tragedy of the space shuttle Challenger’s explosion. \nThey could detect the sadness in George W. Bush’s eyes when he spoke from the Oval Office the night of the terrorists attacks of Sept. 11, 2001. As symbolic as it is, the Oval has one draw back. Because presidents do not have a live audience with them when they speak from the Oval Office, they don’t enjoy the same energetic feedback that they receive from a large crowd at a campaign rally. \nThey can’t see the response on people’s faces or get revved up from boisterous applause. They are literally talking into a silent camera. As a result, sometimes they come across stiff in an Oval Office address. \nReagan, a former professional actor, was the best at overcoming this challenge. That’s one reason he chose to speak from the Oval Office more than two dozen times, the most of any modern president. Regardless, the power of the Oval can overcome the stiffness of a monologue. When presidents choose the Oval as their backdrop, they send a symbolic message that says: “this talk is for you.” It’s as if they’ve invited each American to stand in a circle around them and listen to the most important thing they have to say about the greatest issue facing the nation at the time. In this century, the president saturates the lives of Americans 24/7 through social media and a never-ending news cycle. President Obama has only spoken two previous times from the Oval Office. By rarely using it as a setting, he heightens the importance of his message when he does use it. Only time will tell if Obama’s speech Tuesday night about attacking Syria is successful. A recent Gallup poll shows that only 36% of Americans support U.S. intervention in Syria. \nHe needs enough people to surround him in support for his plan for the crisis in Syria. \nHe needs the power of the people to pressure Congress to support his plan. \nHe needs the power of the Oval. \nOnly time will tell if he is successful. \nAward-winning author and a former White House webmaster, Jane Hampton Cook is the author of a new book about the national anthem, \"America's Star-Spangled Story,\" and \"American Phoenix.\" She is part of Fox News Radio's national anthem special, In Triumph Shall Wave . For more, visit her website, janecook.com . \n", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:25.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}