{"organizations": [], "uuid": "a3192d593cc3969dd1d29cddabdb03c79dd4bac3", "thread": {"site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2924898/images/o-MCCRORY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/north-carolina/feed", "section_title": "North Carolina on Huffington Post", "url": "http://www.huffingtonpost.com/2015/05/07/north-carolina-abortion-_n_7233494.html", "country": "US", "title": "Progressive Groups Urge North Carolina Governor Not To Break Abortion Promise", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Progressive Groups Urge North Carolina Governor Not To Break Abortion Promise", "spam_score": 0.0, "site_type": "news", "published": "2015-05-07T17:29:00.000+03:00", "replies_count": 0, "uuid": "a3192d593cc3969dd1d29cddabdb03c79dd4bac3"}, "author": "The Huffington Post News Team", "url": "http://www.huffingtonpost.com/2015/05/07/north-carolina-abortion-_n_7233494.html", "ord_in_thread": 0, "title": "Progressive Groups Urge North Carolina Governor Not To Break Abortion Promise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nProgressive groups are traveling around North Carolina urging Gov. Pat McCrory (R) to keep a campaign promise not to sign any new restrictions on abortion. \nThe bill heading toward McCrory would triple the state’s waiting period before patients could access the procedure -- from 24 hours to 72 hours. \nJust four states currently have a 72-hour waiting period -- including Oklahoma, where Gov. Mary Fallin (R) signed the measure on Thursday -- while 24-hour requirements are relatively common . But an increasing number of states are adding or lengthening such waiting periods. \nThe North Carolina legislation passed the Republican-controlled state House in late April and is now sitting in the state Senate Judiciary Committee. That panel is expected to consider the measure within the next two weeks. \nThe proposed legislation would also mandate that doctors share medical records , like ultrasound images, with the North Carolina Department of Health and Human Services if an abortion was performed after 18 weeks or if a pregnancy ended in miscarriage. Doctors warn that such a requirement is a medically unnecessary invasion of patient privacy , while reproductive rights advocates worry that the provision would make it easier to intimidate doctors who perform abortions. \nTo highlight McCrory’s promise during a 2012 gubernatorial campaign debate that he would not sign new restrictions on abortion access -- a promise that he already broke in 2013 -- NARAL Pro-Choice North Carolina, Planned Parenthood’s South Atlantic Action League, Progress NC and other groups are rallying in towns across the state. Accompanying them is a 30-foot billboard truck with a picture of McCrory and the words “Don’t break your promise again.” The tour will culminate with a demonstration at the governor’s mansion on May 11. \n“We find this to be medically unnecessary, we find this to be bad medicine, we find this to be bad law and bad for the people of North Carolina,” Shoshannah Sayers, interim executive director of NARAL Pro Choice North Carolina, said at a Monday rally, according to The Charlotte Observer . \nRepublican supporters of abortion waiting periods argue that they give patients more time to gather information and consider their decision. Democratic opponents contend that such requirements shame and patronize women with the goal of making it more difficult to access the procedure. Medical groups like the American College of Obstetricians and Gynecologists oppose waiting periods, noting that abortion is safer the earlier it’s done. \nMcCrory has not yet said whether he would sign the bill. \nStates passed more abortion restrictions from 2011 through 2013 than during the entire previous decade, following a Republican sweep of state legislatures in the 2010 elections. Also on HuffPost:", "external_links": [], "published": "2015-05-07T17:29:00.000+03:00", "crawled": "2015-05-07T23:23:18.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}