{"organizations": [], "uuid": "4be689fb797e2927db03922c293e29cfaa8507ee", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/092413/0/0/092413_shepvo_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/25/at-un-rowhani-gives-obama-cover-to-delay-delay-delay-on-iran-nukes.html", "country": "", "title": "At UN Rouhani gives Obama cover to delay, delay, delay on Iran's nukes | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "At UN Rouhani gives Obama cover to delay, delay, delay on Iran's nukes | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "4be689fb797e2927db03922c293e29cfaa8507ee"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/25/at-un-rowhani-gives-obama-cover-to-delay-delay-delay-on-iran-nukes.html", "ord_in_thread": 0, "title": "At UN Rouhani gives Obama cover to delay, delay, delay on Iran's nukes | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nPresident Obama’s standing on the world stage took another nosedive Wednesday at the UN General Assembly. According to White House officials, the president of the world’s leading democracy was prepared to shake hands with the president of the world’s leading state sponsor of terrorism – and the terrorist turned the democrat down. \nThe most pathetic part of the episode was that even this snub could not dampen President Obama’s determination to anoint Iranian President Rouhani as a “moderate” and move full steam ahead with a delay strategy that will make an Iranian nuke inevitable. \nObama spoke a few hours before Rouhani, but the two statements were significantly aligned. \nPresident Obama did talk about Syria – tossing another $340 million taxpayer dollars at the problem. He gave every indication, however, that he fully expects a long drawn out war which he will watch closely from the sidelines. \n[pullquote] Iran: Is President Obama looking increasingly desperate? \nInstead, he explained that his actual priorities are twofold: “In the near term, America’s diplomatic efforts will focus on two particular issues: Iran’s pursuit of nuclear weapons and the Arab-Israeli conflict.” \nIn other words, the welfare of the United States depends equally on preventing an Iranian nuclear weapon and ending – what the president called – “the daily indignity of occupation.” Israel’s alleged transgressions are supposedly on a par with Iran’s. \nSure, the president used the usual throw-away line that “Israel is here to stay,” but he went on to give an emotionally-charged statement only about Palestinian “pain.” Despite the fact that just a few days ago, one more Israeli soldier died trying to protect Jewish worshippers – as they have had to do for over 65 years. \nPresident Obama knew full well that his public castigation of Israel was red meat for the shark-filled chamber at the UN. It was, therefore, no accident that he chose the Israel-bashing path as the means to regain lost ground following his Syria debacle. \nHe also recycled his habitual foreign policy formula of apologizing for a host of American sins and insulting his predecessors before the international community. His list of American transgressions – that he had solved or was solving – included: Iraq, Afghanistan, the use of drones, Guantanamo, a shortage of humility, privacy violations and endemic racism. Before he became president, he chided, America was on “a perpetual war footing.” By contrast, he was not a warmonger. \nThe president made passing references to terrorist incidents – the Kenya shopping mall massacre and the Pakistani church bombing – without once mentioning the perpetrators as Muslims operating in the name of radical Islam. \nHe did find time to whine about the fact that the United States is blamed for “meddling” at the same time as it is blamed “for failing to do enough.” Evidently, it went way over his head that the game of blaming America first is not an unintended inconsistency that can be corrected with professorial logic. \nBut it was on the subject of Iran that President Obama was perhaps at his scariest. He drew a straight line between Iranian “mistrust” of America and Americans mistrust of the thugs and murderers in Iran. And anyway, it was merely a “difficult history” – which is bad news for the Americans currently languishing in Iranian prisons and being killed by Iranian-backed terrorists on numerous battlefields. \nThe light on the horizon, cheered the President, was coming from none other than Iran’s Supreme Leader and President Rouhani themselves. Both have said “that the Islamic republic will never develop a nuclear weapon.” \nIn Obama’s view, “These statements…should offer the basis for a meaningful agreement…giving the world confidence that the Iranian program is peaceful.” Except that its program isn’t peaceful. And these statements offer the basis for a one-way trip down the yellowbrick road to an Iranian nuclear bomb. \nNevertheless, Obama announced he was sending Secretary Kerry to dialogue past the finish line. \nLittle wonder, that six hours later, Rouhani took the same stage, made no concessions, threatened Americans and reiterated his regime’s deep-seated anti-Semitism. He advised Obama to cut loose those “warmongering pressure groups” – by which he meant Jews. He lectured that Iran was worried about the “neglect of morality,” omitting the fact that Iranian morality is a house of horrors. \nRouhani claimed that the “realization of democracy” must be “consistent with [his brand of] religion,” that is, no democracy at all. He complained Iran was the victim of terror, not a terrorist sponsor. He pulled an Ahmadinejad, by asserting Palestinians should all return to “their homeland” (so that they can numerically terminate a Jewish state.) \nHe made lots of use of buzz words like hope, moderation and prudence – rightly anticipating that the State Department would eat it up. \nNotwithstanding years of stymieing International Atomic Energy Agency inspectors, and lying about the existence of nuclear facilities, he assured his audience: “Iran’s nuclear program… pursue[s] exclusively peaceful purposes.” The proof? “Nuclear weapons…contradict our religious and ethical convictions.” “Ethical” convictions like sponsoring terrorism, training chemical weapons enthusiasts, and questioning the Holocaust. \nWhen the farcical spectacle was all over, Rouhani had succeeded in providing the Obama administration and the European Union with enough cover to buy into a catastrophic delay. Israel will now face an even more hostile American president, should it decide to go it alone. \nAnne Bayefsky is director of the Touro Institute on Human Rights and the Holocaust. Follow her on Twitter @AnneBayefsky . ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:13:51.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}