{"organizations": ["Fox News Egypt"], "uuid": "fae0d71d44f5a5f73dcf7fa4627b9621afc3ffd1", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/07/09/what-at-stake-if-obama-goes-0-3-with-egypt/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422586056065.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/07/09/what-at-stake-if-obama-goes-0-3-with-egypt.html", "country": "", "title": "What's at stake if Obama goes 0-3 with Egypt | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "What's at stake if Obama goes 0-3 with Egypt | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "fae0d71d44f5a5f73dcf7fa4627b9621afc3ffd1"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/07/09/what-at-stake-if-obama-goes-0-3-with-egypt.html", "ord_in_thread": 0, "title": "What's at stake if Obama goes 0-3 with Egypt | Fox News", "locations": ["Egypt"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Egypt's crisis opens wider debate over democracy's hold after Arab Spring \nObama rushed to supportthe new Muslim Brotherhood government, despite their Islamist heritage. Even after President Morsi began systematically crushing all political opposition, and dismantling Egypt's fledging democracy. \nObama could have named and shamed Morsi's moves, but instead stood silent. The U.S. could have cut off aid, or at least threatened to, but instead we rewarded we Morsi with deliveries of new, advanced weapons. To the majority of Egyptians, Morsi is seen as Obama's man. It's no wonder that today's demonstrators in Tahrir Square blame America. \nMorsi's removal from power not only gives Egyptians a chance for a do-over of their new democracy, it also gives President Obama a third time at bat. But rather than support the new government, Obama's initial reaction is to express \"deep concern\" about Morsi's ouster, and reluctance to stand strongly for U.S. aid and influence. \nSo far, every time the Obama administration has come to bat with Egypt they've struck out. Maybe this time they should take a deep breath and, whatever their initial instincts are, do just the opposite. \nNow is not the time to cut aid, or to stand silently by and let things unfold or the Egyptian revolution be hijacked by anti-democratic forces. \nOur continued aid gives us a seat at the table; the ability to influence the course of events. What Egypt needs now is aid, ours and that of others, to stave off the collapse of the Egyptian economy. It will buy them time and the political space to amend the constitution and form a new, inclusive government, provide security for Egyptian society, and get the economy going again. \nEven so, Egypt may not succeed. But at least the aid will give them the chance. \nSome in Congress have argued that Morsi's ouster was a \"coup\" by the Egyptian military to depose a democratically elected leader, which under U.S. law triggers a suspension of U.S. aid. \nCoup, schmoo. If so, President Obama needs to go to Congress and request a waiver. \nMorsi might have been democratically elected, but so was Hitler. Once elected, Hitler set about systematically crushing anyone who disagreed with him -- in Parliament, in the Courts, in the military, in the media. \nHitler persecuted religious minorities. Morsi was well on his way to doing the same thing in Egypt, sacking opposition leaders, putting his Muslim Brotherhood cronies in power, ignoring Muslim Brotherhood persecution of Christians. \nLooking back, the world would have been a better place if the German military had succeeded in ousting Hitler when they had the chance. Thank goodness the Egyptian military was wiser. \nRight now, the world is focussed on Egypt's political machinations -- was it a \"coup\"? \nWhat will the Muslim Brotherhood do next? What will Obama do? \nBut even in Egypt, \"it's the economy, stupid.\" After just one year in office, the Muslim Brotherhood has so mangled things that the Egyptian economy has gone into free fall. \nPoverty rates have increased one hundred fold.Crime is up -- everything from murder to armed robberies to kidnappings. \nThere are food and fuel shortages with long lines for those with money to buy. Those without money, nearly half the population, have nothing to eat but subsidized bread. \nEgypt is the world's latest importer of wheat, and is running out of foreign reserves to pay for it. And there is little likelihood the economy will improve any time soon to fill the coffers. \nForeign companies aren't investing in Egypt; wealthy Egyptians are getting themselves and their money out; overseas Egyptians aren't sending remittances back home; and tourism has dried up. \nNobody is visiting the pyramids. \nUnless Saudi Arabia and the other wealthy Sunni oil states take out the checkbook, Egyptians could be starving by year's end. \nInterestingly, the two new Egyptian leaders, Defense Minister General al-Sisi, and the interim president, Judge Adly Mansour, have long-standing, close ties with Saudi Arabia. Morsi did not. His first official visit upon assuming office was to visit Tehran and President Ahmedinejad, Saudi Arabia's arch adversary in the region. No wonder Saudi Arabia wasn't interested in providing aid to Egypt Muslim Brotherhood government. \nEven with a massive influx of foreign aid, Egypt may not recover. It still needs to establish security and stability, form an inclusive but effective government, and provide conditions that will allow the economy to recover. \nThe Muslim Brotherhood has waited 80 years for power, and after just one year in office, showed that they were unable to govern. But they will not go quietly into the night. \nSome have vowed \"to die for Morsi\" and start a civil war. They will be no match for the Egyptian Army, so a Syria-style civil war is unlikely, but there is a very real danger the more violent elements of the Brotherhood will team up with the Al Qaeda affiliates who have set up shop in the Sinai Peninsula. From there they could launch terrorist attacks on Egypt proper, threaten the Israeli border, and launch attacks on ships transiting the Suez Canal. \nEgypt's future hangs in the balance, and with it the future of the region. \nForty years ago, my old boss Henry Kissinger negotiated a ceasefire following the 1973 Arab-Israeli War. The key to the peace was flipping Egypt, turning it from an American adversary into a friend, and taking the largest Arab country in the Middle East away from war and towards peaceful growth. \nThat landmark move was accomplished by the unprecedented wisdom and enormous courage of Egyptian President Sadat, the brilliant negotiating skills of the Henry Kissinger, and considerable U.S.economic and military assistance. It bought 40 years of Arab-Israeli peace because, without Egypt, the Arab states couldn't make total war on Israel. \nIf Egypt descends into a cycle of revolution and counter revolution, and ultimately chaos not only will it be a disaster for Egypt, but it will be a tragedy for the entire region. \nKathleen Troia \"K.T.\" McFarland is a Fox News National Security Analyst and host of FoxNews.com's \"DefCon 3.\" She served in national security posts in the Nixon, Ford and Reagan administrations. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:15:26.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}