{"organizations": ["Facebook", "Twitter"], "uuid": "652f96b17b09c9be14790c6176ce25a97fcd690b", "thread": {"site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/politics/2015/05/12/it-official-obama-library-will-be-on-chicago-south-side/", "country": "", "title": "It's official: Obama library will be on Chicago's South Side | Fox News", "performance_score": 2, "site": "foxnews.com", "participants_count": 0, "title_full": "It's official: Obama library will be on Chicago's South Side | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-12T14:15:00.000+03:00", "replies_count": 0, "uuid": "652f96b17b09c9be14790c6176ce25a97fcd690b"}, "author": "", "url": "http://www.foxnews.com/politics/2015/05/12/it-official-obama-library-will-be-on-chicago-south-side/", "ord_in_thread": 0, "title": "It's official: Obama library will be on Chicago's South Side | Fox News", "locations": ["Chicago", "South Side"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "It's official: Obama library will be on Chicago's South Side Published May 12, 2015 Facebook 0 Twitter 0 Email Print \nPresident Obama has decided to build his presidential library on the South Side of Chicago, where his political career began. \nIn a news release, the Barack Obama Foundation announced early Tuesday that the library would be erected on park land that was proposed for the site by the University of Chicago. The site was selected over bids made by Columbia University in New York, the University of Hawaii and the University of Illinois at Chicago. \n\"With a library and a foundation on the South Side of Chicago, not only will we be able to encourage and affect change locally, but what we can also do is to attract the world to Chicago.\" Obama said in a video accompanying the release. \"All the strands of my life came together and I really became a man when I moved to Chicago. That's where I was able to apply that early idealism to try to work in communities in public service. That's where I met my wife. That's where my children were born.\" \nThe decision was hardly a surprise. The University of Chicago's bid was long considered a front-runner, and people with direct knowledge of the decision told The Associated Press and other media nearly two weeks ago that it was the winner. \nBoth the president and first lady once worked at the university, and they still maintain a house near campus. Obama taught constitutional law and worked as a community organizer on the South Side. First lady Michelle Obama is a Chicago native and worked as an administrator at the University of Chicago Medical Center. \n\"Every value, every memory, every important relationship to me exists in Chicago. I consider myself a South Sider,\" Michelle Obama said. \nIn recent weeks, city officials were forced to take extra steps to reassure foundation officials after they expressed concerns the city had not secured public park land that would be used as part of the University of Chicago bid. The City Council passed an ordinance to allow transfer of the land, and state lawmakers passed a bill reinforcing the city's right to use the park land for the Obama library as well as Star Wars creator George Lucas' proposed lakefront museum. \n\"Over the past months, the city has come together to bring the library to its rightful place in Chicago,\" Mayor Rahm Emanuel said in the release. The foundation said it will open offices on Chicago's South Side by the end of the year. \nOne remaining question is how the foundation will select between two properties near campus, Washington Park or Jackson Park, both of which are potential sites under the university plan. \nFoundation Chairman Marty Nesbitt, a friend of Obama, and Emanuel are scheduled to appear at a news conference about the library on Tuesday afternoon. \nThe news release said the University of Chicago's \"has pledged to make resources and infrastructure available to the foundation in the near term for its planning and development work.\" \nMeanwhile, the foundation said it plans to collaborate with each of the other three finalists. It will pursue a long-term presence at Columbia University, work with the state of Hawaii to establish a presence in Honolulu and will also collaborate with the University of Illinois-Chicago. Advertisement ", "external_links": [], "published": "2015-05-12T14:15:00.000+03:00", "crawled": "2015-05-12T14:22:27.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}