{"organizations": ["ISIS"], "uuid": "77c68bae708096605735117cfc0d2babcdd5ea03", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/boehnerjohn_051415gn4.jpg", "site_section": "", "section_title": "", "url": "http://thehill.com/homenews/house/242487-boehner-obama-should-start-over-on-isis-war-powers-request", "country": "", "title": "Boehner: Obama needs to start over on ISIS war powers request | TheHill", "performance_score": 0, "site": "thehill.com", "participants_count": 0, "title_full": "Boehner: Obama needs to start over on ISIS war powers request | TheHill", "spam_score": 0.0, "site_type": "news", "published": "2015-05-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "77c68bae708096605735117cfc0d2babcdd5ea03"}, "author": "", "url": "http://thehill.com/homenews/house/242487-boehner-obama-should-start-over-on-isis-war-powers-request", "ord_in_thread": 0, "title": "Boehner: Obama needs to start over on ISIS war powers request | TheHill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Boehner", "Scott Wong", "Obama", "Julian Hattem"], "text": "Boehner: Obama needs to start over on ISIS war powers request By Scott Wong and Julian Hattem - 05/19/15 11:05 AM EDT \nPresident Obama should scrap his war powers request to fight Islamic terrorists and go back to the drawing board, Speaker John Boehner (R-Ohio) said Tuesday. ADVERTISEMENT “The president’s request for Authorization of Use of Military Force calls for less authority than he has today. Given the fight that we’re in, it’s irresponsible,” Boehner told reporters after huddling with his rank-and-file members.\nBoehner said the president should withdraw the AUMF and \"start over.\" \nBoehner and other GOP lawmakers have long called for Obama to send Congress an AUMF to fight Islamic State in Iraq and Syria (ISIS) terrorists who have wreaked havoc in the Middle East. \nBut when Obama finally sent up his war request in February, Republicans blasted it, saying it lacked an overall strategy and was too restrictive of military commanders. \n“I’ve been calling on the president to develop an overarching strategy to deal with the growing terrorist threat — we don’t have one,” Boehner continued. “And the fact is the threat is growing faster than what we and our allies can do to stop it.” \nISIS fighters attacked and seized Ramadi, the capital of Anbar province in Iraq. \nRep. Adam Schiff (Calif.), the top Democrat on the Intelligence Committee and a supporter of an AUMF, said Tuesday he was “increasingly discouraged” about congressional inaction. \n“We may go down in history as the Congress that largely gave up its role in the war-making process,” Schiff said during a breakfast briefing hosted by The Christian Science Monitor . \n“It matters a great deal to the institution of the Congress what we do because future presidents are going to look back at this and they’re going to say ‘We can make war without a congressional vote,’ ” he added. \n“It will have deep impact on our institutional role and our ability to serve as a meaningful check and balance on presidents’ ability to make war.” Tags: ", "external_links": [], "published": "2015-05-19T03:00:00.000+03:00", "crawled": "2015-05-19T22:23:07.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}