{"organizations": [], "uuid": "f1d3a8643062c6ac6aeaef993d933e27757e490b", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obamabaracknike05082015getty.jpg", "site_section": "http://thehill.com/rss/syndicator/19109#", "section_title": "TheHill - The Hill News", "url": "http://thehill.com/homenews/administration/241474-liberal-labor-groups-fume-as-obama-hails-free-trade-at-nike", "country": "US", "title": "Liberal, labor groups fume as Obama hails free trade at Nike", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Liberal, labor groups fume as Obama hails free trade at Nike", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T21:38:00.000+03:00", "replies_count": 0, "uuid": "f1d3a8643062c6ac6aeaef993d933e27757e490b"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/241474-liberal-labor-groups-fume-as-obama-hails-free-trade-at-nike", "ord_in_thread": 0, "title": "Liberal, labor groups fume as Obama hails free trade at Nike", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Liberal, labor groups fume as Obama hails free trade at Nike Getty Images By Jordan Fabian - 05/08/15 02:38 PM EDT \nLiberal groups are fuming over President Obama’s decision pitch his trade agenda at Nike’s headquarters. \nMany on the left say that the global shoe and apparel manufacturer is the poster child for what’s wrong with the Trans-Pacific Partnership (TPP) deal Obama is negotiating with 11 other Pacific nations. ADVERTISEMENT The company has long faced accusations of using sweatshop labor in Asia to make its products, and trade critics argue the new trade deals would make it even easier for U.S. companies to exploit cheap overseas labor. \n“It is sad to see how detached from reality President Obama is when it comes to TPP,” said Murshed Zaheed, deputy political director at CREDO. “The symbolism of his speech is staggering — the Nike brand was built by outsourcing manufacturing to sweatshops in Asia.” \nPresident Obama took on his Democratic critics, calling them “wrong” in his speech at the company's headquarters and pushing Congress to grant him fast-track authority to finalize the TPP deal. \n“On trade, I actually think some of my dearest friends are wrong. They're just wrong,” Obama said of opposition to the Trans-Pacific Partnership (TPP) trade deal. “This is the most progressive trade deal in history.” \nNike bolstered Obama’s trade push Friday, announcing the deal would allow it to begin making its products in the U.S., which would result in 10,000 new manufacturing and engineering jobs. The company has said it has reformed its labor practices in nations like Vietnam. \nBut labor groups are not sold. They cast doubt on Nike’s pledge to create thousands of new jobs in the U.S. \nThe AFL-CIO, the nation's largest labor coalition, questioned Nike's pledge to create thousands of jobs in the United States. \n“We have heard similar promises from companies before, and very few have panned out,” said the group's Communications Director Eric Hauser. “Decades of experience have taught us that corporate-driven trade policy too often accelerates a global race to the bottom.” \nNike employs 26,000 workers in the U.S. now, but labor groups point out that’s only a small fraction of its overall workforce. \n“With less than 1 percent of its more than 1 million production jobs located in the United States, Nike perfectly depicts America’s lost-jobs, low-wage future under the Trans-Pacific Partnership,” Elizabeth Swager, director of the Oregon Fair Trade Campaign, said in a statement. \nLori Wallach, Global Trade Watch director at Public Citizen, said Nike's jobs pledge “pales in comparison to the U.S. jobs that would be lost under the TPP’s offshoring incentives.” \n“The only thing weaker than sweatshop-king Nike's empty promises is the White House's willingness to hype them as a victory in its push for a trade deal that will make it easier for other huge corporations to ship more U.S. jobs overseas, sell tainted food products in our supermarkets, and challenge our laws in foreign tribunals,” said Charles Chamberlain, executive director of Democracy for America. Tags:", "external_links": [], "published": "2015-05-08T21:38:00.000+03:00", "crawled": "2015-05-08T22:56:48.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}