{"organizations": ["Public Religion Research Institute", "Fifth Circuit Court of Appeals", "Republican", "Council of Economic Advisers", "USA Today", "Social Security Administration", "Congressional Budget Office", "5th Circuit Court of Appeals", "Supreme Court"], "uuid": "6392981c8b931aa4b7e8bcab797903e60d0d3331", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/141119222644-immigration-reform-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss\r", "section_title": "CNN.com Recently Published/Updated", "url": "http://edition.cnn.com/2015/05/29/health/cut-the-cord/index.html", "country": "US", "title": "A delay for Obama's immigration action (Opinion)", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "A delay for Obama's immigration action (Opinion)", "spam_score": 0.0, "site_type": "news", "published": "2015-05-30T01:23:00.000+03:00", "replies_count": 0, "uuid": "ab6a65143360c22334f0689eca72278dbac083a7"}, "author": "", "url": "http://edition.cnn.com/2015/05/29/opinions/reyes-immigration-reform/index.html", "ord_in_thread": 0, "title": "A delay for Obama's immigration action (Opinion)", "locations": ["Washington", "U.S.", "Arizona", "Texas", "Louisiana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Arpaio", "Abbott", "Ronald Reagan", "Raul A. Reyes", "Raul Reyes", "George W. Bush", "Greg Abbott", "Jennifer Elrod", "Dwight D. Eisenhower", "Jerry E. Smith", "Obama"], "text": "Appeals court blocks immigration action 01:57 Story highlights This week, a Louisiana court handed another setback to the Obama administration's executive action on immigration Raul Reyes: The ruling means that our immigration system will continue to be dysfunctional for the near future Raul A. Reyes is an attorney and member of the USA Today board of contributors. Follow him on Twitter @RaulAReyes . The opinions expressed in this commentary are solely those of the author. (CNN) This week, a Louisiana court handed another setback to the Obama administration's executive action on immigration. In a 2-1 decision, a panel of the Fifth Circuit Court of Appeals refused to lift a Texas court's February decision blocking the President's new immigration programs. As a result, the 5 million undocumented immigrants who are eligible for temporary deportation relief and work authorization will have to wait as the battle over Obama's executive action winds its way through the courts. Although the legal maneuvering surrounding Obama's executive action is convoluted, this game is far from over. The President still has a strong case for his executive action. His proposed immigration policies remain the right thing to do for the country. The legal battles over executive action are not easy to understand, especially since they are already being mischaracterized by the Obama administration's opponents. \"Texas just won the executive amnesty case at the 5th Circuit Court of Appeals. The Constitution wins,\" Texas Gov. Greg Abbott tweeted in response to Tuesday's decision. Raul Reyes However, this case is not about \"amnesty.\" No one will get amnesty, citizenship, or even a green card through Obama's executive action. Executive action is about immigration enforcement priorities; it allows certain groups of people to go to the back of the line for deportation. Abbott's use of the loaded \"A-word\" is an attempt to mislead people into thinking our President is lawlessly allowing undocumented immigrants into the country. This week's decision dealt with the question of whether Obama's immigration programs could proceed while they are being challenged in court. This was a procedural ruling that did not dig into the larger issue of whether the President's executive action was legal. Nor was it unexpected. As an article on ThinkProgress noted, \"The 5th Circuit is considered one of the most conservative court of appeals in the country, and the two judges who ruled against the Obama administration are two of its most conservative judges.\" Ironically, both these judges were appointed by Republican presidents who took their own executive action on immigration. Judge Jerry E. Smith was appointed by Ronald Reagan, who announced in 1987 that minor children of newly naturalized citizens would not be deported. Judge Jennifer Elrod was appointed by George W. Bush, who in 2002 sped up the naturalization process for green card holders who served in the military. Then again, it would be hard to find a federal judge who was not appointed by a president who took executive action on immigration. Presidents of both political parties have been doing this as far back as Dwight D. Eisenhower. The practical result of Tuesday's ruling is significant. It means that our immigration system will continue to be dysfunctional for the near future. It means that immigrant families and their communities will continue to live with economic and social instability. It means that immigration authorities will continue to waste time, money and resources on deporting undocumented housekeepers and restaurant workers, rather than focusing on violent criminals and gang members. Our country will pay an economic cost for inaction on immigration as well. The Congressional Budget Office, the Social Security Administration, and the Council of Economic Advisers have all reported on the economic benefits of executive action. We're losing tremendous contributions to tax revenues and GDP, all because Republican governors are anti-immigrant and anti-Obama. Meanwhile, a February poll by the Public Religion Research Institute found that nearly three-quarters of the public favor the goals of President Obama's executive action. True, this week's court ruling is bad news for the Obama administration. The dissenting judge in this case was correct to note \"the political nature of this dispute.\" The government's case on the merits is strong. The Supreme Court has been clear, most recently in U.S. v. Arizona (2012) that the federal government has broad discretion over immigration enforcement. Two separate lower court rulings also support the Obama administration's position. Last year, a federal judge in Washington tossed out a lawsuit by Arizona Sheriff Joe Arpaio challenging Obama's authority to act unilaterally on immigration. In April, the 5th Circuit itself ruled against a group of immigration agents who sued over the President's 2012 Deferred Action plan (as the dissenting judge pointed out in his opinion, the decision yesterday went against the court's own past rulings). So don't count the Obama administration out on immigration just yet. This week's ruling on executive action should rightfully be seen as a delay -- not a defeat.", "external_links": [], "published": "2015-05-30T01:23:00.000+03:00", "crawled": "2015-05-30T02:21:10.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}