{"organizations": [], "uuid": "c5adae67e6218790043a8402d522da26483a4981", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/assets/0/0/jointchief660.jpg", "site_section": "http://feeds.foxnews.com/foxnews/latest", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/us/2015/05/05/marine-general-joseph-dunford-jr-chosen-joint-chiefs-chairman/", "country": "US", "title": "NEW MAN IN CHARGE Obama to tap Marine Corps general as Joint Chiefs chair", "performance_score": 3, "site": "foxnews.com", "participants_count": 1, "title_full": "NEW MAN IN CHARGE Obama to tap Marine Corps general as Joint Chiefs chair", "spam_score": 0.0, "site_type": "news", "published": "2015-05-05T07:48:00.000+03:00", "replies_count": 0, "uuid": "c5adae67e6218790043a8402d522da26483a4981"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/us/2015/05/05/marine-general-joseph-dunford-jr-chosen-joint-chiefs-chairman/", "ord_in_thread": 0, "title": "NEW MAN IN CHARGE Obama to tap Marine Corps general as Joint Chiefs chair", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marine General Joseph Dunford chosen as Joint Chiefs chairman Published May 05, 2015 Facebook 0 Twitter 0 Email Print March 12, 2014: File photo, Gen. Joseph F. Dunford, Jr. testifies on Capitol Hill in Washington. (AP Photo/Carolyn Kaster, File) \nU.S. officials said Monday that President Obama will nominate Marine Gen. Joseph Dunford Jr. as the next chairman of the Joint Chiefs of Staff. \nA combat-hardened commander, Dunford led the Afghanistan war coalition during a key transition in 2013-2014 and has served as an infantry officer at all levels. \nThe move cuts short Dunford's service as the commandant of the U.S. Marine Corps, a job he began last October. But the rapid promotion is one of several that have marked Dunford's fast-tracked military career, which saw him leap from a one-star brigadier general to four stars in about three years. \nObama is tapping Air Force Gen. Paul J. Selva, a pilot and current head of U.S. Transportation Command, to be vice chairman. \nA defense official told Fox News that a formal announcement is expected at the White House Tuesday. \nDunford has been a leading contender for the chairman's job for months, and his time in the commandant's post was critical. Generally, to be considered for the chairman's job an officer must serve as the head of one of the Pentagon's combatant commands or as chief of one of the military services. \nDunford's most visible role came in 2013 when he was chosen to take over the job as top U.S. military commander in Afghanistan. During his 18 months there, Dunford oversaw the ongoing drawdown of U.S. troops, the transition to Afghan military lead in combat operations, and the tumultuous Afghan elections that dragged on and stalled efforts to reach an agreement on the U.S. military's future presence in the country. \nHe left Afghanistan last August, preparing to take on his new role as commandant. \nDunford's rise through the ranks has been rapid, particularly compared to many of his peers, who would normally spend several years at each rank before getting promoted. \nIn December 2007, he was nominated for a second star, and the rank of major general. But just two months later, before he actually got the formal promotion, he got the nod for a third star and was appointed the deputy Marine Corps commandant, effectively skipping the two-star grade entirely. He held the rank of lieutenant general (three stars) for about two years, until President Barack Obama appointed him as assistant commandant of the Marine Corps in October 2010, earning him a fourth star. \nDunford, 59, is a Boston native and is a graduate of the U.S. Army Ranger School, Marine Amphibious Warfare School, and the U.S. Army War college. He also holds Master's degrees in government from Georgetown University and international relations from Tufts University's Fletcher School of Law and Diplomacy. \nFox News' Jennifer Griffin and The Associated Press contributed to this report", "external_links": [], "published": "2015-05-05T07:48:00.000+03:00", "crawled": "2015-05-05T08:30:24.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}