{"organizations": [], "uuid": "6d8d69e7315e1832a723561264c1683f08297d7e", "thread": {"site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/obama_052015getty.jpg", "site_section": "http://thehill.com/index.php?option=com_rss-syndicator&feed_id=73", "section_title": "TheHill - E2-Wire Blog", "url": "http://thehill.com/homenews/administration/242672-obama-climate-deniers-endangering-national-security", "country": "US", "title": "Obama: Climate deniers endangering national security", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Obama: Climate deniers endangering national security", "spam_score": 0.0, "site_type": "news", "published": "2015-05-20T19:56:00.000+03:00", "replies_count": 0, "uuid": "6d8d69e7315e1832a723561264c1683f08297d7e"}, "author": "Jordan Fabian", "url": "http://thehill.com/homenews/administration/242672-obama-climate-deniers-endangering-national-security", "ord_in_thread": 0, "title": "Obama: Climate deniers endangering national security", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama: Climate deniers endangering national security Getty Images By Jordan Fabian - 05/20/15 12:56 PM EDT \nPresident Obama in a speech on Wednesday cast climate change as a growing national security threat, accusing Republican skeptics of harming military readiness by denying its effects. ADVERTISEMENT Obama argued in his address to graduates at the United States Coast Guard Academy that rising sea levels and higher global temperatures endanger military bases and could force personnel to respond to conflicts around the world that are fueled by their effects.\n“Climate change constitutes a serious threat to global security, an immediate risk to our national security, and, make no mistake, it will impact how our military defends our country,” Obama told new Coast Guard officers at the academy’s New London, Conn., campus. “And so we need to act — and we need to act now.” \nObama has highlighted security implications of climate change in recent months to drum up more support for his efforts to invest in climate adaptation and reduce greenhouse gases, including a landmark regulation to limit carbon emissions from power plants. \nRepublicans in Congress, however, have stymied legislative action on climate change. The president took aim at GOP critics, saying that temperatures are rising even though “some folks back in Washington” refuse to admit it. \n“Denying it, or refusing to deal with it, endangers our national security and undermines the readiness of our forces,” Obama added. \nHe also questioned how Republicans could claim to support the military while downplaying the effects of global warming. \n“Politicians who say they care about military readiness ought to care about this as well,\" he said. \nObama claimed the rise of Boko Haram in Nigeria and the civil war in Syria were both fueled by instability caused by severe drought and crop losses connected to rising temperatures. \nIn addition to the international problems that global warming can cause, Obama argued the effects threaten military facilities and readiness. \nHe pointed to street flooding in Miami and Charleston, S.C. as evidence that American infrastructure in coastal areas, such as roads and power plants, are vulnerable. The same is true for military bases in places like Norfolk, Va., where flooding has also occurred, he added. \n\"It’s estimated that a further increase in sea level of one foot by the end of this century could cost our nation $200 billion,” Obama said. \nThe president touted his efforts to reduce carbon emissions, through more-stringent vehicle fuel standards, new EPA regulations, and his pursuit of an international agreement to reduce greenhouse gases. \nRefusing to act would be a “dereliction of duty,” Obama said. \n“It will not be easy, it will require sacrifice and the politics will be tough, but there is no other way,\" he said. “This will be tough, but so often is the case, our men and women in uniform will show us the way.\" \nSen. Jim Inhofe (R-Okla.) blasted Obama for calling climate change a national security threat, saying it shows the president lacks a coherent strategy to deal with the Islamic State of Iraq and Syria, the Syrian civil war and North Korea. \n“It’s no wonder that our military personnel's trust in their commander-in-chief is at an all time low,” the senator said in a statement. “The president’s speech at the Coast Guard Academy stating his belief that climate change poses the greatest threat to future generations is a severe disconnect from reality.” \nInhofe famously threw a snowball on the Senate floor in February to protest the administration’s climate agenda. Tags:", "external_links": [], "published": "2015-05-20T19:56:00.000+03:00", "crawled": "2015-05-20T20:11:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}