{"organizations": [], "uuid": "a93551367bef629170293f7dcb50528231c07062", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/thumbnails/i/091013/0/0/091013_sr_griffin_640.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/09/11/weakening-america-obama-and-benghazi-one-year-later.html", "country": "", "title": "The weakening of America -- Obama and Benghazi one year later | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "The weakening of America -- Obama and Benghazi one year later | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "a93551367bef629170293f7dcb50528231c07062"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/09/11/weakening-america-obama-and-benghazi-one-year-later.html", "ord_in_thread": 0, "title": "The weakening of America -- Obama and Benghazi one year later | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mother of Benghazi attack victim faults US investigation \nKhattala has good reason to feel safe. Over the course of the past year, Obama administration officials have gone from falsely blaming the Benghazi assault on an obscure YouTube video about Mohammed (current National Security Advisor Susan Rice) to whining “what difference does it make” (former Secretary of State Hillary Clinton) to, finally, throwing their hands in the air and dismissing Benghazi altogether as just another GOP-driven “phony scandal” (President Obama himself). \nYes, Ahmed Khattala must be quaking in his sandals. \nThe multiple lies, cover-ups and brazen disinterest on the part of the Obama administration in seeking justice for Stevens and his colleagues comprise one of the most shameful episodes in the history of American foreign policy. Perhaps the most maddening aspect of the Benghazi siege—again, a premeditated terror attack by an Al Qaeda linked outfit on a U.S. consulate that left four Americans dead—is that we’ll likely never get some of the more crucial questions surrounding it answered. \nJust where was President Obama as the entire seven-hour-plus ordeal was unfolding? \nWhose idea was it to concoct the YouTube clip lie and parade Rice in front of a national television audience to trumpet it five days after the attack? \nWhy did the CIA reportedly have dozens of personnel on the ground in Benghazi the night of the attack? \nWhy is the Obama administration going to such great lengths to suppress any testimony about Benghazi? \nVirginia Congressman Frank Wolf, for one, has charged that the administration may have been supplying weapons gathered in Libya to Syrian rebels and is seeking to cover its tracks. That would help explain the CIA assets on the ground in Benghazi. \nWolf’s theory makes a lot of sense, given the fondness the Obama White House has shown for supporting Islamist revolutionaries everywhere from Egypt to, ironically enough, Libya. \nThis decision to back—even arm—radical Islamists is a stunning turn of events. \nToday, on September 11, 2013, one year after the Benghazi attack and just twelve years removed from 9/11, the U.S. government is throwing its weight behind forces—whether Al-Qaeda types in Syria or Muslim Brotherhooders in Egypt and elsewhere—that share the exact same totalitarian, anti-American ideology as the jihadists who brought down the Twin Towers. \nWhich begs the question: what exactly do we have to show for twelve years of American blood and treasure expended in the War on Terror? \nPresident Obama’s willfully misleading claims during the 2012 campaign season that Al Qaeda was “on the run” and “nearing defeat” notwithstanding, AQ and its allies and affiliates now cover more geographical ground than they did on 9/11: from Pakistan and Iraq to Syria, Yemen, Somalia, Libya, North Africa, Sinai, Nigeria, Algeria, Europe and beyond. \nLikewise, Al Qaeda’s ideology has inspired a generation of young followers in the West, resulting in the kind of terror and mayhem we saw unleashed by the Tsarnaev brothers in Boston last April. \nAt the same time, the world’s leading state sponsor of terrorism, Iran, continues its march towards nuclear weapons and along with its jihadist proxy, Hezbollah, is establishing a presence throughout Latin America, at our very doorstep. \nIn addition, while the Muslim Brotherhood may be down in Egypt right now, it is anything but out. The world’s first modern Islamist terrorist organization has affiliates in some 70 countries worldwide and remains wildly influential, including among Muslim communities here in the United States. \nFrom closing down U.S. embassies en masse last month, to farming out its Syria policy to Putin’s Russia, to propping up the Morsi dictatorship in Egypt and throwing Israel under the bus at every turn, the Obama administration has projected stunning weakness, uncertainty and ignorance and overseen a series of foreign policy disasters that have whittled down America’s influence in the Middle East to almost nil. \nAnd thanks to the Benghazi debacle, our enemies now believe that American blood comes cheap. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:12:17.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}