{"organizations": [], "uuid": "691dd7635d9a03c9e7cbd5db9a4aab53a8c75228", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/051815_anr_herridge_640.jpg", "site_section": "http://feeds.feedburner.com/feedburner/HFUW", "section_title": "FOXNews.com", "url": "http://www.foxnews.com/politics/2015/05/18/military-intel-predicted-rise-isis-in-2012-detailed-arms-shipments/", "country": "US", "title": "Military intel warned of ISIS threat in 2012 — but was Obama in the loop?", "performance_score": 10, "site": "foxnews.com", "participants_count": 1, "title_full": "Military intel warned of ISIS threat in 2012 — but was Obama in the loop?", "spam_score": 0.0, "site_type": "news", "published": "2015-05-18T23:12:00.000+03:00", "replies_count": 0, "uuid": "691dd7635d9a03c9e7cbd5db9a4aab53a8c75228"}, "author": "foxnewsonline@foxnews.com (Fox News Online)", "url": "http://www.foxnews.com/politics/2015/05/18/military-intel-predicted-rise-isis-in-2012-detailed-arms-shipments/", "ord_in_thread": 0, "title": "Military intel warned of ISIS threat in 2012 — but was Obama in the loop?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print \nSeventeen months before President Obama dismissed the Islamic State as a \"JV team,\" a Defense Intelligence Agency report predicted the rise of the terror group and likely establishment of a caliphate if its momentum was not reversed. \nWhile the report was circulated to the CIA, State Department and senior military leaders, among others, it's not known whether Obama was ever briefed on the document. \nThe DIA report, which was reviewed by Fox News, was obtained through a federal lawsuit by conservative watchdog Judicial Watch. Documents from the lawsuit also reveal a host of new details about events leading up to the 2012 Benghazi terror attack -- and how the movement of weapons from Libya to Syria fueled the violence there. \nThe report on the growing threat posed by what is now known as the Islamic State was sent on Aug. 5, 2012. \nThe report warned the continued deterioration of security conditions would have \"dire consequences on the Iraqi situation,\" and huge benefits for ISIS -- which grew out of Al Qaeda in Iraq. \n\"This creates the ideal atmosphere for AQI (Al Qaeda in Iraq) to return to its old pockets in Mosul and Ramadi,\" the document states, adding \"ISI (Islamic State of Iraq) could also declare an Islamic state through its union with other terrorist organizations in Iraq and Syria, which will create grave danger in regards to unifying Iraq and the protection of its territory.\" \nISIS would, in June 2014, go on to declare a caliphate in territory spanning Iraq and Syria, in turn drawing more foreign fighters to their cause from around the world. \nCLICK TO READ THE DOCUMENTS GIVEN TO JUDICIAL WATCH FROM THE DEFENSE DEPARTMENT AND STATE DEPARTMENT . \nAlso among the documents is a heavily redacted DIA report that details weapons operations inside Libya before the 2012 terror attack in Benghazi. The Oct. 5, 2012 report leaves no doubt that U.S. intelligence agencies were fully aware that lethal weapons were being shipped from Benghazi to Syrian ports. \nThe report said: \"Weapons from the former Libya military stockpiles were shipped from the Port of Benghazi, Libya to the Port of Banias and the Port of Borj Islam, Syria. The weapons shipped during late-August 2012 were Sniper rifles, RPG's, and 125 mm and 155 mm howitzers missiles.\" \nCurrent and former intelligence and administration officials have consistently skirted questions about weapons shipments, and what role the movement played in arming extremist groups the U.S. government is now trying to defeat in Syria and Iraq. \nIn an interview with Fox News' Bret Baier broadcast May 11, former Acting CIA Director Michael Morell, deflected questions: Baier: Were CIA officers tracking the movement of weapons from Libya to Syria? Morell: I can't talk about that. Baier: You can't talk about it? Morell: I can't talk about it. Baier: Even if they weren't moving the weapons themselves, are you saying categorically that the U.S. government and the CIA played no role whatsoever in the movement of weapons from Libya ... Morell: Yes. Baier: -- to Syria? Morell: We played no role. Now whether we were watching other people do it, I can't talk about it. \nWhile the DIA report was not a finished intelligence assessment, such Intelligence Information Reports (IIRs) are vetted before distribution, a former Pentagon official said. \nThe October 2012 report may also be problematic for Hillary Clinton, who likewise skirted the weapons issue during her only congressional testimony on Benghazi in January 2013. In an exchange with Sen. Rand Paul, R-Ky., who is now a Republican candidate for president, the former secretary of state said, \"I will have to take that question for the record. Nobody's ever raised that with me.\" \nReferring to Fox News' ongoing reporting that a weapons ship, Al Entisar, had moved weapons from Libya to Turkey in September 2012, Paul responded, \"It's been in news reports that ships have been leaving from Libya and that they may have weapons.\" He asked whether the CIA annex which came under attack on Sept. 11, 2012 was involved in those shipments. \nClinton answered: \"Well, senator, you'll have to direct that question to the agency that ran the annex. I will see what information is available.\" \nIn a follow-up letter , the State Department Office of Legislative Affairs provided a narrow response to the senator's question, and did not speak to the larger issue of weapons moving from Libya to Syria. \n\"The United States is not involved in any transfer of weapons to Turkey,\" the February 2013 letter from Thomas B. Gibbons, acting assistant secretary of state for legislative affairs, said. \nHeavily redacted congressional testimony, declassified after the House intelligence committee Benghazi investigation concluded, shows conflicting accounts were apparently given to lawmakers. \nOn Nov. 15 2012, Morell and Director of National Intelligence James Clapper testified \"Yes\" on whether the U.S. intelligence community was aware arms were moving from Libya to Syria. This line of questioning by Republican Rep. Devon Nunes, who is now the intelligence committee chairman, was shut down by his predecessor Mike Rogers, R-Mich., who said not everyone in the classified hearing was \"cleared\" to hear the testimony, which means they did not have a high enough security clearance. \nAn outside analyst told Fox News that Rogers' comments suggest intelligence related to the movement of weapons was a \"read on,\" and limited to a very small number of recipients. \nSix months later, on May 22, 2013, Rep. Mac Thornberry, R-Texas, now chairman of the House Armed Services Committee, asked if the CIA was \"monitoring arms that others were sending into Syria.\" Morell said, \"No, sir.\" \nThe Judicial Watch documents also contain a DIA report from Sept. 12, 2012. It indicates that within 24 hours of the attack that killed Ambassador Chris Stevens, Foreign Service Officer Sean Smith, and former Navy SEALs Tyrone Woods and Glen Doherty at the CIA annex, there were strong indicators that the attack was planned at least a week in advance, and was retaliation for a June 2012 drone strike that killed an Al Qaeda strategist -- there is no discussion of a demonstration or an anti-Islam video, which were initially cited by the Obama administration as contributing factors. \n\"The attack was planned ten or more days prior to approximately 01 September 2012. The intention was to attack the consulate and to kill as many Americans as possible to seek revenge for the US killing of Aboyahiye (Alaliby) in Pakistan and in memorial of the 11 September 2001 attacks on the World Trade Center buildings.\" \nThe DIA report also states a little-known group, \"Brigades of the Captive Omar Abdul Rahman,\" claimed responsibility, though the group has not figured prominently in previous congressional investigations. The document goes on to say the group's leader is Abdul Baset, known by the name Azuz, \"sent by (Al Qaeda leader Ayman al-Zawahiri) to set up Al Qaeda bases in Libya.\" \n\"The Obama administration says it was a coincidence that it occurred on 9/11. In fact, their intelligence said it wasn't a coincidence and in fact specifically the attack occurred because it was 9/11,\" Judicial Watch President Tom Fitton told Fox News. \nCatherine Herridge is an award-winning Chief Intelligence correspondent for FOX News Channel (FNC) based in Washington, D.C. She covers intelligence, the Justice Department and the Department of Homeland Security. Herridge joined FNC in 1996 as a London-based correspondent. Advertisement", "external_links": [], "published": "2015-05-18T23:12:00.000+03:00", "crawled": "2015-05-18T23:55:46.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}