{"organizations": ["Fox News"], "uuid": "313f5b95577d39f266211590e65ee93ae1c19cd4", "thread": {"site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/images.foxnews.com/content/fox-news/opinion/2013/06/18/barack-obama-my-deluded-pen-pal/_jcr_content/par/featured-media/media-1.img.jpg/0/0/1422578399626.jpg?ve=1&tl=1", "site_section": "", "section_title": "", "url": "http://www.foxnews.com/opinion/2013/06/18/barack-obama-my-deluded-pen-pal.html", "country": "", "title": "Barack Obama -- my deluded pen pal | Fox News", "performance_score": 0, "site": "foxnews.com", "participants_count": 0, "title_full": "Barack Obama -- my deluded pen pal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-05-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "313f5b95577d39f266211590e65ee93ae1c19cd4"}, "author": "", "url": "http://www.foxnews.com/opinion/2013/06/18/barack-obama-my-deluded-pen-pal.html", "ord_in_thread": 0, "title": "Barack Obama -- my deluded pen pal | Fox News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama"], "text": "\n[pullquote] \nThis is classic Obama rhetoric. Employment figures are low. Manufacturing is down. Workers are earning less money. \nRather than accept any blame for the weak economy, Obama continually points a finger at Republicans -- specifically corporate America and Congress, and in this particular situation he has cast Bain Capital as the villain. \nRather than making an effort to unite our country, President Obama has instead embarked on a mission of polarization, which is clearly evident given the content of his emails. \nI researched what actually took place at the Guitar Center and their labor problems are standard in today's declining retail industry. \nGuitar Center workers asked for higher salaries and a better commission structure -- a typical labor/management issue that is anything but controversial. \nIf President Obama really thinks he is going to start a national groundswell based on the issues of 42 retail employees in a New York City music store, then America's economic stagnation will surely continue. \nI believe Obama continues to follow this course of action because he is and always will be nothing more than a community organizer. \nAccording to Wikipedia, \"Community organizing is a process where people who live in proximity to each other come together into an organization that acts in their shared self-interest. Unlike those who promote more-consensual community building , community organizers generally assume that social change necessarily involves conflict and social struggle in order to generate collective power for the powerless.\" (Although some people don't cite Wikipedia as a primary reference source, I consider this a first-rate definition) \nIn political terms I regard community organizing to be nothing more than preaching to the choir. It is impossible for Obama to unite a nation when his sole mission is to only acknowledge his followers, who (based on the election) comprise 51% of the country. (Perhaps less given recent opinion polls.) \nWith regard to governmental change, community organizing may be effective at a local level for city councilmen or possibly members of congress, but on a national level it is about as useful as promoting a Beyoncé concert by handing out xeroxed flyers on a street corner. \nWhen Obama first ran for president, he campaigned that he would deliver \"hope and change,\" yet now according to his weekly emails \"we\" or \"you\" are the ones responsible for inducing change in America. \nAmerican politics has always been driven by bipartisan agreements reached as a result of negotiations. \nCompromise is a vital aspect to a president's success in working with Congress, yet Obama, based on his limited experience as a community organizer, sees compromise as failure. \nConsider my May 29, 2013 email from President Obama: \nSubject line: \"Hey\" \n\"Rob -- \n1,332 days. That's how many days I have left as president. If you factor in the political circus around the midterm elections and eventually the next presidential campaign getting started, the days to focus Congress and the media on the work that needs doing are even fewer. My administration can do many things at once: Right now, public servants are doing everything from helping people find jobs, to researching cures, to keeping us safe. And you and people like you across the country can mobilize around many issues at once -- immigration reform, gun safety, climate change, marriage equality. But here's the thing: Our opponents know that Congress and the media tend to focus on one thing at a time. \nMore importantly, they know that if they can amplify or invent anything that distracts from our agenda, that's one more day burned off the clock. \nThat's their strategy. Ours must be to not get distracted. The stakes are too high, and the time is too short.\" \nThis manipulative message presents no plan of action, and like Obama's other correspondence, it blames congress and the media for his failures as a leader. It's no secret that President Obama considers Washington politics \"abhorrent,\" so his email responses are restricted to his myopic world view, where he continually retreats to the only limited comfort zone he knows -- Community Organizer. \nOtherwise, when Obama has been forced to deal with the job requirements of actually being president of the United States of America, his behavior has been petty, intractable and thin- skinned. \nHe is offended when confronted with other parties who disagree with him and rather than attempting to reach an accord between two groups his approach is to always generate acrimony. \nIt's President Obama's responsibility to work with Congress, not mine or anyone else on his email list, yet based on his messages, he is oblivious to the fact that we're all too busy earning a living to do his job! \nThe tragic irony is that President Obama, who could easily transcend being a community organizer, doesn't appear to really enjoy or aspire to be anything else. \nHere is a sampling of some other subject lines I've received from the leader of the free world and his organizations: Gotta know if you're in (Asking if I'm ready to keep fighting for change) Today: Rally & march for fast food workers You can be damned sure this isn't going to stop: (About organizations disagreeing with Obama) Start a petition? (Their suggestion as to how to \"fix\" Washington) Rush Limbaugh is on the run! Don't let him escape! (Stop Rush from moving to WOR radio in NYC) \nIf this useless method of ward politics is how Obama and his brain trust hopes to galvanize the nation, then it's no surprise that we are mired in a series of scandals. \nNero continues to fiddle while Rome burns. \nRob Taub is a writer and comedian. He is host of Tech Hub on WOR AM radio. ", "external_links": [], "published": "2015-05-08T03:00:00.000+03:00", "crawled": "2015-05-10T01:18:12.000+03:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}